[
  {
    "information_requirement": "Has the adversary attempted to access credentials from LSASS memory?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003.001",
        "name": "LSASS Memory",
        "evidence": [
          {
            "description": "Execution of a process whose file hash matches a known LSASS dumping utility or malicious Security Support Provider (SSP) DLL.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) and extract the file hash of the new process. Correlate this hash against a continuously updated threat intelligence feed of known malicious file hashes associated with tools like Mimikatz, procdump variants, or malicious SSP DLLs (e.g., mimilib.dll). An exact match provides a high-confidence indicator of malicious activity."
          },
          {
            "description": "Execution of command-line arguments specific to known LSASS dumping tools or techniques, including the abuse of legitimate system utilities.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) and their command-line arguments. Use regular expressions to search for patterns associated with LSASS dumping, such as: 'procdump.exe' with 'lsass' in the command line; 'rundll32.exe comsvcs.dll, MiniDump'; PowerShell commands containing 'Invoke-Mimikatz' or 'sekurlsa::'; or direct use of 'taskmgr.exe /d lsass.exe'. Flagging these specific patterns indicates the use of known credential dumping techniques."
          },
          {
            "description": "Modification of LSA registry keys to add an unsigned or non-standard Security Support Provider (SSP) DLL, particularly one located in a temporary or user-writable directory.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for registry value modifications (Windows Event ID 4657) to 'HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Security Packages'. Maintain a baseline list of legitimate, expected SSP DLLs for the environment. Alert on any modification that adds a new DLL to this list. Further investigate the added DLL's properties, flagging any that are unsigned, have low prevalence across the environment, or are located in suspicious paths like C:\\Users\\, C:\\Temp\\, or C:\\Windows\\Temp\\."
          },
          {
            "description": "Anomalous process access to lsass.exe memory by a process that is not on an established baseline of legitimate system processes or is initiated by an unusual parent process.",
            "data_sources": [
              "Windows Event ID 4656",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable object access auditing on the lsass.exe process. Monitor for handle requests (Windows Event ID 4656) and subsequent object access events (Windows Event ID 4663) targeting lsass.exe, focusing on high-risk access masks like 0x1010 (PROCESS_VM_READ) or 0x1410 (adds PROCESS_DUP_HANDLE). Establish a baseline of legitimate source processes (e.g., csrss.exe, wininit.exe) and their typical parent processes (from Event ID 4688). Use frequency analysis and descriptive statistics to identify and alert on any process accessing LSASS that falls outside this baseline, such as an Office application, web browser, or script engine. Use box-plots to identify hosts with an anomalously high count of LSASS access events."
          },
          {
            "description": "A sequence of events where a process accesses LSASS memory and is immediately followed by the creation of a new outbound network connection.",
            "data_sources": [
              "Windows Event ID 4656",
              "Windows Event ID 4663",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate LSASS memory access events (Windows Event ID 4656/4663) with subsequent network connection events from the Windows Filtering Platform (Windows Event ID 5156) originating from the same process ID. Identify sequences where a process accesses LSASS and then immediately (e.g., within 1-2 minutes) initiates an outbound network connection, especially to a non-standard port or a low-reputation IP address. Use time series analysis to correlate these events. This behavioral pattern is highly indicative of credential theft followed by exfiltration and is independent of the specific tool used."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]