[
  {
    "information_requirement": "Is the adversary maintaining command and control using fallback channels?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1008",
        "name": "Fallback Channels",
        "evidence": [
          {
            "description": "Network connections to external destinations (IPs, domains) that are identified by threat intelligence as secondary or fallback C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate all outbound network connection destination IPs (from Zeek conn.log), requested DNS domains (from Zeek dns.log), and SSL/TLS Server Name Indication (SNI) values (from Zeek ssl.log) against threat intelligence feeds. Prioritize feeds that categorize infrastructure by role, flagging matches against IPs/domains listed as 'C2', 'Fallback C2', or associated with known malware families, even if the intelligence is not recent. Investigate any confirmed matches as potential fallback C2 activity."
          },
          {
            "description": "Use of communication patterns or protocol artifacts characteristic of known covert C2 frameworks, such as specific DNS query structures, ICMP message types, or distinctive SSL/TLS fingerprints (JA3/JA3S).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek dns.log for patterns indicative of DNS tunneling, such as high volumes of TXT/NULL records, unusually long subdomains (data encoding), or high query-to-response size ratios. Monitor Zeek conn.log for ICMP traffic with anomalous type/code combinations (e.g., Echo Reply without a corresponding request) or large, repetitive payloads. Scan Zeek ssl.log for JA3/JA3S hashes matching known C2 tools often used for fallback channels. Use regular expression matching and correlation analysis against a maintained list of these patterns."
          },
          {
            "description": "Network connections exhibiting beaconing behavior, such as repeated connections to the same external destination with regular time intervals, consistent session durations, or similar data transfer sizes.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate network connection logs (Zeek conn.log, Windows Event ID 5156) by source host and destination IP/domain. For each recurring pair, analyze the time delta between connections. Use time series analysis to identify connections occurring at regular intervals. Calculate the standard deviation of the time deltas; a very low standard deviation (<1-2 seconds) strongly suggests automated beaconing. Also analyze the entropy of payload sizes; low entropy can indicate simple check-ins. Flag connections exhibiting strong periodicity, especially on non-standard ports or to low-reputation domains."
          },
          {
            "description": "Network connections using non-standard protocols on common ports, or originating from processes with no established history of network communication.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network data (Zeek conn.log for protocol/port mismatches) with host data (Windows Event ID 5156 for connection events, 4688 for process lineage). Establish a baseline of normal (process_name, destination_port, protocol) tuples for the environment. Use frequency analysis and entropy measures to identify rare or new combinations. Specifically hunt for connections from non-network-aware processes (e.g., svchost.exe with an unusual parent, notepad.exe, calc.exe) or connections using unexpected protocols on standard ports (e.g., non-DNS traffic over port 53). Use linear regression to identify if the appearance of rare tuples correlates with other suspicious activity."
          },
          {
            "description": "Network sessions with anomalous data transfer ratios (client-to-server vs. server-to-client bytes) compared to the expected behavior for that protocol or application.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For common protocols/ports (e.g., HTTP/S, DNS), analyze Zeek conn.log to establish a baseline for the ratio of originator bytes to responder bytes (orig_bytes / resp_bytes). Use descriptive statistics (mean, median, IQR) and probability distributions to model normal behavior. Apply time series analysis to detect shifts in these ratios over time for specific hosts. Flag connections with ratios falling in extreme percentiles (e.g., <5th or >95th) or those identified as outliers by clustering algorithms (e.g., DBSCAN) on the byte ratio feature, as this can indicate covert data tunneling or C2."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]