[
  {
    "information_requirement": "Is the adversary obfuscating command and control traffic?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1001",
        "name": "Data Obfuscation",
        "evidence": [
          {
            "description": "Encrypted or unencrypted network traffic communicating with IP addresses or domains known to be associated with malicious command and control infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join destination IP addresses and server names from Zeek logs (conn.log destination_ip, ssl.log server_name, dns.log query) with a high-confidence, frequently updated cyber threat intelligence (CTI) feed of known C2 servers. Alert on any matches and investigate the associated host and traffic patterns for further signs of compromise."
          },
          {
            "description": "Network traffic containing data structures, specific encoding schemes, or JA3/JA3S hashes that match patterns of known malware or C2 frameworks.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate JA3 and JA3S hashes from Zeek ssl.log against a maintained list of hashes associated with known malicious tools (e.g., Cobalt Strike, Metasploit, etc.). Search DNS TXT query responses in Zeek dns.log for unusually long or high-entropy strings indicative of Base64 or other encoding used for C2. If payload inspection is available, use regular expressions or Yara rules on Zeek conn.log data to detect specific custom encoding schemes or magic bytes associated with known obfuscation techniques."
          },
          {
            "description": "Network traffic exhibiting statistically anomalous characteristics such as high-entropy data where plain text is expected, or unusual data flow asymmetry indicative of C2.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For protocols expected to be plaintext (e.g., HTTP, FTP, SMTP), calculate the entropy of data payloads in Zeek http.log or connection contents. Use time series analysis to detect sudden increases in entropy for a host's traffic, suggesting a shift to obfuscated comms. Separately, analyze Zeek conn.log to calculate the ratio of bytes sent vs. received for each connection. Use descriptive statistics (mean, stddev, IQR, box-plots) to baseline normal ratios and detect significant outliers that may represent C2 heartbeat (low volume) or data staging (high asymmetry)."
          },
          {
            "description": "Network traffic showing patterns inconsistent with the expected behavior of the communication protocol used on a given port, such as DNS tunneling or protocol abuse.",
            "data_sources": [
              "Zeek weird.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek weird.log for protocol violations flagged by the analyzer (e.g., 'data_before_established'). Analyze Zeek dns.log for a high frequency of TXT/NULL record queries or abnormally long query names from a single host, which are common indicators of DNS tunneling. Use correlation analysis between query length and frequency to score potential tunneling activity. Analyze Zeek http.log for POST requests with minimal HTTP headers and large, high-entropy bodies to non-standard web servers or domains, which can indicate custom C2 over HTTP."
          },
          {
            "description": "Network connections initiated by unsigned or newly created processes, or by processes that do not typically initiate network communications.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of processes that normally initiate external network connections using Windows Event ID 5156 (network connection) and 4688 (process creation), noting their signature status and age. Alert on network connections made by processes that are unsigned, were created within the last 24 hours, or are not on the established baseline of known-good network-communicating processes. Use frequency analysis to identify rare processes making connections. Correlate findings with Zeek conn.log data based on source IP and port to assess the nature and destination of the suspicious traffic."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]