[
  {
    "information_requirement": "Is the adversary exfiltrating data over Bluetooth?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1011.001",
        "name": "Exfiltration Over Bluetooth",
        "evidence": [
          {
            "description": "Execution of known malicious tools or scripts capable of Bluetooth data transfer, identified by file hash or name.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688 with command-line logging enabled). Cross-reference the file hashes of all newly executed processes against a threat intelligence feed of known malware or dual-use tools specifically designed for or capable of Bluetooth exfiltration. Maintain a list of suspicious process names associated with such tools and alert on any confirmed matches."
          },
          {
            "description": "Use of specific command-line patterns involving legitimate system utilities (e.g., fsquirt.exe, PowerShell) to send files over Bluetooth.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for suspicious command-line arguments. Flag any non-interactive or scripted execution of `fsquirt.exe` (Windows Bluetooth File Transfer). Monitor for PowerShell execution containing Bluetooth cmdlets like `Send-BluetoothFile` or interaction with Bluetooth libraries (e.g., InTheHand.Net.Personal). Correlate these command-line patterns with suspicious parent processes (e.g., cmd.exe, wscript.exe) or recent data staging activity."
          },
          {
            "description": "Anomalous creation of large archives or encrypted files in user profile or temporary directories, indicating data staging prior to exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for the execution of archiving or compression utilities (e.g., 7z.exe, rar.exe, tar.exe, zip.exe). If object access auditing is enabled, monitor Windows Event ID 4663 for the creation of files with extensions like .zip, .rar, .7z, .tar.gz in common staging directories (e.g., %TEMP%, C:\\Users\\Public). Establish a baseline for the frequency and size of archive creation per user/host using descriptive statistics and flag significant deviations or outliers using Inter-Quartile Range (IQR) analysis."
          },
          {
            "description": "Activation of Bluetooth services or connection of a new, unauthorized Bluetooth adapter on a host where it is normally disabled or not used.",
            "data_sources": [
              "Windows Event ID 7036",
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 400",
              "410"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows System logs for Service Control Manager Event ID 7036 indicating the 'Bluetooth Support Service' or 'Bluetooth User Support Service' has started, especially on servers or workstations where it is disabled by policy. Monitor the `Microsoft-Windows-Kernel-PnP/Configuration` log for Event IDs 400 ('Device configured') and 410 ('Device started') related to Bluetooth hardware. Use frequency analysis to identify hosts where these events are rare or have never occurred."
          },
          {
            "description": "Correlation of data staging activities followed closely by the activation of Bluetooth services or the use of Bluetooth file transfer tools, forming a high-confidence hypothesis for exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlated detection rule that triggers when data staging behavior (e.g., execution of archiving tools, creation of large archives) is observed on a host within a short time window (e.g., 1-30 minutes) of either Bluetooth service/device activation events or the execution of Bluetooth file transfer commands (e.g., `fsquirt.exe`) on the same host. This sequence of precursor behaviors provides a high-confidence indicator of potential Bluetooth exfiltration. Use time series analysis to visualize and confirm the temporal relationship between the correlated events."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]