[
  {
    "information_requirement": "Is the adversary performing host or network discovery activities to check for Internet connectivity?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1016.001",
        "name": "Internet Connection Discovery",
        "evidence": [
          {
            "description": "An outbound network connection (TCP/UDP/ICMP) or DNS query from an internal host to an IP address, domain, or URL that is present on a threat intelligence feed of known malicious indicators (e.g., C2 servers, sinkholes).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Web Proxies), DNS Resolvers",
            "action": "1. (Symbolic) Ingest threat intelligence feeds of known malicious IPs and domains. Create a SIEM rule to generate a high-severity alert whenever a DNS query (Zeek dns.log) or an outbound connection (Zeek conn.log) matches an indicator on this list. 2. (Statistical) For any connection matching a threat feed, calculate the prevalence of the destination IP/domain across the enterprise in the last 30 days. If the destination is in the 99th percentile for rarity (contacted by the fewest hosts), automatically escalate the alert priority. 3. (Machine Learning) Feed connection metadata (source/destination IP, port, protocol, JA3/S hash, process context from endpoint logs, threat intel match) into a pre-trained classification model (e.g., Random Forest) to score the connection's likelihood of being malicious. A score above a predefined confidence threshold (e.g., 0.9) should trigger an automated response, such as host isolation."
          },
          {
            "description": "A process creation event for a common network utility (e.g., ping.exe, tracert.exe, curl.exe, Test-NetConnection) where the command line includes a public IP address (e.g., 8.8.8.8, 1.1.1.1) and the parent process is not an interactive shell or known administrative script.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (Workstations, Laptops), Servers (especially those with restricted internet access like Domain Controllers)",
            "action": "1. (Symbolic) Create a detection rule for Windows Event ID 4688 where ProcessName is one of ('ping.exe', 'tracert.exe', 'curl.exe', 'nslookup.exe') or NewProcessName in conjunction with ParentProcessName 'powershell.exe' includes ('Test-NetConnection', 'Resolve-DnsName'), and the ParentProcessName is not ('explorer.exe', 'cmd.exe', or a known admin tool). 2. (Statistical) For each host, establish a baseline for the execution frequency of these utilities. Generate an alert if the count in a one-hour window exceeds the 95th percentile of the host's historical activity, or if the process is executed by a user who has never run it before. 3. (Machine Learning) Use a time-series anomaly detection model (e.g., ARIMA) to monitor the execution frequency of these utilities per host. A statistically significant spike that deviates from the forecast should be flagged as an anomaly, especially if temporally correlated with other suspicious host events."
          },
          {
            "description": "The occurrence of three or more distinct types of internet connectivity checks (e.g., ICMP, DNS, HTTP/S) originating from a single host to multiple external destinations within a 5-minute window, where the initiating process is not a web browser or known software updater.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Endpoint devices, DNS Resolvers",
            "action": "1. (Symbolic) Create a correlation rule that triggers if a single source host generates an ICMP echo request (identified via process monitoring in Event ID 4688), a DNS query for a public resolver like 8.8.8.8 (Zeek dns.log), and an HTTP GET request to a high-availability site like google.com (Zeek http.log) within a 2-minute window. 2. (Statistical) For each host, calculate a 'protocol diversity' score over a 5-minute rolling window by counting the unique protocols (e.g., ICMP, DNS, HTTP) in outbound connections (Zeek conn.log). An alert is generated if this score exceeds the 99th percentile of the host's historical scores. 3. (Machine Learning) Use an unsupervised clustering algorithm (e.g., DBSCAN) on connection events, using features like source host, timestamp, and protocol. Identify and alert on temporally dense clusters from a single host that contain a high diversity of protocols, indicating a potential discovery burst."
          },
          {
            "description": "An outbound internet connection attempt from a host asset group defined as 'restricted' (e.g., Domain Controllers, database servers) or initiated by a user account defined as a 'service account'.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Server Subnets (e.g., Domain Controllers, Database Servers), Network Egress Points, Authentication Logs",
            "action": "1. (Symbolic) Maintain an asset list of 'Restricted Internet Access' hosts. Create a high-severity alert that triggers on any outbound connection event in Zeek conn.log where the source IP is on this list and the destination is not on an explicit allow-list. 2. (Statistical) Profile the set of processes that normally initiate outbound connections from server roles. If a network connection is initiated by a process that falls outside the 95th percentile of common processes for that role (e.g., a database server spawning curl.exe), generate an alert. 3. (Machine Learning) Train a one-class SVM model on the normal network behavior of critical servers, using features like destination IP/port, protocol, and process name. Any new connection that the model classifies as an anomaly should be immediately alerted for investigation."
          },
          {
            "description": "A sustained pattern of low-volume outbound connections from a single host to a set of destination domains or IPs with high Shannon entropy, where the destinations are not part of a known Content Delivery Network (CDN) or cloud service provider range.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers",
            "action": "1. (Symbolic) This is primarily a hunting technique. Create a low-priority rule to flag hosts that resolve more than 50 unique, non-categorized, and previously unseen second-level domains in a 24-hour period, especially if the connection volume per domain is minimal (<1KB). 2. (Statistical) On a daily basis, calculate the Shannon entropy of the set of destination second-level domains queried by each host (from Zeek dns.log). Flag the top 1% of hosts with the highest entropy scores for manual review, after excluding known proxies. 3. (Machine Learning) Use a time-series forecasting model (e.g., Prophet) to predict the daily count of unique destination IPs for each host. An observation where the actual count significantly exceeds the model's prediction interval (e.g., yhat_upper) indicates an anomalous increase in destination diversity and should be flagged for a hunt-centric review."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]