[
  {
    "information_requirement": "Is the adversary attempting to discover information about Wi-Fi networks on compromised systems?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1016.002",
        "name": "Wi-Fi Discovery",
        "evidence": [
          {
            "description": "Execution of a script or binary whose file hash is a known indicator for a malicious Wi-Fi discovery tool or malware component.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) and calculate or retrieve the hash (e.g., SHA256) of the executable file for each new process. Inner join these hashes against a high-confidence threat intelligence feed of known malicious file hashes associated with enumeration tools or malware families that perform Wi-Fi discovery. Alert on any confirmed match and initiate incident response."
          },
          {
            "description": "Execution of specific, well-known command-line patterns used for Wi-Fi network and credential discovery via native system utilities.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a high-fidelity detection rule to monitor Windows Event ID 4688 for process command lines containing exact strings or regular expressions matching `netsh wlan show profiles`, `netsh wlan show profile * key=clear`, or PowerShell equivalents like `Get-NetConnectionProfile`, `Get-WlanProfile`, and subsequent credential extraction cmdlets. As these can be used legitimately, use descriptive statistics to identify hosts or users executing these commands with unusual frequency or at odd hours."
          },
          {
            "description": "An unusual process (e.g., a document, web browser, or non-administrative tool) spawning a shell to execute Wi-Fi discovery commands, or such commands being run under a user context that does not typically perform network administration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Windows Event ID 4688 logs to track process lineage. Flag any instances where Wi-Fi discovery commands (e.g., `netsh wlan...`) are spawned by unusual parent processes such as `WINWORD.EXE`, `CHROME.EXE`, or `svchost.exe` (in an anomalous parent-child relationship). Establish baselines of user roles and their typical command-line activity using frequency analysis and alert on deviations, such as a non-IT user executing `netsh` commands. Use correlation analysis to link these events to a specific logon session (`LogonId`) to investigate the session's entire activity chain."
          },
          {
            "description": "Wi-Fi discovery command execution immediately followed by data staging into a file or an outbound network connection, suggesting credential or information exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate Wi-Fi discovery command execution (Windows Event ID 4688) with subsequent file creation/modification events (e.g., looking for command-line output redirection like `> wifi_creds.txt`) or outbound network connections (Zeek conn.log) from the same host within a short time window (e.g., 1-5 minutes). Use a time series analysis on Zeek logs to detect spikes in outbound data from a host following discovery activity. Analyze the destination of the network connection; connections to rare external IPs, non-standard ports, or known cloud storage providers shortly after discovery are highly suspicious and warrant investigation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]