[
  {
    "information_requirement": "Has the adversary exfiltrated sensitive data using automated methods?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1020",
        "name": "Automated Exfiltration",
        "evidence": [
          {
            "description": "Outbound network connections to IP addresses, domains, or services known to be associated with data exfiltration or malware C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log against high-confidence, up-to-date threat intelligence feeds specific to known exfiltration points, malware C2 infrastructures, and anonymous file sharing services. Inner join network logs with these feeds and alert on any confirmed matches. Prioritize alerts that also exhibit high outbound data transfer volumes."
          },
          {
            "description": "Exfiltration of data encoded within DNS queries or specific HTTP headers, matching patterns of known exfiltration tools or techniques.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek dns.log for unusually long DNS queries (e.g., >255 bytes), high query volume from a single host to a specific parent domain, or an abnormal ratio of TXT/CNAME to A/AAAA records. Calculate the entropy of subdomain labels to detect encoded data. For Zeek http.log, inspect headers (e.g., Cookies, User-Agent) and POST request bodies for patterns of Base64 or other encoded data being sent to unusual destinations. Use regular expressions to match against signatures of known DNS/HTTP tunneling tools."
          },
          {
            "description": "Execution of archiving or compression utilities with parameters indicative of bulk data staging, followed by a large outbound network transfer from the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for the execution of common archival utilities (e.g., tar.exe, 7z.exe, zip.exe, rar.exe). Analyze command-line arguments for patterns suggesting bulk data aggregation (e.g., archiving C:\\Users, network shares, or other sensitive directories). Use time-based correlation analysis to link these host events with subsequent large outbound connections (>95th percentile of normal transfers) from the same host, as seen in Zeek conn.log, within a short time window (e.g., 5-15 minutes)."
          },
          {
            "description": "A process accesses an unusually high number of files or sensitive file types, especially if the process is not typically associated with user data handling, followed by an outbound network connection.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate host-based file access events (Windows Event ID 4663) with process creation (Event ID 4688) and outbound network connections (Zeek conn.log). Establish a baseline of normal file access behavior (file count, file types, directory paths) for common processes (svchost.exe, powershell.exe, etc.) and users. Use descriptive statistics and IQR analysis to flag processes that access an anomalous number or variety of files, particularly from sensitive user or system locations. Calculate the entropy of accessed file extensions per process instance; a sudden spike can indicate indiscriminate data gathering. Correlate these host events with subsequent network connections to non-standard or low-reputation destinations."
          },
          {
            "description": "Synchronized file access or data aggregation activity across multiple endpoints, followed by aggregated outbound network traffic to a single external destination.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4663 across multiple endpoints for concurrent or rapidly sequenced file read events, especially targeting similar file types or directory locations. Correlate the timing and volume of these distributed file events with spikes in aggregated outbound network traffic (summing bytes transferred from Zeek conn.log and http.log) to a single destination IP/domain. Use time series and correlation analysis to identify statistically significant temporal relationships and volume correlations between the distributed file access and the centralized outbound network burst, suggesting a coordinated exfiltration campaign."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]