[
  {
    "information_requirement": "Has the adversary performed lateral movement using accessible cloud services?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral-Movement",
    "indicators": [
      {
        "technique_id": "T1021.007",
        "name": "Cloud Services",
        "evidence": [
          {
            "description": "Connections to cloud service APIs or consoles from internal hosts or using user accounts known to be compromised or associated with prior suspicious activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain and correlate against an internal watchlist of compromised host IP addresses and user accounts. Join this watchlist with sources of cloud service access logs (e.g., Zeek conn.log/http.log to known cloud provider domains like *.amazonaws.com, *.azure.com, *.googleapis.com) and successful authentication events (Windows Event ID 4624 for federated auth). Alert when any asset on the watchlist accesses cloud services, as this could be a precursor to lateral movement."
          },
          {
            "description": "Execution of specific cloud CLI commands or API call patterns on an endpoint that are known to be leveraged for lateral movement.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation of cloud CLIs (e.g., aws.exe, az.exe, gcloud.cmd). Apply regular expression matching on command-line arguments to flag specific high-risk command patterns used for lateral movement, such as instance-connect/run-command functions (`az vm run-command`, `gcloud compute ssh`), temporary credential generation (`sts get-session-token`), or network path modification. Maintain and update this list of suspicious command patterns and alert when they are executed by non-administrative users or from unexpected hosts."
          },
          {
            "description": "An internal host exhibiting anomalous cloud activity, such as a high volume of API calls or enumeration, followed by suspicious connections to other internal hosts.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each internal host, establish a baseline of normal cloud API interaction, including volume, frequency, and diversity (entropy) of API endpoints accessed, using Zeek http.log. Use time series analysis or Inter-Quartile Range (IQR) methods to detect significant spikes in API call volume or entropy, which may indicate reconnaissance. Correlate these cloud activity spikes (within a 30-minute window) with subsequent outbound network connections (Windows Event ID 5156, Zeek conn.log) from the same source host to other internal assets on ports commonly used for lateral movement (e.g., 3389/RDP, 445/SMB, 5985/WinRM). Use correlation analysis to link the cloud activity with the subsequent internal movement."
          },
          {
            "description": "A user account accessing cloud resources from an unfamiliar internal host, which is then used as a pivot point to access a different internal host or network segment.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile typical user-to-host-to-cloud access patterns by analyzing Windows Event ID 4624 (logons) and Zeek conn.log. Identify anomalous access chains, such as a user's cloud credentials being used from a host they have never logged into before. Monitor for subsequent inbound connections from the cloud provider's IP space (identified in Zeek conn.log) to a different internal host. Alert on the full behavioral chain: [Anomalous On-Prem Host -> Cloud Service -> Different On-Prem Host], as this indicates the cloud is being used as a bridge for lateral movement."
          },
          {
            "description": "Anomalous creation or modification of cloud network resources (e.g., security group rules, network peering) that creates a new pathway between cloud and on-premise environments.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor network traffic (Zeek http.log) to cloud management API endpoints for calls related to sensitive network configuration changes (e.g., modifying VPCs, security groups, firewall rules, network ACLs, VPN gateways). Baseline the frequency and source of these changes. Use linear regression or time series analysis to detect an abnormal rate of change. Investigate network configuration changes originating from unusual internal sources or occurring outside of established change management windows, as these may be intended to create a path for lateral movement."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]