[
  {
    "information_requirement": "Is the adversary using binary padding to evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1027.001",
        "name": "Binary Padding",
        "evidence": [
          {
            "description": "An executable file transferred over the network matches the hash of a known padded malicious binary.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously compare file hashes (MD5, SHA1) from Zeek files.log against a cyber threat intelligence feed of known malicious file hashes, specifically including variants identified as being padded to evade typical signature-based detections. Alert on any match and investigate the source, destination, and file type."
          },
          {
            "description": "An executable file transferred over the network exhibits Portable Executable (PE) structural anomalies indicative of padding, such as a large data overlay appended after the last defined section.",
            "data_sources": [
              "Zeek pe.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek pe.log data for all transferred executables. Correlate with Zeek files.log to compare the total file size (`total_bytes`) with the PE header's specified `SizeOfImage`. Calculate the overlay size (total_bytes - SizeOfImage). Establish a baseline for normal overlay sizes and use descriptive statistics (e.g., IQR, percentiles) to flag files with an unusually large overlay, which is a strong indicator of appended padding."
          },
          {
            "description": "An executable file is transferred over the network or executed on a host with a file size that is a statistical outlier compared to legitimate files of the same name or in the same location.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For files transferred over the network (Zeek files.log), build statistical models (e.g., mean, standard deviation) for the size of common legitimate executables (e.g., svchost.exe, putty.exe). For host-based activity (Windows Event ID 4688), this requires correlation with a tool that can retrieve file size. Flag any executables whose size is a significant outlier (e.g., >3 standard deviations from the mean for that filename). Use regression analysis to correlate file size with filename complexity; a large, randomly named executable is highly suspicious."
          },
          {
            "description": "A process, spawned from an executable with properties suggestive of padding (e.g., anomalous size, large PE overlay), initiates suspicious post-execution activity such as system discovery, credential access, or C2 communication.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlated alert chain. First, identify executables with padding characteristics using other detections (e.g., large file size from Zeek files.log, PE overlay from Zeek pe.log). Second, correlate these network-observed files with process creation events (Windows Event ID 4688) on the destination host by filename, path, and time. Third, for these specific suspect processes, monitor their command-line arguments for discovery commands (`whoami`, `systeminfo`, `net group`) and their subsequent network connections (in Zeek conn.log) for patterns matching C2 (beaconing, long-lived connections to rare domains). The initial evidence of padding serves as a strong signal to escalate investigation of these subsequent behaviors."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]