[
  {
    "information_requirement": "Is the adversary moving laterally through the network using Windows admin shares?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.002",
        "name": "SMB-Windows Admin Shares",
        "evidence": [
          {
            "description": "Transfer of files with known malicious hashes over SMB, or execution of processes from these files on administrative shares (C$, ADMIN$).",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Extract file hashes from files transferred over the SMB protocol using Zeek files.log. Separately, identify hashes of any new processes being executed (Windows Event ID 4688) on endpoints and servers. Compare both sets of hashes against a continuously updated threat intelligence feed of known malicious toolsets (e.g., Mimikatz, Cobalt Strike beacons, PsExec) and malware. An alert on a hash match from a file transferred over SMB or executed on a host constitutes a high-confidence indicator of malicious lateral movement."
          },
          {
            "description": "Creation of specific tool artifacts, such as uniquely named services (e.g., 'PSEXESVC') or named pipes, on a destination host following an SMB connection.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor all endpoints and servers for the creation of new services (Windows Event ID 7045) and the access of named pipes (Windows Event ID 5145). Analyze the names of these created objects for patterns that match known lateral movement frameworks and tools (e.g., service names like 'PSEXESVC', or named pipe patterns like `\\.\\pipe\\msagent_<random_chars>`). Maintain and apply a list of regular expressions for these patterns. Correlate the creation of these artifacts with recent inbound SMB network logons (Windows Event ID 4624, Logon Type 3) to attribute the activity to a source host."
          },
          {
            "description": "Anomalous network logon (Logon Type 3) to an administrative share (C$, ADMIN$) that deviates from established baselines, such as access between workstations or from a non-administrative host to a server.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 5140"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal remote SMB logons (Windows Event ID 4624, Logon Type 3) and administrative share access (Windows Event ID 5140) by modeling source-destination host pairs and user accounts. Use this baseline to build a graph of typical administrative connections. Employ correlation analysis to flag new or rare source-destination access patterns, particularly focusing on workstation-to-workstation SMB sessions or connections from non-administrative servers to other servers' administrative shares. Use descriptive statistics to identify source hosts with an anomalously high out-degree of admin share connections."
          },
          {
            "description": "The behavioral sequence of an SMB connection to an administrative share, immediately followed by a file write, and then remote process execution of that same file on the destination host.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek smb.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a multi-event correlation rule to detect the full lateral movement chain in near real-time. The sequence to detect is: 1) A remote network logon (Windows Event ID 4624, Logon Type 3) from a source host to a destination host. 2) A file write event to an administrative share (e.g., C$) on the destination host originating from the source, identified via Zeek smb.log (`write` command and filename). 3) A process creation event (Windows Event ID 4688) on the destination host where the 'NewProcessName' or 'CommandLine' field matches the file recently written via SMB. Trigger a high-severity alert when this full sequence occurs between a source/destination pair within a short time window (e.g., under 2 minutes)."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]