[
  {
    "information_requirement": "Is the adversary attempting to discover system owner or user information?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1033",
        "name": "System Owner-User Discovery",
        "evidence": [
          {
            "description": "Execution of a process where the file hash matches a known malicious tool used for user discovery.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user workstations, Servers",
            "action": "For each new process execution (Windows Event ID 4688), extract the process file hash. 1) (Symbolic) Match the hash against a threat intelligence feed of known malicious indicators associated with discovery tools. Alert on any match. 2) (Statistical) Calculate the environmental prevalence of each hash. Flag hashes seen on fewer than 0.1% of endpoints and not signed by a trusted publisher as low-prevalence and potentially suspicious. 3) (Machine Learning) Feed file-based features (e.g., PE header characteristics, entropy, string metadata) into a pre-trained classifier (e.g., Random Forest) to predict if an unknown executable is malicious. Flag executions classified as malicious for further investigation."
          },
          {
            "description": "Anomalous execution of built-in system commands (e.g., whoami, query user, qwinsta, id, w, who) or PowerShell cmdlets (e.g., Get-LocalUser, Get-CimInstance Win32_LoggedOnUser) used for enumerating local or logged-on users.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user workstations, Servers, Domain Controllers",
            "action": "Monitor process command-lines (Windows Event ID 4688) and script block logs (PowerShell Event ID 4104) for user discovery commands. 1) (Symbolic) Create a detection rule for discovery commands spawned by an unusual parent process, such as an Office application (winword.exe) or web browser (chrome.exe). 2) (Statistical) For each user-host pair, establish a baseline of discovery command frequency over a 30-day rolling window. Alert when the command count in a one-hour window exceeds the 99th percentile of that baseline. 3) (Machine Learning) Employ a sequence analysis model (e.g., Markov chain) to learn common command progressions for different user roles. Flag command sequences that have a low probability of occurring, such as a discovery command immediately following an email client process start."
          },
          {
            "description": "A burst of multiple, distinct user discovery commands executed in a short time frame, especially when correlated with subsequent anomalous network activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user workstations, Servers, Network Gateway",
            "action": "Correlate host-based discovery events with network logs. 1) (Symbolic) Trigger an alert if a single process ID executes three or more unique discovery commands (e.g., 'whoami', 'query user', 'net user') within five minutes, followed by a network connection (Zeek conn.log) to an external IP address on a non-standard port (not 80/443). 2) (Statistical) For each host, calculate the daily count of all discovery command executions. Compute a Z-score for the current day's count against the host's historical 90-day mean and standard deviation. A Z-score greater than 3.5 indicates a significant anomaly. 3) (Machine Learning) Apply a time-series decomposition model (e.g., STL) to the enterprise-wide count of discovery commands per minute. Spikes in the residual component, which represents activity not explained by normal trends or seasonality, indicate a potential coordinated discovery event and should be investigated."
          },
          {
            "description": "Anomalous connection to a network device's management interface (e.g., SSH, Telnet) from a non-administrative source, followed by a session with characteristics of automated command execution (e.g., short duration, small data transfer).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Infrastructure (Switches, Routers, Firewalls), Management Network Segment",
            "action": "Analyze network traffic to and from network device management interfaces. 1) (Symbolic) Create a rule to alert on any connection to a network device on port 22 or 23 that originates from an IP address not on a pre-approved list of administrative workstations or management subnets. 2) (Statistical) For each SSH session to a network device (Zeek ssh.log), baseline the distribution of session duration and total bytes transferred. Flag sessions that fall into the lower 5th percentile for both metrics, as this pattern is indicative of a scripted 'login-run command-logout' action like executing 'show users'. 3) (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) on connection features (source IP, duration, bytes transferred) to group normal administrative sessions. Flag any new session that is classified as an outlier (i.e., does not belong to an established cluster) for review."
          },
          {
            "description": "A single source system performing large-scale enumeration of Active Directory user or group objects via LDAP queries or command-line tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Security Event ID 4662",
              "Zeek conn.log",
              "Zeek ldap.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, End-user workstations",
            "action": "Monitor for Active Directory enumeration from multiple data sources. 1) (Symbolic) Alert when a non-Domain Controller executes 'net user /domain' or when a single user account generates over 100 'An operation was performed on an object' events (Event ID 4662) for user or group objects on a DC within one minute. 2) (Statistical) Using Zeek ldap.log, calculate the number of unique user objects queried by each source IP in a 10-minute window. Alert if this count exceeds 5 standard deviations above the mean for all source IPs in that window. 3) (Machine Learning) Implement peer group analysis. Group users by department or role and model their normal LDAP query behavior. Use an isolation forest or one-class SVM to detect when a user's query patterns (e.g., volume, attributes queried, object types) significantly deviate from their established peer group baseline."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]