[
  {
    "information_requirement": "Is the adversary exfiltrating sensitive data?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1030",
        "name": "Data Transfer Size Limits",
        "evidence": [
          {
            "description": "Outbound data transfers destined for IP addresses, domains, or URLs known to be associated with malicious C2 or data exfiltration endpoints.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join destination IPs from Zeek conn.log, requested domains from Zeek dns.log, and full URLs from Zeek http.log against a high-confidence threat intelligence feed of known malicious C2 or data exfiltration points (updated daily). Alert on any connection, especially those involving significant data upload, regardless of how the data is chunked, as this provides a primary filter for suspicious destinations."
          },
          {
            "description": "Outbound network traffic exhibiting chunking patterns characteristic of known exfiltration tools, such as specific HTTP header usage, DNS query structures, or fixed time delays between data chunks.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and monitor for network patterns of specific exfiltration tools. For example, search Zeek http.log for POST requests with unusual Content-Type headers or custom headers used by known malware to exfiltrate data chunks. For DNS tunneling, analyze Zeek dns.log for an abnormally high volume of TXT or A record queries to a specific subdomain where the queried subdomains appear to be encoded data. Use regular expressions to match these known patterns and correlate events using time series analysis to identify sequences of chunked transfers."
          },
          {
            "description": "Outbound network sessions exhibiting unusually low variance in data chunk sizes, indicative of data being programmatically split to evade size-based detection thresholds.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log for outbound flows, focusing on the originator-sent payload sizes. For each flow, calculate statistical properties of the byte counts per packet or within defined time windows. Flag sessions where the standard deviation or Inter-Quartile Range (IQR) of byte counts is exceptionally low, suggesting artificially uniform chunk sizes. Use box-plots of byte count variance per flow to visually identify outliers compared to normal network traffic."
          },
          {
            "description": "Anomalous periodic outbound connections from an internal host, where each connection transfers a similar, fixed amount of data, suggesting automated, chunked exfiltration over time.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log using time series analysis to identify periodic (beaconing) outbound connections from internal hosts. For identified periodic flows, analyze the 'orig_bytes' (total bytes from originator) for each connection instance. Flag series of connections where the byte counts are consistently similar (low variance). Use correlation analysis to link the source IP and port with process-level network events (Windows Event ID 5156) to determine if this behavior is unexpected for the originating application."
          },
          {
            "description": "Data exfiltration masked within legitimate protocols (e.g., HTTP/S, DNS) initiated by anomalous processes or exhibiting protocol abuse inconsistent with normal communications.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal network-initiating processes on hosts using Windows Event ID 4688 (Process Creation) and 5156 (Network Connection). Flag outbound connections (Zeek conn.log) from processes not on the baseline (e.g., 'notepad.exe', renamed utilities). For traffic on common ports (80, 443, 53), analyze protocol-specific logs (Zeek http.log, dns.log) for behavioral anomalies like high-entropy subdomains in DNS queries or HTTP POST requests with unusual data-to-header ratios. Use linear regression to identify correlations between the execution of an anomalous process and the start of a suspicious, chunked data flow."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]