[
  {
    "information_requirement": "Is the adversary using defense evasion techniques to hide malicious files?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1036.006",
        "name": "Space after Filename",
        "evidence": [
          {
            "description": "A file or process is observed with a filename containing a trailing space that matches a known malicious filename or has a known malicious hash.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a threat intelligence list of known malicious filenames that have been observed with trailing spaces (e.g., 'svchost.exe ', 'rundll32.exe '). Monitor process creation (Event ID 4688) and file creation/modification (Event ID 4663) events for exact matches to this list. Additionally, when a file with a trailing space is detected, calculate its hash and correlate it against a CTI feed of known malware hashes. Alert on any match."
          },
          {
            "description": "A process is created from an executable file where the filename contains one or more trailing space characters, especially if the original filename mimics a legitimate system binary.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688). Use a regular expression on the 'NewProcessName' or 'CommandLine' fields to detect file paths ending with one or more space characters before the extension (e.g., 'filename .exe'). Prioritize alerts for filenames that, without the space, match common system binaries (e.g., svchost, lsass, cmd, powershell). Use frequency analysis to baseline normal process names and identify these rare, spaced variants as significant outliers."
          },
          {
            "description": "A file is created or exists on disk with a filename containing one or more trailing space characters, particularly in common malware staging directories.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor file system activity (Windows Event IDs 4663, 4656) for any file creation or write events where the 'ObjectName' contains a trailing space. Investigate these occurrences, paying special attention to files created in temporary directories (e.g., C:\\Users\\*\\AppData\\Local\\Temp, C:\\Windows\\Temp) or user profile directories, which are common staging areas. Use descriptive statistics to track the frequency of such creations per host/user to spot anomalous behavior."
          },
          {
            "description": "A process launched from a file with a trailing space exhibits suspicious post-execution behavior, such as making outbound network connections, modifying registry keys for persistence, or creating child processes.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Windows Event ID 4657",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "First, identify a parent process launched from a file with a trailing space using Windows Event ID 4688. Correlate this Process ID (PID) with subsequent events within a short time window. Use correlation analysis to link the parent PID to child processes (Event ID 4688), registry modifications (Event ID 4657, especially in Run keys), and network connections (Windows Event ID 5156; Zeek conn.log from the source host IP). A process from 'cmd.exe ' that immediately connects to a rare external IP is a high-confidence indicator of malicious behavior."
          },
          {
            "description": "A legitimate-looking process name with a trailing space (e.g., 'svchost.exe ') is executed from an unusual file path or has an unexpected parent process, violating established baselines.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For every process detected with a trailing space in its name, analyze its full path and its parent process name from Windows Event ID 4688. Compare the execution path against a baseline of legitimate locations for that binary (e.g., 'svchost.exe ' should not run from C:\\Users\\...). Similarly, compare the parent process against a baseline of expected parents (e.g., 'services.exe' is a normal parent for 'svchost.exe'; 'explorer.exe' is not). Use correlation analysis and frequency analysis to flag processes that violate these established and baselined parent-child or process-path relationships."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]