[
  {
    "information_requirement": "Is the adversary exfiltrating sensitive data using alternative protocols?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048",
        "name": "Exfiltration Over Alternative Protocol",
        "evidence": [
          {
            "description": "Outbound network traffic over any protocol (including DNS, ICMP, HTTP/S) to external destinations (IP addresses or domains) known to be associated with data exfiltration or command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log against a high-confidence, frequently updated cyber threat intelligence (CTI) feed of known malicious exfiltration points, C2 servers, and sinkholes. Alert on any matches and immediately investigate the source host and nature of the data transfer."
          },
          {
            "description": "Execution of specific command-line utilities (e.g., certutil, bitsadmin, curl) or scripts (e.g., PowerShell Invoke-WebRequest) with syntax patterns commonly used for encoding and exfiltrating data.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events with command lines matching known exfiltration patterns, such as 'certutil -encode' followed by an outbound connection, or PowerShell using 'Invoke-WebRequest' with a suspicious destination URL. Use regular expressions to detect these specific patterns. Correlate process creation with subsequent outbound network connections in Zeek conn.log to confirm data transfer and analyze its characteristics (port, destination, volume)."
          },
          {
            "description": "Use of protocols like ICMP or DNS for data transfer in a manner indicative of tunneling tools, such as specific ICMP types/codes or DNS record types (e.g., TXT, NULL) with abnormally large payloads.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek icmp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek dns.log for an anomalously high volume of TXT, NULL, or CNAME queries from a single host, or queries with unusually long subdomains suggesting encoded data. Monitor Zeek icmp.log for ICMP Echo Request/Reply packets with large, non-standard payloads or a high frequency of pings to a single destination. Compare payload sizes and query frequencies against baselines using percentile analysis to identify tool-specific patterns of DNS or ICMP tunneling."
          },
          {
            "description": "Anomalous volume of outbound data from an internal host, either in a single session or aggregated over time, especially over protocols or ports not typically used for large transfers.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each host, create a statistical baseline of daily/hourly outbound data volume, segmented by protocol and destination port. Use time series analysis (e.g., ARIMA, Holt-Winters) or moving averages with standard deviations to detect significant spikes in data egress. Pay special attention to protocols like DNS, ICMP, or non-standard TCP/UDP ports where large transfers are highly unusual. Calculate the ratio of bytes sent to bytes received; use box-plots or the Inter-Quartile Range (IQR) method to identify outlier sessions with extremely high ratios."
          },
          {
            "description": "Detection of network traffic where the observed protocol is inconsistent with the standard protocol for the destination port (e.g., non-HTTP traffic over port 443, or non-DNS traffic over port 53).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dpd.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek's Dynamic Protocol Detection (dpd.log) for alerts indicating a protocol violation (e.g., 'SSL_Threat_Unexpected_Protocol'). Correlate these alerts with Zeek conn.log to identify the source, destination, and port. Specifically look for traffic on common exfiltration ports (80, 443, 53) where the identified 'service' in conn.log (e.g., 'ssh', 'smb') or the DPD alert does not match the port's standard service. For port 443, investigate traffic that does not generate a corresponding Zeek ssl.log entry, as this indicates non-TLS traffic that may be tunneled exfiltration."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]