[
  {
    "information_requirement": "Is the adversary exfiltrating sensitive data from the network?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048.001",
        "name": "Exfiltration Over Symmetric Encrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "Outbound network traffic to external destinations (IP addresses or domains) known to be associated with data exfiltration or malware operations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join destination IP addresses from Zeek conn.log and resolved domains from Zeek dns.log against a high-confidence, continuously updated cyber threat intelligence (CTI) feed of known malicious infrastructure, exfiltration points, or anonymization services. Generate a high-priority alert for any matches, especially for connections with a high sent-to-received byte ratio or large total bytes sent."
          },
          {
            "description": "Presence of high-entropy data within outbound network traffic over protocols not typically used for encrypted bulk data transfer (e.g., HTTP, DNS, ICMP).",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For outbound connections, programmatically calculate the entropy of data payloads (e.g., HTTP POST bodies from Zeek http.log, DNS TXT record queries from Zeek dns.log, or payload snippets from Zeek conn.log). Establish a baseline for normal entropy levels for these protocols. Flag sessions where the payload entropy is consistently high (e.g., > 7.0 on a scale of 0-8), indicating compressed or encrypted data, especially when the total data volume is significant. Correlation analysis between high entropy and high data volume should be performed to reduce false positives."
          },
          {
            "description": "Anomalous volume or ratio of outbound data transfer from an internal host to a single external destination, deviating significantly from established baselines.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log to build dynamic baselines of normal data transfer volumes (total bytes sent) and ratios (bytes_sent / bytes_received) for internal hosts to external destinations. Use time series analysis and statistical methods (e.g., Inter-Quartile Range (IQR) or standard deviations on a rolling average) to detect significant spikes or sustained high-volume transfers. Use descriptive statistics to identify connections that are outliers in terms of data volume and prioritize alerts for traffic to new or low-prevalence destinations."
          },
          {
            "description": "Outbound network connection with large data transfer initiated by a process not typically associated with network communication or user activity (e.g., system utilities, unsigned binaries).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate outbound network connections (Windows Event ID 5156 or Zeek conn.log) with process creation events (Windows Event ID 4688) on the source host. Maintain a baseline of normal network-communicating processes. Flag new or unusual processes (e.g., system utilities like bitsadmin.exe, scripts, or binaries executing from temp folders) that initiate external connections, especially those with high outbound data volume identified in associated Zeek conn.log sessions. Use frequency analysis on process names and parent-child process chains to identify rare occurrences leading to network connections."
          },
          {
            "description": "Use of a standard, often unencrypted, protocol (e.g., HTTP, FTP, SMTP) in a manner inconsistent with its normal function, such as long-running sessions with continuous data upload without corresponding commands or requests.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ftp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze protocol-specific logs (Zeek http.log, ftp.log, etc.) for behavioral anomalies indicative of tunneling. For HTTP, look for long-lived POST requests with minimal headers and a large, continuous data stream. For DNS, look for an abnormally high rate of TXT or NULL record queries with large payloads from a single host. For FTP, detect data transfers without preceding control commands. Use linear regression to identify if an increase in these anomalous protocol events correlates with high-volume data transfers seen in Zeek conn.log to the same destination."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]