[
  {
    "information_requirement": "Is the adversary attempting to discover network services?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1046",
        "name": "Network Service Discovery",
        "evidence": [
          {
            "description": "Network traffic containing specific, high-confidence signatures or artifacts of known network scanning tools.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek logs for static, tool-specific indicators. In Zeek http.log, search for default User-Agent strings of common scanning tools (e.g., 'Nmap Scripting Engine', 'masscan'). Analyze Zeek conn.log payloads (if available) or Zeek weird.log events for network-level signatures or anomalies indicative of specific scan types or tools. This relies on an updated signature set matching known tool artifacts."
          },
          {
            "description": "Execution of common network scanning tools or built-in utilities with command-line arguments indicative of network service discovery.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) logs for execution of known scanning tools (`nmap.exe`, `masscan.exe`, `advanced_ip_scanner.exe`) or built-in utilities (`net.exe`, `powershell.exe`, `arp.exe`). Correlate the process name with command-line arguments that strongly indicate discovery, such as `nmap -sV`, `nmap -A`, `net view`, `Test-NetConnection -Port`, `arp -a`. Maintain and apply a list of regular expressions for these suspicious command-line patterns and flag any matches."
          },
          {
            "description": "A single internal host initiating connections to a large number of different hosts on the same port or a small set of ports, indicative of a horizontal port scan.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "From Zeek conn.log, aggregate connection events by source IP over short time windows (e.g., 1-10 minutes). For each source IP, calculate the count of unique destination IPs. Flag source IPs where the number of unique destination IPs exceeds a dynamically set threshold (e.g., >50 unique hosts), especially if the destination port is consistent (e.g., port 445, 22, 3389). Use descriptive statistics (mean, standard deviation) on the count of destination IPs per source across the network to find outliers. Box-plots can effectively visualize these scanning hosts."
          },
          {
            "description": "A single internal host initiating connections to a large number of different ports on a single host or a small set of hosts, indicative of a vertical port scan.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "From Zeek conn.log, aggregate connection events by source-destination IP pairs over short time windows (e.g., 1-10 minutes). For each pair, calculate the count of unique destination ports. Flag pairs where the port count exceeds a high threshold (e.g., >100 ports). Use entropy measures on the destination ports for a given source IP to identify hosts attempting to connect to an unusually wide range of ports on specific targets. Use time series analysis to detect sudden bursts of such activity from a single source."
          },
          {
            "description": "A process not typically associated with network administration (e.g., svchost.exe, winword.exe) generating network scanning behavior or using discovery protocols.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process execution data (Windows Event ID 4688) with network connection data (Zeek conn.log) based on source host and timestamp. Establish a baseline of normal network behavior (e.g., number of connections, destination port diversity) for common processes. Flag significant deviations, such as 'svchost.exe' or a common user application initiating connections to hundreds of unique IPs or ports. Similarly, correlate process data with Zeek dns.log to find processes generating unexpected discovery protocol traffic (e.g., mDNS, LLMNR). A regression model could predict expected network traffic volume from a process, with large residuals indicating anomalies."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]