[
  {
    "information_requirement": "Is the adversary executing malicious code using systemd timers?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1053.006",
        "name": "Systemd Timers",
        "evidence": [
          {
            "description": "Execution of a process by systemd (PPID 1) whose executable file hash or command-line arguments match known malicious indicators.",
            "data_sources": [
              "Auditd logs (execve syscall)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor auditd execve records where the parent process ID (PPID) is 1. Upon execution, calculate the hash of the running executable and compare it against a threat intelligence feed of known malicious file hashes. Concurrently, scan command-line arguments for known malicious strings, C2 server IP addresses, or domains. Alert on any matches."
          },
          {
            "description": "Use of the 'systemd-run' utility with command-line patterns that download and execute remote scripts or embedded commands.",
            "data_sources": [
              "Auditd logs (execve syscall)",
              "Shell history logs",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor auditd execve logs and user shell history files for the execution of 'systemd-run'. Analyze command lines for patterns indicative of remote code execution, such as piping output from 'curl' or 'wget' to a shell, executing Base64 encoded commands, or using '--on-active' to trigger scripts located in temporary directories like /tmp or /dev/shm. Use regular expression matching for these patterns. Correlate detections with Zeek ssh.log to identify remote interactive sessions used to issue these commands."
          },
          {
            "description": "A process spawned by systemd (PPID 1) initiates an outbound network connection to a rare or newly observed external destination.",
            "data_sources": [
              "Auditd logs (execve",
              "connect syscalls)",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate auditd execve events where PPID=1 with subsequent 'connect' syscalls made by that new process ID. Extract destination IP addresses and ports. Use frequency analysis and descriptive statistics to build a profile of normal outbound destinations. Flag connections to rare external IPs (e.g., those in the lowest 5th percentile of occurrence across the environment) or IPs not seen in historical data. Use time series analysis to detect anomalous spikes in traffic volume from systemd-spawned processes."
          },
          {
            "description": "A process is executed by systemd (PPID 1) from a non-standard or world-writable directory such as /tmp, /var/tmp, /dev/shm, or a user's home directory.",
            "data_sources": [
              "Auditd logs (execve syscall)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter auditd execve logs for all processes where the PPID is 1. For each event, analyze the full path of the executable. Maintain a baseline of standard binary paths for systemd-initiated processes (e.g., /usr/bin, /usr/sbin, /usr/lib). Generate an alert for any process executed from a non-standard location, especially world-writable directories. Calculate the entropy of filenames in these directories to detect the use of randomly generated names for executables."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using systemd timers?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1053.006",
        "name": "Systemd Timers",
        "evidence": [
          {
            "description": "Creation of a systemd .timer or .service file containing known malicious strings, executable names, or C2 domains within its definition.",
            "data_sources": [
              "Auditd logs (file creation/modification)",
              "File content analysis tools"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Use auditd rules to monitor for file creation or modification events on files ending in '.timer' or '.service' located in any systemd directory. Upon detection, trigger a scan of the file's content for known malicious indicators provided by threat intelligence, such as specific executable names (e.g., 'kdevtmpfsi'), C2 domains, or suspicious command-line patterns (e.g., '-no-color'). Alert on any matches."
          },
          {
            "description": "A new systemd .timer file is created with a corresponding .service file that is configured to execute a script or binary from a suspicious location like /tmp, /dev/shm, or a hidden directory.",
            "data_sources": [
              "Auditd logs (file creation/modification)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor auditd logs for creation events of '.timer' and '.service' files in systemd paths (e.g., /etc/systemd/system/, ~/.config/systemd/user/). Analyze the 'ExecStart' parameter within any new or modified .service file. Flag any unit files configured to execute binaries or scripts from world-writable directories, temporary locations, or hidden directories (e.g., paths starting with a '.'). This pattern is a common technique for placing malicious payloads."
          },
          {
            "description": "A legitimate systemd unit file is modified, or a new unit file is created by an unusual process, such as a web server daemon or a process from a user's interactive session.",
            "data_sources": [
              "Auditd logs (file modification",
              "execve syscall)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of legitimate systemd unit files using file hashes and ownership/permission metadata. Monitor for any modifications to these files or the creation of new files using auditd. For any change event, analyze the parent process that performed the action. Alert if the creating/modifying process is unexpected (e.g., 'nginx', 'apache2', an 'sshd' session for a non-administrative user, or any process running from /tmp). Use correlation analysis to link the file write event to the responsible user and their session."
          },
          {
            "description": "Systemd user-level timer and service files are created in a user's home directory, especially for service accounts or users who do not typically schedule tasks.",
            "data_sources": [
              "Auditd logs (file creation)",
              "User account database"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for file creation events within all '~/.config/systemd/user/' directories. Correlate the user context (UID) of the creation event with the user account type (e.g., interactive user, system/service account). Profile which users or user groups normally create such files. Use frequency analysis to flag the creation of user-level timers by accounts that have never done so before or by service accounts that should not have user-level persistence mechanisms."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to elevate privileges using systemd timers?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1053.006",
        "name": "Systemd Timers",
        "evidence": [
          {
            "description": "A systemd service file, configured to run as root, is created or modified to execute a binary or command associated with a known privilege escalation exploit or tool.",
            "data_sources": [
              "Auditd logs (file creation/modification)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor auditd logs for write events to '.service' files in privileged systemd directories (/etc/systemd/system, /lib/systemd/system). Scan the content of new or modified files. Alert if the 'ExecStart' line contains executable names, scripts, or command-line arguments matching a curated list of known privilege escalation tools and exploits (e.g., LinPEAS, pspy, DirtyCow variants)."
          },
          {
            "description": "Creation of a systemd .service file in a privileged path that lacks a 'User=' directive (defaults to root) and is configured to execute a script located in a world-writable directory.",
            "data_sources": [
              "Auditd logs (file creation)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor auditd for the creation of '.service' files in privileged systemd paths. Automatically parse new files to check for a 'User=' directive. If one is absent, the service will execute as root. Correlate the absence of this directive with an 'ExecStart' path that points to a world-writable location where a non-privileged user could place or modify a script, such as /tmp, /var/tmp, or /dev/shm. This combination is a classic and high-fidelity indicator of a privilege escalation attempt."
          },
          {
            "description": "A systemd unit file is created or modified in a privileged path by a process running with a non-root user ID, indicating a likely vulnerability exploit.",
            "data_sources": [
              "Auditd logs (file creation/modification)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Configure auditd rules to monitor write access to privileged systemd directories (e.g., /etc/systemd/system/). For every write event, log the effective user ID (euid) of the process that performed the write. Alert on any write event where the 'euid' is not 0 (root). This behavior directly detects a lower-privileged user or process creating a file that the root-level systemd daemon will later execute, representing a privilege escalation. Use correlation analysis to trace the event back to a specific user login session."
          },
          {
            "description": "A timer is set to trigger a service that runs as root and modifies critical system files, user accounts, or security configurations.",
            "data_sources": [
              "Auditd logs (file modification",
              "execve syscall)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate the execution of a process by systemd (PPID 1 and euid 0) with subsequent file modification events performed by that same process ID. Maintain a list of critical system configuration files (e.g., /etc/passwd, /etc/shadow, /etc/sudoers, SSH daemon configs, PAM configs). Alert if a systemd-initiated root process writes to any of these files. Use time series analysis on the modification events to determine if they occur at regular, timer-driven intervals, strengthening the evidence of a malicious scheduled task."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]