[
  {
    "information_requirement": "Has the adversary executed commands using the Windows command shell?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1059.003",
        "name": "Windows Command Shell",
        "evidence": [
          {
            "description": "Execution of cmd.exe with command-line arguments containing known malicious indicators of compromise (IOCs) such as specific IP addresses, domains, or file hashes.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Parse command lines from Windows Event ID 4688 for `cmd.exe` processes. Use regular expressions to extract potential IPs, domains, and file hashes. Cross-reference these extracted artifacts against high-confidence, continuously updated threat intelligence feeds. Alert on any direct matches for known malicious IOCs found within the command line, as this represents a high-fidelity selector-based detection."
          },
          {
            "description": "Use of cmd.exe with command-line patterns characteristic of obfuscation, defense evasion, or specific malicious toolsets.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze `cmd.exe` command lines from Windows Event ID 4688 for known malicious patterns. This includes: 1) heavy use of caret (`^`) or environment variable substitution for obfuscation, 2) commands redirecting output to `nul` to suppress errors/output (e.g., `> nul 2>&1`), 3) execution of LOLBAS (Living Off the Land Binaries) like `certutil`, `bitsadmin`, or `reg` with suspicious arguments, and 4) use of alternate data streams. Maintain and apply a library of regular expression patterns to detect these techniques."
          },
          {
            "description": "Execution of cmd.exe to run a sequence of commands typical of system reconnaissance, credential access, or data staging.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate multiple `cmd.exe` executions (Event ID 4688) launched by the same parent process or within a short time window (e.g., 5 minutes). Identify sequences of commands commonly used for discovery, such as `whoami` followed by `net user`, `ipconfig /all`, `tasklist`, `netstat -an`, and `systeminfo`. Develop rules that trigger on the co-occurrence of three or more of these discovery commands from the same source process. Use correlation analysis to link command sequences into a single alert representing a pattern of malicious behavior."
          },
          {
            "description": "Execution of cmd.exe with an anomalous parent process, such as a Microsoft Office application, web browser, or PDF reader.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for `cmd.exe` process creation. For each instance, analyze the parent process name. Maintain a baseline of common and expected parent processes for `cmd.exe` (e.g., `explorer.exe`, `services.exe`, legitimate scripts). Alert on `cmd.exe` instances spawned by unusual parents like `WINWORD.EXE`, `EXCEL.EXE`, `POWERPNT.EXE`, `OUTLOOK.EXE`, `chrome.exe`, or `AcroRd32.exe`. Use frequency analysis and box-plots to identify statistically rare parent-child relationships in the environment."
          },
          {
            "description": "A cmd.exe process initiating an outbound network connection, especially to an external or previously unseen destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Event ID 4688 for `cmd.exe`) with network connection events (Windows Event ID 5156) on the host. For any network connections made by `cmd.exe`, analyze the destination IP and port using Zeek conn.log. Compare the destination against a baseline of common destinations for the host/environment and cross-reference with threat intelligence feeds. Use time series analysis or frequency analysis to detect statistically rare or first-time connections from `cmd.exe` to external IPs, flagging them for investigation as this behavior is highly anomalous."
          },
          {
            "description": "Creation and subsequent execution of batch scripts (.bat, .cmd) in unusual or user-writable file system locations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for file creation events (Event ID 4663) for files with `.bat` or `.cmd` extensions. Flag creations in atypical locations like user profile temporary directories (`%TEMP%`, `%APPDATA%`), public directories (`C:\\Users\\Public`), or the root of the system drive (`C:\\`). Correlate file creation with subsequent execution of that same file via `cmd.exe` (Event ID 4688). Establish a baseline of legitimate script paths and use it to identify outliers. Analyze the entropy of filenames to detect randomly generated script names, a common behavioral indicator."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]