[
  {
    "information_requirement": "Has the adversary elevated privileges using thread execution hijacking?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1055.003",
        "name": "Thread Execution Hijacking",
        "evidence": [
          {
            "description": "A process with a known malicious file hash initiates thread execution hijacking against a higher-privilege process.",
            "data_sources": [
              "Sysmon Event ID 10",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate the source process image (`SourceImage` from Sysmon Event ID 10 or `Creator Process Name` from Windows Event ID 4688) with a threat intelligence feed of known malicious file hashes. If a process with a known malicious hash attempts to access another process's threads (e.g., access mask including `PROCESS_VM_WRITE`, `THREAD_SET_CONTEXT`), flag as a high-confidence indicator. Prioritize alerts where the target process runs at a higher integrity level than the source."
          },
          {
            "description": "A specific sequence of process and thread access events indicative of thread hijacking (e.g., suspend, write memory, set context, resume) is initiated by a process not typically associated with debugging or system monitoring.",
            "data_sources": [
              "Sysmon Event ID 10",
              "Sysmon Event ID 8"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for a logical sequence of Sysmon Event ID 10 (ProcessAccess) events from the same Source/Target process pair within a short time window (e.g., <1 second). The pattern includes access masks for memory writing (`0x20`), memory operation (`0x8`), and thread manipulation (`0x100`, `0x2`). Correlate this with Sysmon Event ID 8 (CreateRemoteThread). Build a baseline of legitimate processes (e.g., debuggers, AV) that perform these actions and alert on any source process deviating from this known-good list, especially if the target is a system-critical or higher-privilege process (e.g., lsass.exe, svchost.exe). Use frequency analysis to identify rare SourceImage/TargetImage pairs performing these actions."
          },
          {
            "description": "A process running at a lower integrity level successfully opens a handle with high-risk access rights to a process at a higher integrity level.",
            "data_sources": [
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Sysmon Event ID 10 events, specifically comparing the integrity levels of the `SourceImage` and `TargetImage`. Flag any instance where a process running at a lower integrity level (e.g., Medium) successfully opens a handle with write/execute permissions (e.g., access mask including `PROCESS_VM_WRITE`, `THREAD_SET_CONTEXT`, `PROCESS_CREATE_THREAD`) to a process at a higher integrity level (e.g., High, System). This is a strong behavioral indicator of a privilege escalation attempt via injection."
          },
          {
            "description": "A process performs privileged actions, such as accessing protected files or registry keys, which are inconsistent with its user context or typical behavior, immediately following a suspected thread hijacking event.",
            "data_sources": [
              "Sysmon Event ID 10",
              "Windows Event ID 4663",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate a suspected injection event (identified by pattern detection from Sysmon Event ID 10) with subsequent high-privilege activity from the *target* process. Monitor Windows Event IDs 4663 (sensitive file access) and 4657 (protected registry modification) for the target process accessing resources it does not normally access (e.g., SAM hive, system registry keys). Use descriptive statistics and baselining to flag statistically significant deviations that occur shortly after a Sysmon Event ID 10 targets that process."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using thread execution hijacking?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1055.003",
        "name": "Thread Execution Hijacking",
        "evidence": [
          {
            "description": "A legitimate process, after being targeted by thread hijacking, initiates network connections to known malicious C2 servers or domains.",
            "data_sources": [
              "Zeek conn.log",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join network connection logs (Zeek conn.log) where the destination IP/domain is on a CTI feed of known C2 infrastructure with host-level logs. Correlate the source IP and timestamp of the network connection back to the host and identify the initiating process. If the initiating process is a common, legitimate one (e.g., explorer.exe, svchost.exe) that was recently the `TargetImage` in a Sysmon Event ID 10 event, flag as a high-confidence indicator of defense evasion."
          },
          {
            "description": "Thread hijacking is directed at processes known to have network access privileges or which are commonly whitelisted in security tools (e.g., browsers, svchost.exe, powershell.exe) to masquerade malicious activity.",
            "data_sources": [
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Sysmon Event ID 10 events. Create a list of high-value target processes for defense evasion (e.g., explorer.exe, svchost.exe, chrome.exe, firefox.exe). Assign a higher risk score to any thread hijacking attempt (identified by suspicious source process or access mask sequences) where the `TargetImage` is on this list. Use frequency analysis to detect if a specific legitimate process is being targeted for injection more often than others across the environment, which may indicate a specific evasion campaign."
          },
          {
            "description": "A hijacked legitimate process exhibits anomalous behavior inconsistent with its normal function, such as spawning unusual child processes, writing unexpected files, or making unusual network connections.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal activity for common legitimate processes (e.g., typical child processes, network destinations, file write locations). After a process is identified as a target of injection (via Sysmon EID 10), monitor its subsequent actions. For process creation (Event ID 4688), flag any child processes with high-entropy command lines or unusual file paths. For network connections (Zeek conn.log), use time series analysis on traffic volume and correlation analysis to flag anomalous connections to rare ports or geolocations."
          },
          {
            "description": "A process, after being targeted for injection, communicates over the network using protocols or ports inconsistent with its documented function.",
            "data_sources": [
              "Zeek conn.log",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of typical network protocols and destination ports for common legitimate processes (e.g., browsers use TCP/80, TCP/443). Correlate network connections in Zeek logs with host-level process information. If a process that was recently a `TargetImage` in a Sysmon Event ID 10 event begins communicating using an anomalous protocol/port combination (e.g., a browser initiating SMB or raw TCP traffic on a non-standard port), flag it as a behavioral anomaly indicating its functionality has been hijacked. Use correlation analysis to link the network anomaly to the process access event."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]