[
  {
    "information_requirement": "Is the adversary attempting to exfiltrate data?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1052.001",
        "name": "Exfiltration over USB",
        "evidence": [
          {
            "description": "Execution of a process with a file hash known to be associated with malicious data staging or exfiltration tools.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor all process creation events (Windows Event ID 4688) and calculate the hash of the executable file for each new process. Compare this hash against a cyber threat intelligence (CTI) feed of known malicious tools used for data collection, compression (e.g., non-standard 7-zip binaries), or exfiltration. Alert on any match, especially if the process command line targets sensitive directories or removable media drive letters."
          },
          {
            "description": "Execution of command-line utilities (e.g., robocopy, xcopy, powershell) with syntax specifically patterned for bulk data copying to removable media.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Event ID 4688) for common command-line utilities. Use regular expressions to detect command-line patterns specifically designed for recursively copying large directory structures, such as `robocopy <source_path> <destination_drive_letter> /E /S` or `xcopy <source_path> <destination_drive_letter> /S /E /H /Y`. Also monitor for PowerShell `Copy-Item -Recurse -Force` commands. Maintain a list of sensitive source paths (e.g., user profiles, document repositories, network shares) and flag when these are the source and a removable drive letter is the destination. Correlate with the user account to check for legitimacy."
          },
          {
            "description": "An anomalous volume of file write or read operations to a removable storage device, deviating significantly from established user or host baselines.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable file system auditing (SACL) on sensitive directories and monitor for file access events (Event ID 4663) where the Object Name corresponds to a removable drive path. Establish a baseline for data volume written to USB devices per user/host over a rolling time window (e.g., per hour, per day). Use time series analysis or descriptive statistics (e.g., mean, standard deviation, Inter-Quartile Range) to detect significant spikes in the count or total size of data being written to a USB device. Investigate outliers that exceed a dynamic threshold (e.g., 3 standard deviations above the mean)."
          },
          {
            "description": "A sequence of events indicating data staging followed by transfer to a newly connected removable storage device.",
            "data_sources": [
              "System Log PnP Events",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for the connection of a new USB mass storage device (e.g., via Plug and Play events in the System Log). Correlate this connection event by hostname and timestamp with subsequent process creation events (Event ID 4688) within a short time window (e.g., 5-10 minutes). Specifically look for compression utilities (zip, rar, 7z) or copy utilities accessing sensitive directories, followed by a high volume of file write events (Event ID 4663) to the drive letter assigned to the newly connected USB device. Use correlation analysis to automatically link the sequence of device connection -> data staging -> data copy for analyst review."
          },
          {
            "description": "File copy or read operations to a removable storage device occurring outside of normal business hours, or from user accounts that do not typically perform such actions (e.g., service accounts).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze file access (4663) and process creation (4688) events related to removable media. Establish a baseline of 'normal' business hours for the organization and profile user accounts based on their roles. Flag any significant data transfer to USB devices occurring outside this window. Also flag any USB write activity from accounts that should not be using removable media (e.g., service accounts, specific admin roles) or from users who have no historical precedent for such actions. Use linear regression or user-behavior analytics to model normal activity and detect statistically significant deviations."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]