[
  {
    "information_requirement": "Is the adversary communicating with external infrastructure using web protocols for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1071.001",
        "name": "Web Protocols",
        "evidence": [
          {
            "description": "HTTP/S connections to domains, IP addresses, or involving SSL/TLS certificates known to be associated with command and control infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join destination IPs from Zeek conn.log, host headers from Zeek http.log, and server names/certificate subjects from Zeek ssl.log against a high-confidence, frequently updated cyber threat intelligence (CTI) feed of known malicious C2 domains, IPs, and certificate fingerprints. Alert on any confirmed matches and investigate the source endpoint."
          },
          {
            "description": "Use of specific HTTP headers, URL structures, or TLS artifacts (JA3/JA3S hashes) matching patterns of known C2 frameworks or malware families.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan Zeek http.log for User-Agent strings, HTTP headers, and URL query parameter structures that match published signatures for known C2 frameworks (e.g., Cobalt Strike, Metasploit). Use regular expression matching against a curated list of these patterns. Additionally, analyze Zeek ssl.log to identify client-side JA3 and server-side JA3S TLS fingerprints and match them against a list of hashes known to be used by malware C2."
          },
          {
            "description": "Repetitive, periodic network connections over web protocols to a single external destination, characteristic of C2 beaconing or heartbeat activity.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each internal source IP, analyze the timestamps of outbound HTTP/S connections (ports 80, 443) to external destinations in Zeek conn.log. Calculate the time difference (delta) between consecutive connections to the same destination. Use time series analysis or descriptive statistics (mean, standard deviation, variance) on these deltas to identify connections occurring at highly regular, non-human intervals (e.g., low variance in deltas). Flag source-destination pairs exhibiting this beaconing behavior for further investigation."
          },
          {
            "description": "HTTP/S traffic originating from processes not typically associated with user web browsing or legitimate system activity, or from unusual file paths on disk.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network connection events (Windows Event ID 5156, if enabled) with process creation events (Windows Event ID 4688) to identify the parent process of outbound HTTP/S traffic. Establish a baseline of normal processes that communicate externally (e.g., chrome.exe, firefox.exe, svchost.exe). Use frequency analysis to flag connections from rare processes (e.g., powershell.exe, rundll32.exe connecting to the internet) or processes running from atypical locations (e.g., %APPDATA%, %TEMP%, C:\\Windows\\Temp)."
          },
          {
            "description": "Anomalous characteristics within HTTP/S traffic, such as high-entropy data in URLs or headers, unusually long URIs, or data flow ratios where client-sent bytes significantly exceed server-sent bytes.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek http.log fields (URI, User-Agent, custom headers) for unusual length by calculating baselines and identifying outliers using percentile analysis or Z-scores. Calculate the Shannon entropy for these same fields to detect encoded or encrypted data being passed in cleartext channels. In parallel, analyze Zeek conn.log to calculate the ratio of client-sent bytes to server-sent bytes (orig_bytes / resp_bytes) for web traffic. Use Inter-Quartile Range (IQR) or simple thresholds (e.g., ratio > 10) to flag sessions where the client is uploading significantly more data than it is downloading, which is anomalous for typical web browsing and indicative of data exfiltration over C2."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]