[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by clearing logs?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.001",
        "name": "Clear Windows Event Logs",
        "evidence": [
          {
            "description": "Execution of processes with file hashes known to be associated with malicious log clearing tools or offensive security frameworks.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688). Extract the file hash (e.g., SHA256) of every new executable created. Correlate these hashes against a high-confidence cyber threat intelligence feed of known malicious tool hashes (e.g., Mimikatz, custom log wipers) that include log clearing capabilities. Generate a high-priority alert on any match."
          },
          {
            "description": "Generation of Windows Event ID 1102, or command-line execution of utilities like `wevtutil.exe cl` or PowerShell's `Clear-EventLog`.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a high-priority alert for any occurrence of Windows Event ID 1102 (The audit log was cleared). Additionally, monitor process creation logs (Windows Event ID 4688) for command-lines containing `wevtutil` with the `cl` or `clear-log` argument, or PowerShell commands using `Clear-EventLog`. Use correlation analysis to link these command executions to the user context and parent process; any execution outside of authorized, scheduled administrative tasks is highly suspicious."
          },
          {
            "description": "Direct deletion of Windows event log files (.evtx) from the file system, particularly in the `C:\\Windows\\System32\\winevt\\Logs` directory.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable and monitor System Access Control Lists (SACLs) on the `C:\\Windows\\System32\\winevt\\Logs` directory to generate Windows Event ID 4663 (An attempt was made to access an object). Create a high-severity alert specifically for file deletion attempts (`Accesses: DELETE`) targeting files with the `.evtx` extension. Correlate this event with the source process name from the event data or by linking it via timestamp to a preceding Windows Event ID 4688 to identify the process responsible (e.g., `del.exe`, `cmd.exe`). Such activity is almost always malicious."
          },
          {
            "description": "Anomalous and unexplained drop or complete cessation of event log forwarding from a host, indicating logs are being cleared, deleted, or the logging service is stopped.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Within a central log management platform, monitor the rate of incoming Windows Event IDs from each host. Use time series analysis to establish a dynamic baseline of normal log volume and variance per host. Generate an alert when the log rate shows a statistically significant drop (e.g., falls more than three standard deviations below the mean for a sustained period) or a complete cessation of logs that is not correlated with a known maintenance window or shutdown event. Additionally, monitor for Windows Event ID 7036 indicating the 'Windows Event Log' service has entered a stopped state, which is highly irregular."
          },
          {
            "description": "Log clearing activity occurring in close temporal proximity to other suspicious behaviors, such as execution of hacking tools, privilege escalation, or creation of new user accounts.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688",
              "Windows Event ID 4672",
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define a critical event sequence that triggers an investigation when a log clearing event (e.g., Event ID 1102 or `wevtutil` execution from Event ID 4688) occurs within a short time window (e.g., 5-30 minutes) of other high-risk activities on the same host. Correlate with events such as: process creation (4688) for known malicious tools, assignment of special privileges (4672), or creation of a new user account (4720). Use correlation analysis to automatically link these events by host and timestamp to build a timeline of an adversary's actions before they attempted to cover their tracks."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]