[
  {
    "information_requirement": "Is the adversary collecting and staging data from multiple systems for exfiltration?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1074.002",
        "name": "Remote Data Staging",
        "evidence": [
          {
            "description": "An archive file is created whose filename or SHA256 hash matches a known-bad indicator from threat intelligence feeds.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Common staging directories (%TEMP%, %PUBLIC%, C:\\Perflogs), file servers, and domain controllers.",
            "action": "Continuously monitor file creation events (Windows Event ID 4663) and associated process creation events (Windows Event ID 4688). (Symbolic) For files with extensions like .zip, .rar, .7z, .tar, .gz, compare the filename and the file's SHA256 hash against a threat intelligence feed of known malicious staging filenames and tool hashes. Generate a high-severity alert on any match. (Statistical) Establish a baseline of processes that normally create archive files (e.g., 'backup.exe', 'winzip.exe'). If an unusual process (e.g., 'powershell.exe', a randomly named executable) creates an archive, flag it. An alert is triggered if the frequency of archive creation by a non-standard process exceeds the 95th percentile of its own activity. (Machine Learning) Use a supervised classification model (e.g., Random Forest) trained on features from process execution (e.g., parent process name, command-line entropy, file extension, target directory) to predict the likelihood that a given file creation event is malicious. Alert on predictions with a confidence score above 0.9."
          },
          {
            "description": "An archive file (.zip, .rar, .7z) is created in a directory not typically used for archiving (e.g., C:\\Users\\Public, %TEMP%) by a process not associated with standard backup or user archiving software (e.g., powershell.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, publicly writable network shares, and web server directories.",
            "action": "(Symbolic) Define a list of 'sensitive' directories (e.g., C:\\, %APPDATA%, C:\\Windows\\Temp) and a list of 'standard' archiving processes (e.g., 7z.exe, WinRAR.exe). Create a rule that alerts when a process NOT on the standard list creates a file with an archive extension in a directory on the sensitive list. (Statistical) For each host, profile the parent-child process relationships that result in archive creation. Calculate the historical probability $$ P(\\text{archive creation} | \\text{parent process}) $$. Alert when an archive is created by a process with a historically low probability of doing so, for example, where $$ P < 0.05 $$. (Machine Learning) Implement a time-series anomaly detection model (e.g., ARIMA) on the volume of archive files created per hour, segmented by directory type (e.g., user profile, temp). Alert if the observed volume in a sensitive directory (like %TEMP%) significantly deviates from the forecasted volume."
          },
          {
            "description": "A host receives an anomalously high volume of data or number of connections from multiple internal sources, and within a short time window, a large archive file is created on that host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (core switches), critical servers (file servers, database servers), and the DMZ.",
            "action": "(Symbolic) Create a correlation rule that triggers when a host receives inbound connections (Zeek conn.log) from > 10 internal IPs within 5 minutes AND a file creation event (Windows Event ID 4663) for a file > 100MB with an archive extension occurs on that same host within 10 minutes of the network activity. (Statistical) In Zeek conn.log, establish a baseline of bytes_in and distinct_source_IPs per host over a 15-minute window. Alert if a host's inbound bytes or source IP count exceeds 3 standard deviations from its baseline. Enrich this network alert with host data to check for subsequent large archive creation, increasing the alert's priority if found. (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) on network flow data to identify hosts acting as data aggregators based on features like destination IP, count of unique source IPs, and total bytes transferred. Analyze on-host activity on the identified aggregator hosts to confirm if staging is occurring."
          },
          {
            "description": "A single command-line execution (e.g., via cmd.exe, powershell.exe, robocopy) references multiple, distinct source directories and a single destination file, particularly one with an archive or temporary extension.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, administrator workstations, and servers hosting development or source code repositories.",
            "action": "(Symbolic) Use regular expressions to parse command lines from process creation events (Windows Event ID 4688). Alert on commands from 'cmd.exe' or 'powershell.exe' that use file copy operations (e.g., 'copy', 'robocopy', 'Copy-Item') and contain multiple distinct high-level directory paths (e.g., 'C:\\Users\\', 'D:\\Projects\\') as sources. (Statistical) For each command-line execution, calculate the Shannon entropy of the command-line string. Establish a baseline entropy score for common processes. Alert when the entropy score for a command involving file manipulation exceeds the 98th percentile for that executable. (Machine Learning) Train a sequence-to-sequence autoencoder on benign command-line argument sequences. Alert on commands where the reconstruction error surpasses a dynamically adjusted threshold, indicating a significant deviation from normalcy."
          },
          {
            "description": "A single process or user context generates a high volume of file read events (Object-Access: 'ReadData') across multiple directories within a short time frame, deviating from its established baseline of file access behavior.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File shares containing PII, financial, or intellectual property data, user home directories, and code repositories.",
            "action": "Note: This action requires enabling file/folder access auditing (SACL) on critical directories. (Symbolic) Create a rule that alerts if a process associated with a network service (e.g., 'httpd.exe') is observed reading files (Windows Event ID 4663 with AccessMask for Read) from user profile directories (e.g., 'C:\\Users\\*\\Documents\\*'). (Statistical) For each process, build a baseline of the number of unique directories it reads from in a 1-hour window. Use a percentile-based threshold (e.g., 99th percentile) to detect when a process suddenly reads from an anomalously high number of directories. (Machine Learning) Model file accesses as a bipartite graph with nodes for processes and files. Use a graph-based anomaly detection algorithm to detect the sudden appearance of a 'star' pattern where one process node connects to a massive number of previously unconnected file nodes, indicating a mass-read event characteristic of staging."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]