[
  {
    "information_requirement": "Is the adversary staging data prior to exfiltration?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1074",
        "name": "Data Staged",
        "evidence": [
          {
            "description": "Creation or modification of files with names or hashes matching known adversary data staging tools or output archives.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) and file write events (Windows Event ID 4663) for filenames or file hashes. Inner join these artifacts against a high-confidence cyber threat intelligence (CTI) feed of known malicious archivers, data staging scripts, or specific archive filenames used by threat actors (e.g., 'update.zip' in C:\\ProgramData). An exact match on a known malicious hash or filename should trigger a high-priority alert."
          },
          {
            "description": "Creation of common archive file types (e.g., .zip, .rar, .7z) using non-standard processes, or using command-line flags indicative of password protection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process command lines of common archive utilities (7z.exe, rar.exe) or system tools (powershell.exe, certutil.exe). Search for patterns involving compression flags and especially password protection flags (e.g., '-p', '-hp', '-s', 'Protect-Archive'). Correlate these processes with file write events (Windows Event ID 4663) creating files with extensions like '.zip', '.rar', '.7z', '.gz' in atypical directories (e.g., C:\\Users\\Public, %APPDATA%) or common staging areas (C:\\Windows\\Temp). Flag processes like 'powershell.exe' creating archives."
          },
          {
            "description": "A single process reading an unusually high number of distinct files or directories, followed by writing to a single, often compressed, output file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process activity (via Process ID in Windows Event ID 4663) with file system auditing. For a given process, track the number of unique source directories it reads from and the number of destination files it writes to within a short time window. Use descriptive statistics to establish a baseline for normal file read/write ratios per process (e.g., for svchost.exe) and flag significant outliers. Calculate the entropy of source file paths accessed by a process; a high entropy value indicates collection from disparate locations and is a strong indicator of staging."
          },
          {
            "description": "Anomalous volume of file write activity or a sudden increase in disk usage within a short time frame in a temporary or world-writable directory.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor the rate of file write events (Windows Event ID 4663) per host and per specific directory (e.g., C:\\Windows\\Temp, C:\\$Recycle.Bin). Use time series analysis (e.g., with a simple moving average and standard deviation bands) on the count of write events per minute to detect sudden spikes that significantly exceed the historical baseline for that host or directory type. Correlate alerts with the responsible process (identified in Event 4663 and 4688) and examine its command line for context."
          },
          {
            "description": "Unusual large-volume internal network transfers, particularly to a system that has limited legitimate reasons to receive bulk data, potentially followed by data exfiltration from that staging host.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log to establish a baseline of internal network traffic patterns (source, destination, protocol, byte counts). Use a linear regression model or simple statistical profiling (mean, std dev) to predict expected data transfer volumes between internal host pairs and flag flows that are significant outliers (e.g., >3 standard deviations above the mean or predicted volume). Prioritize alerts where the destination host is a workstation rather than a file/backup server. Create a higher-level correlated alert by joining these large internal transfer events with subsequent external connections (to non-corporate IPs) with high data volume originating from the staging host within a defined time window (e.g., 1-24 hours)."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]