[
  {
    "information_requirement": "Has the adversary gained initial access using compromised domain accounts?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "Domain account authentication attempt from a source IP address on a threat intelligence feed of known malicious actors.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate the source IP addresses from both failed (Event ID 4625) and successful (Event ID 4624) external domain account authentication events against a high-confidence, daily-updated threat intelligence feed of malicious IPs (e.g., known scanners, brute-force sources, C2 nodes). Inner join Zeek conn.log data for connections to authentication endpoints with the same feed. Alert on any matches."
          },
          {
            "description": "Network traffic patterns indicative of password spraying or brute-force attacks against domain accounts from an external source.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate Windows Event ID 4625 (failure) logs by source IP. For password spraying, detect a single source IP generating failures for a high number of distinct domain accounts in a short time window (>20 accounts in 5 mins). For brute-force, detect a single source IP generating a high number of failures for one or few accounts (>20 failures for 1 account in 5 mins). Use descriptive statistics on failure counts per source IP/account and flag outliers. Correlate with any subsequent successful login (Event ID 4624) from the attacking IP."
          },
          {
            "description": "A domain account exhibits impossible travel, logging in from two geographically distant locations within a time frame that is physically impossible.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each domain account, log the timestamp and geolocated source IP of every successful login (Event ID 4624). For each new login, compare its location and time with the previous login. Calculate the required travel speed to connect the two points in the elapsed time. Alert on any instance where the speed exceeds a realistic threshold (e.g., 600 mph), indicating a compromised account."
          },
          {
            "description": "A domain account successfully authenticates from a new or anomalous external location (Country, ASN, ISP) for the first time.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a historical baseline of all source countries, Autonomous System Numbers (ASNs), and ISPs for each domain account's successful logins (Event ID 4624). When a new login occurs, compare its source against the account's baseline. Alert on the first-ever login from a new country or any login from a source whose rarity (based on frequency analysis or percentile ranking) exceeds a defined risk threshold."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using compromised domain accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "A domain account establishing network connections to IP addresses or domains known to be associated with C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network connections (Zeek conn.log) and DNS queries (Zeek dns.log) made by hosts where a compromised domain account is logged in against a threat intelligence feed of known C2 servers. Alert on any matches. This requires mapping active logins on hosts to network traffic from those hosts."
          },
          {
            "description": "Creation of a new domain account, especially one added to a privileged group, with a suspicious name (e.g., high entropy, common wordlist pattern).",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4728",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for the creation of new domain accounts (Event ID 4720). Analyze the username for suspicious characteristics: calculate the character entropy to detect random-looking names, and check against lists of common service/admin names used by attackers. Correlate the account creation with immediate addition to privileged groups (Event IDs 4728, 4732) and alert with high priority."
          },
          {
            "description": "A standard user domain account is used to create a new system service or a scheduled task that executes a suspicious payload or command.",
            "data_sources": [
              "Windows Event ID 4697",
              "Windows Event ID 4698"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for new service installation (Event ID 4697) and scheduled task creation (Event ID 4698). Scrutinize events created under the context of standard user accounts rather than system or administrator accounts. Analyze the command line or image path for suspicious executables, scripts, or connections to external resources. Baseline normal service/task creation and alert on deviations."
          },
          {
            "description": "A domain account exhibits consistent, robotic login or activity patterns, such as logging in at the exact same time each day or generating network traffic with perfectly regular intervals.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze login timestamps (Event ID 4624) and network connection start times (Zeek conn.log) for individual domain accounts. Use time series analysis to detect unnaturally consistent or periodic behavior indicative of automated scripts for persistence. Calculate the variance or standard deviation of login times or beacon intervals; an extremely low value may indicate automation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary elevated privileges using compromised domain accounts?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "A domain account executes a command-line utility to add itself or another user to a privileged local or domain group.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Event ID 4688) for the execution of `net.exe` or PowerShell cmdlets (`Add-LocalGroupMember`, `Add-ADGroupMember`). Scan the command line arguments for patterns matching the addition of users to well-known privileged groups like 'Administrators', 'Domain Admins', 'Remote Desktop Users'. Alert on any non-admin account performing such an action."
          },
          {
            "description": "Sequence of an account being added to a privileged group followed immediately by that account being used to perform a privileged action.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlation rule that triggers when a user account is added to a privileged group (e.g., Domain Admins, via Event ID 4728 or 4732) and is then used for a privileged logon (e.g., interactive logon, Type 2/10 via Event ID 4624 to a Domain Controller) within a short time window (e.g., < 15 minutes). This sequence strongly indicates privilege escalation being put to use."
          },
          {
            "description": "A recently privileged domain account performs an action for the first time, such as accessing a Domain Controller's admin share or running ntdsutil.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a baseline of privileged activities for each account. After an account is added to a privileged group, monitor for its 'first use' of new permissions. This includes first-time access to sensitive network shares like ADMIN$ or C$ on a Domain Controller (Event ID 5145), first-time execution of privileged tools like `ntdsutil.exe` or `diskshadow.exe` (Event ID 4688), or first-time access to the SAM file (Event ID 4663). Alert on any such 'firsts' for a newly privileged account."
          },
          {
            "description": "A domain account logs on with elevated privileges (UAC bypass/full token) where it previously did not.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4648"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor successful logon events (Event ID 4624). Specifically look for Logon Type 9 (NewCredentials) and analyze the 'Token Elevation Type' field. A value of 'TokenElevationTypeDefault (1)' indicates a full, unelevated token, while 'TokenElevationTypeFull (2)' indicates an elevated token. Baseline this behavior per account and alert when an account that typically operates without elevation suddenly logs in with a full admin token, which can indicate a UAC bypass."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using compromised domain accounts?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "A domain account is used to execute commands that disable or reconfigure security tools like antivirus or host-based firewalls.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Event ID 4688) for command lines indicative of tampering with security defenses. Create specific detection rules for commands like `Set-MpPreference -DisableRealtimeMonitoring $true`, `netsh advfirewall set allprofiles state off`, or registry modifications via `reg.exe` that target security tool configuration keys. Alert when a standard user domain account executes these commands."
          },
          {
            "description": "A legitimate domain account is used to run a common system process (e.g., powershell.exe, certutil.exe) with suspicious arguments or from an unusual file path.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Event ID 4688). Profile normal parent-child process relationships and command-line arguments for legitimate system tools. Alert when a domain account runs a tool like `certutil.exe` with `-urlcache -split -f` to download files, or runs `powershell.exe` with encoded commands (`-e`, `-enc`). Also flag processes running from non-standard locations like `C:\\Users\\Public\\`, `%APPDATA%`, or temporary directories."
          },
          {
            "description": "A domain account is used to clear or tamper with Windows Event Logs.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for Event ID 1102, which indicates 'The audit log was cleared'. This is a highly suspicious event. Correlate the timestamp of this event with other activity on the host. Also, monitor process creation (Event ID 4688) for the execution of `wevtutil.exe` with the `cl` or `clear-log` argument. Alert immediately and investigate the user account responsible."
          },
          {
            "description": "A standard user domain account is associated with an unusual logon type typically reserved for services or system processes.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze successful logon events (Event ID 4624), focusing on the Logon Type. Baseline the expected logon types for each user account (typically Type 2 for interactive, Type 3 for network, Type 10 for remote interactive). Alert when a standard interactive user account is observed with a logon type like Type 5 (Service), Type 4 (Batch), or Type 8 (NetworkCleartext), as this could indicate abuse of system functions to evade detection."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]