[
  {
    "information_requirement": "Is the adversary discovering files and directories?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1083",
        "name": "File and Directory Discovery",
        "evidence": [
          {
            "description": "Execution of known malicious discovery scripts or tools identified by file name or hash.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688). Continuously compare the process name and file hash of executed files against a cyber threat intelligence (CTI) feed of known malicious discovery scripts and enumeration tools (e.g., PowerSploit's `Find-InterestingFile`, Seatbelt.exe, BloodHound collectors like SharpHound.exe). An alert should be triggered upon any match, as this is a high-confidence indicator of malicious activity."
          },
          {
            "description": "Execution of built-in system utilities (e.g., dir, find, where, ls) with specific command-line argument patterns commonly used for wide-scoping reconnaissance.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for common enumeration commands. Use regular expressions to match specific argument patterns indicative of malicious discovery, such as recursive searches (`dir /s /b`, `find . -name '*'`), searches for specific sensitive extensions (`dir /s *.kdbx`), enumeration of network shares (`dir \\\\*\\c$`), or commands that redirect output to a file (`> results.txt`). Prioritize alerts for these patterns when executed by non-interactive users, system accounts, or web server processes."
          },
          {
            "description": "An anomalous volume or frequency of file system discovery commands or file access events generated by a single user or process, deviating from established baselines.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal file discovery activity (e.g., count of `dir`, `ls` commands from Event ID 4688; count of file/directory access events from Event ID 4663) per user and per parent process over time. Use time series analysis and descriptive statistics (e.g., mean, standard deviation) to detect significant spikes in this activity. A box-plot of daily discovery command counts per user can be used to visually identify outlier behavior that warrants investigation."
          },
          {
            "description": "A process or user accessing an unusually high number or variety of sensitive directories or file types in a short period, indicating targeted information gathering.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and monitor a watchlist of sensitive file paths, directories (e.g., `%APPDATA%`, `C:\\Users\\*\\Documents`, `\\System32\\config`), and file extensions (`.kdbx`, `.pst`, `.bak`, `.config`, `.pem`). Monitor access attempts to these objects (Windows Event ID 4663). Calculate the entropy of directories or file types accessed by a single process within a short time window (e.g., 5 minutes). A sudden increase in entropy or access to multiple distinct categories of sensitive files by a single process (e.g., `svchost.exe`, `powershell.exe`) is highly suspicious. Correlate with the parent process from Event ID 4688 to understand the context of the access."
          },
          {
            "description": "An anomalous pattern of network share enumeration (SMB) across multiple servers, characterized by high volume, rapid succession, or access from a host not typically involved in such activity.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek `smb_files.log` for file and directory listing actions. Establish a baseline for normal share enumeration activity per host. Use descriptive statistics to flag hosts that connect to an unusually high number of distinct servers or shares in a short period (e.g., accessing a number of shares greater than the 95th percentile of their peer group). Use time series analysis to detect sudden spikes in enumeration traffic from a single source. Use correlation analysis with Zeek conn.log to visualize the source-destination graph of share access and identify 'fan-out' enumeration patterns."
          },
          {
            "description": "A correlated sequence of discovery activities, such as local file enumeration immediately followed by network share discovery and then data staging in an archive file.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Develop a high-fidelity correlation rule that chains suspicious events across data sources. For example, trigger a priority alert if a single host exhibits the following sequence within a defined time window (e.g., 1 hour): 1. Execution of a recursive `dir` command targeting sensitive directories (Event ID 4688). 2. Followed by anomalous network share enumeration across multiple servers (Zeek `smb_files.log`). 3. Followed by the creation of a large archive file (e.g., `.zip`, `.rar`, `.7z`) detected via Event ID 4688. This behavioral sequence detection is highly indicative of pre-exfiltration discovery and staging."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]