[
  {
    "information_requirement": "Has the adversary attempted to enumerate cloud accounts?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1087.004",
        "name": "Cloud Account",
        "evidence": [
          {
            "description": "Network connections to cloud provider Identity and Access Management (IAM) API endpoints originating from IP addresses on threat intelligence lists or from unauthorized geolocations.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses from Zeek conn.log traffic destined for known cloud IAM API endpoints (e.g., iam.amazonaws.com, graph.microsoft.com, iam.googleapis.com) against an up-to-date CTI feed of malicious IPs or known anonymizing proxies (e.g., TOR exit nodes). Separately, geolocate all source IPs making these connections and alert on any originating from countries where the organization has no presence or from which access is explicitly forbidden by policy."
          },
          {
            "description": "Execution of processes with command-line arguments containing specific keywords and parameters used for enumerating cloud accounts, roles, or policies via common cloud CLI tools or scripts.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) logs for command-lines containing patterns indicative of cloud account enumeration. This includes processes like 'pwsh.exe', 'az.exe', 'aws.exe', 'gcloud.exe' with arguments such as 'Get-Msol*', 'Get-AzureAD*', 'az ad user list', 'aws iam list-users', 'gcloud projects get-iam-policy'. Maintain a watchlist of these patterns and use regular expressions for detection. Use frequency analysis to identify rare or first-time execution of these command patterns on a given host or by a specific user."
          },
          {
            "description": "A single host or user making an unusually high volume or broad range of enumeration-related API calls to cloud providers in a short period, deviating from established baselines.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek http.log for requests to cloud IAM API endpoints. Establish a baseline for the number and variety (entropy) of enumeration-related API calls (e.g., list-users, list-roles, get-policy) per user/host per hour. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect significant increases in the volume of these calls. Analyze the entropy of the API endpoints/actions being called; a sudden spike in entropy from a single source could indicate broad discovery activity. Correlate with Zeek conn.log to attribute activity to specific internal hosts."
          },
          {
            "description": "A non-administrator host or a user outside of a typical cloud administration team executing cloud CLI processes that are immediately followed by network connections to cloud IAM API endpoints.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate Windows Event ID 4688 events for cloud CLI execution (e.g., 'az.exe', 'aws.exe') with subsequent Zeek conn.log entries showing network connections from the same host to cloud IAM APIs within a short time window (< 1 minute). Enrich this data with user/host context from asset management or identity systems. Prioritize alerts where the user is not a member of a cloud administration group or the host is not a designated administrative workstation. Use correlation analysis to link the process execution with the network traffic and user identity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]