[
  {
    "information_requirement": "Has the adversary moved laterally by tainting shared content?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1080",
        "name": "Taint Shared Content",
        "evidence": [
          {
            "description": "A file written to a network share has a hash or filename that matches a known malicious indicator.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek files.log",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise file shares (SMB, NFS), document management systems (e.g., SharePoint), and public-access network drives.",
            "action": "For each file creation event on a network share (Sysmon Event ID 11, Windows Event ID 4663 with Object Type 'File' and Accesses 'WriteData', or Zeek files.log), perform three checks. First, for symbolic detection, calculate the file's SHA256 hash and join it against a threat intelligence database of known malicious file hashes; alert on any match. Second, for a statistical approach, analyze the filename against a baseline of common filenames per share; flag filenames with a statistically low frequency of occurrence (e.g., below the 5th percentile) or those containing high-entropy strings. Third, for a machine learning approach, use a pre-trained classification model to score file metadata (e.g., extension, size, source user, source process) and alert if the malicious probability score exceeds a defined threshold (e.g., $$ p > 0.85 $$)."
          },
          {
            "description": "A file created or modified on a network share is identified as a suspicious type (e.g., LNK, script) containing characteristics of obfuscation or malicious commands.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Sysmon Event ID 11",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User home directories hosted on network shares, software deployment shares, and staging directories used by developers or administrators.",
            "action": "Monitor file creation events (Sysmon Event ID 11, Windows Event ID 4663) on network shares. For symbolic detection, parse .LNK files to find target paths invoking scripting engines (powershell.exe, cmd.exe, wscript.exe) or use regular expressions on script files (.ps1, .vbs) to find obfuscation keywords like 'Invoke-Expression' or 'FromBase64String'. For statistical analysis, calculate the character entropy of all script files and alert on any file whose entropy score exceeds a baseline threshold (e.g., > 3 standard deviations from the mean for that file type), indicating potential packing or obfuscation. For a machine learning approach, leverage a Natural Language Processing (NLP) model trained to classify script content as 'benign' or 'malicious' based on function calls, structure, and string patterns, alerting on a 'malicious' classification with high confidence."
          },
          {
            "description": "A user or process exhibits an anomalous pattern of file modification activity on a network share, deviating from established baselines in terms of volume, file types, or source process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 5140",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-value file servers, critical application shares (e.g., containing configuration files), and backup storage locations.",
            "action": "First, for a symbolic rule, create a watchlist of non-standard processes (e.g., anything other than explorer.exe, Word.exe, Excel.exe) and alert when any of these processes writes or modifies files on a network share (Windows Event ID 4663). Second, for a statistical method, use logs (Windows Event ID 5140, Zeek smb_files.log) to establish a baseline for each user's file write activity, including metrics like count of files written per hour and distribution of file types. Use the Inter-Quartile Range (IQR) method to detect outliers, such as a user suddenly writing an unusually high number of executable files. Third, for machine learning, apply a time-series anomaly detection model (e.g., ARIMA) to the aggregate volume of file write events per share. Train the model on historical data to flag time windows where activity significantly deviates from the forecasted norm, indicating a potential mass file tainting event."
          },
          {
            "description": "A process is executed from a network share path, and this execution is anomalous based on the process itself, the user executing it, or its temporal proximity to a recent file write.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 4663",
              "Windows Event ID 5140"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints with access to network shares, particularly those of standard users and privileged administrators.",
            "action": "Monitor process creation events (Sysmon Event ID 1, Windows Event ID 4688) where the executable path is a UNC path. For a symbolic detection, correlate these process creations with file write events (Windows Event ID 4663) to the same path within a short time window (e.g., $$ \\Delta t < 5 $$ minutes) and generate a high-priority alert if the writing user/host differs from the executing user/host. For a statistical approach, build a frequency table of all processes executed from network shares and flag executions of statistically rare processes (e.g., run by < 1% of users from a share). For a machine learning method, use a User Behavior Analytics (UBA) isolation forest model to learn each user's normal process execution patterns (local vs. remote). Generate an alert when a user executes a process from a network share that the model classifies as a significant anomaly for that user's profile."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]