[
  {
    "information_requirement": "Is the adversary using removable media for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1092",
        "name": "Communication Through Removable Media",
        "evidence": [
          {
            "description": "Creation or modification of files on removable media with hashes or names known to be associated with C2 frameworks or malware that use this technique.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4663 for file creation/modification on removable drives. Cross-reference the 'Object Name' (file path and name) against a CTI list of filenames known to be used for C2 via removable media (e.g., 'tasks.dat', 'config.ini', 'results.bin' from known malware families). Alert on any matches. If file hashing is available through other logging mechanisms, correlate by timestamp and path to check hashes against known malicious lists."
          },
          {
            "description": "Creation of files on removable media with high-risk extensions (e.g., executables, scripts, LNK files) or hidden attributes, especially by non-standard processes.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4663 for 'WRITE_DATA' or 'CREATE_NEW' access events on removable drives. Identify files with extensions such as .exe, .dll, .ps1, .vbs, .js, .hta, or .lnk. Correlate these events with the source process name (e.g., `powershell.exe`, `rundll32.exe`, `wscript.exe`). Also, flag any file created with the 'Hidden' attribute set. Use frequency analysis to establish baseline process-file type pairs for writing to removable media and alert on significant deviations or known risky patterns."
          },
          {
            "description": "A process reads a file from removable media and subsequently makes an outbound network connection, suggesting C2 task retrieval.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate events in a sequence: 1. A process performs a read operation (Windows Event ID 4663 with 'ReadData' access) on a file from a removable drive. 2. The same process (correlated by Process ID) initiates an outbound network connection within a short time window, such as 1-5 minutes (Windows Event ID 5156 from the host or Zeek conn.log from the network). Use correlation analysis on Process ID and timestamps across these data sources. Profile the destination IPs/domains; flag connections to non-standard, low-reputation, or newly registered domains."
          },
          {
            "description": "A process performs unusually broad or rapid read access across local directories and subsequently writes an encrypted or archived file to removable media, suggesting data collection for exfiltration.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4663 for file read/write activity. For a single process, track the volume and diversity of read operations from local drives (e.g., C:\\Users, C:\\ProgramData). If a process reads an anomalously high number of files or unique directories in a short period, correlate this with any subsequent write operations to a removable drive by the same process. Use descriptive statistics to baseline normal file access patterns for common processes. Flag processes exhibiting a high read-to-write ratio where the write target is removable media, especially if the written file has an archive extension (.zip, .rar, .7z) or high entropy, suggesting encryption."
          },
          {
            "description": "Execution of an unsigned or unusual process directly from removable media, or a system process anomalously accessing removable media.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events where the process path points directly to a removable drive (e.g., E:\\payload.exe). Check the signature status of the executable and flag unsigned processes. Separately, monitor Windows Event ID 4663 for read/write access to removable media by system-level processes not typically associated with user interaction (e.g., `lsass.exe`, `winlogon.exe`, `services.exe`). Use frequency analysis to baseline normal processes that access removable media (e.g., `explorer.exe`) and alert on any outliers."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]