[
  {
    "information_requirement": "Is the adversary using multi-stage command and control channels?",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1104",
        "name": "Multi-Stage Channels",
        "evidence": [
          {
            "description": "Initial outbound C2 connection to an IP address or domain identified by threat intelligence as a known malware redirector or first-stage server.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate all outbound network connections (Zeek conn.log) and DNS queries (Zeek dns.log) against a high-confidence, continuously updated CTI feed specifically identifying known redirectors, first-stage C2 servers, or infrastructure associated with malware droppers and loaders. An alert on a match represents a high-confidence indicator of the first step in a multi-stage channel."
          },
          {
            "description": "Observation of known malware hand-off patterns, such as an HTTP redirect (3xx status code) to a new C2 server, or a DNS TXT record query containing a C2 address, following an initial beacon.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for HTTP response status codes 301, 302, or 307 that redirect an initial connection to a new, potentially malicious domain/IP. Monitor Zeek dns.log for unusual TXT record queries from internal hosts, as these are a known pattern for retrieving second-stage C2 addresses. Use regular expressions to scan DNS TXT responses and unencrypted HTTP bodies for patterns resembling IP addresses or domains. Correlate these patterns with initial outbound connections from suspicious processes."
          },
          {
            "description": "A distinct change in C2 communication characteristics (e.g., protocol, port, destination ASN, data volume, JA3 hash) from a single process after an initial connection, indicating a hand-off to a second-stage channel.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each process (identified via Windows Event ID 4688) making outbound connections, establish a baseline of its initial C2 traffic (destination IP/ASN, port, protocol, JA3 hash from Zeek ssl.log, data volume). Use time series analysis and change point detection algorithms to identify a significant shift in these characteristics. For example, a process communicating via HTTP to IP 'A' suddenly begins communicating via raw TCP on a different port to IP 'B' in a different ASN. This change strongly indicates a stage hand-off."
          },
          {
            "description": "An initial C2 connection resulting in a file download, immediately followed by a new and distinct C2 connection initiated by either the original or the newly downloaded process to a different external destination.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlated detection chain: 1) Identify an initial outbound connection from a process (Zeek conn.log, Windows Event ID 4688). 2) Detect a file download (e.g., EXE, DLL, PS1) over that connection (Zeek files.log). 3) Observe the creation of a new process corresponding to the downloaded file or a new thread by the original process (Windows Event ID 4688). 4) Detect a new outbound C2 connection from the new/original process to a *different* destination IP/domain than the first. Correlating these events in a short time window (e.g., < 2 minutes) provides strong behavioral evidence of a multi-stage payload delivery and execution."
          },
          {
            "description": "A single process making a series of short-lived connections to multiple, geographically or logically disparate external destinations in sequence, indicating the probing of a C2 list to find a live second-stage channel.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Group outbound connections (Zeek conn.log) by the source host and process (correlated with Windows Event ID 4688) within short time windows (e.g., 5-10 minutes). For each process, calculate the number of unique destination IPs, ASNs, and countries. Use entropy measures on the destination IPs to identify processes communicating with an unusually high number of random-like destinations. Flag processes with a high count of unique destinations (>5-10) combined with short connection durations, which is a behavioral pattern for iterating through a hardcoded C2 list."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]