[
  {
    "information_requirement": "Is the adversary transferring tools or files into the network?",
    "tactic_id": "TA0011",
    "tactic_name": "Command-And-Control",
    "indicators": [
      {
        "technique_id": "T1105",
        "name": "Ingress Tool Transfer",
        "evidence": [
          {
            "description": "Network connections to external IPs or domains known to host malicious tools, or detection of transferred files with known malicious hashes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate destination IPs and domains from network logs (Zeek conn.log, Zeek http.log `host` field) against a high-confidence CTI feed of known malicious file-hosting and C2 servers. If using file extraction, calculate hashes of files transferred over HTTP/FTP (from Zeek files.log) and inner join them against a CTI feed of known malicious file hashes. Alert on any matches."
          },
          {
            "description": "Use of built-in command-line utilities (e.g., PowerShell, curl, BITSAdmin, certutil) with command-line arguments explicitly indicating file download from an external source.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for specific command-line patterns indicative of downloads. Use regular expression matching for patterns like: `powershell` with `Invoke-WebRequest`, `IEX`, `DownloadString`, or `DownloadFile`; `certutil.exe` with `-urlcache`; `bitsadmin.exe` with `/transfer` or `/addfile`. Use frequency analysis to identify rare command-line variations and correlate with parent processes (e.g., Office applications, wscript) to add context."
          },
          {
            "description": "Anomalous network traffic patterns, such as a high ratio of inbound to outbound data from an external source, inconsistent with the endpoint's normal activity or the service protocol in use.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each connection in Zeek conn.log, calculate an ingress ratio (e.g., `resp_bytes` / (`orig_bytes` + `resp_bytes`)). Establish a baseline ratio for different services and hosts using historical data. Flag connections with an unusually high ingress ratio (e.g., > 0.95), especially on non-web ports or from hosts that do not typically download large files. Use descriptive statistics (mean, std dev) on byte counts per host or service to identify outlier sessions indicative of a large file transfer."
          },
          {
            "description": "A process known for network activity (e.g., PowerShell, browser, Office application) spawning an unusual child process or writing a new executable file to an atypical directory.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) to establish a baseline of normal parent-child process relationships. Flag anomalous lineage, such as `WINWORD.EXE` spawning `powershell.exe` or `curl.exe`. Concurrently, monitor the 'New Process Name' field for executables running from unexpected directories (e.g., C:\\Users\\Public\\, %APPDATA%, temporary internet folders). Use entropy measures on file paths to identify randomly named executables. Correlate the creation of a new process in a non-standard location with preceding network download activity (Pattern #2) from its parent process."
          },
          {
            "description": "Downloads from unsanctioned or unusual cloud storage or code repository domains, especially when initiated by non-browser processes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a list of sanctioned cloud storage/collaboration domains (e.g., corporate OneDrive, G-Suite). Monitor Zeek http.log (`host` field) and ssl.log (`server_name` field) for connections to other services (e.g., Pastebin, GitHub Gists, Discord CDN, Mega.nz). Use correlation analysis to link these network connections to the responsible process (from Windows Event ID 4688). Prioritize alerts where the initiating process is not a standard web browser (e.g., `powershell.exe`, `cscript.exe`, `rundll32.exe`)."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]