[
  {
    "information_requirement": "Is the adversary using external web services for command and control (one-way communication)?",
    "tactic_id": "TA0011",
    "tactic_name": "Command-And-Control",
    "indicators": [
      {
        "technique_id": "T1102.003",
        "name": "One-Way Communication",
        "evidence": [
          {
            "description": "Outbound connections to external web service domains, URLs, or IP addresses known to be used for hosting C2 instructions or as dead drops.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join network connection logs (Zeek conn.log for IPs, http.log for full URLs, ssl.log for SNI) against a high-fidelity cyber threat intelligence (CTI) feed that specifically lists domains, URLs (e.g., specific Pastebin links, GitHub Gists, social media profiles), and IPs known to be used for C2 dead drops. Alert on any matches and investigate the source host for compromise."
          },
          {
            "description": "Outbound connections to legitimate web services using non-standard User-Agents, specific URL path patterns, or JA3/JA3S hashes associated with known C2 frameworks.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan Zeek http.log for User-Agent strings not belonging to standard browsers or approved applications (e.g., 'Python-urllib', 'PowerShell', 'curl') connecting to popular web services. Use regular expression matching to search for known URL patterns used by malware to retrieve commands (e.g., '/raw/<id>', '/u/<username>/<gist_id>'). Correlate JA3/JA3S hashes from Zeek ssl.log against a maintained list of hashes associated with specific C2 frameworks like Cobalt Strike or Metasploit."
          },
          {
            "description": "An uncommonly seen or non-browser process (e.g., svchost.exe, powershell.exe, regsvr32.exe) initiating outbound network connections to common web services like social media, paste sites, or code repositories.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation logs (Windows Event ID 4688) with network connection logs (Zeek conn.log) based on source IP and timestamp. Maintain a baseline of common processes that initiate external web requests. Flag any processes deviating from this baseline, especially system binaries or scripts, connecting to high-reputation web services. Use frequency analysis to identify low-frequency process-to-destination pairs for further investigation."
          },
          {
            "description": "Repetitive, fixed-interval outbound connections (beacons) from an internal host to the same external web service, characterized by small, uniform request sizes.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log to identify periodic network connections from internal hosts to external destinations. Use time series analysis on the inter-arrival time of connections between a specific source-destination pair to detect consistent beaconing intervals (e.g., every 60s +/- 5s). Combine this with descriptive statistics on connection sizes ('orig_bytes') to find small, regular check-ins. A box-plot of connection time deltas for a given source-destination pair can identify connections with very low variance, indicating automated, regular beaconing."
          },
          {
            "description": "Highly asymmetric network traffic to external web services where outbound requests are consistently small and inbound responses are minimal or non-existent, violating typical web browsing patterns.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log sessions to external web services by calculating the ratio of response bytes to request bytes (`resp_bytes` / `orig_bytes`). For typical web browsing (GET requests), this ratio should be high. Flag sessions or source hosts where the average ratio is consistently near or below 1, indicating a potential C2 dead drop where the client only checks for data without receiving large payloads in response. Use linear regression to model expected response sizes based on request characteristics for normal traffic and identify significant negative residuals."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]