[
  {
    "information_requirement": "Is the adversary using web services for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1102",
        "name": "Web Service",
        "evidence": [
          {
            "description": "Connections to specific URLs, subdomains, or certificates of legitimate web services that are known indicators of compromise (IoCs) for C2 activity.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously ingest and update threat intelligence feeds containing atomic indicators (IoCs) related to C2 over web services. This includes specific hostnames/subdomains, full URL paths, and SSL/TLS certificate serials or hashes known to be used by malware. Create rules to perform an inner join between these IoC lists and network logs (Zeek dns.log, http.log, ssl.log) in near real-time. Flag and alert on any matches for immediate investigation."
          },
          {
            "description": "Network traffic to legitimate web services exhibiting patterns characteristic of known C2 frameworks, such as specific URL structures, HTTP headers (e.g., User-Agent), or POST request formats.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan Zeek http.log data for patterns associated with C2 over web services. Use regular expressions to match on: 1) Specific or non-standard User-Agent strings used by known malware. 2) Predictable URL path structures (e.g., requests to /raw/ on paste sites, specific API endpoints like /files/upload on storage services, or base64 strings in URIs). 3) Anomalous or custom HTTP headers not typical for standard browser traffic. Maintain and regularly update a library of these C2 patterns for correlation."
          },
          {
            "description": "Persistent or periodic, low-entropy connections from an internal host to a legitimate external web service, indicative of C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log for connections to legitimate web services over extended periods. Use time series analysis to identify periodic, fixed-interval connections (beaconing), indicated by low variance in the time delta between connections from a single host. Calculate the entropy of connection timings and data sizes; highly regular, low-entropy patterns are suspicious. Correlate these network beacons with host processes (Windows Event ID 4688) to attribute the activity and investigate any that cannot be linked to legitimate applications."
          },
          {
            "description": "Anomalous data transfer ratios for connections to legitimate web services, such as unusually high data egress compared to ingress, suggesting data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For connections to common web services (e.g., Google Drive, Dropbox, Pastebin), establish baseline data transfer ratios (bytes sent vs. received) for legitimate use within the organization. Continuously monitor Zeek conn.log and http.log, calculating the egress/ingress ratio for each session. Use statistical methods like Z-score or Inter-Quartile Range (IQR) analysis against the service-specific baseline to flag connections with anomalously high egress. Use linear regression to identify trends of increasing data exfiltration over time."
          },
          {
            "description": "Anomalous process-to-network-service communication, where a system process not typically associated with user activity initiates connections to external web services.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Windows Event ID 4688) with outbound network connections (Zeek conn.log). Maintain a baseline of normal process-to-destination-service pairings (e.g., `chrome.exe` to `google.com`). Flag new or rare pairings, especially for processes commonly abused for C2 (e.g., `powershell.exe`, `rundll32.exe`, `svchost.exe`, `mshta.exe`) connecting to public web services like Pastebin, GitHub, or cloud storage APIs without a clear legitimate purpose or user context. Use correlation analysis to link process execution time and parent process with network connection details to identify unauthorized activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]