[
  {
    "information_requirement": "Is the adversary attempting to gain account credentials using password spraying?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential-Access",
    "indicators": [
      {
        "technique_id": "T1110.003",
        "name": "Password Spraying",
        "evidence": [
          {
            "description": "Authentication attempts originating from IP addresses on threat intelligence lists or using User-Agent strings of known offensive security tools.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4625",
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses from authentication logs (Windows Event IDs 4625, 4771; Zeek conn.log) against a CTI feed of known malicious IPs or anonymizing proxies. For web-based services, scan Zeek http.log for User-Agent strings associated with password spraying tools (e.g., `ruler`, `ms-office`). Alert on any matches from high-confidence sources."
          },
          {
            "description": "A specific pattern of Kerberos pre-authentication failures (Event ID 4771, Failure Code 0x18 or 0x12) occurring at a high rate across many accounts from a single source IP.",
            "data_sources": [
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On Domain Controllers, specifically filter for Windows Event ID 4771 with Failure Code '0x18' (Pre-authentication required) or '0x12' (Client disabled, etc.). Group these events by source IP and count the number of distinct target accounts in a short time window (e.g., 10 minutes). A high count of these specific failures from a single source is a strong pattern for username enumeration or password spraying. Use descriptive statistics to establish a baseline for normal failure rates and flag outliers."
          },
          {
            "description": "A high volume of failed authentication attempts across numerous distinct user accounts originating from a single source IP within a short time frame, indicative of a one-to-many password attempt.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate failed login events (Windows Event IDs 4625, 4771) by source IP address. For each source IP, calculate the ratio of distinct failed usernames to the total number of failed logins within a rolling time window (e.g., 30 minutes). Use correlation analysis and frequency distribution to flag source IPs where this ratio is high (e.g., > 10 distinct accounts failed from one IP). Use a box-plot on the number of distinct accounts per source IP to visually identify outliers."
          },
          {
            "description": "A single successful authentication (Event ID 4624) from a source IP address immediately following a high volume of failed authentications against multiple other accounts from the same source.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate successful login events (Windows Event ID 4624) with source IPs that have recently been flagged for password spraying behavior (high volume of Event IDs 4625/4771 across many accounts). Create a rule that triggers when a source IP generates >N failed logins across distinct accounts and then has a successful login within M minutes. This directly identifies a successful spray attempt."
          },
          {
            "description": "A statistically significant spike in the overall volume of failed logins targeting key authentication services (e.g., Domain Controllers, VPN gateways, O365).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor the aggregate volume of failed authentication events (Windows Event IDs 4625, 4771) and failed connection attempts to authentication ports (e.g., 88, 389, 445, 3389 in Zeek conn.log) over time. Apply time series analysis (e.g., ARIMA, Exponential Smoothing) or statistical process control (SPC) to establish a baseline of normal failure volume. Alert on any deviations that exceed a defined threshold (e.g., 3 standard deviations above the moving average), which could indicate a large-scale spraying event."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]