[
  {
    "information_requirement": "Is the adversary collecting sensitive information from email services?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114.002",
        "name": "Remote Email Collection",
        "evidence": [
          {
            "description": "Login attempts or connections to email services originating from IP addresses known to be malicious or associated with credential abuse campaigns.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate source IP addresses from email service authentication logs (Windows Event IDs 4624 for success, 4625 for failure) and network connection logs (Zeek conn.log monitoring traffic to IMAP, POP3, MAPI, or webmail servers) against a continuously updated cyber threat intelligence (CTI) feed of known malicious IPs, TOR exit nodes, or IPs associated with recent credential abuse campaigns. Alert on any confirmed matches and investigate associated user and session activity."
          },
          {
            "description": "Use of specific email access protocols or API call patterns characteristic of known email collection tools (e.g., Ruler, MailSniper).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for requests to email service APIs (e.g., Exchange Web Services, Microsoft Graph) that match patterns used by known collection tools, such as distinctive User-Agent strings, specific SOAP action headers, or URL paths associated with creating malicious inbox rules. For non-HTTP protocols, monitor Zeek conn.log for unusual protocol command sequences or session characteristics that match the known TTPs of these tools. Use regular expression matching against a maintained list of these tool-specific patterns."
          },
          {
            "description": "Anomalous login activity to email services based on deviations from established user or group baselines, such as logins from unusual geographic locations, at atypical times, or exhibiting 'impossible travel' scenarios.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal email login behavior for each user and group using historical Windows Event ID 4624 and Zeek conn.log data, profiling source geolocation, time-of-day/day-of-week, and login frequency. Continuously monitor for deviations using statistical methods like Inter-Quartile Range (IQR) or percentile analysis to flag anomalous logins. Implement 'impossible travel' detection by correlating login timestamps and geolocations, alerting on physically unfeasible sequential logins. Apply a higher risk score to anomalies involving privileged or high-value accounts."
          },
          {
            "description": "A significant spike in data volume transferred from an email account over a short period, indicating potential bulk download or archival activity.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for traffic to and from email services (IMAP, POP3, HTTPS to O365/G-Suite). For each user session, track bytes transferred and session duration. Use time series analysis to establish a baseline of data transfer volume per user. Alert on activity that significantly exceeds the user's historical baseline (e.g., >3 standard deviations from the mean, or a volume spike in the 99th percentile of their activity), which may suggest bulk collection of emails."
          },
          {
            "description": "Automated or unusually broad access patterns within a mailbox, such as rapidly accessing a high number of different folders or performing numerous programmatic search queries.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the sequence and timing of connections and requests to email services. Look for patterns indicative of automated tools, such as very low, consistent latency between requests, unlike typical human interaction. For webmail (via Zeek http.log), monitor for an unusually high rate of search queries or folder access requests from a single session. For protocols like IMAP (via Zeek conn.log), profile the number of `FETCH` or `SEARCH` commands. Use entropy measures on accessed folder names to detect unusually broad access, and use correlation analysis to find sessions with high request counts but low inter-request delays."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]