[
  {
    "information_requirement": "Is the adversary attempting to gain access to accounts via password guessing (brute-force or password spraying)?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1110.001",
        "name": "Password Guessing",
        "evidence": [
          {
            "description": "One or more authentication attempts, successful or failed, originate from a source IP address or contain a User-Agent string present on a threat intelligence feed for brute-force activity.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing Web Applications (e.g., OWA, SharePoint), VPN Concentrators, Network Edge Firewalls, Cloud Service Provider Portals",
            "action": "1. (Symbolic) Continuously correlate the source IP from failed authentications (Windows Event ID 4625, Zeek conn.log to ports 22, 3389, etc.) and the User-Agent from web access logs (Zeek http.log) against a threat intelligence feed of known brute-force sources. Generate an alert for any match. 2. (Statistical) For any IP address that matches the threat feed, calculate the ratio of failed to successful logins (Event ID 4625 / Event ID 4624) originating from that IP over a 1-hour window. Alert if this ratio exceeds the 95th percentile for all external source IPs. 3. (Machine Learning) Utilize a pre-trained classification model (e.g., logistic regression) that scores login attempts based on features including IP threat score, User-Agent rarity, time of day, and protocol used. Flag any login attempt classified as 'malicious' with high confidence."
          },
          {
            "description": "A single source IP address generates a high-entropy pattern of failed login attempts against a list of common or default usernames (e.g., 'admin', 'root', 'guest', 'test') within a short time frame.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Servers (RADIUS, Kerberos), Application Servers with default accounts, Network Appliances (routers, switches)",
            "action": "1. (Symbolic) Maintain a watchlist of 50+ common/default usernames. Generate an alert if a single source IP triggers failed logins (Windows Event ID 4625) for more than 5 distinct usernames from this list within a 15-minute window. 2. (Statistical) For each source IP, calculate the Shannon entropy of the set of unique target usernames in failed login events over a 30-minute window. Alert if the entropy value exceeds a dynamically calculated threshold (e.g., 98th percentile of all source IP username entropy). 3. (Machine Learning) Employ a clustering algorithm (e.g., DBSCAN) on authentication failure events, using source IP and target username as dimensions. An anomalous cluster is defined as a dense group of points representing a single source IP attempting to access numerous distinct, common accounts."
          },
          {
            "description": "A statistically significant increase in the rate of failed login attempts exhibiting a one-to-many (password spraying) or many-to-one (brute-force) relationship between source IPs and target accounts.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Cloud Service Provider Portals (e.g., Azure AD, AWS Console), VPN Concentrators, Externally-facing Web Applications",
            "action": "1. (Symbolic) For password spraying, alert if a source IP generates failed logins (Windows Event ID 4625) for >20 distinct accounts with <=3 attempts per account within 1 hour. For brute-force, alert if a single account experiences >50 failed logins from >10 distinct source IPs within 30 minutes. 2. (Statistical) For each source IP, calculate the count of distinct target accounts with failed logins per hour. Alert if this count exceeds 3 standard deviations above the moving average for that source IP. Similarly, do the same for each target account, counting distinct source IPs. 3. (Machine Learning) Use a time-series anomaly detection model (e.g., Isolation Forest) on two metrics: (a) the rate of distinct target accounts per source IP, and (b) the rate of distinct source IPs per target account. This can identify sudden spikes that deviate from normal patterns, indicating the start of a spray or brute-force attack."
          },
          {
            "description": "A statistically significant spike in account lockout events (Windows Event ID 4740) that directly correlates with preceding bursts of failed login attempts (Windows Event ID 4625) for the same accounts.",
            "data_sources": [
              "Windows Event ID 4740",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS) Servers",
            "action": "1. (Symbolic) For each account lockout event (Windows Event ID 4740), trigger a search for failed logon events (Windows Event ID 4625) for the same user account in the 15 minutes prior. If the number of failures from a single source IP exceeds the account lockout threshold (e.g., 5 failures), generate an alert. 2. (Statistical) Calculate a baseline rate of account lockouts per hour. Alert if the current hour's lockout count exceeds the 99th percentile of this historical baseline, indicating an abnormal organization-wide event. 3. (Machine Learning) Use a time-series forecasting model (e.g., ARIMA or Prophet) to predict the expected number of account lockouts for the next hour based on historical data. Generate an alert if the actual number of lockouts significantly exceeds the forecasted upper confidence interval."
          },
          {
            "description": "A persistent, low-frequency pattern of failed login attempts from a single source IP targeting multiple accounts over an extended period (e.g., days), evading simple rate-based thresholds.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-Value Asset Servers, Domain Controllers, Executive user workstations, Cloud administrative accounts",
            "action": "1. (Symbolic) Create a stateful rule that alerts if a source IP is observed generating at least one failed login attempt (Windows Event ID 4625) per hour for 8 consecutive hours, targeting at least 3 different accounts during that total period. 2. (Statistical) Aggregate failed login counts per source IP over a 24-hour sliding window. Use a Z-score to identify any source IP whose failure count is persistently elevated (e.g., Z-score > 2.0 for 3 consecutive days) compared to its own historical behavior. 3. (Machine Learning) Use a Hidden Markov Model (HMM) where the states are 'benign' and 'low-and-slow attack'. The model, trained on sequences of inter-arrival times of failed logins from source IPs, can identify a transition to the 'low-and-slow attack' state even when login failures are sparse and appear benign in isolation."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]