[
  {
    "information_requirement": "Is the adversary collecting sensitive information via email?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114",
        "name": "Email Collection",
        "evidence": [
          {
            "description": "A new email auto-forwarding rule is created that directs messages to an external domain not on an approved list, or an existing rule is modified to do so. This is confirmed by the presence of specific SMTP headers (e.g., X-MS-Exchange-Organization-AutoForwarded) in a volume of emails that exceeds a user's historical baseline by a statistically significant margin.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Gateway (e.g., Exchange, O365), Network Egress Points, Webmail Application Servers",
            "action": "Symbolic: Query Zeek smtp.log for specific email headers (`X-MS-Exchange-Organization-AutoForwarded:true`, `X-Forwarded-To`) and cross-reference the recipient domain against a threat intelligence feed of known malicious domains and a curated allow-list of approved partner domains. Alert on any match to the malicious list or any domain not on the allow-list. Statistical: For each user, establish a baseline of the daily volume of emails containing forwarding headers. Using a time series model, calculate a 95th percentile threshold for this activity. Alert when the daily forwarded email count for a user exceeds this threshold. Machine Learning: Train a classification model (e.g., Random Forest) on features from webmail sessions (Zeek http.log), such as URI path, POST request body size, and user agent, to distinguish between legitimate rule modification and malicious rule creation. A high probability score from the classifier indicates a likely malicious event."
          },
          {
            "description": "A process is created with command-line arguments containing PowerShell cmdlets or scripts designed for mailbox searching and exporting (e.g., `Search-Mailbox`, `New-MailboxExportRequest`) on a host not designated for Exchange administration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Exchange Servers, Administrator Workstations, Domain Controllers",
            "action": "Symbolic: Create a detection rule that triggers on Windows Event ID 4688 process creation events where the ProcessCommandLine contains keywords such as `Search-Mailbox`, `New-MailboxExportRequest`, or `EWS`, especially when the parent process is not a known administrative tool or script host. Statistical: For each host, calculate the entropy of PowerShell cmdlets executed over a rolling 24-hour window. A sudden spike in entropy, or the appearance of low-frequency, high-risk cmdlets like `New-MailboxExportRequest`, which significantly deviates from the host's cmdlet usage baseline (e.g., > 3 standard deviations), indicates anomalous activity. Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) trained on features from Event ID 4688, such as user context, parent process, command-line length, and keyword presence. The model can identify rare combinations of these features that represent command-line-based email collection."
          },
          {
            "description": "A file with an email archive extension (.pst, .ost, .zip, .eml) is created in a non-standard directory (e.g., `C:\\Windows\\Temp`, user profile `Downloads` folder) by a process other than a legitimate email client, and is subsequently accessed by a process associated with network activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, File Servers, Network Egress Points",
            "action": "Symbolic: Scan Windows Event ID 4688 logs for process names or file hashes matching known email collection tools. Concurrently, monitor Windows Event ID 4663 (Object Access) for file creation events with extensions like `.pst` or `.zip` in unusual locations (`%TEMP%`, `%PUBLIC%`) and correlate with Zeek files.log for subsequent network transfer of files with matching names or sizes. Statistical: Establish a baseline for the frequency and location of email archive file creation per user/host. Alert when the count of `.pst` or `.zip` files created in a short time window exceeds the 99th percentile of the user's historical behavior. Machine Learning: Train a time-series model to predict the expected volume of data transferred over the network (from Zeek conn.log) following file access events (Windows Event ID 4663) on `.pst` files. A significant residual error, where the actual transferred volume vastly exceeds the predicted volume, indicates potential exfiltration."
          },
          {
            "description": "A successful authentication to an email service (e.g., OWA, MAPI) occurs with a combination of features that are anomalous for the user account, such as a new geographic location, a rare user-agent string, and an atypical login time.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Active Directory), VPN Concentrators, Webmail Application Servers, Mail Gateway",
            "action": "Symbolic: Create a rule that triggers an alert on any successful login (Windows Event ID 4624) to a mail server from an IP address listed on a current threat intelligence feed. Enrich the source IP from Zeek conn.log for this check. Statistical: For each user account, maintain a historical baseline of login features: source IP geolocation (country, city), and ISP (ASN). Calculate a risk score for each new login where deviations from the baseline (e.g., new country, rare ASN) add to the score. An aggregate score exceeding a percentile threshold (e.g., 95th) triggers an alert. Machine Learning: Implement an unsupervised anomaly detection model (e.g., One-Class SVM) on user login events. Features should include user, source IP, user-agent from Zeek http.log, login time, and session duration from Zeek conn.log. The model will learn the 'normal' multidimensional login behavior for each user and flag logins that fall outside this learned pattern."
          },
          {
            "description": "A process, not associated with a standard email client, accesses a local email data file (.pst, .ost), and this event is followed within a short time window by an outbound network connection from the same process or host, transferring a volume of data consistent with the size of the accessed file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Network Egress Points, DNS Servers",
            "action": "Symbolic: Correlate Windows Event ID 4663 (Object Access) on files with `.pst` or `.ost` extensions with the process name from the event. If the process is not on an allow-list of email clients (e.g., `outlook.exe`), cross-reference the process ID with subsequent outbound network connections (Zeek conn.log) within a 5-minute window. Alert if such a connection is found. Statistical: For each endpoint, baseline the daily volume of outbound data transfer. Monitor for file read events (Event ID 4663) on large `.pst` files (>50MB). If such a read is followed by an outbound data transfer (from Zeek conn.log) that causes the endpoint's daily total to exceed its 99th percentile, flag for investigation. Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to learn normal event sequences on an endpoint. An alert is generated when an anomalous sequence is detected, such as `powershell.exe` reads `.pst`, followed by a connection to an unknown IP, which has a low probability under the trained model."
          },
          {
            "description": "A network connection to a mail server (on ports 25, 143, 465, 587, 993, 995) is initiated by a process on an endpoint or server that is not an approved email client or administrative tool.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Gateway, User Endpoints, Internal Network Segments",
            "action": "Symbolic: Maintain an allow-list of process names (`outlook.exe`, `thunderbird.exe`) and their expected hashes that are authorized to connect to mail server ports. Using Windows Event ID 5156, alert on any connection to mail ports where the Application field does not match a process on the allow-list. Statistical: For each host, profile the set of destination ports it typically connects to. Calculate the Jaccard similarity between the set of ports connected to in the last hour and the set of ports connected to over the last 30 days. A sharp drop in this similarity score, caused by a new connection to a mail port, indicates a behavioral change. Machine Learning: Train a graph-based anomaly detection model on network flow data (Zeek conn.log). The graph's nodes are hosts and the edges represent connections. An edge representing a new, unexpected connection (e.g., a web server connecting to a mail server over IMAP) would be flagged as a high-scoring anomaly."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]