[
  {
    "information_requirement": "Is the adversary attempting to intercept multi-factor authentication mechanisms?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1111",
        "name": "Multi-Factor Authentication Interception",
        "evidence": [
          {
            "description": "Network connections from endpoints to domains or IP addresses known to be associated with Adversary-in-the-Middle (AiTM) phishing toolkits.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate Zeek dns.log queries, http.log host headers, and conn.log destination IPs against a high-confidence, frequently updated threat intelligence feed of domains and IPs associated with AiTM phishing frameworks (e.g., Evilginx2, Modlishka, Muraena). Alert on any matches, as this is a strong indicator of a user being directed to a malicious proxy designed to intercept credentials and session cookies."
          },
          {
            "description": "Authentication attempts exhibiting User-Agent strings, TLS fingerprints (JA3/JA3S), or HTTP header patterns characteristic of AiTM phishing proxy toolkits.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek http.log for User-Agent strings and other HTTP headers known to be used by AiTM proxies. Analyze Zeek ssl.log for specific JA3/JA3S hashes associated with the client-side and server-side TLS implementations of these malicious tools. Maintain and regularly update a library of these pattern signatures for matching against live traffic and alert on positive hits."
          },
          {
            "description": "Execution of processes with command-line arguments or parent-child relationships indicative of known input capture, screen capture, or browser data theft tools on user endpoints.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for command-line arguments and executable names associated with tools like ProcDump targeting lsass.exe, or known keylogger/screen capture tool invocations. Use correlation analysis to detect suspicious parent-child process relationships (e.g., a browser or email client spawning PowerShell or a command shell) and investigate processes that are rare or have high-entropy names."
          },
          {
            "description": "Anomalous sequence of MFA events for a single user account, such as multiple MFA challenges sent or failed MFA attempts in a short period, immediately followed by a successful login, indicating potential MFA fatigue.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate authentication events (Windows Event IDs 4625 for failure and 4624 for success) per user account. Use time series analysis or frequency counting to detect a spike in failed login events (Event ID 4625 with MFA-related sub-status codes) for a single user within a short window (e.g., >5 failures in 2 minutes). Correlate this cluster of failed attempts with a subsequent successful login (Event ID 4624) from a similar IP to identify a potential MFA fatigue or prompt bombing attack."
          },
          {
            "description": "A successful user login followed by anomalous post-login activity, such as immediate changes to authentication methods, inbox rule creation, or access from a session with characteristics mismatched to the user's established baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek http.log",
              "Zeek conn.log",
              "Active Directory security logs"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate a successful login (Windows Event ID 4624) with subsequent activity within the same session. Trigger high-priority alerts if the login is immediately followed by high-risk actions like adding a new MFA device or modifying privileged groups (detected in Active Directory logs). Analyze the Zeek http.log User-Agent and Zeek conn.log source IP for the session; use regression analysis or a simple mismatch rule to flag if the session's characteristics (e.g., User-Agent, ISP, geolocation) deviate significantly from the user's historical profile."
          },
          {
            "description": "Successful logins for the same user account from two or more geographically impossible locations within a short time frame, suggesting a stolen session cookie or intercepted MFA token is being used concurrently.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Ingest all successful login events (Windows Event ID 4624) and their corresponding source IPs from network logs. For each user, compare the timestamp and geolocation of their latest login with their previous login. Calculate the distance and required travel speed between the two locations. Alert on any 'impossible travel' scenario where the calculated speed exceeds a realistic threshold (e.g., >600 mph). Use descriptive statistics to baseline location-switching behavior per user to reduce false positives from legitimate VPN or mobile use."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]