[
  {
    "information_requirement": "Is the adversary collecting sensitive information via video capture?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1125",
        "name": "Video Capture",
        "evidence": [
          {
            "description": "Execution of a process whose name or file hash is a known indicator of malicious video capture tools or malware with video capture capabilities.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688). Compare the process name and the file hash of the executable (if available via integrated EDR/Sysmon capabilities) against a high-confidence cyber threat intelligence (CTI) feed of known malware indicators (hashes, filenames, etc.) specifically associated with video capture (T1125). Alert on any direct match."
          },
          {
            "description": "Execution of a legitimate command-line utility (e.g., PowerShell, FFMpeg, VLC) with a specific command structure or script content known to be used for covertly accessing a webcam and writing output to a file.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688), ensuring command-line argument logging is enabled. Use regular expression matching to search for command lines indicative of video capture, such as PowerShell scripts invoking .NET classes like 'DirectShowLib' or command-line tools like 'ffmpeg.exe' or 'vlc.exe' with arguments specifying a video capture device (e.g., '-f dshow -i video=\"Integrated Camera\"') and an output file. Maintain and update a library of such malicious patterns for common utilities."
          },
          {
            "description": "An unauthorized, unsigned, or low-prevalence process accesses video capture device drivers or APIs, deviating from an established baseline of legitimate video-conferencing applications.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of legitimate, signed applications that access video hardware (e.g., Teams, Zoom, Slack, Camera app). Monitor Windows Event ID 4688 for the execution of any process not on this baseline list, especially those running from temporary directories (e.g., AppData\\Local\\Temp) or that lack a valid digital signature. Use frequency analysis and box-plots to identify processes that are statistical outliers (i.e., run on very few endpoints), as these are highly suspicious candidates for unauthorized camera access."
          },
          {
            "description": "Creation of video or high-resolution image files in unusual staging directories or with atypical naming conventions by a non-standard process, followed by data aggregation or exfiltration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate suspicious process creation (Windows Event ID 4688) with file creation monitoring (if available through other means like Sysmon Event ID 11). Hunt for processes that create files with video/image extensions (.mp4, .avi, .mkv, .jpg, .png) in non-standard locations (e.g., %TEMP%, %APPDATA%, C:\\Users\\Public). Use descriptive statistics to analyze file sizes; a series of consistently sized files could indicate timed captures. Analyze the entropy of filenames; high entropy (e.g., 'a8d9f0c.mp4') can indicate an attempt to obfuscate staged data."
          },
          {
            "description": "Anomalous outbound data transfer patterns from an endpoint, especially if correlated in time with the execution of a suspicious process potentially related to video capture.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate suspicious process execution on an endpoint (identified via Windows Event ID 4688 analysis) with network logs originating from that endpoint's IP address. Monitor Zeek conn.log for new or anomalous outbound connections following the suspicious process start time. Use time series analysis on the `orig_bytes` field to detect sudden spikes in outbound traffic volume. Analyze Zeek files.log for transfers of files with video/image MIME types to untrusted external destinations. Use correlation analysis to link the timing of the suspicious process execution with the start of the anomalous data transfer."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]