[
  {
    "information_requirement": "Is the adversary maintaining persistence using Office Template Macros?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1137.001",
        "name": "Office Template Macros",
        "evidence": [
          {
            "description": "Presence of Office template files with known malicious hashes or network connections from Office applications to known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously scan file systems for Office template files (.dotm, .xltm) in standard template directories. Upon creation or modification (Windows Event ID 4663), hash the files and compare against a threat intelligence feed of known malicious template hashes. Simultaneously, monitor Zeek conn.log for network connections made by Office applications (WINWORD.EXE, EXCEL.EXE) and inner join the destination IPs/domains with a CTI feed of known malicious infrastructure that hosts templates or serves as C2. Alert on any matches."
          },
          {
            "description": "Modification of default Office template files (e.g., Normal.dotm) or registry keys to either load a global template or weaken macro security settings.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable file system and registry auditing. Monitor for write access (Event ID 4663) to default Office template file paths (e.g., %APPDATA%\\Microsoft\\Templates, %APPDATA%\\Microsoft\\Excel\\XLSTART). Simultaneously, monitor for registry value modifications (Event ID 4657) to keys controlling global templates (e.g., `GlobalDotName`) or macro security levels (`VBAWarnings`). Correlate these modifications with the responsible process and investigate any changes not attributable to legitimate software installation or group policy updates."
          },
          {
            "description": "An Office application spawning suspicious child processes, such as command shells or scripting engines (PowerShell, WScript), indicating malicious macro execution for persistence.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for parent processes such as WINWORD.EXE, EXCEL.EXE, and POWERPNT.EXE. Alert on any instances where these Office applications launch child processes like cmd.exe, powershell.exe, wscript.exe, cscript.exe, bitsadmin.exe, or certutil.exe. Analyze process command lines for suspicious arguments. Use frequency analysis and descriptive statistics to establish a baseline of normal parent-child process relationships and identify rare or anomalous outliers."
          },
          {
            "description": "An Office application initiating anomalous network connections to unusual external destinations, using non-standard protocols or ports, or fetching remote templates from untrusted locations.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events for Office applications (Windows Event ID 4688) with network connection logs (Zeek conn.log). Establish a baseline of normal network behavior (e.g., typical destinations, ports, protocols) for Office applications in the environment. Use time series analysis to detect anomalous outbound connections (e.g., to rare geolocations, low-reputation IPs, or on non-standard ports). Use entropy measures on destination IPs per host to identify unusual connection diversity from Office processes. Alert on statistically significant deviations from the baseline."
          },
          {
            "description": "A correlated sequence of events where a document triggers a modification to a global template, followed by anomalous process or network activity upon subsequent application launches.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and monitor for a specific sequence of events indicating the full persistence lifecycle: 1. A write event (Event ID 4663) occurs on a global template file (e.g., Normal.dotm) by an Office process. 2. On subsequent launches of the same Office application (e.g., WINWORD.EXE) on the same host, observe anomalous behavior that was not present before the template modification, such as suspicious child process creation (Event ID 4688) or unusual network connections (Zeek conn.log). Use correlation analysis on events linked by hostname and process name across a multi-day timeframe to detect this pattern."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]