[
  {
    "information_requirement": "Is the adversary maintaining persistence using domain accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1136.002",
        "name": "Domain Account",
        "evidence": [
          {
            "description": "Domain account creation initiated by a process with a known malicious hash or from a host with active high-priority security alerts.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each domain account creation event (Windows Event ID 4720), identify the source host and the process that initiated the creation by correlating with process creation logs (Windows Event ID 4688). Cross-reference the hash of the creating process against a threat intelligence feed of known malicious file hashes. Additionally, correlate the source hostname or IP address with an internal list of systems currently under investigation or having active high-severity alerts. Immediately investigate any matches."
          },
          {
            "description": "Execution of specific command-line syntax or scripts used to create new domain accounts, such as `net user ... /add /domain` or `New-ADUser`.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) on Domain Controllers for command-line arguments containing patterns indicative of domain account creation (e.g., 'net user /add /domain', 'New-ADUser', 'dsadd user'). Correlate the parent process and user context for these commands. Flag executions originating from non-standard administrative processes (e.g., cmd.exe launched by a web server process), from non-administrator accounts with delegated permissions, or occurring at unusual times. Use frequency analysis on these specific command patterns to detect abnormal usage."
          },
          {
            "description": "Creation of a new domain account with an anomalous context, such as being created outside business hours, by a non-standard administrative account, or from an unusual source workstation.",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the metadata of domain account creation events (Windows Event ID 4720). Establish a baseline for normal account creation activity: which administrators typically create accounts, from which designated workstations, and during what time windows. Use descriptive statistics and percentile analysis to identify outliers. Flag accounts created by user accounts that rarely or never perform this action, from hosts not designated for administrative tasks, or at times that deviate significantly (e.g., > 2 standard deviations) from the norm. Correlate with help desk ticketing systems to filter out legitimate off-hours work."
          },
          {
            "description": "A newly created domain account is immediately used for anomalous activity, such as logging into multiple critical systems, accessing sensitive data, or establishing external network connections, deviating from the typical behavioral baseline for new accounts.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate account creation events (Windows Event ID 4720) with subsequent logon events (Windows Event ID 4624) and network traffic (Zeek conn.log) within the first 24-48 hours of the account's existence. Build a baseline model of normal 'first-day' activity for new accounts (e.g., login to one workstation, access to email). Flag new accounts that immediately log into critical servers (e.g., Domain Controllers, database servers), attempt to access an unusually high number of file shares, or initiate outbound connections to external IPs. Use correlation analysis to link the creation event to the anomalous follow-on activity."
          },
          {
            "description": "A new domain account is created and rapidly configured with high privileges, suspicious attributes (e.g., Kerberos pre-authentication disabled), or a name designed to mimic legitimate service or administrative accounts.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4738",
              "Windows Event ID 4728",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Upon account creation (Windows Event ID 4720), monitor for immediate follow-on user account change events (Windows Event ID 4738). Flag accounts that are added to high-privilege groups (e.g., Domain Admins, Enterprise Admins) shortly after creation by monitoring member addition events (Windows Event ID 4728, 4732). Analyze new account names using string similarity algorithms (e.g., Levenshtein distance) to detect potential impersonation of existing critical accounts (e.g., 'administrator' vs 'adminlstrator'). Use entropy measures on usernames to identify unusually random strings. Alert on combinations of these suspicious configuration changes occurring within a short time after creation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]