[
  {
    "information_requirement": "Has the adversary escalated privileges using token manipulation?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1134.003",
        "name": "Make and Impersonate Token",
        "evidence": [
          {
            "description": "Execution of a process with a known malicious hash or from a path associated with credential theft or token manipulation tools (e.g., Mimikatz, RottenPotatoNG), immediately preceding a privilege-escalating logon event.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Event ID 4688) for process hashes matching a threat intelligence feed of known malicious tools. Correlate any match by host and a short time window (<60 seconds) with a subsequent Logon Type 9 event (Event ID 4624) where the new logon token belongs to a higher-privileged user (e.g., SYSTEM, Administrator). This directly links a known malicious tool (selector) to the privilege escalation action."
          },
          {
            "description": "An anomalous parent-child process relationship where a non-interactive or unexpected process (e.g., a web server process, Office application, msiexec.exe) initiates a new logon session (Logon Type 9) for a high-privilege user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Windows Event ID 4624 for Logon Type 9. For each event, retrieve the initiating Process ID and find its parent process using Event ID 4688 logs. Establish a baseline of normal parent processes that create Logon Type 9 sessions (e.g., runas.exe, services.exe). Flag any Logon Type 9 event initiated by a process not on the baseline allowlist, especially those known to be abused for process injection or initial access (e.g., wscript.exe, mshta.exe, svchost.exe with unusual parents). Use frequency analysis on parent-child process chains leading to Logon Type 9 to spot rare patterns."
          },
          {
            "description": "A user account with standard privileges successfully creates a new logon session (Logon Type 9) as a different, higher-privileged user (e.g., Administrator, SYSTEM), followed by high-impact activity under the new token's context.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate Windows Event ID 4624 (Logon Type 9) with the associated process creation event (Event ID 4688) to link the 'SubjectUserName' (the original user) with the 'TargetUserName' (the new, impersonated user). Flag any instance where a non-administrative 'SubjectUserName' creates a logon session for an administrative 'TargetUserName'. Further correlate this with subsequent sensitive actions (e.g., access to LSASS memory, SAM file access via Event ID 4663) using the new 'TargetLogonId'. Use correlation analysis to score risk based on the privilege gap between the two users and the sensitivity of subsequent actions."
          },
          {
            "description": "Execution of 'runas.exe' by a standard user to launch a process with administrative credentials, especially when followed by the creation of suspicious child processes.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Event ID 4688 for process creations of 'runas.exe'. Analyze the 'SubjectUserName' and the command line to identify when a non-administrative user is attempting to run a process as an administrator. Create a baseline of legitimate 'runas' usage. Use descriptive statistics and outlier detection (e.g., IQR on frequency of use per user) to identify anomalous usage. Investigate the child processes spawned by the process launched via 'runas' for known malicious or suspicious activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary bypassing defenses using token manipulation?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1134.003",
        "name": "Make and Impersonate Token",
        "evidence": [
          {
            "description": "A process with a known malicious hash or signature creates a Logon Type 9 session, and the resulting logon is used to execute commands that bypass local security controls (e.g., 'runas /netonly').",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously scan running processes for hashes matching known malicious tools. When a match is found, check for associated Windows Event ID 4624 (Logon Type 9) events created by that process. Specifically search the malicious process's command-line logs (Event ID 4688) for the use of the '/netonly' switch with 'runas', which indicates an attempt to authenticate to a remote resource to evade local detection. Correlate the selector (hash) with the command-line artifact for high-fidelity alerting."
          },
          {
            "description": "Use of the 'runas' command with specific argument patterns known to be associated with defense evasion, such as '/savecred' followed by execution from a non-standard location, or '/netonly' used by a non-administrative process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter process creation events (Event ID 4688) for 'process_name == 'runas.exe''. Analyze the command line for patterns like '/savecred' or '/netonly'. Flag usage of '/savecred' by non-interactive or unusual parent processes, or when the command is executed from a temporary or user-writable directory (e.g., C:\\Users\\Public). Flag any use of '/netonly' by processes not associated with standard administrative workflows. Maintain and alert on a list of these suspicious 'runas' command-line patterns."
          },
          {
            "description": "A new logon session (Logon Type 9) is created, followed immediately by outbound network connections to unusual destinations or using uncommon protocols, suggesting evasion of local network monitoring by operating under a different user's network context.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify a Logon Type 9 event (Event ID 4624) and capture the Process ID that initiated it. Correlate this with network connection events (Windows Event ID 5156 on host, Zeek conn.log on network) from that same Process ID. Establish a baseline for normal network activity for the originating process and user context. Use time series analysis and correlation to flag new, anomalous outbound connections (based on destination IP rarity, port/protocol, or data volume) that occur immediately after a Logon Type 9 event. Join with threat intelligence feeds to check destination IP reputation."
          },
          {
            "description": "A process creates a Logon Type 9 session to impersonate a legitimate system account (e.g., 'NT AUTHORITY\\SYSTEM') and then modifies or deletes security logs, tools, or configurations to evade detection.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 1102",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate Logon Type 9 events (Event ID 4624) where the 'TargetUserName' is a high-privilege account with subsequent actions under that new logon session. Specifically monitor for Event ID 1102 ('The audit log was cleared'), process creation (Event ID 4688) of 'wevtutil.exe cl Security', or file modification/deletion (Event ID 4663) of security tool executables or log files. Use event correlation rules to link the token creation directly to the subsequent defensive action within a short time window (e.g., < 1 minute) to detect evidence tampering."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]