[
  {
    "information_requirement": "Has the adversary established persistence by creating unauthorized accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1136",
        "name": "Create Account",
        "evidence": [
          {
            "description": "Creation of a local or domain account with a username matching a known malicious pattern, threat actor naming convention, or default tool-created name.",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor Windows Event ID 4720 (A user account was created) on all endpoints and servers, especially Domain Controllers. Maintain a list of known malicious account usernames and naming patterns (e.g., 'support_388945a0', 'IT-Admin-Backup', etc.) derived from CTI feeds and past incidents. Compare the 'New Account Name' field from each event against this list using exact matching and regular expressions. Alert on any match and treat as a high-fidelity indicator of compromise."
          },
          {
            "description": "Execution of command-line utilities or scripts (`net.exe`, `wmic.exe`, PowerShell cmdlets) used to create or enable user accounts, especially when initiated by an unusual parent process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4720",
              "Windows Event ID 4722"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for process creation events (Windows Event ID 4688) with command lines containing account creation syntax (e.g., 'net user ... /add', 'New-LocalUser', 'Enable-LocalUser', 'wmic useraccount create'). Correlate these command executions with account creation (Event ID 4720) or enablement (Event ID 4722) events on the same host. Prioritize alerts where the parent process is anomalous for administrative activity, such as a web server (`w3wp.exe`), office application, or reconnaissance tool. Use correlation analysis to link the command to the resulting account event within a short time window (e.g., 1-2 minutes)."
          },
          {
            "description": "Creation of a new user account that violates established organizational policies, such as being created outside of change windows, by an unauthorized user, or immediately assigned to highly privileged groups.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish and maintain a baseline of authorized administrator accounts and normal change management hours. Monitor Windows Event ID 4720 (Account Creation) and alert when the 'Creator Account Name' is not on the authorized list or the creation time is outside of established change windows. Correlate 4720 events with subsequent group membership change events (4728, 4732, 4756) for the new account, flagging any immediate additions to privileged groups (e.g., Domain Admins, Administrators, Remote Desktop Users). Use time series analysis to detect deviations from the normal rate of account creations across the enterprise."
          },
          {
            "description": "Creation of new accounts with usernames that are anomalous when compared to established organizational naming conventions, such as high-entropy names or names designed to impersonate legitimate accounts.",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile the characteristics of existing legitimate usernames (e.g., typical length, character set, structure like 'firstname.lastname'). For each new account created (Windows Event ID 4720), calculate its string entropy and Levenshtein distance to existing usernames, particularly privileged ones. Flag new accounts with unusually high entropy (suggesting random generation) or very low string distance to existing privileged accounts (suggesting typosquatting). Use descriptive statistics and box-plots on these metrics across all created accounts to define and identify outliers."
          },
          {
            "description": "Creation of a new account immediately followed by suspicious activity, such as an interactive logon by the new account or anomalous outbound network connections from the host where the account was created.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate account creation events (Windows Event ID 4720) with subsequent logon events (Windows Event ID 4624, especially Logon Type 2 for interactive or 10 for remote interactive) performed by the newly created account on any host. Additionally, correlate the 4720 event's timestamp and host with network connections (Zeek conn.log) from that host's IP address to external or unusual internal destinations within minutes of the creation. Use correlation analysis to link these sequential events and alert on this behavioral chain, as legitimate new accounts rarely see immediate interactive use or initiate external connections."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]