[
  {
    "information_requirement": "Is the adversary maintaining persistence using Office Test registry keys?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1137.002",
        "name": "Office Test",
        "evidence": [
          {
            "description": "The DLL file specified in the 'Office Test' registry key matches a known malicious file hash or is from an untrusted or invalid publisher.",
            "data_sources": [
              "Windows Event ID 4657",
              "File Hashes",
              "Authenticode Signature Information"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Upon detecting a modification to the 'Office test\\Special\\Perf' registry key (via Windows Event ID 4657), automatically extract the DLL path from the event. On the endpoint, calculate the hash (e.g., SHA256) of the specified DLL file. Inner join the calculated hash with a CTI feed of known malicious file hashes. Additionally, programmatically check the DLL's digital signature; alert on any DLLs that are unsigned, have an invalid signature, or are signed by a publisher not on an approved allow list."
          },
          {
            "description": "Modification of the specific 'Office test' registry keys (`HKCU\\...\\Perf` or `HKLM\\...\\Perf`) to create or alter a DLL value.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a high-fidelity alert that triggers on any modification (creation or value set) to the '(Default)' or a value named 'DLL' within the 'HKEY_CURRENT_USER\\Software\\Microsoft\\Office test\\Special\\Perf' or 'HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Office test\\Special\\Perf' registry keys. Monitor Windows Event ID 4657 where 'Object Name' matches this path. As this key is rarely used legitimately, any modification warrants immediate investigation to identify the process that made the change and the new DLL path specified."
          },
          {
            "description": "An anomalous process, such as a command-line interpreter or script host, modifies the 'Office Test' registry key.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Windows Event ID 4657 for modifications to '*\\Microsoft\\Office test\\Special\\Perf'. Profile the 'Process Name' associated with the event. Create a behavioral rule to flag any modifications made by processes other than legitimate Office installers or updaters (e.g., setup.exe, msiexec.exe). The creation of this key by 'reg.exe', 'cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', or any process running from a temporary user location (e.g., AppData\\Local\\Temp) is highly suspicious. Use frequency analysis on modifying process names to identify rare outliers."
          },
          {
            "description": "A Microsoft Office application (e.g., WINWORD.EXE, EXCEL.EXE) spawns an anomalous child process or initiates suspicious network activity upon launch.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for Office applications (WINWORD.EXE, EXCEL.EXE, POWERPNT.EXE, OUTLOOK.EXE) launching unexpected child processes like 'cmd.exe', 'powershell.exe', 'rundll32.exe', or 'wscript.exe' using Windows Event ID 4688. Correlate Office process launches with subsequent network connections from the same host to non-Microsoft domains, low-reputation IPs, or newly registered domains using Zeek conn.log. Establish a baseline of normal child processes and network destinations for Office apps and use statistical methods, like descriptive statistics on process names or entropy measures on destination domains, to detect significant deviations."
          },
          {
            "description": "A DLL specified by the 'Office Test' registry key is loaded from an unusual directory, and the parent Office process subsequently initiates external network connections.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlated alert across three events: 1. A modification to the 'Office test\\Special\\Perf' key (Windows Event ID 4657) identifies a DLL in a non-standard path (e.g., %APPDATA%, %TEMP%, C:\\Users\\Public). 2. The subsequent launch of an Office application process (Windows Event ID 4688) on the same host. 3. New external network connections (Zeek conn.log) from that host, originating from the Office process PID. Use correlation analysis based on Hostname/IP and timestamps (e.g., within 5 minutes) to link these events. This sequence strongly indicates successful execution of the persistence mechanism."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]