[
  {
    "information_requirement": "Is the adversary maintaining persistence using Outlook Home Pages?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1137.004",
        "name": "Outlook Home Page",
        "evidence": [
          {
            "description": "Network connections from Outlook.exe to URLs, domains, or IP addresses matching known malicious threat intelligence indicators.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join destination IPs from Zeek conn.log and queried domains from Zeek dns.log with a high-confidence cyber threat intelligence (CTI) feed of known malicious URLs, domains, and C2 IPs (updated daily). Filter for connections originating from client subnets during typical user activity hours and alert on any confirmed matches. Investigate associated endpoints immediately."
          },
          {
            "description": "Modification of specific Outlook registry keys to set a folder's home page URL, a direct pattern for this persistence technique.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for Windows Event ID 4657 (A registry value was modified) where the 'Object Name' in the event contains '\\Outlook\\WebView'. Specifically, alert on any process writing a URL to a value within this key path. Correlate the modifying 'Process Name' with whitelists of expected software installers or administrative tools; a modification by an unexpected process (e.g., powershell.exe, cmd.exe, or an unknown binary) is highly suspicious and warrants an alert."
          },
          {
            "description": "Spawning of script interpreters or command shells by Outlook.exe containing command-line arguments indicative of malicious script execution or downloaders.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for Windows Event ID 4688 where the Parent Process Name is 'OUTLOOK.EXE' and the New Process Name is a script interpreter (e.g., 'powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe'). Analyze the 'CommandLine' field for suspicious patterns like 'IEX', 'DownloadString', 'Bypass', '-enc', or embedded URLs/IPs. Maintain a list of known malicious command-line patterns and use regular expression matching for detection."
          },
          {
            "description": "Outlook.exe making network connections to unusual destinations, such as newly registered domains (NRDs), dynamic DNS providers, or IP addresses with no history of being accessed by the organization.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate Zeek conn.log and dns.log data originating from client subnets. Enrich DNS queries with domain registration date and provider information. Use time series analysis to flag connections to domains registered within the last 30-60 days (NRDs) or hosted on known dynamic DNS services. Establish a baseline of normally accessed domains and use frequency analysis or descriptive statistics to identify connections to rare or new destinations. Analyze the entropy of destination subdomains; a high entropy may indicate domain generation algorithm (DGA) activity."
          },
          {
            "description": "Outlook.exe spawning a rare or previously unseen child process, indicating a deviation from its normal baseline behavior across the enterprise.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Windows Event ID 4688 logs to establish a dynamic baseline of normal child processes spawned by 'OUTLOOK.EXE' (e.g., WINWORD.EXE, EXCEL.EXE, browser processes, Adobe reader). Use frequency analysis (process stacking) across all endpoints to identify child processes that are statistically rare (e.g., occurring in the lowest percentile). Create parent-child process relationship box-plots to visualize process frequencies and alert on statistical outliers. Any child process outside the established baseline warrants investigation for potential malicious activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]