[
  {
    "information_requirement": "Has the adversary gained initial access to the network via external remote services?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful login to an external remote service (e.g., VPN, Citrix) originates from a source IP address associated with known malicious activity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Network Gateway",
            "action": "1. (Symbolic) Ingest a high-fidelity threat intelligence feed of known malicious C2, proxy, or TOR exit node IP addresses. 2. Create a detection rule that joins successful remote authentication events (e.g., Windows Event ID 4624 on a RADIUS or VPN server) with network connection logs (Zeek conn.log) by timestamp and destination server IP. 3. Trigger a high-severity alert if the source IP address of the successful login matches an IP address from the threat intelligence feed. This provides a direct, high-confidence indicator of compromise."
          },
          {
            "description": "A successful login to an external remote service exhibits multiple concurrent anomalous properties, deviating significantly from the user's established behavioral baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, User Workstations",
            "action": "1. (Statistical) For each user, build a 90-day baseline of login activity including typical login hours, source countries/ASNs, and session duration. For each new login, calculate a risk score by flagging deviations from the baseline (e.g., login time is >3 standard deviations from the user's mean, source country is not in the user's top 95th percentile of locations). Alert when the cumulative risk score exceeds a dynamic threshold. 2. (Machine Learning) Train an unsupervised learning model (e.g., Isolation Forest) on a feature set for each user's login events (e.g., time-of-day, day-of-week, source ASN, session duration). Score new logins for anomalousness; logins identified as significant outliers should be flagged for analyst review. 3. (Symbolic) Check if the user's account has been flagged for other suspicious activity in the last 24 hours, such as impossible travel or credential stuffing alerts. A confluence of alerts significantly raises the confidence of a compromise."
          }
        ]
      },
      {
        "technique_id": "T1190",
        "name": "Exploit Public-Facing Application",
        "evidence": [
          {
            "description": "Network traffic directed at an external remote service matches patterns or signatures of known exploits for vulnerabilities in that service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ, Network Gateway, External-facing servers (VPN, Citrix, etc.)",
            "action": "1. (Symbolic) Deploy an IDS/IPS with up-to-date signatures for known vulnerabilities in the organization's specific remote access solutions (e.g., CVEs for Citrix, Pulse Secure, Fortinet). Alert on any signature match for traffic targeting these services. 2. (Statistical) For web-based remote services, analyze Zeek http.log to calculate the entropy of URI paths. A sudden spike in requests with high entropy scores (e.g., above the 99th percentile for that service) can indicate scanning or fuzzing attempts associated with exploitation. 3. (Machine Learning) Use a time-series forecasting model (e.g., ARIMA) to predict the expected volume of connection attempts and data transfer to remote services. Generate an alert when the observed volume significantly exceeds the predicted confidence interval, which could indicate a brute-force or pre-exploitation scanning attack."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using external remote services?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A user account, particularly a service account or one that was previously dormant, begins authenticating to an external remote service for the first time.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Domain Controllers",
            "action": "1. (Symbolic) Maintain an explicit deny-list of service accounts and privileged accounts that are forbidden from using external remote access services. Trigger a critical alert on any successful login (Windows Event ID 4624) to a remote service by an account on this list. 2. (Statistical) For all user accounts, establish a baseline of authentication sources (internal vs. external IPs) over 90 days. Identify accounts that have exclusively authenticated from internal IP ranges. Alert if such an account successfully authenticates from an external IP for the first time. 3. (Machine Learning) Classify user accounts into roles (e.g., 'Admin', 'Developer', 'Service Account') based on Active Directory group memberships. Train a model to predict the probability of a given role using remote access. Generate an alert when a user from a low-probability role (e.g., 'Service Account') successfully uses a remote service."
          },
          {
            "description": "An account's remote access session exhibits machine-like characteristics, such as fixed periodic connections or unusually long durations, suggesting automated C2 activity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4634",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Network Gateway",
            "action": "1. (Symbolic) Query for remote access sessions (by correlating logon/logoff events or using Zeek conn.log durations) with exceptionally long durations (e.g., > 72 hours) or that reconnect with a precise, repeating interval (e.g., every 3600 +/- 5 seconds), which is indicative of automated beaconing. 2. (Statistical) For each user, calculate the mean and standard deviation of their remote session durations and the time between sessions (inter-arrival time). Alert when a new session's duration or the time since the last login falls more than 3 standard deviations from the user's personal mean. 3. (Machine Learning) Apply a change-point detection algorithm to the time series of a user's remote connection frequency. An alert is generated if the model detects a shift from a sporadic, human-driven pattern to a regular, periodic pattern, suggesting the account is now being used for automated persistence."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]