[
  {
    "information_requirement": "Is the adversary maintaining persistence through compromised IDE extensions?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1176.002",
        "name": "IDE Extensions",
        "evidence": [
          {
            "description": "An IDE extension file matches a known malicious file hash, or an IDE process connects to a known malicious C2 domain or IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4663",
              "File Hashes"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously scan file systems within known IDE extension directories. Upon detection of new or modified files (Windows Event ID 4663), calculate their file hashes and cross-reference them against a threat intelligence feed of known malware signatures. For network activity, inner join Zeek conn.log and dns.log data for connections originating from IDE processes against a CTI feed of known malicious C2 domains and IP addresses (updated daily). Alert on any matches."
          },
          {
            "description": "An IDE process executes suspicious process chains or command-line patterns associated with known malicious extension techniques, such as launching scripting interpreters with encoded commands.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) where the parent process is a known IDE executable. Scrutinize the command lines of child processes for patterns commonly used by malicious actors, such as launching PowerShell with '-enc' or '-w hidden' arguments, or using scripting engines like wscript.exe or cscript.exe to execute malicious scripts. Use regular expression matching to detect obfuscation patterns and known malicious command structures. Correlate this with the recent installation of a new IDE extension."
          },
          {
            "description": "Installation of an IDE extension from an unapproved or rare network source, or direct modification of extension files bypassing standard package managers.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of approved IDE extension repositories and marketplaces. Monitor Zeek conn.log for connections from developer endpoints to domains outside this baseline. Use frequency analysis on destination domains to identify rare or first-seen sources. Correlate network download events with file write events (Windows Event ID 4663) in IDE extension directories. Investigate file modifications that do not have a corresponding parent process (Windows Event ID 4688) associated with a legitimate IDE package manager."
          },
          {
            "description": "An IDE process spawns an anomalous child process or accesses sensitive user files outside of its expected project scope.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create and maintain a baseline of normal child processes for each approved IDE (e.g., compilers, linters, git). Use Windows Event ID 4688 to detect and alert on deviations from this baseline, especially the creation of command shells (cmd.exe, pwsh.exe), scripting interpreters, or network utilities (e.g., curl.exe, netcat). Monitor file access events (Windows Event ID 4663) to detect when an IDE process reads from sensitive directories like ~/.ssh, ~/.aws, browser credential stores, or writes executable files to system directories like C:\\Windows\\Temp."
          },
          {
            "description": "An IDE process establishes a persistent or beaconing network connection to an external destination, or exfiltrates an anomalous amount of data.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network connections in Zeek conn.log with the parent process (Windows Event ID 4688) to attribute traffic to specific IDEs. Use time series analysis to detect periodic, fixed-interval connections (C2 beaconing) or connections with unusually long durations. Establish a baseline for data transfer volume per user/IDE; use descriptive statistics (e.g., mean, standard deviation, box-plots) to identify sessions with anomalously high data egress, which may indicate data exfiltration. Investigate any such connections, especially to destinations not associated with known software repositories or services."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]