[
  {
    "information_requirement": "Is the adversary attempting to gather credentials using forced authentication?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1187",
        "name": "Forced Authentication",
        "evidence": [
          {
            "description": "Outbound SMB or WebDAV connections to external IP addresses or domains known to be used for malicious credential harvesting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join destination IP addresses from outbound SMB (TCP ports 139, 445) and WebDAV (TCP ports 80, 443) sessions, as logged in Zeek, with a high-confidence cyber threat intelligence (CTI) feed of known malicious credential capture servers or NTLM relay infrastructure. Alert on any confirmed matches and investigate the source host for compromise."
          },
          {
            "description": "Creation or modification of files (e.g., .LNK, .SCF, .URL) containing UNC paths that point to external, non-corporate SMB shares.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for the creation of processes (Windows Event ID 4688) with command-line arguments that create or modify shortcut-like files (.lnk, .scf, .url). Concurrently, monitor for file write events (Windows Event ID 4663) to these file types. Inspect the command line or file content for UNC paths (`\\\\<ip_address>\\...`). Correlate file creation events with subsequent outbound SMB connection attempts (Zeek conn.log) from the same host to the IP identified in the UNC path. Flag any paths pointing to external IP addresses."
          },
          {
            "description": "Office documents or HTML files containing embedded content tags (e.g., `<img>`, `<bgsound>`, `<link>`) that reference external SMB `file://` URIs.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Utilize Zeek's file extraction capabilities (files.log) to capture documents (e.g., .docx, .rtf) and HTML files transferred over the network. Scan these files for embedded content tags that use the `file://` protocol handler to reference an external IP address (e.g., `<img src=\"file://1.2.3.4/image.jpg\">`). Correlate the file download event with the process that opened it (e.g., OUTLOOK.EXE, WINWORD.EXE from Windows Event ID 4688) and any subsequent outbound SMB traffic from the host."
          },
          {
            "description": "A statistically significant spike in outbound SMB or WebDAV traffic from the internal network to external IP addresses, especially to destinations not previously seen.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal outbound SMB/WebDAV traffic volume and destination IP diversity using historical Zeek logs. Employ time series analysis (e.g., ARIMA, exponential smoothing) to detect statistically significant spikes in connection counts or data volume to external IPs on TCP ports 139, 445, 80, and 443. Use frequency analysis (e.g., calculating percentile ranks of destination IPs, or identifying IPs not present in the last 30 days) to flag rare or new external destinations receiving this traffic, as this indicates a potential new forced authentication campaign."
          },
          {
            "description": "Anomalous internal SMB/WebDAV connection patterns, such as a single host connecting to a large number of other hosts in a short time frame, or server-to-workstation connections inconsistent with established baselines.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Baseline normal internal SMB communication by creating a statistical profile of typical source-destination pairs, connection frequency, and traffic volume. Monitor for deviations, such as a single source connecting to an unusually high number of destinations (high fan-out) on SMB ports within a short window (e.g., 10 minutes), which can indicate an internal phishing campaign. Use descriptive statistics on connection counts per source host (e.g., IQR, box-plots) to find outliers. Correlate suspicious connection attempts with failed authentication logs (Windows Event ID 4624 Logon Type 3 with status indicating failure) on destination hosts to confirm forced authentication behavior."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]