[
  {
    "information_requirement": "Is the adversary collecting sensitive data via browser session hijacking?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1185",
        "name": "Browser Session Hijacking",
        "evidence": [
          {
            "description": "Network connections from a browser process to known malicious C2 servers, data exfiltration endpoints, or domains associated with session hijacking malware.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network connection events (Windows Event ID 5156, which logs the application making a connection) with DNS queries (Zeek dns.log) to identify traffic associated with browser processes. Inner join the destination IPs and queried domains against a high-confidence, continuously updated threat intelligence feed of known malicious infrastructure. Alert on any confirmed matches and investigate the associated endpoint and user activity."
          },
          {
            "description": "Anomalous file access to sensitive browser data stores (e.g., cookie databases, session storage) by non-browser processes, or browsers launched with suspicious command-line flags.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for browsers launched with suspicious flags like `--remote-debugging-port`. Separately, enable and monitor file access auditing (Windows Event ID 4663: 'An attempt was made to access an object') on directories containing browser data (e.g., `AppData\\Local\\Google\\Chrome\\User Data\\Default`). Use frequency analysis to flag rare processes accessing these folders. Alert when non-browser processes (e.g., `powershell.exe`, `cmd.exe`, or unknown executables) access sensitive files like `Cookies`, `Login Data`, or `Web Data`."
          },
          {
            "description": "A non-standard process injects code into a legitimate browser process, or a browser process spawns a suspicious child process such as a command shell.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze process creation logs (Windows Event ID 4688) to identify instances where browser processes (e.g., `chrome.exe`, `firefox.exe`, `msedge.exe`) spawn child processes that are not typical browser helpers or updaters. Create a baseline of normal child processes and alert on deviations, especially the creation of `cmd.exe`, `powershell.exe`, or `rundll32.exe`. Correlate these process events with user login sessions to identify the responsible user."
          },
          {
            "description": "A user's web browsing traffic significantly deviates from their established baseline, such as accessing internal resources not typically browsed or a sudden spike in connections to new or rare external domains.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal network activity per user/endpoint originating from browser processes (identified by correlating Windows Event ID 5156 with Zeek logs). This baseline should include typical internal/external destinations, ports, and data volumes. Use statistical methods to detect anomalies, such as: 1) Connections from a browser process to internal IPs on non-web ports (e.g., 445, 3389). 2) A sudden increase in the entropy of destination domains or IPs visited by a user. 3) Use time series analysis to detect anomalous spikes in connection counts or data transfer volume. Investigate significant deviations from the established user profile."
          },
          {
            "description": "A single web session identifier (e.g., session cookie) is observed being used simultaneously or in rapid succession from multiple, geographically disparate IP addresses or with different User-Agent strings.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "From Zeek http.log, extract session identifiers from HTTP headers (e.g., the value of the `Cookie` header). For each session ID, track the associated source IPs and User-Agent strings over its lifetime. Flag any session ID that appears from two geographically distant source IPs within a time window that is shorter than the required travel time ('impossible travel'). Use frequency analysis and correlation to alert when a single session ID is associated with multiple distinct User-Agents or a statistically unusual number of source IPs, which is highly indicative of a stolen session cookie being used."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]