[
  {
    "information_requirement": "Has the adversary gained initial access by compromising a software supply chain?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1195.002",
        "name": "Compromise Software Supply Chain",
        "evidence": [
          {
            "description": "A software update executable or installer matches a known malicious file hash, or is downloaded from a URL/IP known to host trojanized software.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor file creation events (from EDR or correlated from Windows Event ID 4688) and network downloads (Zeek http.log, files.log) for executables, installers (.exe, .msi), and libraries (.dll). Hash these files and perform a real-time inner join against a threat intelligence feed of known malicious file hashes. For downloaded files, correlate the source URL/IP against CTI feeds for known malicious distribution points. Alert immediately on any match."
          },
          {
            "description": "A software update executable or installer is unsigned, has an invalid/expired signature, or is signed by a newly seen or non-reputable publisher.",
            "data_sources": [
              "Zeek pe.log",
              "Windows Event ID 4688",
              "Windows Event ID 8002"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze PE file information from Zeek pe.log or host-based tools following a new process creation (Windows Event ID 4688). Flag any executable associated with a software update that is unsigned (correlate with Code Integrity Event ID 8002) or has an invalid/expired certificate. Maintain a baseline of trusted software publishers seen in the environment. Use frequency analysis to identify new or rare publisher certificate subjects and investigate their reputation."
          },
          {
            "description": "A legitimate, signed software update package exhibits anomalous characteristics such as new, suspicious imported DLLs, a significant change in file size, or high entropy sections compared to historical versions.",
            "data_sources": [
              "Zeek pe.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For high-risk, commonly targeted software (e.g., Windows components, popular utilities), establish baselines of PE file characteristics (file size, imported DLLs, section names/entropy) for each version. As new updates are observed (via Zeek pe.log or file creation events), compare them against their historical baseline. Use statistical methods like Z-score to detect significant file size deviations and correlation analysis (e.g., Jaccard similarity on import tables) to detect unusual changes in dependencies. High entropy may indicate a packed payload and should be flagged."
          },
          {
            "description": "A legitimate software updater process connects to a new or unusual domain/IP address to download updates, deviating from its established baseline of known update servers.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify known, legitimate software updater processes (e.g., `msedge_update.exe`, `AdobeARM.exe`, `TrustedInstaller.exe`). Baseline the destination domains/IPs they normally connect to using historical Zeek dns.log and conn.log data. Create an alert that triggers when one of these updater processes (identified via Windows Event ID 4688 and correlated with network logs) initiates a connection to a destination not on its established baseline. Use descriptive statistics (frequency analysis, percentiles) to identify rare destination domains across all updater processes."
          },
          {
            "description": "After a software update, the updated process or a new child process exhibits suspicious post-execution behavior, such as creating persistence mechanisms or initiating anomalous network connections.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4698",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Tag processes that are newly installed or updated. Monitor these tagged processes and their children (Windows Event ID 4688) for suspicious follow-on actions. This includes writing to registry run keys, creating scheduled tasks (Windows Event ID 4698), or making network connections (Zeek conn.log/dns.log) to non-standard ports, low-reputation domains, or IP addresses known for C2. Use correlation analysis to link the initial update event with these subsequent suspicious behaviors within a defined time window (e.g., 24 hours)."
          },
          {
            "description": "Unauthorized or anomalous modification of files within trusted software installation directories by an unexpected process, indicating potential patch tampering or trojanization outside of a legitimate update mechanism.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable object access auditing for critical software directories (e.g., Program Files, System32). Monitor Windows Event ID 4663 (Object Accessed) for write events to executables (.exe, .dll). Correlate the process ID/name from the event with a baseline of legitimate updater processes (e.g., `TrustedInstaller.exe`, `msiexec.exe`). Flag and investigate any modifications performed by unexpected processes such as `powershell.exe`, `cmd.exe`, or user-land applications. Use linear regression to test if an increase in these modification events correlates with other security alerts."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]