[
  {
    "information_requirement": "Has the adversary gained initial access to the network via supply chain compromise?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1195",
        "name": "Supply Chain Compromise",
        "evidence": [
          {
            "description": "Network connections from a recently installed or updated software process to IPs, domains, or URLs matching threat intelligence feeds for known C2 infrastructure or domains associated with previous supply chain attacks.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Windows Event ID 4688) associated with software installation or updates with subsequent network logs from the same host. Inner join destination IPs and domain names from Zeek conn.log and dns.log against a high-confidence, continuously updated CTI feed of known malicious infrastructure, specifically noting indicators linked to supply chain compromises. Alert on any matches and investigate the associated software and host."
          },
          {
            "description": "Execution of an unsigned process, a legitimate signed process (e.g., software updater) spawning an unexpected child process (e.g., cmd.exe, powershell.exe), or a process with an invalid/revoked digital signature following a software update.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Code Integrity Event Logs"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a baseline of legitimate parent-child process relationships for common enterprise software and their updaters. Monitor Windows Event ID 4688 for deviations, alerting when a trusted signed process spawns a command-line interpreter or an unsigned child process. Use frequency analysis on parent-child pairs to identify rare occurrences. Concurrently, enable and monitor Windows Code Integrity logs for signing failures (e.g., Event ID 3077) and correlate these events with recent software installations or updates to identify trojanized binaries."
          },
          {
            "description": "A recently installed or updated software process initiating anomalous network activity, such as connecting to previously unseen or rare domains, communicating over non-standard ports, or exhibiting periodic C2-like beaconing behavior.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate software installation events (e.g., via deployment logs or heuristics on process creation) with subsequent network activity from the host. For network traffic generated by the new process, analyze destination FQDNs from Zeek dns.log against a historical baseline of domains seen across the enterprise, flagging connections to exceptionally rare or newly-observed domains (low frequency of occurrence or percentile analysis). Use time series analysis on Zeek conn.log data (grouped by source IP, destination IP, destination port) to detect fixed-interval beaconing. Calculate the entropy of destination ports or domains for a given process to identify unusually diverse or focused communication patterns."
          },
          {
            "description": "A recently installed or updated software process performing suspicious host-level actions inconsistent with its documented function, such as enumerating system configuration, accessing sensitive user files, or creating new persistence mechanisms.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4656",
              "Windows Event ID 4697",
              "Windows Event ID 4698"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Following a software installation, monitor the new process (Windows Event ID 4688) and its children for suspicious activity. Look for the execution of discovery commands (e.g., whoami, ipconfig, systeminfo, net user). Enable and monitor file access events (Windows Event ID 4656 with Object Auditing) for access to sensitive directories (e.g., user profiles, credential stores) that do not align with the software's stated purpose. Track the creation of new services (ID 4697) or scheduled tasks (ID 4698) by the new process. Use correlation analysis to link these behaviors to specific software update events."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]