[
  {
    "information_requirement": "Has the adversary gained initial access to the network by leveraging a trusted relationship?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1199",
        "name": "Trusted Relationship",
        "evidence": [
          {
            "description": "Login or network activity from a trusted partner's designated IP range or user account that matches specific, known malicious indicators from threat intelligence or partner breach notifications.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a high-priority, dynamic list of atomic IOCs (IPs, domains) specifically associated with known breaches at trusted third-party partners. Continuously correlate all network traffic (Zeek conn.log) and successful logins (Windows Event ID 4624) originating from partner-owned IP ranges and user accounts against this dedicated IOC list. Trigger a high-severity alert on any match for immediate investigation."
          },
          {
            "description": "Execution of enumeration commands, reconnaissance tools, or suspicious scripts (e.g., `whoami`, `nltest`, `net group`, PowerShell-based frameworks) by a trusted partner account post-authentication.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688 with command-line logging enabled) associated with sessions authenticated by trusted third-party accounts. Use regular expression matching on process command lines to detect the use of common reconnaissance tools (`net.exe`, `nltest.exe`, `dsquery.exe`, `ipconfig.exe`), or scripting engines executing suspicious arguments (`powershell.exe -enc`, `wscript.exe`). Flag sequences of these commands occurring in a short time frame as a pattern of malicious discovery."
          },
          {
            "description": "Logins from trusted partner accounts that deviate from established baselines of geographic location, time-of-day, frequency, or source network.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each trusted partner, establish a dynamic baseline of normal login behavior (source IP/ASN, geolocation, time-of-day/day-of-week, frequency) using historical Windows Event ID 4624 and Zeek conn.log data. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect logins from new or infrequent geolocations/networks. Implement time series analysis to flag logins at anomalous times and use 'impossible travel' logic by correlating login timestamps and geolocations for partner accounts."
          },
          {
            "description": "A trusted partner account performing internal actions that are anomalous compared to their typical role-based activity, such as accessing unusual systems, transferring abnormal data volumes, or accessing new categories of data.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "After a trusted partner logs in (Windows Event ID 4624), baseline their typical internal activity: systems accessed (Zeek conn.log destination IPs), data transfer volumes (Zeek conn.log `orig_bytes`/`resp_bytes`), and processes created (Windows Event ID 4688). Monitor for significant deviations from this baseline. Use regression analysis to determine if logins from certain new locations correlate with higher-risk internal activity. Calculate the entropy of accessed servers or data types per session to detect unusually broad access patterns inconsistent with the partner's stated business purpose."
          },
          {
            "description": "A trusted partner account exhibiting a behavioral sequence of reconnaissance followed by attempted lateral movement.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and monitor for a behavioral sequence associated with a single trusted partner session. The sequence includes: 1. Execution of host or network reconnaissance commands (identified via patterns in Windows Event ID 4688). 2. Followed by attempted network logons (Windows Event ID 4624, Logon Type 3) to other internal systems not typically accessed by the partner. 3. Correlated with new network connections (Zeek conn.log) from the partner's source host to those target systems. Alert on accounts that exhibit this entire sequence, indicating a potential compromise and active lateral movement."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]