[
  {
    "information_requirement": "Is the adversary using traffic signaling for persistence?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1205",
        "name": "Traffic Signaling",
        "evidence": [
          {
            "description": "Network traffic containing known 'magic values' or specific byte sequences used by malware families to activate dormant implants for persistence.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan Zeek conn.log payloads (where deep packet inspection is available) or raw packet captures for specific, hardcoded byte sequences or 'magic values' known to be used by malware to activate a dormant implant. Maintain a list of these atomic signatures from CTI and alert on any match."
          },
          {
            "description": "Execution of known packet sniffing tools or use of raw sockets by unauthorized processes, indicative of a listening implant waiting for a signal.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for the creation of processes associated with network capture tools (e.g., tcpdump, windump, wireshark) or processes that load known packet capture drivers (e.g., Npcap, WinPcap). Correlate process name, command line arguments, and parent process against a baseline of legitimate administrative activity. Flag executions by non-admin users or from unusual file paths as a pattern of unauthorized implant activity."
          },
          {
            "description": "A sequence of failed connection attempts to multiple, specific closed ports (port knocking) from a source, followed by the establishment of a new persistent connection from the target host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define a stateful rule to detect a sequence of failed connections (from Zeek conn.log history field showing states like 'S0' or 'REJ', or from Windows Event ID 5156 'Packet Drop' events) from a single source IP to a specific sequence of destination ports within a short time frame. Use time-based correlation analysis to link a successful outbound or inbound connection from the target host immediately following the completion of the port knock sequence. Use descriptive statistics to identify hosts receiving an anomalous number of failed connection sequences."
          },
          {
            "description": "A previously dormant system, potentially activated by a Wake-on-LAN signal, suddenly begins generating network activity.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 6005"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of network activity to identify hosts that are typically offline or have long periods of inactivity. Monitor Zeek conn.log for new connections originating from these systems. Correlate this activity with system startup events (Windows Event ID 6005) that occur outside of scheduled maintenance or normal user hours. A linear regression model could be used to predict normal host activity, flagging significant deviations that may indicate unexpected activation for persistence."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary using traffic signaling for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1205",
        "name": "Traffic Signaling",
        "evidence": [
          {
            "description": "Detection of specific network signatures, including Wake-on-LAN (WOL) magic packets or known 'magic values' used by specific tools to trigger firewall rule changes.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Use pattern matching rules to scan network traffic payloads in Zeek conn.log for the exact Wake-on-LAN signature (`FF:FF:FF:FF:FF:FF` followed by MAC address repeats) or other known byte sequences used by specific tools to signal a firewall to open a port. Alert on any occurrence, especially if the source is external, as this is a high-fidelity selector for signaling."
          },
          {
            "description": "Use of tools or scripts that generate specific, non-standard packet structures (e.g., unusual TCP flag combinations, invalid checksums) matching the known patterns of firewall-testing or evasion utilities.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log's `conn_state` and `history` fields for patterns indicative of evasion tools (e.g., `S1` - SYN sent, no reply; `OTH` - Other/Invalid). Maintain a list of known patterns of TCP flag combinations (e.g., FIN/SYN, NULL, XMAS scans) used by tools like Nmap. Use frequency analysis on these patterns per source IP to distinguish targeted evasion attempts from general internet noise."
          },
          {
            "description": "A sudden change in a host-based firewall's behavior, where a previously blocked port becomes permitted immediately following a burst of unusual or malformed network traffic.",
            "data_sources": [
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of 'deny' events in Windows Event ID 5156 for specific ports on critical hosts. Monitor for a sudden drop in these deny events accompanied by new 'permit' events for the same port. Use time-based correlation analysis to link this state change to preceding anomalous network activity from the connecting IP, as seen in Zeek conn.log (e.g., port knocking sequence, packets with unusual flags). Apply time series analysis to firewall log counts to detect anomalous state changes."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary using traffic signaling for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1205",
        "name": "Traffic Signaling",
        "evidence": [
          {
            "description": "Signaling traffic, such as port knocks or magic packets, originating from or destined to external IP addresses known to be associated with C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate the source or destination IPs of potential signaling traffic (identified by failed connection sequences, malformed packets, etc. in Zeek conn.log or Windows Event ID 5156) with a high-confidence CTI feed of known C2 servers. An inner join between logs of signaling behavior and the CTI list should be performed. Any match warrants immediate investigation as a high-fidelity selector for C2 activity."
          },
          {
            "description": "Activation of a C2 channel using a predefined sequence of packets or a specific payload ('magic value') known to be used by a particular malware family's C2 protocol.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Develop signatures to detect specific, multi-stage C2 activation patterns in Zeek conn.log. For example, a rule to detect: 1) A specific UDP packet with a known magic value payload, followed by 2) a TCP connection from the target host to the source of the UDP packet on a high port. This pattern-based approach targets the known TTPs of specific C2 frameworks."
          },
          {
            "description": "A dormant internal host, characterized by a long period of network silence, initiating C2-like communication with an external destination immediately after receiving an inbound signaling event.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of network activity for internal hosts, identifying systems that are typically quiet or have predictable communication patterns. Use time series analysis on Zeek conn.log data to detect hosts that break long periods of dormancy. Correlate the first outbound connection from a newly-active host with any preceding inbound traffic, especially if that inbound traffic exhibits signaling characteristics (e.g., a single packet from an unusual source, a sequence of failed connections). Calculate entropy measures on destination IPs; a newly active host connecting to a low-frequency or new external destination post-signal is highly suspicious."
          },
          {
            "description": "Detection of periodic, beaconing-like communication patterns on a port that only became active or responsive after a signaling event was observed.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "First, identify ports that have received signaling activity (e.g., port knocks, magic packets). Then, monitor subsequent traffic to these ports. Analyze the connections for beaconing behavior (consistent connection intervals, similar payload sizes, long-term activity). Use time series analysis (e.g., Fourier transform) to detect periodicity in connection attempts. Correlate the start of the beaconing behavior with the time of the signaling event to confirm that signaling activated the C2 channel."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]