[
  {
    "information_requirement": "Is the adversary using a rogue domain controller for defense evasion or persistence?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1207",
        "name": "Rogue Domain Controller",
        "evidence": [
          {
            "description": "Network replication traffic matching signatures of known malicious tools used to create rogue Domain Controllers or perform DCSync attacks.",
            "data_sources": [
              "Zeek dce_rpc.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Deploy and monitor network intrusion detection system (NIDS) signatures specifically designed to detect the DCE/RPC traffic patterns of known malicious tools like Mimikatz DCSync or Impacket's secretsdump. Correlate alerts from Zeek dce_rpc.log (monitoring for DRSUAPI operations) with known malicious signatures or payloads. Alert on any traffic that matches these high-confidence selectors and investigate the source host."
          },
          {
            "description": "Execution of commands, scripts, or specific tool binaries associated with creating a rogue Domain Controller or performing unauthorized replication.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable command-line process auditing (Windows Event ID 4688). Monitor for the execution of processes with command-line arguments containing keywords related to AD replication or DC promotion, such as `DCSync`, `DrsReplicaAdd`, `ntlmrelayx` with `--delegate-access`, or PowerShell cmdlets like `Install-ADDSDomainController`. Correlate these process creations with a list of authorized administrators and change management records. Use regular expressions to hunt for known malicious command patterns and flag executions on non-DC hosts or by non-privileged users."
          },
          {
            "description": "Active Directory replication traffic (DCE/RPC using DRSUAPI) originating from or destined to a host not on the authorized list of Domain Controllers.",
            "data_sources": [
              "Zeek dce_rpc.log",
              "Windows Event ID 4928",
              "Windows Event ID 4929"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain an authoritative list of all legitimate Domain Controller IP addresses. Monitor Zeek dce_rpc.log for DRSUAPI operations (e.g., 'DRSGetNCChanges', 'DRSReplicaAdd') and Windows Event IDs 4928/4929 (replication context) on legitimate DCs. Join network logs with the authorized DC list on source and destination IPs. Alert on any replication traffic that involves a host not on this authoritative list. Use correlation analysis to link these network events with any suspicious host-based activity on the unauthorized system."
          },
          {
            "description": "A non-Domain Controller host requesting Kerberos service tickets for Directory Replication Service (DRS) or other DC-specific Service Principal Names (SPNs).",
            "data_sources": [
              "Windows Event ID 4769",
              "Zeek krb.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Kerberos TGS requests (Windows Event ID 4769 on DCs, Zeek krb.log on the network) for Service Principal Names (SPNs) exclusive to Domain Controllers, most notably the DRS GUID (`E3514235-4B06-11D1-AB04-00C04FC2DCD2`). Identify the source host making the request. Compare the source against the authorized list of Domain Controllers. Any request for a DC-specific SPN from a non-DC host is highly anomalous and requires immediate investigation. Use frequency analysis to detect hosts making repeated requests, which strengthens the suspicion."
          },
          {
            "description": "Anomalously high volume of directory service object modifications, particularly to sensitive accounts or groups, potentially indicative of malicious changes injected by a rogue DC.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4738",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable detailed AD object modification auditing (Event ID 5136 for generic changes, 4738 for user changes, 4732 for group member additions). Establish a baseline for the rate of change for critical objects (e.g., Domain Admins group, krbtgt account). Use time series analysis or statistical process control charts to monitor for sudden spikes in modification volume that deviate significantly from the norm (e.g., > 3 standard deviations). Correlate spikes in activity with the source of the change; if changes appear to originate from a suspect source or lack a corresponding administrative log entry, investigate for rogue DC activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]