[
  {
    "information_requirement": "Has the adversary achieved execution through user interaction?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1204",
        "name": "User Execution",
        "evidence": [
          {
            "description": "A user-executed process makes a network connection to an IP address or domain known to be associated with malicious activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for process creation events (Windows Event ID 4688) where the parent process is a common user-facing application (e.g., OUTLOOK.EXE, chrome.exe, WINWORD.EXE). Correlate the ProcessID with network connection logs (Zeek conn.log). Join the destination IPs or resolved domains (from Zeek dns.log) with a high-confidence threat intelligence feed of known malicious C2 servers, phishing domains, or malware distribution points updated within the last 24 hours. Alert on any matches."
          },
          {
            "description": "Execution of command-line interpreters (e.g., powershell.exe, cmd.exe, wscript.exe) with command-line patterns indicative of malicious scripts, such as encoded commands, download cradles, or execution policy bypass flags.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the command-line field of process creation events (Windows Event ID 4688) using regular expressions to detect common malicious patterns (e.g., 'powershell -enc', '-w hidden', 'IEX(New-Object Net.WebClient).DownloadString'). Correlate these events with their parent process to trace them back to user-initiated actions (e.g., clicking a link or opening a file). Use entropy measures on command-line strings to identify unusually complex or obfuscated commands that may evade simple pattern matching."
          },
          {
            "description": "A common user-facing application (e.g., Microsoft Office application, PDF reader, browser) spawns an unexpected child process, especially a command-line interpreter or scripting engine.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal parent-child process relationships for common user-facing applications (e.g., WINWORD.EXE, EXCEL.EXE, AcroRd32.exe). Monitor process creation events (Windows Event ID 4688) for deviations from this baseline. Use frequency analysis and descriptive statistics to identify statistically rare parent-child process pairs. Assign a high risk score and alert on chains like WINWORD.EXE -> powershell.exe or AcroRd32.exe -> wscript.exe, which are highly indicative of malicious macro or script execution."
          },
          {
            "description": "A common user-facing application makes direct outbound network connections to a destination that is statistically rare for that application or for the organization as a whole.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile baseline network destinations for common user application processes (e.g., WINWORD.EXE, EXCEL.EXE). Monitor Zeek conn.log for all outbound connections, noting the application if possible or attributing connections to hosts running these applications. For each connection, geolocate the destination IP. Use statistical methods like Inter-Quartile Range (IQR) or percentile analysis to flag connections to destination countries, Autonomous System Numbers (ASNs), or specific IP addresses that are rare for that application or the entire organization's baseline. Use time series analysis to detect sudden changes in the volume of such anomalous connections."
          },
          {
            "description": "A sequence of user-driven events, such as decompressing an archive file followed immediately by the execution of a file from that archive, especially from a temporary or downloads directory.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for process creation events (Windows Event ID 4688) involving common archive utilities (e.g., WINRAR.EXE, 7z.exe, tar, gunzip). Correlate these events with subsequent process creation events occurring within a short time window (e.g., < 60 seconds) where the new process path is within a temporary directory (%TEMP%, /tmp), user downloads folder, or the same path as the archive extraction. Use correlation analysis to chain the events: 1. User downloads file. 2. Archive utility runs. 3. New executable runs from temporary location. Investigate the reputation and behavior of the final executed process."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]