[
  {
    "information_requirement": "Has the adversary gained initial access via unauthorized hardware additions?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1200",
        "name": "Hardware Additions",
        "evidence": [
          {
            "description": "A newly installed hardware device or its associated driver has a known malicious file hash or is signed by a revoked or known-malicious digital certificate.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for new service creation (Event ID 7045) or process execution (Event ID 4688) associated with a new hardware installation. Extract the file path of the service or process executable, calculate its hash, and query threat intelligence services (e.g., VirusTotal) for known malicious signatures. Simultaneously, validate the file's digital signature for authenticity and check against a list of known-bad or revoked signing certificates."
          },
          {
            "description": "Network traffic from a host, immediately following a new hardware addition, is destined for known malicious C2 IP addresses or domains, or uses TLS certificates with known malicious fingerprints (JA3/JA3S).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Windows Event Logs for Plug and Play"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate the timestamp of a new hardware connection event (from Windows Plug and Play logs) on an endpoint with network logs originating from that host's IP address within a short time window (e.g., 5 minutes). Inner join the destination IPs, requested DNS names, and JA3/JA3S hashes from this traffic against up-to-date threat intelligence feeds. Alert on any match indicating communication with known malicious infrastructure."
          },
          {
            "description": "Detection of a new network interface with a MAC address vendor prefix (OUI) or a client hostname pattern associated with known malicious hardware tools (e.g., LAN Turtle, WiFi Pineapple).",
            "data_sources": [
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek dhcp.log for new MAC addresses requesting leases. For each new MAC, perform a vendor OUI lookup and check the requested hostname. Compare these against a curated list of OUIs and default hostname patterns associated with known network implant or rogue access point hardware. Flag any matches for immediate investigation."
          },
          {
            "description": "A command-line process (e.g., PowerShell) is launched with syntax characteristic of keystroke injection attacks immediately following the connection of a new Human Interface Device (HID).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event Logs for Plug and Play"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a detection rule that correlates a new HID connection event with a subsequent process creation event (Windows Event ID 4688) for powershell.exe, cmd.exe, or wscript.exe on the same host within seconds. Analyze the process command line using regular expressions to detect patterns common to keystroke injection attacks, such as encoded commands (`-e`, `-enc`), download cradles (`IEX(New-Object Net.WebClient).DownloadString`), or execution policy bypass syntax."
          },
          {
            "description": "Detection of network-connected hardware, identified by new MAC or IP addresses, that is not registered in an authoritative asset management system, indicating an unauthorized device on the network.",
            "data_sources": [
              "Zeek dhcp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Periodically, and upon new DHCP lease events (from Zeek dhcp.log), extract active MAC and IP addresses from network traffic. Perform a set difference operation by comparing this list of active devices against a ground-truth asset management database. Use time series analysis on the count of unknown devices to detect sudden increases that deviate from the baseline of normal IT provisioning activity, and investigate all unknown devices."
          },
          {
            "description": "Suspicious follow-on activity, such as the launch of a privileged process or the creation of a new network connection by an unusual process, occurs immediately after a new hardware device is connected to an endpoint.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Windows Event Logs for Plug and Play"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate new hardware connection events (from Plug and Play logs) with subsequent process creation (Windows Event ID 4688) and network connection events (Windows Event ID 5156) on the same host within a short time window (e.g., less than 60 seconds). Create a risk score for sequences where a new device connection is followed by a process launch with high privileges, or a process that does not typically make network connections (e.g., notepad.exe) binding to a new network port. Use correlation analysis to flag these high-risk sequences."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]