[
  {
    "information_requirement": "Is the adversary bypassing security restrictions using indirect command execution?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1202",
        "name": "Indirect Command Execution",
        "evidence": [
          {
            "description": "Execution of a known malicious payload (identified by file hash) as a child process of a utility commonly abused for indirect command execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation. Isolate events where the parent process is a utility associated with T1202 (e.g., forfiles.exe, pcalua.exe, scriptrunner.exe, ssh.exe). Extract the file hash of the child process executable and correlate it against a continuously updated threat intelligence feed of known malware hashes. An alert should be generated for any match, indicating a known malicious file was executed via an indirect method."
          },
          {
            "description": "Execution of utilities like forfiles.exe, pcalua.exe, or ssh.exe with specific command-line arguments and parent-child process relationships known to facilitate indirect command execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events. Use regular expressions to detect high-fidelity command-line patterns associated with T1202 abuse, such as 'forfiles.exe /p <path> /c \"<command>\"', 'pcalua.exe -a <executable>', or 'ssh.exe' with '-o ProxyCommand' or '-o LocalCommand'. Correlate these patterns with the parent process. Maintain and alert on a library of these known malicious patterns. Use descriptive statistics to establish a baseline for these command patterns and investigate rare or first-time occurrences."
          },
          {
            "description": "A utility associated with indirect command execution (e.g., forfiles.exe, pcalua.exe) initiating external network connections, where such behavior is rare or has never been observed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network connection events (Zeek conn.log) with process creation events (Windows Event ID 4688) by hostname and timestamp. Identify network connections initiated by T1202-associated utilities (e.g., forfiles.exe, pcalua.exe, scriptrunner.exe). Establish a baseline of legitimate network activity for these processes (which should be zero or near-zero for most). Use time series analysis to detect spikes in connections and calculate the entropy of destination IPs/ports to detect anomalous communication patterns. Alert on any non-whitelisted network activity from these processes."
          },
          {
            "description": "Anomalous process chain where a common user application (e.g., Office, browser) spawns a T1202 utility, which in turn spawns a command shell or scripting engine.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously analyze process ancestry using Windows Event ID 4688 data. Hunt for suspicious process chains such as WINWORD.EXE -> forfiles.exe -> cmd.exe -> malicious.exe, or CHROME.EXE -> ssh.exe -> powershell.exe. Baseline common process chains in the environment using frequency analysis. Use correlation analysis to identify and alert on rare or never-before-seen chains originating from common user applications that involve a T1202 utility as an intermediate process. A linear regression model could potentially be used to predict the likelihood of a child process given a parent, flagging low-probability pairs for investigation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]