[
  {
    "information_requirement": "Is the adversary evading defenses using trusted Windows executables?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.010",
        "name": "Regsvr32",
        "evidence": [
          {
            "description": "Execution of regsvr32.exe attempting to load a scriptlet from a URL or domain known to be malicious, or attempting to register a local DLL file with a known malicious hash.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for regsvr32.exe process creation. Extract any URLs or file paths from the command line. Cross-reference any identified domains/IPs against a high-confidence threat intelligence feed (updated daily). For local file paths, calculate the file hash and check it against a malicious hash database. Simultaneously, correlate URLs found in command lines with Zeek http.log to confirm network requests and check domain reputation. Alert on any matches."
          },
          {
            "description": "Execution of regsvr32.exe with command-line arguments pointing to a remote scriptlet file (e.g., .sct) via a URL, particularly when initiated by an unusual parent process like an Office application or script interpreter.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for regsvr32.exe execution containing URL patterns (e.g., 'http:', 'https:') and file extensions like '.sct' in the command line. Analyze the parent process; flag instances where the parent is 'winword.exe', 'excel.exe', 'powershell.exe', or 'mshta.exe' as highly suspicious. Use correlation analysis to link the process creation event with corresponding outbound network connections in Zeek conn.log to the specified URL."
          },
          {
            "description": "Execution of regsvr32.exe using the /s (silent) flag to load a DLL from a non-standard, user-writable directory such as AppData, Temp, or Public folders.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Windows Event ID 4688 for regsvr32.exe executions containing the '/s' switch. For these events, parse the file path of the specified DLL. Establish a baseline of legitimate DLL paths for regsvr32.exe (e.g., primarily from C:\\Windows\\System32). Use frequency analysis and path pattern matching to flag executions loading DLLs from unusual or user-writable locations (e.g., C:\\Users\\*, C:\\ProgramData, C:\\Temp). Calculate entropy of file paths to identify anomalous locations."
          },
          {
            "description": "The regsvr32.exe process spawning unexpected child processes, such as command shells or script interpreters, or establishing network connections to unusual external destinations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 to identify child processes spawned by regsvr32.exe. Since legitimate use rarely spawns child processes, alert on any instance where regsvr32.exe is the parent of 'cmd.exe', 'powershell.exe', 'wscript.exe', or other unexpected executables. Correlate regsvr32.exe execution time with subsequent network connection events from the same process ID (via Windows Event ID 5156) or host (via Zeek conn.log), flagging any connections to non-standard ports or destinations not on an allow-list. The baseline frequency for this behavior should be near zero."
          },
          {
            "description": "Execution of regsvr32.exe using the /n and /i flags together, which indicates proxy execution of an arbitrary DLL function rather than legitimate component registration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a high-fidelity detection rule to monitor Windows Event ID 4688 for regsvr32.exe process creation events where the command line contains both the '/n' and '/i:' arguments. This specific combination is almost exclusively used for malicious code execution, as it bypasses the standard registration function (DllRegisterServer) and calls a different, specified function within the DLL. All alerts from this rule should be treated as high-priority and investigated immediately. Correlate with the reputation of the DLL file specified in the command line."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]