[
  {
    "information_requirement": "Is the adversary attempting to discover browser information on compromised hosts?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1217",
        "name": "Browser Information Discovery",
        "evidence": [
          {
            "description": "Execution of processes with file hashes or names matching known browser information discovery and credential dumping tools.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688). Correlate the `NewProcessName` and associated file hash against a maintained threat intelligence list of known browser credential dumping tools (e.g., LaZagne, WebBrowserPassView, Mimikatz modules, SharpWeb, etc.). Alert on any exact match for immediate investigation."
          },
          {
            "description": "Execution of scripting interpreters or system utilities with command-line arguments explicitly referencing browser profile paths or credential database files.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze process creation command lines (Windows Event ID 4688) for patterns indicating browser data discovery. Use regular expressions to search for the execution of interpreters (powershell.exe, python.exe, cscript.exe) or utilities (sqlite3.exe, esentutl.exe) where the command line includes paths such as `AppData\\Local\\Google\\Chrome\\User Data`, `AppData\\Roaming\\Mozilla\\Firefox\\Profiles`, or specific filenames like `Login Data`, `cookies.sqlite`, `places.sqlite`. Flag instances where these tools are invoked with such paths, especially when combined with copy or read commands."
          },
          {
            "description": "Anomalous process access to sensitive browser data files by processes not associated with normal browser or security operations.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable object access auditing on default browser profile directories. Monitor for file read events (Windows Event ID 4663 with `Accesses` containing `ReadData`) targeting sensitive files (`Login Data`, `cookies.sqlite`, `places.sqlite`, `Web Data`). Correlate the Process ID with process creation events (Windows Event ID 4688) to identify the process name and parent. Maintain a baseline of legitimate processes (e.g., chrome.exe, firefox.exe, security scanners) that access these files. Use frequency analysis and set operations to alert on any process accessing these files that is not on the established allowlist."
          },
          {
            "description": "A sequence of actions where a process accesses browser data files, followed shortly by file creation in a staging directory and/or subsequent outbound network connections.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a detection rule that correlates events in a sequence within a short time window (e.g., 5 minutes). The sequence is: 1. A process reads browser data files (Windows Event ID 4663). 2. The same process (by Process ID/Name) creates a new file, potentially an archive (.zip, .rar) in a staging location like C:\\Users\\Public\\ or %TEMP% (identified via file creation events or Windows Event ID 4688). 3. The same process initiates an outbound network connection (Zeek conn.log correlated by host IP and timestamp). Use correlation analysis to link these events by process and host. Analyze the data transferred (`orig_bytes` in Zeek conn.log); apply outlier detection using Inter-Quartile Range (IQR) to find unusually large transfers following browser data access."
          },
          {
            "description": "A process known for creating memory dumps targeting a running web browser process to extract credentials and session data from memory.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) where a known memory dumping utility (e.g., procdump.exe, comsvcs.dll via rundll32.exe, Task Manager when saving a dump) is executed with the process ID or name of a browser (e.g., chrome.exe, firefox.exe, msedge.exe) as an argument. Analyze the command line for patterns indicative of memory dumping. This behavioral detection is tool-agnostic to the specific dumping utility but focuses on the action of dumping a browser's memory."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]