[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using system script proxies?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense-Evasion",
    "indicators": [
      {
        "technique_id": "T1216",
        "name": "System Script Proxy Execution",
        "evidence": [
          {
            "description": "Execution of a system script proxy with command-line arguments containing known malicious indicators, such as specific URLs, IP addresses, domains, or file hashes.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously scan the 'Command Line' field in Windows Event ID 4688 process creation events for atomic indicators from a high-confidence threat intelligence feed. Use a regularly updated list of known malicious URLs, IP addresses, domains, filenames, and hashes. Inner join observed indicators with the threat feed and alert on any matches associated with script proxies like cscript.exe, wscript.exe, etc."
          },
          {
            "description": "Execution of system script proxies (e.g., forfiles.exe, pubprn.vbs) using command-line structures and argument patterns that match known malicious toolsets or specific attack campaigns.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 command-line arguments for known malicious patterns associated with T1216. Maintain and apply a library of regular expressions that match specific, known-bad command invocation patterns, such as `forfiles /p c:\\windows\\system32 /m notepad.exe /c ...` or `cscript //E:JScript ...` used to execute remote code. This approach targets the structure of the attack, making it more resilient than atomic IOCs."
          },
          {
            "description": "A system script proxy (e.g., cscript.exe, wscript.exe) executes and spawns an anomalous child process, such as powershell.exe, cmd.exe, or another binary not typically launched by a script interpreter.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal child processes for system script interpreters (e.g., cscript.exe, wscript.exe) across the environment. Monitor Windows Event ID 4688 logs for parent-child process relationships that deviate from this baseline. Use frequency analysis and descriptive statistics to identify rare or never-before-seen child processes. Alert on high-risk child processes like powershell.exe, cmd.exe, rundll32.exe, or any process launching from a temporary directory."
          },
          {
            "description": "A system script proxy or its immediate child process initiates an outbound network connection, especially to a rare or low-reputation destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Windows Event ID 4688) for script proxies with network connection logs (Zeek conn.log). Baseline the expected network behavior of these processes (which should be minimal or non-existent). Use correlation analysis to link any network connection in Zeek conn.log back to a script proxy process execution on the source host within a short time window. Analyze the destination IP, port, and protocol; use frequency analysis, percentile rankings, or entropy measures to flag connections to rare or unusual external destinations."
          },
          {
            "description": "Execution of a system script proxy with a command line referencing a script file located in a suspicious or non-standard directory, such as a user's download folder, temporary directory, or a world-writable location.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for script proxy executions where the command line references a script file path. Analyze the path for execution from high-risk locations (e.g., %TEMP%, %APPDATA%, %PUBLIC%, network shares). Establish a baseline of common script execution locations. Use time series analysis or linear regression to detect a sudden increase in script executions from these unusual directories across the enterprise. Calculate the entropy of script paths to identify execution from deeply nested or randomized directory structures, which is a common evasion tactic."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]