[
  {
    "information_requirement": "Is the adversary establishing command and control using remote access hardware?",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1219.003",
        "name": "Remote Access Hardware",
        "evidence": [
          {
            "description": "Network traffic to or from IP addresses or domains known to be associated with the C2 infrastructure of specific remote access hardware vendors or known malicious operations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate all network connection logs (Zeek conn.log) and DNS queries (Zeek dns.log) against a continuously updated cyber threat intelligence (CTI) feed of IPs and domains known to be default C2 endpoints for commercial or malicious remote access hardware (e.g., IP KVMs, Plunder Bug, Bash Bunny). Inner join network logs with this CTI feed and alert on any matches."
          },
          {
            "description": "Detection of new network interfaces or hardware on a host with names or properties matching known remote access hardware, or network traffic exhibiting protocol-specific artifacts (e.g., default MAC addresses, DHCP hostnames).",
            "data_sources": [
              "Windows Event ID 6416",
              "Windows Event ID 4688",
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for new hardware detection events (e.g., Windows Event ID 6416 for new external devices) and correlate with subsequent command-line activity querying network configurations (e.g., 'ipconfig' captured via Windows Event ID 4688). Concurrently, monitor Zeek dhcp.log for new DHCP requests with hostnames or MAC address vendor prefixes known to be defaults for remote access hardware. Maintain and search against a list of these device-specific patterns."
          },
          {
            "description": "A host begins generating network traffic to a new external destination immediately following the connection of a new physical device, especially when no interactive user is logged on.",
            "data_sources": [
              "Windows Event ID 6416",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate new hardware connection events on a host (e.g., Windows Event ID 6416 for new device recognition) with the initiation of new, outgoing network connections (Zeek conn.log) from that same host within a short time window (e.g., 1-5 minutes). Use correlation analysis on timestamps between the hardware event and the first network packet to the new destination. Significantly increase the alert priority if this sequence occurs on a host with no active interactive logon session (i.e., no recent Windows Event ID 4624 with Logon Type 2 or 10)."
          },
          {
            "description": "System activity indicative of human interaction (e.g., command-line execution, process creation) occurs on a host without a corresponding active interactive logon session.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4634"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor for process creation events (Windows Event ID 4688) on critical systems. For each event, verify if an active interactive logon session (Windows Event ID 4624, Logon Type 2 or 10) exists for a user on that host. Flag any process execution that cannot be attributed to an active interactive session or a legitimate, known system or scheduled task process. Use time series analysis to identify clusters of activity occurring after a user has logged off (post-Event ID 4634)."
          },
          {
            "description": "A host exhibits persistent, low-and-slow, or otherwise anomalous network communication patterns inconsistent with known applications or user behavior on that host.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile baseline network behavior for hosts, particularly servers and critical workstations. Monitor Zeek conn.log for new, long-duration connections or highly periodic, low-volume 'heartbeat' connections to external IPs. Analyze data transfer volumes and session durations using descriptive statistics (e.g., IQR, standard deviation) to find outliers when compared to the host's baseline. Use time series analysis (e.g., autocorrelation) to detect periodicity in connection attempts, which is a common behavior for hardware-based C2 implants."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]