[
  {
    "information_requirement": "Is the adversary collecting sensitive data or information via messaging applications?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1213.005",
        "name": "Messaging Applications",
        "evidence": [
          {
            "description": "Network traffic from messaging applications to IP addresses or domains known to be associated with malicious activity or non-corporate data hosting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate destination IP addresses from Zeek conn.log and Server Name Indication (SNI) fields from Zeek ssl.log associated with messaging application traffic against a high-confidence cyber threat intelligence (CTI) feed of known malicious hosts, C2 servers, or unauthorized cloud storage domains. Alert on any matches and investigate the associated endpoint and user for data exfiltration activity."
          },
          {
            "description": "Execution of messaging applications with command-line parameters indicative of scripted or automated file transfer for data collection.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for common messaging applications (e.g., Slack, Telegram, Discord). Inspect the full command-line arguments for patterns associated with automation or scripting tools that abuse these apps for data exfiltration (e.g., arguments for sending files, specifying recipients, or running in a headless/non-interactive mode). Maintain and use a list of regular expressions to match these known malicious patterns."
          },
          {
            "description": "An anomalous volume of data or number of files transferred by a messaging application, significantly deviating from established baselines for a user or endpoint.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek file.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish baselines for data transfer volume (total bytes) and file counts for messaging application traffic per user or endpoint using historical Zeek conn.log and file.log data. Monitor for significant deviations from these norms. Use statistical methods such as Inter-Quartile Range (IQR) or percentile analysis to identify outliers in data volume or file counts that may indicate bulk data collection and exfiltration."
          },
          {
            "description": "Execution of messaging applications by non-interactive system accounts (e.g., SYSTEM) or from an anomalous parent process such as a script interpreter or scheduled task.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze process creation events (Windows Event ID 4688) for messaging applications. Alert when the creating user is a non-interactive or system account (e.g., NT AUTHORITY\\SYSTEM, NETWORK SERVICE) or when the parent process is not a typical interactive shell (e.g., explorer.exe) but is instead a script interpreter (e.g., powershell.exe, cmd.exe), a service process (services.exe), or wmic.exe. Analyze parent-child process relationships to detect anomalies compared to a baseline of normal application launch behavior."
          },
          {
            "description": "A messaging application process initiating network connections to internal network resources not typically accessed by such applications, such as file shares, databases, or internal code repositories.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate messaging application processes (identified via naming convention or host-based sensors) with their network activity using Windows Event ID 5156 (WFP Connection Permitted) or Zeek conn.log. Profile the typical internal destinations for these applications. Flag any connections to sensitive internal IP ranges or ports, such as those hosting databases (1433, 3306), internal file shares (445), domain controllers, or development infrastructure. Use frequency analysis and descriptive statistics to identify rare internal connections from these applications, which may indicate their use for internal data collection."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]