[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using trusted executables?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.012",
        "name": "Verclsid",
        "evidence": [
          {
            "description": "Execution of verclsid.exe with a command-line argument containing a CLSID known to be used by malware or specific threat actors.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 process creation events for `verclsid.exe`. Extract the CLSID from the command-line arguments (e.g., from the /C {CLSID} parameter). Compare the extracted CLSID against a maintained threat intelligence list of CLSIDs known to be associated with malicious COM objects (e.g., from Cobalt Strike, Metasploit, or other malware). Generate a high-priority alert on any match for immediate investigation."
          },
          {
            "description": "Execution of verclsid.exe spawned by a non-standard parent process such as a Microsoft Office application, a scripting engine, or an interactive shell.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation of `verclsid.exe`. For each instance, analyze the parent process name. Establish a baseline of legitimate parent processes (typically `explorer.exe` or `svchost.exe`). Use frequency analysis to identify rare parent-child relationships and flag executions where the parent is a suspicious or unexpected process, such as `winword.exe`, `excel.exe`, `powershell.exe`, `cmd.exe`, `wscript.exe`, or `cscript.exe`."
          },
          {
            "description": "The parent process of verclsid.exe has a command line containing suspicious patterns, such as obfuscated scripts, download cradles, or references to remote resources.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For every `verclsid.exe` execution identified in Windows Event ID 4688 logs, extract the full command line of its parent process. Scan the parent command line for common malicious patterns using regular expressions, such as base64 encoded strings, `IEX (New-Object Net.WebClient).DownloadString`, or other long, complex commands often associated with obfuscated launchers. Use entropy measures on the parent command line to flag unusually complex or randomized strings that may indicate obfuscation."
          },
          {
            "description": "The verclsid.exe process makes an outbound network connection, which is not typical legitimate behavior.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate `verclsid.exe` process execution (Windows Event ID 4688) on a host with any subsequent outbound network connections (Zeek conn.log) originating from that host's IP address within a short time window (e.g., 1-5 minutes). Since `verclsid.exe` should not initiate network traffic, any such connection is highly suspicious. Use correlation analysis based on source IP and timestamp. Investigate the destination IP, port, and data volume of any identified connection."
          },
          {
            "description": "The verclsid.exe process spawns a child process, such as a command shell or scripting interpreter, which is not legitimate behavior.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 logs to identify any processes where the `ParentProcessName` or `ParentProcessGUID` corresponds to `verclsid.exe`. Legitimate execution of `verclsid.exe` does not spawn child processes. The creation of any child process (e.g., `cmd.exe`, `powershell.exe`, `rundll32.exe`, or any other executable) is a strong indicator of malicious activity. Alert on every occurrence of `verclsid.exe` as a parent process."
          },
          {
            "description": "Execution of verclsid.exe with a CLSID that is not registered or has not been previously observed in the environment.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each `verclsid.exe` execution, extract the CLSID from the command line. Create and maintain a baseline of all known-good, frequently used CLSIDs observed in the environment by analyzing historical Windows Event ID 4688 data. Use descriptive statistics (frequency counts) to build this baseline. Flag any execution of `verclsid.exe` with a CLSID that is not on the established baseline list or is known to not be registered on the endpoint, as this may indicate a newly introduced malicious COM object."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]