[
  {
    "information_requirement": "Is the adversary attempting to disrupt system availability by stopping services? (TA0040 - Impact)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1489",
        "name": "Service Stop",
        "evidence": [
          {
            "description": "A process with a known malicious hash or a name associated with adversary tools executes a service control command (`net stop`, `sc stop`, `Stop-Service`), or any process stops a critical security service (e.g., `WinDefend`, `Sysmon`, EDR agent service).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All managed endpoints and servers, especially security infrastructure servers hosting AV/EDR management consoles.",
            "action": "Symbolic Logic: Join process creation events (Windows Event ID 4688) with a threat intelligence feed of malicious file hashes. Alert if a matching process executes `net.exe`, `sc.exe`, or `powershell.exe` with 'stop' arguments. Separately, create a static rule to alert on any service stop event (Windows Event ID 7036) where the service name is on a critical watchlist (e.g., 'WinDefend', 'SysmonSvc', 'CbDefense', 'MsSense').\nStatistical Method: For each parent process (e.g., `powershell.exe`), calculate the rarity of the command line arguments used to stop a service. Using a Term Frequency-Inverse Document Frequency (TF-IDF) model on command line logs, flag commands with unusually low IDF scores (indicating rare commands) that also contain service stop keywords.\nMachine Learning: Use a supervised classification model (e.g., Random Forest) trained on labeled historical data. Features should include parent process name, command-line parameters, user context, and target service name. The model will classify each service stop command execution (Event ID 4688) as benign or malicious, alerting on high-probability malicious events."
          },
          {
            "description": "A single process or user account executes more than 5 service stop commands across one or more hosts within a 1-minute window, particularly targeting critical system or business application services.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All managed endpoints and servers, with a focus on server groups hosting the same application (e.g., web farms, database clusters).",
            "action": "Symbolic Logic: Create a SIEM rule that counts service stop events (Event ID 7036) or commands (Event ID 4688 with `net stop`, `sc stop`, `Stop-Service`) grouped by `hostname` and `user`. Alert if the count exceeds a static threshold, such as 5 events in 1 minute.\nStatistical Method: For each host, establish a baseline for the number of service stop events (Event ID 7036) per 5-minute interval. Use a moving average and standard deviation to define a dynamic threshold (e.g., alert if count > mean + 3 * standard_deviation). This accounts for normal fluctuations in service restarts.\nMachine Learning: Apply a density-based clustering algorithm like DBSCAN to service stop events in a time-host space. A dense cluster would represent a burst of activity on a single or small group of hosts in a short time, indicative of a coordinated attack script. The algorithm can automatically identify these anomalous clusters without pre-defined thresholds."
          },
          {
            "description": "A service stop event for a data or system protection service (e.g., 'VSS', 'SQLWriter', 'BackupExecAgent') is followed within 15 minutes by high-volume file modification/deletion activity or large data egress from the same host.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, database servers, virtualization hosts, backup infrastructure servers, and network egress points (e.g., Internet gateway).",
            "action": "Symbolic Logic: Create a stateful correlation rule: IF (Event ID 7036 for service 'VSS' or 'SQLWriter' is seen from `hostname`) THEN (within 10 minutes, IF (Event ID 4688 with command `vssadmin delete shadows` is seen from same `hostname`) OR (file modification events (Event ID 4663) > 1000 from same `hostname`) THEN Alert 'Potential Ransomware Activity').\nStatistical Method: Monitor the volume of outbound traffic (in bytes) in `Zeek conn.log` per internal host. Calculate the 99th percentile of data egress per hour for each host. If a critical service stop (Event ID 7036) is observed, monitor that host's egress traffic for the next hour. Alert if the traffic volume exceeds its established 99th percentile.\nMachine Learning: Use a Hidden Markov Model (HMM) to model the sequence of adversary behavior. Define states like 'Benign', 'Recon', 'Service Stop', and 'Impact'. Train the model on known attack sequences. In production, feed the stream of security events (service stops, process creations, file mods) into the HMM and alert when the probability of transitioning into the 'Impact' state exceeds a high-confidence threshold after a 'Service Stop' state has been observed."
          },
          {
            "description": "A service's startup type is changed to 'Disabled' (Event ID 7040 or Registry modification Event ID 4657) or its binary path is modified, where the change is initiated by a non-standard administrative process or occurs outside a defined maintenance window.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 7040",
              "Windows Event ID 1102"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, critical application servers, and endpoint workstations. The registry key `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` is the specific location on these systems.",
            "action": "Symbolic Logic: Alert on any modification to the `Start` value (setting it to 4 for Disabled) or `ImagePath` value within any subkey of `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` (via Event ID 4657), where the initiating process is not `services.exe`, `svchost.exe`, or a known patch management executable. Correlate with a preceding security log clear event (Event ID 1102) within the last hour.\nStatistical Method: Establish a baseline of which accounts and processes normally modify service configurations. Maintain a frequency table of (Process, Account, TargetService, DayOfWeek, HourOfDay) tuples for service modification events (7040, 4657). Score new events based on the rarity of the tuple; an event with a very low frequency (e.g., `psexec.exe` modifying the firewall service on a Sunday at 3 AM) would receive a high risk score.\nMachine Learning: Use an anomaly detection algorithm, such as an autoencoder, on service configuration change events. Train the model on event features like process name, user account, parent process, target service, and time of day. The model learns the normal reconstruction of these events; events with a high reconstruction error are flagged as anomalous and likely malicious."
          },
          {
            "description": "The number of unique services entering a 'stopped' state on a single host within one hour exceeds a statistically-derived baseline, or a specific service stops simultaneously across more than 20% of a logical host group (e.g., domain controllers).",
            "data_sources": [
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Logically grouped assets such as all Domain Controllers, all Exchange servers, all VDI instances, or all hosts within a specific production subnet.",
            "action": "Symbolic Logic: Define logical asset groups in the SIEM. Create a rule that alerts if a specific critical service (e.g., 'MSExchangeIS') stops (Event ID 7036) on more than 50% of the hosts in the 'Exchange Servers' group within a 5-minute window.\nStatistical Method: For each host, calculate the hourly count of unique services stopped via Event ID 7036. Establish a baseline distribution for this count. Alert if the count on a given host exceeds its 99th percentile. This focuses on the breadth of services stopped, not just the volume, distinguishing it from a single flapping service.\nMachine Learning: Use time-series analysis on the count of service stop events (Event ID 7036) across the entire enterprise. Decompose the series into trend, seasonality, and residual components. Apply anomaly detection on the residual component to find enterprise-wide deviations from normal patterns that are not explained by normal daily or weekly cycles, indicating a widespread, coordinated attack."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]