[
  {
    "information_requirement": "Has the adversary modified trust relationships for privilege escalation? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1484.002",
        "name": "Trust Modification",
        "evidence": [
          {
            "description": "An AD FS signing certificate is added with a thumbprint that matches a known-malicious indicator, or the certificate possesses statistically anomalous properties.",
            "data_sources": [
              "Windows Event ID 259",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Federation Services (AD FS) servers",
            "action": "Continuously monitor for the addition of new AD FS signing certificates. 1) (Symbolic) Upon detection of Windows Event ID 259 (AD FS Added Signing Certificate), extract the certificate thumbprint and compare it against a threat intelligence feed of known-malicious thumbprints. Alert on any match. 2) (Statistical) For each new certificate, calculate the entropy of its subject and issuer fields. Establish a baseline for these values from legitimate certificates in the environment and flag any new certificate whose entropy score exceeds the 95th percentile. Also, track the frequency of certificate additions by user and alert if a user not in the PKI administration group performs this action. 3) (Machine Learning) Develop a classification model trained on certificate features (e.g., validity period, key size, issuer, subject entropy, self-signed status) to score the likelihood of a certificate being malicious. Ingest new certificates and alert when the maliciousness score surpasses a predefined threshold."
          },
          {
            "description": "Modification of an AD FS claim issuance policy to include rules that grant high-privilege access or bypass multi-factor authentication controls.",
            "data_sources": [
              "Windows Event ID 501",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Federation Services (AD FS) servers",
            "action": "Monitor for updates to claims issuance policies via Windows Event ID 501. 1) (Symbolic) Use regular expression matching on the event data to search for the addition of high-privilege SIDs (e.g., 'S-1-5-32-544' for Administrators), rules containing 'http://schemas.microsoft.com/claims/authnmethodsreferences' with a value of 'http://schemas.microsoft.com/claims/multipleauthn', or logic that creates a new 'insidecorpenetwork' claim. 2) (Statistical) Establish a baseline for the length and complexity of claim rules. Alert on modifications that cause a statistically significant increase in rule length (e.g., >3 standard deviations from the mean length) or that are performed by an account that has rarely or never performed this action before. 3) (Machine Learning) Use a supervised learning model (e.g., logistic regression) trained on historical rule changes, labeled via change management records, to classify new modifications as 'authorized' or 'unauthorized' based on the user, time of day, and content of the change."
          },
          {
            "description": "A domain trust modification event is followed by a statistically significant increase in cross-domain authentication activity from the newly trusted domain.",
            "data_sources": [
              "Windows Event ID 4703",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network traffic flow points between domain security boundaries",
            "action": "Correlate domain trust changes with subsequent network logon activity. 1) (Symbolic) Create a rule that triggers if a trust modification event (Windows Event ID 4703) is followed within 60 minutes by a successful network logon (Windows Event ID 4624, Logon Type 3) to a high-value asset (e.g., Domain Controller, database server) from an account in the newly trusted domain. 2) (Statistical) For any new or modified trust, baseline the volume of cross-domain authentications over the first 24 hours. Compare this to the average baseline volume for previously established legitimate trusts. An authentication volume exceeding the 99th percentile of this baseline indicates potential abuse. 3) (Machine Learning) Implement a time-series anomaly detection model (e.g., ARIMA) on the volume of cross-domain authentication events (Type 3 logons). Use the occurrence of Event ID 4703 as an exogenous variable to alert on anomalous spikes in authentications that are temporally linked to the trust modification."
          },
          {
            "description": "A domain's authentication method is changed from 'Managed' to 'Federated' by an unauthorized account or outside of a scheduled change window.",
            "data_sources": [
              "Windows Event ID 307",
              "Windows Event ID 510",
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, AD FS Servers, Administrator Workstations",
            "action": "Monitor for changes to domain federation settings. 1) (Symbolic) Maintain an explicit allow-list of administrative accounts authorized to perform federation changes. Alert on any execution of 'Set-MsolDomainFederationSettings' or 'Update-MSOLFederatedDomain' (from Event ID 4688/4104) or generation of Event IDs 307/510 by any account not on this list. 2) (Statistical) Analyze the timestamps of all federation setting changes. Use percentile analysis to identify changes occurring at anomalous times (e.g., outside the 5th-95th percentile of historical change times, which typically align with business hours). 3) (Machine Learning) Deploy a UEBA model that creates a behavioral profile for each administrator. If an administrator who normally manages exchange servers suddenly modifies federation settings from a new workstation, the model should flag this deviation as a high-risk anomaly, even if the account is broadly privileged."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary modifying trust relationships for defense evasion? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1484.002",
        "name": "Trust Modification",
        "evidence": [
          {
            "description": "Federation settings are modified to add a trusted realm URI pointing to a suspicious or known-malicious domain.",
            "data_sources": [
              "Windows Event ID 307",
              "Windows Event ID 510",
              "Windows Event ID 4104",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Domain Controllers, DNS Servers, Network Gateways",
            "action": "Inspect all modifications to federation settings for suspicious URIs. 1) (Symbolic) Extract any URI added as a trusted realm from PowerShell logs (Event ID 4104) or AD FS configuration logs. Compare the domain against a threat intelligence feed of known-malicious domains and alert on a match. 2) (Statistical) For each new URI, check the domain's registration age from passive DNS or WHOIS data. A domain registered within the last 30 days is statistically suspicious for use as a federation endpoint. Additionally, calculate the character entropy of the hostname part of the URI and flag any value that exceeds the 95th percentile of known-good URIs. 3) (Machine Learning) Utilize a pre-trained machine learning model that classifies domains as benign or malicious based on lexical features (length, character distribution, n-grams). Score every new issuer URI and alert if the maliciousness probability is high."
          },
          {
            "description": "Execution of PowerShell cmdlets like 'Update-MSOLFederatedDomain' with parameter values that specify a foreign or non-standard token-signing certificate or issuer URI.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Domain Controllers, Administrator Workstations",
            "action": "Monitor for execution of federation management cmdlets. 1) (Symbolic) Use regular expressions on PowerShell Script Block logs (Event ID 4104) to detect 'Update-MSOLFederatedDomain' or 'Set-MsolDomainFederationSettings'. Flag any invocation where the '-IssuerUri' parameter contains a domain not on an allow-list of corporate and partner domains, or where the '-SigningCertificate' parameter is used to inject a new certificate. 2) (Statistical) Create a frequency distribution of all parameter combinations used with these cmdlets. An execution using a statistically rare parameter (e.g., '-FederationBrandName') or a rare combination of parameters should be flagged for review. 3) (Machine Learning) Train an anomaly detection model (e.g., Isolation Forest) on the feature set of command executions (command name, parameters used, user, host). This can identify novel or unusual invocations that deviate from established administrative patterns."
          },
          {
            "description": "A privileged account modifies a domain trust from a geographically anomalous location or at an unusual time, and this action is not correlated with any authorized change request.",
            "data_sources": [
              "Windows Event ID 4703",
              "Windows Event ID 307",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, AD FS Servers, VPN Concentrators, Cloud Access Security Broker (CASB)",
            "action": "Analyze the context of all trust modification activities. 1) (Symbolic) Geofence all privileged access. If a logon event (Event ID 4624) immediately preceding a trust modification (e.g., Event 4703, 307) originates from an IP address that geo-locates to a country outside of an approved list, generate a high-priority alert. 2) (Statistical) For each privileged user, build a baseline of normal login times and source IP subnets/countries using Zeek conn.log and Windows Event ID 4624. Use a scoring system: add risk points if a trust modification is preceded by a login that is >2 standard deviations from the user's mean login time or originates from a country they have never logged in from before. Alert if the total risk score exceeds a threshold. 3) (Machine Learning) Employ a UEBA platform or a custom-built anomaly detection model (e.g., One-Class SVM) to model each privileged user's session behavior. The model should ingest features like login time, source IP/ASN, commands run, and resources accessed. A trust modification action occurring within a session flagged as anomalous by the model warrants immediate investigation."
          },
          {
            "description": "An anomalous pattern of network connections from an AD FS server to external identity provider IP addresses occurs within minutes of a trust modification event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 307",
              "Windows Event ID 501"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Network Perimeter Firewalls, DNS Servers",
            "action": "Correlate internal configuration changes with external network traffic. 1) (Symbolic) Create a rule that alerts if a trust modification event (e.g., 307, 501) on an AD FS server is followed within 5 minutes by an outgoing connection from that server to an IP address not on a pre-approved list of known IdP endpoints. 2) (Statistical) Baseline the hourly volume of data transferred (from Zeek conn.log 'orig_bytes' and 'resp_bytes') from AD FS servers to known IdP endpoints. Alert if a data transfer spike >3 standard deviations above the baseline occurs immediately following a trust modification event. 3) (Machine Learning) Implement a time-series forecasting model (e.g., Prophet) on the connection count from AD FS servers to external IdPs. If the actual connection count significantly exceeds the model's forecast (i.e., falls outside the prediction interval) within a short window after a trust modification event is logged, flag it as a correlated anomaly indicative of an adversary testing or exploiting the new trust."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]