[
  {
    "information_requirement": "Is the adversary causing negative impact via cloud service hijacking?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1496.004",
        "name": "Cloud Service Hijacking",
        "evidence": [
          {
            "description": "Communication with domains/IPs known to be associated with cloud hijacking infrastructure or the use of known compromised cloud service API keys.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join destination IP addresses and domains from Zeek conn.log and dns.log against a continuously updated cyber threat intelligence (CTI) feed of indicators related to cloud hijacking campaigns (e.g., malicious redirectors, C2 used to manage hijacked resources). Separately, scan Zeek http.log for API keys in headers (e.g., 'Authorization: Bearer ...') or request bodies and match them against a watchlist of known compromised keys. Alert on any confirmed matches."
          },
          {
            "description": "Specific sequences and structures of API calls to cloud services matching known patterns of resource abuse, such as programmatic spamming or Large Language Model (LLM) hijacking tools.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and monitor for specific API call sequences and request structures within Zeek http.log. For spam, detect a login/auth API call to a mail service (e.g., AWS SES, SendGrid) followed by a rapid series of 'SendEmail' or 'SendRawEmail' API calls with high recipient diversity. For LLM hijacking, detect high-frequency requests to inference endpoints (e.g., OpenAI's '/v1/chat/completions') containing request bodies with characteristics of prompt injection or automated content generation abuse. Maintain and use regular expression signatures for these tool-specific API interaction patterns."
          },
          {
            "description": "Anomalously high volume of outbound network traffic or API calls to cloud services, indicative of bulk messaging abuse or unauthorized resource consumption.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish baselines for outbound connection counts, data volume, and API request frequency to specific cloud services (messaging, compute, storage) per internal host. Use time series analysis on these metrics to detect significant spikes that exceed dynamic thresholds (e.g., >3 standard deviations from the mean). Analyze Zeek smtp.log for abnormally high entropy in destination email domains, suggesting a spam campaign. For API calls in Zeek http.log, use descriptive statistics on request frequency to flag hosts exhibiting abusive behavior."
          },
          {
            "description": "Anomalous usage of cloud service credentials, such as API keys or user accounts, from unexpected geographic locations, internal hosts, or at unusual times.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For cloud service access observed in Zeek http.log (via API keys or interactive logins), correlate the source IP with the associated internal host and user account (via Windows Event ID 4624 or asset inventory). Geolocate source IPs. Establish a baseline of normal access locations and times for each key/account. Use frequency analysis and percentile calculations to flag usage from rare geolocations or at times that are statistically anomalous for that entity. Detect and alert when a single API key is being used simultaneously from multiple disparate internal hosts or external IPs."
          },
          {
            "description": "Significant, unexplained increases in network data transfer to/from cloud services that serve as a proxy for resource utilization and potential cost overruns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor network data transfer volumes to and from cloud service provider IP ranges. Use statistical methods like Inter-Quartile Range (IQR) and box plots on data volume (bytes_in/bytes_out in Zeek conn.log) and connection counts per host to identify outliers. Correlate top-consuming internal IPs with successful user logins (Windows Event ID 4624) to attribute the activity. Use linear regression to model expected data transfer volumes based on user role or historical activity, and flag significant positive deviations that would likely indicate resource abuse or hijacking."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]