[
  {
    "information_requirement": "Is the adversary causing network impact through bandwidth hijacking?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1496.002",
        "name": "Bandwidth Hijacking",
        "evidence": [
          {
            "description": "Connections from internal hosts to external IP addresses or domains known to be associated with botnet C2 infrastructure, proxyware services, or malicious scanners.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log against high-confidence, regularly updated threat intelligence feeds specializing in botnet C2s, public proxyware services, TOR exit nodes, and known malicious scanning infrastructure. Alert on any matches and investigate the source host for signs of compromise."
          },
          {
            "description": "Execution of processes with names or command-line arguments known to be associated with proxyware, botnet clients, or cryptocurrency mining software.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) logs for process names (e.g., 'xmrig.exe', 'proxy.exe', 'pawn.exe') or command-line arguments (e.g., '--donate-level', '--pool', '-o stratum+tcp://') that match a maintained list of patterns for known proxyware, miners, and botnet malware. Correlate alerts with network activity from the same host to confirm bandwidth consumption."
          },
          {
            "description": "Anomalous DNS query patterns, including high-frequency requests for domains associated with known cryptocurrency mining pools, proxyware services, or dynamic DNS providers used by botnets.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain and cross-reference queried domains from Zeek dns.log against regularly updated lists of known mining pools, proxyware C2, and botnet-related dynamic DNS domains. Calculate the entropy of queried second-level domains per host; a sudden drop in entropy to a few repeating malicious domains can be a strong indicator. Use correlation analysis to link hosts with suspicious DNS activity to those exhibiting high bandwidth usage."
          },
          {
            "description": "Sustained, anomalous outgoing network traffic from internal hosts that is inconsistent with their established role-based baseline, indicating potential resource abuse.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log, aggregating total outbound bytes (`orig_bytes`) per internal host over fixed time intervals (e.g., 10 minutes, 1 hour). Establish a dynamic baseline of normal outbound bandwidth usage for each host or host group using historical data. Employ time series analysis (e.g., Holt-Winters) or statistical process control charts to detect significant positive deviations from the baseline. Use percentile analysis on current usage across all hosts to identify top consumers that may warrant investigation."
          },
          {
            "description": "Internal hosts exhibiting network traffic patterns consistent with participation in a Distributed Denial of Service (DDoS) attack, such as high-volume, repetitive connections using specific protocols to a small number of external targets.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for internal hosts generating an unusually high rate of connections or packets to a limited set of external destination IPs. Use descriptive statistics to identify hosts with an abnormally high ratio of outbound packets to inbound packets. Specifically hunt for DDoS patterns like high volumes of small UDP packets, a high rate of ICMP echo requests, or a high rate of unacknowledged TCP SYN packets (conn_state 'S0'). Use time series analysis on packet counts per host to detect sudden, intense bursts of such activity."
          },
          {
            "description": "High fan-out network connection patterns from internal hosts, characterized by connections to an abnormally large number of unique external IP addresses or ports, indicative of scanning or P2P activity.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each internal host, calculate the count of distinct destination IPs and destination ports connected to within a short time window (e.g., 1 minute) using Zeek conn.log. Use the Inter-Quartile Range (IQR) method or percentile rankings to identify hosts with an anomalously high fan-out count compared to their peers. Measure the entropy of destination IPs per source; low entropy may indicate scanning across a single subnet, while high entropy can indicate wider internet scanning or P2P activity. Correlate network findings with Windows Event ID 5156 (WFP connection permitted) on the host to identify the specific process responsible for the high volume of connections."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]