[
  {
    "information_requirement": "Has the adversary impacted the network or data through defacement?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1491",
        "name": "Defacement",
        "evidence": [
          {
            "description": "Detection of known defacement-related indicators of compromise (IOCs), such as malicious file hashes, specific content strings, or source IPs in web server directories or traffic.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously scan newly created or modified files on web servers (identified via file integrity monitoring or Windows Event ID 4663) for file hashes matching known defacement-related files from cyber threat intelligence (CTI) feeds. Use regular expressions to scan web content in transit (Zeek http.log response bodies) or at rest for known hacktivist messages or signatures. Inner join network traffic logs (Zeek conn.log) to web servers with a CTI list of IPs known to be used in defacement campaigns and investigate any matches."
          },
          {
            "description": "Execution of anomalous processes or scripts on a web server that modify web content, often spawned by a web service process following a potential exploit.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate web exploitation attempts (e.g., command injection, file inclusion signatures in Zeek http.log) from a source IP with subsequent process creation events (Windows Event ID 4688) on the target web server. Monitor for web server processes (e.g., w3wp.exe) spawning command shells (cmd.exe, powershell.exe) or utilities (`ftp.exe`, `certutil.exe`) used to download or write new content. Alert when such a spawned process modifies web content files (correlated via timestamp and path with Windows Event ID 4663)."
          },
          {
            "description": "Anomalous modification of critical web content files (e.g., index pages, master pages, configuration files) occurring outside of standard deployment processes or business hours.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal file modification activity in web server directories, noting typical processes (e.g., CI/CD pipeline service accounts), user accounts, and time windows for deployments. Monitor Windows Event ID 4663 (Object Access) and 4688 (Process Creation) for any modifications to key web files that deviate from this baseline. Use time series analysis to identify anomalous spikes in modification events and alert on modifications made by non-standard user accounts or unexpected parent processes."
          },
          {
            "description": "A sudden, high-volume change in the structural composition or content of web pages, such as a significant shift in text-to-HTML ratio, language used, or the introduction of numerous external links.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Baseline the typical characteristics of web pages served by key applications, including page size, text-to-HTML ratio, number and domain of images and scripts, and number of outbound links. Monitor Zeek http.log for HTTP responses. On a schedule or upon a file modification trigger, analyze served content for significant deviations from this baseline. Use entropy measures on page text or correlation analysis between historical and current page feature vectors to detect wholesale content replacement indicative of defacement."
          },
          {
            "description": "Suspicious network file transfers to web server directories, characterized by unusual source IPs, non-standard user accounts, or anomalous file types or sizes.",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek smb_files.log",
              "Zeek conn.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek ftp.log and Zeek smb_files.log for write operations targeting known web server content directories. Correlate these network transfer events with file modification events on the server (Windows Event ID 4663). Profile normal file transfer activity to these directories (source subnets, user accounts, file types, volume). Use descriptive statistics and frequency analysis to establish a baseline and flag outliers using Inter-Quartile Range (IQR) or percentile-based thresholds, such as transfers from untrusted network segments, transfers by non-administrative users, or uploads of unexpected file types (e.g., executables, archives) to static content directories."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]