[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using time-based methods?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1497.003",
        "name": "Time Based Evasion",
        "evidence": [
          {
            "description": "Execution of specific, known malicious command-line strings used by malware to implement long delays or terminate execution based on time checks.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 command lines for exact or regular expression matches against a maintained list of known malicious time-evasion command lines from threat intelligence. This includes specific PowerShell, VBScript, or batch one-liners used by malware families. Alert on any match and treat as a high-fidelity indicator."
          },
          {
            "description": "Use of common command-line utilities in patterns designed to induce long execution delays, such as pinging localhost for a large number of iterations or using the timeout command with an abnormally large value.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creations involving `ping.exe` or `timeout.exe`. Analyze command line arguments for patterns like `ping -n [number] 127.0.0.1` or `timeout /t [number]`. Use descriptive statistics on the numeric argument to flag outliers (e.g., values corresponding to delays > 300 seconds) that are highly anomalous for legitimate administrative use. A box-plot of delay values can help visualize and identify outliers."
          },
          {
            "description": "Anomalously long execution delays observed between a process launch and its first significant action (e.g., network connection, file modification), indicating an attempt to wait out automated analysis environments.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Event ID 4688) with subsequent child processes or significant network activity (e.g., the first non-local connection in Zeek conn.log) from the same host. Calculate the time delta between a parent process start and its first significant action. Use time series analysis or percentile-based thresholds (e.g., 99th percentile) on these deltas across the enterprise to identify processes that remain dormant for unusually long periods (e.g., > 10 minutes) before initiating activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to discover the environment using time-based methods?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1497.003",
        "name": "Time Based Evasion",
        "evidence": [
          {
            "description": "Execution of encoded PowerShell commands containing specific keywords related to time queries (e.g., 'Get-Date', 'Measure-Command', 'Start-Sleep') known to be used by malware for sandbox discovery.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for `powershell.exe` processes with `-enc` or `-e` arguments. For each event, Base64 decode the command-line argument and scan the decoded script content for the presence of keywords like 'Get-Date', 'Measure-Command', 'Start-Sleep', 'GetTickCount' used in close proximity or within loops. Correlate findings with a list of known malicious encoded command patterns from threat intelligence."
          },
          {
            "description": "A distinct sequence of commands executed by a process that queries system time, deliberately pauses execution, and then queries system time again to detect time acceleration common in sandboxes.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Event ID 4688 events to detect processes executing a sequence pattern such as [Time Query Command 1] -> [Sleep Command] -> [Time Query Command 2] within a short window (e.g., `cmd.exe /c \"time /t && timeout /t 10 && time /t\"`). Correlate the timestamps of the log events themselves. If the actual elapsed time between the log for Time Query 1 and Time Query 2 is significantly less than the sleep duration specified in the command (e.g., < 50% of requested time), flag the process as a highly probable sandbox check. Use correlation analysis on event timestamps and command-line arguments."
          },
          {
            "description": "A process exhibiting an unusually high frequency of system time queries or interactions with performance counters without other meaningful activity, suggesting environmental monitoring for time consistency.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each process, monitor the frequency of command executions related to time queries (`date /t`, `time /t`) or system uptime (`systeminfo | find \"System Boot Time\"`). Establish a baseline for how often legitimate processes query the time. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores on the count of time queries per process over its lifetime to identify outliers. A process that queries the time dozens of times in a few seconds without other actions is anomalous and may be checking for time 'jitter' in a virtualized environment."
          },
          {
            "description": "Execution of discovery commands (e.g., network scanning, user enumeration) that are strictly conditional upon a preceding long, scripted delay or a specific time-of-day trigger.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Windows Event ID 4688 logs for process creation events related to discovery (`ipconfig`, `whoami`, `net user`, `systeminfo`, etc.). Correlate the execution of these discovery commands with the termination of a preceding long `timeout` or `ping -n` process from the same parent. Use time series analysis to identify if these discovery activities occur at specific, repeated times of day (e.g., always at 2:00 AM) across the environment, suggesting a scheduled trigger for discovery."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]