[
  {
    "information_requirement": "Has the adversary impacted systems or data by defacing internal resources?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1491.001",
        "name": "Internal Defacement",
        "evidence": [
          {
            "description": "Known defacement-related file hashes, filenames, or embedded content signatures detected on internal web servers or endpoints.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously scan files written to internal web server directories and endpoint systems (monitored by Windows Event ID 4663 for write access) and compare their hashes against a threat intelligence feed of known defacement tool, image, or script hashes. Monitor Zeek files.log for network transfers of files with matching hashes. Scan the content of web pages transferred over the network (via Zeek http.log) for known malicious strings, comments, or filenames associated with public defacement campaigns."
          },
          {
            "description": "Execution of specific command-line utilities or scripts with arguments targeting known system resources for visual defacement, such as wallpaper, login screens, or website index files.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create specific detection rules to monitor for process creation events (Windows Event ID 4688) with suspicious command lines. Flag executions of `reg.exe`, `powershell.exe`, or `wscript.exe`/`cscript.exe` with arguments that modify registry keys for UI appearance (e.g., `HKCU\\Control Panel\\Desktop\\Wallpaper`). Also, monitor for commands like `copy`, `move`, or `echo` redirecting output to overwrite standard web server index files (e.g., `index.html`, `default.aspx`) or system files related to logon screens."
          },
          {
            "description": "Anomalous file modification activity on internal web servers, characterized by unusual volume, source, file types, or targeting of sensitive files outside of normal content update cycles.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal content update activity for internal web servers (e.g., source IPs of developers, typical file types and sizes, update frequency, time of day). Monitor Zeek http.log for PUT/POST requests and Zeek files.log for file transfers that deviate significantly from this baseline. Use time series analysis to detect spikes in modification events. Employ frequency analysis or percentile ranking to flag new or rare source IPs modifying content. Correlate with write events (Windows Event ID 4663) on the server to identify the responsible processes."
          },
          {
            "description": "An unusual process execution chain or sequence of file modifications leading to changes in system visual elements across one or more systems.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for a behavioral sequence of events where a non-standard process (e.g., spawned from an Office document, running from a temporary directory) writes a new file (monitored by Windows Event ID 4663), especially an image, which is immediately followed by the execution of a system utility (`reg.exe`, `powershell.exe` monitored by Windows Event ID 4688) that sets this new file as a system visual element (e.g., wallpaper). Use correlation analysis to link these events by process ID and time window. Use descriptive statistics to flag when this behavior occurs across an unusual number of hosts in a short period, indicating widespread impact."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]