[
  {
    "information_requirement": "Is the adversary inhibiting system recovery capabilities?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1490",
        "name": "Inhibit System Recovery",
        "evidence": [
          {
            "description": "Execution of a process whose file hash matches a known malicious tool (e.g., ransomware executable) associated with inhibiting system recovery.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) and extract the file hash for each new executable. Correlate these hashes against a high-confidence cyber threat intelligence (CTI) feed of known malicious file hashes, particularly those associated with ransomware or wiper malware families known to perform recovery inhibition. Alert on any match and initiate incident response."
          },
          {
            "description": "Execution of legitimate system utilities with specific command-line arguments or script content known to delete volume shadow copies, backup catalogs, or alter boot configurations.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events involving utilities such as `vssadmin.exe`, `wmic.exe`, `wbadmin.exe`, `bcdedit.exe`, and `diskshadow.exe`. Use regular expressions to search command-line arguments for specific patterns indicative of recovery inhibition, such as `delete shadows`, `delete catalog`, `recoveryenabled no`, or `ignoreallfailures`. Use descriptive statistics to establish a baseline of normal administrative usage for these commands and flag rare or anomalous executions, especially when correlated with preceding suspicious parent processes."
          },
          {
            "description": "Anomalous sequence of actions involving the widespread and rapid deletion of system recovery points or backup files across multiple systems, deviating from established administrative baselines.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal administrative activity related to backup and recovery management. Monitor for a behavioral sequence where a process (identified via Event ID 4688) triggers a high volume of successful deletion events (Event ID 4663) for files with `.bak` extensions or files located in 'System Volume Information' directories. Use time series analysis to detect unusual spikes in deletion activity across the environment. Use correlation analysis to link these deletion spikes to a common process, user account, or originating host, indicating a coordinated, non-standard cleanup or destructive action."
          },
          {
            "description": "Unusual network activity and API calls targeting backup infrastructure (hypervisors, cloud storage) consistent with disabling or deleting backups and snapshots.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Baseline normal connection patterns and API usage for managing network-based or cloud-based backups (e.g., connections to hypervisor management IPs, S3/Azure Blob Storage API endpoints). Monitor Zeek conn.log and http.log for connections from unusual internal sources (i.e., not designated backup servers or admin workstations) to these management interfaces. Analyze API calls for an anomalous frequency of `DELETE` requests or specific calls that disable versioning or delete snapshots. Use entropy measures on the types of API calls from a given source; a sudden focus on destructive calls is anomalous. Use time series analysis to detect spikes in this activity and correlate with other suspicious internal host behavior."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]