[
  {
    "information_requirement": "Is the adversary maintaining persistence using SQL stored procedures?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.001",
        "name": "SQL Stored Procedures",
        "evidence": [
          {
            "description": "Outbound network connections from the SQL Server process (sqlservr.exe) to IP addresses or domains on threat intelligence lists.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join network connection logs with a high-confidence cyber threat intelligence (CTI) feed of known malicious C2 IPs/domains. Specifically, filter Zeek conn.log for connections where the internal source IP corresponds to a known SQL server. Also, monitor Windows Event ID 5156 on SQL servers for connections initiated by the sqlservr.exe process and correlate the remote IP against the same CTI feed. Alert on any confirmed matches."
          },
          {
            "description": "Execution of common post-exploitation commands, reconnaissance tools, or shell processes as a child of the main SQL Server process (sqlservr.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) logs for any child processes created by sqlservr.exe. Create detection patterns using regular expressions on the process command line field to identify common post-exploitation activity, such as 'whoami', 'net user', 'ipconfig', 'powershell.exe -enc', 'certutil.exe -urlcache', or the execution of any binary from a temporary or user-writable directory. Investigate any non-standard child process."
          },
          {
            "description": "The SQL Server process (sqlservr.exe) making outbound network connections to geographically unusual, statistically rare, or newly observed external destinations.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Using Zeek conn.log and Windows Event ID 5156, establish a baseline of all normal external IP addresses, domains, and ports that SQL servers communicate with. Profile this using descriptive statistics (frequency, connection duration, data volume) and geolocation. Use correlation analysis to flag connections from sqlservr.exe to a destination IP/port that is not on the established baseline, is statistically rare (e.g., low percentile of frequency), or originates from a new or improbable geolocation for the organization. Use time series analysis to detect sudden increases in the number of unique outbound destinations."
          },
          {
            "description": "The SQL Server process (sqlservr.exe) creating or modifying executable files (.exe, .dll, .ps1) in non-standard file system locations such as temporary directories.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Configure System Access Control Lists (SACLs) to audit file system object access (Windows Event ID 4663) on SQL servers. Monitor for any file write or create operations by the sqlservr.exe process outside of its designated data and log directories. Specifically flag the creation of files with executable extensions (.exe, .dll, .ps1, .bat, .vbs) in world-writable locations like C:\\Windows\\Temp, C:\\ProgramData, or user profile temp directories. Establish a baseline of normal file I/O for sqlservr.exe and use entropy measures on filenames and paths to detect anomalous activity."
          },
          {
            "description": "Anomalous or first-time usage of high-risk SQL features like xp_cmdshell, inferred by the SQL Server process spawning a command shell for the first time or outside of authorized change windows.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) logs for the first-ever instance of sqlservr.exe spawning a command shell (cmd.exe) or PowerShell (powershell.exe). Correlate the timestamp of this event with authorized administrator logins and change management records. Any such process creation outside of a documented change window is highly suspicious and indicates that a high-risk feature was likely enabled and used for persistence or execution. Use frequency analysis to flag any subsequent shell creation that deviates from an established (and verified) administrative baseline."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]