[
  {
    "information_requirement": "Is the adversary maintaining persistence using a malicious transport agent?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.002",
        "name": "Transport Agent",
        "evidence": [
          {
            "description": "A new DLL file is created in a Microsoft Exchange Server transport agent directory, and its hash matches a known malicious signature, OR the edgetransport.exe process initiates a network connection to an IP or domain on a threat intelligence feed.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1",
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers (Mailbox and Edge Transport roles); Network Egress/DMZ",
            "action": "Continuously monitor file creation events (Sysmon Event ID 11) in Exchange transport agent directories (e.g., `%ExchangeInstallPath%TransportRoles\\agents\\`). 1) For each new DLL, calculate its hash and correlate against a threat intelligence database of known malicious file hashes. Generate a high-severity alert on any match. 2) Analyze the prevalence of file hashes for all newly created DLLs in these directories. Flag hashes that are statistically rare (e.g., seen only once across the enterprise) for further inspection, as custom malware will not have a known-bad signature. 3) Train a machine learning classifier (e.g., Random Forest) on features from network connections (Zeek conn.log) originating from `edgetransport.exe`, including destination IP, port, duration, and bytes sent. Use labeled data from threat intelligence feeds and historical benign traffic to predict and alert on connections classified as malicious."
          },
          {
            "description": "The 'Install-TransportAgent' cmdlet is executed via PowerShell, or a registry key is created or modified under the Exchange Server's transport agent configuration path, indicating a new agent is being registered.",
            "data_sources": [
              "Windows Event ID 4104",
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Sysmon Event ID 13",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers (Command-line, PowerShell logs, and Registry); Domain Controller Security Logs",
            "action": "Monitor for process execution and registry modification events on Exchange servers. 1) Create a detection rule for PowerShell Script Block Logging (Event ID 4104) or command-line logging (Event ID 4688) containing 'Install-TransportAgent'. Also, alert on any registry key creation/modification (Sysmon Event ID 13) under `HKLM\\SOFTWARE\\Microsoft\\ExchangeServer\\v15\\TransportRoles\\agents\\`. 2) For every 'Install-TransportAgent' execution, calculate the Shannon entropy of the `-AssemblyPath` and `-Name` parameter values. Alert when the entropy score exceeds a baseline threshold (e.g., > 3.5), indicating a high degree of randomness used to evade signature-based detection. 3) Develop a logistic regression model to score the likelihood of an 'Install-TransportAgent' execution being malicious. Features should include: parent process name, user account context, time of day, entropy of the agent name, and whether the DLL path is in a non-standard directory. A high probability score would trigger an alert."
          },
          {
            "description": "The 'edgetransport.exe' process writes a file with a high-risk extension (e.g., .exe, .ps1, .dll, .bat) to a non-standard directory such as C:\\Temp, user profiles, or a web-accessible path.",
            "data_sources": [
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Server File Systems (especially temp, user, and web-accessible directories)",
            "action": "Monitor file creation events originating from the Exchange transport service. 1) Create a rule to alert on any file creation event (Sysmon Event ID 11) where the creating process is `edgetransport.exe` and the target file path is outside a predefined allow-list of known-good Exchange directories OR the file extension is in a block-list (e.g., .exe, .ps1, .bat). 2) For all files written by `edgetransport.exe`, establish a baseline of file path locations and file extensions. Calculate the frequency of each path/extension pair. Alert on pairs that fall into a low-frequency percentile (e.g., bottom 1%), indicating anomalous behavior. 3) Use an unsupervised learning algorithm like Isolation Forest on file creation events from `edgetransport.exe`. Features should include file path depth, file extension, entropy of the filename, and time of day. The model will identify outlier events that represent significant deviations from normal file write activity."
          },
          {
            "description": "An outbound network connection from an Exchange transport process (e.g., 'edgetransport.exe') exhibits characteristics that deviate significantly from established baselines for destination, port, protocol, or data volume.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/DMZ; Microsoft Exchange Servers",
            "action": "Analyze network connections originating from Exchange transport processes. 1) Correlate destination IPs from `Zeek conn.log` and domains from `Zeek dns.log` against a threat intelligence feed of known malicious C2 servers. Generate a high-severity alert on any match. 2) For each Exchange server, create a statistical baseline of outbound connections from `edgetransport.exe`. Track metrics like bytes sent (`orig_bytes`) and connection duration. Alert when a new connection's metrics exceed 3 standard deviations above the mean for that destination port or a value in the 99th percentile for bytes sent. 3) Implement a time series forecasting model (e.g., ARIMA) on the volume of data sent by `edgetransport.exe` per hour. An alert is generated when the actual data volume significantly exceeds the forecasted volume's confidence interval, indicating a potential data exfiltration event. Additionally, use a DBSCAN clustering algorithm on connection features (port, protocol, data volume) to identify clusters of anomalous network activity."
          },
          {
            "description": "A statistically significant deviation in email flow metrics is observed, such as a drop in received mail for a specific user or an increase in outbound mail containing compressed or encrypted attachments.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) traffic logs; Network Egress/DMZ",
            "action": "Analyze email metadata to detect signs of interception or exfiltration. 1) Create a rule to alert when an outbound email (`Zeek smtp.log`) contains an attachment (`Zeek files.log`) with a file magic number for an encrypted archive (e.g., 'application/x-7z-compressed', 'application/zip') and the sender's account has no history of sending such files. 2) For each user, establish a baseline of outbound email activity, including average daily volume and the frequency distribution of attachment MIME types (`file_mime_type` in `smtp.log`). Alert if a user's daily outbound volume exceeds the 95th percentile of their historical distribution. 3) Use a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the inbound email count per hour for high-value mailboxes. An alert is triggered if the count drops into a trough that is flagged as an anomaly, which could indicate a malicious transport agent is silently deleting or redirecting incoming mail."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]