[
  {
    "information_requirement": "Is the adversary maintaining persistence on hypervisors using malicious VIBs?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.006",
        "name": "vSphere Installation Bundles",
        "evidence": [
          {
            "description": "Network transfer of a vSphere Installation Bundle (VIB) file whose hash matches a known malicious VIB.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek files.log for transfers of files with `.vib` or `.vgz` extensions to or from ESXi management hosts. For each transferred file, compute the file hash (MD5, SHA1). Inner join these computed hashes with a threat intelligence feed or a maintained list of known malicious VIB hashes (e.g., associated with malware like VIRTUALPITA, VIRTUALPIE). Alert on any match and isolate the source and destination hosts for investigation."
          },
          {
            "description": "Execution of esxcli commands from a management host to install or modify VIBs using suspicious flags, changing security acceptance levels, or bypassing signature checks.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On vCenter servers and management jump hosts, monitor Windows Event ID 4688 for command-line execution of `esxcli`. Create detection rules for specific command patterns indicative of malicious installation, including: `software vib install` with flags like `--force`, `--no-sig-check`, or `--maintenance-mode`; any use of `software acceptance set --level=` to `CommunitySupported` or `PartnerSupported`; or a rapid sequence of `vib remove` followed by `vib install` for the same component. Investigate the user account and source associated with any matching command patterns."
          },
          {
            "description": "An ESXi host initiates unusual outbound network connections or listens on new unauthorized ports, especially following a reboot or VIB-related management activity.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal network traffic for each ESXi host, including typical destination IPs, ports, protocols, and data volumes. Monitor Zeek conn.log for new or anomalous outbound connections from ESXi hosts, or for external connections to ESXi hosts on non-standard management ports. Use time series analysis to detect new, persistent connections that begin shortly after VIB installation commands (from Windows Event ID 4688) are observed or after a system reboot, which could indicate a malicious VIB has been activated. Use entropy measures on destination ports or IPs from an ESXi host to detect anomalous scanning or C2 activity."
          },
          {
            "description": "Transfer of VIB files to ESXi hosts from sources other than official VMware repositories or designated internal management servers, or occurring outside of established maintenance windows.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define a list of authorized sources for VIB files, such as internal update servers and official VMware repository IPs. Monitor Zeek files.log and conn.log for VIB file transfers (identified by `.vib`, `.vgz` extensions) originating from any other internal or external IP address. Correlate the timestamp of the transfer with approved change request windows. Use descriptive statistics on file sizes and frequency analysis of source/destination pairs to identify rare or anomalous transfer events. Alert on any VIB transfers that occur outside of established policy."
          },
          {
            "description": "VIB installation or modification activity occurring outside of authorized maintenance windows or performed by accounts not designated as hypervisor administrators.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze `esxcli` VIB installation commands (from Windows Event ID 4688 on management hosts) and correlate their timestamps and associated user accounts with external operational data. Flag any VIB management activity that occurs outside of pre-approved change windows (e.g., 10 PM - 4 AM on weekends). Use correlation analysis to verify if the user account performing the action is on a list of designated hypervisor administrators. The absence of a corresponding change management ticket for a detected VIB installation should be treated as a high-fidelity indicator of unauthorized activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]