[
  {
    "information_requirement": "Is the adversary maintaining persistence using component firmware?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1542.002",
        "name": "Component Firmware",
        "evidence": [
          {
            "description": "Outbound network connections from a host to external IP addresses or domains known to be associated with C2 infrastructure used by firmware-level implants.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate destination IPs from Zeek conn.log and requested domains from Zeek dns.log against a specialized, high-confidence cyber threat intelligence (CTI) feed of indicators associated with known firmware implants (e.g., LoJax, CosmicStrand). Since these implants are rare and highly targeted, any match should be treated as a high-priority alert. Use correlation analysis to link the connection back to a specific internal host."
          },
          {
            "description": "Execution of known legitimate firmware update utilities with suspicious command-line arguments, from unusual file paths, or by non-administrative users, indicating a potential attempt to flash malicious firmware.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a baseline of legitimate firmware update activities. Monitor Windows Event ID 4688 (Process Creation) for the execution of vendor-specific firmware flashing utilities (e.g., fwupdmgr, vendor EXEs for NICs/drives). Flag executions that: 1) use command-line arguments for silent/forced flashing or reading firmware to a file, 2) are launched from non-standard paths (e.g., %TEMP%, user download folders), or 3) are executed by an unusual parent process or user account. Use regular expressions on the command-line field to detect suspicious patterns."
          },
          {
            "description": "Anomalous network traffic originating from a host that does not correlate with known running processes or OS-level network activity, suggesting a hardware-level communication channel.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network flow data from Zeek conn.log with host-level network connection events from the Windows Filtering Platform (WFP, Event ID 5156). Identify outbound connections observed at the network layer that lack a corresponding 'permit' event on the source host, or where the host event links to a non-existent or system-critical process where that traffic is unexpected. Time synchronization is critical. Use correlation analysis to flag any hosts with a statistically significant volume of such 'ghost' network traffic."
          },
          {
            "description": "A persistent pattern of device driver or system service failures, particularly for network or storage controllers, that reoccurs after reboots or even complete OS reinstalls.",
            "data_sources": [
              "Windows Event ID 7000",
              "Windows Event ID 7026",
              "Windows Event ID 7"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows System event logs for service and driver failures (Event IDs 7000, 7026, 7). Track the frequency and specific components (drivers/services) failing per host over time. Use time series analysis to identify hosts with chronic, recurring failures of the same component. Critically, investigate if these issues persist across OS patching or re-imaging events, which would strongly suggest a hardware or firmware-level problem rather than a software issue."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using component firmware?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1542.002",
        "name": "Component Firmware",
        "evidence": [
          {
            "description": "Observed network traffic patterns or data payloads matching specific, hardcoded signatures of known covert channels used by firmware implants.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Apply signature-based detection rules using custom Zeek scripts or a correlated Network IDS. Search for specific, hardcoded patterns in protocols like ICMP, DNS (e.g., unusual record types), or custom TCP/UDP headers that are known to be used by specific firmware implants for covert C2 communication. Maintain and regularly update these signatures based on CTI reporting on firmware-level threats."
          },
          {
            "description": "A sequence of events showing security tools being disabled or crashing, immediately followed by the execution of firmware flashing utilities.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 4688",
              "Windows Event ID 1001"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and monitor for a specific attack chain sequence. Correlate events within a short time window (e.g., 5 minutes) on a single host: 1) A security service stopping or crashing (Event ID 7036 for stop, 1001 for crash). 2) The execution of a known firmware update tool (Event ID 4688). 3) The security service subsequently restarting or remaining offline. This pattern strongly suggests a deliberate attempt to evade defenses in order to modify component firmware."
          },
          {
            "description": "Discrepancies between physical disk reads/writes and OS-level file system reporting, or repeated failures of integrity checking tools, suggesting storage controller firmware is hiding malicious data.",
            "data_sources": [
              "Windows Event ID 55",
              "Windows Event ID 137",
              "Windows Event ID 1001"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for an unusual rate of file system errors (Event ID 55, 137) or crashes of applications that perform deep system scans (Event ID 1001), such as AV scanners or disk integrity checkers (e.g., chkdsk). Correlate these errors with specific hosts or disk models. A high rate of such errors, especially if they prevent security tools from completing scans successfully, could indicate that the disk controller firmware is interfering with OS-level disk access to hide its presence or evade detection."
          },
          {
            "description": "Network traffic exhibiting sophisticated covert channel characteristics, such as unusual protocol field manipulation, atypical DNS query patterns, or steganography within common protocols.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Perform advanced statistical analysis on network traffic from suspect hosts. For Zeek dns.log, analyze query length distribution, record type entropy, and subdomain name entropy to detect tunneling. For Zeek conn.log, analyze TCP sequence numbers, timestamps, or flags for non-standard patterns inconsistent with normal protocol behavior. For Zeek http.log, analyze the size and entropy of image files or other binary content for signs of steganography. Use time series analysis to detect low-and-slow data exfiltration that remains below simple volume-based thresholds."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]