[
  {
    "information_requirement": "Is the adversary maintaining persistence using login items?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1547.015",
        "name": "Login Items",
        "evidence": [
          {
            "description": "A known malicious executable (by hash or name) or script is written to a login item location (Startup folder or Run/RunOnce registry keys).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Event ID 4688) that write files to startup folders (%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup, %ALLUSERSPROFILE%\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp). Cross-reference the hash of the written file against a CTI feed of known malicious file hashes. For registry modifications (Event ID 4657) to Run/RunOnce keys, cross-reference the executable name or path in the 'New Value' field against a list of known malware persistence executables from CTI. Alert on any confirmed matches."
          },
          {
            "description": "A process modifies a standard login item persistence location (Startup folder or Run/RunOnce registry keys) using common living-off-the-land binaries or scripting engines.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for process creations (Event ID 4688) of common scripting engines (`powershell.exe`, `cscript.exe`, `wscript.exe`, `mshta.exe`) or utilities (`reg.exe`) with command-line arguments that reference common persistence registry keys (`...\\CurrentVersion\\Run`, `RunOnce`) or startup folders. Also monitor for direct registry modifications (Event ID 4657) to these keys by unusual processes (i.e., not legitimate installers or system processes). Use correlation analysis to link these modification events to prior network download or file creation events."
          },
          {
            "description": "A process launched automatically at user login from a startup location initiates anomalous network activity or executes from an atypical path.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Event ID 4688) with parent processes like `explorer.exe` (or where the executable path is within a startup folder) with network connection logs (Zeek conn.log). Establish a baseline of normal network behavior for known startup processes. Use time series analysis and descriptive statistics to detect outliers in connection frequency, data volume, or destination rarity. Flag processes launching from unusual locations (e.g., %TEMP%, %APPDATA%\\Local) referenced by a login item. Calculate the entropy of destination domains or IPs for startup processes to find those with unusually high or low diversity."
          },
          {
            "description": "A file added to a login item location is unsigned, has low prevalence across the enterprise, or was recently created in a temporary or user-writable directory.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For any new executable path added to a Run/RunOnce key (Event ID 4657) or file written to a Startup folder (identified via Event ID 4688), analyze the executable's properties. Check its digital signature status. Determine the file's creation timestamp and path; executables recently compiled or created in temporary directories (e.g., %TEMP%, %PUBLIC%) are highly suspicious. Use frequency analysis across the environment to identify executables with very low prevalence, indicating they are not standard enterprise software. Use linear regression to model and predict normal startup item characteristics, flagging significant deviations."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to escalate privileges using login items?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1547.015",
        "name": "Login Items",
        "evidence": [
          {
            "description": "A process launched from a login item location initiates network connections to known malicious C2 servers.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify processes launched at user logon from known startup locations (Registry Run keys, Startup folders) using Windows Event ID 4688. Correlate these process launches with network connection logs (Zeek conn.log) based on source host and timestamp. Inner join the destination IPs from these connections with a CTI feed of known malicious C2 servers. Any match indicates a potential compromise, possibly resulting from a privilege escalation that allowed the persistence item to be placed."
          },
          {
            "description": "A login item is created in a system-wide, shared location (e.g., All Users Startup folder) by a process running under a standard user context.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for write actions (via Event ID 4688, tracking command lines of processes like `cmd.exe`, `powershell.exe`, or `move.exe`) to system-wide startup locations like `%ALLUSERSPROFILE%\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp`. Correlate the write event with the user context (e.g., Logon ID from a related event) of the parent process. Alert if a process running as a standard, non-administrative user writes to a system-wide startup location, as this could be executed by an administrator upon their next login."
          },
          {
            "description": "A process running under a high-privilege account (e.g., Administrator, SYSTEM) at logon executes from an unexpected or user-writable directory path specified as a login item.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate user logon events (Event ID 4624, Logon Type 2) with subsequent process creation events (Event ID 4688). For processes launched under a high-privilege account (e.g., Administrator) shortly after logon, analyze the executable path. Flag processes that execute from non-standard, user-writable locations like `%APPDATA%`, `%TEMP%`, or `%PUBLIC%`. Use frequency analysis to establish a baseline of normal startup programs and paths for privileged accounts and alert on deviations. This detects cases where an adversary placed a login item for a privileged user to execute."
          },
          {
            "description": "A process launched from a login item executes with a higher integrity level than its parent logon process or spawns child processes with elevated integrity.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Event ID 4688) originating from login items. Compare the 'Integrity Level' of the created process with its parent process (e.g., `explorer.exe`, which typically runs at 'Medium'). Alert if a process launched from a startup location runs at 'High' or 'System' integrity. Furthermore, use correlation analysis to track if a medium-integrity startup process subsequently spawns a child process that successfully elevates to a higher integrity level, potentially indicating a UAC bypass or other privilege escalation technique was triggered by the persistent item."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]