[
  {
    "information_requirement": "Is the adversary using Launch Daemons for persistence?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1543.004",
        "name": "Launch Daemon",
        "evidence": [
          {
            "description": "A Launch Daemon plist file or its associated executable matches a known malicious hash or contains a known malicious file path from threat intelligence.",
            "data_sources": [
              "macOS File System Events",
              "File Hashes"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor file creation and modification events in `/Library/LaunchDaemons/`. Calculate the hash (e.g., SHA256) of any new or modified plist file and its corresponding executable specified in the `ProgramArguments` key. Compare these hashes and file paths against a threat intelligence feed of known-bad indicators for macOS malware. Alert on any match."
          },
          {
            "description": "A Launch Daemon plist file exhibits structural patterns associated with known malware families, such as obfuscated arguments or specific naming conventions.",
            "data_sources": [
              "macOS File System Content"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Periodically scan or monitor `/Library/LaunchDaemons/` plists. Use regular expressions and Yara rules to detect specific structural patterns inside the plist files, such as obfuscated `ProgramArguments` (e.g., base64 encoded commands), use of shell interpreters (`/bin/sh -c`) to launch secondary payloads, or specific key-value pairs and naming conventions (e.g., `com.apple.updates.plist`) known to be used by malware families. Maintain and update a library of these malicious patterns."
          },
          {
            "description": "A newly created Launch Daemon's process makes a network connection to a low-reputation, newly registered, or otherwise suspicious domain.",
            "data_sources": [
              "macOS File System Events",
              "macOS Process Creation Events",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate the creation of a new plist in `/Library/LaunchDaemons/` with subsequent process creation events having `launchd` as the parent. For these new daemon-launched processes, monitor their network activity using host-based sources and Zeek conn.log. Enrich destination IPs/domains with reputation and registration date information. Use correlation analysis to link the daemon creation to suspicious outbound connections, flagging daemons that connect to low-reputation IPs, newly registered domains (NRDs), or use non-standard ports for C2."
          },
          {
            "description": "Modification or hijacking of the executable file pointed to by a legitimate, pre-existing Launch Daemon plist.",
            "data_sources": [
              "macOS File System Events",
              "File Hashes"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create and maintain a baseline of legitimate executable paths and their corresponding file hashes as specified in the plists within `/Library/LaunchDaemons/`. Monitor these specific executable files for any modification events. Upon detection of a change, re-calculate the file hash and compare it to the known-good baseline. Any mismatch indicates potential hijacking and requires immediate investigation. Use linear regression to model normal file modification rates and detect anomalous spikes in activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary achieved privilege escalation via Launch Daemons?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1543.004",
        "name": "Launch Daemon",
        "evidence": [
          {
            "description": "A known privilege escalation tool or script is written to `/Library/LaunchDaemons/` as a plist or is configured as the executable for a Launch Daemon.",
            "data_sources": [
              "macOS File System Events",
              "macOS Process Creation Events"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor file creation in `/Library/LaunchDaemons/` and process creation events originating from `launchd`. Calculate file hashes of any new plists and their associated executables. Compare these hashes against a CTI database of known privilege escalation tools and malware components that use this technique for escalation. Alert on any matches."
          },
          {
            "description": "A user process executes `launchctl` with `sudo` to load a plist from a non-standard or user-writable directory into the root context.",
            "data_sources": [
              "macOS Process Creation Events",
              "macOS Unified Logging"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events for the execution of `launchctl` with the `load` subcommand. Analyze the process command line to identify `sudo launchctl load` patterns. Flag instances where the loaded plist file originates from a suspicious path (e.g., `/tmp/`, `/Users/Shared/`, or any other user home directory) rather than standard system or application directories. This pattern is a strong indicator of an attempt to load a custom daemon with root privileges."
          },
          {
            "description": "A file is created in the root-only directory `/Library/LaunchDaemons/` by a process running as a non-root user, indicating a permissions misconfiguration is being exploited.",
            "data_sources": [
              "macOS File System Events",
              "macOS Audit Logs"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor file creation events within the `/Library/LaunchDaemons/` directory. For each creation event, inspect the user context (UID/EUID) of the process that wrote the file. Alert on any instance where a file in this root-owned directory is created or modified by a process not running as root (UID 0). Use correlation analysis to trace the parent process hierarchy to identify the source of the unauthorized write, which indicates exploitation of a vulnerable process or misconfiguration."
          },
          {
            "description": "A process launched as root via a Launch Daemon adds a new administrative user, modifies an existing user's privileges, or disables security controls.",
            "data_sources": [
              "macOS Process Creation Events",
              "macOS Unified Logging",
              "macOS Audit Logs"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify all processes launched by `launchd` that are running as root (UID 0). Monitor these processes and their children for the execution of commands used for user management (`dscl`, `sysadminctl`), modification of `/etc/sudoers`, or disabling security tools (e.g., `systemextensionsctl uninstall`, `spctl --master-disable`). Correlate the daemon's launch with subsequent privilege modification events within a short time window. Use descriptive statistics to baseline normal administrative activity and flag deviations initiated by daemons as potential privilege escalation follow-on actions."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]