[
  {
    "information_requirement": "Is the adversary attempting to gain access to credentials using AS-REP Roasting?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1558.004",
        "name": "AS-REP Roasting",
        "evidence": [
          {
            "description": "A Kerberos AS-REQ for a user without pre-authentication is observed where the source IP address or client hostname matches an entry on a threat intelligence watchlist or an internal list of compromised systems.",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Security Monitoring Sensors (e.g., Zeek)",
            "action": "Symbolic Logic: Join Windows Event ID 4768 (where 'Pre-Authentication Type' is '0') and Zeek kerberos.log (where success='T' and preauth_required='F') with a threat intelligence feed of known malicious IP addresses and an internal watchlist of suspicious hosts. An exact match on the client IP ('Client Address' in 4768, 'id.orig_h' in kerberos.log) triggers a high-severity alert. Statistical Method: For all AS-REP Roasting attempts, calculate the historical rarity of the source IP's subnet and Autonomous System Number (ASN). An attempt originating from a subnet or ASN that accounts for less than the 1st percentile of legitimate traffic over the last 90 days should be flagged for review. Machine Learning: Train a logistic regression classifier on historical AS-REQ events using features like source IP reputation score, ASN rarity, time of day, and whether the target user is privileged. Use the model to score new events in real-time, alerting when the probability of maliciousness exceeds a predefined threshold (e.g., 0.85)."
          },
          {
            "description": "A process is created with a filename, command-line argument, or loaded module (DLL) that is strongly associated with known AS-REP Roasting tools (e.g., Rubeus, PowerView).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, User Workstations",
            "action": "Symbolic Logic: Create a detection rule that uses regular expressions to search process creation events (Windows Event ID 4688) for command lines matching known AS-REP Roasting tool usage, such as `Rubeus.exe asreproast` or PowerShell commands containing `Get-ADUser -Filter {DoesNotRequirePreAuth -eq $true}`. An exact match triggers an immediate alert. Statistical Method: Profile parent-child process relationships and calculate the entropy of command-line arguments for common reconnaissance tools like PowerShell. A PowerShell process that spawns from an unusual parent (e.g., a web server process) and has a command-line entropy score exceeding the 98th percentile of historical PowerShell commands should be flagged. Machine Learning: Use an anomaly detection model like an autoencoder trained on benign process creation events and their command-line arguments. Any new process event that results in a high reconstruction error from the autoencoder is flagged as anomalous and potentially malicious, warranting investigation."
          },
          {
            "description": "One or more Kerberos AS-REP messages are observed for user accounts configured with 'Do not require Kerberos preauthentication', indicated by a 'Pre-Authentication Type' of '0' in the ticket request.",
            "data_sources": [
              "Windows Event ID 4768"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory",
            "action": "Symbolic Logic: On Domain Controllers, filter Windows Event ID 4768 for events where 'Pre-Authentication Type' is '0'. Cross-reference the 'Account Name' with a maintained allow-list of service accounts authorized to have pre-authentication disabled. Any request for an account not on this list is a high-confidence indicator of malicious or misconfigured activity. Statistical Method: For each source host ('Client Address'), calculate the ratio of AS-REPs for pre-auth disabled accounts to total AS-REPs over a 1-hour window. Establish a baseline for this ratio across all hosts. A host whose ratio exceeds 3 standard deviations above the mean should be investigated. Machine Learning: Employ a time-series forecasting model (e.g., ARIMA) to predict the expected volume of AS-REPs for pre-auth disabled accounts for the entire organization per hour. If the observed count significantly exceeds the model's predicted upper confidence interval for a given hour, generate an alert for a potential widespread AS-REP Roasting attempt."
          },
          {
            "description": "A single client IP address generates a statistically significant volume of Kerberos AS-REQ messages for multiple distinct user accounts over a short period, particularly for accounts not requiring pre-authentication.",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Security Monitoring Sensors (e.g., Zeek)",
            "action": "Symbolic Logic: Create a rule that triggers if a single client IP address ('Client Address' in Event ID 4768) generates requests for more than 10 distinct user accounts ('Account Name') within a 5-minute window where the 'Pre-Authentication Type' is '0'. This indicates a targeted enumeration attempt. Statistical Method: Aggregate Windows Event ID 4768 events by 'Client Address' and count the number of distinct target 'Account Name's per source over a 10-minute sliding window. Calculate the 99th percentile for both the request count and distinct account count from a 30-day baseline. An alert is generated if a single source IP exceeds both thresholds simultaneously. Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from AS-REQ events over a 15-minute window. Features should include source IP, count of distinct target users, count of pre-auth disabled requests, and count of RC4 requests. The algorithm will group normal activity into large clusters. Any event or small group of events identified as noise (outliers) by DBSCAN represents anomalous activity indicative of a targeted AS-REP Roasting attack from a single source."
          },
          {
            "description": "A statistically significant increase in Kerberos AS-REP messages using the weak RC4-HMAC encryption cipher ('0x17') is observed, deviating from an established environmental baseline of stronger AES ciphers.",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Security Monitoring Sensors (e.g., Zeek)",
            "action": "Symbolic Logic: Create a high-severity alert for any Kerberos authentication event (Windows Event ID 4768 or Zeek kerberos.log) where the 'Ticket Encryption Type' is '0x17' (RC4-HMAC) AND the 'Pre-Authentication Type' is '0'. This combination is a hallmark of a classic AS-REP Roasting attack. Statistical Method: For each user account, establish a baseline profile of normally requested 'Ticket Encryption Types'. Alert if a user who historically uses only AES (0x11, 0x12) suddenly requests an RC4 ticket (0x17). Additionally, calculate the ratio of RC4 to AES requests across the entire environment per hour. An increase in this ratio exceeding the 95th percentile of its historical values indicates a potential attack. Machine Learning: Train a decision tree classifier to distinguish between legitimate and malicious AS-REQs. Use features such as 'Pre-Authentication Type', 'Ticket Encryption Type', time of day, source IP reputation, and whether the target account is privileged. A request classified as malicious, particularly one routed down a path involving RC4 encryption and no pre-authentication, should trigger an investigation."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]