[
  {
    "information_requirement": "Has the adversary collected credentials via chat messages?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1552.008",
        "name": "Chat Messages",
        "evidence": [
          {
            "description": "Execution of processes with file hashes or names matching known credential theft tools or infostealers that target chat applications.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) and cross-reference the process file hash (if available via Sysmon or EDR) and process name against a CTI feed of known malicious tools that scrape credentials from chat applications (e.g., Slack, Teams, Discord). Alert immediately on any confirmed hash or high-confidence name match."
          },
          {
            "description": "Use of scripting engines (e.g., PowerShell, Python) with command-line arguments indicating targeted search or extraction of chat log files for sensitive keywords.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for scripting engines (powershell.exe, python.exe, etc.). Analyze command-line arguments for patterns targeting common chat application data paths (e.g., %APPDATA%\\Slack, %APPDATA%\\Microsoft\\Teams) combined with commands like `Select-String`, `findstr`, or `grep` and a list of sensitive keywords such as 'password', 'secret', 'token', 'key', 'credential', 'aws_access'. Use regular expressions to detect this pattern of activity."
          },
          {
            "description": "Access to local chat application data files or directories by unusual processes not associated with the legitimate application.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable SACLs (System Access Control Lists) to log read access (`Object Access: Handle Requested`) on common chat application data directories (e.g., %APPDATA%\\Slack, %APPDATA%\\Microsoft Teams, Jira/Trello local data stores). Monitor Windows Event ID 4663 for access attempts on these directories/files by processes other than the legitimate chat application executable or known benign system processes. Use frequency analysis on the accessing process name to identify rare or unauthorized processes accessing sensitive chat data."
          },
          {
            "description": "Anomalous network activity involving chat services, such as unusually large data transfers, high-frequency API calls, or connections to unknown chat-related domains, indicating data harvesting or exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal network traffic to and from approved chat services (e.g., api.slack.com, graph.microsoft.com) for each host or user group. Monitor for significant deviations using statistical methods. Flag hosts exhibiting unusually large data transfer volumes (using IQR on Zeek conn.log bytes transferred), high frequency or bursts of API requests (using time series analysis on Zeek http.log request counts), or connections to chat-related domains not on an approved list (by analyzing SNI values in Zeek ssl.log). Correlate these network anomalies with internal host events to identify the source process."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]