[
  {
    "information_requirement": "Is the adversary evading defenses using stolen web session cookies?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1550.004",
        "name": "Web Session Cookie",
        "evidence": [
          {
            "description": "Web session activity to external services originating from an IP address known to be associated with malicious actors, C2 infrastructure, or anonymizing proxies (e.g., TOR).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses from Zeek conn.log and http.log for authenticated web sessions against a high-confidence cyber threat intelligence (CTI) feed of malicious IPs, known C2 servers, and anonymizing proxy exit nodes. Alert on any session activity from a valid user account originating from a matched IP, as this indicates a high probability of a stolen cookie being used from an adversary-controlled system."
          },
          {
            "description": "Execution of known cookie-stealing tools or suspicious command-line patterns targeting browser cookie databases (e.g., SQLite files).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events. Maintain and apply a list of known process names or hashes of cookie-stealing malware. Use regular expressions to detect command-line patterns where tools like `powershell.exe`, `esentutl.exe`, or `sqlite3.exe` are used to copy, read, or export data from known browser cookie store locations (e.g., paths containing `User Data\\Default\\Network\\Cookies` or `cookies.sqlite`). Flagging these patterns provides early-stage detection of the theft itself."
          },
          {
            "description": "A user's web session exhibiting anomalous characteristics, such as 'impossible travel', a sudden change in User-Agent string mid-session, or session continuation after the legitimate user's device is known to be offline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each user session, track and baseline the source IP/geolocation and User-Agent string. Use correlation analysis to detect if the same session cookie (if visible or inferred) is used from geographically disparate locations simultaneously ('impossible travel'). Flag sessions where the User-Agent string changes mid-session to a value inconsistent with the initial one. Correlate web session activity from Zeek logs with endpoint asset management data to identify sessions that continue after the source endpoint is known to be powered off or disconnected from the network."
          },
          {
            "description": "A suspicious sequence of activity where an endpoint process accesses browser cookie files, immediately followed by new network connections from that endpoint to external services.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlated alert for a sequence of events. First, detect suspicious access to browser cookie stores using Windows Event ID 4688 (as described in the Pattern detection). Second, within a short time window (e.g., 1-5 minutes), observe new outbound connections in Zeek conn.log/http.log from that same endpoint to destinations not typically accessed by the user or application. Use correlation analysis based on timestamp and source IP to link these events, indicating potential theft and immediate use of a cookie."
          },
          {
            "description": "Successful authenticated access to a web application from a new source IP or device without a preceding authentication ceremony (e.g., login page interaction, SAML redirect, MFA prompt).",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile the normal authentication workflow for critical applications by identifying key URLs (e.g., `/login`, `/mfa`, IdP domains). Monitor Zeek http.log for sessions that begin accessing internal application pages (e.g., `/dashboard`, `/settings`) from a new source IP or User-Agent combination without having first visited the expected authentication workflow URLs. Calculate the entropy of entry-point URLs for users; a high-entropy value might indicate bypassing normal login flows via a stolen cookie."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary moving laterally using stolen web session cookies?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1550.004",
        "name": "Web Session Cookie",
        "evidence": [
          {
            "description": "An internal host, identified as a suspicious pivot point (e.g., via prior alerts), uses a web session to access other internal web services.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a dynamic list of internal IP addresses associated with suspicious activity (e.g., hosts with confirmed C2 callbacks, malware execution alerts, or anomalous logins). Correlate this list of 'suspicious hosts' with Zeek conn.log/http.log to identify when these hosts initiate connections to other internal-only web applications. Alert on any such connection, as it may represent an adversary using a stolen cookie from the pivot machine to move laterally to another internal service."
          },
          {
            "description": "A non-browser process on an endpoint (e.g., PowerShell, curl, rundll32.exe) initiates an HTTP request containing a session cookie to an internal web service.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network and host data. From Zeek http.log, identify requests to internal web services containing session cookies. Correlate the source IP and port of the request with process creation logs (Windows Event ID 4688) on the source host. Alert when the process image path of the parent process initiating the request is not a legitimate web browser (e.g., `chrome.exe`, `firefox.exe`, `msedge.exe`). This pattern is highly indicative of programmatic lateral movement using stolen session cookies."
          },
          {
            "description": "A single user's web session is simultaneously active from multiple distinct internal endpoints (e.g., a user's workstation and a server), especially if the access patterns are different.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Infer user sessions from web traffic (e.g., by session cookie value if unencrypted, or by correlating login events with subsequent traffic). Track the source IP addresses associated with each active session. Use descriptive statistics to alert when a single user session shows concurrent or rapidly alternating activity from more than one internal IP address within a session's lifetime. Investigate immediately if one of the sources is a server or another user's workstation, which is highly anomalous for typical user activity."
          },
          {
            "description": "An authenticated web session to an internal service originates from a source system where the associated user has no recent interactive or remote logon history.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For every authenticated request to an internal web service identified in Zeek http.log, extract the user identity (if possible) and the source IP. Query authentication logs (Windows Event ID 4624 for Logon Types 2, 3, and 10) on the source machine to verify if the specified user has a legitimate, recent logon session on that host. An authenticated web request from a host where the user isn't actively logged in is a strong indicator of a stolen cookie being used from a compromised pivot machine for lateral movement."
          },
          {
            "description": "A user's authenticated session to an internal administrative tool (e.g., vCenter, Kubernetes Dashboard, network device web UI) exhibits behavior inconsistent with the user's known technical skills, role, or peer group activity.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For high-consequence internal web applications, baseline the typical behavior of legitimate users by analyzing historical Zeek http.log data (e.g., pages visited, API endpoints called, actions performed). Monitor for authenticated sessions where the activity deviates significantly from the user's established baseline. Use frequency analysis or percentile ranking to identify when a user performs an action that is extremely rare for them or their peer group (e.g., a non-administrator exporting a virtual machine or creating a snapshot in vCenter). This behavioral shift can indicate an adversary using a legitimate session for lateral movement or privilege escalation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]