[
  {
    "information_requirement": "Has the adversary stolen or forged Kerberos tickets?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1558",
        "name": "Steal or Forge Kerberos Tickets",
        "evidence": [
          {
            "description": "Execution of processes with file hashes matching known credential dumping tools or detection of specific malicious command-line arguments used for Kerberos ticket manipulation.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor Windows Event ID 4688 (Process Creation) logs. Match the file hash of the 'New Process Name' against a threat intelligence feed of known malicious hashes for tools like Mimikatz, Rubeus, and Kekeo. Separately, use regular expression matching to scan the 'Command Line' field for highly specific, high-confidence strings and parameter patterns indicative of Kerberos attacks (e.g., 'kerberos::golden', 'asktgt', 'asktgs', 'rubeus.exe kerberoast'). Alert on any matches."
          },
          {
            "description": "A user account requesting an abnormally high number of Kerberos service tickets (TGS-REQ) for various Service Principal Names (SPNs), especially using weak RC4-HMAC encryption.",
            "data_sources": [
              "Windows Event ID 4769",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On Domain Controllers, analyze Windows Event ID 4769 for events where 'Ticket Encryption Type' is '0x17' (RC4-HMAC). From network data, filter 'zeek kerberos.log' for TGS-REQ messages where the 'etype' field contains 'rc4-hmac'. Aggregate these requests by the requesting 'Account Name'/'client' over a short time window (e.g., 1 hour). Use descriptive statistics and percentile analysis to identify accounts requesting an unusually high number of unique SPNs compared to their own baseline or peers. A sudden spike in such requests from a single account is a strong indicator of Kerberoasting."
          },
          {
            "description": "Kerberos TGT requests (AS-REQ) are successfully fulfilled for user accounts where Kerberos pre-authentication is disabled, indicating potential AS-REP Roasting.",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On Domain Controllers, monitor for successful Windows Event ID 4768 ('A Kerberos authentication ticket (TGT) was requested') events where the 'Pre-Authentication Type' field is '0'. Correlate these events with user accounts known to have 'Do not require Kerberos preauthentication' enabled. From network data, analyze 'zeek kerberos.log' for AS-REQ messages that lack the 'PA-ENC-TIMESTAMP' field in the 'pa_data' record, which also indicates pre-authentication was not used. Alert on successful TGT issuance for these accounts and investigate the necessity of the setting."
          },
          {
            "description": "Anomalous Kerberos ticket validation and usage, such as a logon event where account privileges (SIDs) are inconsistent with the user's known permissions, or a service ticket is used without a recent corresponding authentication ticket.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4769",
              "Windows Event ID 4768"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "To detect Golden Tickets, analyze Windows Event ID 4624 (Logon) events. For each logon, compare the SIDs listed in the event's token information against the user account's actual group memberships in Active Directory. Alert on any logon where a low-privilege account presents high-privilege SIDs (e.g., Enterprise Admins, Domain Admins). To detect Silver Tickets, monitor Windows Event ID 4769 (TGS Requested) on application servers and correlate with TGT issuance logs (Event ID 4768) from Domain Controllers. Flag TGS requests from accounts that do not have a corresponding recent TGT request on record, as this may indicate a forged ticket."
          },
          {
            "description": "Anomalous process memory access where a non-system process or script engine attempts to read from the LSASS process, indicative of attempts to steal in-memory Kerberos tickets.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5058",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for process access events where the target process is 'lsass.exe' (e.g., Sysmon Event ID 10). Create a baseline of legitimate processes that normally access LSASS (e.g., svchost.exe, specific security agents). Alert on any access from an unapproved or unexpected source process, such as 'powershell.exe', 'rundll32.exe', 'cmd.exe', or any unsigned/unrecognized binary. Also, monitor Windows Event ID 5058 ('Key file operation') for credential read operations and correlate with the initiating process from Event ID 4688. Use correlation analysis to link the LSASS access event with preceding command-line activity to identify the attack vector."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]