[
  {
    "information_requirement": "Is the adversary establishing persistence by modifying MFA configurations?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.006",
        "name": "Multi-Factor Authentication",
        "evidence": [
          {
            "description": "Network connections from internal endpoints to known malicious domains or IP addresses associated with MFA phishing or token theft infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate Zeek DNS query logs and connection logs against a continuously updated cyber threat intelligence (CTI) feed of domains and IP addresses known to host MFA phishing pages or act as proxies for Adversary-in-the-Middle (AiTM) attacks. Alert on any matches from corporate endpoints."
          },
          {
            "description": "Creation of specific scheduled tasks or modification of registry keys known to be used by malware to periodically disable or reconfigure MFA settings.",
            "data_sources": [
              "Windows Event ID 4698",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for the creation of new scheduled tasks (Windows Event ID 4698) or modification of specific registry values (Windows Event ID 4657) that match patterns used by known malware to achieve persistence by tampering with security settings. Maintain and use a list of known malicious task names, commands, or registry paths associated with MFA tampering tools. Correlate creation with the parent process ID to identify the originating script or binary."
          },
          {
            "description": "Direct modification of Active Directory group memberships or user attributes that effectively remove an account from MFA enforcement policies, especially for privileged accounts.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4729",
              "Windows Event ID 4733",
              "Windows Event ID 4757"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event IDs for user object changes (4738) and removals from security groups (4729, 4733, 4757). Correlate these events with a list of AD groups that are used to enforce MFA via conditional access or identity provider policies. Flag any removal of a privileged account from an MFA-enforced group and investigate the administrator and source host that performed the action. Use frequency analysis to detect accounts making an unusual number of such changes."
          },
          {
            "description": "Registration of a new MFA device or method for a user account, followed by immediate, anomalous login activity from a new source.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Alert on any modification to user account attributes indicative of MFA registration or change (Windows Event ID 4738). Correlate this event with subsequent successful login activity (Windows Event ID 4624) for that user. Flag instances where a new MFA method is registered from one IP/location and is immediately followed by a successful login from a new and geographically distant location. Use correlation analysis based on username and timestamps to link the events."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by bypassing or tampering with MFA?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense-Evasion",
    "indicators": [
      {
        "technique_id": "T1556.006",
        "name": "Multi-Factor Authentication",
        "evidence": [
          {
            "description": "Execution of processes whose file hashes match known MFA bypass or security tampering tools.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each new process creation event (Windows Event ID 4688), extract the file hash of the executable (requires appropriate audit policy/tooling). Compare this hash against a continuously updated list of known malicious file hashes associated with MFA bypass, token theft, or security tampering tools. Generate a high-priority alert on any match."
          },
          {
            "description": "Use of specific command-line parameters or scripts (e.g., PowerShell) known to interact with or modify Active Directory Federation Services (ADFS) or other authentication provider configurations to weaken MFA.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688), specifically inspecting command-line arguments. Use regular expressions to search for patterns targeting MFA configurations, such as PowerShell cmdlets ('Set-AdfsRelyingPartyTrust', 'Set-MsolUser'), that disable MFA requirements or add unauthorized trusted devices/IPs. Alert on execution by non-standard administrative accounts or from unexpected hosts."
          },
          {
            "description": "A legitimate process associated with authentication (e.g., lsass.exe) making unexpected outbound network connections.",
            "data_sources": [
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal network connections made by critical authentication processes (e.g., lsass.exe, ADFS service). Monitor Windows Event ID 5156 (Filtering Platform Connection) and correlate with Zeek conn.log to detect any new or anomalous outbound connections from these specific processes to external IP addresses. Use frequency analysis on destination IPs and ports to spot outliers. Such connections are highly suspicious and could indicate successful compromise and exfiltration of credentials or tokens."
          },
          {
            "description": "Anomalous process access to files, registry keys, or memory of legitimate MFA provider processes (e.g., Duo, Okta agents) by non-standard processes.",
            "data_sources": [
              "Windows Event ID 4656",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable object access auditing on directories and registry keys for installed MFA agents. Monitor Windows Event IDs 4656 (handle requested) and 4663 (access attempt) for these sensitive resources. Profile legitimate processes that access these resources (e.g., the agent's own executables, system processes). Alert on access attempts from any process not on the established baseline, such as 'powershell.exe' or an unrecognized executable, which may indicate tampering."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary accessing credentials by exploiting bypassed or weakened MFA?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential-Access",
    "indicators": [
      {
        "technique_id": "T1556.006",
        "name": "Multi-Factor Authentication",
        "evidence": [
          {
            "description": "A successful login from an IP address known to be part of an Adversary-in-the-Middle (AiTM) phishing infrastructure, which captures both credentials and session tokens.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate the source IP address of successful remote logins (Windows Event ID 4624, Logon Type 3 or 10) against a high-confidence CTI feed of IPs associated with AiTM phishing toolkits (e.g., evilginx2, Muraena, Caffeina). An immediate, high-priority alert should be generated for any successful login from such an IP, as it indicates a successful session token theft."
          },
          {
            "description": "A rapid sequence of failed logins for a single account from a single source, immediately followed by a successful login, indicating a potential MFA fatigue attack.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for a high frequency of failed logins (Windows Event ID 4625) for a single user account from a single source IP within a short timeframe (e.g., >10 failures in 2 minutes), immediately followed by a successful login (Windows Event ID 4624) from the same IP. This specific sequence is a pattern for MFA prompt bombing, where an adversary spams prompts until the user mistakenly approves one."
          },
          {
            "description": "Successful interactive or remote login (Logon Type 10 or 3) for a privileged account from a non-standard administrative host or an unusual geolocation where such access has not historically occurred.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze successful logins (Windows Event ID 4624) for privileged accounts. Establish a baseline of typical source hostnames, IP subnets, and geolocations for each privileged account or group. Use descriptive statistics and frequency analysis to flag any successful login that is a statistical outlier, such as a domain admin logging in via RDP from a workstation in a different country for the first time. This behavioral anomaly can indicate a compromised session token is being used."
          },
          {
            "description": "Anomalous data access or transfer activity immediately following a successful login that is suspected of bypassing MFA or resulting from session theft.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate a suspicious successful login (as identified by other evidence) with subsequent network traffic. Monitor Zeek conn.log for unusually large data transfers, connections to known file-sharing sites, or access to an abnormally high number of internal servers from the source host of the session. Use time series analysis to detect spikes in data transfer volume immediately following the login event, and use correlation analysis to link the login to the traffic spike, indicating post-access objectives are being pursued."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]