[
  {
    "information_requirement": "Has the adversary accessed cloud instance metadata for credentials?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1552.005",
        "name": "Cloud Instance Metadata API",
        "evidence": [
          {
            "description": "A network connection from a known malicious IP address to a public-facing application is immediately followed, within a 5-second window, by a connection from that same application server to the Instance Metadata API endpoint (169.254.169.254).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web application servers and their network traffic logs",
            "action": "Symbolic: Join external-facing web traffic (Zeek http.log) against a high-confidence threat intelligence feed of malicious IPs. For any match, search for a subsequent internal connection (Zeek conn.log) from the targeted server to destination IP '169.254.169.254' within 5 seconds. Statistical: For each public-facing server, baseline the rate of connections to '169.254.169.254'. Monitor for spikes in this rate greater than 3 standard deviations above the moving average that occur within minutes of receiving traffic from a source IP with a low reputation score. ML: Use a time-series anomaly detection model (e.g., ARIMA) on the volume of requests from web servers to the metadata API. Train a separate classifier (e.g., Random Forest) on features from preceding external requests (e.g., user agent, headers, URI parameters) to predict which metadata API access events are most likely malicious."
          },
          {
            "description": "A process is created (Windows Event ID 4688) on a cloud instance with a command line containing both a network utility (e.g., curl, wget, Invoke-WebRequest) and the IP address '169.254.169.254'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud compute instances (VMs, containers) and CI/CD pipeline runners",
            "action": "Symbolic: Create a detection rule that searches Windows Event ID 4688 process creation logs for command lines matching the regular expression: '(?i)(curl|wget|powershell|pwsh|python|Invoke-WebRequest|iwr).*(169\\.254\\.169\\.254)'. Statistical: For each host, establish a baseline of processes that legitimately access the network. Flag any process execution involving '169.254.169.254' where the process name is in the bottom 5th percentile of historical prevalence on that host or host group. ML: Train a classification model (e.g., Logistic Regression) on command-line arguments, using features like argument count, presence of IP addresses, and known utility names to classify each process creation event involving a network connection as 'benign' or 'suspicious metadata access'."
          },
          {
            "description": "A network connection to '169.254.169.254' originates from a process name or user account that is not on an established allowlist for metadata API access for that specific instance role or type.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud compute instances (VMs, containers), Authentication and identity management servers",
            "action": "Symbolic: Maintain an allowlist of process names and user accounts authorized to access '169.254.169.254' for each server role. Ingest Windows Event ID 5156 (Network Connection) and alert whenever a connection to '169.254.169.254' is made by a process or user not on the allowlist. Statistical: For each instance, profile the set of processes that connect to the metadata API. Use Jaccard similarity to compare the set of connecting processes in a given hour to the historical baseline set. A similarity score below a threshold (e.g., < 0.5) indicates significant deviation. ML: Use unsupervised clustering (e.g., DBSCAN) on features of processes connecting to the metadata API (e.g., process name, parent process, user context). Label the largest cluster(s) as 'normal' and treat any process falling into smaller clusters or classified as noise as an anomalous outlier."
          },
          {
            "description": "An instance's interaction with the metadata API (169.254.169.254) deviates from its established baseline, exhibiting a high rate of 404 errors, a high entropy score for requested URIs, or access to an unusually high number of unique URI paths within a 1-minute window.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud instance virtual network interfaces (VNICs), Network traffic inspection points",
            "action": "Symbolic: Monitor Zeek http.log for requests to '169.254.169.254' and alert on the use of any HTTP method other than GET. Also alert if the HTTP response status code is 404 and is immediately followed by another request with a slightly different path. Statistical: For each source IP, establish a 30-day rolling baseline of the number of unique URI paths accessed per hour and the Shannon entropy of the set of accessed URIs. Alert if the number of unique paths exceeds the 99th percentile of the baseline or if the entropy score increases by more than 2 standard deviations. ML: Use time-series forecasting to predict the expected volume of requests from each instance to the metadata API. An actual volume that significantly exceeds the predicted volume's confidence interval can indicate a reconnaissance script."
          },
          {
            "description": "An instance accesses the IAM credential endpoint of the metadata API ('/iam/security-credentials/'), followed within 5 minutes by a new outbound connection from that same instance to a cloud provider API endpoint (e.g., s3.amazonaws.com, management.azure.com).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud compute instances (VMs, containers), Egress network gateways, DNS resolvers",
            "action": "Symbolic: Filter Zeek http.log for requests to '169.254.169.254' where the URI contains '/iam/security-credentials/'. Search Zeek conn.log and dns.log for any new outbound connection or DNS query for a cloud API endpoint (e.g., '*.amazonaws.com') from that same source IP within 5 minutes. Statistical: Establish a baseline of which cloud API endpoints each instance role typically communicates with. After an instance accesses the metadata credentials path, monitor its subsequent outbound connections. If it connects to a cloud API endpoint that is not in its historical baseline, assign it a high risk score. ML: Develop a state transition model for instance behavior. Train the model on benign traffic to learn normal state transitions (e.g., 'Accessing Metadata' -> 'Accessing S3'). An observed transition from 'Accessing Metadata Credentials' to a rare or forbidden state, like 'Creating New IAM User via API', would be flagged as a high-confidence anomaly."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]