[
  {
    "information_requirement": "Is the adversary maintaining persistence by manipulating conditional access policies?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "Successful authentication from an external IP address known to be malicious or part of an adversary's infrastructure, which should have been blocked by risk-based policies.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate source IP addresses from successful external login events (Windows Event ID 4624, Zeek conn.log) against a high-confidence CTI feed of known malicious IPs (e.g., C2 servers, anonymizer services) updated within the last hour. A successful login from a known bad IP indicates a policy failure or a specific permissive rule added for persistence. Alert on any match."
          },
          {
            "description": "A pattern of sustained, successful login activity from a previously unseen corporate VPN provider, autonomous system (AS), or broad IP address range, suggesting the addition of a new, overly-permissive 'trusted location'.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile successful external logins (Windows Event ID 4624) by source IP, enriching with ASN and geographic data. Establish a baseline of legitimate source ASNs and IP ranges. Use frequency analysis and time series modeling to detect a new source ASN or /24 range that suddenly appears and maintains a consistent level of successful login activity over several hours or days. Correlate this new range with activity for specific, potentially compromised, user accounts."
          },
          {
            "description": "A statistically significant decrease in multi-factor authentication (MFA) challenges for users or groups that historically required it, indicating a policy modification to weaken authentication controls for persistence.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Assuming MFA success is logged or can be inferred (e.g., by correlating with RADIUS/MFA server logs), establish a baseline ratio of MFA-enforced logins to total successful logins (Windows Event ID 4624) per user group or location. Use time series analysis to monitor this ratio. A sharp, sustained drop in the MFA ratio indicates a policy change. This is a behavioral anomaly in the aggregate security posture."
          },
          {
            "description": "Successful logins from devices that are unmanaged or non-compliant, particularly if logins from such devices were previously blocked or resulted in failed login events for the same user accounts.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze User-Agent strings in Zeek http.log for web-based access or device information in authentication logs. Correlate historical failed logins (Event ID 4625) with recent successful logins (Event ID 4624) for the same user. Identify instances where a device/User-Agent that was previously denied access is now successful, indicating a change in device compliance policy. Use frequency analysis to spot new, outlier User-Agents successfully authenticating."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by manipulating conditional access policies?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense-Evasion",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "Successful authentication from an IP address, IP range, or country that is explicitly defined on a deny list within the organization's security policy.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain an explicit deny list of IP addresses, CIDR ranges, and countries based on organizational policy. Continuously check the source IP of all successful external authentications (Windows Event ID 4624, Zeek conn.log) against this deny list. A match represents a direct policy violation and a high-fidelity indicator of misconfiguration or malicious evasion."
          },
          {
            "description": "A pattern of successful logins originating from common public cloud provider IP ranges (e.g., Azure, AWS, GCP) that are not associated with legitimate corporate services, used to bypass geo-fencing or IP reputation blocks.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Classify source IPs of successful external logins (Windows Event ID 4624) against known public cloud provider IP ranges. Establish a baseline of sanctioned corporate cloud services. Flag successful logins originating from non-sanctioned cloud IP ranges, especially if they target a diverse set of user accounts or are followed by anomalous internal network activity. This pattern suggests an adversary is leveraging trusted cloud infrastructure to evade simple network-based controls."
          },
          {
            "description": "A successful login for a user account that exhibits an 'impossible travel' scenario, indicating that location-based controls or concurrent session limits have been disabled or bypassed.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each successful login (Windows Event ID 4624), cache the user, timestamp, and geolocated source IP. Upon the next login for the same user, calculate the time difference and distance between the two locations. If the required travel speed exceeds a plausible threshold (e.g., 1000 km/h), flag it as an 'impossible travel' event. A successful impossible travel login is a strong behavioral indicator that geo-location policies are not being enforced correctly."
          },
          {
            "description": "A sudden and statistically significant volume of successful logins from a geographic location or autonomous system (AS) that historically had zero or near-zero successful authentications.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of successful login counts per source country and ASN using historical data from Windows Event ID 4624 and Zeek conn.log. Use descriptive statistics (frequency counts) and time series analysis to detect significant deviations. Alert on any successful logins from countries or ASNs that are on a high-risk list or have a historical login frequency below a defined threshold (e.g., less than 0.01% of total logins). An abrupt appearance of traffic from a new region indicates a potential policy change."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary facilitating credential access utilization by manipulating conditional access policies?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential-Access",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "Successful authentication using credentials known to be compromised (e.g., from a breach list or phishing campaign) where conditional access policies should have blocked the attempt.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a high-risk list of user accounts with known or suspected compromised credentials. Continuously monitor and cross-reference this list against all successful external login events (Windows Event ID 4624). A successful login for any account on this watchlist, especially if it occurs from an unfamiliar location or without an MFA challenge, is a critical alert indicating a policy failure enabling credential abuse."
          },
          {
            "description": "A pattern of successful external logins using legacy authentication protocols (e.g., POP, IMAP, SMTP AUTH) that do not support modern controls like MFA, especially for accounts that typically use modern authentication.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek conn.log for traffic on ports associated with legacy authentication protocols (e.g., 110, 143, 25, 587) originating from external IPs. Correlate with successful Windows Event ID 4624 logins on relevant servers. Profile users by their typical authentication protocol. Flag any user who successfully authenticates externally via a legacy protocol if their baseline is modern authentication (e.g., Kerberos, SAML). A sudden organization-wide increase in successful legacy authentications is a strong pattern indicating a policy change has opened a weak access vector."
          },
          {
            "description": "An anomalous pattern of successful logins across multiple user accounts originating from a single external IP address or subnet, indicating successful credential stuffing where MFA was likely disabled.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate successful external logins (Windows Event ID 4624) by source IP address over a defined time window (e.g., 1 hour). Use descriptive statistics to find source IPs that successfully authenticate to an unusually high number of distinct user accounts. Establish a baseline for legitimate gateways (e.g., VPN concentrators) and alert on outliers. A box-plot of successful unique account counts per source IP can reveal IPs used for successful credential stuffing or password spraying attacks, which are made easier by disabled MFA."
          },
          {
            "description": "A sudden and persistent shift in the established login behavior for a user account (e.g., new location, time, device) immediately following a series of failed login attempts, suggesting credential acquisition followed by policy manipulation to enable its use.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Use correlation analysis to link a sequence of failed logins (Event ID 4625) for a single user with a subsequent successful login (Event ID 4624) for the same user. Flag sequences where the successful login exhibits characteristics drastically different from the user's established baseline (e.g., successful login from a new country after 10 failed attempts from a typical location). This behavioral sequence suggests the adversary obtained credentials and then bypassed a policy (like location or MFA) to use them."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]