[
  {
    "information_requirement": "Is the adversary forging Kerberos service tickets (Silver Tickets)?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1558.002",
        "name": "Silver Ticket",
        "evidence": [
          {
            "description": "Kerberos network logon using a weak or deprecated encryption type (e.g., RC4_HMAC_MD5) that is not aligned with domain policy.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4624 on all service servers. Filter for logons where the 'Authentication Package' is 'Kerberos'. Extract the 'Ticket Encryption Type' field from the event data. If domain policy enforces AES ('0x11', '0x12'), alert on any logon using a legacy type like RC4_HMAC_MD5 ('0x17'), as this is a common artifact of ticket forgery tools."
          },
          {
            "description": "Execution of command-line arguments consistent with Silver Ticket creation or injection tools like Mimikatz or Rubeus.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation logs (Windows Event ID 4688) with command-line auditing enabled. Create a watchlist of regular expressions to detect patterns associated with ticket manipulation tools. Alert on command lines containing keywords such as `kerberos::golden`, `/ticket`, `asktgs`, `ssp`, `ptt`, `Rubeus.exe silver`, or specific argument combinations used for forging or injecting tickets. Correlate these process events with subsequent anomalous network logons (Event ID 4624) from the source host."
          },
          {
            "description": "An unauthorized or unusual process accesses the memory of the LSASS process on a server, a common precursor to extracting service account credentials required for Silver Tickets.",
            "data_sources": [
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable object access auditing for the LSASS process. Monitor Windows Event ID 4656 for handle requests to `lsass.exe`. Filter for access rights associated with reading process memory (e.g., `0x1010` or `0x1410` which includes PROCESS_VM_READ). Maintain a baseline of legitimate processes that access LSASS (e.g., specific EDR tools, system processes) and alert on any deviation or access from non-whitelisted processes like `powershell.exe`, `rundll32.exe`, or unsigned binaries. Use frequency analysis to identify hosts with an unusual rate of LSASS access events."
          },
          {
            "description": "Successful Kerberos network logon to a service server (Event ID 4624) that lacks a corresponding Kerberos service ticket request (Event ID 4769) on a Key Distribution Center (KDC).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4769"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Collect Windows Event ID 4624 (Logon Type 3, Authentication Package: Kerberos) from critical service servers and Windows Event ID 4769 from all KDCs. For each 4624 event, attempt to correlate it with a 4769 event for the same 'Account Name' and 'Service Name' (SPN) that occurred within a plausible preceding time window (e.g., 8 hours, based on ticket lifetime). Logons without a corresponding TGS request are highly suspicious. Use correlation analysis to identify the rate of these 'unlinked logons' and flag servers or client hosts that exhibit a statistically significant number of them."
          },
          {
            "description": "A user or service account performs a network logon to a service from an anomalous source workstation or at an atypical time, deviating from established behavioral baselines.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For all Kerberos network logons (Windows Event ID 4624), build and maintain a dynamic baseline of normal access patterns, creating a state model of [Account Name -> Service Name -> Source Host]. Use descriptive statistics and frequency analysis on historical data. Continuously monitor for and alert on high-risk deviations, such as: 1) An account accessing a service from a new source host for the first time. 2) An account accessing a new service for the first time. 3) Any service logon occurring outside of baselined time-of-day/day-of-week windows. Use time series analysis or Inter-Quartile Range (IQR) methods to detect these temporal anomalies."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]