[
  {
    "information_requirement": "Has the adversary accessed credentials via Windows Credential Manager?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1555.004",
        "name": "Windows Credential Manager",
        "evidence": [
          {
            "description": "Execution of a process with a file hash known to be associated with credential dumping tools that target the Windows Credential Manager.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor all process creation events (Windows Event ID 4688) and calculate or retrieve the hash of the executable file. Correlate these hashes against a continuously updated threat intelligence feed of known malicious file hashes for tools like Mimikatz, LaZagne, and other credential dumpers. Alert on any match and prioritize the host for immediate incident response."
          },
          {
            "description": "Execution of vaultcmd.exe with command-line arguments used to list, enumerate, or access stored credentials, especially from an unusual parent process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creations where the process name is 'vaultcmd.exe'. Analyze the command-line for arguments like '/list', '/listcreds', '/listschema', or '/listproperties'. Flag any execution, as legitimate use is rare. Critically analyze the parent process; execution by non-interactive shells (powershell.exe, cmd.exe) spawned from unusual parents (e.g., Office applications, wscript.exe) is highly suspicious. Use frequency analysis to baseline and detect anomalous execution per host/user."
          },
          {
            "description": "An unusual process, such as a non-system or non-user-interactive process, accessing Windows Credential Locker files (.vcrd, .vpol).",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable and monitor Windows Event ID 4663 (Object Access auditing required) for read attempts ('Accesses: ReadData') on files in vault directories (e.g., '%Systemdrive%\\Users\\*\\AppData\\Local\\Microsoft\\Vault\\*\\*.vcrd', '%Systemdrive%\\Users\\*\\AppData\\Local\\Microsoft\\Vault\\Policy.vpol'). Establish a baseline of normal processes that access these files (e.g., lsass.exe, explorer.exe). Alert on any access from processes not on the allowlist, especially command-line interpreters, scripting engines, or any unrecognized executable name. Use correlation analysis to link this file access to other suspicious host events."
          },
          {
            "description": "A chain of events where a process known to access Windows Credential Manager is executed, followed by an anomalous outbound network connection from the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a chained alert by correlating host-based credential access indicators (Windows Event ID 4688 for 'vaultcmd.exe' or 'rundll32.exe keymgr.dll'; Windows Event ID 4663 for vault file access) with subsequent outbound network connections from the same host within a short time window (e.g., 5 minutes) using Zeek conn.log. Establish a baseline of normal outbound traffic for hosts/users. Use statistical methods like regression or correlation analysis to find significant temporal relationships. Flag connections to rare domains/IPs, high-entropy domain names, or those using non-standard ports, especially if the data volume is anomalously large."
          },
          {
            "description": "Execution of a parent process, such as an Office application or script interpreter, spawning a child process that then attempts to access credentials from the Windows Credential Manager.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor parent-child process relationships using Windows Event ID 4688. Create a high-fidelity alert for behavioral chains where a common initial access or execution vector (e.g., winword.exe, excel.exe, powershell.exe, wscript.exe) is the parent of a process known to interact with the credential manager (e.g., vaultcmd.exe, rundll32.exe with keymgr.dll, or any process that subsequently accesses vault files). This behavior is a strong indicator of a malicious payload attempting to harvest credentials post-exploitation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]