[
  {
    "information_requirement": "Is the adversary maintaining persistence via modified network device authentication?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "Firmware or configuration file transfers to or from network devices involving files with known malicious hashes or originating from untrusted sources.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek files.log for file transfers using protocols like TFTP, FTP, SCP, or HTTP involving network device IPs. Calculate the MD5/SHA1 hash of transferred files and compare them against a cyber threat intelligence (CTI) feed of known malicious firmware, configuration files, or backdoor tools. Additionally, analyze Zeek conn.log to flag transfers originating from or destined to external or non-corporate IP addresses that are not authorized vendor or management sources. Alert on any match."
          },
          {
            "description": "A network device initiating outbound connections to a new or unapproved external authentication server (e.g., RADIUS, TACACS+).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek radius.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a baseline list of approved, legitimate authentication server IP addresses. Monitor Zeek conn.log for new outbound connections originating from network device IP addresses to external destinations on ports associated with RADIUS (1812/UDP, 1813/UDP) or TACACS+ (49/TCP). Correlate with Zeek radius.log for specific transaction details. Alert on any connection from a network device to an unauthorized authentication server, as this may indicate the device's authentication process has been reconfigured to point to an adversary-controlled server for persistence."
          },
          {
            "description": "Anomalous network device configuration changes, such as firmware updates or configuration backups, occurring outside of established maintenance windows or initiated from unauthorized sources.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log",
              "Zeek tftp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek logs (conn.log, ftp.log, tftp.log) for connections to or from network devices on ports and protocols used for image or configuration transfer (e.g., TFTP 69/UDP, SCP/SSH 22/TCP, HTTP/S 80/443). Use time series analysis to establish a baseline of normal activity and detect transfers occurring outside of scheduled maintenance windows. Use frequency analysis and correlation with an asset inventory to identify configuration changes initiated from source IPs not on the authorized network administrator list. Flag activity with high statistical deviation."
          },
          {
            "description": "Anomalous login patterns to network devices over an extended period, such as successful access from unusual geographic locations, at consistent off-hours, or via protocols that deviate from baseline administrative behavior.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each network device, establish a baseline of normal administrative access patterns including source IP subnets/geolocations, time-of-day/day-of-week, and protocols used (SSH, Telnet, HTTPS). Continuously monitor Zeek ssh.log, telnet.log, and conn.log for deviations. Use percentile analysis or IQR to flag logins from rare geolocations or source IPs. Apply time series analysis to identify persistent access patterns at unusual hours. Correlate findings to detect accounts showing multiple behavioral anomalies, indicating potential persistent access."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses through network device authentication modifications?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense-Evasion",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "Successful administrative access to a network device from a source IP address on a high-confidence threat intelligence feed, especially if that IP should be blocked by security policies.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate successful connections (from Zeek conn.log) or successful authentications (from Zeek ssh.log, telnet.log where auth_success=true) to network device administrative ports against a CTI feed of known malicious IPs. Prioritize alerts where the source IP is from a country where the organization does not operate or belongs to a range explicitly denied by network ACLs. A successful connection from such a source indicates a security control has failed or been bypassed."
          },
          {
            "description": "Use of non-standard client software versions or SSH libraries in administrative connections, matching those used by known network device exploitation frameworks.",
            "data_sources": [
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the `client` and `server` fields in Zeek's ssh.log for all administrative connections to network devices. Maintain and baseline a list of standard SSH client versions used by administrators and approved tools. Use frequency analysis to identify rare client strings and alert on connections using clients associated with known exploitation frameworks (e.g., Metasploit, specific Python libraries) or those that are highly unusual."
          },
          {
            "description": "Successful administrative connections to network devices that bypass established network controls, such as originating from a source IP that should be blocked by an ACL or not routing through a required bastion host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek logs for administrative connections (SSH, Telnet, HTTPS) to network devices. Compare the source IP of each connection against documented network ACLs and expected administrative traffic flows (e.g., all admin access must originate from a specific bastion host subnet). Use correlation analysis to automatically flag any successful connection that violates these defined policies, indicating a defense evasion."
          },
          {
            "description": "Unusual network traffic originating from a network device's own IP address immediately following an administrative session, suggesting the device itself is being used to launch further attacks or communicate with C2 servers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate successful administrative sessions on network devices (from Zeek ssh.log, telnet.log) with subsequent, new outbound connections originating from the network device's own IP address (observed in Zeek conn.log). Baseline the normal outbound traffic from network devices (e.g., NTP, SNMP, RADIUS). Use regression analysis or time series analysis to detect anomalous outbound connections (e.g., to external IPs, on unusual ports, with large data transfers) that are temporally linked to a recent administrative login."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary accessing credentials or bypassing authentication on network devices?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential-Access",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "Network traffic to a network device matching a signature for a known authentication bypass vulnerability (e.g., specific CVEs).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Deploy and monitor network signatures (e.g., via a Zeek script or integrated IDS) that detect specific request patterns, packet structures, or sequences known to exploit authentication bypass vulnerabilities in common network devices. Correlate alerts with the target device IP and administrative port. This provides a high-confidence, atomic indicator of a specific exploit attempt to bypass authentication."
          },
          {
            "description": "Successful authentication to a network device using known default, vendor-hidden, or previously compromised credentials.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the `user` field in successful authentication events (auth_success=true) from Zeek ssh.log and telnet.log. Compare usernames against a maintained list of known default credentials for various network device vendors (e.g., cisco, admin, root), known hardcoded vendor accounts, and any credentials discovered in previous breaches. Alert on any successful login using these credentials, especially if the source is unexpected or the account is supposed to be disabled."
          },
          {
            "description": "A successful connection to a network device's administrative interface that is not preceded by a corresponding successful authentication log, especially after multiple failed attempts are logged.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network connection logs with authentication logs. Identify sequences where multiple failed authentication attempts (from Zeek ssh.log or telnet.log with auth_success=false) from a source IP are followed by a successful network session (a completed TCP connection on an admin port in Zeek conn.log) from the same IP, but without a corresponding successful authentication event (auth_success=true). This sequence strongly suggests that an authentication bypass mechanism was used."
          },
          {
            "description": "Successful authentication to a network device with an abnormally low number of preceding failed attempts, deviating from both normal login behavior and typical brute-force patterns.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek ssh.log and telnet.log to count consecutive failed authentication attempts from each source IP before a success. Establish a baseline for 'normal' fumbled logins (e.g., 1-2 failed attempts) and brute-force (many attempts). Use descriptive statistics and IQR to flag successful logins that occur after a suspiciously low number of failures from an unknown source, which could indicate the adversary already possesses valid credentials or is using a highly effective, non-obvious bypass that requires minimal interaction."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]