[
  {
    "information_requirement": "Is the adversary attempting to wipe or corrupt data to impact availability?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1561",
        "name": "Disk Wipe",
        "evidence": [
          {
            "description": "Execution of a process where the file hash matches a known disk-wiping malware signature from threat intelligence sources.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, particularly Domain Controllers, file servers, and database servers.",
            "action": "Symbolic: Continuously monitor process creation events (Sysmon EID 1, Windows EID 4688) with process hash logging enabled. Correlate the hashes against a CTI feed of known disk-wiping malware (e.g., WhisperGate, NotPetya). Trigger a high-severity alert on any match. Statistical: For any CTI hash match, calculate the historical frequency of its parent process across the enterprise. A process spawned by a statistically rare parent (e.g., a wiper spawned by winword.exe, which is in the 1st percentile of parent-child relationships) should increase the alert's risk score. ML: Augment CTI matching by using a machine learning classifier trained on process metadata (path, parent, signature status) to assign a 'wiper-like' probability score to all new processes. A high probability score ($$ p(malicious) > 0.9 $$) combined with a CTI match provides maximum confidence for automated response."
          },
          {
            "description": "Execution of built-in system utilities (e.g., vssadmin.exe, cipher.exe, format.exe) with command-line arguments known to perform destructive data wiping.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical infrastructure servers (e.g., virtualization hosts, backup servers) and standard user workstations.",
            "action": "Symbolic: Monitor process creation events for command-line arguments using a list of high-fidelity regular expressions for destructive operations, such as `vssadmin.exe\\s+delete\\s+shadows\\s+/all`, `cipher.exe\\s+/w:`, or `format.exe\\s+[A-Z]:\\\\s+/p:`. Alert on any match. Statistical: For each command matching a pattern, calculate the historical execution frequency for the specific user and host. Flag executions where the user or host has a zero or near-zero historical frequency (first-time execution). Additionally, calculate the command-line entropy $$ S = -\\sum p(i) \\log_2 p(i) $$ and alert if it deviates significantly from the established baseline for that utility. ML: Employ a time-series anomaly detection model on the execution frequency of these utilities network-wide. A sudden, coordinated spike across multiple hosts, detected as a collective anomaly exceeding the forecasted volume, suggests a large-scale attack."
          },
          {
            "description": "Execution of destructive CLI commands on network infrastructure devices targeting device configuration or stored firmware images.",
            "data_sources": [
              "Network Device Syslog",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, routers, firewalls, and security appliances.",
            "action": "Symbolic: Ingest network device syslog and create a watchlist of destructive command strings (e.g., `erase startup-config`, `write erase`, `delete flash:`, `format slot0:`). Alert on any exact or partial match in the command logs. Statistical: Establish a baseline of administrative command types and frequency per user account. Alert when an account executes destructive commands at a rate exceeding 2 standard deviations above their personal baseline. Correlate the source IP of the administrative session (from Zeek conn.log or syslog) and flag commands from geographically anomalous or non-corporate IP space. ML: Use a Markov chain model to learn normal administrative command sequences. An observed command sequence containing a destructive command that has a very low transition probability from the preceding commands should be flagged as a sequential anomaly, indicating deviation from trained administrative patterns."
          },
          {
            "description": "An unauthorized process, not on an approved list, accesses a physical disk device directly for write or read operations, bypassing the file system.",
            "data_sources": [
              "Windows Event ID 9 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Boot drives of all Windows servers and endpoints, especially Domain Controllers and critical application servers.",
            "action": "Symbolic: Monitor Sysmon Event ID 9 (RawAccessRead). Maintain an explicit allow-list of legitimate process executables (by hash and path) known to perform raw disk access (e.g., specific disk imaging or backup tools). Alert on any process performing a raw disk access that is not on this allow-list. Statistical: For any process triggering a RawAccessRead event, analyze its prevalence across the enterprise. A process that is rare (e.g., present on less than 1% of endpoints) and performs this action is highly suspicious. Calculate this prevalence score and alert if it falls below a defined threshold. ML: Train a classification model (e.g., Random Forest) on features of the process initiating the raw access (file path, signature status, parent process, file entropy). The model's output, a probability of the process being malicious, is used to trigger an alert if it exceeds a confidence threshold (e.g., $$ p(malicious) > 0.9 $$)."
          },
          {
            "description": "A single process performs file deletion or modification operations at a rate or volume that significantly exceeds a dynamically established baseline for the host or user.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4660",
              "Windows Event ID 23 (Sysmon)",
              "Windows Event ID 26 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, document management systems, and developer workstations with access to source code repositories.",
            "action": "Symbolic: Monitor for processes that delete or modify files in critical system directories or files with specific extensions (e.g., `.bak`, `.vhd`, `.db`) that are not typically altered by standard processes. Maintain a watchlist of critical file paths and alert on any modification or deletion by an unauthorized process. Statistical: For each host, establish a baseline of file operation counts (writes, deletes) per process per minute. Use a percentile-based threshold to detect spikes (e.g., alert if operations exceed the 99th percentile of the baseline). Also, calculate the entropy of file extensions being modified; a sudden change in entropy indicates anomalous targeting. ML: Implement a time-series forecasting model (e.g., ARIMA) for file operation volume on critical servers. An alert is triggered when the observed volume significantly deviates from the forecasted volume by exceeding the model's confidence interval, which can detect both rapid and 'low-and-slow' wiping activity."
          },
          {
            "description": "A host, after exhibiting other potential wiping indicators, initiates an anomalously high number of new SMB connections to administrative shares on other network hosts.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Zeek conn.log",
              "Windows Event ID 5140"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, monitoring East-West traffic between workstations and servers.",
            "action": "Symbolic: Create a correlation rule that triggers if a host, within 10 minutes of generating a disk-wipe-related alert, is observed in Zeek smb_mapping.log or Windows Event ID 5140 logs accessing an administrative share (e.g., `ADMIN$`, `C$`) on more than 5 other hosts. Statistical: For every host, calculate a 'SMB fan-out' score over a 5-minute rolling window, defined as the number of unique destination IPs on port 445. Establish a baseline for this score for each host. An alert is triggered if a host's fan-out score exceeds its 99.9th percentile, indicating abnormal worm-like propagation. ML: Model the network as a graph where hosts are nodes and SMB connections are edges. Use a community detection algorithm to find outliers. A node that suddenly creates a large number of new, short-lived edges to nodes it has not previously communicated with represents a behavioral anomaly indicative of a spreading threat."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]