[
  {
    "information_requirement": "Is the adversary using virtualization to evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.006",
        "name": "Run Virtual Instance",
        "evidence": [
          {
            "description": "Network traffic from a new or unexpected virtual network adapter communicating with IP addresses or domains known to be malicious.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify network traffic in Zeek conn.log originating from MAC addresses with Organizationally Unique Identifiers (OUIs) belonging to virtualization software (e.g., VMware, VirtualBox, QEMU) that do not correspond to known, inventoried virtual machines. Correlate the destination IP addresses and domains from this traffic against a high-confidence cyber threat intelligence (CTI) feed of known malicious C2 infrastructure. An inner join between the filtered Zeek conn.log data and the CTI feed should generate high-fidelity alerts for investigation."
          },
          {
            "description": "Execution of common virtualization software with specific command-line arguments associated with silent, headless, or sandboxed execution for evasion.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events involving known virtualization executables (e.g., VBoxManage.exe, vmrun.exe, qemu-system-x86_64.exe). Scan process command-line arguments for patterns indicative of defense evasion, such as `--type headless`, `nogui`, `startvm --type headless`, or commands that modify VM settings to hide its presence (e.g., `setextradata \"VBoxInternal/Devices/VMMDev/0/Config/GetHostTimeDisabled\" \"1\"`). Maintain and use a library of regular expressions to capture these patterns."
          },
          {
            "description": "Creation of files with common virtual disk extensions (.vdi, .vmdk, .vhd) or registry keys for configuring virtualization software in non-standard user or system directories.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for the creation of files (Windows Event ID 4663) with virtualization extensions (.vdi, .vmdk, .vhd, .vhdx, .vbox, .vmx) in unusual locations like `C:\\Users\\<user>\\AppData\\`, `C:\\ProgramData\\`, or `C:\\Windows\\Temp\\`. Correlate these file creation events with nearby registry modifications (Windows Event ID 4657) under keys like `HKCU\\Software\\Oracle\\VirtualBox`. Use frequency analysis to baseline normal locations and parent processes for these files, then alert on statistical outliers."
          },
          {
            "description": "An otherwise benign or unexpected process (e.g., svchost.exe, explorer.exe, or a document reader) spawning a virtualization management process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze process lineage using Windows Event ID 4688 data to track parent-child relationships. Establish a baseline of normal parent processes for virtualization software (e.g., `explorer.exe` or `cmd.exe` launching `VBoxManage.exe` is typical for administrative use). Flag unusual or high-risk parent processes, such as a Microsoft Office application, a web browser, or a system service like `services.exe` launching virtualization tools. Use descriptive statistics on parent-process relationships to identify low-frequency, high-risk occurrences."
          },
          {
            "description": "A correlated sequence of events involving the creation of a large, unrecognized file, followed by the execution of a virtualization process, and culminating in new, un-inventoried network traffic from the host.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Hunt for a sequence of events across data sources within a defined time window (e.g., 5-10 minutes) on a single host. The sequence includes: 1. A process writes a large file (>500MB) with an unusual or non-standard extension (Windows Event ID 4663); 2. The same parent process or a child process executes a known virtualization binary (Windows Event ID 4688); 3. New network connections appear from a previously unseen MAC or IP address on that host, particularly one with a virtualization OUI (Zeek conn.log). Use correlation analysis on hostname/IP and timestamps to link these disparate events into a single high-fidelity alert for a likely hidden VM deployment."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]