[
  {
    "information_requirement": "Has the adversary collected and prepared data for exfiltration using archiving utilities? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1560.001",
        "name": "Archive via Utility",
        "evidence": [
          {
            "description": "Execution of an archiving utility process where the process executable's file hash or the command-line arguments match known indicators of compromise (IOCs) from threat intelligence.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, particularly those hosting sensitive data or belonging to high-privilege users.",
            "action": "1. (Symbolic) Ingest Cyber Threat Intelligence (CTI) feeds containing file hashes of malicious archiving tools and specific command-line strings used by threat actors. Create a SIEM rule to query Windows Event ID 4688 process creation events and alert on any exact match between the process hash or command-line field and the CTI IOC list. 2. (Statistical) For every executed process hash, calculate its prevalence across the enterprise (e.g., `COUNT(DISTINCT Hostname)`). Establish a threshold for rarity (e.g., running on < 1% of hosts). Flag any archiving utility execution where the process hash is below this rarity threshold, indicating it is not a standard, widely deployed tool. 3. (Machine Learning) Train a supervised classification model (e.g., Random Forest) using features from Event ID 4688 (parent process, command-line length, argument count, process hash prevalence) to predict if an execution is malicious. The model should be trained on a labeled dataset of known-good and known-bad archiving events."
          },
          {
            "description": "Execution of legitimate, built-in, or third-party archiving utilities with command-line parameters and process context indicative of malicious data staging, such as targeting sensitive directories, using password protection, or being spawned by an anomalous parent process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, developer workstations, and administrative jump boxes where command-line tools are common but staging large archives is not.",
            "action": "1. (Symbolic) Create SIEM rules to detect executions of utilities (e.g., `7z.exe`, `tar.exe`, `makecab.exe`, `certutil.exe`) where command-line arguments contain sensitive paths (`C:\\Users`, `\\Documents`), password flags (`-p`, `-hp`), or staging commands (`certutil -encode`). Also, alert when the parent process is unusual (e.g., `winword.exe`, `outlook.exe`, `httpd.exe`). 2. (Statistical) For each legitimate archiving utility, establish a baseline of normal parent-child process relationships. Calculate the probability of each pairing. Alert when a rare pairing occurs (e.g., `lsass.exe` spawning `7z.exe`). Additionally, calculate the entropy of command-line arguments; flag executions with unusually high entropy which can indicate obfuscated or randomized script parameters. 3. (Machine Learning) Use an anomaly detection model (e.g., Isolation Forest) on features extracted from the process event and command line, such as argument count, path depth of target files, presence of password flags, and the statistical rarity of the parent process. The model identifies executions that are outliers compared to normal administrative and user activity."
          },
          {
            "description": "Creation of one or more archive files (e.g., .zip, .rar, .7z, .tar.gz, .cab) that are anomalous in terms of their location, size, count, or the process that created them, especially when preceded by broad file access.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, document management systems (e.g., SharePoint servers), and critical application servers where large data sets reside.",
            "action": "1. (Symbolic) Create a rule that alerts on the creation (Event ID 4663) of files with archive extensions (`.zip`, `.rar`, `.7z`) in non-standard locations like `C:\\Windows\\Temp`, `%APPDATA%`, or user profile root directories, especially when the creating process (from linked Event ID 4688) is not `explorer.exe` or a known backup utility. 2. (Statistical) For each host, establish a baseline for the hourly count and total size of created archive files. Use a percentile-based threshold (e.g., 99th percentile) to alert on spikes that deviate significantly from the norm. Calculate the Shannon entropy of newly created filenames in a short time window to detect randomized naming conventions. 3. (Machine Learning) Employ a time-series forecasting model (e.g., ARIMA) for the volume of archive data created per host. An alert is generated when the observed volume significantly exceeds the model's predicted range. Correlate this with preceding file access events (Event ID 4656) on sensitive directories to confirm staging behavior."
          },
          {
            "description": "Network traffic containing files identified as archives (via MIME type or magic number) being transferred to an external or unusual internal destination, where the transfer itself is anomalous in volume, frequency, or destination.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN gateways, and traffic to cloud storage provider IP ranges.",
            "action": "1. (Symbolic) Create a rule to join Zeek's `files.log` and `conn.log` on the connection UID. Alert when `files.log.mime_type` is an archive type (e.g., `application/zip`, `application/x-rar-compressed`) and `conn.log.id.resp_h` is an external IP not on an approved list of destinations (e.g., trusted partners, corporate cloud services). 2. (Statistical) For each internal host, baseline the daily volume of archive data transferred externally. Use a Z-score calculation to identify hosts transferring an anomalous amount of data (e.g., Z-score > 3). Separately, maintain a list of destination Autonomous Systems (AS) and alert on transfers to new or statistically rare ASNs. 3. (Machine Learning) Use a one-class SVM model trained on features of normal archive transfers (e.g., size, destination port, time of day, day of week, destination ASN). This model builds a profile of 'normal' and flags any transfer that deviates from this profile as a potential exfiltration attempt."
          },
          {
            "description": "A correlated sequence of events on a single host within a short time window, consisting of file/directory discovery, followed by the execution of an archiving utility on the discovered data, and resulting in the creation of a new archive file.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, database servers, and workstations of executives or system administrators.",
            "action": "1. (Symbolic) Implement a SIEM correlation rule that triggers when, on a single host within a 30-minute window, a discovery command (e.g., `dir /s`, `findstr`, `Get-ChildItem -Recurse`) is observed in Event ID 4688, followed by an archiving utility process (e.g., `7z.exe`, `tar.exe`) in Event ID 4688, and culminating in a file creation event for an archive file type in Event ID 4663. 2. (Statistical) Develop a risk scoring system for event sequences. Assign scores to each event in the chain (e.g., discovery command: +2, archiving a user profile: +5, creating archive in `%TEMP%`: +3). Sum the scores for a user/host session. If the total score exceeds a dynamically calculated 98th percentile of all session scores, generate a high-fidelity alert. 3. (Machine Learning) Use a sequence analysis model, such as a Hidden Markov Model (HMM), trained on benign event sequences from hosts. The model learns normal transition probabilities between states (e.g., from 'web browsing' to 'document editing'). The specific `discovery -> compression -> stage` sequence, being a low-probability transition, would be flagged as a high-risk anomaly."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]