[
  {
    "information_requirement": "Is the adversary communicating with command and control infrastructure using fast flux DNS? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1568.001",
        "name": "Fast Flux DNS",
        "evidence": [
          {
            "description": "An internal host initiated a DNS query for a domain or an outbound network connection to an IP address present on a threat intelligence feed specifically tracking fast flux C2 infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Internet Gateway, Corporate DNS Resolvers",
            "action": "1. (Symbolic) Ingest a high-frequency threat intelligence feed for known fast flux domains and IPs into a SIEM. Create a watch list and a rule to generate a high-severity alert upon any match with the 'query' field in Zeek dns.log or the 'id.resp_h' field in Zeek conn.log. 2. (Statistical) For domains matching the IOC feed, calculate the historical query frequency from the source host ('id.orig_h'). If the query count for the malicious domain is in the top 5th percentile of all queries from that host over the last 24 hours, escalate the alert priority, as this may indicate active C2 beaconing. 3. (Machine Learning) Train a classification model (e.g., Random Forest) using features from the threat intelligence feed (e.g., domain age, registrar) and internal network data (query count, source host role). Use this model to predict the likelihood that a new, unseen domain matching an IOC is part of a specific threat actor's campaign, aiding in faster incident scoping."
          },
          {
            "description": "A single domain name exhibits a high entropy score characteristic of Domain Generation Algorithms (DGA) and resolves to multiple IP addresses across geographically diverse or non-corporate Autonomous System Numbers (ASNs) within a 60-minute window.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Endpoint devices",
            "action": "1. (Symbolic) Match DNS queries against known DGA patterns using regular expressions (regex) or community-provided DGA lists. For example, a rule could look for long, random-looking subdomains of a known dynamic DNS provider. 2. (Statistical) For all domains in Zeek dns.log, calculate the character entropy of the 'query' field. Flag any domain with an entropy score exceeding a baseline threshold (e.g., > 3.5) or falling in the top 1% of all calculated entropy scores. For these flagged domains, enrich the resolved IPs ('answers') with GeoIP and ASN data. A high standard deviation in the geographic location or a high percentage (>50%) of non-corporate/residential ASNs for a single domain's IPs is a strong secondary indicator. 3. (Machine Learning) Use a pre-trained DGA detection model (e.g., a Long Short-Term Memory network or LSTM) to classify domain names from Zeek dns.log in near-real-time. For domains classified as DGA, use a time-series analysis on the resolved IPs. A time-series model (like ARIMA) can predict the expected number of IP changes for a domain; if the actual number of IP changes significantly exceeds the prediction, flag it as potential fast flux activity."
          },
          {
            "description": "A single domain name resolves to an anomalously high number of unique IP addresses over a short time window (e.g., 5-60 minutes), and the associated DNS resource records have an abnormally low Time-To-Live (TTL) value.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Network Egress/Internet Gateway",
            "action": "1. (Symbolic) Create a rule that triggers when a single domain (from 'query' in Zeek dns.log) resolves to more than 10 unique IP addresses (from 'answers') within a 30 minute window AND the average TTL is less than 300 seconds. This provides a simple, high-fidelity signature for single-flux behavior. 2. (Statistical) For each domain, calculate a 'flux score' defined as (Unique IPs / Time Window) / Average TTL. Establish a baseline flux score across all domains. Use a percentile-based threshold (e.g., 99th percentile) to identify domains exhibiting outlier behavior. A box plot visualization of flux scores per domain can help analysts identify these outliers. 3. (Machine Learning) Implement an unsupervised learning model, such as DBSCAN, to cluster domains based on features like the count of unique resolved IPs, average TTL, and the standard deviation of resolved IP subnets. Clusters identified as dense and separate from the main group of 'normal' domains likely represent fast flux networks and can be flagged for review without pre-defined thresholds."
          },
          {
            "description": "The set of authoritative Name Server (NS) records for a specific domain zone changes with high frequency, and the NS records themselves have very low TTL values, indicating the C2 proxy layer is also fluxing.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, External-facing authoritative DNS servers",
            "action": "1. (Symbolic) Create a SIEM rule to alert when, for a single domain zone, the set of authoritative name servers (NS records in Zeek dns.log) changes more than 5 times in a 24-hour period. This requires maintaining a state table of domain-to-NS mappings. 2. (Statistical) For each domain where NS records are observed, calculate the rate of change of the NS record set over a 24-hour sliding window. Also, track the average TTL of these NS records. Flag domains that are in the 99th percentile for NS record change rate and have an average TTL below a network-wide baseline (e.g., < 1800 seconds). 3. (Machine Learning) Model DNS resolutions as a graph where nodes are domains, IPs, and name servers. Apply a community detection algorithm (e.g., Louvain Modularity) to identify clusters of domains and name servers that are tightly interconnected and change frequently. A cluster with high internal churn in its NS nodes is a strong candidate for a double-flux network."
          },
          {
            "description": "An internal host exhibits a statistically significant increase in DNS query frequency for a single external domain, followed by outbound connection attempts to the multiple, distinct IP addresses resolved from that domain's A-records.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Network Egress/Internet Gateway, Domain Controllers",
            "action": "1. (Symbolic) Create a correlation rule that triggers if a host queries a known fast flux domain (from an IOC list) and then a network connection is logged on the host (Windows Event ID 5156) to one of the resolved IPs within 60 seconds. Further correlate with the parent process (Windows Event ID 4688) to identify the malicious executable. 2. (Statistical) For each internal host-external domain pair, calculate the Z-score of the DNS query count over a 5-minute window against the host's 30-day baseline. If Z-score > 3, calculate the ratio of unique IPs connected to (from Zeek conn.log) versus unique IPs resolved (from Zeek dns.log). A ratio > 0.8 is a strong statistical signal of compromise. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., LSTM autoencoder) for each host's network behavior, using features like DNS query rate, number of unique domains, and destination IP count. An alert is generated when the model's reconstruction error for a host's current activity exceeds a learned threshold. Feature analysis can then pinpoint if a spike in DNS queries to a single domain is the primary contributor."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]