[
  {
    "information_requirement": "Has the adversary archived collected data prior to exfiltration?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1560",
        "name": "Archive Collected Data",
        "evidence": [
          {
            "description": "Creation or presence of archive files with specific names, file hashes, or embedded password-protection strings known to be used by malicious actors or tools.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan for newly created files (Windows Event ID 4663) with names known to be used by specific malware (e.g., backup.zip, data.rar). If process creation logs (Windows Event ID 4688) include file hashes, compare them against a CTI feed of known malicious archiver tools or staged files. If command-line logging is enabled, use regular expressions to scan for known passwords used by threat groups in archive commands (e.g., -p'maliciouspassword123'). Maintain and regularly update these selector lists."
          },
          {
            "description": "Execution of common archival utilities (e.g., 7z.exe, rar.exe, tar) with command-line arguments indicating creation of a new, potentially password-protected archive, especially when spawned by an unusual parent process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for executions of known archival utilities (e.g., rar.exe, 7z.exe, zip.exe, tar.exe, gzip.exe). Specifically search command-line arguments for patterns indicating archive creation (`a`, `c`, `new`, etc.) combined with password protection flags (`-p`, `-hp`, `--password`). Analyze parent-child process relationships and flag executions where the parent process is not explorer.exe or cmd.exe, but rather a web server process, Office application, or a living-off-the-land binary like powershell.exe."
          },
          {
            "description": "Sudden creation of one or more large files with common archive extensions (.zip, .rar, .7z, .tar.gz) in atypical locations (e.g., C:\\Users\\Public\\, %TEMP%, recycle bin), especially if the creating process is anomalous.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4663/4656 (Object Access) for file write events that create files with common archive extensions. Establish a baseline for normal archive creation activity per host/user group. Flag creation events that occur in unusual directories (e.g., system directories, temp folders not associated with standard software installers, user profile folders for service accounts). Use time series analysis to detect a sudden spike in the volume or size of archive files being created on a host. Employ descriptive statistics, such as box-plots or IQR analysis, on file sizes to identify outliers for a given host or user."
          },
          {
            "description": "A sequence of events indicating data staging followed by archival, such as numerous file read operations across multiple directories followed by the creation of a single large archive file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate file system activity (Windows Event ID 4663) to detect a high volume of read operations on sensitive file types (e.g., .docx, .pdf, .xls) across multiple directories by a single process within a short time frame (e.g., minutes). Use correlation analysis to link this staging behavior with a subsequent process creation event (Windows Event ID 4688) for an archival utility originating from the same parent process or session, and the final creation of a single large archive file. Alert when this full sequence is observed."
          },
          {
            "description": "An unusual process loading cryptographic libraries (like crypt32.dll), suggesting data encryption outside of normal application behavior.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of legitimate processes that load cryptographic libraries (e.g., crypt32.dll, bcrypt.dll) in your environment. Monitor for any process loading these libraries that deviates from the baseline (e.g., a command-line utility, a script host like powershell.exe, or a non-standard application). Use frequency analysis (entropy measures or percentile analysis) on the set of processes loading crypto DLLs to find rare occurrences. Correlate these events with process creation (Windows Event ID 4688) and subsequent encrypted file creation (Windows Event ID 4663)."
          },
          {
            "description": "A high-volume outbound network transfer closely following the creation of a large archive file on the source host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a temporal correlation between host-based archival events and outbound network traffic. Monitor for the creation of a large archive file (using Windows Event ID 4663 or 4688 as triggers). Within a subsequent time window (e.g., 5-30 minutes), monitor Zeek conn.log for high-volume outbound data flows (e.g., >100MB, or an outlier based on historical data) originating from the same host. Use linear regression to model and detect anomalous relationships between internal data aggregation volume and outbound data volume. Alert when a strong positive correlation is detected between a large archive creation event and a large outbound transfer."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]