[
  {
    "information_requirement": "Has the adversary disabled or modified cloud logging to evade detection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.008",
        "name": "Disable or Modify Cloud Logs",
        "evidence": [
          {
            "description": "Connections to cloud provider management API endpoints from a source IP address known to be malicious or previously associated with unauthorized cloud activity.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a list of cloud provider API endpoint IP ranges (AWS, Azure, GCP). Monitor Zeek conn.log for any connections to these ranges. Inner join the source IPs of these connections against a high-confidence, continuously updated cyber threat intelligence (CTI) feed of known malicious IPs. Alert on any match, as this indicates a potentially compromised host or malicious external actor interacting with cloud management infrastructure."
          },
          {
            "description": "Network traffic containing specific API call names, parameters, or URI patterns associated with disabling or modifying cloud logging services across major cloud providers.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log (for cleartext) and Zeek ssl.log (for SNI to cloud API endpoints like *.amazonaws.com, management.azure.com, *.googleapis.com). Use regular expression matching on URI paths and request bodies (if visible) for patterns like `DeleteTrail`, `StopLogging`, `UpdateTrail` (AWS); `diagnostic-settings/delete`, `Microsoft.Insights/logprofiles` (Azure); `projects.sinks.update`, `organizations.sinks.delete` (GCP). Use frequency analysis to flag rare API calls to these sensitive logging endpoints."
          },
          {
            "description": "A statistically significant and unexpected cessation or reduction in the volume of logs being received from a specific cloud environment into a central log aggregator.",
            "data_sources": [
              "Windows Event ID (from log collector application)"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On a central log aggregator server, establish a baseline of expected log volume per hour for each integrated cloud source (e.g., AWS CloudTrail, Azure Activity Logs). Use time series analysis (e.g., ARIMA, Holt-Winters) to model this data flow. Generate a high-priority alert when the incoming log volume drops below a statistically significant threshold (e.g., >3 standard deviations below the mean for a sustained period) outside of a planned maintenance window. Correlate the drop with any recent cloud administrative changes."
          },
          {
            "description": "Anomalous command execution on a host followed by network connections to cloud management APIs, especially from systems or user accounts not authorized for cloud administration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify a list of hosts and user accounts that are NOT authorized to perform cloud administration. Monitor Windows Event ID 4688 on these systems for execution of cloud command-line tools (e.g., `aws.exe`, `az.cmd`, `gcloud.cmd`) or scripting engines (`powershell.exe`) with suspicious command-line arguments. Correlate these process creations with subsequent outbound network connections (from Zeek conn.log) to cloud API endpoints within a short time window (e.g., 5 minutes). Use correlation analysis and descriptive statistics to flag rare occurrences of such activity from unauthorized sources."
          },
          {
            "description": "A sequence of defensive evasions where a confirmed cloud log modification or cessation event is followed by other suspicious activities that would normally have been logged.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "This is a hunting action. Upon detecting a confirmed or suspected log modification/cessation event, immediately pivot to analyzing all other available telemetry from the associated cloud environment or related hosts. Specifically, hunt for other ATT&CK techniques that often follow defense evasion, such as creating new compute instances, modifying IAM roles, or data access/exfiltration, by analyzing host process logs (Windows Event ID 4688) and network logs (Zeek conn.log). The absence of expected cloud logs during a period of other suspicious activity (detected via endpoint or network sensors) strongly corroborates that defense evasion was successful. Use sequence analysis to model these potential attack chains."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]