[
  {
    "information_requirement": "Has the adversary attempted to disable or modify the Linux audit system?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.012",
        "name": "Disable or Modify Linux Audit System",
        "evidence": [
          {
            "description": "Network transfer of a script or binary file whose hash matches a known malicious tool used to disable or modify the Linux audit system.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek files.log for files transferred to Linux servers over protocols like HTTP, SMB, or FTP. Calculate the hash of all transferred executable files or scripts and compare them against a threat intelligence feed of known malicious file hashes associated with defense evasion tools. Correlate any file hash match (Zeek files.log) with the corresponding network connection to the Linux server (Zeek conn.log) to identify the source and destination of the malicious tool."
          },
          {
            "description": "Execution of command-line patterns from a Windows host specifically designed to disable, reconfigure, or kill the Linux audit daemon (`auditd`) on a target server.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On Windows management hosts with process command-line logging enabled, monitor process creation events (Event ID 4688). Use regular expressions to search the command lines of remote execution tools (e.g., ssh.exe, plink.exe, wsl.exe) for specific patterns indicative of tampering with auditd. Examples include: `systemctl stop auditd`, `systemctl disable auditd`, `service auditd stop`, `killall -9 auditd`, `auditctl -e 0`, `auditctl -D`, or redirecting output to `/etc/audit/audit.rules`. Alert on any matches and investigate the associated user and source host."
          },
          {
            "description": "A remote login session to a critical Linux server, immediately followed by a significant and anomalous cessation of expected network logging traffic (e.g., syslog) from that server.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal network logging traffic volume and frequency (e.g., syslog over UDP/514 or TCP/6514) from critical Linux servers using Zeek conn.log. Monitor for remote access to these servers (e.g., new SSH sessions seen in Zeek ssh.log). Use time series analysis to detect a sudden, sustained drop (>90%) in the expected logging traffic from a server. Correlate the remote source IP and timestamp of the connection with the start of the log outage to identify the causal session and investigate for defensive evasion."
          },
          {
            "description": "Anomalous modification or transfer of Linux audit configuration files, such as `audit.rules` or `auditd.conf`, originating from a Windows management host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 on management hosts for file transfer commands (`pscp`, `scp`, `winscp`) or remote file editing commands where the target file is `audit.rules`, `auditd.conf`, or any file within `/etc/audit/rules.d/`. Correlate these process events with network file transfers seen in Zeek smb.log or connections in Zeek conn.log. Use descriptive statistics and correlation analysis to flag such modifications, especially when performed by non-standard administrator accounts or outside of approved change control windows."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]