[
  {
    "information_requirement": "Is the adversary manipulating data in transit?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1565.002",
        "name": "Transmitted Data Manipulation",
        "evidence": [
          {
            "description": "Network traffic for sensitive systems redirected through or communicating with IP addresses/domains associated with known malicious proxies or man-in-the-middle (MitM) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join destination IP addresses from Zeek conn.log and resolved IPs from Zeek dns.log against a high-confidence CTI feed of known malicious proxies, anonymizers, or MitM infrastructure. Alert on traffic involving sensitive internal systems that is unexpectedly routed through these suspicious external points. Investigate DNS responses that point critical internal services to these malicious IPs, as this could indicate DNS poisoning to facilitate MitM."
          },
          {
            "description": "Anomalous SSL/TLS certificates or specific protocol artifacts indicative of interception by known man-in-the-middle (MitM) tools or frameworks.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek ssl.log for SSL/TLS certificate anomalies, such as: 1) sudden changes in the certificate for a known service, 2) use of self-signed or non-corporate-standard certificates for internal services that should use a trusted CA, 3) certificate issuer/subject details matching known MitM proxy tools (e.g., Burp Suite, Fiddler, mitmproxy). Correlate these certificate anomalies with protocol warnings in Zeek weird.log. Maintain and use a list of suspicious certificate fingerprints, issuers, and JA3 hashes associated with common interception tools for pattern matching."
          },
          {
            "description": "Suspicious process access or injection targeting applications and services responsible for data transmission, potentially to manipulate data before it is sent over the network.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 8",
              "Windows Event ID 10"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify and monitor processes that handle sensitive data transmission (e.g., database clients, financial software, file transfer clients). Flag suspicious parent-child process relationships using Windows Event ID 4688 (e.g., a browser spawning an unexpected scripting engine). Use Windows Event IDs indicative of remote thread creation or process access (such as Sysmon Event IDs 8 and 10) to detect processes being injected into or read by an unauthorized process. Use correlation analysis to link these host events with network connections made by the targeted application to identify potential data manipulation attempts."
          },
          {
            "description": "Unexpected changes in network traffic characteristics or protocol behavior during sensitive data transfers, indicating potential interception, modification, or replay.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish baselines for normal data transfers between critical systems, including typical protocols, ports, data volumes, connection durations, and HTTP header content. Monitor for deviations using Zeek logs. Apply time series analysis on Zeek conn.log metrics (e.g., bytes transferred) to detect anomalous spikes or drops in data volume. Analyze Zeek http.log for unexpected modifications to headers (e.g., Host, Referer) or content length. Monitor Zeek weird.log for a sudden increase in events like 'bad_TCP_checksum' or 'data_before_established' related to critical data flows, as these can be artifacts of active manipulation."
          },
          {
            "description": "An anomalous increase in data integrity check failures, such as hash mismatches or transaction errors, for data transmitted over the network.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4663",
              "Application Logs"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek files.log for file transfers and correlate with expected hashes if available. More broadly, ingest application-level logs that perform their own integrity checks (e.g., transaction logs, data replication logs). Use descriptive statistics and time series analysis to monitor the rate of integrity failures (e.g., hash mismatches, transaction rollbacks, checksum errors reported by applications). An anomalous spike in the failure rate for a specific data path or application may indicate active data manipulation in transit. Use correlation analysis to link failure spikes with unusual network events occurring at the same time."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]