[
  {
    "information_requirement": "Is the adversary using snapshots to evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578.001",
        "name": "Create Snapshot",
        "evidence": [
          {
            "description": "Cloud API calls for snapshot activity originating from known malicious source IP addresses or using User-Agent strings associated with non-standard or malicious tools.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate source IP addresses of connections to cloud provider API endpoints (e.g., ec2.*.amazonaws.com, management.azure.com, compute.googleapis.com) against a CTI feed of known malicious IPs, updated daily. Scan Zeek http.log for User-Agent strings associated with known malicious cloud management tools, non-standard SDKs, or generic HTTP libraries (like Python's 'requests') instead of official CLI tools. Alert on any confirmed matches."
          },
          {
            "description": "Execution of command-line utilities or scripts containing specific keywords and arguments for creating, managing, or sharing snapshots across different cloud providers.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creations of cloud CLIs (aws.exe, az.cmd, gcloud.cmd) or scripting hosts (powershell.exe, python.exe). Use regular expressions to search full command lines for specific patterns related to snapshot creation (e.g., 'aws ec2 create-snapshot', 'az snapshot create', 'gcloud compute snapshots create'), modification, or sharing (e.g., 'modify-snapshot-attribute --attribute createVolumePermission', 'az snapshot grant-access'). Maintain and regularly update a list of these patterns for all relevant cloud providers and alert on any detections."
          },
          {
            "description": "Snapshot creation is immediately followed by actions to make the snapshot public, share it with an unknown external account, or copy it to another geographic region.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate snapshot creation events (identified via CLI commands in Event ID 4688) with subsequent API calls or CLI commands within a short time window (e.g., 5-15 minutes). Specifically monitor for commands or API requests (in Zeek http.log) that alter snapshot permissions, such as adding a public group ('all') or an unknown/unauthorized external Account ID, subscription ID, or project ID. Such a sequence is a high-fidelity indicator of data theft preparation. Use correlation analysis based on host, user, and timestamps to link these events."
          },
          {
            "description": "Snapshot creation is initiated by a user account or from a host that does not typically perform cloud administrative actions, or occurs at an anomalous time.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of users and hosts that normally execute cloud CLI tools or make API calls for infrastructure management using historical Windows Event ID 4688 and Zeek conn.log data. Flag any snapshot-related activity originating from non-administrative users, production web servers, or standard user workstations that are not part of a CI/CD or infrastructure-as-code pipeline. Use descriptive statistics on login times (from Event ID 4624) and API call times to identify activity occurring outside normal business hours. Use percentile or IQR analysis on activity frequency per user/host to identify significant outliers."
          },
          {
            "description": "Snapshot creation occurs shortly after other suspicious activities on the same host, such as the download and installation of cloud management tools, credential access, or extensive system discovery.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Implement chained-alert logic by correlating snapshot creation events with preceding events on the same host within a defined lookback period (e.g., 1-24 hours). Precursor events of interest include: process creation of tools like 'curl.exe' or 'bitsadmin.exe' downloading cloud CLI installers from the internet (identified via command line arguments and network connections in Zeek conn.log); execution of known credential access tools; or a high volume of system discovery commands (e.g., 'whoami', 'ipconfig', 'net user'). A linear regression model could test the correlation between the frequency of discovery activity and subsequent snapshot creation events to score risk."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]