[
  {
    "information_requirement": "Is the adversary creating new cloud instances to evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578.002",
        "name": "Create Cloud Instance",
        "evidence": [
          {
            "description": "Creation of a cloud instance using a known malicious, publicly shared, or non-vetted image (e.g., AMI, VHD), or from a source IP address on a threat intelligence feed.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Admin Activity audit logs"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor instance creation events (e.g., AWS RunInstances, Azure Microsoft.Compute/virtualMachines/write, GCP gcloud compute instances create) and extract the source image ID (e.g., AMI ID) and the source IP address of the initiating principal. Correlate the source IP address of the API call with a high-confidence cyber threat intelligence (CTI) feed of malicious IPs. Compare the instance image ID against a curated allow-list of approved, internally-vetted images and a deny-list of known malicious or suspicious public images. Alert on any matches from either correlation."
          },
          {
            "description": "Creation of a cloud instance with specific naming conventions, tags, or SDK/CLI User-Agent strings associated with known offensive security or cloud exploitation tools.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Admin Activity audit logs"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Parse instance creation events for instance names and associated tags. Match them against a list of regular expressions or keywords associated with known malicious toolkits or suspicious temporary naming schemes (e.g., 'test', 'temp', long random strings). Analyze the 'userAgent' field in the audit log event to identify signatures of known offensive cloud security tools (e.g., Pacu, Prowler) being used for instance creation. Maintain and regularly update a list of these tool-specific patterns and alert on matches."
          },
          {
            "description": "Detection of cloud instance creation by an anomalous user or principal, such as a newly created account, a dormant account, or a user that deviates from its established activity baseline.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Admin Activity audit logs"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal instance creation activity for each user/principal. Monitor instance creation events and identify the initiating user. Flag any creation events initiated by principals created within the last 24-48 hours, principals that have been inactive for an extended period (e.g., >90 days), or users who have no prior history of creating instances. Use descriptive statistics (frequency counts of instance creation per user) and percentile analysis to identify users whose creation activity is a statistical outlier compared to their own or their peers' baseline."
          },
          {
            "description": "Creation of cloud instances with configurations (e.g., region, instance size/family, networking settings) that deviate significantly from established organizational baselines.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Admin Activity audit logs"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze instance creation events to extract key configuration details, including region, instance type/size, source image ID, and associated networking configurations (e.g., VPC, subnet, security groups). Establish a baseline profile of typical instance configurations for the organization using descriptive statistics and frequency distributions of these attributes. Continuously monitor new instance creations and flag any that deviate significantly from the established baseline (e.g., creation in an unused region, use of a rare or unusually large instance type, attachment to an overly permissive security group). Use correlation analysis to see if multiple configuration anomalies occur in a single event."
          },
          {
            "description": "A rapid sequence of events where a volume snapshot is created from a sensitive instance and then immediately attached to a newly created instance, especially if the new instance is in a different region or has less restrictive network access.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Admin Activity audit logs"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor and correlate a sequence of cloud audit events: volume snapshot creation (e.g., CreateSnapshot), new instance creation (e.g., RunInstances), and volume attachment (e.g., AttachVolume). Link these events using the snapshot ID and instance ID. Analyze the time delta between the snapshot creation and its attachment to a new instance. Flag sequences where this process occurs within an unusually short time frame (e.g., < 15 minutes), as this suggests an automated or scripted process. Raise the alert priority if the new instance is created in a different geographic region than the source or is assigned a less restrictive network security policy, as this is a strong indicator of data staging for exfiltration or defense evasion."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]