[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by modifying cloud compute infrastructure? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578",
        "name": "Modify Cloud Compute Infrastructure",
        "evidence": [
          {
            "description": "Execution of a process on a host, identified by its hash or command-line arguments, that matches a known malicious tool or script used for unauthorized cloud infrastructure modification.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, Developer endpoints, CI/CD pipeline servers, Bastion hosts",
            "action": "1. (Symbolic) Monitor Windows Event ID 4688 for new process creation. Compare the process name, command-line arguments, and file hash against a threat intelligence feed of known cloud-focused malware (e.g., Pacu, Cloud-Sniper) or suspicious script names (e.g., 'get_creds.ps1'). 2. (Statistical) For processes that interact with cloud APIs (e.g., 'aws.exe', 'az.cmd'), calculate the rarity of specific command-line argument combinations across the enterprise. Flag commands in the 99th percentile of rarity for review. 3. (ML) Train a classification model (e.g., Random Forest) on features from command lines (length, character entropy, keyword count) to distinguish between benign and malicious cloud tool usage. Correlate alerts with anomalous outbound network connections to cloud API endpoints in Zeek conn.log."
          },
          {
            "description": "A network connection to a cloud provider API endpoint is observed with a User-Agent string that is either on a denylist of malicious tools or is statistically rare within the organization's network traffic.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internet gateways, Forward proxy servers",
            "action": "1. (Symbolic) In Zeek http.log, filter for traffic to known cloud provider API IP ranges. Alert if the 'user_agent' field matches a curated list of signatures associated with hacking tools, outdated SDKs, or generic clients like 'curl' or 'wget'. 2. (Statistical) For all connections to cloud APIs, calculate the frequency of each User-Agent string over a 30-day baseline. Alert on any User-Agent that falls below a 1% frequency threshold (i.e., is exceptionally rare). 3. (ML) Use a clustering algorithm (e.g., DBSCAN) on vector representations of User-Agent strings to group them. Analyze outlier clusters, which may represent previously unknown or custom malicious tools, for manual investigation."
          },
          {
            "description": "A sequence of cloud CLI commands is executed on a single host by a single user within a short time window, matching a known attack pattern for infrastructure manipulation, such as creating a snapshot, making it public, and copying it to an external account.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, CI/CD servers, Cloud Shell environments, Virtual Desktop Infrastructure (VDI)",
            "action": "1. (Symbolic) Implement a SIEM correlation rule to detect the specific sequence: (Event A: 'aws ec2 create-snapshot') followed by (Event B: 'aws ec2 modify-snapshot-attribute --attribute createVolumePermission') followed by (Event C: 'aws ec2 copy-snapshot --source-region ... --destination-region ...') from the same host/user within 30 minutes. 2. (Statistical) Model the transition probabilities between different CLI command types (e.g., create, modify, copy, delete) for normal administrative behavior using a first-order Markov chain. Flag any observed command sequence with a joint probability below a dynamically set threshold. 3. (ML) Train a sequence-based anomaly detection model, such as an LSTM autoencoder, on benign sequences of CLI commands from Windows Event ID 4688. A high reconstruction error on a new sequence indicates a deviation from normal patterns and a potential attack."
          },
          {
            "description": "A cloud CLI command is executed with parameters that configure an overly permissive security setting or disable a security control, such as creating a public VM snapshot or a security group rule allowing all traffic from any source.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, Developer endpoints, CI/CD pipeline servers",
            "action": "1. (Symbolic) Use regular expressions to search process command-line arguments in Windows Event ID 4688 for high-risk patterns like '--cidr 0.0.0.0/0', '--member allUsers', '--group-name all', or API calls like 'PutBucketPolicy' with a principal of '*'. 2. (Statistical) Establish a baseline of 'risky' command executions per user role. Alert if a user's execution rate of risky commands exceeds two standard deviations above their role's average. 3. (ML) Train a binary classification model (e.g., Logistic Regression) to label a command as 'high-risk' or 'low-risk' based on its parameters. Features can include the presence of wildcards, specific keywords, and the resource type being modified. Flag any command classified as 'high-risk' for immediate review."
          },
          {
            "description": "A cloud infrastructure modification command is executed in a context that is anomalous compared to the executing user's established baseline, considering factors like time-of-day, source IP geolocation, or source hostname.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Authentication servers, Endpoints of privileged users",
            "action": "1. (Symbolic) Create a SIEM rule that alerts when a cloud modification command is executed by a user account that is not a member of a predefined 'Cloud Administrators' group in Active Directory. 2. (Statistical) For each administrator, build a multi-faceted baseline profile including typical command execution hours, source IP subnets (from Zeek conn.log), and source hostnames. Alert if a new command execution deviates from this baseline on two or more facets (e.g., command run at 3 AM from a previously unseen IP address). 3. (ML) Employ an unsupervised anomaly detection model (e.g., Isolation Forest) on a feature vector for each execution event: [user_id, hour_of_day, day_of_week, source_ASN, is_new_host]. The model learns normal operational patterns and flags outliers that represent significant deviations."
          },
          {
            "description": "A statistically significant spike in the rate of cloud compute resource creation or deletion commands (e.g., for VMs, snapshots, volumes) is observed from a single host or user, suggesting automated or scripted activity.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider audit logs (e.g., AWS CloudTrail, Azure Activity Log), Administrator workstations, CI/CD servers",
            "action": "1. (Symbolic) Trigger an alert if the count of commands containing keywords like 'create-instance', 'terminate-instance', 'create-snapshot', 'delete-snapshot' from a single host exceeds a hard threshold (e.g., 50 commands in 15 minutes). 2. (Statistical) For each host/user, calculate a moving average and standard deviation for the rate of resource modification commands per hour. Alert when the current rate exceeds the moving average by more than 3 standard deviations. 3. (ML) Apply a time-series forecasting model (e.g., SARIMA) to the event counts of modification commands. An alert is generated when the observed count significantly exceeds the model's forecasted value and its confidence interval, indicating an unexpected burst of activity."
          },
          {
            "description": "A large or anomalous outbound network data transfer is observed immediately following a cloud infrastructure modification event, such as creating a public snapshot or deploying a new VM in a foreign region.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPC/VNet flow logs, Cloud storage access logs, Administrator workstations",
            "action": "1. (Symbolic) Create a correlation rule: If a 'modify-snapshot-attribute' command (from Windows Event ID 4688) is observed, and within 1 hour, a Zeek conn.log event shows a connection from the same source host to an IP not belonging to the corporate or cloud provider network with over 1GB of data sent, generate a high-severity alert. 2. (Statistical) After an infrastructure modification event, monitor the total outbound bytes from the source host. Alert if the data volume in the subsequent hour is in the 99th percentile of that host's typical hourly outbound traffic. 3. (ML) Use a causal inference model to analyze the impact of modification events on network traffic. If the model determines that a command like 'create-snapshot' has a statistically significant causal effect on a subsequent spike in data transfer to an untrusted destination, flag the event as a likely exfiltration attempt."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]