[
  {
    "information_requirement": "Is the adversary communicating with command and control infrastructure using non-standard ports?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1571",
        "name": "Non-Standard Port",
        "evidence": [
          {
            "description": "Outbound network connections on non-standard ports to external IP addresses or domains known to be associated with command and control infrastructure.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek conn.log for all successful outbound connections (`conn_state`='SF') on ports not typically used for enterprise egress (e.g., outside of 80, 443, 53). Inner join the destination IP addresses from these connections with a high-confidence cyber threat intelligence (CTI) feed of known malicious C2 servers, updated at least daily. Investigate all resulting matches for associated host activity."
          },
          {
            "description": "Traffic on non-standard ports exhibiting characteristics of known C2 frameworks, such as specific JA3/JA3S hashes, SSL/TLS certificate details, or HTTP headers consistent with malicious tools.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze connections on non-standard ports identified in Zeek conn.log. Correlate with Zeek ssl.log and x509.log to identify traffic using SSL/TLS certificates with subjects/issuers matching known C2 framework defaults (e.g., Cobalt Strike, Metasploit). Hunt for specific JA3/JA3S client/server hashes known to be associated with malware. For HTTP/S traffic, analyze Zeek http.log for User-Agent strings, URI patterns, or other header values matching signatures of known C2 tools. Maintain and regularly update a library of these C2 patterns for correlation."
          },
          {
            "description": "Detection of protocol-port mismatches, where the dynamically identified protocol (e.g., SSL, HTTP, RDP) does not match the IANA-assigned service for that port, or where traffic on a common port is not the expected protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the `service` field in Zeek conn.log for every connection and compare the identified protocol against the destination port's standard assignment. Create alerts for significant mismatches (e.g., `service`='ssl' on port 80, `service`='http' on port 443, or any non-DNS protocol on port 53). Use correlation analysis to identify hosts with a high frequency or diversity of protocol-port mismatches over time. Calculate the entropy of the `service` field per host to find systems using an unusually diverse set of protocols for C2 tunneling."
          },
          {
            "description": "Anomalous process-port relationships, where a process initiates outbound communication on a non-standard port that deviates from its established baseline behavior or the established baseline for its host or peer group.",
            "data_sources": [
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 5156 (Network Connection) to capture the process name and destination port for all outbound connections. Establish a baseline of normal process-to-port mappings for hosts and user groups using descriptive statistics (frequency counts, sets of common ports). Identify outliers where a common process (e.g., svchost.exe, powershell.exe, rundll32.exe) communicates on a rare or previously unseen port for that process. Use linear regression to detect anomalous increases in connections on non-standard ports originating from specific processes. Correlate with process creation events (Event ID 4688) to examine the parent process and command line for further context."
          },
          {
            "description": "Outbound connections on non-standard ports exhibiting anomalous characteristics such as high-entropy data payloads, long connection durations with periodic 'heartbeat' traffic, or protocol anomalies flagged by network sensors.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log for sessions on non-standard ports. Use time series analysis to identify periodic, low-volume connections indicative of C2 heartbeats (e.g., every 60 seconds +/- jitter). Flag long-lived connections with unusual data transfer patterns (e.g., low-and-slow exfiltration). Calculate the byte-size entropy of connection payloads; high entropy can indicate encrypted or packed data often used in C2. Monitor Zeek's `weird.log` for any activity associated with these non-standard port connections, as these often point to protocol abuse. Correlate multiple weak signals (long duration, periodic traffic, high entropy, 'weird' flag) for a single connection to increase confidence of malicious activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]