[
  {
    "information_requirement": "Is the adversary communicating with C2 infrastructure using protocol tunneling?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1572",
        "name": "Protocol Tunneling",
        "evidence": [
          {
            "description": "Outbound connections or DNS queries to domains/IPs known to host C2 infrastructure that uses protocol tunneling.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join destination domains from Zeek dns.log and destination IPs from Zeek conn.log with a high-confidence, continuously updated threat intelligence feed of known C2 servers that leverage protocol tunneling (e.g., DNS tunneling, DoH, SSH tunneling). Alert on any confirmed matches and investigate the source host and connection characteristics."
          },
          {
            "description": "Execution of known tunneling tools or suspicious use of legitimate utilities (e.g., ssh) with command-line arguments indicative of tunneling.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events matching known tunneling tool names (e.g., 'plink.exe', 'chisel.exe', 'iodine.exe') or command-line arguments indicative of tunneling (e.g., `ssh -L`, `ssh -R`, `ssh -D`). Correlate these process events with outbound network connections in Zeek conn.log. Use Zeek ssh.log to identify SSH connections with active port forwarding rules (client_channels, server_channels). Maintain and update a list of tool names and command-line patterns for correlation analysis."
          },
          {
            "description": "DNS queries exhibiting structural patterns indicative of tunneling, such as unusually long subdomains, high query volume to a single domain, or abnormal use of non-standard query types (e.g., TXT, NULL).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek dns.log for DNS queries with abnormal characteristics. Calculate subdomain length and character entropy; flag queries exceeding statistical norms (e.g., > 95th percentile length or > 2 standard deviations from mean entropy). Count queries per client per second-level-domain; flag clients with unusually high query rates. Analyze the distribution of query types (A, AAAA, CNAME, TXT, etc.) per client-domain pair; flag unusual reliance on TXT or NULL records for communication. Use correlation analysis to link these patterns to a single host over time."
          },
          {
            "description": "Anomalous network traffic characteristics, such as unusual data transfer size ratios, periodic 'heartbeat' traffic within a legitimate protocol, or high-entropy data payloads inconsistent with the expected protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For common protocols (e.g., HTTPS, DNS), establish a baseline of normal traffic characteristics such as request/response size ratio, session duration, and connection frequency per host. Use time series analysis to detect periodic, low-volume connections indicative of C2 heartbeats. Calculate the entropy of payload data in Zeek conn.log for protocols expected to be plaintext; flag sessions with high entropy suggesting encrypted or obfuscated tunneled data. For TLS, monitor Zeek ssl.log for long-lived sessions with small, periodic data transfers, which is anomalous for typical web browsing."
          },
          {
            "description": "Legitimate system processes (e.g., svchost.exe, powershell.exe) or non-network-facing applications initiating suspicious outbound connections characteristic of tunneling.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create and maintain a baseline of normal network-communicating processes for different host roles (e.g., workstations, domain controllers, web servers). Monitor Windows Event IDs 4688 (Process Creation) and 5156 (Network Connection) to identify processes making outbound connections that deviate from this baseline (e.g., 'calc.exe' making a network connection). Pay special attention to legitimate processes like 'powershell.exe', 'rundll32.exe', or 'svchost.exe' connecting to unusual external IPs/ports or exhibiting heartbeat patterns identified in Zeek conn.log. Use frequency analysis and statistical profiling to identify anomalous process-network behavior."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]