[
  {
    "information_requirement": "Is the adversary leveraging compromised or malicious third-party web services against our network, indicating prior resource development?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.006",
        "name": "Web Services",
        "evidence": [
          {
            "description": "Connections from internal hosts to specific URLs, domains, or IP addresses hosted on legitimate web services (e.g., GitHub, Pastebin, Google Drive) that are identified by threat intelligence as malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously ingest high-confidence threat intelligence feeds containing known malicious URLs, domains, and file hashes associated with legitimate web services. Inner join network logs (Zeek conn.log for connections, http.log for host/URI, and ssl.log for Server Name Indication) against this intelligence. Alert on any matches and investigate the associated internal host for compromise."
          },
          {
            "description": "Downloads of files from common web services exhibiting suspicious patterns, such as executable content disguised with a benign extension, encoded PowerShell commands, or known malware stager file names.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek files.log to identify files downloaded from common web services (e.g., Dropbox, OneDrive, GitHub). Scan file content for mismatched extensions (e.g., a file named 'image.jpg' with a PE header) or known malware patterns. Use regular expressions on HTTP bodies (Zeek http.log) to search for patterns of encoded commands (e.g., 'powershell -enc'). Correlate file download events with subsequent process execution (Windows Event ID 4688) of the downloaded file on the endpoint. Flag any correlations involving suspicious file types or patterns."
          },
          {
            "description": "Anomalous data transfer patterns to or from common cloud storage or file sharing services (e.g., Dropbox, Google Drive, MEGA) that deviate significantly from established baselines for a user or host, suggesting C2 or data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish baselines of normal data transfer volume (bytes_in, bytes_out), connection frequency, and duration for each user/host to popular web services (identified by IP range or Zeek ssl.log SNI). Use time series analysis and descriptive statistics (mean, std dev, IQR & box-plots) to detect significant outliers. For example, a host suddenly uploading gigabytes to Dropbox when it normally uploads megabytes. Use correlation analysis to identify if multiple internal hosts start communicating with the same uncommon file sharing service simultaneously."
          },
          {
            "description": "Internal systems making unusual connections to code repositories or paste sites (e.g., GitHub, Pastebin, GitLab) to download raw files or scripts in a manner inconsistent with legitimate developer or system administrator activity.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor network traffic (Zeek http.log, ssl.log) for connections to domains such as 'raw.githubusercontent.com', 'pastebin.com/raw/', or 'gitlab.com/-/raw/'. Baseline this activity for developer groups. Flag connections from non-developer workstations or servers. Analyze the user-agent in Zeek http.log; non-browser user-agents (like PowerShell, curl, wget) downloading from these sites are highly suspicious. Use entropy measures on the downloaded content to spot obfuscated scripts. Correlate these download events with subsequent process creation (Windows Event ID 4688) on the endpoint to identify 'living off the land' script execution."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]