[
  {
    "information_requirement": "Is the adversary developing resources by compromising external servers?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.004",
        "name": "Server",
        "evidence": [
          {
            "description": "Outbound connections from internal systems to external servers whose IP addresses, domains, or SSL/TLS certificate details match high-confidence threat intelligence feeds for adversary infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join network logs (Zeek conn.log destination IPs, dns.log queried domains, x509.log certificate serial numbers/subjects) against multiple, continuously updated threat intelligence feeds identifying known C2 servers, phishing hosts, malware distribution points, or other adversary-controlled infrastructure. Automate this correlation to generate alerts on any matches and investigate the nature of the connection and the internal host involved."
          },
          {
            "description": "Network traffic from internal systems to external servers exhibiting patterns characteristic of known C2 frameworks or malware, such as specific JA3/JA3S hashes, HTTP User-Agents, or URI structures.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek ssl.log for client-side SSL/TLS fingerprints (JA3 hashes) that match a maintained list of those used by known C2 frameworks (e.g., Cobalt Strike, Metasploit, Empire). Analyze Zeek http.log for specific User-Agent strings or URI path patterns used by malware for C2 communications. Use regular expression matching and correlation analysis to link these patterns to specific internal hosts and external servers."
          },
          {
            "description": "Internal hosts establishing periodic, 'heartbeat-like' connections or transferring anomalous data volumes to external, non-categorized servers, indicative of C2 communication with adversary infrastructure.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each internal-to-external source-destination pair in Zeek conn.log, use time series analysis on connection logs to identify regularly timed connections (beaconing) by calculating the standard deviation, variance, or entropy of the time delta between connections. Separately, model expected data transfer sizes per session using descriptive statistics (mean, standard deviation) and flag significant outliers using IQR or Z-scores. Rank and investigate internal hosts exhibiting the most consistent beaconing or the largest data transfer anomalies to previously unknown servers."
          },
          {
            "description": "Outbound SSL/TLS connections to external servers using unusual certificate attributes (e.g., self-signed, short validity period, anomalous subject names) or non-standard cryptographic parameters that deviate from typical encrypted traffic.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile common SSL/TLS parameters across the network using Zeek ssl.log and x509.log to establish baselines for common certificate authorities, validity periods, and subject name patterns. Use frequency analysis and entropy measures to identify rare or anomalous certificate attributes (e.g., self-signed certificates for IPs not on an allow list, certificates with validity periods under 90 days, high-entropy subject names). Flag connections using these unusual certificates, as they are common on dynamically provisioned, adversary-controlled servers."
          },
          {
            "description": "An internal host communicates with a newly observed or suspicious external domain, followed shortly by the execution of suspicious processes (e.g., PowerShell, rundll32.exe) or further outbound C2-like network connections.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network events with host events in near real-time. Identify internal hosts resolving and connecting to newly seen or low-reputation domains (from Zeek dns.log/conn.log). Monitor these specific hosts for subsequent process creation events (Windows Event ID 4688) within a short time window (e.g., 1-5 minutes). Analyze command-line arguments of spawned processes for suspicious activity such as obfuscation, non-interactive execution flags, or download cradles. A linear regression model could test the correlation between connections to rare domains and the rate of suspicious process creation across the enterprise."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]