[
  {
    "information_requirement": "Is the adversary developing resources by acquiring or creating email accounts?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.002",
        "name": "Email Accounts",
        "evidence": [
          {
            "description": "Inbound emails received from sender addresses or domains, or containing links/attachments pointing to domains/IPs, that are present on high-confidence threat intelligence feeds.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate metadata from Zeek smtp.log (sender address, sender domain, source IP) and links/domains extracted from email bodies (via Zeek http.log for clicked links) against a CTI feed of known malicious indicators for phishing or malware distribution. Analyze hashes of files transferred via SMTP (from Zeek files.log) against malware hash repositories. Alert on any confirmed matches."
          },
          {
            "description": "DNS requests for or emails received from domains exhibiting typosquatting, combosquatting, or other suspicious naming conventions designed to impersonate the organization or its trusted third-party services.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Generate a list of permutations of the organization's primary domains (e.g., using typosquatting, combosquatting, different TLDs). Monitor Zeek dns.log for internal DNS requests to these generated domains and Zeek smtp.log for inbound emails from them. Use regular expressions and string similarity algorithms (e.g., Levenshtein distance) to compare all newly observed sender and link domains against a list of legitimate company and partner domains. Flag domains with high similarity that are not on an organizational allowlist for further investigation."
          },
          {
            "description": "Inbound emails originating from newly observed domains or domains with very low reputation or recent creation dates, especially when sent to multiple high-value targets within the organization.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a baseline of known, legitimate sender domains based on historical Zeek smtp.log data. Monitor for emails from sender domains not present in the baseline. For each new domain, perform automated enrichment (e.g., WHOIS lookup for creation date, passive DNS for reputation). Use time series analysis to detect spikes in emails from new or low-reputation domains. Correlate with the number and roles of internal recipients to prioritize suspected spearphishing campaigns that target multiple executives or privileged users."
          },
          {
            "description": "Anomalous outbound network connections from internal endpoints to multiple free or disposable email providers, especially if exhibiting automated patterns indicative of bulk account creation.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a list of known free and disposable email service domains. Monitor Zeek dns.log and conn.log for outbound connections to these services. Use descriptive statistics to establish a baseline of normal access frequency per host or user. Flag hosts that connect to an unusually high number of different email providers in a short timeframe. Analyze Zeek http.log for repetitive POST requests to account creation endpoints, a pattern suggesting automated signup scripts. Use correlation analysis to find multiple internal hosts exhibiting similar behavior simultaneously, which may indicate a compromised host being used for resource development."
          },
          {
            "description": "Anomalous successful login activity to the organization's own email services (e.g., O365, GSuite via ADFS) from external IPs exhibiting suspicious characteristics, such as impossible travel or access from known anonymizing services.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor successful authentication events (e.g., Windows Event ID 4624 from ADFS servers) for corporate email services. Enrich login events with IP geolocation and reputation data from Zeek conn.log. Implement 'impossible travel' detection by correlating login timestamps and geolocations for individual accounts. Use frequency analysis and baselining to detect users logging in from rare geolocations or IP addresses associated with data centers, VPNs, or TOR exit nodes, which are uncharacteristic for that user. Use box-plots to identify outliers in user login locations."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]