[
  {
    "information_requirement": "Has the adversary utilized resources developed (e.g., serverless functions) against the network?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.007",
        "name": "Serverless",
        "evidence": [
          {
            "description": "Connections from internal hosts to specific serverless function URLs, domains, or associated IP addresses identified as malicious by threat intelligence feeds.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join network logs with a high-confidence, continuously updated threat intelligence feed of known malicious serverless endpoints, domains, and IP addresses. Specifically, check DNS queries in Zeek dns.log, Host headers in Zeek http.log, and destination IPs in Zeek conn.log. Alert on any matches and investigate the associated internal host for compromise."
          },
          {
            "description": "Network traffic to serverless domains containing specific URI path structures, query parameters, or User-Agent strings matching patterns of known C2 frameworks that leverage serverless infrastructure.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Use regular expression matching on Zeek http.log data (URI, User-Agent, request/response bodies) to find patterns known to be used by malware or C2 frameworks (e.g., Sliver, Covenant) when configured with serverless redirectors. Additionally, analyze Zeek ssl.log for JA3/JA3S hashes or SNI values that match the signatures of known C2 toolkits. Maintain and regularly update a list of these C2 patterns."
          },
          {
            "description": "Repetitive, periodic network connections (beacons) from an internal host to a single or small group of serverless function domains, characterized by regular intervals and similar data sizes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For connections to known serverless domains (e.g., *.lambda-url.*.on.aws, *.workers.dev), analyze connection metadata from Zeek conn.log. Use time series analysis to calculate the inter-arrival time between connections from each internal source to an external destination. Identify connections with very low variance in inter-arrival times (beaconing) or pseudo-random intervals (jittered beaconing). Use descriptive statistics on sent/received byte counts to find sessions with consistently small, similar payloads, which is characteristic of C2 heartbeats. Flag hosts exhibiting this behavior."
          },
          {
            "description": "Outbound network connections to known serverless domains originating from unauthorized processes, processes executing from unusual file paths, or without a legitimate parent process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network connections to serverless domains (from Zeek conn.log or Windows Event ID 5156) with the originating process information on the host (Windows Event ID 4688). Establish a baseline of normal applications (e.g., browsers, developer tools) that communicate with these services. Flag connections originating from unexpected processes (e.g., svchost.exe, powershell.exe, documents folder executables) or processes with suspicious command-line arguments. Use frequency analysis to identify rare or new processes making such connections."
          },
          {
            "description": "A sequence of activity where a connection to a serverless domain is immediately followed by discovery, lateral movement, or data staging from the same internal host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define a hunting hypothesis that an initial connection to a serverless function acts as a C2 channel to receive instructions. Monitor for outbound connections to serverless domains (Zeek conn.log, http.log) and use correlation analysis to link this activity to subsequent suspicious behavior from the same source IP within a short time window (e.g., 5 minutes). Suspicious follow-on activity includes internal network scanning (multiple connections to different IPs on common ports), failed remote logins to other hosts (Windows Event ID 4624, Type 3), or the execution of discovery commands (via command line logging in Windows Event ID 4688)."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]