[
  {
    "information_requirement": "Is the adversary developing resources using Artificial Intelligence to support future operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.007",
        "name": "Artificial Intelligence",
        "evidence": [
          {
            "description": "An internal host communicates with a network indicator (IP, domain) or receives an email from a sender identified by threat intelligence as part of a campaign leveraging AI-generated content.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek smtp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Email Gateway, DNS Resolvers",
            "action": "Continuously match destination IPs from Zeek conn.log, DNS queries from Zeek dns.log, and sender domains from Zeek smtp.log against a threat intelligence feed specifically curated for indicators from AI-driven campaigns; generate an alert upon any match. For all domains queried in Zeek dns.log, calculate the domain age and track the percentile of connections going to domains younger than 30 days; an unusual increase, such as exceeding the 95th percentile of the daily count over a 90-day baseline, should be investigated. Use a classification model trained on email headers and body content to score incoming emails for the likelihood of being AI-generated phishing; a score exceeding a predefined threshold indicates a high-probability AI-generated phish."
          },
          {
            "description": "A script executed on a host or transferred over the network contains structural patterns, function calls, or comments that are characteristic of AI code generation tools.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Development Environments",
            "action": "Deploy and monitor YARA rules designed to detect artifacts of AI code generators (e.g., 'Generated by...', unique variable naming schemes) in scripts captured via Windows Event ID 4104 and Zeek files.log, alerting on any match. For each script block from Windows Event ID 4104, calculate the abstract syntax tree (AST) complexity and comment-to-code ratio; flag scripts where these metrics exceed the 98th percentile of the established baseline. Utilize a pre-trained NLP transformer model, fine-tuned on a dataset of human vs. AI-generated malicious code, to classify script content and flag those with a high probability of being AI-generated."
          },
          {
            "description": "An internal host resolves or connects to a domain whose name exhibits algorithmically generated characteristics (e.g., high entropy, dictionary word combinations) and has a short lifespan or low reputation.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Resolvers, Web Proxy, Internet Gateway",
            "action": "Create a watchlist of suspicious Top-Level Domains (TLDs) and alert when a DNS query (Zeek dns.log) is made for a domain on this TLD list that was also registered within the last 30 days. For every new domain in Zeek dns.log, calculate the character-level entropy of the domain name and flag any domain whose entropy score falls in the top or bottom 5% of the baseline distribution. Implement a time-series anomaly detection model (e.g., ARIMA) on the volume of DNS queries per domain to identify 'flash-in-the-pan' domains that receive a sudden burst of queries and then disappear, consistent with automated malicious infrastructure."
          },
          {
            "description": "A script is executed on a host with a high degree of obfuscation, characterized by high entropy, polymorphic structures, or layering techniques not typical of legitimate administrative scripts.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Critical Servers",
            "action": "Scan PowerShell script blocks from Windows Event ID 4104 for common obfuscation keywords and patterns (e.g., '-encodedcommand', 'IEX', 'FromBase64String'), flagging scripts with multiple layers of such indicators. Calculate the Gzip compression ratio and character frequency distribution for all script blocks; flag any script whose compression ratio falls below the 5th percentile of the baseline for legitimate scripts, as this indicates high entropy. Train a classifier on script features to distinguish between benign and malicious obfuscation, using the model to score script executions and flag high-scoring events."
          },
          {
            "description": "A cluster of file creation, modification, and execution events for scripts or binaries occurs on a single host within a short time window, where filenames appear algorithmically generated.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Development Servers, User Workstations, Build Systems",
            "action": "Create a rule that triggers when a single process (Sysmon Event ID 1) creates more than 10 script or executable files (.exe, .ps1, .py) within a 5-minute window (Sysmon Event ID 11). For each host, track the rate of file creation events where the filename has high entropy (e.g., > 3.5 bits/character); alert if the current rate exceeds 3 standard deviations above the moving average. Use a clustering algorithm (e.g., DBSCAN) on file system and process events, grouped by host and time, to identify dense clusters of activity involving high-entropy filenames and a suspicious parent process."
          },
          {
            "description": "An internal host exhibits automated, non-human browsing behavior, characterized by a high rate of requests to diverse public information sources (e.g., search engines, code repositories, paste sites) with programmatically generated query parameters.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Web Proxy, User Subnets",
            "action": "Alert when a non-browser user-agent (e.g., Python-urllib, curl) is observed in Zeek http.log making more than 100 requests to search engines or code repositories from a single source IP within an hour. For each source IP, calculate the Shannon entropy of URI query parameters (Zeek http.log) and Server Name Indication (Zeek ssl.log); flag hosts where the average entropy for a 10-minute window exceeds the 99th percentile of their historical behavior. Develop a time-series model to analyze inter-request timing for each source IP, using it to detect machine-like, periodic request intervals that deviate from normal human browsing patterns."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]