[
  {
    "information_requirement": "Is the adversary developing resources (e.g., servers) for use in operations against us?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource-Development",
    "indicators": [
      {
        "technique_id": "T1583.004",
        "name": "Server",
        "evidence": [
          {
            "description": "Internal connections to external IP addresses or domains identified as malicious C2 or phishing infrastructure by high-confidence threat intelligence.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously ingest threat intelligence feeds identifying known adversary C2 servers, phishing domains, and malware distribution points. Perform an inner join between internal network logs (Zeek conn.log destination IPs, Zeek dns.log queried domains) and the threat intelligence data, updated at least daily. Alert on any matches and investigate the source host for signs of compromise."
          },
          {
            "description": "Internal connections to external servers presenting SSL/TLS certificates, JA3/JA3S hashes, or server headers with characteristics matching known C2 frameworks or malware.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek ssl.log for connections to external IPs where the presented SSL certificate contains default, self-signed, or specific subject/issuer/serial number details known to be used by C2 frameworks (e.g., Cobalt Strike, Metasploit, PoshC2). Correlate JA3/JA3S hashes from ssl.log against lists of known malicious hashes. Scan Zeek http.log for unusual server headers or response bodies that are signatures for C2 kits. Maintain and use a library of these C2 patterns for regular expression matching."
          },
          {
            "description": "First-ever observed connections from any internal host to an external domain or IP address, particularly those with high-risk characteristics such as recent registration or low reputation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a historical baseline (e.g., 90-day rolling window) of all external domains and IPs contacted by the enterprise network. Enrich Zeek dns.log and conn.log data with external WHOIS and domain reputation information. Identify and alert on connections to 'young' domains (e.g., registered < 60 days ago) or any domain/IP making its first appearance in the logs. Use correlation analysis to prioritize alerts for first-seen destinations that are also young, have low/no reputation, or are hosted on unusual Autonomous System Numbers (ASNs)."
          },
          {
            "description": "An unusual spike in DNS queries for a specific external domain across the enterprise, especially for a domain that resolves to a newly observed IP address.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate all DNS queries from Zeek dns.log and analyze the frequency of queries per domain over time. Use time series analysis (e.g., moving averages, exponential smoothing) to detect statistically significant spikes in query volume for any single domain, which could indicate widespread malware activation. Cross-reference the domain with historical connection data (Zeek conn.log) to confirm if the resolved IP is new to the network. Investigate the internal hosts responsible for the spike in queries."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]