[
  {
    "information_requirement": "Is the adversary developing resources, such as compromised DNS servers, for use in operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.002",
        "name": "DNS Server",
        "evidence": [
          {
            "description": "DNS resolutions pointing to known malicious IPs, or management access attempts to internal DNS servers from known malicious sources.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join IP addresses from DNS responses (in Zeek dns.log answers field) and source IPs of connection attempts to DNS server management ports (in Zeek conn.log and Windows Event IDs 4624/4625) against a high-confidence threat intelligence feed of known malicious IPs. Alert on any matches to detect both the use of malicious DNS infrastructure and direct attacks against owned DNS servers."
          },
          {
            "description": "Observed DNS zone transfer attempts (AXFR queries) from unauthorized IP addresses, or traffic patterns matching known exploits for DNS server vulnerabilities.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek dns.log for any DNS queries of type 'AXFR' originating from IPs not on an approved list of secondary DNS servers or administrative hosts. Separately, monitor Zeek conn.log for traffic to DNS servers containing signatures or patterns associated with known exploits for common DNS software (e.g., BIND, Microsoft DNS). Correlate any such attempts with other suspicious activity from the source IP."
          },
          {
            "description": "Anomalous administrative activity on an internal DNS server, such as logins from unusual geolocations or the DNS service process spawning unexpected child processes.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal administrative access patterns for DNS servers. Monitor Windows Event ID 4624 for successful logins, geolocate source IPs, and alert on logins from new or statistically rare countries/regions using frequency analysis. Monitor Windows Event ID 4688 for the DNS server process (dns.exe) spawning child processes like 'cmd.exe', 'powershell.exe', or any unrecognized executable, indicating potential command execution. Correlate with anomalous outbound network connections (Zeek conn.log) from the DNS server."
          },
          {
            "description": "Widespread and anomalous resolution of legitimate, high-reputation external domains to unexpected IP addresses across multiple internal clients, indicating DNS hijacking or cache poisoning.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For high-reputation domains (e.g., Office 365, Google, major CDNs), maintain a baseline of historically observed, legitimate IP address resolutions and their associated ASNs. Monitor Zeek dns.log to detect when a significant number of clients begin resolving one of these domains to a new IP outside the expected set or ASN. Use descriptive statistics to flag when a large percentage of clients resolve a domain to a single anomalous IP. Calculate the entropy of resolved IPs for a given domain over time; a sudden drop in entropy to a single new IP is highly suspicious."
          },
          {
            "description": "Internal systems making DNS queries for newly registered domains (NRDs) or domains with high-entropy names that resolve to low-reputation IP addresses.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek dns.log queries by enriching them with external data. Identify queries for domains registered within the last 30-60 days (NRDs) or domains with high character entropy (indicative of Domain Generation Algorithms). For these queries, check the reputation of the resolved IP address. Use correlation analysis to create high-fidelity alerts for events where a newly registered or high-entropy domain resolves to an IP that is also newly observed, has a bad reputation, or belongs to a suspicious ASN. Use time series analysis to detect spikes in queries to such domains."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]