[
  {
    "information_requirement": "Is the adversary developing resources using cloud accounts?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.003",
        "name": "Cloud Accounts",
        "evidence": [
          {
            "description": "DNS queries or network connections from internal hosts to domains of known disposable email providers, immediately followed by connections to cloud provider account creation pages.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a list of domains associated with disposable or temporary email services (selectors). Monitor Zeek dns.log for queries to these domains. Correlate events by source IP to identify subsequent connections (from Zeek http.log or conn.log) to known cloud provider account creation or signup URLs within a short time window (e.g., 5-10 minutes). This sequence strongly suggests the use of a throwaway email for cloud account registration."
          },
          {
            "description": "Automated or scripted interaction with cloud provider APIs for resource creation (e.g., provisioning VMs, storage buckets) indicated by specific User-Agents or API call patterns, originating from hosts not designated for infrastructure management.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for POST/PUT requests to cloud provider API endpoints associated with resource provisioning (e.g., URLs containing '/instances', '/buckets', '/virtualMachines'). Identify common programmatic User-Agents (e.g., 'Terraform/', 'Boto3', 'Python-requests', 'Go-http-client'). Correlate this activity with an inventory of authorized infrastructure-as-code servers and developer workstations. Flag any such API usage patterns originating from unauthorized internal systems, especially user workstations."
          },
          {
            "description": "Anomalous access from an internal host to cloud provider account creation, billing, or identity management web pages/APIs, deviating from established baselines of legitimate administrative activity.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "First, build and maintain an inventory of authorized users/systems that perform cloud administration. For all other internal hosts, any access to cloud management infrastructure is suspicious. For all hosts, monitor Zeek dns.log and http.log for connections to URLs/domains associated with cloud provider signup, account management, IAM roles, or billing pages. Use time series analysis to detect anomalous spikes in the frequency of this activity or access at unusual times. Calculate the entropy of accessed cloud services per user; a sudden increase may indicate exploratory resource development activity."
          },
          {
            "description": "An internal host making connections to multiple distinct cloud service providers (e.g., AWS, Azure, GCP, DigitalOcean) for account management or resource provisioning within a short time frame.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain lists of domains and IP ranges for major cloud service providers. Monitor Zeek dns.log and conn.log for connections from internal hosts to these providers. For each internal host, track the number of distinct cloud providers contacted within a rolling time window (e.g., 1 hour). Use descriptive statistics to establish a baseline for distinct providers contacted per host or user role. Flag hosts that contact an unusually high number of providers (e.g., >3), especially if the traffic targets account creation or API management endpoints. This behavior can indicate an adversary 'comparison shopping' for resources or spreading infrastructure across providers to evade detection."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]