[
  {
    "information_requirement": "Is the adversary leveraging newly acquired or fingerprinted infrastructure for command and control against our network? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583",
        "name": "Acquire Infrastructure",
        "evidence": [
          {
            "description": "A network connection is established where the destination IP address, domain, or the observed SSL/TLS certificate hash has a direct match in a high-confidence threat intelligence feed specifically tracking adversary-acquired infrastructure (e.g., C2 servers, proxy services, newly registered malicious domains).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise network egress points, Forward and reverse web proxies, Internal DNS resolvers",
            "action": "1. (Symbolic) Continuously match destination IPs from Zeek conn.log, resolved domains from Zeek dns.log, and certificate SHA1 hashes from Zeek ssl.log against a curated list of known malicious infrastructure IOCs. Generate a high-priority alert upon any match. 2. (Statistical) For any matched IOC, calculate the frequency of connections from distinct internal source IPs. A high count (e.g., > 95th percentile of all external connections from the last 24 hours) from multiple internal hosts to the same malicious indicator suggests widespread activity and should escalate the alert priority. 3. (ML) Use a classification model (e.g., logistic regression) trained on labeled threat intelligence data to assign a risk score to every outbound connection based on features like IP reputation, domain age, ASN, and certificate attributes. Connections exceeding a predefined risk threshold are flagged for investigation, even without a direct IOC match."
          },
          {
            "description": "An outbound SSL/TLS session is observed with a JA3 or JA3S hash that matches a known malicious C2 framework, or it uses a self-signed certificate whose subject/issuer fields match default values from known adversary tools.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise network egress points, SSL/TLS inspection points, Demilitarized Zone (DMZ) servers",
            "action": "1. (Symbolic) Maintain and query a watchlist of known malicious JA3/JA3S hashes and default C2 certificate attributes (e.g., common names like 'localhost', organizational units like 'Acme Corp') against Zeek ssl.log and Zeek x509.log records. Generate an alert upon any match. 2. (Statistical) For all outbound SSL/TLS connections, calculate the population entropy of JA3 hashes observed per hour. A sudden decrease in entropy or a spike in the frequency of a previously rare JA3 hash indicates a potential new C2 channel. Flag any JA3 hash whose hourly count exceeds 3 standard deviations from its 30-day moving average. 3. (ML) Use an unsupervised clustering algorithm (e.g., DBSCAN) on SSL/TLS session features (JA3 hash, certificate validity period, issuer, cipher suite, destination port). Analyze clusters of traffic that do not group with known-good application traffic to identify anomalous C2-like communication patterns."
          },
          {
            "description": "One or more internal hosts initiate connections to an external domain registered within the last 30 days, and the connection volume or number of unique internal clients connecting to it is statistically anomalous compared to other newly registered domains (NRDs).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Enterprise network egress points, Domain registration data feeds",
            "action": "1. (Symbolic) Enrich Zeek dns.log records with domain registration dates from an integrated WHOIS or NRD intelligence feed. Create a rule to flag all connections to domains registered within the last 30 days that also use WHOIS privacy services or are hosted on ASNs known for malicious activity. 2. (Statistical) For the subset of domains identified as NRDs, establish a baseline and calculate the 99th percentile for the number of unique internal clients connecting and total bytes transferred per day. Alert on any NRD that exceeds these thresholds. 3. (ML) Develop a time series forecast model (e.g., ARIMA) for the daily count of new NRDs being accessed across the enterprise. Generate an alert if the observed count significantly exceeds the forecasted count's confidence interval, indicating a potential coordinated campaign leveraging new infrastructure."
          },
          {
            "description": "An outbound network connection, initiated by a non-browser process on an endpoint, communicates with an external IP address over a non-standard port or exhibits a periodic, 'heartbeat'-like traffic pattern with small, fixed-size data transfers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (workstations and servers), Network egress points, Cloud provider network boundaries",
            "action": "1. (Symbolic) On endpoints, correlate Windows Event ID 5156 (network connection) with its initiating process ID and command line from Windows Event ID 4688. Alert if a non-browser process (e.g., powershell.exe, wscript.exe, or a binary running from %APPDATA% or %TEMP%) initiates an outbound connection. 2. (Statistical) For each source-destination IP pair in Zeek conn.log, analyze the inter-arrival time and byte size of connections over a 1-hour window. Calculate the standard deviation of these metrics. A standard deviation near zero for both metrics indicates a highly regular, beaconing-like pattern. Flag connections where both values are below the 5th percentile for all external connections. 3. (ML) Train an autoencoder on features from known-good network traffic (process name, destination port, ASN, connection duration, bytes transferred). Apply this model to all new outbound connections; connections with a high reconstruction error are flagged as anomalous and likely C2 activity."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]