[
  {
    "information_requirement": "Is the adversary developing resources (exploits) for targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1587.004",
        "name": "Exploits",
        "evidence": [
          {
            "description": "Observed communication with adversary infrastructure known to be associated with exploit development, testing, or hosting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Ingest and correlate external Cyber Threat Intelligence (CTI) feeds containing IOCs (IPs, domains) of known adversary exploit development or testing infrastructure. Continuously scan Zeek conn.log and dns.log for any communication attempts to or from these IOCs. Use correlation analysis to link CTI hits with specific internal assets being targeted and prioritize CTI related to vulnerabilities present in the organization's technology stack. Investigate all confirmed matches."
          },
          {
            "description": "Network traffic containing specific signatures, User-Agents, or URI patterns associated with common vulnerability scanners or exploit development frameworks targeting public-facing services.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create and maintain a list of regular expressions and signatures for common vulnerability scanning tools (e.g., Nessus, Acunetix, Nmap scripting engine) and exploit frameworks (e.g., Metasploit). Scan Zeek http.log for matching User-Agent strings or URI patterns. Inspect payloads in Zeek conn.log (if feasible) for byte patterns characteristic of these tools. Alert on matches originating from external, unexpected IP addresses, especially if they are targeting recently disclosed vulnerabilities."
          },
          {
            "description": "Anomalous increase in scanning or probing activity against public-facing systems, particularly targeting services with recently disclosed vulnerabilities.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for broad (horizontal) and deep (vertical) scanning patterns against public-facing assets. Use time series analysis on connection counts per port to detect unusual spikes. Calculate the entropy of destination ports for a given source IP; a high entropy may indicate a horizontal scan. Calculate the frequency of connections from a source IP to a single destination port; a high frequency may indicate a vertical scan or focused probe. Establish baselines and use statistical methods (e.g., IQR, Z-score) to flag significant deviations from normal traffic patterns, indicating potential exploit development reconnaissance."
          },
          {
            "description": "Targeted connection attempts to known vulnerable ports or services exhibiting unusual session characteristics inconsistent with legitimate traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek conn.log for external connections to services/ports associated with recently disclosed, high-severity vulnerabilities. For these filtered connections, perform a comparative analysis of session characteristics (duration, bytes transferred, TCP flags) against a baseline of normal traffic to the same service. Use regression models or clustering (e.g., k-means) to identify outlier connections. Look for patterns like 'connect-transfer-RST' which may indicate a one-shot exploit test. Correlate with Zeek http.log for malformed requests or unusual server error codes."
          },
          {
            "description": "Application crashes, service failures, or unexpected reboots on public-facing servers that are temporally correlated with suspicious external network activity.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 1001",
              "Windows Event ID 1074",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event Logs on public-facing servers for events indicating application crashes (Event ID 1000, 1001), service failures, or unexpected system reboots (Event ID 1074). Correlate the timestamps of these instability events (within a narrow time window, e.g., 1-5 minutes) with Zeek conn.log records showing external network connections to the affected server. Use statistical correlation analysis to identify external source IPs that are significantly associated with subsequent system instability, indicating potential failed exploit attempts during development."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]