[
  {
    "information_requirement": "Is the adversary developing resources related to digital certificates for future operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1587.003",
        "name": "Digital Certificates",
        "evidence": [
          {
            "description": "Network communication involves a digital certificate whose SHA1 hash, serial number, or issuer common name matches a known malicious indicator from an external threat intelligence feed.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, web proxies, and mail gateways where TLS inspection is performed.",
            "action": "1. (Symbolic) Continuously ingest Zeek ssl.log data. For each observed certificate, compare its SHA1 hash, serial number, and issuer common name against high-confidence threat intelligence blocklists of known malicious C2 certificates or compromised CAs. Generate a high-priority alert for any exact match. 2. (Statistical) For issuers that match threat intelligence, calculate the frequency of their appearance on the network. Flag issuers that are rare overall but appear in conjunction with other suspicious activity (e.g., connections to low-reputation IPs from Zeek conn.log) as potential private CAs used by an adversary. 3. (Machine Learning) Train a classification model (e.g., Random Forest) on features from threat intelligence feeds (certificate attributes, issuer reputation, associated domains) to predict if a newly observed, non-matching certificate is malicious. Use this model to score certificates that do not have an exact IOC match, alerting on those with a high probability score."
          },
          {
            "description": "A digital certificate's subject name contains typosquatted variations of internal domains or well-known brands, is self-signed ('issuer' field matches 'subject' field), or is issued by a free Certificate Authority for a newly registered domain.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek dns.log",
              "Microsoft-Windows-CAPI2/Operational Event Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, and all enterprise Windows endpoints.",
            "action": "1. (Symbolic) Parse subject common names (CN) and subject alternative names (SAN) from Zeek ssl.log. Use regular expressions to flag certificates that are self-signed (`issuer` == `subject`) or are associated with dynamic DNS providers. Alert if a self-signed certificate is added to a local trust store by cross-referencing CAPI2 Event ID 41. 2. (Statistical) For all domains in CN/SAN, calculate the Levenshtein distance to a list of internal and high-value external domains. Flag domains with a small edit distance (e.g., < 3) as potential typosquatting. Correlate certificates from free CAs (e.g., Let's Encrypt) with domain age from passive DNS (Zeek dns.log) and flag those where the domain age is in the bottom 5th percentile of all observed domains. 3. (Machine Learning) Use a time-series model on DNS query logs (Zeek dns.log) to forecast expected query volumes for domains. A sudden, unforecasted spike in queries to a new, low-reputation domain that uses a free or self-signed certificate should be flagged as an anomaly."
          },
          {
            "description": "An observed digital certificate exhibits statistically anomalous attributes, such as high-entropy subject or issuer fields suggesting algorithmic generation, or an unusually short (<10 days) or long (>825 days) validity period compared to a baseline of legitimate certificates.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and web proxies where TLS traffic is visible.",
            "action": "1. (Symbolic) Create a rule to flag any certificate where the validity period is less than 10 days or greater than 825 days, as these are common deviations from standard practices for public-facing services. 2. (Statistical) Establish a statistical baseline of certificate properties from historical Zeek ssl.log data. For each new certificate, calculate the Shannon entropy of the subject CN and issuer fields, and the duration of the validity period. Use a z-score or the Inter-Quartile Range (IQR) method to identify outliers that deviate more than 3 standard deviations from the established norm. 3. (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) on a feature vector of certificate attributes (entropy, validity period, key length, number of SANs). This will group 'normal' certificates together. Investigate small clusters or points classified as noise, as these represent certificates that do not conform to common profiles and may be adversarial."
          },
          {
            "description": "A single, non-standard digital certificate (identified by its SHA1 hash) is presented by multiple, geographically or logically disparate external IP addresses or Server Name Indications (SNIs).",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and any device performing network flow monitoring.",
            "action": "1. (Symbolic) For any certificate flagged as non-standard (e.g., self-signed, short validity, high entropy), create a watchlist of its SHA1 hash. Alert if this hash is seen in ssl.log associated with more than a threshold of distinct destination IPs (e.g., >3 in different /24 subnets) within a 24-hour period. 2. (Statistical) For each certificate SHA1 hash, build a set of associated server IPs (`id.resp_h` from conn.log) and SNIs (`server_name` from ssl.log). Flag certificates where the count of unique IPs/SNIs exceeds the 99th percentile of all observed certificates, indicating widespread use characteristic of C2 infrastructure. 3. (Machine Learning) Model certificate usage as a graph where nodes are certificates, IPs, and SNIs. Apply community detection algorithms to find clusters of related infrastructure. A single certificate node with edges to many disparate IP/SNI nodes that are not otherwise connected represents a high-confidence indicator of an adversary's shared C2 infrastructure."
          },
          {
            "description": "A TLS connection is established where the domain's registration date (from passive DNS) and the certificate's issuance date ('not_valid_before' field) are both recent (e.g., within the last 30 days) and temporally close to each other (e.g., within 24 hours).",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, and threat intelligence platforms.",
            "action": "1. (Symbolic) For each `server_name` in `ssl.log`, query passive DNS (from `dns.log` history or external feeds) for its first-seen date. Create a rule to alert if a connection is made to a domain first seen within the last 7 days AND the certificate's `not_valid_before` date is also within the last 7 days. 2. (Statistical) Calculate the time delta in days between a domain's first-seen date and its certificate's `not_valid_before` date. Create a distribution of these deltas across all network traffic. Flag connections where this delta falls into the bottom 1st percentile (e.g., less than 1 day), as this 'just-in-time' provisioning is highly suspicious. 3. (Machine Learning) Train a time-series forecasting model (e.g., ARIMA) on the daily count of newly registered domains observed on the network. A sudden, anomalous spike in the number of new domains that exceeds the model's forecast, especially when correlated with a spike in new certificates from free CAs, can indicate a large-scale adversary campaign being stood up."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]