[
  {
    "information_requirement": "Is the adversary developing resources or capabilities to support their attack?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1587",
        "name": "Develop Capabilities",
        "evidence": [
          {
            "description": "Execution of a file whose hash matches a newly identified malware sample, or a network connection to an IP/domain recently attributed to adversary malware staging or C2 infrastructure.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously ingest threat intelligence feeds containing file hashes of newly discovered malware samples and indicators (IPs, domains) of adversary staging or C2 infrastructure. Correlate file creation/execution events (from EDR or by analyzing hashes from Zeek files.log) against the malware hash list. Inner join network connection logs (Zeek conn.log) against the malicious infrastructure list. An alert on a match represents the first observation of this new capability in the environment."
          },
          {
            "description": "Network traffic exhibiting unique TLS/SSL fingerprints (JA3/JA3S) not associated with common applications, or execution of an unsigned binary followed by suspicious network communications.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek ssl.log to calculate JA3 and JA3S fingerprints for all TLS connections and maintain a baseline of common fingerprints from legitimate applications. Flag connections with rare or never-before-seen JA3/JA3S hashes, which can indicate a custom-developed tool. Separately, monitor process creation events (Windows Event ID 4688) for binaries that are not digitally signed and correlate their execution with subsequent network connections (Zeek conn.log) to external, low-reputation, or newly seen domains. This sequence pattern (unsigned binary -> suspicious network call) is a strong indicator of a custom-developed tool."
          },
          {
            "description": "A newly observed process exhibits a sequence of suspicious behaviors, such as writing a file to disk, creating a persistence mechanism, and then establishing an external network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 11",
              "Windows Event ID 4698",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Use frequency analysis on process names and their hashes (from Event ID 4688) to identify processes seen for the first time in the environment. For these new processes, monitor for a chain of subsequent events within a short time window (e.g., 5 minutes): file creation (Event ID 11), creation of a scheduled task or service (Event ID 4698), and a network connection to an external IP (Zeek conn.log). Correlate these events based on Process ID/GUID and timestamp. This behavioral sequence is a strong indicator of the first execution of newly developed malware."
          },
          {
            "description": "A host initiates connections to an external destination (IP or domain) that is statistically rare or has no traffic history across the entire enterprise, especially if the traffic exhibits beaconing or large data transfer characteristics.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a long-term baseline (e.g., 30-90 days) of all queried domains (from Zeek dns.log) and destination IPs (from Zeek conn.log) across the enterprise. Identify connections to domains or IPs seen for the first time ('zero-day' domains/IPs). For these new destinations, analyze connection patterns for signs of C2 (e.g., periodic connections with similar byte sizes using time series analysis) or data staging/exfiltration (large, sustained uploads identified via descriptive statistics on byte counts). Use correlation analysis to determine how many internal hosts are communicating with the new destination."
          },
          {
            "description": "Network connections utilize self-signed or newly registered TLS certificates with low-entropy subjects or issuers, pointing to hastily created infrastructure for a new tool.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously analyze Zeek ssl.log for all TLS handshakes. Flag certificates that are self-signed or whose 'valid_not_before' date is very recent (e.g., within the last 7 days). Calculate the character entropy of the certificate's subject and issuer fields; low entropy can indicate auto-generated, non-descriptive names often used for custom tools. Use frequency analysis to identify certificate issuers, serial numbers, or subject attributes that are statistical outliers in the environment and investigate the associated connections in Zeek conn.log."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]