[
  {
    "information_requirement": "Is the adversary developing resources using compromised third-party network devices?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.008",
        "name": "Network Devices",
        "evidence": [
          {
            "description": "A direct inbound or outbound network connection is established between an internal asset and an external IP address present on a threat intelligence feed specifically tracking compromised network devices (e.g., botnets, proxies).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Firewall Logs, Network Taps",
            "action": "1. (Symbolic) Continuously correlate all source and destination IPs from Zeek conn.log against a high-confidence threat intelligence feed of known compromised network devices. Generate a high-priority alert for any matched connection. 2. (Statistical) For any matched connection, calculate the percentile rank of the connection's duration and total bytes compared to the internal host's 30-day baseline for all external connections. Flag connections where both metrics exceed the 95th percentile as potentially significant activity. 3. (Machine Learning) Train a time-series forecasting model (e.g., SARIMA) on the daily volume of traffic to known malicious infrastructure categories (proxies, botnets). Generate an alert when the observed traffic volume significantly exceeds the forecasted volume's confidence interval, indicating a potential large-scale interaction."
          },
          {
            "description": "An outbound network connection exhibits multiple signatures associated with malware commonly deployed on SOHO routers, such as a specific JA3/S hash, a non-browser User-Agent in HTTP headers, or a server name in TLS that matches known C2 patterns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Endpoint EDR Logs",
            "action": "1. (Symbolic) Search Zeek ssl.log and http.log for exact matches against a maintained list of known malicious JA3/JA3S hashes, SNI values, and User-Agent strings associated with SOHO router malware. Trigger an alert on any match. 2. (Statistical) For each host, calculate the Shannon entropy of its JA3S hashes and User-Agents over a 24-hour period. A sudden drop in entropy below the 5th percentile of the organizational baseline indicates a shift from diverse browsing to uniform C2 communication. 3. (Machine Learning) Use a pre-trained classification model (e.g., Random Forest) that uses features from Zeek logs (JA3S, SNI, User-Agent, connection duration, byte counts) to classify each connection. Flag connections classified as malicious with a confidence score above 0.9."
          },
          {
            "description": "An internal host establishes a persistent or beaconing connection to an external IP address within an ASN block registered to a residential ISP. The connection is characterized by a fixed time interval between communications and a low standard deviation in payload size.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, VPN Concentrators, Core Switches",
            "action": "1. (Symbolic) Enrich Zeek conn.log with ASN data. Create a rule to alert when an internal host communicates with an IP in a known residential ASN on a non-standard port (e.g., not 80, 443, 22) for more than one hour. 2. (Statistical) For each source-destination pair where the destination is residential, calculate the standard deviation of the time delta between connections and the standard deviation of the `orig_bytes` field over a rolling 1-hour window. A value for both metrics below the 10th percentile of all host traffic indicates highly regular, automated beaconing. 3. (Machine Learning) Apply a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the byte count and connection frequency for each host's traffic to residential IP space. An alert is triggered when a significant anomaly is detected, such as a shift to a periodic, heartbeat-like pattern."
          },
          {
            "description": "A single external IP address, geolocated to a residential ISP, initiates connections to an anomalously high number of distinct internal hosts within a short time frame (e.g., 5 minutes), potentially followed by exploit attempts.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek scan.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ, Internet-facing Web Servers, External Firewall",
            "action": "1. (Symbolic) Correlate Zeek scan.log with http.log. Alert if an external IP flagged for port scanning is subsequently seen in http.log attempting to access URIs containing patterns from an exploit database (e.g., log4j, SQLi) within 10 minutes. 2. (Statistical) For each external source IP, count the number of distinct destination ports and distinct internal hosts it connects to in a 5-minute window. Flag any source IP that exceeds the 99th percentile for these counts across all external traffic. 3. (Machine Learning) Use a density-based clustering algorithm like DBSCAN on connection events, using features such as source IP, destination IP, and destination port. The algorithm can dynamically identify a small, dense cluster of connections originating from a single external IP to many internal IPs, which represents a scanning event."
          },
          {
            "description": "An internal host sends DNS queries for diverse external domains, but subsequent application traffic for those domains is routed through a single, different external IP address identified as a residential SOHO device, suggesting proxy or tunnel usage.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Internet Gateway, Endpoint Network Logs",
            "action": "1. (Symbolic) Join Zeek dns.log (query -> resolved IPs) with Zeek conn.log and ssl.log on a 1-minute window. Alert if a host resolves 'domain.com' to IP 'A.B.C.D' but establishes a connection to a different IP 'W.X.Y.Z' (in a residential ASN) with a TLS SNI of 'domain.com'. 2. (Statistical) For each host, calculate the ratio of (count of unique destination IPs in conn.log) to (count of unique FQDNs in dns.log) over 1 hour. A ratio that drops below the 5th percentile of the host's historical baseline suggests traffic is being funneled through a proxy. 3. (Machine Learning) Model network flows using a graph database. Create nodes for internal hosts and external IPs. Use a community detection algorithm to find internal hosts that are anomalously connected to a single external 'hub' node, especially if that hub resides in a residential IP space."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]