[
  {
    "information_requirement": "Is the adversary developing resources, specifically social media accounts, for targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.001",
        "name": "Social Media Accounts",
        "evidence": [
          {
            "description": "Social media accounts are linked to known malicious infrastructure, domains, or aliases associated with known threat actors.",
            "data_sources": [
              "Publicly available social media data",
              "Cyber Threat Intelligence Feeds"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Proactively scan social media platforms (e.g., LinkedIn, Twitter, Facebook) for profiles impersonating the organization or its employees. Extract all associated metadata, including profile pictures, linked websites, and contact information. Inner join these extracted indicators (domains, URLs, email addresses, usernames) with a high-confidence CTI feed of known malicious infrastructure and actor aliases. Investigate and report any confirmed matches."
          },
          {
            "description": "Social media accounts impersonating employees or the organization are using specific, templated profile content or patterns associated with known adversary campaigns.",
            "data_sources": [
              "Publicly available social media data"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Proactively scan platforms for profiles using company logos, executive names, or specific job titles. Analyze profile content (biographies, posts) for similarities or templated language matching known adversary campaigns. Use perceptual hashing (pHash) to identify reused or slightly modified profile pictures across multiple suspicious accounts. Use regular expressions to find common naming conventions in usernames or handles (e.g., `firstname.lastname.company`, `firstname_lastname_HR`)."
          },
          {
            "description": "Execution of browser automation frameworks or scripting engines on internal hosts to manage social media accounts, in a manner inconsistent with user roles.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for the execution of browser automation tools (e.g., Selenium, Playwright, Puppeteer) or scripting engines (e.g., python.exe, powershell.exe) with command-line arguments referencing social media domains or APIs. Correlate these events with user roles and host functions to flag activity on systems or by users not authorized for such tasks. Maintain a list of known social media bot tool process names and command-line patterns."
          },
          {
            "description": "Anomalous volume, frequency, or timing of network traffic from internal systems to social media platforms, indicating automated or covert account management.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a multi-dimensional baseline of traffic to social media domains per internal host/user, including connection frequency, data volume, session duration, and time of day. Use statistical methods like IQR or Z-scores to detect significant deviations from this baseline. Employ time series analysis to identify periodic, non-human patterns of access (e.g., connections every 5 minutes, 24/7). Correlate high-traffic events with the execution of browser automation tools (from Windows Event ID 4688) on the source host to confirm automated activity."
          },
          {
            "description": "A newly created or suspicious social media account is exhibiting a high rate of connection or follow requests to employees, indicating a targeted reconnaissance or social engineering campaign.",
            "data_sources": [
              "Publicly available social media data",
              "Employee reports"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor or collect data on connection/follow requests received by official company accounts and key personnel (via manual reporting or API access if available). Model the organization's social graph to identify external accounts attempting to connect to many disparate employees without mutual connections. Use frequency analysis and time series analysis to detect accounts with a sudden burst or unusually high rate of requests. Analyze the requesting account's profile for signs of inauthenticity (e.g., recent creation date, low activity, stock photos)."
          },
          {
            "description": "A cluster of social media accounts is exhibiting coordinated inauthentic behavior to build legitimacy, such as synchronized posting, following, or content engagement.",
            "data_sources": [
              "Publicly available social media data"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify groups of potentially fake accounts impersonating the organization or employees. Use graph analysis to find unusually dense inter-connectivity within the cluster (e.g., they all follow each other but have few external connections). Analyze their activity feeds using time series analysis to detect synchronized posting, liking, or commenting on content. Calculate the entropy of post content across the cluster; low entropy suggests automated, repetitive messaging designed to create an echo chamber or appear legitimate."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]