[
  {
    "information_requirement": "Is the adversary gathering information about the victim organization?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1591",
        "name": "Gather Victim Org Information",
        "evidence": [
          {
            "description": "Network traffic to or from external IP addresses or domains known to be part of reconnaissance infrastructure or associated with malicious scanning activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source/destination IPs from Zeek conn.log and queried domains from Zeek dns.log against high-confidence threat intelligence feeds identifying reconnaissance infrastructure, malicious scanners, or open proxies. Generate an alert for any matches and investigate the scope of the interaction."
          },
          {
            "description": "External HTTP requests targeting specific file paths, keywords, or file types commonly associated with sensitive organizational information (e.g., org charts, employee lists, internal policies).",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the 'uri' and 'host' fields in Zeek http.log for requests from external IPs containing keywords such as 'employee', 'orgchart', 'internal', 'hr', 'policy', 'directory', or file extensions like '.xlsx', '.csv', '.pdf', '.docx' in unusual locations. Use regular expressions for pattern matching and maintain a list of sensitive terms. Use frequency analysis on URI requests to find rare, potentially sensitive files being accessed externally."
          },
          {
            "description": "Network traffic exhibiting specific signatures of known reconnaissance tools, such as unique User-Agent strings or DNS query patterns.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for User-Agent strings associated with common reconnaissance or vulnerability scanning tools (e.g., sqlmap, nmap, FOCA, specific Python library defaults). Monitor Zeek dns.log for unusual query patterns, such as a high volume of 'ANY' or 'AXFR' (zone transfer) queries from external sources, which indicate enumeration attempts. Maintain and update signatures for these tool artifacts."
          },
          {
            "description": "Anomalous, broad, or systematic scanning activity from a single external source targeting a wide range of hosts or ports, especially those associated with web, mail, or DNS services.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate Zeek conn.log data by external source IP. Identify IPs that connect to a large number of distinct destination hosts or ports within the organization's address space over a short period. Use statistical analysis to define a baseline for normal connection diversity and flag outliers. A box-plot of 'distinct destination ports per source IP' can reveal scanners. Focus on probes against common service ports (e.g., 80, 443, 25, 53, 22)."
          },
          {
            "description": "Unusual volume or patterns of DNS queries from a single source, indicating attempts to enumerate organizational infrastructure via subdomain brute-forcing or service record discovery.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline for normal DNS query volume and types per source. Monitor Zeek dns.log for spikes in NXDomain (non-existent domain) responses from a single source, which can indicate subdomain brute-forcing attempts. Analyze the entropy of queried subdomain names; a sudden increase in entropy from a single source may signal automated enumeration. Use time series analysis to detect unusual spikes in MX or SRV record queries, which are often used to map out mail and service infrastructure."
          },
          {
            "description": "A significant increase in external traffic to non-public or obscure web pages, such as login portals, administrative interfaces, or forgotten subdomains, potentially identified by comparing access frequencies.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile the commonality of web pages accessed from external versus internal IPs using Zeek http.log. Create a ranked list of 'internally popular' versus 'externally popular' URIs. Flag external IPs that repeatedly access URIs that are rarely or never accessed by legitimate external users but may be known internally (e.g., '/admin_login.php', '/test-site/'). Use linear regression to model expected traffic to these pages and detect anomalous spikes. Correlate with Zeek conn.log to analyze the full connection behavior of the source IP."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]