[
  {
    "information_requirement": "Is the adversary conducting reconnaissance using spearphishing attachments?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598.002",
        "name": "Spearphishing Attachment",
        "evidence": [
          {
            "description": "Receipt of emails containing attachments with known malicious file hashes or originating from sender IP addresses/domains blacklisted in threat intelligence feeds.",
            "data_sources": [
              "Zeek files.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek files.log to extract MD5/SHA hashes of all files transferred over the SMTP protocol. Inner join these hashes with a continuously updated threat intelligence feed of known malicious file hashes. Separately, analyze Zeek smtp.log to extract sender IP addresses and domains. Correlate these against a CTI feed of known malicious senders. Alert on any confirmed matches."
          },
          {
            "description": "Execution of system utilities or scripting interpreters by a document-viewing application, with command-line arguments specifically used for system and network reconnaissance.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events where the parent process is a common document or email client application (e.g., WINWORD.EXE, EXCEL.EXE, ACROBAT.EXE, OUTLOOK.EXE). Inspect the 'CommandLine' or 'ProcessCommandLine' field for the execution of reconnaissance tools (e.g., systeminfo, whoami, ipconfig /all, net user, quser, netstat -an) or PowerShell reconnaissance cmdlets (e.g., Get-ComputerInfo, Get-NetIPConfiguration, Resolve-DnsName, Get-WmiObject). Maintain a list of these suspicious command patterns and alert on any matches, especially when correlated with recent email receipt."
          },
          {
            "description": "A small, targeted group of users receiving emails with attachments from a newly observed or anomalous external sender, especially if the emails fail SPF/DKIM authentication.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek smtp.log to establish a baseline of normal sender-recipient relationships and sender frequency. Identify external senders or domains not seen before or seen with very low frequency using descriptive statistics. Correlate these new senders with emails sent to a small, targeted group of internal users (e.g., executives, finance department). Use entropy measures on recipient lists to find low-entropy (highly targeted) campaigns. Heighten suspicion for such email clusters that also have 'fail' or 'softfail' values for SPF/DKIM checks."
          },
          {
            "description": "An anomalous outbound network connection to a rare or newly observed external destination, initiated by a process spawned from an email attachment, indicating a potential reconnaissance beacon.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate events in a time-bound sequence: 1. A process is created by an email client or document viewer (Windows Event ID 4688). 2. The new process (or its child) initiates an outbound network connection (Zeek conn.log). Focus on connections to external destinations that are rare or have never been seen before in the environment's baseline. Use frequency analysis and percentiles on destination IPs/domains (from Zeek dns.log or conn.log) to identify such outliers. A time series analysis of new external connections can detect a sudden appearance of a new communication channel shortly after a suspected phishing email delivery."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]