[
  {
    "information_requirement": "Is the adversary performing reconnaissance using spearphishing links?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598.003",
        "name": "Spearphishing Link",
        "evidence": [
          {
            "description": "An endpoint establishes a network connection to a domain, URL, or IP address present on a threat intelligence feed for phishing, credential harvesting, or reconnaissance.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the network (e.g., Firewalls, Web Proxies), Internal DNS Resolvers",
            "action": "Continuously correlate domains queried (Zeek dns.log), destination IPs (Zeek conn.log), and HTTP host headers (Zeek http.log) against a high-confidence, daily-updated threat intelligence feed of phishing infrastructure (Symbolic). Statistically profile the frequency of threat intelligence hits by user and department; flag users or groups whose hit rate exceeds the 95th percentile for the organization, as this may indicate a targeted campaign (Statistical). Develop and apply a supervised classification model (e.g., Random Forest) trained on labelled log features (connection duration, bytes transferred, requested host, user agent) to score and classify all new outbound connections in near real-time, alerting on connections with a high probability of being malicious (Machine Learning)."
          },
          {
            "description": "A DNS query or HTTP request is made for a URL that exhibits characteristics of phishing, such as typosquatting, obfuscation (e.g., 'google.com@1.2.3.4'), use of URL shorteners, or the presence of credential-related keywords.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Web Proxies, User Workstations",
            "action": "Apply regular expressions to Zeek dns.log queries and http.log URIs to detect patterns like typosquatting, URL obfuscation (e.g., /@\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}/), and keywords like 'login' or 'verify' (Symbolic). Calculate the Shannon entropy of subdomain labels and URL paths, flagging domains or paths with entropy scores exceeding the 99th percentile of the established baseline. Also, calculate the Levenshtein distance between requested domains and a list of legitimate company domains to quantify typosquatting similarity (Statistical). Use an unsupervised learning model, such as an Isolation Forest, trained on features extracted from legitimate URLs (length, character distribution, keyword counts, entropy) to detect anomalous structures indicative of phishing (Machine Learning)."
          },
          {
            "description": "An unusual spike in outbound connections from multiple distinct user endpoints to a single, newly observed, or low-reputation external domain, suggesting a coordinated spearphishing campaign.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internal DNS Resolvers",
            "action": "For any domain not seen in the last 30 days, check its registration date via WHOIS. Flag any domain registered within the last 30 days that receives connections from more than 5 distinct internal hosts within one hour (Symbolic). For each external domain, calculate the number of unique internal source IPs connecting to it over a rolling 5-minute window. Generate an alert when this count exceeds 3 standard deviations above the mean or surpasses the 99th percentile of all domains (Statistical). Implement a time-series anomaly detection model (e.g., ARIMA) on the request volume per destination domain to flag significant positive deviations between observed and predicted counts, which indicate a sudden traffic spike (Machine Learning)."
          },
          {
            "description": "An HTTP POST request, indicative of form data submission, is sent from a user endpoint to an external domain that is newly observed, uncategorized, or has a low reputation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Proxies, Authentication Servers",
            "action": "From Zeek http.log, filter for all events where the method is 'POST' and the destination is external. Correlate the destination host with threat intelligence and alert if the host is on a known-bad list for phishing (Symbolic). Maintain a baseline of all domains that receive HTTP POSTs from the enterprise and calculate their frequency. Flag any POST to a domain that falls below the 5th percentile of frequency (i.e., is very rare) or has never received a POST before (Statistical). Use a clustering algorithm (e.g., DBSCAN) on features from POST requests (URI path structure, Content-Type header, destination domain reputation) to group similar submission behaviors and investigate clusters forming around low-reputation domains (Machine Learning)."
          },
          {
            "description": "An endpoint renders an email and makes an immediate, short-lived network connection with minimal data transfer to a suspicious domain, consistent with a tracking pixel or web bug used to validate email receipt and target viability.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations (specifically email client processes), Network Egress Points",
            "action": "Create a rule that triggers when a DNS query (Zeek dns.log) is immediately followed (within 2 seconds) by a TCP connection (Zeek conn.log) from the same source IP to the resolved destination, where total bytes transferred is less than 500 bytes (Symbolic). For all completed connections, calculate descriptive statistics for 'duration' and total bytes transferred. Identify connections in the lowest 1st percentile for both metrics and cross-reference their destinations with newly registered or high-entropy domains (Statistical). Train a logistic regression classifier to distinguish legitimate 'ping' traffic from malicious 'pingbacks' using features like duration, byte count, destination domain age, and domain entropy, alerting on high-confidence classifications (Machine Learning)."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]