[
  {
    "information_requirement": "Is the adversary conducting reconnaissance to determine physical locations?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1591.001",
        "name": "Determine Physical Locations",
        "evidence": [
          {
            "description": "Connections to public-facing web servers from IP addresses on threat intelligence feeds for known reconnaissance infrastructure or malicious actors.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses in Zeek conn.log for traffic destined to external-facing web servers against cyber threat intelligence (CTI) feeds of known malicious or reconnaissance-related IPs. Alert on any matches and investigate for further enumeration or probing activity."
          },
          {
            "description": "Use of specific User-Agent strings or systematic HTTP request patterns associated with reconnaissance tools targeting public-facing web servers.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan Zeek http.log data for User-Agent strings associated with common reconnaissance tools (e.g., Maltego, FOCA, Recon-ng) or for patterns indicative of automated crawling (e.g., rapid, sequential requests to 'About Us', 'Contact', 'Locations' pages without fetching associated page resources like CSS/images). Use regular expression matching on a curated list of tool signatures and crawling patterns."
          },
          {
            "description": "An internal system exhibiting a sudden and significant increase in traffic to external mapping services, real estate websites, or public record databases.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal internal traffic to categories of external websites related to physical locations (e.g., mapping, real estate, public registries). Monitor Zeek conn.log and dns.log for internal hosts that show a statistically significant deviation from this baseline in terms of connection frequency, volume, or number of unique domains accessed. Use time series analysis to detect spikes and percentile analysis to identify top talkers to these services for further investigation."
          },
          {
            "description": "Anomalous access to sensitive internal files or repositories containing physical location information, such as facility blueprints, asset inventories, or emergency plans.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable SACL auditing on file shares and directories containing sensitive location data. Monitor Windows Event ID 4663 (An attempt was made to access an object) for these specific resources. Establish a baseline of normal access patterns per user/department. Use descriptive statistics and frequency analysis to detect users accessing an unusually high number of these files, accessing them at odd hours, or accessing files unrelated to their job function. Box-plots of file access counts per user can identify outliers."
          },
          {
            "description": "A sequence of events where a suspicious process launch is immediately followed by network or file access related to physical location reconnaissance.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Windows Event ID 4688), particularly from suspicious parents like office applications or scripting engines, with subsequent network connections to mapping/public data sites (from Zeek conn.log) or access to sensitive location files (Windows Event ID 4663) by the same host/user within a short time window (e.g., under 5 minutes). Alert on this chained sequence as a strong indicator of post-compromise reconnaissance."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]