[
  {
    "information_requirement": "Is an adversary performing DNS reconnaissance against our network infrastructure?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.002",
        "name": "DNS",
        "evidence": [
          {
            "description": "A DNS query for an organizational domain originates from an external source IP address present on a threat intelligence feed with a 'reconnaissance' or 'malicious' category.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing DNS servers, Network perimeter firewalls, Cloud provider DNS logs",
            "action": "1. (Symbolic) Continuously correlate the source IP (`id.orig_h`) from Zeek dns.log against a threat intelligence feed. Generate an alert if an IP matches a 'reconnaissance' or 'malicious' category and the query (`query`) targets an organizational domain. 2. (Statistical) For IPs matching a CTI feed, calculate the ratio of queries targeting organizational domains versus other domains over a 1-hour window. A ratio significantly higher than the average for all external IPs (e.g., > 95th percentile) indicates targeted reconnaissance rather than incidental traffic. 3. (Machine Learning) Train a classification model (e.g., Random Forest) using features from Zeek dns.log (query length, query type, source IP reputation, ASN, geo-location) to predict whether a query is part of a reconnaissance campaign. A high probability score from the model for a live query indicates likely reconnaissance."
          },
          {
            "description": "An AXFR or IXFR query type is observed in a DNS request originating from an IP address not on the explicit allow-list for zone transfers.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 5504"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DNS servers, Secondary DNS servers",
            "action": "1. (Symbolic) Create a rule to alert on any DNS query in Zeek dns.log where `qtype_name` is 'AXFR' or 'IXFR' and the source IP (`id.orig_h`) is not in a predefined allow-list of secondary DNS servers. On Windows, alert on Event ID 5504 where the source IP is not in the allow-list. 2. (Statistical) Profile the frequency of administrative query types (e.g., SOA) from authorized sources to establish a baseline. An anomalous spike in these query types from any source, even an authorized one, should be flagged if it exceeds 3 standard deviations from the mean hourly count. 3. (Machine Learning) Use an anomaly detection autoencoder trained on sequences of DNS queries from authorized administrative IPs. The model learns the normal pattern of administrative DNS traffic. A sequence containing an AXFR query from an unauthorized source will generate a high reconstruction error, flagging it as an anomaly."
          },
          {
            "description": "A single external source IP generates a high rate of DNS queries resulting in NXDOMAIN responses, uses the 'ANY' query type, or systematically enumerates subdomains.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 257"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing DNS servers, Internal DNS resolvers",
            "action": "1. (Symbolic) Generate an alert when a single external source IP (`id.orig_h` in Zeek dns.log) issues a query with `qtype_name` = 'ANY' (255) for an organizational domain. 2. (Statistical) Over a 5-minute window, calculate the ratio of NXDOMAIN responses (`rcode_name` = 'NXDOMAIN') to total queries for each external source IP. Flag any IP where this ratio exceeds the 98th percentile of all source IP ratios and the total query count is above 50. 3. (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) on features extracted from DNS queries (source IP, query name entropy, NXDOMAIN rate, query type distribution). Clusters identified as outliers can represent coordinated scanning activity from tools that differ from normal user behavior."
          },
          {
            "description": "An external source IP exhibits a statistically significant increase in the volume or variety (entropy) of DNS queries for an organizational domain compared to an established baseline.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing DNS servers, Network perimeter firewalls",
            "action": "1. (Symbolic) Create a high-threshold rule that alerts if a single external source IP generates more than 1,000 DNS queries to an organizational domain within a 1-minute window, which acts as a tripwire for brute-force enumeration. 2. (Statistical) For each external source IP, calculate the Shannon entropy of the queried subdomains over a 10-minute sliding window. Establish a baseline entropy level for typical clients. An IP whose entropy score sharply increases and exceeds the 99th percentile of the baseline distribution indicates subdomain scanning. 3. (Machine Learning) Employ a time series forecasting model (e.g., Prophet) trained on historical data of total DNS query volume per minute. An observed query volume that significantly deviates from the model's predicted value and its uncertainty interval indicates an anomalous event, such as a distributed reconnaissance scan."
          },
          {
            "description": "An external IP, not on a partner/service allow-list, makes a sustained or unusually high number of queries for sensitive record types like MX, TXT, or specific SRV records against an organizational domain.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DNS servers, Mail gateway DNS records, Cloud service provider DNS records",
            "action": "1. (Symbolic) Maintain an allow-list of known partner/service IPs. Generate an alert if an IP not on the list queries for more than 5 distinct SRV records or makes more than 10 TXT record queries for an organizational domain within one hour. 2. (Statistical) For each external source IP, track the count of queries for sensitive record types (MX, TXT, SPF, SRV). Establish a baseline for the 95th percentile of this count over a 24-hour period. Alert on any IP that exceeds this threshold. 3. (Machine Learning) Train a Hidden Markov Model (HMM) where states represent user intentions (e.g., 'normal browsing', 'reconnaissance') and observations are the sequence of DNS query types from a source IP. A transition to and persistence in a 'reconnaissance' state, characterized by a high probability of observing MX, TXT, and SRV queries, would trigger an alert."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]