[
  {
    "information_requirement": "Is the adversary conducting reconnaissance via phishing for information?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598",
        "name": "Phishing for Information",
        "evidence": [
          {
            "description": "Incoming email from sender domains, IP addresses, or containing URLs known to be associated with phishing or reconnaissance campaigns.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate sender IP addresses (from Zeek smtp.log's source IP), domains in sender addresses (from smtp.log), and domains resolved via DNS (dns.log) or connected to via HTTP (http.log) against high-confidence threat intelligence feeds for known phishing infrastructure. Since email content is not directly inspected, this relies on correlating network artifacts of email delivery and any subsequent user network activity. Alert on confirmed matches from high-confidence CTI sources."
          },
          {
            "description": "Incoming emails exhibiting structural patterns common to phishing attempts, such as mail header anomalies (SPF/DKIM/DMARC failures), use of newly registered domains (NRDs), or look-alike domains.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek smtp.log for incoming emails with 'fail' or 'softfail' results for SPF/DKIM checks. Correlate sender domains with Zeek dns.log data to identify use of newly registered domains (NRDs) by checking the age of the domain's WHOIS record or creation date of its DNS records. Use string similarity algorithms (e.g., Levenshtein distance) to detect look-alike domains spoofing the organization's own domain or its trusted partners. A combination of these patterns, such as a look-alike domain that also fails SPF checks, constitutes a high-confidence alert."
          },
          {
            "description": "A widespread email campaign originating from a single or related set of external domains sent to numerous, otherwise unrelated internal users, characteristic of broad reconnaissance phishing.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate incoming mail metadata from Zeek smtp.log over short time windows (e.g., 1 hour). Identify sender domains that are not on an established allowlist or have no prior communication history. Use frequency analysis to detect when a single external domain or IP sends emails to a large number of unique internal recipients. Calculate the ratio of unique recipients to total messages from a source to identify campaign-style activity. A high recipient-to-message ratio from a rare or new domain is highly indicative of a broad phishing attempt."
          },
          {
            "description": "Highly targeted, low-volume email communication directed at specific high-value individuals (e.g., executives, finance, IT admins), potentially involving conversation hijacking or originating from convincing look-alike domains of trusted partners.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a defined list of high-value targets (whaling list). Monitor Zeek smtp.log for all incoming emails to these individuals from external, non-allowlisted domains. Scrutinize emails with subject lines containing 'RE:' or 'FW:' that do not correspond to a recent outbound message from the recipient (indicating potential conversation hijacking). Use correlation analysis with DNS logs to check the age and reputation of the sender domain for all emails to this group. Alert on any suspicious, targeted communication, especially from newly registered or look-alike domains."
          },
          {
            "description": "Anomalous outbound email replies from internal users to suspicious external domains, particularly if the reply contains a high volume of text or is followed by file transfers, indicating a successful response to an information phish.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal outbound email behavior for users and groups. Monitor Zeek smtp.log for outbound emails to external domains that were recently flagged by other phishing detections (e.g., NRDs, look-alikes, known bad IPs). Analyze the size of the outbound message; a reply significantly larger than the initial inbound message can indicate that the user has provided detailed information. Use descriptive statistics (mean, standard deviation) on reply sizes to flag outliers. Correlate with Zeek files.log to detect if the user sent attachments in the reply, which could be a form of information exfiltration in response to the phish."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]