[
  {
    "information_requirement": "Is an adversary performing WHOIS reconnaissance against our organization's domains or related infrastructure?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.002",
        "name": "WHOIS",
        "evidence": [
          {
            "description": "An internal system makes an outbound connection to a WHOIS service (port 43 or web-based) whose IP address or domain is present on a threat intelligence feed of malicious or commonly abused reconnaissance infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway",
            "action": "1. (Symbolic) Ingest a threat intelligence feed of known malicious WHOIS services. Create a SIEM rule to query Zeek conn.log (for dport 43) and http.log (for host/uri) and alert on any connection where the destination IP or domain matches the feed. 2. (Statistical) For all outbound WHOIS connections, calculate the daily connection count per source IP. Flag any source IP whose count exceeds the 95th percentile of activity for its peer group (e.g., 'Workstations' vs 'Servers'). 3. (ML) Use a pre-trained classification model (e.g., random forest) to score the likelihood of a WHOIS destination being malicious, using features like domain age, registration details from a benign lookup, SSL certificate attributes from ssl.log, and historical query volume. A high score indicates a suspicious destination."
          },
          {
            "description": "An outbound HTTP/HTTPS connection to a WHOIS lookup website contains a User-Agent string associated with a known reconnaissance tool, or the URL query pattern suggests automated enumeration.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxy Servers",
            "action": "1. (Symbolic) Maintain a list of User-Agent strings for known reconnaissance tools (e.g., 'python-whois', 'recon-ng', 'sn0int'). Create a rule to search Zeek http.log for matches in requests to known WHOIS sites (identified via SNI in ssl.log or a static list). 2. (Statistical) From Zeek dns.log or http.log, calculate the Shannon entropy of the second-level domains (SLDs) queried by a single source IP within a 5-minute window. An entropy score significantly above the host's historical baseline (e.g., >2 standard deviations) suggests automated enumeration. 3. (ML) Train a sequence-based model (e.g., LSTM) on URL query parameters from http.log for known benign and malicious WHOIS lookups. Use this model to classify new query sequences as either benign (manual, targeted) or suspicious (automated, enumerative)."
          },
          {
            "description": "An internal system exhibits a statistically significant increase in the volume or frequency of WHOIS queries (direct port 43 or web-based) compared to its established baseline or the baseline of its peer group.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": "1. (Symbolic) Create a simple threshold rule: Alert if any single host makes more than 50 WHOIS queries (identified via dport 43 in conn.log or destination host in http.log) in a 1-hour window. 2. (Statistical) For each host, establish a baseline of WHOIS query volume using a 30-day moving average and standard deviation. Generate an alert if the hourly query count exceeds 3 standard deviations above the moving average. 3. (ML) Apply time series forecasting (e.g., ARIMA) to each host's WHOIS query volume. Flag any observation where the actual query count significantly exceeds the forecasted value's confidence interval, indicating a deviation from the established temporal pattern."
          },
          {
            "description": "An internal system, not authorized for security or network administration roles, is observed making WHOIS queries for the organization's own domains, sensitive IP ranges, or known typosquatted domains.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Network Segments",
            "action": "1. (Symbolic) Maintain a list of the organization's domains, IP ranges, and known typosquats. Create a SIEM rule to alert any time a WHOIS query is made for an asset on this list by a host not on an approved list of administrative systems. 2. (Statistical) For queries targeting organizational assets, analyze the distribution of source internal subnets. If queries for a specific asset suddenly originate from a statistically unusual subnet (e.g., a subnet whose query volume for it jumps from the 10th to the 90th percentile), flag for investigation. 3. (ML) Use unsupervised learning (e.g., k-means clustering) to group internal hosts based on their typical network behavior. If a host from a 'low-privilege' cluster (e.g., 'Guest-WiFi-Devices') initiates a WHOIS query for a sensitive asset, classify this as an anomalous event."
          },
          {
            "description": "A sequence of events is observed where a WHOIS query from an internal system is immediately followed by other reconnaissance activities (e.g., port scanning) or connection attempts against the infrastructure identified in the query.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints",
            "action": "1. (Symbolic) Create a correlation rule that triggers if Event A (WHOIS query from a source IP) is followed by Event B (port scan or numerous failed connections from the same IP, seen in conn.log or Windows Event ID 5156) within a 15-minute window. 2. (Statistical) For each host that performs a WHOIS query, calculate the ratio of subsequent 'new' destination IP connections (IPs not seen in the host's last 24-hour baseline) to 'old' connections in the next 30 minutes. A ratio significantly higher than the host's average (e.g., >95th percentile) suggests discovery-driven activity. 3. (ML) Develop a Hidden Markov Model (HMM) where states represent adversary behaviors ('Recon', 'Scan', 'Connect') and observations are log events ('whois_query', 'port_sweep', 'new_connection'). Flag any sequence of events from a single host that transitions from a 'whois_query' observation to a 'Scan' state with high probability."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]