[
  {
    "information_requirement": "Is the adversary conducting reconnaissance against our network security appliances?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.006",
        "name": "Network Security Appliances",
        "evidence": [
          {
            "description": "Inbound connections to network security appliances originating from IP addresses or networks known for malicious scanning or reconnaissance activities.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses of all inbound connections to the IP addresses of known network security appliances (e.g., firewalls, VPN concentrators) against high-confidence cyber threat intelligence (CTI) feeds of known scanners, C2 infrastructure, TOR exit nodes, and malicious proxies. Inner join Zeek conn.log with the CTI feed (updated at least daily) and generate alerts on any matches."
          },
          {
            "description": "Application layer requests to network security appliances containing User-Agent strings, URI patterns, or other artifacts associated with known vulnerability scanners or reconnaissance tools.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create and maintain a list of regular expressions that match User-Agent strings, HTTP headers, URI paths (e.g., '/.git/config', '/.env'), and TLS SNI values (from Zeek ssl.log) characteristic of common reconnaissance and scanning tools (e.g., Nmap, Shodan, Zgrab, Nuclei). Scan Zeek http.log and ssl.log for inbound requests to network security appliance IPs that match these patterns. Use correlation analysis to link multiple matching requests from a single source IP over a short time window."
          },
          {
            "description": "An external source IP conducting horizontal port scanning across a wide range of internal hosts, including network security appliances, on a limited set of common or specific ports.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log to identify single external source IPs connecting to a large number of distinct destination hosts (>50 hosts in 10 minutes) on the same destination port or small set of ports. Use descriptive statistics to find source IPs with an unusually high count of unique destination hosts compared to a baseline. A box-plot on the 'unique destination hosts per source IP' distribution can be used to visually identify outliers. Investigate if known security appliance IPs are among the targets."
          },
          {
            "description": "An external source IP conducting vertical port scanning by probing a large number of sequential or non-sequential ports on one or more specific network security appliances.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek conn.log for traffic destined for known network security appliance IP addresses. For each source IP, count the number of unique destination ports contacted on a single appliance IP within a defined time window (e.g., >100 ports in 5 minutes). Use time series analysis or thresholding to flag source IPs performing vertical scans. Correlate with a high ratio of failed connections (e.g., 'REJ' or 'RSTO' status in Zeek conn.log), which are highly indicative of scanning activity."
          },
          {
            "description": "Anomalous or low-frequency connection patterns to management or non-standard ports on network security appliances, indicative of targeted service fingerprinting and vulnerability discovery.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal inbound traffic patterns (ports, protocols, source geolocations, request types) for all external-facing network security appliances. Monitor for statistically significant deviations from this baseline. Use frequency analysis to identify connection attempts to ports that are rarely accessed from the internet (e.g., outside the top 99% of most-used ports). Analyze the entropy of request types (from Zeek http.log) or TLS JA3 hashes (from Zeek ssl.log) from a single source IP; high entropy can indicate fingerprinting as the client tries multiple methods. Use linear regression to detect anomalous increases in probe traffic over time."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]