[
  {
    "information_requirement": "Is an adversary conducting reconnaissance on our network by gathering IP address information?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.005",
        "name": "IP Addresses",
        "evidence": [
          {
            "description": "A measurable volume of network scanning, probing, or DNS query activity targeting organizational IP address space that originates from IP addresses listed in high-confidence threat intelligence feeds.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter Firewalls, Internet Gateway, External DNS Servers",
            "action": "1. (Symbolic) Ingest high-confidence Cyber Threat Intelligence (CTI) feeds of known scanners, C2 nodes, and anonymization networks (e.g., TOR) into the SIEM. Create a rule to generate a medium-severity alert whenever a source IP in Zeek conn.log or Zeek dns.log matches an IP in the CTI feed. 2. (Statistical) For all CTI-matched source IPs, calculate the total number of connections or queries per 5-minute window. Flag any source IP whose activity count exceeds the 95th percentile of all CTI-matched sources in that window to prioritize the most active threats. 3. (ML) Use a time series forecasting model (e.g., ARIMA) on the total count of CTI-matched events per hour. Generate a high-severity alert if the observed event volume significantly exceeds the forecasted upper confidence interval, indicating a potential coordinated campaign."
          },
          {
            "description": "An external source interacts with public-facing services using User-Agent strings, protocol sequences, or DNS query patterns that are uniquely associated with known reconnaissance tools (e.g., Nmap, Masscan, Nuclei).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Delivery Controllers, External DNS Servers",
            "action": "1. (Symbolic) Create and maintain a list of regular expressions for User-Agent strings (`user_agent` in Zeek http.log) and other artifacts associated with scanning tools. Generate an alert on any match. 2. (Statistical) For each source IP, calculate the Shannon entropy of the destination ports contacted within a 1-minute window in Zeek conn.log. A very low entropy score suggests a targeted probe, while a very high score suggests a broad scan; flag sources in the bottom 5th or top 5th percentile for review. 3. (ML) Train a classification model (e.g., Random Forest) on labeled benign and malicious sessions using features like TCP flags, payload size, connection duration, and user-agent. Apply the model to new sessions to predict and alert on likely reconnaissance activity."
          },
          {
            "description": "An external source IP demonstrates anomalous scanning behavior, defined by a high count of connection attempts to a wide range of organizational IP addresses or ports, or a high ratio of failed to successful connections.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ, Perimeter Firewalls, Cloud Security Groups",
            "action": "1. (Symbolic) Create a rule that triggers when a single external source IP generates connections with a state of 'REJ' or 'RSTO' to more than 100 unique internal destination IPs within a 10-minute window. 2. (Statistical) For each external source IP, calculate the ratio of failed connections (e.g., REJ, RSTO, S0 in `conn_state`) to total connections over a 5-minute interval. Flag any source whose failure ratio exceeds 3 standard deviations above the mean for all external traffic in that period. 3. (ML) Use a clustering algorithm (e.g., DBSCAN) on external source IPs, with features like count of distinct destination IPs, count of distinct destination ports, and the failed connection ratio. Clusters identified as anomalies or noise can represent scanning behavior that deviates from general traffic patterns."
          },
          {
            "description": "A measurable pattern of targeted network probes from an external source, identified by connections to specific service ports followed by protocol anomalies or non-standard data exchanges, indicative of service fingerprinting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dpd.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Application Servers (e.g., Web, VPN, RDP), Internet Gateway",
            "action": "1. (Symbolic) Generate an alert on any event in Zeek notice.log with a `notice_type` of `Scan::Port_Scan`, `SSL::Invalid_Server_Cert`, or `PacketFilter::Drop` where the source IP is external. 2. (Statistical) For each external source IP connecting to a high-value port (e.g., 443, 3389, 22), calculate the median connection duration and total bytes transferred. Flag sources where these metrics fall below the 10th percentile of all connections to that port, as this may indicate a quick fingerprinting probe rather than a legitimate session. 3. (ML) Apply time series analysis to the event count from Zeek dpd.log (Dynamic Protocol Detection) for protocol mismatches on standard ports (e.g., non-HTTP traffic on port 80). An anomalous spike in these events from a specific source indicates a coordinated fingerprinting attempt."
          },
          {
            "description": "An external source generates anomalous DNS queries against organizational domains, characterized by zone transfer requests (AXFR), a high ratio of NXDOMAIN responses, or an unusually high frequency of lookups.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative External DNS Servers, Recursive DNS Resolvers",
            "action": "1. (Symbolic) Create a high-priority alert that triggers immediately for any DNS query observed in Zeek dns.log where the query type (`qtype_name`) is 'AXFR' and the query targets an organizational domain. 2. (Statistical) For each external source IP, calculate the ratio of NXDOMAIN responses to total queries for the organizational domain over a 15-minute window. Flag any source where this ratio exceeds the 98th percentile, which strongly indicates subdomain brute-forcing. 3. (ML) Train a one-class SVM model on features of normal external DNS query behavior (e.g., query frequency, query type distribution, NXDOMAIN rate per source). Apply the model to new query patterns to detect outliers that represent anomalous reconnaissance activity."
          },
          {
            "description": "An internal host exhibits anomalous outbound connection patterns to an unusually high number of distinct external IP addresses or ports, indicating a compromised system is being used for external reconnaissance.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Internal Server Segments, Egress Firewalls",
            "action": "1. (Symbolic) Create a rule to alert when a single internal host (that is not a designated proxy or scanner) initiates connections to more than 50 unique external IP addresses on non-standard ports (not 80/443) within one hour. Correlate with Windows Event ID 4688 to identify the responsible process. 2. (Statistical) For each internal host, establish a baseline for the number of distinct external IPs contacted per day using a 30-day moving average and standard deviation. Generate a high-severity alert if a host's daily count exceeds 4 standard deviations above its moving average. 3. (ML) Use time series decomposition (e.g., STL) on the outbound connection count per host to separate trend, seasonality, and residuals. Apply an anomaly detection algorithm to the residual component to identify sudden spikes in outbound scanning activity not explained by normal behavior."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]