[
  {
    "information_requirement": "Is the adversary conducting reconnaissance to gather information about our domain properties?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.001",
        "name": "Domain Properties",
        "evidence": [
          {
            "description": "DNS queries or connection attempts originating from IP addresses known to be associated with reconnaissance infrastructure or malicious actors.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously cross-reference source IP addresses from Zeek dns.log (for queries against corporate domains) and Zeek conn.log (for connections to web servers, SMTP, and cloud service endpoints) against a high-confidence, up-to-date cyber threat intelligence (CTI) feed of IPs known for reconnaissance, scanning, or other malicious activities. An inner join between log data and the CTI feed should trigger an alert for immediate investigation."
          },
          {
            "description": "Use of specific User-Agent strings or structured query patterns characteristic of known reconnaissance tools in requests targeting web servers or cloud APIs.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek http.log for HTTP/S requests containing User-Agent strings or specific URI patterns and parameters associated with popular domain/subdomain enumeration tools (e.g., Aquatone, Sublist3r, DirBuster, ffuf). Maintain a list of these signatures using regular expressions. Use correlation analysis to link multiple hits from the same source IP to increase confidence and identify a coordinated enumeration attempt."
          },
          {
            "description": "Execution of common domain reconnaissance command-line tools from internal hosts, potentially indicating a compromised host performing reconnaissance for a new target.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events corresponding to `nslookup.exe`, `dig.exe`, `whois.exe`, or the execution of PowerShell cmdlets like `Resolve-DnsName` with non-standard parameters. Alert on execution from unusual user contexts (e.g., service accounts) or on servers where such activity is not expected (e.g., web servers, database servers). Use descriptive statistics to identify hosts with an anomalously high frequency of these commands."
          },
          {
            "description": "Anomalously high volume of DNS queries (especially those resulting in NXDOMAIN errors) or API calls to cloud services, originating from a single external source, indicating enumeration.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek dns.log for a high rate of queries or a high ratio of NXDOMAIN (non-existent domain) responses from a single source IP, which can indicate subdomain brute-forcing. For cloud services, monitor Zeek http.log for high-frequency POST requests to enumeration endpoints (e.g., Office 365's GetUserRealm). Use time series analysis to detect spikes in query/request volume from specific sources. Calculate the entropy of requested subdomains or usernames per source IP; a high query rate combined with high entropy is a strong indicator of enumeration."
          },
          {
            "description": "Broad or systematic scanning activity from external sources targeting services commonly used for domain or user enumeration (e.g., SMTP, LDAP, RPC).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek portscan.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek portscan.log and conn.log for scanning patterns from external IPs. Identify one-to-many connections (one source to many hosts/ports) or many-to-one connections targeting services like SMTP (port 25), LDAP (389), or RPC (135) on externally accessible servers. Use descriptive statistics (mean, standard deviation, IQR) on connection attempts per source IP per hour to establish a baseline and identify significant outliers indicative of scanning activity. Correlate port scanning with subsequent enumeration attempts against discovered services."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]