[
  {
    "information_requirement": "Is the adversary gathering information about our organization via CDNs?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.004",
        "name": "CDNs",
        "evidence": [
          {
            "description": "CDN access attempts originating from IP addresses or using User-Agent strings known to be associated with malicious scanners, reconnaissance tools, or threat actors.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses from Zeek conn.log and Zeek http.log requests to CDN-hosted assets against cyber threat intelligence (CTI) feeds of known malicious scanners, TOR exit nodes, or IPs associated with reconnaissance campaigns. Simultaneously, use regular expressions to match User-Agent strings against a maintained list of known reconnaissance tools (e.g., Nuclei, Nmap, Zgrab, Feroxbuster). Alert on any confirmed matches."
          },
          {
            "description": "Probing attempts against CDN-hosted assets for specific, commonly exposed sensitive files, directories, or API endpoints indicative of automated reconnaissance tools.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek http.log for HTTP requests targeting a predefined list of URL paths known to be probed by reconnaissance tools for information leaks or misconfigurations. This list should include common sensitive files/directories (e.g., /.git/config, /.env, /etc/passwd) and framework-specific diagnostic endpoints (e.g., /actuator/health, /Telerik.Web.UI.WebResource.axd). Use regular expression matching on the requested URI and alert on any hits from external IPs, especially those resulting in 404 Not Found, as this can indicate blind enumeration."
          },
          {
            "description": "Anomalous scanning or enumeration activity from a single source IP targeting a wide range of paths or subdomains on CDN-hosted assets, deviating from typical user browsing behavior.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each external source IP, monitor the number of unique URL paths and subdomains accessed within a defined time window (e.g., 10 minutes). Calculate the entropy of requested paths; high entropy from a single source suggests enumeration. Flag sources with a high rate of requests, especially those resulting in 404 errors. Use descriptive statistics (mean, std dev of requests per IP) and box-plots to identify outliers. Correlate with Zeek dns.log to detect corresponding subdomain enumeration attempts."
          },
          {
            "description": "Atypical network traffic patterns designed to bypass the CDN and identify the true origin server IP address, such as direct-to-IP connections matching the CDN's TLS certificate.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify the TLS certificate subjects and serial numbers used on your primary CDN-hosted domains. Monitor Zeek ssl.log for any connections from external IPs made directly to your known origin server IP ranges that present the same TLS certificate details. Such a match indicates that an external entity has successfully identified your origin server and is attempting to connect to it directly, bypassing CDN protections. Use correlation analysis to link these direct connections with prior scanning activity from the same source IP."
          },
          {
            "description": "Anomalous internal system activity, such as unusual DNS queries for CDN infrastructure or file access events, indicating an internal adversary's attempts to discover CDN configuration details or origin server locations.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek dns.log for internal hosts (especially non-developer workstations) querying for hostnames associated with CDN management portals or internal-only subdomains that might host origin servers; use frequency analysis to find rare queries. On file servers and developer endpoints, configure auditing for and monitor Windows Event ID 4663 (Object Access) on known CDN configuration files (e.g., terraform scripts, server configs). Monitor Windows Event ID 4688 (Process Creation) for the use of command-line search tools (e.g., `grep`, `findstr`) searching for keywords like 'origin_server', 'cdn_api_key', or specific IP ranges within user directories or code repositories."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]