[
  {
    "information_requirement": "Is the adversary gathering information about our network infrastructure?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590",
        "name": "Gather Victim Network Information",
        "evidence": [
          {
            "description": "Reconnaissance activity originating from IP addresses or networks listed in high-confidence threat intelligence feeds as sources of malicious scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously ingest threat intelligence feeds specializing in active scanners, malicious IPs, TOR exit nodes, and known hostile infrastructure. Create a high-priority watchlist of these indicators. Perform an inner join between this watchlist and the source IP addresses observed in Zeek conn.log, dns.log, and http.log. Alert on any match and correlate all activity from the matching source IP for further analysis of reconnaissance intent."
          },
          {
            "description": "Traffic containing specific signatures or artifacts associated with common reconnaissance tools (e.g., Nmap, Masscan, Zgrab, Nuclei) such as unique User-Agent strings, specific probe payloads, or characteristic protocol handshakes.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain and apply a list of regular expressions and signatures to search for known reconnaissance tool artifacts. Scan the `user_agent` field in Zeek http.log for strings like 'Nmap Scripting Engine', 'masscan', 'zgrab', 'nuclei'. Analyze Zeek conn.log connection patterns for unique probes (e.g., Nmap OS detection probes). Monitor Zeek notice.log for specific alerts like `Nmap::OS_Scan` or custom notices built to detect other reconnaissance tools. Use correlation analysis to link multiple pattern matches from a single source IP to increase confidence."
          },
          {
            "description": "An external source IP exhibiting network sweeping or port scanning behavior, characterized by a high rate of connections to many different hosts or ports within the organization's network space.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek scan.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log for one-to-many connection patterns from a single external source IP. Define thresholds for scan activity (e.g., >20 distinct hosts on one port in under 5 minutes for a sweep; >50 distinct ports on one host in under 5 minutes for a port scan). Utilize Zeek's native `scan.log` for pre-identified scanning activity. Apply statistical measures like calculating the entropy of destination ports or destination IPs per source IP over a time window; a high entropy value is indicative of scanning. Use a time series analysis on connection rates per source to detect anomalous spikes in activity."
          },
          {
            "description": "Anomalous, high-volume web requests from an external source targeting non-existent pages, or seeking sensitive information disclosure paths and files, indicative of forced browsing or vulnerability scanning.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for external sources generating a high ratio of client errors (4xx status codes) to successful requests (2xx status codes), which suggests directory/file brute-forcing. Profile the typical request rate and error rate per source IP and use descriptive statistics (mean, standard deviation, Inter-Quartile Range) to flag outliers. Create a time series of 404 error counts per source IP to detect sudden spikes. Analyze the entropy of requested URI paths from a single source; high entropy can indicate wide-ranging automated probes. Correlate with requests for known sensitive paths like `/.git/`, `/.svn/`, or backup files (`.bak`, `.old`)."
          },
          {
            "description": "Anomalous patterns of external DNS queries against the organization's authoritative DNS servers, such as zone transfer attempts, subdomain brute-forcing, or querying for sensitive record types.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek dns.log for `AXFR` or `IXFR` query types originating from unauthorized external IP addresses, which indicate DNS zone transfer attempts. Detect subdomain brute-forcing by identifying external source IPs that generate a high volume of queries resulting in NXDOMAIN responses. Use frequency analysis on the requested query level (e.g., count of unique third-level domains per source IP). Profile normal query type distributions and flag external sources that request an unusual mix or volume of records (e.g., ANY, TXT, SRV) which can be used to map network services and infrastructure."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]