[
  {
    "information_requirement": "Is the adversary performing reconnaissance by searching public digital certificate data against our organization?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.003",
        "name": "Digital Certificates",
        "evidence": [
          {
            "description": "An internal host makes DNS queries or initiates network connections to domains or IP addresses known to be associated with malicious infrastructure, illicit certificate search services, or adversary reconnaissance frameworks.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Network Egress Points (e.g., Firewalls, Proxies)",
            "action": "1. (Symbolic) Maintain and regularly ingest a threat intelligence feed of domains and IP addresses associated with malicious certificate reconnaissance tools or adversary infrastructure. Create a detection rule to alert on any DNS query (Zeek dns.log) or network connection (Zeek conn.log) from an internal host to a resource on this list. 2. (Statistical) For each host, calculate the ratio of queries to known CT/recon domains versus total DNS queries over a 24-hour window. Establish a baseline for this ratio per host role (e.g., security analysts vs. finance). Generate an alert if a host's ratio exceeds the 95th percentile of its peer group's baseline. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., ARIMA) on the volume of connections from the internal network to IPs on the threat intelligence list. A sudden spike in connections that is not explained by historical patterns should be flagged as a high-confidence anomaly."
          },
          {
            "description": "An internal host sends HTTP/S requests containing User-Agent strings, URI patterns, or API parameters known to be used by automated certificate harvesting tools, directed towards legitimate certificate transparency (CT) log domains or public certificate databases.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxies, Network Egress Points, SSL/TLS Decryption Zones",
            "action": "1. (Symbolic) Create and maintain a library of regular expressions that match User-Agent strings (e.g., 'masscan', 'censys', 'sublist3r') and characteristic API query patterns (e.g., URI contains '/?q=%.example.com') used by known reconnaissance tools. Monitor Zeek http.log for requests from internal hosts to known CT log domains (e.g., crt.sh, *.ct.googleapis.com) that match these signatures. 2. (Statistical) Calculate the Shannon entropy of User-Agent strings per host over a rolling 24-hour window. A sudden, sharp increase in entropy for a non-developer host suggests the use of multiple reconnaissance tools. Trigger an alert if a host's entropy score exceeds 3 standard deviations above its own historical mean. 3. (Machine Learning) Train a classification model (e.g., Random Forest) using features from HTTP requests (User-Agent, URI path, query parameters, request frequency) to distinguish between benign browser traffic and malicious tool-based traffic. Apply this model in near-real-time to classify outbound HTTP traffic to CT log domains and flag requests classified as malicious with a high probability score."
          },
          {
            "description": "An internal host generates an anomalously high volume or frequency of DNS queries to a diverse set of certificate transparency (CT) log domains, deviating from its established baseline and role-based profile.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Endpoint Devices",
            "action": "1. (Symbolic) Create and monitor a watchlist of non-standard hosts (e.g., those outside of security or development teams) making any DNS query to known CT log domains. Any match from a host on this list generates a high-fidelity alert. 2. (Statistical) For all hosts, establish a baseline of DNS query volume and the number of unique CT domains queried per hour. Use percentile-based outlier detection (e.g., alert if query count exceeds the 99th percentile of the host's own 30-day history) to flag abnormal spikes. Additionally, calculate the entropy of the queried CT second-level domains per host; a high entropy score indicates scanning across multiple distinct services. 3. (Machine Learning) Employ a time-series decomposition model for each host's query volume to CT domains. This model separates the data into trend, seasonality, and residual components. An alert is triggered when the residual component (unexplained traffic) exceeds a dynamically determined threshold, indicating a statistically significant anomaly."
          },
          {
            "description": "A single external IP address initiates an unusually high number of SSL/TLS handshakes or requests certificates from a diverse range of the organization's public-facing hostnames (via SNI) in a short period.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ, Public-facing Web Servers, Edge Routers, Load Balancers",
            "action": "1. (Symbolic) Monitor for connections from external IP addresses present on high-confidence threat intelligence feeds for scanning activity. An SSL/TLS handshake (Zeek ssl.log) initiated from such an IP to any public-facing asset should trigger a high-priority alert. 2. (Statistical) For each external source IP, track the count of unique `server_name` (SNI) values requested and distinct destination hosts connected to within a 5-minute window. Calculate a baseline distribution for these counts across all external IPs. An alert is generated if a source IP's activity falls in the top percentile (e.g., 99.5th) for either unique SNIs requested or unique hosts contacted. 3. (Machine Learning) Use an unsupervised learning algorithm like DBSCAN to cluster external connection events based on features like source IP, number of unique SNIs, and inter-request timing. Clusters that are small and dense but exhibit high internal diversity (many SNIs/hosts) can be automatically flagged as anomalous scanning activity characteristic of targeted reconnaissance, distinguishing them from benign crawlers."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]