[
  {
    "information_requirement": "Has the adversary modified system images to evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1601",
        "name": "Modify System Image",
        "evidence": [
          {
            "description": "File transfer containing a known malicious system image, identified by file hash or a specific filename from threat intelligence, to a network device or critical system.",
            "data_sources": [
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "If Zeek's file extraction is enabled, calculate and extract file hashes (MD5, SHA1) from Zeek files.log for any transfers to network device management interfaces or critical systems. Inner join these hashes against a CTI feed of known malicious firmware/image hashes. Also, use regular expressions to search Zeek ftp.log and http.log for specific filenames known to be associated with malicious images. Alert on any match for high-confidence detection."
          },
          {
            "description": "Execution of command-line tools and command sequences on a host consistent with staging and transferring a new system image to a network device.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 on administrative workstations for command-line activity involving file download tools (`curl`, `wget`) and file transfer clients (`tftp`, `scp`, `ftp`). Correlate these process events with subsequent outbound connections in Zeek conn.log to network device IPs on management ports (21, 22, 69). Create a detection pattern for a sequence of events: download of a `.bin` or `.img` file, followed by a connection from a transfer client to a network device. Analyze command arguments for signs of image transfer."
          },
          {
            "description": "Detection of a large file transfer over protocols like TFTP, SCP, FTP, or HTTPS to a network device's management interface from an unusual source or at an unusual time.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek conn.log for connections to network device management IPs over common file transfer ports (21, 22, 69, 443). Baseline normal data transfer volumes for these connections. Use descriptive statistics (mean, standard deviation) or IQR to flag transfers with anomalously large byte counts (>10MB is a potential starting point). Correlate with Zeek files.log, ftp.log, or http.log to identify filenames with extensions like `.bin`, `.img`, `.swi`, `.ios`, `.tar`. Use time series analysis to detect transfers occurring outside of established maintenance windows."
          },
          {
            "description": "An unauthorized or atypical host establishing a management session (SSH, Telnet, HTTPS) with a network device, immediately followed by a large file transfer or commands indicative of an image update.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain and use a baseline of authorized administrative hosts that manage network devices. Monitor Zeek conn.log for management connections (SSH, Telnet, HTTPS) originating from non-baselined source IPs. For any such connection, immediately analyze the session for follow-on indicators: anomalously large data transfers (based on byte counts in conn.log) or interactive SSH commands related to image management (e.g., 'copy tftp', 'install', 'upgrade' if visible in Zeek ssh.log). Use correlation analysis to link the unauthorized access to the suspicious file transfer within a short time window (e.g., 5 minutes)."
          },
          {
            "description": "A network device or system exhibiting anomalous network behavior (e.g., new listening ports, beaconing to external IPs, changes in traffic fingerprint) following a suspected image modification event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Following an alert for a potential image transfer, pivot to the target device's IP address. Establish a pre-alert baseline of its network behavior. Use time series analysis on Zeek conn.log data post-alert to detect anomalies: new listening ports, connections to rare or known-bad external destinations (potential C2 beaconing), or significant changes in traffic volume or protocol mix. Use Zeek's fingerprinting capabilities (e.g., JA3 for TLS, HASSH for SSH) to detect changes in the device's software stack, which could indicate a modified image. Correlate with Zeek notices (e.g., `Weird_Activity`) originating from the device."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]