[
  {
    "information_requirement": "Is the adversary evading defenses by downgrading system images?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1601.002",
        "name": "Downgrade System Image",
        "evidence": [
          {
            "description": "Transfer of a network device system image file whose file hash matches a known-vulnerable, older version.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Extract file hashes for all files transferred via protocols monitored by Zeek (e.g., FTP, HTTP, SMB, TFTP). Compare these hashes against a curated database of hashes for known-vulnerable network device system images. Generate an alert for any match. This database should be maintained and updated with information on exploitable legacy images for all network devices in the environment."
          },
          {
            "description": "Execution of specific commands on a network device to change the primary boot image configuration to an unauthorized or older image file.",
            "data_sources": [
              "Zeek syslog.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek syslog.log for configuration change logs from network devices. Use regular expressions to search for specific commands used to set the boot image, such as `boot system flash:/<image_name>.bin` (Cisco IOS) or `set system image default-boot-images` (Juniper Junos). Correlate command usage with the user account or source IP that initiated the session. Flag any commands that point to an image file name that is not on the approved baseline list for that device model."
          },
          {
            "description": "A network device reporting an operating system version or image name that is older than the established configuration baseline after a reboot.",
            "data_sources": [
              "Zeek syslog.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a configuration baseline, such as in a CMDB, of approved OS versions and image file names for all network devices. Monitor Zeek syslog.log for boot-up messages or periodic health/status checks that include the device's running version information. Upon detection of such a message, parse the version string or image name and compare it against the baseline for that specific device. Alert on any device reporting a version that is older than or does not match the approved baseline."
          },
          {
            "description": "An anomalous transfer of a system image file (e.g., .bin, .img) to a network device, particularly from an untrusted source or outside of a planned maintenance window.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek files.log for transfers of files with extensions common to system images (.bin, .img, .swi, .pkg). Analyze the source and destination of these transfers using Zeek conn.log. Establish a baseline for normal image transfer behavior (e.g., from specific network management servers during defined maintenance windows). Use descriptive statistics and frequency analysis to flag transfers that are anomalous in terms of source (e.g., non-admin workstation, external IP), time (outside maintenance window), or size (mismatched with expected image sizes). Use correlation analysis to link the file transfer to a user session or source IP."
          },
          {
            "description": "A sequence of events involving an image file transfer to a network device, followed by a boot configuration change, and culminating in a device reboot within a short time frame.",
            "data_sources": [
              "Zeek files.log",
              "Zeek syslog.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlated rule that triggers on a specific sequence of events within a defined time window (e.g., 30-60 minutes). The sequence is: 1) An image file is transferred to a device's management IP (Zeek files.log); 2) A configuration command to change the boot variable is logged from the device (Zeek syslog.log); 3) A reboot message is logged from the device (Zeek syslog.log). If the initial trigger was a management script on a Windows host, the sequence can start with Windows Event ID 4688 showing the script execution. Correlate all events using the device's IP address and timestamps. Alert on the completion of this entire behavioral pattern."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]