[
  {
    "information_requirement": "Is the adversary developing resources by acquiring and installing digital certificates for their infrastructure?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608.003",
        "name": "Install Digital Certificate",
        "evidence": [
          {
            "description": "Connections to destinations whose SSL/TLS certificate details (e.g., hash, serial number) or associated infrastructure (IP, domain) match known malicious indicators.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Extract certificate SHA1 hashes, serial numbers, and subject common names from Zeek ssl.log and x509.log. Correlate these atomic indicators, along with the destination IP from Zeek conn.log, against a high-confidence, continuously updated threat intelligence feed of known malicious certificates and C2 infrastructure. Generate a high-priority alert for any confirmed match."
          },
          {
            "description": "Connections to servers using SSL/TLS certificates with suspicious characteristics, such as typosquatted domains, generic subject information, issuance by free Certificate Authorities commonly abused by adversaries, or weak cryptographic parameters.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "From Zeek ssl.log and x509.log, analyze certificate subject CN/SANs for common typosquatting patterns (e.g., using Levenshtein distance against a list of legitimate company domains). Flag certificates from free CAs (e.g., Let's Encrypt, ZeroSSL) where the subject domain has a recent creation date. Identify certificates with overly generic subject fields (e.g., 'localhost', 'admin', default vendor names) or where the subject CN does not match the server name indicated in the SNI field of Zeek ssl.log. Use descriptive statistics to flag the use of uncommonly weak cipher suites or key lengths (e.g., MD5, key length < 2048)."
          },
          {
            "description": "Anomalous patterns observed in the overall population of SSL/TLS certificates, such as a sudden increase in connections to new, never-before-seen certificate issuers or domains, or certificates with unusually short validity periods.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a historical baseline of all observed certificate issuers, subject hashes, and subject domains from Zeek x509.log. Use time series analysis to detect anomalous spikes in the rate of new, first-seen issuers or domains being accessed via SSL/TLS. Calculate the distribution of certificate validity periods across the enterprise; use Inter-Quartile Range (IQR) or percentile analysis to flag connections to servers with certificates having unusually short lifespans (e.g., < 30 days), as this is a common indicator of adversary-registered certificates."
          },
          {
            "description": "An internal host making outbound connections to multiple distinct external servers that all present newly observed or suspicious (e.g., self-signed, short-lived) SSL/TLS certificates within a short timeframe.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "First, identify suspicious certificates based on other detection criteria (e.g., newly seen hash, self-signed status from Zeek x509.log, short validity period). Aggregate these connection events by source IP address from Zeek conn.log. Using a sliding time window (e.g., 24 hours), count the number of distinct suspicious remote servers contacted by each internal host. Use frequency analysis or calculate the standard deviation of this count across all internal hosts to identify outliers, which may indicate a compromised host communicating with a distributed C2 infrastructure."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]