[
  {
    "information_requirement": "Is the adversary collecting network information via SNMP MIB dumps?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1602.001",
        "name": "SNMP (MIB Dump)",
        "evidence": [
          {
            "description": "SNMP traffic (UDP/161) communicating with external IP addresses or internal IPs on known malicious infrastructure lists.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor Zeek conn.log for traffic on UDP port 161. Alert on any session where the source or destination IP is external to the network, as SNMP should be restricted internally. Additionally, inner join the source and destination IPs from Zeek snmp.log against a CTI feed of known malicious IPs and alert on any matches. Prioritize alerts where the source is an internal host not authorized for network management."
          },
          {
            "description": "Use of common or default SNMP community strings (e.g., 'public', 'private', 'manager') in SNMP requests originating from non-management hosts.",
            "data_sources": [
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the 'community' field in Zeek snmp.log. Maintain a denylist of common, default, and weak community strings ('public', 'private', 'manager', etc.). Alert when a request using a string from this list is observed. Correlate the source IP of the request with an asset inventory to increase alert priority if the source is not an authorized network management station."
          },
          {
            "description": "Execution of known SNMP enumeration tools (e.g., snmpwalk, snmp-check) or PowerShell/WMI commands for SNMP querying on hosts not designated for network administration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events. Flag executions of common SNMP tools (`snmpwalk`, `snmp-check`, `nmap -sU -p 161`) or command-lines containing SNMP-related PowerShell cmdlets (`Get-SNMP*`, `Invoke-SNMP*`). Maintain a list of authorized network management hosts and alert on any such activity occurring on other endpoints or servers, especially user workstations."
          },
          {
            "description": "Anomalous volume and frequency of SNMP GET/GETNEXT requests originating from a single source host, indicative of a brute-force scan or MIB dump.",
            "data_sources": [
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate Zeek snmp.log data by source IP, destination IP, and time window (e.g., 5 minutes). Establish a baseline for the normal number of SNMP requests per source host. Use time series analysis to detect sudden spikes in request volume. Use descriptive statistics and percentile analysis (e.g., flag any host generating request volumes in the 99th percentile) to identify outliers. A box-plot of request counts per source can visually identify hosts with anomalously high activity."
          },
          {
            "description": "A single host querying a large number of distinct MIB Object Identifiers (OIDs) or targeting a wide range of network devices in a short period, characteristic of a network-wide reconnaissance scan.",
            "data_sources": [
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each source IP within a defined time window, calculate the number of unique destination hosts queried and the entropy of the requested OIDs from Zeek snmp.log. Establish a baseline for both metrics for authorized management hosts. An unusually high number of unique destinations or high OID entropy from a single source indicates a broad scanning or 'walking' behavior. Use correlation analysis to relate a high destination count with high OID entropy from a single source, which is a strong indicator of a malicious MIB dump."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]