[
  {
    "information_requirement": "Is the adversary staging or utilizing pre-positioned capabilities to support operations against the network?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608",
        "name": "Stage Capabilities",
        "evidence": [
          {
            "description": "Network connections from internal hosts to external IP addresses, URLs, or domains that are present on high-confidence threat intelligence feeds for known C2 servers, malware distribution points, or phishing infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join network logs (Zeek conn.log destination IPs, http.log host headers, dns.log queries) with a diverse set of CTI feeds (updated at least hourly) that list known malicious indicators. Prioritize feeds specific to active C2 infrastructure, malware hosting sites, and exploit kits. Alert on any matches and investigate the associated internal host for compromise."
          },
          {
            "description": "Network traffic containing specific patterns associated with malware or C2 frameworks, such as known malicious User-Agent strings, specific URI structures, or TLS/SSL client fingerprints (JA3/JA3S).",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan Zeek http.log for known malicious User-Agent strings and URI patterns used by adversary tools to download payloads from staged sites. Maintain and regularly update a list of these signatures. For encrypted traffic, analyze Zeek ssl.log to compute JA3 and JA3S hashes. Compare these hashes against a list of known fingerprints for malware families and C2 frameworks (e.g., Cobalt Strike, Metasploit, etc.). Use correlation analysis to link hosts generating these patterns to other suspicious activity."
          },
          {
            "description": "Connections to external destinations exhibiting suspicious network or certificate characteristics, such as communication over non-standard ports, use of self-signed or newly issued SSL/TLS certificates, or dynamic DNS domains.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log to identify TCP/UDP sessions to external IPs on ports not commonly associated with the application protocol (e.g., HTTPS over port 8081). From Zeek ssl.log, flag connections using self-signed certificates or certificates with a very short validity period or recent issuance date (<30 days). Analyze Zeek dns.log for queries to known dynamic DNS providers often used for C2. Use descriptive statistics to baseline normal port usage and certificate issuers, and flag significant deviations or rare occurrences for investigation."
          },
          {
            "description": "Outbound connections to newly registered domains (NRDs), domains with low reputation scores, or domains with names algorithmically generated (DGA) or designed to typosquat legitimate services.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enrich Zeek dns.log data by correlating queried domains with WHOIS information to determine registration date and with domain reputation services. Flag all connections (from Zeek conn.log) to domains registered within the last 30-60 days (NRDs). Analyze the character distribution and entropy of domain names to detect potential DGA activity. Use string comparison algorithms (e.g., Levenshtein distance) to compare queried domains against a list of high-value internal and external domains to detect typosquatting. Investigate hosts connecting to domains with these suspicious properties."
          },
          {
            "description": "Anomalous download activity from public code repositories (e.g., GitHub, GitLab) or file-sharing services (e.g., Pastebin, Dropbox), followed by suspicious process execution on an internal host.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Baseline normal interaction with common code and file sharing platforms. Monitor Zeek http.log and files.log for downloads of executables, scripts, or archives from these platforms, especially from raw content endpoints (e.g., raw.githubusercontent.com). Correlate network download events with subsequent process creation events (Windows Event ID 4688) on the same host within a short time window (e.g., < 5 minutes), looking for the execution of the downloaded file. Use time series analysis to detect unusual spikes in download volume from these platforms across the organization or from a single host."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]