[
  {
    "information_requirement": "Is the adversary developing resources for exploitation via drive-by target?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608.004",
        "name": "Drive-by Target",
        "evidence": [
          {
            "description": "A successful network connection is established from an internal host to a domain or IP address present on a threat intelligence feed specifically identifying infrastructure for drive-by-compromise, watering holes, or exploit kits.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Web Proxy, DNS Resolvers, Firewall Egress Points, Threat Intelligence Platform",
            "action": "1. (Symbolic) Continuously correlate all outbound DNS queries (Zeek dns.log) and HTTP/S connections (Zeek http.log, conn.log) against high-confidence threat intelligence feeds identifying domains/IPs known for hosting exploit kits or drive-by content. Generate a high-priority alert for any match. 2. (Statistical) For each host, calculate a 24-hour rolling count of connections to threat-intel-flagged domains. Flag any host whose count exceeds the 95th percentile for all hosts, indicating an unusual level of interaction with known-bad infrastructure. 3. (Machine Learning) Use a classification model (e.g., Logistic Regression) to assign a risk score to each outbound connection. Features should include threat intelligence match status, domain reputation, connection data volume, and historical connection frequency to the destination. A high score predicts a likely malicious connection."
          },
          {
            "description": "An internal host is observed making a series of HTTP requests across more than 3 distinct, non-affiliated domains within 5 seconds, where the HTTP Referer header links each request sequentially, indicative of a redirection chain.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Web Proxy, Network Taps, Endpoint Web Browsers",
            "action": "1. (Symbolic) Reconstruct browsing sessions by correlating Zeek http.log entries by source IP and timestamp, using the 'Referer' header. Identify redirection chains (HTTP 3xx or script-based) where any domain in the chain matches a blocklist of known malicious redirectors or ad networks. 2. (Statistical) Calculate the enterprise-wide distribution of redirection chain lengths and durations. Flag any session whose chain length or speed (hops/second) falls in the top 5th percentile as anomalous. Also, calculate the Jaccard similarity between the set of domains in a redirection chain and known legitimate domain sets; a low similarity score is suspicious. 3. (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) on session features like chain length, duration, number of unique Autonomous System Numbers (ASNs), and final destination domain age to group similar browsing behaviors and identify outlier clusters representing malicious redirection patterns."
          },
          {
            "description": "An internal host establishes a connection to an internet domain registered within the last 60 days that also exhibits other low-trust characteristics, such as privacy-protected WHOIS records or being hosted on non-traditional infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Resolvers, Enterprise Web Proxy, Threat Intelligence Platforms",
            "action": "1. (Symbolic) Ingest a real-time feed of newly registered domains (NRDs) and alert on any internal DNS query or HTTP request to a domain on that list, especially if the domain has WHOIS privacy enabled. 2. (Statistical) Establish a baseline for the average age of domains visited by users. Alert when a user visits a domain whose age is a statistical outlier (e.g., more than 3 standard deviations below the mean age, or in the bottom 1st percentile). Track the rate of NRD visits per host and flag hosts with a statistically significant increase. 3. (Machine Learning) Use a time series forecasting model (e.g., Prophet, ARIMA) on the enterprise-wide NRD visit count. An observed count that significantly exceeds the predicted forecast's confidence interval indicates a potential widespread campaign."
          },
          {
            "description": "A file downloaded from a low-reputation domain has a calculated Shannon entropy score above 7.0 (for scripts) or is a file type (e.g., .exe, .dll) not typically served by that domain's historical profile, followed by a new process execution on the host.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Enterprise Web Proxy, Network File Analysis Sandbox",
            "action": "1. (Symbolic) Scan all downloaded files identified in Zeek files.log using YARA rules designed to detect common obfuscators, packers, and exploit kit payloads. Correlate a file download with a subsequent process creation (Windows Event ID 4688) by the browser on the same host within 1 minute. 2. (Statistical) For each domain, profile the MIME types and file extensions it commonly serves. Use a chi-squared test to identify significant deviations (e.g., a news site serving an executable). Calculate Shannon entropy for all downloaded scripts and flag any script with an entropy score in the top 5th percentile as potentially obfuscated. 3. (Machine Learning) Train a decision tree classifier to identify malicious downloads. Features should include file entropy, domain reputation, domain age, file MIME type, if the download originated from a long redirection chain, and if the parent process is a web browser. "
          },
          {
            "description": "A statistically significant spike in outbound connections from an internal host to known advertising networks is followed within 5 minutes by a connection to a newly registered domain or a domain with a low reputation score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Firewall Egress Points, DNS Resolvers, Enterprise Web Proxy",
            "action": "1. (Symbolic) Maintain a list of known malicious ad network domains. Alert on any connection from an internal host to a domain on this list that is immediately followed by a connection to a known bad IP or a domain from a threat intel feed. 2. (Statistical) For each internal host, baseline the volume of connections (bytes and count) to domains categorized as 'Advertising'. Use a moving average and standard deviation to detect spikes (e.g., volume > 3 standard deviations above the moving average). For any host triggering a spike, analyze its subsequent connections for statistical rarities, such as connections to domains never before seen in the organization's logs. 3. (Machine Learning) Use a time series anomaly detection model (e.g., Seasonal Hybrid ESD) to identify unusual enterprise-wide traffic spikes to ad networks. For hosts contributing to the anomaly, use a pre-trained classifier to score the risk of their subsequent web activity based on features like destination domain age, reputation, redirection chain presence, and connection port."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]