[
  {
    "information_requirement": "Has the adversary modified network device operating system images or memory to evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1601.001",
        "name": "Patch System Image",
        "evidence": [
          {
            "description": "Network device OS image hash matches a known-bad hash from threat intelligence, or the image contains signatures associated with known firmware malware.",
            "data_sources": [
              "Network Device OS Image Files",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Periodically download network device OS images. Calculate the cryptographic hash (e.g., SHA256) and compare it against a cyber threat intelligence (CTI) feed of known-bad firmware hashes. Additionally, scan the downloaded image file with YARA rules designed to detect known firmware implants (e.g., SYNful Knock, DOUBLEFANTASY). Correlate any file transfers of these images observed in Zeek logs with the hash findings and alert on matches."
          },
          {
            "description": "Integrity check failure where a network device's running or stored OS image has a cryptographic hash that does not match the official vendor-provided known-good hash.",
            "data_sources": [
              "Network Device OS Image Files",
              "Network Device Logs"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a golden image repository with official, vendor-supplied OS images and their corresponding known-good cryptographic hashes. Periodically, or upon detection of suspicious activity, securely download the running image from network devices. Calculate its hash and verify it against the golden repository. Alert on any mismatch, as this indicates an unauthorized modification requiring immediate investigation."
          },
          {
            "description": "Execution of a specific sequence of commands on a network device that matches the known installation or modification procedures of firmware-level malware.",
            "data_sources": [
              "Network Device Logs (syslog/audit)"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Develop and apply correlation rules that search for specific, ordered sequences of commands associated with known firmware malware installation procedures (e.g., copying a new image via TFTP, modifying the boot variable to point to the new image, then deleting transfer logs or disabling logging). Monitor network device audit logs for these command patterns, especially when executed by non-administrative accounts or outside of authorized maintenance windows. Alert on any pattern matches."
          },
          {
            "description": "Anomalous file transfer activity involving network device OS images, characterized by unusual sources, destinations, timing, or protocols outside of established maintenance baselines.",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek tftp.log",
              "Zeek conn.log",
              "Network Device Logs"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal OS image management activity, including authorized source IP addresses/subnets, approved protocols (e.g., SCP only), and scheduled maintenance windows. Monitor Zeek logs (ftp, tftp, conn) and device logs for any file transfers involving OS image filenames that deviate from this baseline. Use time series analysis to detect activity outside normal hours and correlation analysis to link transfers from unauthorized sources. Calculate the entropy of source IPs transferring images; a sudden increase may indicate anomalous activity."
          },
          {
            "description": "Use of privileged debug commands or direct memory access/modification functions on a network device outside of sanctioned troubleshooting or maintenance activities.",
            "data_sources": [
              "Network Device Logs (syslog/audit)"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create an allow-list of privileged, potentially dangerous commands (e.g., vendor-specific debug, poke, or memory-write commands) and the authorized user accounts/groups permitted to use them. Monitor network device audit logs for any execution of these commands. Alert on any usage by unauthorized accounts or usage that occurs outside of a pre-approved change request window. Use descriptive statistics to flag users or devices that execute these commands with unusually high frequency."
          },
          {
            "description": "Unauthorized or unusual modification of a network device's boot configuration, such as changing the boot image path, altering the boot order, or disabling secure boot features.",
            "data_sources": [
              "Network Device Logs (syslog/audit)",
              "Console access logs"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Periodically poll and snapshot the boot configuration of critical network devices (e.g., 'show boot' or equivalent command output). Compare the current configuration against a known-good baseline state stored in a configuration management database. Monitor device audit logs in real-time for configuration change commands related to boot variables (e.g., 'boot system flash...'). Alert on any unauthorized changes or modifications that point the device to a new, unverified image file. Correlate these changes with console access logs or remote logins to attribute the activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]