[
  {
    "information_requirement": "Has the adversary escalated privileges by escaping from a container or virtualized environment?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1611",
        "name": "Escape to Host",
        "evidence": [
          {
            "description": "Execution of known container escape exploit tools or payloads on the host, identified by file hash or name.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On container host servers, monitor process creation events (Windows Event ID 4688). For each new process, calculate the file hash of the executable and cross-reference it against a CTI feed of known container escape exploit tools and malware. Also, compare the process name against a list of known malicious executable names associated with container escapes. Alert on any matches."
          },
          {
            "description": "A specific sequence of process creation and file modification events matching a known container escape exploit chain (e.g., CVE-specific patterns involving shared volumes).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and monitor for specific sequences of events associated with escape vulnerabilities. For example: 1. A containerized process (identified via Windows Event ID 4688) writes to a sensitive host path mounted as a volume (identified via Windows Event ID 4663 object access auditing). 2. A privileged host process subsequently executes a file from that path (identified via Windows Event ID 4688). Correlate these events using Process IDs, Parent Process IDs, and timestamps within a narrow time window (e.g., < 1 minute) to detect this write-then-execute pattern."
          },
          {
            "description": "A process running on the host with a parent process that is part of a container's process tree, indicating a breakout.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) on container hosts. Identify processes running within a container context (e.g., under a specific job object, user context, or known container process tree). Alert if a new process is created outside that container context but its 'Parent Process Name' or 'Parent Process ID' belongs to a process known to be inside the container. This parent-child relationship across the container boundary is a strong behavioral indicator of an escape."
          },
          {
            "description": "Anomalous interaction with the Docker engine named pipe (e.g., \\\\.\\pipe\\docker_engine) from within a container, followed by privileged container creation or host command execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for processes (Windows Event ID 4688) running inside a container that attempt to communicate with the Docker named pipe. On the host, monitor for the execution of the Docker client (`docker.exe`) where the command line arguments request excessive privileges (`--privileged`), mount sensitive host directories (`-v /:/host`), or create a new container using a suspicious image. Correlate the timing of these commands with activity from within existing containers. Use frequency analysis to identify rare or unauthorized `docker` commands or unusual parent processes invoking the Docker client."
          },
          {
            "description": "A container process, especially one with elevated privileges, accesses or modifies sensitive host files or registry keys outside of its intended volumes.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable detailed object access auditing (Windows Event ID 4663) for sensitive host directories (e.g., C:\\Windows\\System32) and registry hives (e.g., HKLM\\SECURITY, HKLM\\SAM). Correlate access events with the source process information (from Windows Event ID 4688) to confirm if the process is containerized. Establish a baseline of normal file and registry access for your container workloads and use statistical analysis (e.g., frequency analysis, descriptive statistics) to alert on rare or anomalous access patterns from container processes to host resources, especially write or delete operations."
          },
          {
            "description": "A process spawned from a container escape establishes external network communication.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate host-based indications of a container escape (e.g., an anomalous host process spawned from a container) with network logs. Specifically, inner join the process ID and creation time (Windows Event ID 4688) of a suspected escaped process with network connection logs (Zeek conn.log) from the same host. Investigate any external network connections established by the escaped process, as this may indicate C2 communication or data exfiltration. Use time series analysis on the host's network traffic to spot anomalies that coincide with the timing of the potential escape."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]