[
  {
    "information_requirement": "Is the adversary attempting to discover information about the system?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1614.001",
        "name": "System Language Discovery",
        "evidence": [
          {
            "description": "Execution of a command line string that is an exact match to a known indicator for system language discovery used by a specific malware or threat actor group.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 process creation events for the full command line text. Maintain and apply a list of high-confidence, exact-match command-line strings known to be used by threat actors for language discovery (e.g., `cmd.exe /c \"systeminfo | findstr /B /C:\"System Locale\"\"` or specific arguments to `rundll32.exe`). Alert immediately on any exact match. This selector list should be updated based on threat intelligence reporting on specific tools and actors."
          },
          {
            "description": "Execution of common Windows command-line utilities or PowerShell cmdlets used to retrieve system language, locale, or keyboard layout information.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process command lines containing patterns indicative of language discovery. For native executables, look for `systeminfo` piped to `find` or `findstr` with keywords like 'Locale', 'Language', or 'Input'. For PowerShell, monitor for execution of `Get-Culture`, `Get-UICulture`, or accessing `.NET methods like `[System.Globalization.CultureInfo]::CurrentCulture`. Correlate execution with the parent process; execution by non-interactive or suspicious parent processes (e.g., Office applications, wscript.exe, mshta.exe) should be prioritized for investigation."
          },
          {
            "description": "Direct read access or queries to Windows Registry keys containing language, locale, or keyboard layout settings.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable and monitor SACLs for read access (generating Windows Event ID 4663) on the registry keys `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Nls\\Language`, `HKCU\\Control Panel\\International`, and `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Keyboard Layouts`. Baseline normal processes that access these keys (e.g., explorer.exe, ctfmon.exe, LogonUI.exe) by analyzing frequency and process paths. Use descriptive statistics (frequency analysis, low-frequency outlier detection) to alert on access from unusual, unsigned, or network-facing processes."
          },
          {
            "description": "An unusual process (e.g., unsigned, running from a non-standard directory, spawned by an Office application) performs system language discovery shortly after execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Event ID 4688) with subsequent language discovery activity (via command line monitoring from the same Event ID or registry access via Event ID 4663) occurring within a short time window (e.g., less than 60 seconds). Increase the alert score if the process has suspicious characteristics, such as being unsigned, having a high-entropy name, running from a user-writable path like `C:\\Users\\Public\\` or `C:\\ProgramData\\`, or being a child process of a browser, Office application, or script interpreter. Use correlation analysis to link these behavioral attributes to the discovery action."
          },
          {
            "description": "System language discovery is performed as part of a broader sequence of host reconnaissance activities by a single process or process tree.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify processes that perform language discovery (via command line or registry access) and track their subsequent or preceding actions within the same session. Flag any process that also performs other discovery actions, such as querying for system information (`systeminfo`), network configuration (`ipconfig /all`), running processes (`tasklist`), or user accounts (`query user`, `net user`) within a 5-10 minute window. Use correlation analysis based on Process GUID or Process ID to chain these discrete events into a single, high-fidelity behavioral alert indicating broader reconnaissance."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]