[
  {
    "information_requirement": "Is the adversary discovering cloud storage objects?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1619",
        "name": "Cloud Storage Object Discovery",
        "evidence": [
          {
            "description": "Cloud storage enumeration activity originating from IP addresses known to be malicious or part of an anonymizing proxy network (e.g., TOR).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor Zeek conn.log for connections to known cloud storage API endpoints (e.g., s3.*.amazonaws.com, *.blob.core.windows.net, storage.googleapis.com). Inner join the source IP addresses of these connections with a high-confidence, frequently updated CTI feed of known malicious IPs and TOR exit nodes. Alert on any matches and investigate the scope of the associated activity."
          },
          {
            "description": "Execution of specific command-line arguments or use of distinctive User-Agent strings associated with known cloud discovery tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 process creation events for command lines containing specific patterns indicative of known cloud discovery tools (e.g., 's3scanner', 'cloud_enum', 'aws s3 ls --recursive'). Concurrently, monitor Zeek http.log for API requests to cloud providers that contain non-standard or suspicious User-Agent strings associated with these offensive security tools. Maintain and regularly update a list of these tool-specific patterns for high-fidelity alerting."
          },
          {
            "description": "Anomalously high volume or frequency of API calls related to listing cloud storage objects from a single user, host, or source IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline for the number of connections per hour/day from internal sources to cloud storage API endpoints using Zeek conn.log. Use time series analysis or descriptive statistics (e.g., alerts when counts exceed the 95th percentile or mean + 3 standard deviations) to detect significant spikes. On hosts, monitor Windows Event ID 4688 for enumeration commands and alert when the frequency for a single host/user exceeds a learned or static threshold. Use correlation analysis to link high command frequency with high network connection rates from the same source."
          },
          {
            "description": "Cloud storage object enumeration activity performed by user accounts or service principals that deviate from their established individual or role-based activity baselines.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create activity profiles for users and service principals based on historical data, noting which accounts typically perform cloud enumeration tasks. Use frequency analysis and peer group analysis (clustering users by role) to establish baselines. Flag any user who performs enumeration commands (seen in Windows Event ID 4688) for the first time or whose network activity (seen in Zeek conn.log connections to cloud APIs) suddenly includes discovery behavior not previously seen from them or their peer group. Calculate the entropy of a user's daily commands or API call types to spot a sudden focus on discovery activities."
          },
          {
            "description": "A sequence of cloud storage object discovery followed shortly by anomalous data access, such as downloading multiple objects or modifying object permissions.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define a rule that triggers upon detection of a cloud storage enumeration event (from Windows Event ID 4688 or network patterns). This trigger should initiate heightened monitoring of the source user/IP for a short follow-on period (e.g., 30 minutes). During this window, look for signs of anomalous data access in Zeek conn.log, such as a high volume of data transferred (bytes_resp > baseline), or connections to an unusually high number of distinct object URLs. Use correlation analysis to link the initial discovery event with the subsequent data access, alerting on the combined malicious TTP."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]