[
  {
    "information_requirement": "Is the adversary executing code or commands using serverless functions or automation services?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1648",
        "name": "Serverless Execution",
        "evidence": [
          {
            "description": "Network traffic from known serverless egress IP ranges to external destinations matching threat intelligence feeds for known C2 servers or malicious domains.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a list of serverless egress IP ranges for relevant cloud providers. Filter Zeek conn.log and dns.log for all outbound traffic originating from these IPs. Inner join destination IPs and queried domains against a high-confidence, continuously updated threat intelligence feed. Alert on any matches, as this may indicate a compromised serverless function communicating with adversary infrastructure."
          },
          {
            "description": "Execution of suspicious commands or known malicious tool signatures on internal systems, initiated by a service account associated with a serverless function.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate successful logons by serverless-related service accounts (Windows Event ID 4624) with subsequent process creation events (Windows Event ID 4688). Scan the 'CommandLine' field for patterns associated with reconnaissance (`whoami`, `ipconfig`, `net view`, `nltest`), LOLBAS execution (`rundll32.exe`, `certutil.exe`), or known hacking tool command strings. Use regular expression matching against a curated list of malicious patterns and alert on detections."
          },
          {
            "description": "A serverless function's service account making network connections to an anomalous number or type of internal systems or services, deviating from its established baseline activity.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each service account used by serverless functions, establish a baseline of normal network activity, including typical destination IPs, ports, protocols, and connection frequency. Monitor Zeek conn.log and Windows authentication logs (Event ID 4624) for activity from these accounts. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect outliers in the number of unique hosts contacted or ports accessed. Apply entropy measures to destination IPs/ports over time to detect scanning behavior or unusually broad access patterns indicative of lateral movement."
          },
          {
            "description": "A service account associated with a serverless function executing an unusual sequence, hierarchy, or type of process on an internal system.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal parent-child process relationships and common process execution sequences for serverless service accounts on target systems using Windows Event ID 4688. Monitor for deviations, such as a data-processing script spawning `powershell.exe` or `cmd.exe`, or a sequence of reconnaissance commands (`whoami` -> `net user` -> `net group`). Model normal process chains and flag low-frequency or known-bad sequences that deviate from the established profile."
          },
          {
            "description": "Unusual data transfer patterns, such as large-volume data staging or exfiltration, originating from an internal system and correlated with serverless function activity.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate the timing of serverless function executions (inferred from on-prem service account activity) with network traffic patterns from internal systems to known cloud storage services or unusual external IPs. Monitor Zeek conn.log for sessions with unusually high `orig_bytes` values initiated by hosts accessed by serverless functions. Use time series analysis to detect significant spikes in outbound traffic volume from these hosts. Use linear regression to model expected data transfer sizes and flag significant positive residuals."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]