[
  {
    "information_requirement": "Has the adversary accessed credentials by stealing or forging authentication certificates?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1649",
        "name": "Steal or Forge Authentication Certificates",
        "evidence": [
          {
            "description": "Execution of processes matching file hashes of known certificate theft tools, or use of certificates with thumbprints matching known malicious certificates.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate process creation event hashes (from Windows Event ID 4688) against a cyber threat intelligence (CTI) feed of file hashes for known certificate manipulation tools (e.g., certipy, mimikatz, SharpCert, Rubeus). Separately, correlate certificate thumbprints observed in network traffic (from Zeek x509.log) against a CTI feed of known malicious or forged certificate thumbprints. Alert on any matches."
          },
          {
            "description": "Execution of commands with parameter patterns specific to known certificate theft and forging tools (e.g., certipy, mimikatz).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688 with command-line logging enabled) for command lines containing distinctive strings and argument patterns used by known tools. Use regular expression matching to detect command patterns like `certipy find -vulnerable`, `certipy auth -pfx`, `certipy req`, `mimikatz crypto::certificates /export`, or `Rubeus asktgs /pfx`. Maintain and update the list of patterns based on threat intelligence."
          },
          {
            "description": "Anomalous certificate enrollment requests, such as requests for vulnerable templates, or requests with Subject Alternative Names (SANs) that impersonate privileged accounts or domain controllers.",
            "data_sources": [
              "Windows Event ID 4886",
              "Windows Event ID 4898"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On Certificate Authority (CA) servers, monitor certificate services events (4886, 4898). Correlate the requester's identity with the certificate template and SAN being requested. Flag events where: 1) A user account requests a machine certificate template. 2) A request is made for a template with known vulnerabilities (e.g., templates enabling ESC1 with Client Authentication EKU and user-defined SAN). 3) A user-defined SAN attempts to impersonate another user/machine, especially a privileged one like a Domain Admin or Domain Controller. Use frequency analysis to identify rare or first-time requests of specific templates by users."
          },
          {
            "description": "Anomalous access to or export of private keys from protected storage, particularly by non-standard processes or users outside of normal administrative activity.",
            "data_sources": [
              "Windows Event ID 5058",
              "Windows Event ID 5059",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for key export events (Event ID 5058, 5059) and correlate them with the parent process (Event ID 4688) and user context. Establish a baseline of normal key export activity (e.g., by certlm.msc, specific admin scripts). Use correlation analysis to alert on exports initiated by non-standard processes (e.g., powershell.exe, cmd.exe, unsigned binaries) or by users who do not typically perform certificate management. Additionally, monitor for audited object access (Event ID 4663) on cryptographic key file paths (e.g., C:\\ProgramData\\Microsoft\\Crypto\\Keys) by unusual processes."
          },
          {
            "description": "Anomalous authentication patterns using certificates, including a switch to certificate authentication for an account that has never used it, or logons from unexpected systems for that user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4624 for successful logons using certificate credentials (Authentication Package: Kerberos or Schannel). For each user, establish a baseline of typical source hosts, geolocations, and frequency of certificate-based authentication. Use correlation analysis and statistical methods (e.g., IQR, percentile analysis) to detect deviations such as: 1) A user authenticating via certificate for the first time. 2) A user's certificate authentication originating from a host or IP they have never used before. 3) Impossible travel scenarios detected between consecutive certificate authentications. Correlate with Zeek x509.log to inspect certificate details (issuer, validity, SAN) for further anomalies."
          },
          {
            "description": "Unusual access to or staging of certificate files (.pfx, .p12, .pem) in non-standard locations, such as user directories or temporary folders, potentially followed by network exfiltration.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a baseline of normal locations and access patterns for certificate files. Monitor for file access events (Event ID 4663) on files with extensions like .pfx, .p12, .pem, .crt in unusual locations (e.g., %TEMP%, C:\\Users\\*, network shares). Correlate file read/write events with the responsible process (Event ID 4688) and subsequent outbound network connections (from Zeek conn.log) from that process within a short time window (e.g., 5 minutes). Use linear regression or correlation analysis to link high-volume file access with spikes in outbound data volume to detect potential exfiltration."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]