[
  {
    "information_requirement": "Has the adversary gained initial access to the network via content injection?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1659",
        "name": "Content Injection",
        "evidence": [
          {
            "description": "Malicious content delivered via injection containing known indicators of compromise, such as malicious file hashes, domains, IPs, or content signatures.",
            "data_sources": [
              "Zeek file.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze files extracted from network traffic (Zeek file.log) and check their hashes against CTI feeds of known malware. Correlate DNS queries (Zeek dns.log) and connections (Zeek conn.log) originating from endpoints that recently visited potentially compromised sites with lists of known C2 or malware-hosting domains/IPs. Scan injected content for specific signatures of known malware droppers."
          },
          {
            "description": "Execution of processes or scripts from unusual file paths associated with web content, such as browser cache or temporary internet folders, often with an anomalous parent-child process relationship.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events where the image path points to browser cache directories (e.g., INetCache, AppData\\...\\Cache), temporary download folders, or HTML Application (HTA) files executed from temporary locations. Maintain and alert on a list of anomalous parent-child relationships, such as a browser process (`chrome.exe`, `iexplore.exe`) directly spawning `powershell.exe`, `wscript.exe`, or `cmd.exe`. Use frequency analysis to identify rare execution paths and parent-child pairings."
          },
          {
            "description": "Anomalous file download followed by suspicious endpoint activity, such as unexpected process execution or outbound network connections, originating from a process associated with web browsing.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek file.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate a web download event (Zeek http.log, file.log) with subsequent process creation (Windows Event ID 4688) and outbound network connections (Zeek conn.log) from the same host within a short time window (e.g., 1-5 minutes). Build a risk score based on the rarity of the downloaded file type, the reputation of the source domain, the nature of the child process (e.g., living-off-the-land binary), and the destination of the new network connection. Use a linear regression model to correlate download size with subsequent network traffic volume to find outliers."
          },
          {
            "description": "Discrepancies in web content characteristics, such as sudden changes in response size, presence of mixed HTTP/HTTPS content, or unexpected changes in TLS certificates for frequently visited, legitimate websites.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For high-value or frequently visited internal/external websites, establish a baseline of typical response sizes, content types, and TLS/SSL certificate characteristics (from Zeek http.log, ssl.log). Monitor for significant deviations from this baseline using time series analysis or statistical process control methods. Alert on an increase in HTTP responses on pages that are typically HTTPS-only, or changes in the issuer or subject of the TLS certificate, which could indicate on-path content injection."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary using content injection for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command-And-Control",
    "indicators": [
      {
        "technique_id": "T1659",
        "name": "Content Injection",
        "evidence": [
          {
            "description": "C2 communication hidden within legitimate web traffic containing known malicious artifacts, such as specific C2 domains/IPs, file hashes, or hardcoded beacons/commands.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek file.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Cross-reference destination domains/IPs from Zeek dns.log and conn.log against CTI feeds of known C2 servers. Scan the content of HTTP requests/responses (Zeek http.log) and extracted files (Zeek file.log) for signatures of known C2 frameworks, command strings, or unique identifiers. Inner join connection logs with CTI data and investigate any matches, especially those to otherwise trusted services like CDNs or social media platforms."
          },
          {
            "description": "Repetitive or structured communication patterns to legitimate services, such as specific URI structures, predictable parameter encoding, or unusual User-Agents/JA3 hashes, indicative of a known C2 protocol tunneled over HTTP/S.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Define and search for known C2 patterns in HTTP traffic (Zeek http.log), such as specific URI paths (`/gate.php`), parameter names (`?id=`, `?data=`), or specific User-Agent strings used by malware. Correlate with unusual JA3/JA3S hashes (Zeek ssl.log) known to be associated with C2 tools. Use regular expression matching on URI, headers, and post bodies for these patterns. Analyze the entropy of URI parameters; consistently low or high entropy compared to a baseline can be a pattern for specific C2 channels."
          },
          {
            "description": "Anomalous data transfer or connection timing characteristics disguised within traffic to legitimate web services, such as periodic 'heartbeat' connections, unusual data-to-session ratios, or connections outside of normal user activity hours.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze network connections (Zeek conn.log) to legitimate domains for behavioral anomalies. Use time series analysis to detect periodic connections (beaconing) by calculating the time delta between connections from a single host to a single destination. Profile the typical data size of requests/responses (Zeek http.log) to these services per user/host and use IQR or Z-scores to identify significant outliers that may represent hidden C2 data. Correlate connection times with typical user interactive hours to spot automated, non-interactive traffic."
          },
          {
            "description": "Unusual encoding or high entropy discovered within specific parts of web traffic to legitimate services, suggesting data is being hidden or exfiltrated within seemingly benign requests.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze specific fields within legitimate-looking traffic for signs of hidden data. Calculate the entropy of DNS query labels (subdomains) in Zeek dns.log, as high entropy can indicate DNS tunneling for C2. Analyze the entropy of HTTP POST bodies, URI parameters, or cookie values (Zeek http.log) sent to common domains (e.g., social media, paste sites, cloud storage). Establish a baseline entropy for normal traffic to these services and alert on significant deviations, which could indicate encoded/encrypted data being used for C2 or exfiltration."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]