[
  {
    "information_requirement": "Is the adversary maintaining persistence by modifying power settings to prevent system sleep or lockdown?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1653",
        "name": "Power Settings",
        "evidence": [
          {
            "description": "Execution of a script or executable with a known malicious hash associated with tools that modify power settings for persistence.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688). For each new process, compute or retrieve the executable's file hash. Correlate these hashes against a high-confidence threat intelligence feed of known malicious file hashes, specifically flagging any hashes associated with malware families known to use T1653. Alert on any matches."
          },
          {
            "description": "Direct use of the powercfg.exe utility with specific command-line arguments to disable sleep/hibernate modes or set timeouts to indefinite values.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Windows Event ID 4688 for process creations where the Process Name is `powercfg.exe`. Analyze the Command Line field for specific arguments known to disable power-saving states, such as `/hibernate off`, `/change standby-timeout-ac 0`, `/change monitor-timeout-ac 0`, or `/setactive` followed by a high-performance scheme GUID. Use regular expressions to find these patterns and alert, as they are uncommon outside of initial system configuration."
          },
          {
            "description": "Modification of specific registry keys controlling power, screen saver, or system lock settings using command-line tools like reg.exe.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Windows Event ID 4688 for process creations where the Process Name is `reg.exe`. Inspect the Command Line field for `ADD` or `MODIFY` operations targeting known registry paths that control power or screen lock settings (e.g., `HKCU\\Control Panel\\Desktop\\ScreenSaveActive`, `ScreenSaveTimeout`; `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Power\\PowerSettings\\*`). Flag modifications that set timeouts to '0' or disable features, especially if executed in a non-interactive context or by an unusual user account."
          },
          {
            "description": "Execution of power management utilities (e.g., powercfg.exe) by an anomalous parent process, such as a document reader, web browser, or script interpreter involved in an exploit chain.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creations of `powercfg.exe`. For each instance, analyze the Parent Process Name. Establish a baseline of legitimate parent processes (e.g., `explorer.exe`, `cmd.exe`, `powershell.exe`). Use frequency analysis and rule-based logic to flag executions spawned by unusual parents (e.g., `winword.exe`, `acrordr32.exe`, `wscript.exe`), which could indicate post-exploitation persistence activity."
          },
          {
            "description": "A host's power settings are modified, followed shortly by the establishment of persistent, low-and-slow, or otherwise anomalous network connections indicative of C2 communication.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a temporal correlation rule. First, identify hosts where power settings were modified via `powercfg.exe` or `reg.exe` (using Windows Event ID 4688). Then, within a defined time window (e.g., 1 hour) following the modification, analyze Zeek conn.log for network traffic from that host's IP. Use time series analysis to detect new, long-running connections or periodic beaconing behavior. Cross-reference destination IPs with threat intelligence feeds. Use correlation analysis to link the host event with the network behavior and flag systems likely configured for persistent C2 access."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]