[
  {
    "information_requirement": "Is the adversary attempting to use externally acquired access or credentials to compromise the organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1650",
        "name": "Acquire Access",
        "evidence": [
          {
            "description": "Authentication attempts using credentials known to be compromised and available from specific data breaches or dark web marketplaces.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously ingest lists of compromised corporate credentials from Cyber Threat Intelligence (CTI) services that monitor data breaches and dark web forums. Create a high-priority watchlist of these specific user accounts. Monitor all authentication events (Windows Event IDs 4624, 4625) at the network perimeter (e.g., ADFS, VPN gateways) for these specific accounts. Any authentication attempt, successful or failed, from an account on this list should trigger a high-severity alert for immediate investigation, as it confirms an adversary is attempting to operationalize acquired credentials."
          },
          {
            "description": "A widespread, high-rate pattern of failed login attempts across numerous accounts, consistent with a credential stuffing attack using a list of acquired credentials.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor perimeter authentication services for failed login events (Windows Event ID 4625). Aggregate events by source IP, source subnet, and source ASN over short time windows (e.g., 5-15 minutes). Identify sources that generate a high volume of failures across a large number of distinct user accounts. Use descriptive statistics and correlation to identify credential stuffing patterns (many accounts, one source) and distinguish them from brute-force patterns (one account, one or many sources). Use time series analysis to detect sudden spikes in the overall failed login rate."
          },
          {
            "description": "Successful authentication for a user account from a highly anomalous source (e.g., TOR exit node, high-risk ASN, unusual geography) with no prior history of access for that user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For every successful external authentication event (Windows Event ID 4624), enrich the source IP address from Zeek conn.log with geolocation, ASN, and service-type metadata (e.g., known public VPN, TOR exit node, hosting provider vs. residential ISP) from CTI feeds. Establish a baseline of normal access patterns (countries, ASNs, ISPs) for each user. Use statistical methods like frequency analysis to calculate a rarity score for each new login source. Flag successful logins from sources that are highly anomalous for that specific user or are associated with high-risk services, indicating potential use of a purchased or acquired account."
          },
          {
            "description": "An account logs in successfully for the first time shortly after its credentials appeared in a third-party data breach, especially if followed by anomalous post-login behavior.",
            "data_sources": [
              "Windows Event ID 4624",
              "Active Directory security logs"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Ingest data from CTI services detailing corporate accounts found in third-party breaches. When a successful login (Windows Event ID 4624) occurs for an account on this breach list, correlate the login timestamp with the breach date. Flag the 'first use post-breach' event and place the session under heightened monitoring. Use correlation analysis to link this initial access event with subsequent unusual activity, such as attempts to register a new MFA device, create mail forwarding rules, or access sensitive data repositories not typical for that user's role."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]