[
  {
    "information_requirement": "Is the adversary using hidden infrastructure for Command and Control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1665",
        "name": "Hide Infrastructure",
        "evidence": [
          {
            "description": "Network connections to or from IP addresses, domains, or SSL/TLS certificates known to be part of malicious hidden infrastructure, such as C2 redirectors, malicious proxies, or known abused CDN infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate network connection logs (Zeek conn.log), DNS queries (Zeek dns.log), and SSL/TLS certificate information (Zeek ssl.log for subject, issuer, and SHA1 hash) against high-confidence threat intelligence feeds that specifically track malicious proxies, VPNs, redirectors, and C2 infrastructure. Alert on any confirmed matches and investigate the associated internal host's activity."
          },
          {
            "description": "Use of self-signed or free SSL/TLS certificates (e.g., Let's Encrypt) for connections to IP addresses within cloud provider ranges not typically associated with the organization's services, or exhibiting unusual JA3/JA3S hashes.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek ssl.log for connections where the certificate issuer is a free Certificate Authority (like Let's Encrypt) or is self-signed (where the `issuer` field matches the `subject`). Correlate these events with the destination IP address from Zeek conn.log. Flag instances where the destination IP belongs to a cloud provider (e.g., AWS, Azure, GCP, DigitalOcean) not whitelisted for corporate use. Separately, hunt for known malicious or unusual JA3/JA3S TLS client/server fingerprints associated with C2 frameworks that utilize hidden infrastructure."
          },
          {
            "description": "DNS queries for domains hosted on dynamic DNS providers or exhibiting patterns indicative of DNS tunneling, often used to obscure C2 server locations.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a list of known dynamic DNS providers (e.g., no-ip.com, duckdns.org). Monitor Zeek dns.log for queries to these domains from internal hosts. Analyze query/response record types and sizes; unusually large TXT record responses or high query rates to a single domain may indicate DNS tunneling. Use entropy measures on subdomain labels (e.g., `qhvbjwex.example.com`) to detect algorithmically generated domains (DGAs) often used in conjunction with hidden C2 infrastructure."
          },
          {
            "description": "A chain of network connections where an internal host communicates with a legitimate, high-reputation domain (e.g., CDN, cloud storage) which is immediately followed by suspicious C2-like traffic, indicating potential Domain Fronting or use of C2 redirectors.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify internal hosts connecting to high-reputation domains (e.g., major CDNs like Cloudflare, Akamai; cloud services like Google Drive) by analyzing Zeek dns.log and Zeek ssl.log (for SNI). For HTTP/S traffic, inspect the `Host` header in Zeek http.log and compare it to the SNI in Zeek ssl.log or the resolved IP's owner; a mismatch is a strong indicator of domain fronting. For all traffic, perform time-based correlation analysis to detect if these connections are immediately followed by beaconing activity (small, regular connections) or large data transfers from the same internal host. Investigate these chained sessions."
          },
          {
            "description": "Persistent or periodic 'beaconing' connections from internal hosts to destinations categorized as proxies, VPNs, or non-standard cloud infrastructure, especially over non-standard ports or with anomalous low-and-slow data transfer patterns.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enrich Zeek conn.log with IP categorization data (e.g., identifying VPNs, TOR nodes, proxies, specific cloud providers). Filter for connections from internal hosts to these categories. Apply time series analysis to detect connections occurring at regular intervals (e.g., every 5 minutes +/- jitter). Analyze connection statistics; C2 heartbeats are often characterized by long durations with very small, periodic data transfers. Use descriptive statistics (mean, standard deviation of bytes transferred per session) and clustering algorithms to identify hosts exhibiting this low-and-slow C2 pattern, especially on non-standard ports."
          },
          {
            "description": "Internal C2 traffic directed to a single domain that resolves to a rapidly changing set of IP addresses over time, particularly IPs in geographically diverse or residential network ranges, indicating the use of a fast-flux DNS network to hide the true C2 server.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each internal host, track the domains it queries over time in Zeek dns.log. For domains that receive repeated queries, monitor the set of resolved IP addresses (`answers` field). Flag domains that resolve to a rapidly changing set of IPs, especially those with low Time-To-Live (TTL) values, and where the IPs belong to disparate hosting providers, countries, or residential network blocks. Use correlation analysis to link connection attempts in Zeek conn.log to these DNS resolutions. Calculate the entropy of the resolved IP address set for a given domain over a 24-hour period to identify and score potential fast-flux candidates."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]