[
  {
    "information_requirement": "Is the adversary employing email spoofing for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1672",
        "name": "Email Spoofing",
        "evidence": [
          {
            "description": "Inbound emails originating from IP addresses or containing domains known to be associated with malicious campaigns or spoofing activity.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate the source IP address of inbound emails (from Zeek conn.log and smtp.log's 'id.orig_h' field) and any domains found in email headers (e.g., 'From', 'Reply-To', 'Return-Path' in Zeek smtp.log) against a high-confidence, frequently updated threat intelligence feed of known malicious IPs and domains. Alert on any confirmed matches and prioritize investigation."
          },
          {
            "description": "Inbound emails with forged sender addresses that fail, bypass, or have weak standard email authentication mechanism policies (SPF, DKIM, DMARC).",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek smtp.log for inbound emails where DMARC/SPF/DKIM validation results indicate failure (e.g., 'fail', 'softfail', 'permerror'). Additionally, flag emails where the 'From' header contains a high-value domain (e.g., internal, financial, key partners) but the DMARC policy is reported as 'p=none' or is missing entirely, as this indicates a lack of enforcement that can be abused. Use correlation analysis to identify campaigns targeting specific internal users."
          },
          {
            "description": "Inbound emails where the user-visible 'From' header domain mismatches the SMTP envelope 'MAIL FROM' domain, particularly when the 'From' header claims to be an internal or trusted domain.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Parse Zeek smtp.log to compare the domain in the 'from' field with the domain in the 'mailfrom' field for every inbound email. Create a high-priority alert when the 'from' domain is internal or on a trusted partner list, but the 'mailfrom' domain is different and external/unrelated. Use frequency analysis to identify repeated attempts from the same 'mailfrom' domain or IP address to spoof various trusted 'from' domains."
          },
          {
            "description": "A sudden spike in inbound email volume from a single external IP address that is spoofing a trusted internal or external sender domain.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate inbound email counts from Zeek smtp.log, grouping by source IP address (from conn.log) and the claimed 'from' domain. Establish a baseline of normal email volume for these groupings. Use time series analysis or statistical process control methods (e.g., flagging volumes that exceed 2-3 standard deviations from the mean, or using an Inter-Quartile Range (IQR) test for outliers) to detect anomalous spikes in volume from a single source spoofing a trusted domain. Investigate the source IP for reputation and other concurrent suspicious activities."
          },
          {
            "description": "Inbound emails where the combination of the claimed sender domain and the true originating network (IP, ASN, Country) is anomalous compared to established historical communication patterns.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each trusted sender domain observed in the 'From' header, build and maintain a baseline profile of legitimate source IP addresses, Autonomous System Numbers (ASNs), and source countries using historical Zeek conn.log and smtp.log data. For each new inbound email, compare its origin against the sender's established profile. Flag emails from a trusted domain that originate from a rare or never-before-seen source IP, ASN, or country. Use entropy measures on the set of source countries/ASNs for a given 'From' domain over time to detect unusual diversification that could indicate a distributed spoofing campaign."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]