[
  {
    "information_requirement": "Is the adversary attempting to discover virtual machines within the environment?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1673",
        "name": "Virtual Machine Discovery",
        "evidence": [
          {
            "description": "Network connections to hypervisor management interfaces from internal IP addresses associated with known malicious activity or prior security alerts.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a dynamic internal watchlist of IP addresses associated with confirmed malicious activity or high-severity security alerts. Continuously inner join this watchlist with Zeek conn.log data where the destination IP and port match known hypervisor management interfaces (e.g., vCenter, ESXi, Hyper-V Manager). Alert on any connection from a watchlisted source IP to a critical hypervisor asset for immediate investigation."
          },
          {
            "description": "Execution of commands using specific tool names, command-line arguments, or registry queries known to be used for discovering virtual machine environments and hypervisors.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) with command-line logging enabled across servers and relevant endpoints. Create and apply a list of regular expressions to detect known VM discovery commands, including: hypervisor CLIs (e.g., `esxcli`, `vim-cmd`, `Get-VM`); native OS tools (e.g., `systeminfo | findstr /i \"virtual\"`, `wmic computersystem get model,manufacturer`); and direct registry queries (e.g., `reg query HKLM\\HARDWARE\\DESCRIPTION\\System /f \"VMware\"`). Alert on any process creation matching these patterns."
          },
          {
            "description": "An internal host performing network sweeps or an unusual number of connection attempts across multiple ports targeting subnets known to contain hypervisors or management interfaces.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log to identify source IPs initiating connections to a large number of unique destination IPs or ports within designated hypervisor subnets over a short time window. Establish a baseline for normal connection diversity per host. Use descriptive statistics (e.g., count of distinct destination IPs/ports per source IP per minute) and flag sources exceeding a dynamic threshold (e.g., >3 standard deviations from the mean or a fixed count like >20 hosts in 1 minute) as potential scanners."
          },
          {
            "description": "Anomalous use of legitimate hypervisor APIs or CLI tools, such as execution by non-administrative users, access from unusual source hosts, or a sudden burst of enumeration commands from a single source.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile the normal usage of hypervisor management tools (CLI via Event ID 4688) and web APIs (via Zeek http.log). Baseline which users, hosts, and source IPs typically perform these actions and at what frequency. Use frequency analysis and statistical methods like Inter-Quartile Range (IQR) or time series analysis to detect anomalies such as: a user who has never run `esxcli` before suddenly executing it, a server outside the management subnet connecting to the vCenter API, or a sudden spike in `Get-VM` commands. Calculate the entropy of commands per user session to detect unusually broad discovery activity."
          },
          {
            "description": "A sequence of suspicious authentication events (e.g., brute-force, login from a rare source) to a hypervisor management server, immediately followed by virtual machine enumeration activity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a chained alert that correlates suspicious authentication events (e.g., multiple failed logins [Event ID 4625] followed by a success [Event ID 4624] from the same source IP) on a hypervisor management server with subsequent VM discovery activity. Within a short time window (e.g., 5-15 minutes) after the suspicious login, use correlation analysis based on username, source IP, and timestamps to search for command-line execution of discovery tools (Event ID 4688) or anomalous network connections (Zeek conn.log) to other hypervisor interfaces originating from the user or source host of the suspicious login."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]