[
  {
    "information_requirement": "Has an adversary stolen web session cookies to impersonate a user?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1539",
        "name": "Steal Web Session Cookie",
        "evidence": [
          {
            "description": "An executable file with a hash matching a known cookie-stealing tool is observed on an endpoint, or a network connection is established to a domain or IP address associated with Adversary-in-the-Middle (AitM) phishing infrastructure.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Network Egress Points, Web Proxies",
            "action": [
              "Symbolic: Compare the file hash from Windows Event ID 4688 or Zeek files.log against a threat intelligence feed of known cookie-stealing malware signatures. Concurrently, compare destination IPs and server names from Zeek conn.log and http.log against a feed of known AitM C2 infrastructure. Generate a high-severity alert on any match.",
              "Statistical: Calculate the enterprise-wide prevalence of file hashes (from EID 4688) and destination domains (from Zeek dns.log) over a 30-day rolling window. Score any hash or domain with a prevalence below the 1st percentile as high-risk, especially if it co-occurs with other suspicious behaviors on the same host.",
              "Machine Learning: Submit hashes of newly observed executables (from EID 4688 or Zeek files.log) to a pre-trained file classification model. If the model returns a 'malicious' or 'credential theft' classification with a confidence score above a predefined threshold (e.g., 0.85), escalate for immediate analysis."
            ]
          },
          {
            "description": "A process is created with command-line arguments or a PowerShell script is executed containing strings indicative of cookie theft tools, scripts, or direct access to browser cookie storage paths.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Developer Laptops",
            "action": [
              "Symbolic: Scan the command line field in Windows Event ID 4688 and script block text in Windows Event ID 4104 for regular expressions matching known tool strings (e.g., 'sekurlsa::cookies', 'lazagne.exe browsers') and direct paths to browser cookie databases (e.g., 'AppData\\Local\\Google\\Chrome\\User Data\\Default\\Cookies'). Trigger a high-severity alert on any match.",
              "Statistical: For processes like 'powershell.exe', 'cmd.exe', and 'cscript.exe', calculate the Shannon entropy of the command line arguments (EID 4688) or script block content (EID 4104). Establish a baseline entropy score for each user. Flag any execution where the entropy exceeds the 98th percentile of the user's historical baseline, indicating potential obfuscation or complex scripting.",
              "Machine Learning: Feed features extracted from command lines (e.g., length, character distribution, presence of keywords like 'cookie' or 'export', count of special characters) into a trained logistic regression or gradient boosting classifier. Classify each new command in real-time and alert on any command predicted as malicious with high confidence."
            ]
          },
          {
            "description": "A process not on an established whitelist of approved web browsers or utilities attempts to read from or requests a handle to a browser's cookie database file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Virtual Desktop Infrastructure (VDI) instances",
            "action": [
              "Symbolic: Configure SACLs on browser cookie store directories (e.g., Chrome's 'User Data', Firefox's 'Profiles'). Monitor for access events (EID 4663/4656) and alert on any access where the Process Name is not on a pre-defined whitelist of approved browsers and system utilities (e.g., 'chrome.exe', 'firefox.exe', 'msedge.exe', approved backup agents).",
              "Statistical: For each host, create a baseline profile of all processes that legitimately access cookie store files over a 30-day period. On a daily basis, compare the set of accessing processes against this baseline using a Jaccard similarity score. A score below a threshold (e.g., 0.8) indicates a deviation and should be flagged for review.",
              "Machine Learning: Train a one-class SVM or isolation forest model on benign access patterns to cookie stores, using features like process name, parent process name, user context, and time of day. Deploy the model to score new access events in real-time and flag any event identified as an outlier or anomaly."
            ]
          },
          {
            "description": "A non-browser or untrusted process requests a handle to a browser process with high-privilege access rights, such as PROCESS_VM_READ, indicating a potential memory scraping attempt.",
            "data_sources": [
              "Windows Event ID 4656",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical System Servers with browser access",
            "action": [
              "Symbolic: Monitor Windows Event ID 4656 for handle requests where the Object Name is a browser process (e.g., 'chrome.exe'). Alert if the Source Process Name is not a known system process (e.g., 'lsass.exe'), security tool, or debugger, AND the 'AccessList' contains high-privilege rights like 'PROCESS_VM_READ' or 'PROCESS_ALL_ACCESS'.",
              "Statistical: Establish a baseline of normal process-to-process handle requests involving browsers. Use a first-seen analysis to alert when a source process requests a handle to a browser process for the very first time across the enterprise. Additionally, monitor the rate of these high-privilege requests per host and alert if the rate exceeds 3 standard deviations from the host's daily average.",
              "Machine Learning: Model the hourly volume of 'PROCESS_VM_READ' requests targeting browser processes using a time series forecasting model (e.g., ARIMA, Prophet). Generate an alert when the observed volume of requests significantly exceeds the predicted upper confidence interval, indicating a potential mass scraping event."
            ]
          },
          {
            "description": "Network traffic to a trusted website exhibits anomalies such as an SSL certificate from an unexpected Certificate Authority, a rare JA3/JA3S fingerprint, or an unusually large cookie header.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, VPN Concentrators",
            "action": [
              "Symbolic: From Zeek ssl.log, compare the 'issuer' field for SSL certificates associated with high-value domains (e.g., internal SSO, O365, Salesforce) against a strict whitelist of expected Certificate Authorities. Any certificate issued by an unexpected authority is a critical alert for potential AitM.",
              "Statistical: For each user session to a high-value domain, baseline the JA3/JA3S client/server fingerprints (Zeek ssl.log) and the length of the cookie header (Zeek http.log). Alert when a new session uses a JA3/JA3S hash never before seen for that user/domain combination, or if the cookie length exceeds the 99th percentile of the historical distribution for that domain.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features from Zeek logs (http.log, ssl.log, conn.log) for sessions to sensitive web applications. Features should include source IP, user-agent, JA3, cookie length, and request/response size ratios. Sessions that are classified as noise or outliers by the algorithm represent anomalous browsing patterns that may indicate AitM or session hijacking."
            ]
          },
          {
            "description": "A browser process spawns an anomalous child process, such as a command shell, scripting interpreter, or other utility not typically associated with browser operations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Proxies, DNS Servers",
            "action": [
              "Symbolic: From Windows Event ID 4688, create a high-severity alert for any event where the 'ParentProcessName' is a known browser (e.g., 'chrome.exe', 'msedge.exe', 'firefox.exe') and the 'NewProcessName' is a shell or scripting interpreter (e.g., 'cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'bash.exe').",
              "Statistical: Generate a baseline of all parent-child process relationships across the enterprise. Using frequency analysis, identify and alert on rare relationships where a browser is the parent. A relationship with a prevalence below the 0.1st percentile (e.g., 'firefox.exe' spawning 'ftp.exe') should be investigated as a high-fidelity anomaly.",
              "Machine Learning: Train a decision tree or random forest classifier to predict if a parent-child process relationship is malicious. Use features like parent process name, child process name, child process command-line arguments, user context, and host. The model can learn high-risk patterns (e.g., 'msedge.exe' -> 'powershell.exe -enc ...') and flag them in real time."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]