[
  {
    "information_requirement": "Has an adversary attempted to access or exfiltrate a copy of the Active Directory NTDS database for credential theft?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003.003",
        "name": "NTDS",
        "evidence": [
          {
            "description": "A large, single-file network transfer (>500MB) originates from a Domain Controller to an external or internal non-DC destination, with file metadata or traffic characteristics indicative of an NTDS database file.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internet Gateway, Domain Controller network interfaces",
            "action": [
              "Create a SIEM rule to alert when Zeek conn.log shows a connection where id.orig_h is a Domain Controller and id.resp_h is an external IP, and the transferred bytes (orig_bytes) exceeds 500MB. Correlate with Zeek files.log where tx_hosts matches the DC IP and filename matches 'ntds.dit', '*.dit', or a GUID pattern, suggesting a renamed file.",
              "For all outbound connections from Domain Controllers, establish a 30-day rolling baseline of orig_bytes. Alert on any single connection that exceeds the 99th percentile of data volume. Further scrutinize if the destination ASN or country has not been seen in the baseline period.",
              "Train a Random Forest classification model to score the likelihood of malicious egress from Domain Controllers. Features should include: orig_bytes, resp_p (destination port), protocol, duration, destination IP reputation, destination ASN, JA3 hash from Zeek ssl.log, and a boolean for whether the destination is internal or external. A high probability score triggers an alert."
            ]
          },
          {
            "description": "Execution of a process on a Domain Controller with a process name or command-line arguments matching known NTDS dumping utilities (e.g., ntdsutil, vssadmin, impacket-secretsdump) or suspicious script blocks.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Create a SIEM rule to alert on Windows Event ID 4688 or Sysmon Event ID 1 from a DC where ProcessName is 'ntdsutil.exe', 'vssadmin.exe', or 'powershell.exe' AND the CommandLine contains 'ifm', 'create shadow', 'secretsdump.py', 'Invoke-NinjaCopy', 'Invoke-DCSync', or 'Copy-VSS'. Also monitor Event ID 4104 for script blocks containing these strings.",
              "For all command-line executions on Domain Controllers, calculate the Shannon entropy of the command-line arguments for generic processes like 'powershell.exe' or 'cmd.exe'. Alert when the entropy of a command line exceeds the 95th percentile of the established baseline, indicating high complexity or obfuscation, and contains suspicious substrings like 'NTDS', 'SystemRoot', or 'dit'.",
              "Utilize a sequence analysis model (e.g., LSTM) to analyze parent-child process relationships. Train the model on normal process chains on Domain Controllers (e.g., services.exe -> lsass.exe). Alert on anomalous sequences, such as a web server process (w3wp.exe) or an interactive logon process spawning 'ntdsutil.exe' or 'vssadmin.exe'."
            ]
          },
          {
            "description": "A process not associated with normal AD operations or approved backup solutions (e.g., lsass.exe, System, specific backup agents) reads the NTDS.dit file on a Domain Controller.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller file systems, specifically the %SystemRoot%\\NTDS\\ directory",
            "action": [
              "After enabling auditing via a SACL on the NTDS.dit file, create a SIEM rule to alert on Windows Event ID 4663 where ObjectName ends with '\\NTDS\\ntds.dit' and the ProcessName is not in an allowlist ('lsass.exe', 'System', 'dfm.exe', 'vmms.exe', 'veeam.exe'). Additionally, monitor Sysmon Event ID 11 for any process creating a file with a '.dit' extension outside of the primary NTDS directory.",
              "Establish a 30-day baseline of all unique (ProcessName, SubjectUserName) tuples that access the NTDS.dit file via Event ID 4663. Alert if a tuple not present in the baseline attempts to access the file. Further risk-score the event based on time of day, alerting if access occurs outside of established backup windows (e.g., 1 AM - 4 AM).",
              "Implement an isolation forest model to detect anomalous access to the NTDS.dit file. Use features from Event ID 4663 such as ProcessName, SubjectUserName, LogonID, and AccessMask. The model profiles normal access patterns and flags any access events that it classifies as outliers, indicating a deviation from established legitimate activity."
            ]
          },
          {
            "description": "A Volume Shadow Copy is created on a Domain Controller, where the creation event is initiated by a non-service account or outside of a scheduled backup window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Create a SIEM rule to alert on Windows Event ID 4688 from a DC where CommandLine contains 'vssadmin create shadow' or Event ID 4104 contains 'New-VSSShadowCopy', and the initiating SubjectUserName is not on an allowlist of designated backup and administrative service accounts.",
              "Model the time series of Volume Shadow Copy service start events (Event ID 7036, 'VSS service started') and 'vssadmin create' commands (Event ID 4688). Use a seasonal decomposition model to establish daily and weekly patterns. Alert on any VSS creation event that is a statistical outlier and does not correlate with the known backup schedule.",
              "Develop a decision tree classifier to determine if a VSS creation event is malicious. Features should include: initiating ProcessName, SubjectUserName, user's group memberships (e.g., Domain Admin vs. Backup Operator), time of day, and whether the event is followed by file access to NTDS.dit (Event ID 4663) or a large network egress (Zeek conn.log) within a 10-minute window."
            ]
          },
          {
            "description": "A network host that is not an authorized Domain Controller sends a 'DsGetNcChanges' (DCSync) replication request to a Domain Controller.",
            "data_sources": [
              "Zeek dce_rpc.log",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting to Domain Controllers, Authentication Servers",
            "action": [
              "Create a SIEM rule to alert on any Zeek dce_rpc.log event where the 'operation' is 'DsGetNcChanges' and the 'id.orig_h' (source IP) is not on a pre-defined allowlist of Domain Controller and approved application IP addresses. Also, monitor Windows Event ID 4662 with Properties containing the Directory Service Replication GUID '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2' where the Subject's SID is not a DC.",
              "Maintain a baseline of user and machine accounts that legitimately perform replication activity. Calculate the count of distinct source hosts making 'DsGetNcChanges' requests per hour. Alert if this count spikes more than three standard deviations above the rolling 7-day average, indicating a potential widespread DCSync-style attack from multiple non-DC sources.",
              "Use a graph-based anomaly detection algorithm to model the network graph of DC replication. Nodes are hosts (IPs) and edges represent 'DsGetNcChanges' requests. The sudden appearance of an edge from a node not classified as a Domain Controller to a DC node would be flagged as a structural anomaly, indicative of a DCSync attack."
            ]
          },
          {
            "description": "A host-based NTDS access or dumping event on a Domain Controller is followed within 5 minutes by a large or anomalous network data transfer from the same host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Egress Points, Internet Gateway",
            "action": [
              "Create a correlation rule that triggers when a host alert for T1003.003 (e.g., 'vssadmin create shadow' or 'unauthorized ntds.dit access') on a DC is followed within 5 minutes by a network connection (from Zeek conn.log or Sysmon Event ID 3) from that same host to any destination where the outbound byte count exceeds the 99th percentile of that DC's typical outbound connection size.",
              "For each DC, use an Exponentially Weighted Moving Average (EWMA) on the time series of outbound data volume. If a host-based trigger event (like 'ntdsutil' execution) occurs, monitor the EWMA for the next 15 minutes. An alert is generated if the observed volume causes a statistically significant deviation in the EWMA, indicating a sustained, anomalous transfer.",
              "Train a two-state (Benign, Exfiltrating) Hidden Markov Model using sequences of events from each DC. The observation alphabet includes discrete events like 'vssadmin_create', 'ntdsutil_ifm', 'rare_process_access_ntds', and 'large_network_tx'. An alert is generated when the Viterbi algorithm finds the most likely hidden state sequence to be 'Exfiltrating' with a high probability score following a host-based trigger."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]