[
  {
    "information_requirement": "Has the adversary attempted to dump credentials from compromised systems?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003",
        "name": "OS Credential Dumping",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) is observed with a process name or command-line argument matching a known credential dumping tool, correlated with a network file transfer (Zeek files.log) of a file whose hash matches a known malicious signature.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations (PAWs), Network Egress Points",
            "action": [
              "Create a detection rule that queries for process creation events (Windows Event ID 4688) where the process name matches a watchlist of known credential dumping tools (e.g., mimikatz.exe, procdump.exe, fgexec.exe, pwdump.exe). Create a second rule to search Zeek files.log for md5 or sha1 hashes that match a threat intelligence feed of known malicious tools.",
              "For all file transfers in Zeek files.log, calculate the rarity of the file's MIME type and file extension combination. Profile the frequency of executable (.exe) or script (.ps1) transfers over non-standard ports using Zeek conn.log. Flag file transfers that fall above the 99th percentile for this rarity score or that use a suspicious port.",
              "Train a binary classification model (e.g., Random Forest) using features from process creation events (parent process, command-line length, command-line entropy, user context) and file transfer events (file size, MIME type, source/destination subnets) to predict whether the event is indicative of a credential dumping tool."
            ]
          },
          {
            "description": "A PowerShell script block log (Windows Event ID 4104) contains obfuscated content (indicated by high entropy) or specific strings, function calls, and API invocations (e.g., Invoke-Mimikatz, LsaSecrets) associated with credential dumping modules.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Servers, Active Directory Domain Controllers",
            "action": [
              "Create a SIEM rule to search PowerShell script block logs (Windows Event ID 4104) for keywords such as `Invoke-Mimikatz`, `Get-GPPPassword`, `sekurlsa::logonpasswords`, `LsaSecrets`, `DumpCreds`, or `MiniDumpWriteDump`. Use regular expressions to detect base64-encoded or concatenated versions of these commands.",
              "For each script block log, calculate the Shannon entropy of the script content and the character frequency distribution. Establish a baseline for normal script entropy on your systems. Flag any scripts with entropy scores exceeding 3 standard deviations from the mean, as they are likely obfuscated.",
              "Develop a time-series anomaly detection model (e.g., ARIMA) on the frequency and average entropy of PowerShell script executions per host. An anomalous spike in the execution of high-entropy scripts on a single host could indicate the deployment of a malicious PowerShell framework. Concurrently, use a pre-trained text classification model to classify new scripts in real-time."
            ]
          },
          {
            "description": "A sequence of command-line executions is observed within a short time window, where a process creates a volume shadow copy (e.g., vssadmin.exe, wmic.exe) and is immediately followed by a process that copies ntds.dit, SAM, or SYSTEM files from the newly created shadow copy path.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for NTDS.dit), All Windows Systems (for SAM/SYSTEM hives)",
            "action": [
              "Create a correlation rule that triggers when `vssadmin.exe create shadow`, `diskshadow.exe`, or `wmic.exe shadowcopy create` is executed, followed within a 10-minute window by a process copying `NTDS.dit`, `SAM`, or `SYSTEM` files from a shadow copy path (e.g., `\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy*`). Also, alert on direct execution of `ntdsutil.exe` with `ifm` or `activate instance ntds` commands.",
              "Profile the frequency of `reg.exe save`, `vssadmin.exe`, and `ntdsutil.exe` commands per user and per host. Alert when the execution count for a specific user or on a non-DC host exceeds the 99th percentile of the established historical baseline for that entity.",
              "Use a sequence analysis model, like a Hidden Markov Model (HMM), to detect the specific chain of commands associated with credential harvesting (e.g., `vssadmin create` -> `copy from shadow` -> `vssadmin delete`). Train the model on both benign administrative command sequences and known attack patterns to differentiate between legitimate and malicious activity."
            ]
          },
          {
            "description": "A file transfer is logged in Zeek files.log containing a filename commonly associated with Linux credentials (e.g., 'shadow', 'id_rsa', 'authorized_keys'), or an SSH session (Zeek ssh.log) exhibits an anomalously high ratio of server-to-client data transfer for a short-duration session.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing critical Linux servers, Network egress points, VPN concentrators",
            "action": [
              "Create a detection rule that searches Zeek files.log for transfers where the `filename` field contains `shadow`, `passwd`, `.ssh/id_rsa`, or `.gnupg/*key*`. Alert if the transfer protocol is unencrypted (e.g., FTP, HTTP) or if the destination is an external IP address.",
              "For each SSH session in Zeek ssh.log, calculate the ratio of bytes sent from the server to the client (`resp_bytes` in conn.log) versus bytes sent from the client to the server (`orig_bytes`). A very high ratio after a short interactive session can indicate large file exfiltration. Flag sessions that are statistical outliers (e.g., greater than 3 standard deviations from the mean ratio).",
              "Use a graph-based anomaly detection algorithm on conn.log data to model normal communication patterns between hosts. Identify anomalous edges in the graph, such as a web server initiating an SSH connection to a database server. Augment this by clustering SSH sessions based on features like duration, bytes transferred, and client/server software versions to find outlier sessions."
            ]
          },
          {
            "description": "A Sysmon Event ID 10 log indicates a process not on an established allowlist (e.g., svchost.exe, wininit.exe, approved security tools) has requested a handle to the lsass.exe process with high-risk access rights, specifically including PROCESS_VM_READ (0x10) or PROCESS_ALL_ACCESS (0x1F0FFF).",
            "data_sources": [
              "Sysmon Event ID 10",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Servers, Domain Controllers",
            "action": [
              "Using Sysmon Event ID 10 (`ProcessAccess`), create a high-severity alert for any process accessing the `lsass.exe` target process where the `GrantedAccess` code includes `0x1010` or `0x1410`, and the `SourceImage` is not in a pre-defined allowlist of legitimate system and security processes.",
              "Build a baseline of all processes that access `lsass.exe`. Profile the frequency of access per source process name. Any process that has never been seen accessing LSASS before or whose access frequency suddenly spikes should be flagged. Calculate the rarity of the `GrantedAccess` code requested by each source process; a rare, high-privilege request from a common process is highly suspicious.",
              "Train a classification model (e.g., Logistic Regression or a decision tree) to determine if an LSASS access event is malicious. Features should include the source process name, parent process name, user context, the requested access mask, and whether the source process is digitally signed. Use labeled data from known goodware and malware to train the model."
            ]
          },
          {
            "description": "A directory replication request (e.g., GetNCChanges) is observed in network traffic (Zeek dce_rpc.log) originating from a source IP not in an allowlist of Domain Controllers, or a Windows Event ID 4662 is logged on a DC for the 'DS-Replication-Get-Changes' object with an account name that is not a DC computer account.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dce_rpc.log",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network links between domain member segments and the DC segment",
            "action": [
              "Create a rule that alerts when Windows Event ID 4662 is generated on a DC with `Accesses: Replicating Directory Changes` and the `Account Name` is not a DC computer account (i.e., does not end in `$`). Also, monitor Zeek dce_rpc.log for `drsuapi` or `MS-DRSR` operations where the source IP is not in the allowlist of DC IPs.",
              "Establish a baseline of the volume and frequency of replication traffic (bytes, connections) between known DCs using Zeek conn.log. A sudden increase in replication requests from a single DC, or the appearance of replication-like traffic patterns from a non-DC, should be flagged as a statistical anomaly.",
              "Use a peer group analysis or clustering algorithm (e.g., K-Means) on hosts that initiate replication requests. All legitimate DCs should cluster together based on their behavior (protocols used, request frequency, time of day). Any host that initiates replication but falls outside this primary cluster is a strong candidate for a malicious DCSync attack."
            ]
          },
          {
            "description": "A file access event (Windows Event ID 4663) is logged for the SAM file (%SystemRoot%\\system32\\config\\SAM) by a process not on a strict allowlist of system processes (e.g., lsass.exe, System), or a registry access event (Windows Event ID 4657) is logged for a sensitive LSA key (e.g., HKLM\\SECURITY\\Policy\\Secrets) by a non-system process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Systems, Domain Controllers",
            "action": [
              "With object access auditing enabled on the SAM file and the `HKLM\\SECURITY\\Policy\\Secrets` registry key, create an alert for any access event (Windows Event IDs 4663, 4656, 4657) where the `Process Name` is not in a strict allowlist of known good processes (e.g., `lsass.exe`, `services.exe`, `System`, approved backup agents).",
              "Profile the time-of-day for legitimate access to these objects (typically during boot or patching). Use a percentile-based approach to score access events based on their timing. Flag any access occurring outside the 5th-95th percentile of normal access times as anomalous.",
              "Develop a one-class SVM (Support Vector Machine) model trained exclusively on legitimate access patterns to the SAM file and LSA registry keys. Any new access event that falls outside the learned boundary of 'normal' behavior is classified as an anomaly requiring investigation."
            ]
          },
          {
            "description": "A Windows System Event ID 12 from source Wininit contains the string 'LSA was not started as a protected process', or a registry modification event (Windows Event ID 4657) is logged for the HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\RunAsPPL key, setting its value to a disabled state.",
            "data_sources": [
              "Windows Event ID 12",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows 8.1/Server 2012 R2 and newer systems, especially Domain Controllers and PAWs",
            "action": [
              "Create a high-priority alert that triggers immediately upon detection of Windows System Event ID 12 from source `Wininit` which contains the string 'LSA was not started as a protected process'. Additionally, create an alert for any modification (Windows Event ID 4657) to the registry key `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\RunAsPPL`.",
              "While this is primarily a binary condition, monitor the frequency of any modifications to the parent `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa` key. A host showing a statistically significant increase in modifications to this sensitive area, compared to its own baseline or its peer group, should be investigated for related tampering.",
              "Use a configuration drift detection model. Train an autoencoder on the 'golden image' configuration of key security registry keys, including the `RunAsPPL` value. Periodically feed the current configuration of hosts into the model. A high reconstruction error for a given host signifies a significant and potentially unauthorized deviation from the baseline."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]