[
  {
    "information_requirement": "Is the adversary exfiltrating data over an unauthorized Bluetooth channel?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1011.001",
        "name": "Exfiltration Over Bluetooth",
        "evidence": [
          {
            "description": "Execution of a process, identified by its file hash or name, matching a known malicious tool or script capable of Bluetooth data transfer.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations and Laptops, especially those of high-value targets",
            "action": [
              "Symbolic: Query process creation events (Windows Event ID 4688, Sysmon Event ID 1) with command-line logging enabled. Compare the file hash of each new process against a threat intelligence feed of known Bluetooth-capable malware. Generate a high-severity alert for any confirmed match.",
              "Statistical: Establish a baseline of all processes executed across the enterprise. Calculate the prevalence (percentage of hosts a process runs on) for each process hash. Flag any process with a prevalence below the 1st percentile that also imports Bluetooth-related functions (e.g., from `bthprops.cpl`) for further investigation.",
              "Machine Learning: Deploy a supervised classification model (e.g., Random Forest) trained on process metadata (PE header, entropy, imported functions, parent process). Use the model to score newly observed processes for maliciousness. Escalate alerts for processes with a high maliciousness score that are observed in conjunction with Bluetooth device activity or service modifications."
            ]
          },
          {
            "description": "Execution of legitimate system utilities, such as fsquirt.exe or PowerShell, with command-line arguments indicating non-interactive or scripted file transfer over Bluetooth.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations and Laptops",
            "action": [
              "Symbolic: Monitor process creation events (Sysmon Event ID 1) for `fsquirt.exe` or `powershell.exe`. Create a rule to alert on `fsquirt.exe` with the `-send` flag or PowerShell script blocks (Event ID 4104) containing cmdlets like `Send-BluetoothFile`, especially when the parent process is non-interactive (e.g., `svchost.exe`, `services.exe`, `wscript.exe`).",
              "Statistical: For each user, baseline the daily frequency and command-line argument patterns of `fsquirt.exe` and PowerShell execution. Calculate the Shannon entropy of the command-line arguments. Alert when a user's execution of these utilities deviates more than 3 standard deviations from their historical norm or when the command-line entropy is in the top 5% for that utility.",
              "Machine Learning: Apply time series analysis to the frequency of `fsquirt.exe` or PowerShell Bluetooth-related commands per host. Use an anomaly detection model (e.g., Seasonal-ARIMA) to flag sudden, unexplained spikes in activity that do not correlate with known software updates or typical user behavior patterns."
            ]
          },
          {
            "description": "Anomalous creation of large archives or encrypted files in temporary directories or user profiles, exceeding a baseline size or frequency, indicating data staging prior to exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, User Workstations, and Document Management Systems",
            "action": [
              "Symbolic: Monitor process creation events (Sysmon Event ID 1) for common archiving tools (e.g., `7z.exe`, `rar.exe`, `tar.exe`). Alert if these processes are executed from a non-standard path (e.g., `C:\\Users\\*\\AppData\\Local\\Temp`) or by a system account (e.g., `NT AUTHORITY\\SYSTEM`).",
              "Statistical: Using file creation events (Sysmon Event ID 11), monitor for new files with extensions like `.zip`, `.rar`, `.7z`, `.tar.gz`. For each host, establish a baseline of the average size and count of archive files created per hour. Alert when the count or total size of created archives in a 10-minute window exceeds the 99th percentile of the host's historical baseline.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on file creation events, using features such as file extension, creation directory path entropy, file size, and parent process name. Identify and alert on clusters of file creation activity that are marked as anomalous (noise points) and are distinct from normal user or software behavior."
            ]
          },
          {
            "description": "Activation of a Bluetooth service or connection of a new Bluetooth adapter on a host where it is normally disabled by policy or has been historically unused.",
            "data_sources": [
              "Windows Event ID 7036",
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 400",
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 410",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Servers in Datacenters, Critical Workstations, and any host where Bluetooth is disabled by Group Policy",
            "action": [
              "Symbolic: Create a high-priority alert that triggers on Windows Event ID 7036 for the 'bthserv' (Bluetooth Support Service) entering the 'running' state on any host belonging to a 'Servers' or 'Bluetooth Disabled' asset group. Also, alert on registry value set events (Sysmon Event ID 13) that change `HKLM\\SYSTEM\\CurrentControlSet\\Services\\bthserv\\Start` to a value other than 4 (Disabled).",
              "Statistical: For all endpoints, track the daily frequency of Kernel-PnP Event IDs 400/410 related to Bluetooth devices. Maintain a list of hosts that have a zero-count baseline over the last 90 days. Any new Bluetooth device connection event on these hosts should be flagged as a high-priority anomaly.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to predict the proper state of the Bluetooth service ('Enabled'/'Disabled') based on host features like OS, asset group, role, and installed software. Run the model periodically against the current state of all hosts. Flag any host whose actual state does not match the predicted state for investigation."
            ]
          },
          {
            "description": "A correlated sequence of events where data staging (e.g., large archive creation) is followed within a 15-minute window by Bluetooth activity (e.g., service start, file transfer process execution) on the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036",
              "Windows Event ID 4663",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Executive Laptops and workstations of developers or system administrators",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when a 'Data Staging' event (e.g., `rar.exe` execution from a temp directory) is followed by a 'Bluetooth Activity' event (e.g., `fsquirt.exe` execution) on the same host within a 15-minute window. This sequence constitutes a high-confidence alert.",
              "Statistical: Implement a host-level risk scoring model. Increment a host's risk score for events related to this technique (e.g., +10 for large archive creation, +50 for Bluetooth service start on a server). Use a moving average of the risk score over a 1-hour window. Alert when a host's risk score exceeds a statistically determined threshold (e.g., 95th percentile of all host scores).",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model or Recurrent Neural Network) trained on benign event log sequences. Define a 'Bluetooth Exfiltration' state sequence (e.g., 'archive tool execution' -> 'Bluetooth service start' -> 'fsquirt.exe execution'). The model calculates the probability of observing a given sequence of events on a host; a very low probability score for an observed sequence indicates a rare and suspicious chain of events, triggering an alert."
            ]
          },
          {
            "description": "A host exhibits significant inbound network traffic from internal data stores, followed by a minimal amount of corresponding outbound traffic over the corporate network, suggesting data is being exfiltrated via an alternate channel.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, DMZ, and connections to high-value data repositories (file servers, databases)",
            "action": [
              "Symbolic: Create a rule that triggers if a host's total received bytes from internal servers (from Zeek conn.log) exceeds 500MB in one hour, and its total sent bytes to external IP addresses is less than 5MB in the same hour. Correlate with process-level network events (Sysmon Event ID 3, Windows Event ID 5156) to identify the specific process responsible.",
              "Statistical: For each host, calculate a 24-hour rolling average of the ratio of total bytes received from internal RFC1918 space to total bytes sent to external space, using Zeek conn.log. Alert when this ratio for a given hour deviates by more than 3 standard deviations from the host's historical baseline, indicating anomalous data hoarding.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., Prophet or LSTM) on the net-flow volume (bytes_in - bytes_out) for each host-to-server relationship. Train the model on historical Zeek conn.log data to learn normal data transfer patterns. An alert is generated when the observed net-flow shows a large positive spike (high data ingress) that is not followed by a corresponding egress event within the predicted time window."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]