[
  {
    "information_requirement": "Is an adversary attempting to gather detailed system and hardware information from our mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1426",
        "name": "System Information Discovery",
        "evidence": [
          {
            "description": "An adversary's attempt to discover system information is evidenced by one of three network patterns originating from a mobile device: (A) A single HTTP/S connection where the outbound data volume in `conn.log` is minimal (e.g., 100 bytes to 5 KB), the destination is a low-reputation or newly registered domain, the URI in `http.log` contains a high-entropy string (Shannon entropy > 4.0), and the TLS client fingerprint in `ja3.log` is rare or associated with known malware. (B) A DNS query in `dns.log` for a high-entropy or algorithmically generated subdomain, followed by a small data transfer, indicating DNS tunneling of device details. (C) A direct-to-IP connection in `conn.log` (lacking a preceding DNS query for the destination IP) with a small, periodic outbound data payload, suggesting a hardcoded C2 channel for exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek ja3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for corporate and guest Wi-Fi, VPN concentrators, enterprise DNS resolvers, and secure web gateways where mobile device traffic is inspected.",
            "action": [
              "Create a scheduled SIEM query to run every 15 minutes against Zeek logs from the mobile IP space. The query should match any of the following conditions and generate a high-severity alert: (A) The destination domain/IP in `dns.log` or `http.log` matches a threat intelligence feed for C2 or malware. (B) The JA3 hash in `ssl.log` matches a known malicious hash list. (C) The User-Agent in `http.log` matches a known fingerprinting tool or is an anomalous minimal string like 'Mozilla/5.0'. (D) The domain in `dns.log` is found on a Newly Registered Domain (NRD) feed (e.g., registered < 90 days ago).",
              "For each mobile device, establish a 30-day rolling baseline of network activity. Create a scheduled SIEM query to run hourly that flags statistical deviations and generates a medium-severity alert for correlation if multiple conditions are met within a 10-minute window: (A) In `conn.log`, identify outbound connections with a payload size between 100 and 5120 bytes and flag destination IPs that are contacted by more than 5% of the mobile fleet within a 24-hour period (a 'fan-out' event). (B) Calculate the Shannon entropy for the URI in `http.log` and the query in `dns.log`; flag any value that exceeds the 98th percentile for that specific device's baseline. (C) In `ja3.log`, identify the prevalence of each JA3 hash across the mobile fleet; flag any hash used by less than 0.5% of devices. (D) For repeating connections between a source-destination pair in `conn.log`, calculate the standard deviation of the inter-arrival time; flag beaconing behavior where the standard deviation is less than 2 seconds over a 1-hour window.",
              "Apply pre-trained machine learning models to network logs from mobile devices for advanced threat detection. First, process all domains from `dns.log` through an LSTM-based classifier to detect and score potential Domain Generation Algorithms (DGA). Second, analyze all TLS sessions from `ssl.log` using a Random Forest classifier trained on JA3 and JARM fingerprints to classify the session as benign, suspicious, or malicious. Third, feed feature vectors from `conn.log` (e.g., `orig_bytes`, `resp_bytes`, `duration`, protocol, port) into an Isolation Forest model to identify anomalous connection patterns against a fleet-wide baseline. Generate a high-confidence incident for investigation if a device triggers a high-confidence DGA or malicious TLS classification, especially when the corresponding connection is also flagged as an anomaly by the Isolation Forest model."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]