[
  {
    "information_requirement": "Is an adversary attempting to discover sensitive information on our corporate mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1420",
        "name": "File and Directory Discovery",
        "evidence": [
          {
            "description": "An application on a managed Android device accesses more than 100 unique file paths in external storage (e.g., '/sdcard/Download/', '/sdcard/Documents/') within a 5-minute window. This activity is considered evidence if it meets one of the following criteria: the file access rate exceeds the application's established 30-day baseline count by more than 3 standard deviations, or the process targets an unusual number of files with sensitive extensions (e.g., .kdbx, .pem, .gnucash).",
            "data_sources": [
              "MTD/EDR file access logs (containing process name, file path, and timestamp)",
              "Android logcat (filtered for 'FileAccess' or 'Vold' tags)",
              "Zeek files.log (if traffic is routed through a monitored network)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/MTD/UEM management consoles aggregating endpoint telemetry from corporate-owned or managed Android devices. Specific focus on devices assigned to executives or users with privileged access. Centralized SIEM platform for log correlation.",
            "action": [
              "Create a SIEM rule to generate a high-priority alert when a process not on the corporate application allow-list accesses more than 20 distinct files with sensitive extensions (.kdbx, .pem, .bak, .sql, .db) within a 10-minute window. Correlate with MDM data to enrich with device owner and posture.",
              "For each managed application, ingest file access events into the SIEM to establish a per-app baseline of unique file paths accessed per hour. Calculate the 99th percentile of this count over a 30-day rolling window. Generate an alert if the hourly count for any app exceeds its unique threshold. Additionally, calculate the Shannon entropy of directory names accessed by a process in a 5-minute window; alert if the entropy score is anomalously high compared to the application's historical distribution, suggesting enumeration.",
              "Develop and deploy an Isolation Forest anomaly detection model on endpoint file access data. Use features such as: count of file read/write operations per minute, average file path depth, ratio of directory listings to file reads, and time between file access events. Train the model on baseline data from known-good applications. A low anomaly score from the model, indicating a deviation from normal behavior, flags the device and process for immediate investigation."
            ]
          },
          {
            "description": "A user grants a high-risk storage permission (e.g., `android.permission.READ_EXTERNAL_STORAGE`, `android.permission.MANAGE_EXTERNAL_STORAGE`) to an application. This is considered evidence if the application is not on the corporate allow-list, was installed from an untrusted source (sideloaded), or its stated category (e.g., 'Flashlight') is incongruous with the need for broad file system access.",
            "data_sources": [
              "MDM application inventory and permission status logs",
              "MTD security policy violation events",
              "Google Play Store API for application metadata (category, developer, reputation)",
              "MDM logs detailing application source (e.g., Google Play, Sideloaded)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM platform, MTD management console, and the internal repository defining the corporate application allow-list and associated expected permissions. Centralized SIEM for correlation and alerting.",
            "action": [
              "Configure the MDM/UEM to generate a high-priority alert that is ingested by the SIEM whenever a permission state changes to 'GRANTED' for `android.permission.MANAGE_EXTERNAL_STORAGE` and the application's package name is not in the corporate allow-list OR the application source is identified as 'Sideloaded'.",
              "On a daily basis, aggregate MDM permission grant logs. For each application category (e.g., 'Productivity', 'Games'), calculate the baseline rate of storage permission grants. Alert if a specific application's grant rate suddenly spikes more than 3 standard deviations above its category average, which could indicate a trojanized update or a targeted social engineering campaign.",
              "Train a logistic regression classifier to produce a dynamic 'Application Risk Score'. Features should include: application source (managed store vs. sideloaded), developer reputation, number and type of requested permissions, and a binary flag for whether its category matches its requested permissions. A high-risk score combined with a recent storage permission grant event should trigger an automated action, such as quarantining the device or notifying the user and SOC."
            ]
          },
          {
            "description": "Within 60 minutes of a precursor alert (anomalous file access or high-risk permission grant) on a specific mobile device, the same device initiates one or more outbound network connections resulting in a total data transfer exceeding 50MB. This is considered evidence of exfiltration if the destination IP address or domain has not been contacted by the user in the last 30 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "VPN access logs",
              "MTD/EDR network flow logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors (e.g., Zeek) monitoring traffic from the corporate Wi-Fi SSID, VPN concentrator egress points, and CASB proxies. All logs should be aggregated in a central SIEM for correlation.",
            "action": [
              "Create a correlation rule in the SIEM that triggers on an 'Anomalous File Access' or 'High-Risk Permission Grant' alert for a specific device IP. For the next 60 minutes, monitor `Zeek dns.log` and `conn.log` for traffic from that IP. Generate a critical alert if the `query` field in `dns.log` or the `id.resp_h` field in `conn.log` matches a high-confidence threat intelligence feed of C2 servers or known data exfiltration endpoints.",
              "Upon a precursor alert for a device, query `Zeek conn.log` for all connections where `id.orig_h` matches the device IP in the subsequent hour. Sum the `orig_bytes` and `resp_bytes` fields. Compare this sum to the user's 95th percentile for hourly data transfer volume, calculated from a 30-day baseline. Alert if the threshold is breached. Concurrently, identify destination IPs (`id.resp_h`) that are 'rare' (not present in the user's 30-day connection history) and flag for investigation.",
              "For each user/device, train a time-series forecasting model (e.g., ARIMA, Prophet) on historical hourly outbound data volume (`orig_bytes` from `Zeek conn.log`). When a file-access-related precursor alert is triggered, compare the actual outbound data volume in the subsequent hour to the model's forecast. An actual volume that significantly exceeds the forecast's upper confidence bound (`yhat_upper`) indicates an anomalous data transfer event, likely exfiltration, and should trigger a high-severity alert."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]