[
  {
    "information_requirement": "Is an adversary enumerating local or adjacent networks from a managed mobile device? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1421",
        "name": "System Network Connections Discovery",
        "evidence": [
          {
            "description": "An application on a managed mobile device makes API calls associated with network discovery (e.g., Android `WifiInfo.getScanResults()`, `BluetoothAdapter.startDiscovery()`, `TelephonyManager.getAllCellInfo()`) that meet a combination of anomalous criteria. Specifically, the activity is flagged if the call frequency exceeds a statistical baseline for the application, the call is made from a background process, and the application's functional category (e.g., 'Game', 'Productivity') does not logically require network scanning capabilities.",
            "data_sources": [
              "Mobile EDR API call monitoring logs",
              "Android Logcat output captured by MDM/EDR",
              "Unified Endpoint Management (UEM) application state logs (foreground/background)",
              "Mobile Device Management (MDM) application inventory and categorization data",
              "MDM application permission grant logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform console, Mobile Threat Defense (MTD) platform console, Corporate-managed mobile endpoints (Android/iOS), SIEM/Data Lake for log aggregation and analysis",
            "action": [
              "Create a SIEM rule to generate a high-severity alert when an application making network discovery API calls has a package name, signing certificate hash, or developer ID that matches an entry on a mobile-specific threat intelligence feed.",
              "For each unique application, establish a 30-day rolling baseline of hourly discovery API call counts. Generate a medium-severity alert if the count in any one-hour window exceeds the 98th percentile for that specific app. Escalate to a high-severity alert if an application categorized as anything other than 'Networking', 'Navigation', or 'System Tools' makes any discovery calls and is not on an approved exception list, OR if discovery calls originate from an app that has been running in the background for more than five minutes.",
              "Deploy a Local Outlier Factor (LOF) model trained on features from API call events, including: hour of day, day of week, application category, time delta between app install and first discovery call, number of granted permissions, the specific API call invoked (e.g., `getScanResults`), and a binary flag for 'app in background'. Use the model to score all discovery API call events in near real-time. Events with an anomaly score in the top 1% are flagged for investigation as they may represent malicious discovery activity evading static rules."
            ]
          },
          {
            "description": "A mobile device executes network discovery API calls and, within a 5-minute window, initiates an outbound network connection to a destination that is either a known malicious indicator, a newly registered domain (NRD), uses a non-standard port for a common protocol, or is a direct-to-IP connection bypassing DNS resolution.",
            "data_sources": [
              "Mobile EDR API call monitoring logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek notice.log",
              "Zeek ssl.log",
              "Threat Intelligence Platform domain/IP feeds",
              "Passive DNS records",
              "WHOIS lookup data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate wireless network and internet gateway, DNS resolvers, Network SIEM / Data Lake for log correlation, Threat Intelligence Platform",
            "action": [
              "Implement a SIEM correlation search that joins mobile EDR/UEM API logs with Zeek conn.log and dns.log on the device's IP address within a 5-minute time window. Trigger a high-severity alert if a network discovery API call is followed by a connection or DNS query to a destination IP/domain on a C2 threat intelligence list. Enrich the alert with WHOIS data; if the domain was registered in the last 30 days or the connection is direct-to-IP, escalate the priority to critical.",
              "Following a discovery API call from a mobile device, monitor its subsequent network traffic for 10 minutes. Generate a high-severity alert if: a) the Shannon entropy of requested subdomain labels in Zeek dns.log over a 1-minute window exceeds a threshold of 4.2, indicating potential DGA; b) a connection is made to a domain seen by fewer than 5 other devices in the enterprise over the last 30 days (long-tail analysis); or c) the ratio of failed connections (e.g., Zeek conn.log `conn_state` of 'REJ' or 'RSTO') to a single destination exceeds 90%, indicating potential C2 beaconing.",
              "After a discovery event, apply a pre-trained one-class Support Vector Machine (SVM) model to classify all subsequent outbound connections within a 10-minute window. Extract features for each connection, including destination port, protocol, bytes sent/received, connection duration, JA3/JA3S hash from Zeek ssl.log, and whether the destination is an IP or domain. Connections classified as outliers by the model should be flagged as anomalous C2 communication attempts requiring immediate investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]