[
  {
    "information_requirement": "Is an adversary using standard application protocols for command and control on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1437",
        "name": "Application Layer Protocol",
        "evidence": [
          {
            "description": "A mobile device establishes connections over HTTP/S or other application protocols to a single destination IP/domain at highly regular intervals, exhibiting a low coefficient of variation (<0.2) in inter-arrival times, combined with consistently small and uniform payload sizes (e.g., standard deviation < 100 bytes) and a low diversity of HTTP methods or URI paths, indicative of automated C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi infrastructure, VPN concentrators",
            "action": [
              "Query network logs (Zeek conn.log, http.log) in real-time against an ingested threat intelligence feed of known C2 server IPs, domains, and URI paths. Generate a high-severity alert for any connection from a mobile device IP to a blacklisted destination.",
              "For each mobile source IP, aggregate connection data from Zeek conn.log over a rolling 24-hour window, grouping by destination IP. For each source-destination pair, calculate the coefficient of variation (standard deviation / mean) of inter-connection time deltas and the standard deviation of both originator ('orig_bytes') and responder ('resp_bytes') payload sizes. Alert if the time delta coefficient of variation is < 0.2 and the payload standard deviation is < 100 bytes, indicating a highly periodic, non-interactive heartbeat.",
              "Implement a DBSCAN clustering model on mobile device traffic features extracted from Zeek conn.log and http.log. Engineer features including destination port, protocol, inter-arrival time coefficient of variation, mean and standard deviation of payload sizes, and the count of unique URIs per source-destination pair. Analyze resulting clusters: identify small, dense clusters with low variance as anomalous, machine-like beaconing that requires analyst investigation, distinguishing them from large, diffuse clusters representing normal browsing."
            ]
          },
          {
            "description": "DNS traffic from a mobile device exhibits characteristics of a C2 data channel, such as an unusually high query volume to a single registered domain (>100 queries/hour), a high ratio of unique subdomains to a single domain, FQDNs with high Shannon entropy (>4.5) in the subdomain, an abnormally high ratio of TXT/CNAME queries to A/AAAA queries, or DNS responses containing large payloads (>512 bytes) in TXT records.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, DNS forwarders, Network egress points",
            "action": [
              "Scan the 'query' field in Zeek dns.log in real-time for domains matching regular expressions or explicit entries from a threat intelligence feed of known DGAs and DNS tunneling C2 domains. Generate a high-severity alert for any match originating from a mobile device IP address.",
              "For each mobile source IP, calculate the Shannon entropy of the subdomain portion of the 'query' field in Zeek dns.log and measure the length of TXT record answers. Establish a 30-day baseline to determine the 99th percentile for both entropy and TXT answer size. Generate an alert when a query from a mobile device exceeds both an absolute entropy threshold (e.g., >4.5) and the 99th percentile for response size, indicating data encoding and exfiltration via DNS.",
              "Train a Random Forest classifier using a labeled dataset of benign and malicious (DGA/tunneling) DNS queries. Engineer features from Zeek dns.log including: query length, subdomain entropy, ratio of numeric to alphabetic characters in the subdomain, query type (one-hot encoded), and TXT record response size. Deploy the trained model to classify live DNS queries from mobile devices, flagging those classified as 'malicious' with a high confidence score for immediate analyst review."
            ]
          },
          {
            "description": "An HTTP/S request from a mobile device presents a client signature, such as a User-Agent string (HTTP), a JA3/JA3S TLS fingerprint, or a JA4+ fingerprint, that is either on a blocklist of known malicious indicators or is statistically rare, with a prevalence of less than 0.1% across the entire mobile device population over a 30-day baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek ja4.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Application Firewalls (WAFs), Reverse proxies, Internet gateways",
            "action": [
              "Continuously scan Zeek http.log ('user_agent'), ssl.log ('ja3', 'ja3s'), and ja4.log ('ja4_hash') against a threat intelligence list of signatures associated with known mobile malware and C2 frameworks. Generate an immediate alert upon any exact match from a mobile device's IP address.",
              "Maintain a frequency table of all observed User-Agent strings, JA3 hashes, and JA4 hashes from the mobile device population over a rolling 30-day period. Calculate the prevalence of each signature as a percentage of the total. Generate a medium-severity alert for any signature with a prevalence of less than 0.1% or that is observed on fewer than 3 unique devices, indicating a rare client that warrants investigation.",
              "Utilize an Isolation Forest anomaly detection model trained on benign mobile client traffic signatures. From Zeek logs, engineer features including User-Agent string length, token count within the User-Agent, and one-hot encoded categorical features from the JA3 and JA4 hashes (e.g., TLS version, ciphers). Score new connections in real-time and flag those with high anomaly scores, representing significant deviations from the established baseline of legitimate mobile application clients."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]