[
  {
    "information_requirement": "Has an adversary compromised a user's corporate account access by performing a SIM swap? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful user authentication to a corporate service (e.g., VPN, Azure AD) occurs within 4 hours following an MDM log indicating a SIM card change for the same user. A SIM card change is identified by a log entry showing a new International Mobile Subscriber Identity (IMSI) or Integrated Circuit Card Identifier (ICCID), a 'SIM Not Present' status, or a device unenrollment from the MDM platform. The subsequent authentication must also exhibit at least two anomalous characteristics from the user's established 90-day behavioral baseline: 1) The source IP address geolocates to a country or Autonomous System Number (ASN) from which the user has never logged in before. 2) The login timestamp is more than 3 standard deviations from the user's mean login hour. 3) The login's user-agent string has a Jaccard similarity score below 0.5 compared to the user's set of historical user-agents.",
            "data_sources": [
              "Windows Event ID 4624 (Logon Type 3, 8, 10)",
              "Zeek conn.log",
              "MDM logs (specifically entries for IMSI/ICCID change, SIM status, or device compliance status)",
              "Azure AD SignInLogs",
              "VPN authentication logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Domain Controllers, ADFS), Cloud Identity Provider Platforms (Azure AD, Okta), VPN Concentrators, MDM Servers, Internet Gateways",
            "action": [
              "Implement a SIEM correlation rule that joins MDM logs with authentication logs (e.g., Windows Event ID 4624, Azure AD SignInLogs) on the 'user' field. Trigger a high-severity alert if an MDM log for a user contains a specific event code for a SIM change (e.g., 'imsi_changed', 'iccid_changed', 'sim_removed') or device unenrollment, and this is followed within 4 hours by a successful authentication log for the same user where the source IP address is present on a threat intelligence feed of known anonymizing proxies, Tor exit nodes, or high-risk VPNs.",
              "For each user, maintain a 90-day rolling baseline of authentication behavior from sources like Zeek conn.log and Azure AD SignInLogs. The baseline must include: (a) a set of historical source countries and ASNs, (b) the mean and standard deviation of login hour-of-day, and (c) a frequency distribution of user-agent families (e.g., Chrome Mobile, Safari). For each new login, calculate a risk score. Add points for deviations: +3 for a new country, +2 for a new ASN, +2 for a login hour in the least frequent 5% of the user's distribution, +1 for a user-agent family seen in <1% of prior logins. Generate a medium-severity alert if the cumulative score exceeds a threshold of 5 in a 24-hour period. Escalate to critical if this alert occurs within 4 hours of a confirmed MDM SIM-change event for that user.",
              "Develop a per-user anomaly detection model using an Isolation Forest algorithm. For each login event, create a feature vector including: sine/cosine transformations of the login hour and day of week, categorical features for source country and ASN (one-hot encoded from the user's top 10 most frequent), and categorical features for the browser family and operating system extracted from the user-agent string. Train the model on the user's last 90 days of clean login data. Score each new login in real-time. An anomaly score in the top 1st percentile for that user, which also occurs within 4 hours of an MDM-logged SIM change event, generates a high-confidence alert for account takeover and triggers an automated response playbook to suspend the account and invalidate active sessions."
            ]
          }
        ]
      },
      {
        "technique_id": "T1566",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user's device is observed making an HTTP POST request to a suspicious domain within 5 minutes of the user clicking a link to that same domain in an email. The domain is considered suspicious if it was registered within the last 30 days or is identified as a typosquat of a known mobile carrier or financial institution via Levenshtein distance. The evidence is strengthened if the POST request contains form field names associated with Personally Identifiable Information (PII) or authentication credentials (e.g., 'ssn', 'dob', 'pin', 'mmn').",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Email gateway logs (including header analysis for DMARC/SPF/DKIM results)",
              "Web proxy logs",
              "WHOIS data feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate email gateway, Enterprise DNS resolvers, Web proxies/Internet gateways, Endpoint devices",
            "action": [
              "Create a SIEM rule that triggers on an HTTP POST event in Zeek http.log or web proxy logs. The rule's conditions are: (a) the destination domain was first seen in DNS traffic (Zeek dns.log) from that user's IP within the last 5 minutes, (b) the destination domain's registration date (from an integrated WHOIS feed) is less than 30 days old, AND (c) the HTTP POST body (if inspected) contains field names matching a watchlist (e.g., 'ssn', 'dob', 'motherMaidenName', 'securityPin', 'accountNumber', 'password'). This generates a high-severity alert for potential PII harvesting.",
              "For all outbound HTTP POST requests from user endpoints (from Zeek http.log), establish a baseline of the request body size per user and per destination second-level domain. For each new POST request to a non-allowlisted domain, calculate its z-score relative to the user's historical POST sizes. A z-score greater than 3 (i.e., more than 3 standard deviations above the mean size) indicates an anomalously large data upload. If the destination domain also has a high Shannon entropy score (>4.0) or a low Levenshtein distance (<3) to a known brand ('verizon', 'att', 'bankofamerica'), generate a medium-severity alert for potential credential or PII exfiltration.",
              "Train a supervised classification model (e.g., LightGBM or XGBoost) to predict if a URL is malicious. Features should include lexical properties (URL length, subdomain count, path depth, number of special characters like '-', '_', '=', '?'), domain-based properties (domain age, TLD, presence of IP address), and certificate properties (issuer, validity period). Deploy this model as a real-time API. For every URL clicked in an external email, send it to the model. If the model returns a 'phishing' probability greater than a tuned threshold (e.g., 0.95), and this is followed within 5 minutes by an HTTP POST request from the user to that same URL, trigger a critical alert and initiate a SOAR playbook to isolate the endpoint and reset the user's credentials."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]