[
  {
    "information_requirement": "Has an adversary gained initial access to a mobile device via a physical USB connection? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process associated with mobile device interaction (e.g., adb.exe, ideviceinstaller.exe) executes on a host within a 5-minute window of a USB device connection event. The process exhibits one or more anomalous characteristics: 1) its command-line arguments have a Shannon entropy value greater than the 98th percentile for that process across the enterprise, 2) it initiates a network connection to a domain with a low reputation score, or 3) it connects to a destination IP address not previously associated with that process or host in the last 60 days.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints with USB ports (corporate workstations, employee laptops, IT helpdesk workstations), public charging kiosks within corporate facilities, DNS servers, network gateways, and VPN concentrators.",
            "action": [
              "Create a watchlist of mobile management processes (e.g., 'adb.exe', 'ideviceinstaller.exe', 'iFunBox.exe', 'libimobiledevice', 'fastboot.exe'). Correlate a USB connection event (Windows-DriverFrameworks-UserMode/Operational Event ID 2003) with a process creation event (Windows Event ID 4688) on the same host within 5 minutes. Generate a high-severity alert if the process is on the watchlist, is unsigned, runs from a non-standard path (e.g., %TEMP%), and initiates a network connection (Sysmon Event ID 3) to an IP or domain on a threat intelligence feed.",
              "For each process on the mobile management watchlist, establish a 30-day baseline of command-line argument Shannon entropy and length. Following a USB connection event, generate a medium-severity alert if a new execution's entropy exceeds the 98th percentile for that specific process, or if its command-line length exceeds 3 standard deviations from its historical mean, suggesting obfuscation or an unusual command.",
              "Train a one-class SVM (Support Vector Machine) model on features of 'normal' network connections originating from watchlist processes, using Sysmon Event ID 3 and Zeek conn.log. Features should include destination port, data volume, domain reputation, and the ASN of the destination IP. Flag any new network connection classified as an anomaly by the model, especially if it occurs within 5 minutes of a USB connection event."
            ]
          },
          {
            "description": "Within 5 minutes of a mobile device USB connection, a host PC generates DNS queries where: 1) the number of unique, previously unseen domains (not observed in the last 30 days) is greater than 3 standard deviations above the host's daily baseline, 2) the ratio of rare TLDs (e.g., .xyz, .club, .top) to common TLDs (.com, .org, .net) exceeds the 99th percentile for the organization, or 3) the average Shannon entropy of the queried domain names is greater than 4.0, suggesting algorithmic generation.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Sysmon Event ID 22",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, guest network segments, internet gateway, DNS servers, Endpoint Detection and Response (EDR) logs.",
            "action": [
              "Following a USB connection event (Windows-DriverFrameworks-UserMode/Operational Event ID 2003), monitor all subsequent DNS queries (Zeek dns.log, Sysmon Event ID 22) from the host for 5 minutes. Generate a high-priority alert if any queried domain matches a threat intelligence feed of known malicious, DGA-generated, or newly registered domains.",
              "For each host, calculate a 30-day rolling baseline for the number of new domains queried per day and the Shannon entropy of queried domain labels. Following a USB connection event, alert if the number of new domains queried within a 5-minute window exceeds the host's daily baseline by more than 3 standard deviations, or if the average label entropy for those queries is in the 98th percentile for that host.",
              "Implement an Isolation Forest model trained on features from Zeek dns.log and Sysmon Event ID 22, such as query length, subdomain count, TLD, entropy, query type, and the name of the process that initiated the query. Flag queries marked as outliers by the model that occur within 5 minutes of a USB connection for analyst review, prioritizing those initiated by mobile management tools."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using compromised mobile devices to laterally move to corporate workstations? (PIR)",
    "tactic_id": "TA0033",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "An executable file (.exe, .dll, .ps1, .bat) is written to a user-writable directory (e.g., %APPDATA%, %TEMP%, Downloads) by a process associated with a mobile device connection. The file has a low prevalence hash (fewer than 5 occurrences enterprise-wide) or is unsigned. The file is executed within 10 minutes of being written, and the resulting process spawns a command interpreter (cmd.exe, powershell.exe) or a network utility (e.g., bitsadmin.exe, certutil.exe).",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, IT administrator workstations, user profile directories (Downloads, Temp, AppData), shared network drives.",
            "action": [
              "Correlate a USB connection event (Windows-DriverFrameworks-UserMode/Operational Event ID 2003) with a subsequent file creation (Sysmon Event ID 11) and process execution (Sysmon Event ID 1) on the same host. Generate a critical alert if the executed file's hash matches a malicious signature from a threat intelligence feed. Also, alert if the executed file spawns a child process such as powershell.exe with command-line arguments containing encoded command flags (e.g., -enc, -e, -encoded).",
              "For each file written to disk by a mobile management process following a USB connection, check its prevalence. Generate a medium-severity alert if the file's hash has been observed fewer than 5 times enterprise-wide. Additionally, build a baseline of common parent-child process relationships and alert if a process originating from a file dropped via USB spawns a child process (e.g., cmd.exe) and this parent-child relationship is in the bottom 5th percentile of frequency.",
              "Train a Random Forest classifier to predict if a newly executed file is malicious. Use features from Sysmon events (1 and 11) such as file path entropy, file extension, parent process name, file signature status (signed/unsigned), and file hash prevalence. Flag files with a predicted malicious probability score greater than 0.9 for immediate investigation, especially if they were created within 10 minutes of a USB connection."
            ]
          },
          {
            "description": "Within 15 minutes of a mobile device USB connection, a host PC initiates internal network connections where: 1) the number of unique internal destination IPs on common reconnaissance ports (e.g., 22, 135, 139, 445, 3389) exceeds 20, 2) the ratio of failed connections (e.g., TCP RST or timeout) to successful connections exceeds 10:1 to internal hosts, or 3) the number of unique internal IP-port combinations contacted is greater than 3 standard deviations above the host's 30-day baseline for that hour of the day.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Sysmon Event ID 3",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, network segments containing high-value assets (Domain Controllers, Database Servers), internal network traffic choke points, and VLANs with sensitive servers.",
            "action": [
              "Monitor Zeek notice.log for `Scan::Address_Scan` or `Scan::Port_Scan` notices. If such a notice is generated for a host, correlate it with USB connection logs (Windows-DriverFrameworks-UserMode/Operational Event ID 2003). Generate a high-severity alert if the scan notice occurs within 15 minutes of a USB device being connected to that host.",
              "Following a USB connection event, monitor internal network traffic (Zeek conn.log, Sysmon Event ID 3) from the host. Using a 5-minute sliding window, count the number of unique internal destination IPs contacted and the ratio of failed connection states (e.g., 'REJ', 'S0') to established states ('SF'). Alert if the unique IP count exceeds a hard threshold of 20 or if the failed connection ratio exceeds 3 standard deviations above the host's 30-day baseline.",
              "Apply a K-Means clustering algorithm to group hosts based on their internal network behavior profiles derived from Zeek conn.log and Sysmon Event ID 3. Profile features should include the ratio of internal-to-external connections, diversity of destination ports, average bytes per connection, and connection success/failure ratio. If a host abruptly shifts from its normal cluster to a 'scanner' cluster (characterized by low data volume, high port diversity, high failure rate) immediately following a USB connection event, flag it for analyst investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]