[
  {
    "information_requirement": "Has a user's mobile device, connected to the corporate network, been compromised via a watering hole or drive-by compromise? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1456",
        "name": "Drive-By Compromise",
        "evidence": [
          {
            "description": "A mobile device's HTTP session, identified in Zeek http.log by its 'uid', contains a 'Referer' header from a high-reputation domain (e.g., corporate intranet, popular news site) immediately followed by a request to a destination domain that is: (1) matched on a threat intelligence feed, (2) has a WHOIS registration age less than 30 days, or (3) has a lexical entropy score placing it in the 95th percentile of all newly observed domains.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Threat Intelligence Feed",
              "WHOIS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN concentrators, and other internet egress points used by mobile devices.",
            "action": [
              "Create a SIEM rule that joins Zeek http.log with a threat intelligence feed of known malicious domains. Alert when http.log.host matches a malicious domain AND http.log.referer contains a domain from a pre-defined list of trusted or high-traffic sites.",
              "For all domains observed in Zeek dns.log, calculate the 5th percentile of domain registration age for newly observed domains over a 7-day window. Create a rule that alerts when a request in http.log from a mobile User-Agent is made to a domain with a registration age below this percentile, especially if the referer is not null and is a high-reputation site.",
              "Apply a pre-trained logistic regression model to score all web requests from mobile User-Agents. Feature inputs should include: domain registration age, domain name entropy, ASN reputation, IP geolocation rarity for the user, User-Agent string rarity, and the presence of a Referer header. Generate an alert for any request with a predicted malicious probability exceeding a tuned threshold of 0.85."
            ]
          },
          {
            "description": "A JavaScript file transferred to a mobile device, identified by its 'fuid' in Zeek files.log and correlated with http.log, exhibits two or more of the following: (1) a file size exceeding the 95th percentile for that source domain's historical JS files, (2) a Shannon entropy score above 4.5, (3) a high ratio of non-alphanumeric characters, or (4) a corresponding 'large_file_in_small_buffer' notice in Zeek weird.log.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with full packet capture or Zeek sensors; Mobile devices with MDM agents capable of network inspection.",
            "action": [
              "Configure Zeek to extract all files with MIME types 'application/javascript' and 'text/javascript'. Scan all extracted files with a YARA ruleset designed to detect mobile exploit frameworks and common JavaScript obfuscation techniques. Generate a high-severity alert on any YARA match.",
              "For each unique host in Zeek http.log, maintain a 30-day rolling baseline of file sizes and Shannon entropy for all downloaded JavaScript files. Alert when a new JS file has a size and entropy score that both exceed 2 standard deviations from the mean for that specific host. Increase alert priority if a corresponding 'large_file_in_small_buffer' notice is present in weird.log.",
              "Utilize a density-based clustering algorithm (e.g., DBSCAN) on a feature space of all extracted JavaScript files. Features should include file size, Shannon entropy, ratio of 'eval()' or 'atob()' function calls to file size, and the count of long, unbroken strings. Flag files identified as noise (outliers) for manual analysis."
            ]
          },
          {
            "description": "A sequence of HTTP requests, linked by 'uid' in Zeek http.log from a single mobile client, forms a redirect chain of 3 or more hops (status_code 301/302/307). The chain begins with a 'Referer' from a known ad network and terminates at a destination domain that is newly registered (< 30 days old), has a low reputation, or is uncategorized by web filters.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Web Proxy Logs",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points instrumented with Zeek sensors, DNS resolvers, and upstream web proxies.",
            "action": [
              "Using Zeek http.log, build redirect chains by linking records with the same 'uid'. Create a rule to alert when a chain (1) has a length of 3 or more hops, (2) the initial 'referer' matches a list of known ad network domains, and (3) the final destination 'host' is present on a malicious domain threat feed.",
              "For each mobile user, establish a 7-day rolling baseline of their average redirect chain length. Alert when a user experiences a redirect chain whose length exceeds 3 standard deviations from their personal average, or an absolute threshold of 5 hops. Prioritize alerts where the chain traverses more than two unique Top-Level Domains (TLDs).",
              "Apply a pre-trained sequence-to-sequence LSTM autoencoder on all observed HTTP redirect chains. The model input is a sequence of feature vectors, where each vector represents a hop (e.g., time delta, status code, TLD, ASN). A high reconstruction error score indicates an anomalous chain, suggesting a deviation from normal browsing patterns, and should be flagged for investigation."
            ]
          },
          {
            "description": "An HTTP GET or POST request from a mobile User-Agent, recorded in Zeek http.log, contains a URI path or query string that matches a regular expression for a known mobile exploit kit (e.g., Pegasus). A secondary indicator is a request for a script file (e.g., .js) that lacks a 'Referer' header.",
            "data_sources": [
              "Zeek http.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with Zeek sensors; web proxies.",
            "action": [
              "Continuously apply a curated set of regular expressions, sourced from threat intelligence, against the 'uri' field in Zeek http.log. Generate a critical alert on any match from a request where the 'user_agent' indicates a mobile OS (iOS, Android). Additionally, create a lower-severity alert for any request for a '.js' file where the 'referer' field is empty or null.",
              "For each domain, establish a baseline of URI structures, including average path depth, average query parameter count, and character distribution. Alert when a request from a mobile device to a given domain has a URI path depth or query parameter count exceeding 3 standard deviations from that domain's baseline, especially if the domain is newly observed.",
              "Use a supervised Random Forest classifier, trained on labeled malicious and benign URLs, to score all incoming HTTP requests from mobile devices. Features should include URL length, path depth, number of special characters, query string entropy, TLD reputation, and the presence of keywords like '.apk' or 'exploit'. A score above a determined threshold (e.g., 0.90) triggers an alert for analyst review."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]