[
  {
    "information_requirement": "Is an adversary attempting to disrupt our organization's mobile device communications via a Network Denial of Service attack?",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1464",
        "name": "Network Denial of Service",
        "evidence": [
          {
            "description": "A cluster of four or more MDM-enrolled mobile devices, geolocated within a 50-meter radius, simultaneously report a loss of Wi-Fi connectivity and an inability to detect any available SSIDs for a sustained period exceeding 60 seconds. This is corroborated by network-side monitoring, where Zeek conn.log shows an abrupt cessation of traffic from the devices' last known IP addresses without a corresponding TCP FIN or RST flag in the connection history.",
            "data_sources": [
              "Zeek conn.log",
              "MDM Wi-Fi Status Events",
              "MDM Geolocation Data",
              "Wireless LAN Controller (WLC) logs",
              "Access Point (AP) system logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points and associated mobile devices in sensitive areas such as executive suites, R&D labs, data centers, Sensitive Compartmented Information Facilities (SCIFs), and geofenced event spaces like boardrooms or all-hands meeting areas.",
            "action": [
              "Configure a SIEM rule to trigger when the count of unique devices reporting 'Wi-Fi Disconnected' and 'Visible SSID Count = 0' from MDM logs exceeds 3 within a 50-meter geographic radius and a 60-second time window. As a secondary condition, the rule must query Zeek conn.log for the last connection record associated with the IP addresses of the affected devices. The alert is confirmed if the 'history' field of these Zeek records does not contain 'F' or 'R', indicating an unclean disconnection.",
              "For each NAI, ingest historical Received Signal Strength Indicator (RSSI) values from MDM logs to establish a baseline. Calculate a 30-day rolling mean and standard deviation of RSSI for each device and for the NAI as a whole. Trigger a medium-severity alert if a device's live RSSI drops more than 3 standard deviations below its personal baseline. Trigger a high-severity alert if the average RSSI for 5 or more devices in an NAI drops 2 standard deviations below the NAI's collective baseline, suggesting a localized area-of-effect issue.",
              "Create a time series dataset representing the count of 'Wi-Fi Disconnect' events per minute, aggregated for each defined NAI. Apply a time series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to this data to identify statistically significant spikes in disconnections. Upon detecting a spike, execute a secondary process that runs a density-based clustering algorithm (e.g., DBSCAN) on the latitude/longitude coordinates of all devices that disconnected during the anomalous time window. Escalate to a high-severity incident if the time series anomaly is confirmed by the formation of a dense geographic cluster of devices."
            ]
          },
          {
            "description": "A statistically significant number of MDM-enrolled devices (e.g., exceeding the 99th percentile of the historical device count in a given NAI, or a minimum of 5 devices) simultaneously report a 'No Service' cellular state. This is accompanied by a sharp drop in Reference Signal Received Power (RSRP) to a critical level (e.g., below -120 dBm) for over 2 minutes, in a location with a historically strong cellular coverage baseline (e.g., average RSRP consistently above -95 dBm).",
            "data_sources": [
              "MDM Cellular Status Logs",
              "MDM Geolocation Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Geofenced perimeters of critical infrastructure (corporate headquarters, data centers), off-site meeting venues for executive events, and the real-time travel corridors of high-value personnel.",
            "action": [
              "Ingest MDM cellular status logs into the SIEM. Create a correlation rule that triggers a medium-severity alert if the count of unique devices reporting a 'No Service' status within a single NAI exceeds a dynamic threshold (e.g., 10% of total devices in that NAI) or a hard limit of 5 devices, within a 2-minute sliding window. Enrich the alert with each device's last known location and carrier.",
              "For each NAI, aggregate 'No Service' events from MDM logs into 5-minute time buckets to create a historical time series. Calculate the 99th percentile of this event rate based on the last 30 days of data. Generate a high-severity alert if the current event rate in any 5-minute bucket exceeds this 99th percentile threshold. As a corroborating check, continuously calculate the median RSRP for all devices in the NAI and generate a separate alert if it drops by more than 20 dBm in under 5 minutes.",
              "Engineer a feature set for mass outage events, including: time of day, day of week, device count in NAI, median historical RSRP for the NAI, carrier distribution, and a label indicating known benign outages (e.g., carrier-reported issues). Train a classification model (e.g., Random Forest) to predict the probability of a mass outage being anomalous/malicious versus a benign known issue. In real-time, when a group of devices reports 'No Service', feed the event's features into the trained model and trigger a high-priority incident if the model outputs a high probability score for 'anomalous'."
            ]
          },
          {
            "description": "A single MDM-enrolled device simultaneously reports severe GPS signal degradation (e.g., horizontal accuracy exceeding 100 meters or visible satellite count dropping below 3) and a total loss of network connectivity (both Wi-Fi status 'Disconnected' and Cellular status 'No Service') for a duration exceeding 60 seconds. This event is anomalous when compared to the device's historical baseline in the same location, which typically shows GPS accuracy better than 15 meters and stable network connectivity.",
            "data_sources": [
              "MDM Location/GPS Status Logs",
              "MDM Cellular Status Logs",
              "MDM Wi-Fi Status Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices used for asset tracking, fleet management, supply chain logistics routes, and by personnel operating in high-risk or sensitive environments where location integrity is critical.",
            "action": [
              "Configure a cross-source SIEM correlation rule that monitors logs from a single device. The rule's logic triggers if all three of the following conditions are met within the same 60-second window for a single device ID: a) A GPS status event reports a satellite count less than 3 OR a horizontal accuracy greater than 100 meters. b) A cellular status event reports 'No Service'. c) A Wi-Fi status event reports 'Disconnected' with a visible SSID count of 0.",
              "For each device, establish a statistical profile of its median GPS horizontal accuracy per NAI based on 30 days of MDM location logs. Generate an alert if the device's live accuracy degrades by more than 5 standard deviations from its historical baseline for that NAI for more than 2 consecutive minutes. As a parallel detection, calculate the Shannon entropy of a device's reported latitude/longitude coordinate pairs over a 10-minute sliding window; a sudden, sharp increase in entropy, indicating erratic and physically impossible location jumps, should trigger a separate investigation for GPS spoofing.",
              "For each high-value device, create three separate time series anomaly detection models (e.g., using Isolation Forest) for its GPS, cellular, and Wi-Fi signals. Features for the GPS model could include horizontal accuracy, vertical accuracy, and satellite count; features for cellular/Wi-Fi could include signal strength (RSRP/RSSI) and connection state. Run these models in real-time to generate continuous anomaly scores for each signal type. Create a final meta-alert that triggers only when high anomaly scores are detected concurrently (within the same 5-minute window) across all three models for the same device, indicating a high-confidence multi-signal jamming event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]