[
  {
    "information_requirement": "Has an adversary gained initial access to the corporate network via a compromised mobile device?",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1461",
        "name": "Lockscreen Bypass",
        "evidence": [
          {
            "description": "A sequence of five or more failed authentication events (Windows Event ID 4625) from a single source IP address, followed within five minutes by a successful authentication event (Windows Event ID 4624) from the same IP. The successful login event is further qualified by being statistically anomalous based on the user's historical login time, geolocation, or ASN, and the source IP is confirmed to be from a mobile device via MDM/VPN logs.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "MDM/UEM logs",
              "VPN logs",
              "IdP logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Active Directory Domain Controllers), VPN Concentrators, Cloud Identity Providers (e.g., Azure AD, Okta), Internet Gateway, MDM/UEM solution logs.",
            "action": [
              "Configure a SIEM rule to trigger on the following sequence: 1. Count at least five occurrences of Windows Event ID 4625 for the same TargetUserName from a single IpAddress within a 10-minute window. 2. If the count is met, look for a subsequent Windows Event ID 4624 for the same TargetUserName and IpAddress within the next 5 minutes. 3. Correlate the IpAddress with active VPN or MDM sessions at the time of the event to confirm the source is a mobile device. Alert if all conditions are met.",
              "For each alert generated by the symbolic rule, perform the following statistical checks: 1. Using Zeek conn.log, enrich the source IpAddress with geolocation and ASN data. 2. Compare the event's timestamp to the user's historical login times (last 90 days) and flag if it falls outside the 95th percentile of their typical login hours. 3. Check if the source country or ASN is rare for the user (e.g., has not appeared in their last 90 days of logins). 4. Escalate the alert to high severity if the initial sequence is met and at least two statistical anomalies (e.g., rare time and rare country) are present.",
              "For each alert generated by the symbolic rule, apply a pre-trained, user-specific anomaly detection model (e.g., Isolation Forest). Input the features of the successful login: hour of day, day of week, source ASN, source country, and device compliance status from MDM logs. If the model returns an anomaly score indicating the event is in the top 1% of outliers for that user, classify the login as highly suspicious and trigger an automated incident response workflow."
            ]
          },
          {
            "description": "A mobile device's IP address, identified via MDM/VPN logs, is observed in Zeek logs making network connections that are anomalous for the user. This includes: 1. Connections (conn.log) to internal 'crown jewel' assets not typically accessed by the user's role. 2. DNS queries (dns.log) for domains with Shannon entropy scores above 4.0 or TTL values below 60 seconds. 3. HTTP/S traffic (http.log, ssl.log) showing abnormally large data uploads (orig_bytes) to external, uncategorized domains or using self-signed TLS certificates.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log",
              "MDM/UEM logs",
              "VPN logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (especially those housing sensitive data like developer environments or financial systems), Corporate Wi-Fi access points, VPN termination points, DNS resolvers, Egress points to the internet.",
            "action": [
              "Implement a SIEM rule that joins network and identity data: 1. Maintain a watchlist of sensitive internal IP addresses ('Crown Jewels'). 2. In Zeek conn.log, alert when a source IP, identified as a mobile device from VPN/MDM logs, connects to an IP on the watchlist. 3. Cross-reference the associated user with their Active Directory group memberships; suppress the alert only if the user's group is on a pre-approved ACL for that asset. 4. Additionally, create a separate rule to alert on any connection from a mobile device IP using a TLS certificate where validation_status in ssl.log is 'self-signed'.",
              "On a per-device basis, perform the following continuous statistical monitoring: 1. In 5-minute windows, calculate the Shannon entropy of all requested subdomains in dns.log. Flag any device whose entropy score exceeds 3 standard deviations from its own 30-day baseline. 2. For each user, establish a 99th percentile baseline for outbound data transfer size (orig_bytes in conn.log). Flag any single connection that exceeds this baseline by a factor of 5. 3. Maintain a baseline of common HTTP User-Agent strings for each user's peer group (e.g., their department). Flag any User-Agent from a user's mobile device that is not present in the peer group's 30-day baseline.",
              "Deploy a graph-based anomaly detection model where nodes are devices and internal servers. Continuously feed Zeek conn.log data into the model. An alert is generated when a new connection (an edge) is formed that the model scores as having a very low probability based on historical network topology and traffic patterns. Concurrently, apply a trained LSTM time-series model to each device's egress data volume; raise an alert if the observed volume significantly deviates from the model's forecasted range."
            ]
          },
          {
            "description": "An MDM/UEM platform log indicates a critical compliance failure for a specific device (e.g., isRooted=true, osIntegrityCheck='Failed'). Within the subsequent 60-minute window, authentication logs (e.g., Windows Event ID 4624, IdP logs) show a successful login to a corporate service from an IP address last assigned to that same device.",
            "data_sources": [
              "MDM/UEM logs",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "VPN logs",
              "IdP logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM Management Servers, Authentication Servers, VPN Concentrators, Cloud Identity Providers.",
            "action": [
              "Create a real-time correlation rule that: 1. Triggers upon ingestion of an MDM/UEM log event indicating a critical compliance failure (e.g., isJailbroken = true, isRooted = true, or osIntegrityCheck = 'Failed'). 2. Upon trigger, extracts the device identifier and its last known IP address from VPN/MDM logs. 3. Queries all authentication logs (Windows Event ID 4624, IdP logs) for a successful login from that IP address within the next 60 minutes. 4. Generates a high-priority incident if such a login is found.",
              "For all critical MDM compliance alerts, perform the following analysis: 1. Calculate the 95th percentile for the 'time-to-remediate' for each specific alert type (e.g., 'jailbreak detected') across the entire device fleet. 2. Identify any device that remains in a non-compliant state for a duration exceeding this percentile. 3. For these long-duration non-compliant devices, query Zeek conn.log to check for active network traffic (e.g., total bytes transferred > 1MB in the last hour) from their associated IP. 4. Flag devices that are both non-compliant beyond the statistical norm and are actively using the network for automated quarantine or priority review.",
              "Train and deploy a classification model (e.g., XGBoost) to score the risk of each MDM compliance alert. Use features such as: the specific compliance failure, user's role, time of day, device OS, and a binary feature indicating if a successful authentication from the device's IP occurred within one hour. If the model's output probability for 'malicious event chain' exceeds a threshold of 0.9, automatically escalate the alert to a Tier 3 analyst and tag it for incident response."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]