[
  {
    "information_requirement": "Is an adversary encrypting data on corporate mobile devices for impact? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1471",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A single mobile application process generates a high volume of file modification or file rename events for common user file types (.jpg, .png, .doc, .pdf, .mov) within a short time window (e.g., under 5 minutes), where the volume deviates significantly from its historical baseline.",
            "data_sources": [
              "EDR:FileModification",
              "EDR:FileRename",
              "MDM:AppActivity"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data directories on managed mobile devices, including Android standard directories (e.g., /storage/emulated/0/DCIM, /storage/emulated/0/Documents) and iOS App Sandbox container directories.",
            "action": [
              "Create a rule to alert when a single process renames more than 20 files with extensions like .jpg, .pdf, or .mov to a new, consistent extension (e.g., .crypted, .locked) within a 60-second window, based on EDR:FileRename logs.",
              "For each mobile application, establish a 30-day rolling baseline of file modification events per minute. Trigger an alert if the count within a 1-minute window exceeds the 99th percentile of the application's historical activity or the 95th percentile of its peer group (e.g., all 'Photo & Video' apps).",
              "Implement a time-series anomaly detection model (e.g., ARIMA, LSTM) trained on per-application file I/O rates (events per minute). An alert should be generated if the observed rate exceeds the model's forecasted confidence interval for more than two consecutive minutes."
            ]
          },
          {
            "description": "Creation of one or more files with filenames matching known ransom note patterns (e.g., 'decrypt_me.txt') or content containing keywords associated with ransom demands (e.g., 'bitcoin', 'payment', 'private key').",
            "data_sources": [
              "EDR:FileCreation",
              "EDR:FileContentScan"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Root of user-accessible storage on mobile devices (e.g., /sdcard/, /storage/emulated/0/), directories containing recently modified user data, and application-specific data directories.",
            "action": [
              "Create a detection rule that scans EDR:FileCreation logs for filenames matching the regex pattern `/(readme|recover|decrypt|help|instruction|restore).*\\.(txt|html)$/i`. A match should generate a critical alert.",
              "When a potential ransom note is detected, calculate the 'directory fan-out' by counting the number of unique directories the responsible process writes the note to within 5 minutes. A fan-out value greater than 3 should escalate the incident priority.",
              "Apply a pre-trained text classification model (e.g., Naive Bayes, BERT) to the content of newly created .txt or .html files. If the model classifies the content as a 'ransomware note' with a confidence score above 0.95, based on keywords like 'bitcoin', 'wallet', and 'decrypt', trigger an automated device quarantine."
            ]
          },
          {
            "description": "A mobile application process, after exhibiting high-volume file I/O, initiates outbound network connections to domains on threat intelligence lists, domains registered within the last 30 days, or destinations with a high Shannon entropy score indicative of DGA.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "EDR:NetworkConnection"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, and cloud-based secure web gateways (SWG) that inspect mobile device traffic.",
            "action": [
              "Correlate file I/O alerts with network logs (Zeek conn.log, EDR:NetworkConnection) from the same device within a 5-minute window. Alert if the destination IP or domain matches a threat intelligence feed for 'Ransomware' or 'C2'.",
              "For DNS queries (Zeek dns.log) from a device with a file I/O alert, calculate the Shannon entropy of the queried second-level domains. An entropy score greater than 3.5 suggests DGA and should be alerted. Additionally, check the registration date of domains; connections to domains registered in the last 30 days should raise the device's risk score.",
              "Use an Isolation Forest model trained on benign network traffic features (destination port, bytes_out, protocol, JA3 hash from Zeek ssl.log). Flag any connection from a device with a recent file I/O alert that the model identifies as an anomaly, indicating potential C2 communication."
            ]
          },
          {
            "description": "File encryption activity is traced back to a mobile application that was installed from an unofficial app store (sideloaded) or possesses a rare and high-risk combination of permissions, such as `MANAGE_EXTERNAL_STORAGE` and `INTERNET`.",
            "data_sources": [
              "MDM:AppInventory",
              "MDM:AppPermissions",
              "MDM:PolicyComplianceStatus"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform's application inventory database and policy compliance logs.",
            "action": [
              "Create a rule to alert when a process causing a file I/O alert is associated with an application flagged by the MDM as 'sideloaded', 'unmanaged', or not present on the corporate app store allow-list.",
              "Calculate the prevalence of all permission combinations across the managed mobile fleet using MDM:AppPermissions data. If an application causing a file I/O alert has a permission combination present on less than 1% of devices, flag it as a high-confidence indicator.",
              "Use a clustering algorithm (e.g., DBSCAN) on application metadata (permissions, installation source, developer signature). If a file I/O alert originates from an application that falls into a pre-identified 'outlier' or 'anomalous' cluster, automatically escalate the incident priority."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]