[
  {
    "information_requirement": "Has an adversary compromised our mobile software supply chain to gain initial access? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1474.003",
        "name": "Compromise Software Supply Chain",
        "evidence": [
          {
            "description": "An updated mobile application, identified by its package name and version, possesses a digital signature hash that mismatches the official vendor-published hash. Concurrently, the application's manifest requests one or more new high-risk permissions (e.g., android.permission.BIND_ACCESSIBILITY_SERVICE, android.permission.READ_SMS, android.permission.INSTALL_PACKAGES) that were absent in the previously baselined version of the same application.",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory Logs",
              "Mobile Threat Defense (MTD) Signature Analysis Reports",
              "Vendor-Published Application Hashes",
              "Internal Application Hash Baseline",
              "Application Manifest Files (from MDM/MTD)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM servers, corporate-owned mobile endpoints, and internal/external application repositories used by the organization.",
            "action": [
              "For each application update event from MDM/MTD logs, extract the new package's signature hash. Compare this hash against a threat intelligence deny-list of known-malicious hashes and a vendor-provided allow-list of official hashes. Generate a high-severity alert for any deny-list match or if the hash is unverified by the allow-list.",
              "For each update, calculate the Jaccard similarity coefficient between the set of permissions in the old manifest and the new manifest. Alert if the similarity score drops below a dynamically tuned threshold (e.g., < 0.90 for a minor version update). Additionally, calculate a permission risk score by assigning weights to each permission (e.g., BIND_ACCESSIBILITY_SERVICE=10, READ_SMS=10). Flag any update where the percentage increase in this risk score exceeds the 99th percentile of all historical score increases for that specific application.",
              "Input features from the update (e.g., signature match status [match, mismatch, unknown], Jaccard similarity score, permission risk score delta, count of new high-risk permissions) into a pre-trained Random Forest or Gradient Boosting classification model. An alert is triggered if the model's output probability of compromise exceeds a calibrated threshold (e.g., > 0.85), especially when correlated with a signature mismatch from the symbolic check."
            ]
          },
          {
            "description": "Within 24 hours of a mobile application update event from MDM, network traffic from the associated device shows one or more of the following: 1) outbound connections to IPs or domains categorized as malicious C2 or malware hosting by threat intelligence; 2) DNS requests for domains with a Shannon entropy score > 3.5, indicating likely DGA; 3) TLS connections using a JA3/JA3S hash associated with known malware; or 4) total daily data egress (bytes out) exceeding the 99th percentile of the device's 30-day historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Mobile Device Management (MDM) Application Update Logs",
              "Threat Intelligence Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (firewalls, proxies), corporate DNS resolvers, VPN concentrators, and WiFi access points servicing managed mobile devices.",
            "action": [
              "Correlate MDM application update events with network logs from the device's IP. For every subsequent connection, query the destination IP (id.resp_h in Zeek conn.log), requested domain (query in Zeek dns.log), and TLS client fingerprint (ja3 in Zeek ssl.log) against threat intelligence feeds. Generate a high-severity alert for any match to a known malicious C2, DGA, or malware-associated indicator.",
              "For each device, maintain a 30-day rolling baseline of its average daily data egress (sum of orig_bytes in Zeek conn.log). Alert if the post-update daily egress exceeds the 99th percentile of this baseline. Concurrently, calculate the Shannon entropy for all newly requested second-level domains in Zeek dns.log post-update; alert on any domain with an entropy score greater than 3.5, as this is a strong indicator of DGA.",
              "Employ a time-series anomaly detection model (e.g., Seasonal-ARIMA or LSTM) trained on historical network traffic volume (total bytes per hour) for each device. If the actual traffic volume in the 24 hours post-update significantly deviates from the model's forecast by falling outside the 99% confidence interval for more than one consecutive hour, flag it as a temporal anomaly. Combine this anomaly flag with alerts from the symbolic and statistical methods to generate a final, aggregated risk score for analyst review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]