[
  {
    "information_requirement": "Has the adversary established external command and control (C2) channels on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1481.001",
        "name": "Dead Drop Resolver",
        "evidence": [
          {
            "description": "A network connection from a mobile device source IP to a known public web service (e.g., pastebin.com, github.com) is followed within a 60-second window by a second, distinct outbound connection from the same source IP. The destination of this second connection is anomalous, characterized by: a) presence in threat intelligence feeds, b) a domain popularity rank in the bottom 5th percentile across the organization, or c) a high-risk reputation score from a third-party service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi egress points, VPN concentrators handling mobile device traffic, MDM-managed device network segments, and network segments dedicated to guest or BYOD mobile devices.",
            "action": [
              "Using Zeek logs, identify connections (conn.log) from mobile IP ranges to a predefined list of potential dead drop resolver services (e.g., pastebin.com, github.com, social media APIs). For each identified source IP, search for a subsequent outbound connection within 60 seconds. Match the destination IP and/or domain (dns.log) of the second connection against a threat intelligence feed of known malicious C2 infrastructure. A match generates a high-severity alert for immediate investigation.",
              "For every two-step connection pattern identified (initial connection to a potential resolver followed by a second outbound connection), analyze the destination of the second connection. Using a 30-day baseline of Zeek dns.log data, calculate the access frequency (popularity) for all domains requested across the enterprise. Flag any second-connection destination domain with a popularity rank in the bottom 5th percentile as suspicious. Correlate this with other statistical anomalies, such as an unusually high number of bytes transferred (conn.log orig_bytes) compared to the baseline for that destination port.",
              "Develop a supervised classification model (e.g., Random Forest, Gradient Boosting) to score the likelihood of a connection pair being a dead drop event. Construct a feature vector for each pair, including: time delta between connections, bytes transferred in the second connection (conn.log), destination domain popularity rank, destination Autonomous System Number (ASN), and the TLS Server Name Indication (SNI) from ssl.log. Train the model on labeled historical data. In production, a prediction score exceeding a tuned threshold (e.g., 0.85) indicates a likely compromised device and should be escalated."
            ]
          },
          {
            "description": "A mobile device connects to a legitimate content-hosting web service, and the content of the response body (e.g., from an unencrypted HTTP response or a captured file) contains an IP address or Fully Qualified Domain Name (FQDN). The same mobile device subsequently initiates a connection to that extracted IP or FQDN within a 2-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with L7 visibility, DNS resolvers, and web proxies serving mobile device traffic.",
            "action": [
              "From network traffic logs, correlate DNS requests (dns.log) with subsequent HTTP/TLS sessions (http.log, ssl.log) from mobile IP ranges. For unencrypted traffic or where file content is captured (files.log), use regular expressions to parse response bodies for IPv4 addresses and FQDNs. Match any extracted indicators against a threat intelligence list of known malicious infrastructure. If a subsequent outbound connection (conn.log) from the same source IP is made to a matched indicator within a 2-minute window, generate a high-severity alert.",
              "For all FQDNs extracted from response bodies that are subsequently contacted, calculate the Shannon entropy of the hostname. A score greater than 3.5 suggests a high degree of randomness, indicative of a Domain Generation Algorithm (DGA), and should be flagged. Additionally, calculate the enterprise-wide access frequency for each contacted domain using a 30-day dns.log baseline; flag any domain in the bottom 1st percentile as highly unusual and worthy of investigation.",
              "Establish a baseline of request volume from the mobile device fleet to the known dead-drop resolver domains (e.g., api.twitter.com, gist.github.com). Aggregate request counts per hour using Zeek http.log or dns.log. Apply a time-series anomaly detection model (e.g., SARIMA, Prophet) that accounts for daily and weekly seasonality. An observed spike in request volume that deviates significantly (e.g., more than 3 standard deviations) from the forecasted volume should be flagged as a potential coordinated campaign, triggering a focused investigation into all requesting devices during the anomalous period."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]