[
  {
    "information_requirement": "Is an adversary evading defenses by abusing accessibility services to perform actions on behalf of the user? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "An MDM log event indicates an application was granted 'BIND_ACCESSIBILITY_SERVICE' permission on a mobile device. Within the subsequent 15-minute window, network logs for that device show one or more of the following: (1) connections to domains, IPs, or with TLS fingerprints (JA3/JA3S) matching threat intelligence feeds for mobile malware; (2) network connection patterns that are statistical outliers compared to the device's 30-day baseline, such as a high-entropy distribution of destination ports (port scanning), low-variance inter-arrival times (beaconing), or an anomalously high number of distinct destination IPs; (3) an unusually large data upload to a previously uncontacted destination.",
            "data_sources": [
              "MDM Logs",
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN terminators, Mobile Device Management (MDM) platform, and DNS resolvers used by mobile devices.",
            "action": [
              "Correlate the device from the MDM 'BIND_ACCESSIBILITY_SERVICE' grant event with its IP address from DHCP or VPN logs. In the following 15-minute window, query Zeek dns.log, ssl.log, and conn.log for that IP. Match destination FQDNs, IPs, and JA3/JA3S hashes against a threat intelligence feed of known mobile malware command-and-control (C2) infrastructure. Also, inspect zeek.notice.log for 'SSL::Invalid_Server_Cert' or similar alerts associated with the device's IP and generate an alert on any match.",
              "For the 15-minute window post-permission grant, establish a device-specific feature set from Zeek logs. Calculate the Shannon entropy of destination ports in conn.log; alert if the score exceeds the 98th percentile of the device's 30-day historical baseline. Calculate the standard deviation of connection inter-arrival times to any single destination IP; alert if the value is below 1 second, indicating automated beaconing. Count the number of distinct destination IPs contacted and alert if the count exceeds the 99th percentile of the device's daily baseline.",
              "Apply a pre-trained one-class anomaly detection model (e.g., Isolation Forest or One-Class SVM) to network sessions from the device in the 15-minute window. The model should be trained on a baseline of the device's normal network behavior (e.g., past 30 days of Zeek conn.log, ssl.log, dns.log). Features should include: session duration, total bytes sent/received, protocol, JA3/JA3S hash pair, SSL certificate issuer, destination port, and DNS query length. Flag any session scored as a high-confidence anomaly for analyst review."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary causing impact by programmatically interacting with sensitive applications (e.g., financial, messaging) to steal data or funds? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "Network traffic from a mobile device to a known financial, enterprise Single Sign-On (SSO), or sensitive cloud service FQDN exhibits characteristics inconsistent with typical user-driven interaction. These include: (1) highly periodic connection timing (e.g., heartbeat with jitter less than 1 second); (2) outbound data volume (orig_bytes) for a single session that exceeds the 99th percentile of the user's historical baseline for that specific service; or (3) use of TLS/HTTP parameters (e.g., JA3 hash, User-Agent string) that do not match a pre-defined whitelist of known-good values for the legitimate mobile application.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek http.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments for corporate and guest Wi-Fi, cloud service provider network ranges, known financial service IP blocks, and internet gateways.",
            "action": [
              "Maintain a list of sensitive FQDNs (financial, SSO, etc.) and a corresponding whitelist of known-good JA3/JA3S hashes and HTTP User-Agent strings for their legitimate mobile apps. Continuously monitor Zeek ssl.log and http.log for connections to these FQDNs. Generate an alert if a connection's JA3/JA3S hash pair or User-Agent string does not appear in the established whitelist for that service. Correlate with MDM logs to check for recently installed or permission-updated applications on the source device.",
              "For each user-and-service pair (e.g., 'user_A' to 'mybank.com'), establish a 30-day rolling baseline for session metrics from Zeek conn.log. Generate an alert if a new session's outbound data volume (orig_bytes) exceeds the 99.5th percentile of that baseline. Separately, analyze the time series of connection start times over a 1-hour window; an autocorrelation value greater than 0.8 at a non-zero lag indicates suspicious periodicity. Also, alert if the ratio of orig_bytes to resp_bytes for a session is a statistical outlier (e.g., greater than 3 standard deviations from the mean ratio), suggesting one-way data exfiltration.",
              "Implement a supervised classification model (e.g., Random Forest or Gradient Boosting) to classify network sessions to sensitive services as 'benign' or 'automated/malicious'. Train the model on labeled data, where 'benign' is normal user traffic and 'automated/malicious' is synthetically generated or captured from malware samples. Features should include: session duration, orig_bytes, resp_bytes, protocol, JA3/JA3S hashes, HTTP method (GET/POST), URI length, and time-of-day. A session classified as 'automated/malicious' with high confidence (greater than 0.9) should trigger a high-severity alert for immediate investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]