[
  {
    "information_requirement": "Is an adversary using a non-standard or custom encrypted channel for command and control on our managed mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521",
        "name": "Encrypted Channel",
        "evidence": [
          {
            "description": "A TLS session from a managed mobile device utilizes a certificate that is self-signed, issued by a non-allowlisted Certificate Authority, or is associated with a destination domain that is newly registered (e.g., within 30 days) or has a low reputation score.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors at internet egress points (e.g., corporate Wi-Fi gateways, VPN concentrators), Cloud Access Security Broker (CASB) logs, and Mobile Device Management (MDM) platform for device context and asset information.",
            "action": [
              "Create a detection rule that joins Zeek ssl.log and x509.log on the connection UID. Alert on any TLS session from the mobile device IP range where the x509.validation_status is 'self-signed certificate' OR the x509.issuer is not on the corporate CA allowlist. For these alerts, enrich with DNS data from dns.log and escalate priority if the server name matches a domain on a threat intelligence feed or was registered within the last 30 days.",
              "On a scheduled basis (e.g., hourly), query Zeek ssl.log and conn.log for all connections from mobile devices to destinations not seen in the previous 30 days. Enrich the destination IPs with reputation scores from a threat intelligence provider. Calculate the distribution of these reputation scores and flag any connection to an IP with a score in the bottom 5th percentile for investigation.",
              "Train a Random Forest classification model using historical, labeled Zeek ssl.log and x509.log data. Engineer features including: certificate validity period, Shannon entropy of the certificate's subject and issuer fields, the public key algorithm, a boolean for self-signed status, and a boolean indicating if the domain is newly registered. Deploy the model to score new TLS sessions in real-time and alert when a session's predicted probability of being malicious exceeds a tuned threshold."
            ]
          },
          {
            "description": "A TLS client hello from a managed mobile device produces a JA3 or JA3S hash that is either not on an established allowlist of sanctioned applications or has a prevalence below the 1st percentile across the entire managed device fleet.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at internet egress points, virtual tap points in the cloud environment, and the Mobile Device Management (MDM) platform for application inventory.",
            "action": [
              "Establish and maintain an allowlist of known-good JA3 and JA3S hashes by baselining traffic from sanctioned mobile applications over a 30-day period. Create a detection rule to query Zeek ssl.log and alert on any TLS session from a mobile device that presents a JA3 or JA3S hash not on the allowlist. Enrich alerts with device context from an MDM platform.",
              "Run a daily query against Zeek ssl.log to calculate the prevalence of every unique JA3 hash observed across the mobile device fleet over the last 30 days. Identify any connection using a JA3 hash that falls below the 1st percentile of prevalence, and flag it as a rare client fingerprint requiring investigation.",
              "For each unique mobile device, create a feature vector representing the set of JA3 hashes it has used over a rolling 7-day period. Apply a density-based clustering algorithm like DBSCAN to these device vectors. Investigate small, dense clusters as they represent groups of devices exhibiting identical, and potentially malicious, TLS client fingerprinting behavior."
            ]
          },
          {
            "description": "An encrypted TCP connection from a managed mobile device exhibits characteristics of C2 beaconing, such as a connection duration exceeding 12 hours, periodic data transfers of a near-identical size, and a low standard deviation of inter-packet arrival times.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, VPN concentrators, and network taps monitoring traffic from split-tunneling configurations on mobile devices.",
            "action": [
              "Create a detection rule that queries Zeek conn.log for established TCP connections (state is not 'S0', 'S1', or 'REJ') from the mobile device IP range where the connection duration exceeds 12 hours and the sum of originator and responder bytes is less than 5 KB. Alert on these long-lived, low-throughput connections as potential idle C2 channels.",
              "For each unique source-destination IP pair involving a mobile device, aggregate connection data from Zeek conn.log over a 24-hour period. Calculate the standard deviation of the time difference between consecutive connections and the standard deviation of the originator payload size (orig_bytes). Alert on pairs where both standard deviations are in the bottom 5th percentile, indicating a highly regular, machine-generated 'heartbeat' pattern.",
              "From Zeek conn.log, extract the time series of connection start times for each source-destination pair with more than 10 connections in an hour. Apply a Fast Fourier Transform (FFT) to the inter-arrival times of this series to identify dominant frequencies. Train a model to alert when the power of the dominant frequency is significantly higher than the average power across the spectrum, indicating periodic beaconing."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]