[
  {
    "information_requirement": "Is an adversary using a managed mobile device as a proxy to conceal C2 communications or other malicious activity, such as masquerading traffic to evade IP-based restrictions? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1604",
        "name": "Proxy Through Victim",
        "evidence": [
          {
            "description": "A managed mobile device transmits a volume of outbound data over a specific time window (e.g., 1 hour, 24 hours) that is anomalously large compared to its own historical baseline or the baseline of its peer group. The traffic cannot be attributed to legitimate high-volume activities such as system updates, cloud backups, or large file synchronizations.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN gateways, and network egress points monitoring traffic from mobile device subnets.",
            "action": [
              "Query Zeek conn.log for connections originating from the mobile device IP space. Alert if the sum of `orig_bytes` for a single device exceeds a static high-watermark threshold (e.g., 10 GB in 1 hour), excluding traffic to known OS update or corporate backup destinations.",
              "For each mobile device (`id.orig_h`), calculate the sum of outbound bytes (`orig_bytes`) from Zeek conn.log in 1-hour and 24-hour windows. Using a 30-day history, compute the moving average and standard deviation for each device. Trigger an alert if a device's outbound traffic exceeds 3 standard deviations from its own mean or surpasses the 99th percentile of its defined peer group (e.g., 'Sales Team Mobiles').",
              "For each device, develop a time-series anomaly detection model (e.g., SARIMA, Prophet) using at least 90 days of historical outbound data volume (`orig_bytes`). Continuously feed live data into the model. Generate an alert for analyst investigation when the observed data volume significantly deviates from the model's prediction and falls outside the established confidence interval."
            ]
          },
          {
            "description": "A mobile device connects to or resolves an unusually high number of unique destination IP addresses or domain names within a short period. The set of resolved domains demonstrates high Shannon entropy, indicating a lack of pattern typical of automated or proxied activity rather than direct user interaction.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, network firewalls, and web proxies that log DNS queries and outbound connections from mobile devices.",
            "action": [
              "From Zeek dns.log, monitor DNS queries from mobile devices (`id.orig_h`). Compare queried domains against a pre-defined allowlist of common/corporate domains. Trigger an alert if a device queries a high number of unique domains not on the allowlist (e.g., >100) within a 5-minute window, prioritizing domains that are newly observed across the enterprise.",
              "For each mobile device, calculate two metrics over a 1-hour window: 1) the count of unique second-level domains (SLDs) from the `query` field in Zeek dns.log, and 2) the Shannon entropy of that set of SLDs. Generate a high-confidence alert if a device's unique domain count exceeds the 98th percentile of its peer group AND its domain entropy score is more than 2 standard deviations above its own 30-day baseline.",
              "Train an Isolation Forest model using features aggregated per device over a 1-hour window. Source features from Zeek dns.log and conn.log, including: unique destination IP count, unique DNS query count, Shannon entropy of destination SLDs, ratio of failed to successful DNS queries (where `rcode` is not 'NOERROR'), and ratio of failed to successful TCP connections (where `conn_state` is not 'SF'). Flag devices that the model identifies as strong outliers for further analysis."
            ]
          },
          {
            "description": "A mobile device establishes outbound network connections using destination ports commonly associated with proxy services (e.g., SOCKS on port 1080) or using ports that are inconsistent with the applications installed on the device as defined by its Mobile Device Management (MDM) profile.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/EMM Application Inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors at egress points, firewall logs, and MDM/EMM management platforms.",
            "action": [
              "Create a rule to monitor Zeek conn.log for any traffic from the mobile device subnet (`id.orig_h`) to known proxy-related destination ports (e.g., 1080, 3128, 8080, 8888). Generate a high-priority alert, excluding traffic to approved internal services or traffic that can be correlated with an approved application from the MDM/EMM inventory.",
              "For each device, create a baseline profile of normal destination ports (`id.resp_p` in Zeek conn.log) used over a 30-day period. In a rolling 1-hour window, calculate the ratio of connections made to 'rare' ports (those not in the baseline) versus 'common' ports. Alert when this ratio exceeds the 95th percentile for the device's peer group.",
              "Train a one-class SVM (Support Vector Machine) model for each device or device group on historical connection data tuples, including features like destination port, protocol, and bytes transferred. Use the trained model to classify new, live connections. Flag any connection classified as an anomaly, especially those involving ports or protocols not typically associated with that device's profile."
            ]
          },
          {
            "description": "A mobile device exhibits an anomalously high number of concurrent outbound network connections, or maintains individual connections for exceptionally long durations. This behavior is characteristic of a device being used as a persistent C2 relay or a proxy for tunneled traffic.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors (e.g., Zeek sensors) at key chokepoints like the Wi-Fi access controller or VPN concentrator.",
            "action": [
              "Query Zeek conn.log to identify any single TCP connection from a mobile device (`id.orig_h`) with a `duration` exceeding a static threshold (e.g., 24 hours) and a `conn_state` of 'SF' (Established). Prioritize alerts for connections to destination IPs that are not on an allowlist of known corporate or major cloud services.",
              "In 5-minute intervals, calculate two metrics for each device from Zeek conn.log: a) the total count of active outbound connections, and b) the average `duration` of connections that terminated within the interval. Use a multivariate outlier detection algorithm, such as Mahalanobis distance, to identify devices that are anomalous across both metrics simultaneously when compared to their own 30-day historical profile.",
              "Apply a density-based clustering algorithm, such as DBSCAN, to the entire population of mobile devices. Use features calculated over a 24-hour period from Zeek conn.log, such as 'average number of concurrent outbound connections,' '95th percentile of connection duration,' and 'total outbound bytes.' Investigate any devices classified as noise points by the algorithm, as their network behavior is distinct from all identified peer groups."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]