[
  {
    "information_requirement": "Is the adversary concealing captured multimedia files on mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.003",
        "name": "Conceal Multimedia Files",
        "evidence": [
          {
            "description": "The creation of a '.nomedia' file on an Android device is observed, where the creating process is not an authorized media or system application. This is often coupled with the file being created in a directory path exhibiting a high Shannon entropy score (e.g., > 3.5), suggesting an attempt to obfuscate the storage location.",
            "data_sources": [
              "Mobile EDR File System Auditing Logs",
              "Mobile MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of corporate-managed Android devices, specifically user-writable directories such as /storage/emulated/0/DCIM/, /storage/emulated/0/Pictures/, /storage/emulated/0/Download/, and application-specific data folders.",
            "action": [
              "Query Mobile EDR logs for any file creation event where 'filename' equals '.nomedia'. Compare the 'process_name' or 'application_id' of the creating process against a curated allowlist of legitimate media-related applications (e.g., com.google.android.apps.photos, com.android.gallery3d, system_server). Generate a medium-severity alert for any process not on the allowlist.",
              "For each '.nomedia' creation event, calculate the Shannon entropy of the parent directory's full path string. Establish a baseline entropy for common directory paths on the platform. Generate a high-severity alert if the calculated entropy for a new event exceeds the 98th percentile of the baseline or a static threshold (e.g., > 3.5), indicating a likely obfuscated storage location.",
              "Train a classification model (e.g., Logistic Regression, Random Forest) to predict the maliciousness of '.nomedia' creation events. Use features from Mobile EDR and MDM logs, such as: parent_directory_entropy, application_age_days, application_permission_count, is_sideloaded_app (boolean), and is_in_common_media_path (boolean). Deploy the trained model to score all new '.nomedia' creation events. An event with a predicted probability score greater than 0.90 should trigger a critical alert for immediate analyst review."
            ]
          },
          {
            "description": "A mobile device initiates an outbound network connection transferring a large volume of data identified by multimedia MIME types (e.g., 'image/jpeg', 'video/mp4') to a destination that is either new for that device or has a low reputation score, suggesting exfiltration of concealed files.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring traffic from mobile device subnets, including corporate Wi-Fi gateways, VPN concentrators, and Cloud Access Security Brokers (CASB).",
            "action": [
              "From Zeek DNS and HTTP logs (dns.log, http.log), correlate DNS queries and HTTP host headers originating from the mobile device IP space with a threat intelligence feed of known malicious C2 domains. If a match is found, cross-reference the connection UID in Zeek connection logs (conn.log) and file logs (files.log). Generate a critical alert if files.log shows the transfer of multimedia MIME types in the same session.",
              "For each mobile device IP, create a 30-day rolling baseline of outbound data volume (tx_bytes from conn.log) per destination Autonomous System Number (ASN) and destination port (id.resp_p). Also, maintain a historical set of domains contacted by each device. Generate a high-severity alert when a connection's tx_bytes exceeds the 95th percentile for its destination ASN/port combination AND the destination domain (from dns.log or http.log) has not been seen for that device in the last 60 days.",
              "Implement a time-series anomaly detection model (e.g., Prophet or LSTM) on the total volume of outbound multimedia bytes (aggregated from files.log where mime_type is a multimedia type) per device, per hour. An observed volume that is a statistically significant outlier (e.g., outside the 99% confidence interval) from the model's forecast should trigger a medium-severity alert. Enrich the alert by using a clustering algorithm (e.g., DBSCAN) on connection features from conn.log (e.g., duration, proto, orig_pkts, resp_pkts) to highlight traffic patterns that are structurally dissimilar from the device's normal behavior."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]