[
  {
    "information_requirement": "Is an adversary attempting to intercept credentials or access tokens by hijacking URI schemes on mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1635.001",
        "name": "URI Hijacking",
        "evidence": [
          {
            "description": "An application is identified on a mobile device that has registered a URI scheme identical to a legitimate, trusted application, but possesses a different package ID or signing certificate. The identified application also exhibits one or more high-risk attributes, such as being sideloaded, having an untrusted signing certificate, or a poor threat intelligence reputation.",
            "data_sources": [
              "MDM Application Inventory Data",
              "MTD Agent Scan Logs",
              "Threat Intelligence Platform Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Mobile Endpoints (iOS/Android), Mobile Device Management (MDM) Server, Mobile Threat Defense (MTD) Platform, Application Vetting System",
            "action": [
              "Define and maintain an allowlist of trusted application package IDs and their corresponding URI schemes. In a SIEM, join the mobile application inventory data with this allowlist on the `uri_scheme` field. Trigger an alert for any entry where the `uri_scheme` matches but the `package_id` is not on the allowlist for that scheme. Increase alert severity if the application's `is_sideloaded` attribute is true.",
              "For each sensitive URI scheme (e.g., 'msauth://', 'okta://'), calculate the number of unique `package_id`s registered to it across the device fleet. Establish a baseline for this count. Generate an alert if the count for any sensitive scheme increases by a statistically significant amount (e.g., > 3 standard deviations above the 30-day moving average) within a 24-hour period. Separately, calculate the fleet-wide prevalence for every `package_id`. Alert if a package with a prevalence below the 5th percentile registers a URI scheme used by a package with a prevalence above the 95th percentile.",
              "Develop and deploy a risk classification model (e.g., Logistic Regression) to score each newly observed application-URI registration. Engineer features including: `is_sideloaded` (boolean), `has_untrusted_signer` (boolean), `permission_count` (integer), `is_sensitive_scheme` (boolean), `package_prevalence_percentile` (float), and `threat_intel_score` (float). Train the model on historical data labeled by security analysts. In production, score each new registration and generate a high-severity alert for any application-URI pair with a risk score exceeding a predetermined threshold (e.g., > 0.85)."
            ]
          },
          {
            "description": "A mobile device generates multiple 'application chooser' dialog events for a single, sensitive URI scheme within a short time frame. The rate of these events is anomalous when compared to the device's own historical baseline or the fleet-wide average for that URI scheme.",
            "data_sources": [
              "MTD Security Event Log",
              "Android Logcat Data (via MTD)",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Mobile Endpoints (iOS/Android), Mobile Threat Defense (MTD) Platform, Network Gateways (VPN Concentrators, Proxies)",
            "action": [
              "Create a SIEM correlation rule that triggers on MTD logs where `event_type` is 'app_chooser_dialog' and the `uri_scheme` is on a watchlist of sensitive schemes (e.g., for SSO, finance apps). Generate a high-severity alert if a single `device_id` produces more than two such events for the same `uri_scheme` within a 5-minute window. Enrich the alert with the source IP from `Zeek conn.log` and the referring URL from `Zeek http.log` from the same timeframe to identify potential phishing sources.",
              "For each `user_id`, ingest 'app_chooser_dialog' event counts into a time-series database. Calculate a 30-day baseline mean and standard deviation of daily events for each user. Generate a medium-severity alert if a user's daily event count exceeds their personal mean by more than 3 standard deviations. This identifies user-specific behavioral anomalies.",
              "Implement a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the aggregated count of 'app_chooser_dialog' events per hour across the entire mobile fleet. The model should be trained to account for normal business-hour patterns and weekly seasonality. Trigger an alert when the observed event count significantly deviates from the model's predicted forecast band. Automatically enrich the alert with the top contributing `uri_schemes`, `package_names`, and `device_ids` during the anomalous period."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]