[
  {
    "information_requirement": "Is the adversary using Domain Generation Algorithms (DGAs) to establish command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637.001",
        "name": "Domain Generation Algorithms",
        "evidence": [
          {
            "description": "A single mobile device IP generates a high volume of DNS requests (e.g., >50) for unique, non-existent domains (NXDOMAIN) in a short time frame (e.g., 5 minutes), and the queried domains exhibit non-linguistic characteristics with a Shannon entropy score above 3.5.",
            "data_sources": [
              "Zeek dns.log",
              "Windows DNS Server Analytic Event ID 260"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal and external DNS server logs; VPN concentrator logs for remote mobile devices; Enterprise Wi-Fi access point logs; Mobile Device Management (MDM) platform logs; Cloud Access Security Broker (CASB) traffic logs.",
            "action": [
              "Monitor Zeek dns.log for queries from mobile device IP ranges. Match the 'query' field against a threat intelligence feed of known DGA domain patterns or regular expressions. Generate a high-severity alert for any match.",
              "Using Zeek dns.log, group records by source IP ('id.orig_h') in 5-minute windows. For each IP, count unique queries where 'rcode_name' is 'NXDOMAIN' and calculate the average Shannon entropy of the query strings. Establish baselines for both metrics across mobile device subnets. Alert when a single IP's NXDOMAIN count exceeds the 99th percentile and its average domain entropy is greater than 3.5.",
              "Extract a feature vector (e.g., domain length, entropy, n-gram frequency, numeric character ratio, vowel-consonant ratio) for each unique domain in Zeek dns.log that is not on an allowlist. Use a pre-trained classification model (e.g., Random Forest, LSTM) to assign a DGA probability score. Escalate domains with a score > 0.90 that are also associated with a high NXDOMAIN rate from a single mobile client IP."
            ]
          },
          {
            "description": "A mobile device successfully resolves a domain via DNS and initiates a network connection (TCP/UDP) to the resolved IP. The domain was registered within the last 72 hours and has low internal prevalence, with fewer than 5 unique organizational devices having connected to it in the last 30 days.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points; Internet gateway proxy and firewall logs; DNS resolver caches and logs; Mobile Device Management (MDM) solution logs; External WHOIS registration databases.",
            "action": [
              "For every successful DNS resolution ('rcode' is 'NOERROR') in Zeek dns.log from a mobile IP, enrich the domain with WHOIS creation date information. Generate a medium-severity alert if the 'create_date' is within the last 3 days.",
              "Join Zeek dns.log records (where 'rcode' is 'NOERROR') with Zeek conn.log records on the resolved IP for mobile device IP ranges. Filter for connections to domains created within the last 30 days. For each of these young domains, count the number of unique internal source IPs ('id.orig_h') that connected. Escalate alerts for connections to domains where this internal prevalence count is less than 5.",
              "For each mobile device IP, create a daily time series of the count of connections to newly registered domains (e.g., created within the last 7 days). Apply a time series anomaly detection model (e.g., SARIMA or Prophet) to this data. Flag any days with statistically significant spikes in activity for investigation as potential beaconing to new C2 infrastructure."
            ]
          },
          {
            "description": "A mobile device, after a series of failed DNS requests (NXDOMAIN), successfully resolves a domain and then initiates DNS tunneling. This is evidenced by an abnormally high frequency of DNS queries (>100 in 10 minutes) or queries with large payloads (average query length > 100 bytes) to multiple subdomains of the newly resolved parent domain.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers; DNS firewalls; Network Security Monitoring (NSM) sensors at network egress points; Packet capture (PCAP) from network taps.",
            "action": [
              "Create a rule to inspect Zeek dns.log for queries originating from mobile device IPs. Alert if a DNS query label exceeds 63 characters, the total query length exceeds 255 bytes, or the query contains patterns indicative of encoding (e.g., long hex or Base64 strings). Correlate these alerts with recent high-entropy or NXDOMAIN activity from the same source IP.",
              "In 10-minute windows, group Zeek dns.log records by source IP ('id.orig_h') and parent domain. Calculate the query frequency and the average query length. Establish a baseline for these metrics. Alert when a source IP/parent domain pair exceeds the 99.5th percentile for either metric, especially if the parent domain was recently registered or has a high entropy score.",
              "Extract features from DNS traffic per source IP over a 1-hour window (e.g., query frequency, query length distribution, response size distribution, subdomain entropy, count of unique subdomains per parent domain). Use an unsupervised clustering model (e.g., DBSCAN) to identify outliers. Investigate clusters characterized by high-frequency, large-payload queries to a limited set of parent domains as probable DNS tunneling."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]