[
  {
    "information_requirement": "Are adversaries accessing credentials stored on corporate mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1634",
        "name": "Credentials from Password Store",
        "evidence": [
          {
            "description": "A mobile device's compliance status changes to 'non-compliant' due to 'jailbreak' or 'root' detection in MDM/UEM logs. Within 24 hours of this event, the device's user account is associated with a high volume of failed logins (Windows Event ID 4625) across multiple enterprise assets, and the device's source IP address exhibits an outbound data volume spike greater than the 95th percentile of its 30-day baseline in Zeek conn.log.",
            "data_sources": [
              "MDM/UEM device compliance logs",
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Windows Event ID 4768",
              "Windows Event ID 4769"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM management server; Network egress points instrumented with Zeek sensors; VPN concentrators; Corporate Wi-Fi Access Point Controllers; Domain Controllers and Authentication Servers; Cloud identity provider logs (e.g., Azure AD, Okta).",
            "action": [
              "Create a detection rule that triggers when an MDM/UEM log shows a device 'compliance_status' changing to 'non-compliant' with a 'reason' of 'jailbreak_detected' or 'root_detected'. Upon trigger, execute a query for the affected user that searches for a subsequent spike (e.g., >10 events in 5 minutes) in failed logon events (Windows Event ID 4625) from multiple source workstations. Correlate the mobile device's last known IP address with Zeek conn.log and alert on any connection to an IP or domain on a threat intelligence blocklist of known malicious infrastructure.",
              "For each device flagged for jailbreaking, establish a 30-day rolling baseline of its daily outbound data volume ('orig_bytes' in Zeek conn.log). Generate an alert if the daily volume exceeds the 95th percentile of its historical distribution. Additionally, for the affected user, baseline the set of source countries and ASNs for all successful logins (Windows Event ID 4624). Alert if, post-jailbreak, a successful login occurs from a country or ASN never before seen for that user.",
              "Deploy a time-series anomaly detection model (e.g., Prophet, ARIMA) on per-device, per-hour outbound byte counts and distinct connection counts from Zeek conn.log. A significant, unexplained spike following a jailbreak event should be flagged as a high-risk anomaly. Train a classification model (e.g., XGBoost) to produce a 'credential compromise risk score' for each user. Features must include 'is_jailbroken' (binary), 'outbound_bytes_24hr_vs_30d_avg_zscore', 'failed_login_spike_count_for_user', 'destination_country_rarity_score', and 'connection_count_vs_peer_group_percentile'. The model should output a probability score and a list of the top contributing features for explainability."
            ]
          },
          {
            "description": "An application not present on the corporate MDM/UEM allowlist is installed on a mobile device. Subsequently, that device is observed in Zeek dns.log generating DNS queries for domains with Shannon entropy scores above 3.5, or it is observed in Zeek conn.log initiating periodic, direct-to-IP connections with a low variance (<10 seconds) in inter-arrival time, indicative of C2 beaconing.",
            "data_sources": [
              "MDM/UEM application inventory logs",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM management server; Corporate DNS resolvers logging to Zeek; Network egress points instrumented with Zeek sensors; Cloud Access Security Broker (CASB) logs; Mobile Application Management (MAM) servers.",
            "action": [
              "Continuously ingest MDM/UEM application inventory logs. For each new application installation, compare its package name and signing certificate hash against a corporate allowlist and a threat intelligence feed of known malicious application indicators. For any non-allowlisted app, create a rule to alert if its associated device IP initiates connections in Zeek conn.log that have no corresponding successful DNS query in Zeek dns.log within a 5-minute lookback window, especially to IPs in unallocated or suspicious Autonomous Systems (ASNs).",
              "For traffic from devices with unauthorized apps, calculate the Shannon entropy of all requested second-level domains in Zeek dns.log over a 1-hour sliding window. An average entropy score greater than 3.5 should trigger an alert for potential Domain Generation Algorithm (DGA) activity. For direct-to-IP connections from these devices, calculate the standard deviation of the inter-arrival time between connections to the same destination IP in Zeek conn.log over a 24-hour period. A standard deviation of less than 10 seconds for a connection series with more than 10 events is a strong statistical indicator of automated C2 beaconing.",
              "Use a clustering algorithm (e.g., DBSCAN) on features extracted from Zeek conn.log for traffic originating from devices with unauthorized apps. Features should include 'protocol', 'destination_port', 'connection_duration', 'total_bytes_sent', 'periodicity_score' (derived from the variance of inter-arrival times), and 'dns_query_entropy_score'. Clusters that are small and distant from the large, central cluster of 'normal' traffic represent high-confidence anomalies. Alternatively, train an autoencoder on the same feature set from known-good traffic; a high reconstruction error for traffic from a device with an unauthorized app indicates anomalous behavior."
            ]
          },
          {
            "description": "A user's credentials are used for a successful login (Windows Event ID 4624) from a source IP address (from Zeek conn.log) that belongs to an anonymizing proxy or has no historical association with that user's typical login locations. This is followed by anomalous access to cloud or on-premise data repositories by that user account.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Cloud/SaaS application access logs",
              "VPN Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers; VPN Concentrators; Cloud Identity Providers (e.g., Azure AD, Okta); SaaS application platforms (e.g., O365, Salesforce); Network egress points instrumented with Zeek sensors.",
            "action": [
              "Create a rule that cross-references every successful authentication event (Windows Event ID 4624) with threat intelligence feeds. Generate a high-priority alert if the source IP address from the login event is present on a blocklist for anonymizing services, such as TOR exit nodes or commercial VPN providers, and the user is not expected to use such services.",
              "For each user, maintain a rolling 90-day baseline of source Autonomous Systems (ASNs) and countries for all successful logins, derived from correlating Windows Event ID 4624 with IP geolocation data from Zeek conn.log. Generate an alert if a successful login occurs from an ASN or country from which the user has never logged in before. This indicates a potential 'impossible travel' or credential reuse scenario.",
              "Train a peer group analysis model (e.g., using k-means clustering) to group users by their typical login behaviors (source ASNs, time-of-day, day-of-week, systems accessed). A login that causes a user to be re-assigned to a new, distant cluster from their own should be flagged as anomalous. This can be supplemented with a supervised classifier (e.g., Random Forest) trained on labeled historical data to predict credential reuse, using features like 'is_new_ASN_for_user', 'is_new_country_for_user', 'time_of_day_zscore', and 'is_hosting_provider_IP'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]