[
  {
    "information_requirement": "Has an adversary modified device security policies to evade defenses? (TA0030 - Defense Evasion) (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1632.001",
        "name": "Code Signing Policy Modification",
        "evidence": [
          {
            "description": "A state change event for the Android 'REQUEST_INSTALL_PACKAGES' permission is logged with a state of 'granted' for an application package name not present on the organizational allowlist of approved application installers.",
            "data_sources": [
              "MDM Log: ApplicationPermissionStateChange",
              "MDM Asset Inventory: ApplicationList"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed Android device fleet; MDM Management Server; Organizational App Store Servers",
            "action": [
              "Create and maintain an allowlist of package names authorized to hold the 'REQUEST_INSTALL_PACKAGES' permission (e.g., 'com.android.vending'). Configure a SIEM rule to query MDM logs for 'ApplicationPermissionStateChange' events. Trigger a high-severity alert when this permission is granted to any package name not on the allowlist.",
              "For any application granted the 'REQUEST_INSTALL_PACKAGES' permission, query the MDM application asset inventory to determine its prevalence as a percentage of devices on which it is installed. Calculate a 90-day rolling baseline of prevalence for all applications. Flag for review any application granted this permission whose prevalence is below the 5th percentile, indicating it is an unusually rare installer.",
              "Train a logistic regression classifier to predict the likelihood of a 'REQUEST_INSTALL_PACKAGES' permission grant being malicious. Use features such as application prevalence (numeric, normalized), application category (one-hot encoded), installation source (e.g., 'Google Play', 'sideloaded'), the total count of other 'dangerous' permissions requested by the app (numeric), and a binary flag for whether the app is managed by MDM. An output probability score greater than 0.8 should trigger an automated investigation workflow."
            ]
          },
          {
            "description": "A user-added CA certificate is detected on an Android device, and its SHA-256 thumbprint does not match any thumbprint on the organizational allowlist of trusted, user-installable CAs.",
            "data_sources": [
              "MDM Asset Inventory: DeviceCertificateList",
              "MDM Compliance Log: CertificateInstallEvent"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed Android device fleet; MDM Management Server; Public Key Infrastructure (PKI) Servers",
            "action": [
              "Create and maintain an allowlist of SHA-256 thumbprints for all organizationally approved, user-installable CA certificates. Write a recurring script to query the MDM's device certificate inventory. Compare the set of installed user-added CA thumbprints on each device against the allowlist and generate a high-severity alert for any thumbprint not on the list.",
              "For any newly detected, non-allowlisted CA certificate, calculate the Shannon entropy of its Subject and Issuer distinguished name (DN) fields and its fleet-wide installation prevalence. A certificate with high entropy in its DN fields (e.g., > 4.0) and low prevalence (e.g., < 1% of devices) strongly indicates a targeted attack and must be escalated for immediate investigation.",
              "Use an Isolation Forest model to detect anomalous CA certificates. Train the model on attributes of known-good certificates, using features like validity period in days, public key size, Subject and Issuer string lengths, count of Subject Alternative Names (SANs), and a self-signed flag. The model will assign an anomaly score to new certificates; scores in the top 1% of anomalies require immediate analyst review."
            ]
          },
          {
            "description": "An installed iOS Configuration Profile is detected with a 'PayloadIdentifier' that is not on the organizational allowlist for the device's assigned user group or management policy.",
            "data_sources": [
              "MDM Asset Inventory: DeviceProfileList",
              "MDM Compliance Log: ProfileInstallEvent"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed iOS device fleet; MDM Management Server; Apple Push Notification service (APNs) infrastructure",
            "action": [
              "For each device management group, create and maintain an allowlist of approved Configuration Profile 'PayloadIdentifier' values. Configure a periodic SIEM query to check MDM device profile inventories. For each device, generate an alert for any installed profile identifier that is not on the approved allowlist for its assigned group.",
              "From MDM logs, extract the installation timestamp for every configuration profile across the fleet. Establish a baseline distribution of installation counts per hour for each day of the week. Use a modified Z-score (>3.5) to identify any installation that occurs at a statistically anomalous time, such as 3 AM on a weekend, and flag the associated profile and device for review.",
              "Implement a time-series anomaly detection model, such as a Seasonal-ARIMA model, on the aggregate count of new profile installations per hour across the entire fleet. A sudden spike in installations flagged as anomalous by the model, which does not correlate with a scheduled IT change request, indicates a potential widespread campaign and must trigger a fleet-wide, high-severity alert."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]