[
  {
    "information_requirement": "Is an adversary leveraging compromised mobile devices to remove or deny access to corporate user accounts? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1640",
        "name": "Account Access Removal",
        "evidence": [
          {
            "description": "A user account experiences a count of lockouts (Windows Event ID 4740) or password reset attempts (Windows Event ID 4724) that exceeds the 99th percentile of the user's individual 30-day baseline, where the source IP address is correlated via Zeek conn.log to an ASN belonging to a mobile network provider, and the device context (e.g., user-agent from Zeek http.log) is inconsistent with the user's established device profile stored in the Mobile Device Management (MDM) platform.",
            "data_sources": [
              "Windows Event ID 4740",
              "Windows Event ID 4724",
              "Zeek conn.log",
              "Zeek http.log",
              "MDM Device Logs",
              "Cloud Identity Provider Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, VPN Concentrators, Internet Gateway, Mobile Device Management (MDM) Platform, Cloud Identity Provider (e.g., Azure AD, Okta)",
            "action": [
              "Create a SIEM rule that correlates Windows Event ID 4724 (password reset attempt) with a subsequent Windows Event ID 4740 (account lockout) for the same 'TargetUserName' from the same 'Source Network Address' within a 60-second window. If a match occurs, enrich the event with the source IP's ASN from Zeek conn.log. Trigger a high-severity alert if the ASN is found on a pre-defined watchlist of mobile network providers. As a final step, query MDM logs to verify the device identity; if the device is not registered or non-compliant for that user, escalate the alert to critical.",
              "For each user, ingest authentication logs (Windows Event IDs 4724, 4740; Cloud Identity Provider logs) and establish a 30-day rolling baseline of hourly event counts. Calculate the 99th percentile for each user's event activity. Generate a medium-severity alert when the current hourly count for a user exceeds their individual percentile. Upon alert, automatically enrich with the source IP's ASN (from Zeek conn.log) and user-agent (from Zeek http.log). Escalate the alert to high if the ASN indicates a mobile carrier and the user-agent is either new for that user or does not match their MDM device profile.",
              "Develop a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) for each user based on authentication event counts (Windows Event IDs 4724, 4740) aggregated in 5-minute intervals. Include features for event count, cyclically encoded time of day/day of week, and a binary 'is_business_hours' flag. An anomaly flagged by the model will trigger an automated workflow that enriches the event with the source IP's ASN and geolocation (from Zeek conn.log) and user-agent (from Zeek http.log). Calculate a final risk score based on the model's anomaly score, a flag for mobile ASN, a flag for rare geolocation, and a flag for a non-MDM-registered device. Escalate events with a risk score above a defined threshold."
            ]
          },
          {
            "description": "A source IP address, associated with a mobile network provider via its ASN in Zeek conn.log, generates a volume of HTTP POST or DELETE requests to critical account management API endpoints (e.g., password reset, account deletion, MFA revocation) that exceeds the 99th percentile of the 30-day request rate baseline for all source IPs accessing that specific endpoint.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "WAF Logs",
              "API Gateway Logs",
              "Cloud Identity Provider Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "API Gateway Servers, Web Application Firewalls (WAFs), Internet-facing application servers, Cloud Identity Provider Logs, Microservice infrastructure hosting account management functions",
            "action": [
              "Create and maintain a watchlist of critical account management API endpoints (e.g., '/api/user/delete', '/auth/reset-password'). Ingest Zeek http.log and API Gateway logs into a SIEM. Trigger a high-severity alert for any HTTP POST or DELETE request to a watched URI where the source IP's ASN (from Zeek conn.log) is on a mobile network provider watchlist. As a secondary condition, parse the 'Authorization' header; if the authentication token (e.g., JWT) lacks a claim indicating recent successful MFA, increase the alert's priority.",
              "For each critical API endpoint, establish a 30-day baseline of request counts per source IP in 5-minute windows and calculate the 99th percentile. Generate a medium-severity alert if a source IP, identified as mobile via its ASN (from Zeek conn.log), has a request rate exceeding this threshold. Concurrently, calculate the Shannon entropy of the requested URI paths per source IP in the same window. Escalate the alert to high severity if a high request rate is coupled with a sudden drop in URI entropy (e.g., score < 1.0), indicating repetitive, programmatic access.",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest, Local Outlier Factor) to identify outlier API access patterns. For each request to a sensitive endpoint, construct a feature vector including: hashed URI path, one-hot encoded HTTP method, request body length, hashed user-agent string, time since last request from the same source IP, and the source IP's ASN (from Zeek conn.log). Train the model on a baseline of known-good traffic. Flag any request identified as an outlier, particularly POST or DELETE requests from an IP associated with a mobile ASN, for immediate analyst investigation, using the model's anomaly score for prioritization."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]