[
  {
    "information_requirement": "Has an adversary performed an Endpoint Denial of Service attack against a mobile device? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1642",
        "name": "Endpoint Denial of Service",
        "evidence": [
          {
            "description": "A connection from a mobile device IP is observed in Zeek conn.log where the destination IP or resolved domain name matches an indicator in a threat intelligence feed specifically categorized as C2 infrastructure for mobile malware with Endpoint DoS capabilities.",
            "data_sources": [
              "Zeek intel.log",
              "Zeek conn.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and Guest Wi-Fi network gateways, VPN concentrators, DNS resolvers, Mobile Device Management (MDM) platform.",
            "action": [
              "Correlate Zeek intel.log with Zeek conn.log. Trigger a high-severity alert when `Intel::MATCH` is found for a `seen.where` of `Conn::IN_ORIG` or `DNS::IN_QUERY` and the source IP address belongs to a managed mobile device. The alert condition must also verify the `meta.source` field of the intelligence item contains tags like 'mobile_malware', 'KeyRaider', or 'T1642'.",
              "For each mobile device, create a 30-day baseline of unique destination Autonomous System Numbers (ASNs) from Zeek conn.log. Alert when a device initiates a connection to an ASN not present in its baseline. Enrich the alert by joining the destination ASN with an ASN reputation service; increase the alert's priority if the reputation is poor or suspicious. Further prioritize by flagging any connection frequency that exceeds the 99th percentile for the device's peer group (e.g., all corporate iOS 18 devices).",
              "Utilize a pre-trained Logistic Regression model to calculate a real-time risk score for each connection in Zeek conn.log originating from a mobile device. Features for the model should include connection duration, protocol, service, `orig_bytes`, `resp_bytes`, and enrichments such as destination IP reputation, ASN geolocation, and historical rarity of the destination for the device. A sustained score above a 0.9 threshold should trigger an automated SOAR playbook to query the MDM via API for the device's owner, compliance status, and recent activity log."
            ]
          },
          {
            "description": "A mobile device's IP address generates a sequence of DNS queries for domains with high Shannon entropy (>3.5) or domains registered within the last 72 hours, immediately followed by a complete cessation of all network traffic from that IP in Zeek conn.log for a duration exceeding the 95th percentile of its typical offline periods.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, network traffic monitoring points at internet gateways.",
            "action": [
              "Create a SIEM rule that triggers if a DNS query in Zeek dns.log from a mobile IP is for a domain whose WHOIS registration date is less than 3 days old. The rule's second condition is that no subsequent traffic is seen from that source IP in Zeek conn.log for a period of 15 minutes, which could indicate the device has been locked or disabled.",
              "In a streaming analytics platform, calculate the Shannon entropy for every `qname` in Zeek dns.log. For each mobile source IP, maintain a 5-minute rolling count of queries with an entropy score > 3.5. If the count exceeds 5 queries, flag the IP. As a second step, query Zeek conn.log to determine the time since the last connection from that IP. If the last connection time is greater than the 95th percentile of that device's historical 'time between sessions', generate a 'Potential DoS Precursor' alert.",
              "Deploy a time-series anomaly detection model (e.g., an LSTM autoencoder) trained on per-minute network traffic metrics (e.g., connection count, total bytes) for each mobile device from Zeek conn.log. Generate an alert when the model's reconstruction error for the current time window exceeds a dynamically set threshold, indicating a significant deviation from normal patterns, specifically a sudden drop to zero activity. Elevate the alert's priority if this anomaly was preceded within the last 30 minutes by high-entropy DNS queries from the same IP."
            ]
          },
          {
            "description": "A mobile device's IP address is observed in Zeek logs connecting to a domain or IP on a threat intelligence list of known rooting/jailbreaking sites, or the device's HTTP User-Agent string in Zeek http.log is statistically rare (<1% prevalence) compared to the population of managed mobile devices.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek intel.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, web proxies, Mobile Device Management (MDM) platform.",
            "action": [
              "Ingest and tag a threat intelligence feed of domains/IPs associated with mobile device rooting and jailbreaking tools into the Zeek Intel Framework. Configure a SIEM rule to generate a critical alert upon a match in Zeek intel.log originating from an IP within the corporate mobile device DHCP range. The alert should automatically query the MDM to check the compliance status of the device.",
              "On a daily basis, execute a query to aggregate and count all unique `user_agent` strings from Zeek http.log across the mobile device fleet. Calculate the frequency percentage for each string. Generate a 'Rare User-Agent' alert for any device reporting a user agent string with a frequency below 1%, as this can indicate non-standard browsers, custom applications, or malicious software impersonation.",
              "Apply an unsupervised clustering algorithm (e.g., K-Means or DBSCAN) to 24-hour network profiles for each mobile device. Engineer features from Zeek logs, including: count of unique destination ports, ratio of outbound to inbound connections, average connection duration, total data transfer volume, and count of distinct DNS servers queried. Devices that are assigned to very small clusters or identified as outliers (noise in DBSCAN) are considered anomalous. Automatically cross-reference these anomalous devices with MDM compliance data to check for a jailbroken/rooted status."
            ]
          },
          {
            "description": "An event is logged by the Mobile Device Management (MDM) platform indicating that an application has been granted Device Administrator privileges on an Android device, or a new configuration profile has been installed on an iOS device, and the application's package name or profile's signing certificate is not on a pre-defined enterprise allowlist.",
            "data_sources": [
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform, Enterprise Mobility Management (EMM) server logs, SIEM.",
            "action": [
              "Forward all MDM audit logs to the SIEM. Create a high-priority rule that triggers for any 'Device Administrator Granted' event (Android) or 'Profile Installed' event (iOS) where the application package name or profile signing certificate does not match an entry in an enterprise-managed allowlist. The alert should include the device owner and a link to the MDM console.",
              "From MDM logs, establish a 90-day baseline of the rate of new application installations and profile modifications for each device. Trigger an alert if the daily rate of these events for a single device exceeds its personal 99th percentile. This identifies an abnormal velocity of configuration changes which may be automated and malicious.",
              "Develop a Decision Tree or Random Forest classification model to assign a risk score to every newly installed application reported by the MDM. Train the model on historical data, labeling apps based on source, permissions, and known-good/known-bad status. Features should include: number and type of permissions requested (e.g., Device Administrator, Accessibility Services), application source (e.g., Google Play Store, Apple App Store, Sideloaded), prevalence across the device fleet, and application age. An application receiving a 'high risk' classification should trigger an automated workflow to quarantine the device and notify the security team."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]