[
  {
    "information_requirement": "Is an adversary using out-of-band channels for command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1644",
        "name": "Out of Band Data",
        "evidence": [
          {
            "description": "An Android application, not on a pre-defined 'Notification Access' whitelist, is granted the permission and, within 24 hours, initiates network connections to domains matching threat intelligence lists, domains registered within the last 30 days, or generates DNS queries with a Shannon entropy score greater than 3.5.",
            "data_sources": [
              "MDM application inventory logs",
              "Android OS security logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed and BYOD Android devices, Mobile Device Management (MDM) servers, Network egress points, DNS resolvers, VPN concentrators",
            "action": [
              "From MDM logs, identify any Android application granted 'Notification Access' permission. Cross-reference the application's package name with an internal whitelist and a threat intelligence feed of known malicious applications. Generate an alert if a non-whitelisted application is granted this permission and is also found on the threat feed.",
              "For any non-whitelisted application granted 'Notification Access', analyze its subsequent DNS requests from Zeek dns.log. Calculate the Shannon entropy of the query names. Generate an alert if the entropy score for domains queried by this app exceeds a threshold of 3.5. Additionally, monitor the volume of outbound data (orig_bytes) from the device in Zeek conn.log after the permission grant; alert if the volume for that application exceeds the 95th percentile of its established 30-day baseline.",
              "Train a time-series forecasting model (e.g., ARIMA) on historical network connection counts per hour for high-risk user devices, using Zeek conn.log. After a 'Notification Access' grant event for a non-whitelisted app, monitor the device's connection count. Generate a high-priority alert if the observed connection count significantly deviates from the forecasted values by falling outside the 99% confidence interval."
            ]
          },
          {
            "description": "An inbound SMS/MMS message, logged by an MDM agent on a managed device, contains a URL with a domain matching a threat intelligence feed or a newly registered domain list (less than 30 days old), or the message body exhibits a character-level Shannon entropy score more than 2 standard deviations above the organizational baseline for benign messages.",
            "data_sources": [
              "MDM security event logs",
              "Carrier SMS/MMS detail records",
              "Threat Intelligence Feeds",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Telecommunication provider gateways for corporate mobile accounts, Corporate mobile devices, SIEM/Log aggregator, Threat Intelligence Platform",
            "action": [
              "Continuously ingest and parse inbound SMS/MMS message logs from the MDM platform. Extract all URLs from message bodies. Compare the domains against a threat intelligence feed of malicious domains and a dynamic list of newly registered domains. Trigger an alert for any match and automatically correlate with subsequent outbound network connections (Zeek conn.log, http.log) from the recipient's device to the flagged URL within a 5-minute window.",
              "For every incoming SMS/MMS message, calculate the character-level Shannon entropy of the message body. Maintain a rolling 30-day baseline (mean and standard deviation) of entropy scores for all benign messages across the organization. Generate a medium-priority alert if a message's entropy score exceeds the mean by more than 2 standard deviations. Correlate high-entropy alerts with sender reputation scores derived from message volume and frequency.",
              "Deploy a pre-trained text classification model (e.g., a Gradient Boosting classifier) to score all incoming SMS messages for malicious intent. Engineer features for the model including message length, URL presence, sender frequency, special character ratio, and the calculated entropy score. Generate a high-confidence alert for any message the model classifies as malicious with a probability score greater than 0.90."
            ]
          },
          {
            "description": "A corporate mobile device, while located within a pre-defined sensitive geofenced area, initiates a Bluetooth or NFC pairing with a device whose MAC address is not on an approved peripheral whitelist, and this event is followed by a data transfer volume, captured in MDM logs, that exceeds the 99th percentile of the user's historical baseline for Bluetooth/NFC transfers.",
            "data_sources": [
              "MDM security logs",
              "Mobile OS Bluetooth/NFC logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physically controlled spaces (e.g., executive suites, R&D labs), Corporate-managed mobile devices with Bluetooth/NFC enabled",
            "action": [
              "In the MDM platform, define sensitive geofenced areas and maintain a whitelist of approved Bluetooth/NFC peripheral device MAC addresses. Create a real-time rule to generate an immediate, high-priority alert whenever an MDM log indicates a new device pairing to a non-whitelisted MAC address occurs within a defined geofence.",
              "Using MDM logs, establish a 30-day rolling baseline for each user's Bluetooth/NFC data transfer volume. For any pairing event with a non-whitelisted device, monitor the subsequent data transfer size. Generate a medium-priority alert if a single transfer's volume exceeds the 99th percentile of that user's historical baseline, indicating an unusually large data movement.",
              "Collect and aggregate Bluetooth pairing events from MDM logs, including user ID, device location (geofence), paired device MAC, and timestamp. Use a density-based clustering algorithm (e.g., DBSCAN) to identify anomalous pairing patterns. Features should include pairing frequency per user, number of unique devices paired in a short time frame, and location of pairings. Outliers identified by the model, such as a user pairing with an unusually high number of new devices in a sensitive area, should generate an alert for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]