[
  {
    "information_requirement": "Is an adversary using masqueraded applications or files on mobile devices to evade defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A mobile application, identified by its HTTP User-Agent, generates outbound network traffic where the destination matches a known C2 server from a threat intelligence feed; the requested domain name has a Shannon entropy score greater than 3.5; or the data volume and destination port deviate by more than three standard deviations from an established baseline for that specific mobile device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Network Egress Points, VPN Concentrators, DNS Resolvers, Mobile Device Management (MDM) Platforms",
            "action": [
              "Query Zeek dns.log and conn.log for connections from mobile device IP ranges to destination domains or IPs on a C2 threat intelligence feed. Join with http.log using the connection UID to retrieve the User-Agent and alert on matches.",
              "For each mobile device (identified by IP or MDM-provided hostname), establish a baseline of network behavior including the 95th percentile of outbound data volume (orig_bytes in conn.log) and the set of common destination ports. Calculate the Shannon entropy for all DNS queries in dns.log. Alert when a device exceeds its data volume baseline, uses a port outside its common set, or makes a DNS query with an entropy score over 3.5.",
              "Train a time-series forecasting model on total outbound data volume per mobile device to detect anomalous spikes. Concurrently, apply an unsupervised clustering algorithm (e.g., DBSCAN) to network connection features (duration, protocol, service, orig_bytes, resp_bytes, dest_port) from conn.log to identify connections that are statistical outliers, which may indicate masquerading."
            ]
          },
          {
            "description": "A file is transferred to a mobile device where the filename extension (e.g., .pdf, .jpg) is inconsistent with the true file type identified by Zeek's file analysis, which reports a mobile application package mime_type ('application/vnd.android.package-archive' or 'application/x-itunes-ipa').",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organizational Internet Gateway, Web Proxies, Email Gateways, Mobile Device Management (MDM) Platforms",
            "action": [
              "Create a SIEM rule to alert when a Zeek files.log event shows a mime_type of 'application/vnd.android.package-archive' or 'application/x-itunes-ipa' but the filename does not end in .apk or .ipa. Correlate with http.log via the connection UID to confirm the User-Agent is a mobile OS.",
              "For each user, track a rolling 7-day count of file downloads with mismatched filename/MIME types. Calculate the 99th percentile for this count across all users to establish an organizational baseline. Alert when any user's count exceeds this threshold.",
              "Develop a supervised classification model (e.g., Random Forest) using features from files.log and http.log (mime_type, filename extension, file size, source IP reputation, ASN, Referer header) to predict a 'masquerade_risk_score'. Automatically generate alerts for file transfers with a predicted score above a defined threshold (e.g., 0.8)."
            ]
          },
          {
            "description": "A high rate of failed authentication attempts (Windows Event ID 4625) for single or multiple accounts originates from a single IP address within the mobile device VPN address range, followed by a successful authentication (Windows Event ID 4624) from the same IP, indicating a successful brute-force or password spray attack from a compromised mobile device.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Domain Controllers, Active Directory, Internal File Servers",
            "action": [
              "Create a correlation rule that triggers when a single source IP from the mobile VPN pool generates over 10 failed logons (Windows Event ID 4625) within 5 minutes. Differentiate alerts between 'Potential Brute-Force' (same target user) and 'Potential Password Spray' (different target users).",
              "Establish an hourly baseline of failed logon counts (Event ID 4625) from the mobile VPN IP range. Use a moving average to monitor this metric and generate an alert when the current failure rate exceeds three standard deviations above the historical average for that time window.",
              "Deploy a UEBA model on authentication logs (Event IDs 4624 and 4625) to profile normal user behavior, including login times and systems accessed. Generate a high-risk anomaly alert when a user on the mobile VPN deviates significantly, such as generating numerous logon failures at an unusual time, followed by a successful login to a system they have never accessed before."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]