[
  {
    "information_requirement": "Is an adversary exploiting client application vulnerabilities to achieve code execution on managed mobile devices? (TA0041 - Execution)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1658",
        "name": "Exploitation for Client Execution",
        "evidence": [
          {
            "description": "A mobile application process, such as a web browser (e.g., 'com.apple.mobilesafari') or email client (e.g., 'com.google.android.gm'), spawns an anomalous child process (e.g., '/bin/sh', 'curl', 'wget') or initiates a network connection to a destination that is a known malicious domain, a newly registered domain (NRD), or has a high-entropy DNS query name.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile EDR/MDM process logs",
              "Mobile OS crash logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, Cloud-based mobile security gateways, Mobile Device Management (MDM) servers, Endpoint mobile devices",
            "action": [
              "Search Zeek dns.log for requests from mobile IP ranges. Join the query results against threat intelligence feeds for known malicious domains and a dynamically generated list of domains registered in the last 30 days. If a match is found, correlate the source IP and timestamp with Zeek conn.log to confirm a connection was established, and generate an alert.",
              "From MDM/EDR process logs, establish a 30-day baseline of all parent-child process relationships across the mobile fleet and calculate the frequency of each unique pair. Alert on the execution of any process pair that falls within the bottom 1% of observed frequencies. Concurrently, for each device, calculate the 95th percentile of hourly outbound bytes from its 30-day Zeek conn.log history; alert if a device's outbound traffic exceeds this threshold.",
              "Deploy a pre-trained classification model (e.g., Random Forest) to score DNS requests and their subsequent network connections in real-time. Use features including DNS query length, subdomain count, query entropy, destination port, connection duration, and bytes transferred. Generate a high-severity alert for any connection classified as 'malicious' with a model confidence score above 0.9."
            ]
          },
          {
            "description": "A mobile device reports a number of application or OS-level crashes (e.g., WebKit, SpringBoard) that is statistically anomalous compared to its peer group (same device model and OS version). This crash anomaly is temporally correlated within a 60-minute window of a non-sanctioned event, such as the installation of an application not present in the corporate app store or a configuration profile not deployed via MDM.",
            "data_sources": [
              "Mobile OS crash logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Mobile Device Management (MDM) configuration profile logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) servers, Endpoint mobile devices, Corporate Wi-Fi network gateways",
            "action": [
              "Continuously monitor MDM application and configuration profile logs against an allow-list of approved application bundle IDs and profile identifiers. Generate an immediate alert for any application or profile installed on a device that is not on the allow-list. Enrich the alert by automatically querying for any crash logs on that device within the past 60 minutes.",
              "For each device cohort (grouped by device model and OS version), calculate a 30-day rolling baseline mean and standard deviation for the hourly crash rate using MDM crash logs. Alert if any device's hourly crash count exceeds three standard deviations above its cohort's mean. Escalate the alert if, within 15 minutes of the crash, the device's network traffic in Zeek conn.log shows a connection to a raw IP address or an outbound-to-inbound byte ratio that exceeds the 98th percentile of its historical behavior.",
              "Implement a time-series anomaly detection model (e.g., LSTM) to monitor the fleet-wide rate of specific, critical crash types (e.g., 'WebKit Process Crash'). An anomalous spike across devices indicates a potential exploit campaign. In parallel, use an unsupervised clustering algorithm (e.g., DBSCAN) on MDM application inventory data, using features like permissions and signing certificates, to identify outlier applications indicative of sideloading."
            ]
          },
          {
            "description": "Peer-to-peer (P2P) traffic, specifically identified as Apple Wireless Direct Link (AWDL) via IPv6 link-local addressing (fe80::/10) and specific multicast groups, is detected between mobile devices on a corporate wireless segment where such traffic is not expected. This activity is followed within 5 minutes by a system crash, the execution of an unauthorized process, or a connection to an external command and control server.",
            "data_sources": [
              "Zeek conn.log",
              "Mobile OS crash logs",
              "Mobile EDR/MDM process logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, Endpoint mobile devices",
            "action": [
              "Create a detection rule to monitor Zeek conn.log for any traffic on corporate wireless segments matching Apple Wireless Direct Link (AWDL) signatures, specifically traffic using IPv6 link-local addresses (fe80::/10). Since this is typically disabled by policy, any detected AWDL session should generate an alert. Correlate with MDM logs to confirm no legitimate, user-initiated AirDrop activity was recorded.",
              "For environments where limited peer-to-peer traffic is allowed, establish a per-device 30-day baseline for P2P traffic volume (bytes) and connection counts per hour. Generate an alert if a device's hourly P2P traffic exceeds the 99th percentile of its historical behavior. Escalate the alert priority if this anomaly occurs within 5 minutes of a system crash event or an anomalous process execution on the same device.",
              "Apply an unsupervised anomaly detection model, such as an Isolation Forest, to intra-WLAN connection data from Zeek conn.log. Use features like source/destination ports, protocol, connection duration, and total bytes transferred to model normal device-to-device communication. Flag connections with high anomaly scores, particularly those involving non-standard ports, as potential zero-click exploit attempts over a P2P link."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]