[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to mobile devices via phishing? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1660",
        "name": "Phishing",
        "evidence": [
          {
            "description": "Evidence of potential smishing or mobile phishing is observed when a network connection from a mobile device, identified via its User-Agent in Zeek http.log, is made to a domain exhibiting multiple high-risk characteristics. These characteristics include a domain registration age of less than 30 days, a character entropy score above 3.5, and a Top-Level Domain (TLD) that is statistically rare within the organization's traffic (e.g., .xyz, .top).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, network egress points, and authentication servers (Active Directory).",
            "action": [
              "Monitor Zeek dns.log for requests to domains present on a phishing threat intelligence feed. Upon a match from a mobile device IP range (identified in Zeek conn.log), generate a high-severity alert.",
              "For each DNS query from a mobile device IP range, calculate a risk score. Increment the score for each of the following conditions: (1) domain Shannon entropy is above the 98th percentile of the 30-day baseline, (2) domain age is less than 30 days (via WHOIS), (3) TLD is in the top 1% of rarest TLDs seen in the last 30 days. Trigger an alert if the score is 2 or greater. Correlate with Zeek http.log to confirm the User-Agent is a mobile browser.",
              "Apply a pre-trained logistic regression model to classify DNS requests from mobile devices as benign or malicious. Features for the model should include domain length, Shannon entropy, n-gram frequency, TLD rarity, and number of dictionary words. Generate an alert for analyst review when the model's output probability for a malicious classification exceeds a threshold of 0.9."
            ]
          },
          {
            "description": "Evidence of potential QR code phishing ('quishing') is observed when a mobile device makes a DNS request for a domain not seen in the last 30 days across the enterprise, immediately followed by an HTTP/S connection to that domain. Further evidence includes a high entropy score (>3.5) for the domain name and a TLS certificate (from Zeek ssl.log) whose subject does not match any known corporate service.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring corporate and guest Wi-Fi networks, and VPN concentrators logging traffic from remote mobile devices.",
            "action": [
              "Continuously scan Zeek ssl.log for TLS certificates from mobile device connections that have SHA1/SHA256 fingerprints matching a threat intelligence feed of malicious certificates. Also, alert on certificates containing suspicious issuer strings (e.g., 'PhishCert') or are self-signed for external domains.",
              "Maintain a 30-day baseline of all domains requested enterprise-wide. For each DNS query from a mobile device, if the domain is not in the baseline ('globally rare') and has been requested by only one user in the past hour ('locally rare'), flag it for analysis. Calculate the Jaccard similarity between the user's set of visited domains in the current session and their historical 30-day profile. A similarity score below 0.2 for a session involving a globally rare domain indicates a high-risk anomaly.",
              "For each user, train a one-class SVM model on their typical network activity profile using features from Zeek logs (e.g., set of requested domains, protocols used, data transfer volumes, connection durations). Flag any new connection from the user's mobile device that the model classifies as an outlier for investigation, as it may indicate a 'quishing' redirect."
            ]
          },
          {
            "description": "Evidence of a credential phishing attack is observed when a mobile device resolves a URL shortener domain, connects to the resolved IP, and the connection's TLS certificate (from Zeek ssl.log) has a short validity period (<90 days) from a free Certificate Authority. This sequence is followed within 5 minutes by a successful authentication event (Windows Event ID 4624) from the same source IP, indicating a likely credential compromise.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, Active Directory Domain Controllers, and cloud identity provider infrastructure.",
            "action": [
              "Maintain a list of URL shortener domains. When a DNS request from a mobile device is made to one of these domains, track the final resolved IP address from Zeek dns.log. Query this IP against a threat intelligence feed of known phishing infrastructure. Generate a high-severity alert on a match.",
              "From Zeek ssl.log for mobile device traffic, alert on connections where the TLS certificate meets multiple risk criteria: (1) validity period is in the bottom 5th percentile (< 90 days), (2) the issuer is a free Certificate Authority (e.g., Let's Encrypt), AND (3) the server_name field contains a typosquatted version of an internal or partner domain. Correlate alerts with successful authentications (Windows Event ID 4624) from the same source IP within 5 minutes.",
              "Train a Random Forest classifier to identify high-risk network connections from mobile devices. Use features from Zeek logs, such as certificate validity length, issuer type (ssl.log), domain entropy, TLD rarity (dns.log), connection duration, and bytes transferred (conn.log). When the model flags a connection with high probability (>0.9), automatically correlate the source IP with successful authentication logs (Windows Event ID 4624) within a 5-minute window to escalate as a potential credential compromise."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]