[
  {
    "information_requirement": "Is an adversary using virtualization or application cloning on managed mobile devices to evade defenses or conceal malicious activity? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1670",
        "name": "Virtualization Solution",
        "evidence": [
          {
            "description": "An application inventory log from a Mobile Device Management (MDM) platform shows an installed application with a package name matching a known virtualization or cloning framework (e.g., 'io.va.exposed', 'com.lbe.parallel.intl', 'com.dual.space.pro') that is not on the corporate-approved application allowlist.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Android Logcat",
              "Threat Intelligence Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile device fleet, Mobile Device Management (MDM) servers, SIEM, Threat Intelligence Platform (TIP)",
            "action": [
              "Create and maintain a watchlist of package names associated with known Android virtualization tools, sourced from threat intelligence. Configure a detection rule to continuously compare this watchlist against the 'package_name' field in MDM application inventory logs. Trigger a high-severity alert for any match found on a device where the application is not on the corporate allowlist.",
              "From MDM inventory logs, calculate the fleet-wide installation percentage for every application package. Establish a rarity threshold (e.g., installed on < 1% of devices). Generate a medium-severity alert for any non-allowlisted application that falls below this threshold, flagging it for investigation as a potentially unauthorized or targeted tool.",
              "Train a supervised classification model (e.g., Gradient Boosting, Random Forest) to identify virtualization apps. Use features from application manifests, including the quantity and type of permissions requested (e.g., 'SYSTEM_ALERT_WINDOW', 'GET_TASKS'), string entropy of the package name, and the presence of keywords like 'virtual,' 'clone,' or 'parallel' in application metadata. An application not on the allowlist that receives a classification probability score > 0.85 triggers a medium-severity alert for manual review."
            ]
          },
          {
            "description": "Network logs (Zeek) show traffic patterns from a mobile device's IP address that are statistically inconsistent with the expected behavior of the legitimate application reported by MDM to be in the foreground at that time. This may indicate a background or virtualized process is generating the traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "MDM Application Usage Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi and VPN gateways, Enterprise DNS resolvers, MDM servers, SIEM",
            "action": [
              "Correlate network connection logs (Zeek conn.log) with a threat intelligence feed of known C2 IP addresses and domains. If a match is found from a mobile device's IP, query MDM logs for the same timestamp to identify the foreground application. If the foreground app is a trusted application (e.g., 'com.microsoft.outlook'), generate a high-severity alert for potential activity hijacking by a virtualized malicious app.",
              "For each unique device-application pair, build a historical baseline from Zeek logs (conn.log, dns.log) by calculating the mean and standard deviation of 'orig_bytes', 'resp_bytes', connection counts, and DNS query entropy per 15-minute interval. The Shannon entropy is given by $$ H(X) = -\\sum_{i=1}^{n} p(x_i) \\log_2 p(x_i) $$. Trigger a medium-severity alert when the foreground application is active and two or more of its associated network metrics exceed 3 standard deviations from their established baseline.",
              "For each mobile device, train a time-series anomaly detection model (e.g., LSTM autoencoder) on feature vectors aggregated from Zeek logs in 5-minute windows. Features should include total bytes transferred, count of unique destination IPs, protocol mix (TCP/UDP ratio), and average connection duration. A high reconstruction error from the model indicates a significant deviation from learned normal network behavior. Correlate the anomaly's timestamp with MDM application usage logs; if a trusted app was in the foreground, escalate with a medium-severity alert."
            ]
          },
          {
            "description": "A network connection recorded in Zeek logs (conn.log, dns.log, ssl.log) from a managed mobile device contains an indicator (IP, domain, JA3/JA3S hash) that is present on a threat intelligence feed specifically tracking malware that leverages virtualization.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Threat Intelligence Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, Web proxies, DNS resolvers, Threat Intelligence Platform (TIP), SIEM",
            "action": [
              "Ingest a high-fidelity threat intelligence feed of IOCs (domains, IPs, JA3/JA3S hashes) specifically attributed to malware known to use virtualization. Create a real-time detection rule to match against all outbound mobile device traffic captured in Zeek logs (conn.log, dns.log, ssl.log). Any match generates a high-severity alert.",
              "From Zeek dns.log, calculate the fleet-wide request frequency for all domains queried by mobile devices. For any DNS query to a domain in the bottom 1st percentile (rare domain), enrich the event by performing a real-time lookup against an external reputation service (e.g., VirusTotal). Generate a medium-severity alert if a mobile device connects to a rare domain that also has a malicious or suspicious reputation score.",
              "Apply a pre-trained Domain Generation Algorithm (DGA) detection model to score all domains requested by mobile devices in Zeek dns.log. The model should analyze features like domain name entropy, character n-gram frequencies, and name length. A domain receiving a high DGA probability score (>0.90), especially if it is also newly observed across the fleet, triggers a medium-severity alert for potential C2 communication."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]