[
  {
    "information_requirement": "Is an adversary attempting to impair our process control by manipulating I/O points? (PIR)",
    "tactic_id": "TA0106",
    "tactic_name": "Impair Process Control",
    "indicators": [
      {
        "technique_id": "T0806",
        "name": "Brute Force I-O",
        "evidence": [
          {
            "description": "A high-frequency burst of ICS write commands (e.g., Modbus 'Write Single Coil/Register', DNP3 'WRITE' function) originating from a single source IP (Zeek conn.log:id.orig_h) to a single I/O point on a PLC (Zeek conn.log:id.resp_h). The event is considered evidential if: 1) The command frequency within a 1-minute window exceeds the 99th percentile and 3 standard deviations of the 30-day baseline for that specific source-destination-I/O point tuple. 2) The source IP is not found in the authorized asset inventory. 3) If the source IP is an authorized asset (e.g., HMI), no corresponding legitimate control application process (Windows Event ID 4688:NewProcessName) was launched on that asset within a 5-minute window of the write burst.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Asset inventory/allow-list database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Programmable Logic Controllers (PLCs), OT network traffic monitoring points (e.g., SPAN ports on OT switches), and Data Historians.",
            "action": [
              "Symbolic Logic: Create a detection rule that triggers on a high-frequency write event (identified by the Statistical method). First, check if the source IP (Zeek conn.log:id.orig_h) is present in the asset inventory of authorized PLC communication sources. If the IP is not present, escalate as a high-confidence 'Unauthorized Write Attempt' alert. If the source IP is authorized, execute a secondary query against endpoint logs (Windows Event ID 4688) for the source machine to find any new processes created within a 5-minute window of the event. Escalate if the command line of the new process does not match a pre-defined allow-list of known SCADA/HMI application executables (e.g., 'FactoryTalk.exe', 'WinCC.exe').",
              "Statistical Method: For each unique tuple of (source IP, destination PLC IP, I/O address), create 1-minute time buckets and count the number of write commands. Using a 30-day rolling window of historical data, calculate the 99th percentile and the mean/standard deviation for these counts. Generate an alert if a new 1-minute count for a specific tuple exceeds both its 99th percentile value and its mean + 3 standard deviations (Upper Control Limit). This dual-thresholding approach minimizes false positives from legitimate but infrequent operations.",
              "Machine Learning: For critical I/O points, deploy a time-series anomaly detection model (e.g., LSTM Autoencoder). Train the model on at least 90 days of historical data, using features such as write count per minute, time of day, day of week, and the specific function code used. The model learns the normal operational rhythm. In production, feed live data into the model and generate an alert when the reconstruction error (the difference between the model's prediction and the actual data) surpasses a pre-determined threshold, indicating a pattern inconsistent with normal operations."
            ]
          },
          {
            "description": "A single source IP (Zeek conn.log:id.orig_h) initiates a sequence of ICS write commands to a PLC (Zeek conn.log:id.resp_h) indicative of scanning behavior. This is evidenced by one of the following in a 30-second window: a) I/O addresses (e.g., Zeek modbus.log:addr) are targeted in a sequential arithmetic progression of 5 or more; b) The ratio of invalid to total targeted I/O addresses exceeds 75%, where validity is determined by a PLC configuration map; or c) The Shannon entropy of targeted I/O addresses increases by more than 2 standard deviations from its established 30-day baseline.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Zeek conn.log",
              "PLC configuration files or asset inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Programmable Logic Controllers (PLCs), ICS protocol gateways, centralized PLC configuration management databases, and network security monitoring sensors.",
            "action": [
              "Symbolic Logic: In a 30-second sliding window, group all I/O addresses (e.g., Zeek modbus.log:addr) targeted by a single source IP. Compare this set against a pre-compiled list of valid, writable I/O points for the destination PLC. Alert if the count of invalid addresses is > 75% of the total. Concurrently, analyze the sequence of valid addresses for arithmetic progressions (e.g., addr[i] = addr[i-1] + C). Alert if a sequence of 5 or more such writes is detected.",
              "Statistical Method: For each source IP to destination PLC communication pair, calculate the Shannon entropy of the I/O address field from write commands within a 5-minute sliding window. Establish a 30-day rolling baseline and standard deviation for this entropy value per pair. Generate an alert if the current entropy value for a pair exceeds its historical baseline by more than 2 standard deviations, as a sharp increase suggests a shift from targeted operational writes to broad, indiscriminate scanning.",
              "Machine Learning: Utilize a density-based clustering algorithm (e.g., DBSCAN) on I/O write events aggregated over 1-minute windows. For each source IP, create a feature vector including: count of unique PLCs targeted, count of unique I/O addresses targeted, and the entropy of I/O addresses. Train the model on historical data to define clusters of 'normal' operational communication. Any data point that the algorithm flags as 'noise' (i.e., does not belong to any cluster) represents a novel and anomalous scanning behavior that should be escalated for analyst investigation."
            ]
          },
          {
            "description": "A specific discrete I/O point (e.g., Zeek modbus.log:addr) on a PLC exhibits rapid, repeated state changes ('toggling') from a single source IP (Zeek conn.log:id.orig_h). The event is considered evidential if: 1) The frequency of value changes (e.g., 0 to 1, 1 to 0) exceeds a pre-defined engineering safe operating limit (e.g., >5 state changes per minute for a large valve). 2) The activity correlates with a successful logon (Windows Event ID 4624) on the source HMI/EWS that is itself anomalous, defined by having two or more anomalous characteristics (e.g., rare source geolocation, off-hours access, first-time user interaction with this I/O point).",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Zeek conn.log",
              "Windows Event ID 4624",
              "User activity baselines",
              "IP geolocation database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Programmable Logic Controllers (PLCs), critical field devices (actuators, valves, breakers), HMIs, Active Directory domain controllers, and Identity and Access Management (IAM) log repositories.",
            "action": [
              "Symbolic Logic: Upon detecting a toggle frequency anomaly (from the Statistical method), check if the source IP (Zeek conn.log:id.orig_h) is on the PLC write allow-list. If not, escalate immediately. If the source is an authorized HMI/EWS, correlate the event timestamp with successful logon events (Windows Event ID 4624) on that host. Escalate if the logon exhibits at least two anomalous traits, such as: 1) the source IP geolocates to a country not seen for that user in 30 days, 2) the logon time is outside the user's baselined 9am-5pm working hours, or 3) the user account has no history of writing to that specific I/O point.",
              "Statistical Method: For critical discrete I/O points, monitor their state from ICS protocol logs and count the number of state changes per minute to calculate a 'toggle frequency'. Generate an alert if this frequency exceeds a static threshold defined by engineering safety limits (e.g., 5 toggles/min) OR if it exceeds the 98th percentile of its 30-day historical baseline. For analog points, calculate the rate of change per minute and alert if it exceeds a similar percentile-based threshold.",
              "Machine Learning: For each critical I/O point, develop a behavioral anomaly detection model (e.g., Isolation Forest). Create feature vectors from Zeek logs that include: the value being written, time since the last write to that point, source IP, and the ICS function code used. Train the model on historical data to learn the normal 'rhythm' of operations. An adversary repeatedly toggling a value will create a sequence of feature vectors that the model will flag with a high anomaly score, distinguishing it from normal operational changes and triggering an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]