[
  {
    "information_requirement": "Is the adversary attempting to inhibit response functions by blocking command messages? (TA0107 - Inhibit Response Function)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0803",
        "name": "Block Command Message",
        "evidence": [
          {
            "description": "A command is logged as initiated by an HMI or SCADA server, but no corresponding network traffic is observed reaching the target PLC/RTU within an expected time window. This may be accompanied by a sustained, anomalous increase in network traffic volume on the control network segment, indicating a resource exhaustion attack is preventing command delivery.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Windows Event ID 4688",
              "HMI Application Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network Zone (between HMIs/SCADA Servers and PLCs/RTUs), HMI/SCADA Server Endpoints",
            "action": [
              "Correlate HMI application logs or Windows Event ID 4688 (Process Creation) events indicating command initiation with network logs. For each command event, execute a time-bound query (e.g., within 10 seconds) against Zeek logs. Generate a high-severity alert if a join on source IP (HMI), destination IP (PLC), and timestamp fails to find either: (a) a corresponding Zeek conn.log entry with a 'S1' or 'RSTO' state and `orig_bytes` > 0 on the expected ICS port (e.g., 502, 44818), or (b) a corresponding entry in a protocol-specific log (e.g., `modbus.log`, `s7comm.log`) showing a valid response from the PLC. The absence of both indicates a potential block.",
              "For each critical network segment (defined by VLAN or subnet), establish a 30-day rolling baseline of key network metrics from Zeek conn.log, including bytes per second, packets per second, and the Shannon entropy of source/destination port pairs. Continuously monitor these metrics and generate a medium-severity alert if any metric exceeds the 99th percentile of its historical baseline for a sustained period (e.g., >60 seconds). Correlate this alert with a symbolic logic alert for command failure to increase confidence.",
              "Deploy a multivariate time-series anomaly detection model (e.g., VAE or LSTM-based autoencoder) on aggregated Zeek conn.log data for critical HMI-to-PLC communication flows. Features should include traffic volume (bytes, packets), connection duration, protocol, and connection state. Train the model on at least 30 days of benign operational data. Trigger a high-confidence alert when the model's reconstruction error for a live traffic window exceeds a dynamically tuned threshold, indicating a significant deviation from learned normal behavior suggestive of a network flood or disruption."
            ]
          },
          {
            "description": "A host-based firewall rule is maliciously added or modified on a critical endpoint (HMI, EWS, SCADA Server) to explicitly block outbound command traffic to a PLC or RTU. This is evidenced by Windows Security events for firewall changes followed by events indicating blocked connections.",
            "data_sources": [
              "Windows Event ID 4945",
              "Windows Event ID 4947",
              "Windows Event ID 4950",
              "Windows Event ID 5157"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Control Servers",
            "action": [
              "Maintain a version-controlled, authoritative whitelist of approved host-based firewall rules for critical HMI/EWS assets. Monitor for Windows Event ID 4947 ('A rule was modified') or 4945 ('A rule was added'). For any such event, parse the rule details. Generate a high-severity alert if a new or modified rule contains 'Action: Block', targets a 'RemoteAddress' within a critical PLC subnet, and specifies a 'RemotePort' used for ICS protocols (e.g., 502, 20000, 44818). Enrich the alert with the 'UserID' from the event and cross-reference against a list of authorized administrators.",
              "For each critical HMI/EWS, establish a 30-day rolling baseline for the hourly count of firewall change events (IDs 4945, 4947, 4950). Calculate the mean and standard deviation. Generate a medium-severity alert if the count of these events in a one-hour window exceeds 3 standard deviations from the mean, indicating an unusual level of configuration activity that warrants investigation.",
              "Train a supervised classification model (e.g., Gradient Boosting or Random Forest) using historical Windows firewall event logs (IDs 4945, 4947) labeled as 'authorized' or 'unauthorized' based on change control records. Features should include categorical representations of RuleName, Action, Direction, Protocol, RemoteAddress (as a subnet category), RemotePort, and the User making the change. Deploy the model to score all new firewall changes in real-time, alerting on any change classified as 'unauthorized' with high confidence. Correlate with subsequent Windows Event ID 5157 ('The Windows Filtering Platform has blocked a connection') events matching the rule's criteria."
            ]
          },
          {
            "description": "An attacker manipulates Address Resolution Protocol (ARP) tables to redirect or drop traffic between an HMI/EWS and a PLC/RTU, blocking command messages. This is evidenced by anomalous ARP traffic, such as a change in the MAC address associated with a critical device's static IP address or a flood of gratuitous ARP packets.",
            "data_sources": [
              "Zeek arp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network Switches, Control Network Gateways, Critical PLC Network Interfaces",
            "action": [
              "Create and maintain a static, authoritative IP-to-MAC address mapping table for all critical ICS devices (PLCs, RTUs, HMIs). Continuously monitor Zeek arp.log. Generate a high-severity alert immediately if an ARP event shows a 'mac' for a critical 'id.orig_h' (IP address) that does not match the authoritative table. Additionally, alert if a gratuitous ARP reply (opcode: 2) for a critical IP originates from an unauthorized IP or MAC address.",
              "For each critical PLC IP address, establish a 7-day rolling baseline of ARP event frequency from Zeek arp.log. Alert if the rate of ARP events for a single IP exceeds 3 standard deviations from the baseline in a 5-minute window. Separately, count the number of unique MAC addresses observed for each critical IP in a 5-minute sliding window and generate a high-severity alert if this count is greater than 1, as static devices should only have one MAC address.",
              "Use an unsupervised anomaly detection model (e.g., Isolation Forest) on Zeek arp.log data. Key features should include the source IP, destination IP, MAC address, ARP opcode, and the time delta since the last ARP for that IP. Train the model on at least 30 days of normal network operation. Alert when a new event or sequence of events receives a high anomaly score, indicating a deviation like ARP flooding or rapid IP-MAC changes. Supplement this by calculating the Shannon entropy of MAC addresses seen per IP over a time window and alerting on sudden drops, which can indicate a successful poisoning where one MAC dominates."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]