[
  {
    "information_requirement": "Is an adversary attempting to destroy critical operational data or system files to inhibit response functions in the ICS environment? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0809",
        "name": "Data Destruction",
        "evidence": [
          {
            "description": "Anomalous process creation on a critical ICS asset, indicated by a Windows Event ID 4688 CommandLine field containing known data destruction utility keywords (e.g., 'sdelete', 'killdisk', 'cipher /w', 'wevtutil cl'), or a command line whose character entropy or length exceeds a statistical baseline for that specific process and host.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers (PCS), Operator Workstations",
            "action": [
              "Create a SIEM rule to generate a high-priority alert for Windows Event ID 4688 events on NAIs where the CommandLine field contains keywords for data destruction tools (e.g., 'sdelete', 'killdisk', 'cipher.exe /w', 'format', 'wevtutil cl', 'fsutil file setzerodata'). Maintain a strict whitelist of approved administrative scripts or processes that may legitimately use these commands to reduce false positives.",
              "For each unique NewProcessName on each host within the NAIs, establish a 30-day rolling baseline for its CommandLine length and Shannon entropy. Generate an alert if a new process execution's command line length or entropy score exceeds 3 standard deviations from the established baseline for that specific process. Also, alert on any process seen for the first time in over 30 days.",
              "Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on a 90-day historical dataset of Windows Event ID 4688 logs from NAIs. Use features such as NewProcessName, ParentProcessName, SubjectUserName, CommandLine length, CommandLine character entropy, hour of day, and day of week. Score new process events in real-time and generate a high-priority alert for events classified as outliers, providing the anomaly score and top contributing features for investigation."
            ]
          },
          {
            "description": "A high volume of file deletion events (Windows Event ID 4663 with 'DELETE' in Accesses field) from a single user or process within a short time frame (e.g., >50 events in 60 seconds), targeting directories with critical ICS project files, configurations, or backups (e.g., C:\\Siemens\\, D:\\HistorianData\\).",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Data Historians, ICS Backup Servers, Engineering Workstations (EWS), Process Control Servers (PCS)",
            "action": [
              "After enabling 'Audit object access' for 'Delete' on critical ICS directories via GPO, create a SIEM correlation rule. The rule triggers when the count of Windows Event ID 4663 with 'DELETE' access from a single SubjectUserName or ProcessName exceeds 50 events in a 60-second window, and the ObjectName path matches a predefined list of critical ICS directories. Exclude authorized backup and maintenance processes.",
              "For each SubjectUserName and ProcessName on NAIs, calculate a 30-day rolling baseline (average and standard deviation) for 'DELETE' event counts per 5-minute interval. Alert if the current 5-minute count for any user or process exceeds 3 standard deviations above its baseline or is above the 99.5th percentile of its historical distribution. Additionally, calculate the entropy of file extensions deleted in the window; a sudden spike in entropy triggers a separate alert.",
              "For each critical NAI, deploy a multivariate time-series anomaly detection model (e.g., LSTM autoencoder) trained on 90 days of 1-minute aggregated counts of 'DELETE' events, segmented by SubjectUserName and ProcessName. The model learns normal deletion patterns and seasonality. Generate a high-priority alert when the actual 'DELETE' count significantly deviates from the model's predicted range (e.g., falls outside the 99.5% prediction interval)."
            ]
          },
          {
            "description": "Deletion of one or more files with a high-value ICS-specific extension (e.g., .ACD, .S7P, .PCV, .ap16, .DSR, .gfx, .PLC) detected via Windows Event ID 4663 ('DELETE' in Accesses field) on a critical ICS asset, especially if performed by a non-standard user or process.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), File servers hosting ICS project files, Data Historians, ICS Backup Servers",
            "action": [
              "Configure a high-priority SIEM alert to trigger immediately on Windows Event ID 4663 where Accesses contains 'DELETE' and the ObjectName field ends with a critical ICS extension (e.g., .ACD, .S7P, .PCV, .ap16, .DSR, .gfx, .HMI, .SCADA, .PLC). Enforce a strict whitelist for authorized SubjectUserName/ProcessName combinations and maintenance windows; any deletion outside this scope is a critical alert.",
              "Establish a 90-day baseline of all deletion activities involving critical ICS file extensions. For each deletion event, calculate a rarity score based on the historical frequency of that specific SubjectUserName deleting that specific file extension. A deletion by a user who has never deleted that file type before receives a high rarity score and generates an alert. Also, alert if a deletion occurs more than 3 standard deviations outside the normal time window for that activity.",
              "Train a supervised classification model (e.g., Random Forest) on labeled historical Windows Event ID 4663 data, distinguishing 'legitimate' from 'malicious' deletions of critical files. Use features like SubjectUserName, ProcessName, file extension, Source Workstation, TimeOfDay, DayOfWeek, and the rarity score from the statistical method. Classify new deletion events in real-time and generate a critical alert for any event classified as 'malicious' with a confidence score > 0.9."
            ]
          },
          {
            "description": "An executable file is transferred into the OT/ICS network, identified via Zeek logs, and exhibits malicious characteristics such as high Shannon entropy (>7.5), a hash matching threat intelligence, or PE header values anomalous compared to a baseline of legitimate ICS software.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network boundary between IT and OT networks (ICS DMZ), Core ICS network segments, SCADA network, Process Control Network (PCN)",
            "action": [
              "Create a SIEM rule that correlates Zeek logs via fuid and uid. Alert on files.log entries where resp_h is in an OT/ICS subnet and mime_type is 'application/x-dosexec'. Check the sha256 hash from files.log against threat intelligence feeds. Correlate with conn.log to alert if the transfer uses a non-standard port. Generate a high-priority alert on any match.",
              "For all executables transferred into the OT network (identified via files.log and pe.log), calculate the Shannon entropy of the file content. Maintain a 60-day rolling baseline of entropy values for legitimate executables from approved vendors. Alert if a new file's entropy exceeds 3 standard deviations from the mean or is above a hard threshold of 7.5. Similarly, baseline key PE header fields from pe.log (e.g., num_sections, num_imports) against a trusted ICS software repository and alert on significant deviations.",
              "Train a supervised binary classification model (e.g., LightGBM) on a labeled dataset of file transfers into the OT network. Engineer features from Zeek logs: file size, mime_type, content entropy (files.log); num_sections, num_imports (pe.log); and service, duration, orig_bytes (conn.log). Enrich with IP reputation for orig_h. Continuously classify new file transfers and alert on any file classified as 'malicious' with a confidence score > 0.9, presenting feature importance to the analyst."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]