[
  {
    "information_requirement": "Is an adversary attempting to disrupt industrial control system (ICS) device functionality via Denial of Service? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0814",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "A sustained, anomalous increase in network traffic volume (bytes or packets per second) or connection rate directed at a critical ICS device (e.g., PLC, RTU, HMI), where traffic metrics exceed the 99th percentile of a 30-day historical baseline for three consecutive 60-second intervals. This traffic surge is correlated with a simultaneous spike in ICS protocol-specific errors, such as Modbus exception codes, EtherNet/IP status errors, or DNP3 errors.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek ether_ip.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments (Purdue Levels 1-3), Control System DMZ, and network interfaces of critical devices (PLCs, RTUs, IEDs, HMIs, EWS, Historians).",
            "action": [
              "Create a correlation rule that alerts when a high volume of connections (e.g., >1000 connections/minute) to a critical ICS device IP on a known ICS port (e.g., 502, 20000, 44818, 102) occurs within the same 1-minute window as a burst of protocol-specific errors (e.g., Modbus exception codes) from the same device in Zeek logs.",
              "For each critical ICS device, calculate a 30-day rolling baseline of 1-minute interval statistics for total bytes, total packets, and new connection counts from Zeek conn.log. Alert if any of these metrics exceed the 99th percentile for three consecutive minutes. Concurrently, calculate the Shannon entropy of source IP addresses (`id.orig_h`); a simultaneous drop in entropy (e.g., below 1.0) with a high traffic alert strongly indicates a targeted flood.",
              "Apply a trained multivariate time-series anomaly detection model (e.g., Variational Autoencoder) to 1-minute aggregated network features for each critical ICS asset, including `total_bytes`, `packet_count`, `connection_count`, `unique_source_ips`, and `protocol_error_rate`. Alert when the model's reconstruction error surpasses a dynamic threshold, indicating a significant deviation from learned normal traffic patterns."
            ]
          },
          {
            "description": "An anomalous rate of connection rejections from a critical ICS device, evidenced by a count of connection states ('REJ', 'RSTO', 'RSTR') in Zeek conn.log exceeding the 99th percentile of a 30-day baseline for at least 60 seconds. The majority (>90%) of these rejected connection attempts originate from a small set of source IPs (fewer than 5).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments (Purdue Levels 1-3), Control System DMZ, and network interfaces of critical devices (PLCs, RTUs, IEDs, HMIs, EWS, Historians).",
            "action": [
              "Create a rule that alerts when, for a single critical ICS device IP (`id.resp_h`), the count of Zeek conn.log entries with `conn_state` IN ['REJ', 'RSTO', 'RSTR', 'RSTRH'] exceeds a static threshold (e.g., 100 events in 60 seconds) and the number of unique source IPs (`id.orig_h`) is less than 5.",
              "For each critical ICS device, establish a 30-day rolling baseline for the 1-minute count of connections with reset/rejection states from Zeek conn.log. Alert if this count exceeds the 99th percentile. Upon alert, automatically calculate the source IP distribution for that interval; escalate the alert if a single source IP accounts for >80% of the total connection attempts to the victim device.",
              "Every 5 minutes, apply an unsupervised clustering algorithm (e.g., DBSCAN) to Zeek conn.log features including `id.resp_h`, `duration`, `orig_bytes`, and `conn_state`. Alert on clusters characterized by a high density of points with a single critical ICS device IP, short duration, zero/low `orig_bytes`, and a rejection `conn_state`, as these represent a DoS attack pattern."
            ]
          },
          {
            "description": "An unexpected crash or service termination on a critical Windows-based ICS host (e.g., HMI, EWS, Historian), evidenced by an Application Error (Windows Event ID 1000), Application Hang (Event ID 1002), or Service Control Manager abnormal termination (Event ID 7031, 7034). The host event is temporally correlated, occurring within a 60-second window following a statistically significant surge in network traffic to the host.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Windows Event ID 7031",
              "Windows Event ID 7034",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments (Purdue Levels 1-3), Control System DMZ, and network interfaces of critical devices (PLCs, RTUs, IEDs, HMIs, EWS, Historians).",
            "action": [
              "Create a correlation rule that alerts when a Windows Event ID (1000, 1002, 7031, or 7034) for a monitored critical process/service is logged, and within the preceding 60 seconds, the host's IP received an anomalous number of connections (e.g., >500) from a single source IP, as seen in Zeek conn.log.",
              "Upon detecting a critical process termination event (Event IDs 1000, 1002, 7031, 7034), automatically query network traffic metrics (connection count, total bytes) from Zeek conn.log for the affected host over the preceding 5 minutes. Compare these metrics to the host's 30-day historical distribution for the same time-of-day and day-of-week. Flag the event as a potential network-induced DoS if recent traffic metrics exceed the 99th percentile of the historical distribution.",
              "Deploy a trained sequence-aware model (e.g., RNN, LSTM) on time-ordered event data, using a sequence of network traffic features (e.g., connection rate, byte rate from Zeek) to predict a binary label indicating if a critical host crash event (e.g., Event ID 1000) occurs in the next minute. Alert when the model predicts a high probability of a crash, indicating that the current traffic pattern is a known precursor to system failure."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]