[
  {
    "information_requirement": "Is an adversary attempting to disrupt operator visibility of the industrial process? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0815",
        "name": "Denial of View",
        "evidence": [
          {
            "description": "Evidence is a sustained and anomalous absence of expected periodic ICS protocol messages (e.g., Modbus, DNP3, EtherNet/IP) from a Level 1 field device (PLC/RTU) to a Level 2 SCADA/HMI server. This absence must persist for a duration exceeding 2.5 times the established normal polling interval for that device pair and occur outside of a documented maintenance window. This may also manifest as a sustained packet volume reduction (e.g., >95% below a statistical baseline) between the same device pair.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 2 (Control System) network segment, specifically traffic between HMI/SCADA servers and Level 1 (Basic Control) PLCs/RTUs.",
            "action": [
              "Implement a SIEM rule that monitors Zeek ICS protocol logs (e.g., modbus.log, enip.log, dnp3.log) for expected keep-alive or data polling messages between defined critical PLC/RTU and HMI/Server pairs. The rule should trigger a high-severity alert if an expected message from a specific source PLC IP is not seen within a time window that is 2.5 times its normal polling interval. Correlate this absence with any related ICS protocol error responses (e.g., Modbus exception code 0x0B 'Gateway Target Device Failed to Respond') from the HMI/Server back to the PLC in the same time frame.",
              "For each critical PLC-to-HMI communication pair, use historical Zeek conn.log data to establish a 14-day rolling baseline of packet and byte counts per 60-second interval. Calculate the 1st percentile for both metrics. Trigger a medium-severity alert if both the current packet and byte counts for a 60-second interval fall below their respective 1st percentile thresholds for three consecutive intervals. Additionally, calculate the inter-arrival time between polling messages and alert if the current jitter exceeds 3 standard deviations from the historical mean, indicating network degradation preceding a full communication loss.",
              "Deploy a time-series anomaly detection model, such as an LSTM autoencoder, trained on historical, per-minute aggregated network telemetry (packet counts, byte counts, protocol mix) from critical PLC/RTU IPs to HMI IPs. The model should learn the normal 'heartbeat' of the ICS network. Feed real-time telemetry into the trained model to generate a reconstruction error or anomaly score. An anomaly score exceeding a dynamically adjusted or predetermined threshold (e.g., >0.95), especially when correlated with a near-zero packet count, signifies a high-confidence Denial of View event."
            ]
          },
          {
            "description": "Evidence is the unexpected termination of a critical HMI application process (e.g., ftview.exe, iFIX.exe) on an operator workstation, confirmed by Windows Event ID 4689 or Sysmon Event ID 5. The termination is considered anomalous if it meets one of the following conditions: the exit code is non-zero (indicating a crash), the parent process (identified via Sysmon Event ID 1 or Windows Event ID 4688) is not on an approved whitelist (e.g., explorer.exe, services.exe), or the action was not performed by an authorized administrative user during a maintenance window.",
            "data_sources": [
              "Windows Event ID 4689",
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon Process Create)",
              "Windows Event ID 5 (Sysmon Process Terminate)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 2 (Control System) HMI Workstations and Engineering Workstations.",
            "action": [
              "Create a detection rule that triggers on Sysmon Event ID 5 (Process Terminated) or Windows Event ID 4689 for a process name on a watchlist of critical HMI applications. The rule logic must then correlate this event with the parent process information from Sysmon Event ID 1 (Process Create). An alert is generated if the parent process is not on a pre-defined whitelist of legitimate launchers (e.g., explorer.exe, a specific HMI management service) OR if the termination event has a non-zero exit code, indicating a crash.",
              "For each critical HMI process, establish a 30-day baseline of hourly termination counts (Sysmon Event ID 5) to calculate a 99th percentile threshold. Trigger an alert if the count in any given hour exceeds this threshold. Separately, profile the distribution of all historical exit codes for each HMI process; flag any termination event that logs an exit code not seen in the last 90 days or one that is statistically rare (e.g., occurring in <0.1% of historical terminations).",
              "Train a classification model (e.g., Random Forest) on historical process termination events from HMI workstations, using features such as process name, parent process name, user context (system, admin, user), time of day, day of week, and the process's command line arguments. Label training data as 'benign' (e.g., clean exit, user-initiated close) or 'malicious' (e.g., crash, terminated by suspicious parent). Use the deployed model to score new termination events in real-time, flagging those with a high 'malicious' probability for analyst review."
            ]
          }
        ]
      },
      {
        "technique_id": "T0814",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "Evidence is a high-volume network flood targeting a critical ICS asset (e.g., HMI, Historian, OPC server), characterized by traffic rates exceeding 10 times the normal baseline (99th percentile) and a high proportion (>90%) of incomplete or rejected TCP connections (e.g., Zeek conn.log states 'S0', 'RSTO', 'REJ'). The traffic originates from source IPs not on an approved whitelist of ICS network segments.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 3 (Manufacturing Operations) and Level 2 (Control System) network boundaries, Data Historian servers, HMI Workstations.",
            "action": [
              "Deploy a rule that monitors Zeek conn.log for traffic destined for critical ICS asset IPs. The rule should trigger a high-severity alert if, within a 60-second window, an external source IP (not on the internal network whitelist) generates over 500 connection attempts AND the ratio of connection states 'S0', 'RSTO', or 'REJ' to total connections from that source exceeds 90%. Correlate with Zeek's notice.log for `Scan::Address_Scan` notices against the same target.",
              "For each critical ICS asset, continuously calculate a 14-day rolling baseline and 99.9th percentile for two metrics: new connections per minute and total bytes per minute. Trigger a high-severity alert if the current rate for both metrics exceeds their respective thresholds for three consecutive minutes. Concurrently, calculate the Shannon entropy of source IP addresses connecting to the asset over 5-minute windows. A sudden drop in entropy below the 5th percentile of its historical baseline, combined with a high connection rate, indicates a low-complexity flood attack.",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest) on real-time network flow data (Zeek conn.log) targeting critical ICS assets. The model should be trained on feature vectors including source/destination IP, destination port, protocol, packet count, byte count, and connection state within 1-minute time windows. The model will learn the normal traffic distribution; any new flow data flagged with a high anomaly score indicates a deviation from normal behavior, such as a DoS attack, and should be alerted for investigation."
            ]
          },
          {
            "description": "Evidence is the unexpected termination of a critical ICS-related Windows service (e.g., OPC server, Historian agent), identified by Windows Event ID 7034 ('Service terminated unexpectedly'). The termination is considered anomalous if the service does not successfully restart (logged as Event ID 7036) within its configured recovery window (e.g., 60 seconds) and the termination is not associated with a planned system shutdown (Event ID 1074).",
            "data_sources": [
              "Windows Event ID 7034",
              "Windows Event ID 7036",
              "Windows Event ID 7024",
              "Windows Event ID 1074",
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon Process Create)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 2 (Control System) HMI Workstations, Engineering Workstations, and SCADA/Historian Servers.",
            "action": [
              "Create a rule that triggers on Windows Event ID 7034 or 7024 for any service name on a critical ICS services watchlist. The rule logic should wait 60 seconds to see if a corresponding Event ID 7036 (service started) for the same service name is logged. If no restart event is seen, and there is no preceding Event ID 1074 (system shutdown) initiated by an authorized administrator within the last 5 minutes, generate a high-severity alert.",
              "For each critical ICS service, use historical data (Event IDs 7034/7024) to calculate its mean time between failures (MTBF). Trigger a medium-severity alert if a service fails and its uptime since the last failure is less than 50% of the historical MTBF, suggesting an abnormal failure rate. Additionally, profile the frequency of error codes from Event ID 7024; an error code that is statistically rare (e.g., has a frequency of <1% in the last 90 days) should be flagged for immediate investigation.",
              "Develop a supervised classification model (e.g., XGBoost) trained on historical Windows event logs surrounding service terminations. Features should include service name, error code (from Event ID 7024), time since last failure, recent administrative logins (Event ID 4624), and recent software installations (Event ID 11707). Label historical events as 'benign' (planned restart) or 'anomalous'. Use the model to predict the likelihood that new service terminations are anomalous, flagging events with a high anomaly score for analyst review."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]