[
  {
    "information_requirement": "Is an adversary using GUI-based remote access for execution on critical ICS hosts? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0823",
        "name": "Graphical User Interface",
        "evidence": [
          {
            "description": "A successful remote interactive logon (Windows Event ID 4624, Logon Type 10) to a critical ICS asset that violates an established policy, such as originating from an IP not on an allow-list, an account not in an authorized remote access group, or occurring outside of defined maintenance windows.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4634",
              "Windows Event ID 4647",
              "Active Directory Security Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Workstations (OWS), ICS Domain Controllers, Jump Servers, Remote Access Gateways",
            "action": [
              "Maintain an inventory of critical ICS assets (HMIs, EWS) with corresponding allow-lists for source IPs, user groups, and operational hours. Query for all successful remote logons (Windows Event ID 4624, Logon Type 10) to these assets. For each logon, join with the inventory data to verify the source IP, user group membership, and timestamp against the established policies. Trigger a high-priority alert for any logon that violates one or more of these defined rules.",
              "For each unique user-and-asset pair, establish a 30-day rolling baseline of successful RDP logons (Windows Event ID 4624, Type 10). Calculate the historical distribution (mean, standard deviation) of logon hour-of-day and session duration by correlating logon 4624 with logoff 4634/4647. For each new logon, calculate a z-score for its hour against the user-asset baseline. Alert if the hour-of-day z-score exceeds 3 or if the session duration exceeds the 95th percentile of the historical distribution for that pair.",
              "For each RDP logon (Windows Event ID 4624, Type 10), create a feature vector including user, target host, source IP, day of week, and logon hour (transformed into cyclical features). Train an unsupervised anomaly detection model, such as an Isolation Forest, on a curated baseline of known-benign logon events. Apply the trained model to score all new logon events in real-time. Generate an alert for any logon that receives an anomaly score above a statistically determined threshold, indicating a significant deviation from established normal access patterns."
            ]
          },
          {
            "description": "Network traffic telemetry (e.g., Zeek conn.log) shows a connection using RDP (TCP/3389) or VNC (TCP/5900-5906) to a critical ICS asset that either originates from an unauthorized source IP or exhibits anomalous characteristics, such as data volume or duration exceeding the 99th percentile of the historical baseline for that connection pair.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek x509.log",
              "Firewall logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, Demilitarized Zone (DMZ) Firewalls, Connections between IT and OT networks, Remote Access Gateways/VPN Concentrators, Perimeter Firewalls (IT/OT boundary)",
            "action": [
              "Maintain an inventory of critical ICS asset IPs and a corresponding allow-list of authorized source IPs for RDP/VNC access. Query Zeek conn.log for connections where the destination port is 3389 or 5900-5906 and the destination IP is a critical ICS asset. For each resulting connection, verify that the source IP (`id.orig_h`) is on the pre-approved allow-list for that specific destination asset. Trigger a high-priority alert for any connection originating from a non-allow-listed IP.",
              "For each authorized source-destination pair, establish a 30-day rolling baseline of RDP/VNC connections from Zeek conn.log and rdp.log. For each pair, calculate the 99th percentile for connection duration and total bytes transferred (`orig_bytes` + `resp_bytes`). Also, calculate the baseline Shannon entropy of the RDP `cookie` field from rdp.log. For each new connection, alert if its duration or byte count exceeds the 99th percentile for that pair, or if the entropy of its RDP cookie deviates by more than 3 standard deviations from the established baseline.",
              "Aggregate Zeek conn.log data into fixed time windows (e.g., 10 minutes) for each critical ICS asset. For each window, engineer features like the count of RDP/VNC connections, total bytes, number of unique source IPs, and average session duration. Train a multivariate time-series anomaly detection model, such as a VAE or LSTM-based autoencoder, on historical data to learn the normal rhythm of remote access traffic to each asset. In real-time, calculate the model's reconstruction error for each new time window and alert when the error exceeds a dynamic threshold, indicating an anomalous traffic pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]