[
  {
    "information_requirement": "Has an adversary caused a sustained loss of control over a critical industrial process? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0827",
        "name": "Loss of Control",
        "evidence": [
          {
            "description": "A Human Machine Interface (HMI) generates application-level communication error events (Windows Event ID 1000) while network logs (Zeek modbus.log) simultaneously show a lack of successful Modbus 'Write' commands (Function Codes 0x05, 0x06, 0x0F, 0x10) from the HMI's IP address to a target PLC, and/or a statistically significant spike in Modbus Exception Responses (e.g., 'Illegal Function', 'Illegal Data Address') from the PLC back to the HMI.",
            "data_sources": [
              "Windows Event ID 1000",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI hosts in the control room, PCN network taps monitoring traffic to critical PLCs (e.g., Boiler Control PLC, Turbine Governor PLC), Engineering Workstation subnets.",
            "action": [
              "Create a rule that triggers when a Windows Event ID 1000 from an HMI host indicates a communication failure (e.g., log message contains 'Modbus communication error' or 'PLC connection lost'). Upon trigger, query Zeek modbus.log for the HMI's source IP over the same 1-minute window. Alert if the query returns zero successful Modbus 'Write' commands (function codes 0x05, 0x06, 0x0F, 0x10).",
              "For each unique HMI-to-PLC communication pair, establish a 30-day baseline of Modbus Exception Response code counts per 5-minute interval and calculate the 99th percentile. Monitor these pairs in real-time and alert if the count within a 5-minute sliding window exceeds this 99th percentile threshold. Correlate this alert with any application communication error alerts from the symbolic logic action for higher fidelity.",
              "For each HMI, engineer a time-series feature set at 5-minute intervals, including: count of communication errors (Event ID 1000), count of Modbus exception responses received, and a binary flag for the absence of successful 'Write' commands. Train an unsupervised anomaly detection model (e.g., Isolation Forest) on at least 30 days of historical data to learn normal operational patterns. Apply the trained model to real-time data streams and alert when the anomaly score exceeds a tuned threshold, indicating a significant deviation from learned normal behavior."
            ]
          },
          {
            "description": "A critical process variable (e.g., boiler pressure, turbine RPM) recorded in the Process Historian deviates beyond its established operational envelope (e.g., > 99th percentile of 30-day values) for a sustained period (e.g., > 5 minutes). This deviation occurs without any corresponding authorized 'Write' commands from a whitelisted HMI or Engineering Workstation IP address to the relevant PLC registers observed in network traffic logs (e.g., Zeek modbus.log, dnp3.log) that would legitimately cause the change.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek conn.log",
              "Process Historian Data",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Historian database servers, Network taps capturing traffic between Level 1 (PLCs/RTUs) and Level 2 (Supervisory Control), specific PLCs controlling critical physical processes.",
            "action": [
              "Maintain a stateful whitelist of authorized HMI/EWS source IPs and the specific PLC registers/DNP3 objects they are permitted to write to. Monitor all 'Write' commands in Zeek modbus.log and dnp3.log. Generate a high-severity alert for any 'Write' command originating from a non-whitelisted IP or targeting a register/object not authorized for that specific source IP.",
              "For each critical process variable (PV) from the Historian, calculate a 30-day rolling baseline to establish the 1st and 99th percentile values. Alert if a PV value remains outside this percentile band for 5 consecutive minutes and a corresponding, authorized 'Write' command is not found in network logs for the same time window. Separately, calculate the Shannon entropy of Modbus register addresses (or DNP3 object variations) written to per source IP over 1-hour windows. Alert if entropy drops below the 5th percentile of its historical baseline, as this may indicate repetitive, unauthorized commands intended to create a runaway condition.",
              "Develop a multi-variate time-series forecasting model (e.g., Vector Autoregression - VAR) that learns the normal dynamic relationships between related process variables (e.g., temperature, pressure, flow) and legitimate control commands ('Write' actions). Continuously feed real-time PV data and control commands into the model to generate a forecast with a 95% prediction interval for each PV. Generate an alert if an actual PV value consistently falls outside its predicted interval for more than 3 minutes, indicating the physical process is behaving in a way not explained by legitimate control inputs."
            ]
          },
          {
            "description": "A Safety Instrumented System (SIS) initiates a trip or emergency shutdown, confirmed via SIS system logs. However, this trip is not preceded by a valid cause, such as a critical process variable in the Process Historian exceeding its defined safety limit or an authorized manual trip command issued from a whitelisted SIS workstation.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log",
              "SIS System Logs",
              "Process Historian Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIS Logic Solver hardware, SIS Engineering Workstations, Network segments dedicated to the Safety Instrumented Network (SIN), Firewalls or Data Diodes separating the SIN from the PCN.",
            "action": [
              "Create an automated rule triggered by an SIS trip alarm from the SIS log source. The rule must immediately execute a lookback query across two data sources for the 5 minutes preceding the trip: 1) Process Historian data, to check if any PV exceeded its defined safety trip point, and 2) SIS command logs and Windows Event ID 4624, to check for an authorized manual trip command. Generate a critical alert if the SIS trip occurred with neither a preceding safety limit excursion nor an authorized manual command.",
              "Establish a comprehensive network traffic baseline for the SIS network segment using Zeek conn.log, profiling normal source/destination IPs, ports, protocols, and data volumes. After any SIS trip, analyze network traffic from the preceding 30 minutes. Calculate the statistical rarity (e.g., z-score > 3 or percentile rank < 1%) of any observed connections compared to the established baseline. Alert if the SIS trip is temporally correlated with statistically rare network activity, such as a new IP communicating with the SIS logic solver or the use of a non-standard protocol/port.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on historical SIS trip events. Label each past event as 'Legitimate' (preceded by PV excursion or manual command) or 'Anomalous'. Engineer features for the model including: a binary flag for PV excursion, a binary flag for manual command, source IP of any login to the SIS workstation (from Event ID 4624), and the statistical rarity score of network connections to the SIS controller (from the statistical action). Deploy the trained model to automatically classify every new SIS trip in real-time and alert on any event classified as 'Anomalous' with high confidence (e.g., probability > 0.90)."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]