[
  {
    "information_requirement": "Is an adversary manipulating the I/O image of a PLC to inhibit its response function?",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0835",
        "name": "Manipulate I-O Image",
        "evidence": [
          {
            "description": "A Modbus 'Force Single Coil' (Function Code 5) or 'Force Multiple Coils' (Function Code 15) command is observed where the source IP is not on an authorized Engineering Workstation (EWS) allowlist, OR the command originates from an unapproved process on an authorized EWS, OR the command is executed outside of a defined maintenance or operational window for the target PLC.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Industrial Demilitarized Zone (IDMZ) network segments, Control Network segments (Level 3.5 and 3 of Purdue Model), Process Control Network (PCN) segments (Level 2 of Purdue Model), Engineering Workstation (EWS) endpoints, PLC network interfaces.",
            "action": [
              "Create a detection rule that triggers on Zeek modbus.log events where 'function_code' is 5 or 15. The rule must check three conditions: (1) The source IP ('id.orig_h') is not in a predefined allowlist of authorized EWS IPs. (2) If the source IP is authorized, correlate it with Windows Event ID 4688 on the EWS to identify the 'ProcessName'; trigger if the process is not in an allowlist of approved engineering software (e.g., 'Studio5000.exe'). (3) The command's timestamp ('ts') falls outside of pre-defined maintenance windows for the target PLC ('id.resp_h'). An alert is generated if any condition is met.",
              "For each unique source IP and target PLC pair ('id.orig_h', 'id.resp_h'), establish a baseline of hourly command counts for Modbus function codes 5 and 15 over a 30-day period. Calculate the 99th percentile of this count. Generate an alert if the current hourly count for any pair exceeds this 99th percentile threshold, indicating an anomalous frequency of force commands.",
              "Deploy a trained Random Forest or Gradient Boosting classifier to analyze real-time Modbus commands (Function Codes 5 and 15). The model should use features such as source IP, destination IP, function code, coil address, hour of day, and day of week from Zeek logs, enriched with the originating 'ProcessName' from correlated Windows Event ID 4688 logs. Generate a high-confidence alert if a command is classified as 'malicious' with a prediction probability greater than 0.9."
            ]
          },
          {
            "description": "A Modbus 'Preset Single Register' (Function Code 6) or 'Preset Multiple Registers' (Function Code 16) command is observed where the source IP is not on an authorized EWS allowlist, OR the command originates from an unapproved process, OR the written 'register_value' falls outside a pre-defined safe operational range for the specific target register address.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments (Level 2 of Purdue Model), critical PLC backplanes, Engineering Workstation (EWS) endpoints, PLC network interfaces.",
            "action": [
              "Create a detection rule that triggers on Zeek modbus.log events where 'function_code' is 6 or 16. The rule must check three conditions: (1) The source IP ('id.orig_h') is not in an EWS allowlist. (2) Correlate with Windows Event ID 4688 to ensure the originating 'ProcessName' is on an approved software allowlist. (3) For a predefined list of critical register addresses, validate that the 'register_value' is within its documented safe operational range. An alert is generated if any condition is met.",
              "For each critical register address on a target PLC, establish a baseline of its value over a 30-day period to calculate the historical mean and standard deviation. Generate an alert if a new write command (Function Code 6 or 16) sets a 'register_value' that is more than 3 standard deviations from the historical mean for that specific register, indicating a statistically significant and potentially unsafe deviation.",
              "Implement an unsupervised anomaly detection model, such as an Isolation Forest, trained on a baseline of normal Modbus write activity (Function Codes 6, 16). The model should analyze features including source IP, destination IP, register address, register value, and time of day. Generate an alert if a new command receives an anomaly score in the top 5% (95th percentile) compared to the baseline distribution, flagging it as a highly unusual and potentially malicious operation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]