[
  {
    "information_requirement": "Is an adversary attempting to evade detection by masquerading malicious files as legitimate ICS software or processes? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0849",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) shows a known ICS application name (e.g., 'RSLinx.exe', 'FTView.exe', 'ControlLogix.exe') executing from a command line path that is not on an established whitelist of approved execution directories for that specific application.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), ICS Application Servers, Data Historians, Jump Servers within the ICS network.",
            "action": [
              "Create and maintain an application whitelist mapping approved ICS process names to their full, legitimate command line paths. Query for process creation events (Windows Event ID 4688) where the 'ProcessName' field matches an application on the whitelist, but the 'CommandLine' field does not match the corresponding approved path or originates from a known suspicious directory (e.g., 'C:\\Temp\\', 'C:\\Perflogs\\', 'C:\\Users\\Public\\').",
              "For each unique ICS process name, ingest at least 90 days of Windows Event ID 4688 data to build a historical frequency distribution of its execution paths. For each new process creation event, compare its execution path to the historical distribution for that process name. Generate an alert if the path's historical frequency falls below a set threshold, such as the 5th percentile, indicating a statistically rare execution location.",
              "Train a one-class anomaly detection model, such as an Isolation Forest, on the feature set of legitimate process creation events, focusing on the 'CommandLine' path associated with known ICS applications from historical Windows Event ID 4688 logs. Deploy the model to score new process creation events in real-time. Flag any event where an ICS application's execution path is classified as an outlier for investigation."
            ]
          },
          {
            "description": "A file is created or modified (Windows Event ID 4663 with write access) within a critical ICS directory (e.g., project file shares, PLC program folders), and the filename exhibits anomalous characteristics such as a double extension (e.g., 'project.plc.exe') or an extension not typically associated with ICS files (e.g., '.vbs', '.scr').",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) local drives, Shared Network Drives (e.g., for project files, backups), ICS Application Servers, Data Historians.",
            "action": [
              "Enable object access auditing for write/append actions (Event ID 4663) on critical ICS file directories. Create a detection rule that uses regular expressions to identify filenames containing multiple extensions (e.g., '.*\\..{2,5}\\..{2,5}$') or extensions from a blacklist of non-standard file types (e.g., .bat, .scr, .js). Generate an alert on any match within the monitored directories.",
              "For each monitored critical directory, profile the file extensions from historical Event ID 4663 logs to establish a baseline of normal extension frequency. For each new file creation event, calculate the Shannon entropy of the filename string. Trigger an alert if a file is created with an extension that is statistically rare (e.g., <1% historical occurrence) for that directory, or if the filename's entropy score exceeds the 95th percentile of the established baseline, indicating high randomness.",
              "Develop a supervised machine learning classification model (e.g., Random Forest) trained on features extracted from filenames (e.g., character n-grams, length, presence of special characters, file extension) from historical data, labeled as 'benign' or 'suspicious'. Deploy the model to classify new filenames created within protected directories in real-time and alert on any filename classified as 'suspicious'."
            ]
          },
          {
            "description": "A core Windows system process (e.g., 'svchost.exe', 'lsass.exe', 'services.exe') on an ICS asset initiates an outbound network connection, as seen by correlating Windows Event ID 5156 with Zeek conn.log, to a destination IP address or port that has never been observed for that process on that host.",
            "data_sources": [
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments (Control/Process LAN, DMZ), Corporate-to-ICS DMZ, Internet Gateway (for outbound connections from ICS assets), Firewalls logging connection attempts.",
            "action": [
              "Correlate Windows Event ID 5156 (which provides Process Name and PID) with Zeek conn.log records by joining on source IP and time. Maintain a whitelist of expected destination IP addresses, domains, and ports for core system processes on critical ICS assets. Generate an alert if a process like 'svchost.exe' initiates a connection to a destination not on the whitelist or a destination found on a threat intelligence feed (via Zeek dns.log).",
              "For each core system process on each critical host, establish a 30-day rolling baseline of its network behavior, including the set of unique destination IPs, destination ports, connection duration, and total bytes transferred (orig_bytes + resp_bytes from conn.log). Alert if a new connection from one of these processes involves a destination IP never before seen for that process on that host, or if a quantitative metric like connection duration or data volume exceeds the 98th percentile of its historical baseline.",
              "Train a multivariate anomaly detection model (e.g., an Autoencoder) on a feature set derived from correlated Windows and Zeek logs (Process Name, Destination IP, Port, Protocol, Bytes Transferred, Connection Duration, DNS Query). The model learns the normal 'process-to-network' interaction profile for critical ICS assets. Deploy the model to score all new connections and flag any connection with a high reconstruction error (anomaly score) for immediate investigation, particularly if initiated by a common system process."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]