[
  {
    "information_requirement": "Is an adversary attempting to discover information about the ICS network topology, protocols, or credentials by sniffing network traffic? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0842",
        "name": "Network Sniffing",
        "evidence": [
          {
            "description": "A process is created or a service is installed on a critical ICS asset that matches a known network sniffing tool, or a running process loads a known packet capture library.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7045",
              "Sysmon Event ID 1",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, and other Windows-based systems within the Process Control Network (PCN) and Manufacturing Zone.",
            "action": [
              "Create a detection rule to alert when a process creation event (Windows Event ID 4688, Sysmon Event ID 1), service installation (Windows Event ID 7045), or image load (Sysmon Event ID 7) on a critical ICS asset matches a watchlist of network sniffing tool names (e.g., 'wireshark.exe', 'tcpdump.exe'), driver names ('npf.sys'), or library names ('wpcap.dll').",
              "For each critical ICS asset, compute a 14-day rolling 98th percentile baseline of daily new, non-allowlisted process creations (from Sysmon Event ID 1). Alert if the daily count exceeds this threshold. Separately, baseline the set of DLLs loaded by critical applications and alert on any new, unexpected DLLs being loaded (from Sysmon Event ID 7).",
              "Implement a pre-trained classification model (e.g., Random Forest) to score all process creation events (Sysmon Event ID 1) from ICS assets. Use features like process name entropy, parent process lineage, and command-line argument structure to classify processes as 'benign' or 'suspicious sniffer-like'. Alert on any process classified as suspicious."
            ]
          },
          {
            "description": "An ICS host exhibits anomalous network scanning behavior, indicated by communication with an abnormally high number of unique destination IPs or communication with IPs outside of its established communication allowlist.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting PLCs, RTUs, and SCADA servers; network choke points between the IT and OT networks; switch port mirror/SPAN sessions on critical ICS segments.",
            "action": [
              "Implement a strict network communication policy that defines approved source-destination-port tuples for all ICS assets. Create a detection rule to alert on any connection in Zeek conn.log that violates this policy, especially traffic from an EWS or HMI to an IP address outside the defined OT network boundary.",
              "For each critical ICS host, use Zeek conn.log to establish a 30-day rolling baseline and 99th percentile threshold for the hourly count of unique destination IPs ('fan-out') and the Shannon entropy of destination ports. Alert if a host's hourly metrics exceed these thresholds.",
              "Deploy a time-series anomaly detection model (e.g., LSTM Autoencoder) that ingests hourly feature vectors for each host from Zeek conn.log (e.g., connection count, unique destination IPs, protocol distribution). Alert when the model's reconstruction error for a host's activity vector surpasses a dynamically calculated threshold, indicating a deviation from its normal communication profile."
            ]
          },
          {
            "description": "Cleartext transmission of sensitive ICS commands or administrative credentials is detected, or the volume or duration of unencrypted protocol sessions deviates significantly from the norm.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek ftp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data historians, SCADA servers, and network segments carrying administrative or industrial protocol traffic; DMZ segments for external ICS access.",
            "action": [
              "Using Zeek's protocol-specific logs (e.g., modbus.log, dnp3.log), create rules that alert on the use of unauthorized ICS function codes between specific devices or any use of administrative protocols like Telnet or FTP that is not explicitly allowlisted for specific source-destination pairs.",
              "For each established unencrypted protocol session type (e.g., HMI-A to PLC-B via Modbus), calculate the 30-day rolling average and standard deviation of session duration and byte count from Zeek conn.log. Alert if any single session's metrics exceed the mean by more than 3 standard deviations.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to features from Zeek conn.log and protocol-specific logs for all unencrypted sessions. Use features like duration, byte counts, and specific commands (e.g., FTP commands). Alert on any session classified as a cluster outlier, representing anomalous communication."
            ]
          },
          {
            "description": "An IP address for a critical ICS asset (e.g., gateway, historian) is re-mapped to a new, unauthorized MAC address, or a DNS query for an internal ICS resource is resolved to an external or unauthorized IP address.",
            "data_sources": [
              "Zeek arp.log",
              "Zeek dns.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Local network segments within the Process Control Network (PCN), especially those containing EWS, HMIs, and PLCs; DNS servers and resolvers serving the OT environment.",
            "action": [
              "Create a rule to alert on any event in Zeek arp.log where an IP address belonging to a critical asset (e.g., gateway, SCADA server) is associated with a new MAC address not on a pre-approved hardware list. Also, alert on any 'ARP_Spoofing' notice in Zeek notice.log or any DNS response in Zeek dns.log resolving an internal FQDN to an external IP.",
              "Maintain a static mapping of all known IP-to-MAC address pairs from Zeek arp.log and alert on any new, un-mapped pairing. For DNS, calculate the 99th percentile baseline for daily NXDOMAIN responses per host; alert if a host exceeds this threshold, indicating potential reconnaissance or C2 communication attempts.",
              "Implement a graph-based anomaly detection model where nodes are IPs, MACs, and domains, and edges are communications. Train the model on the normal network graph structure. Alert when the model detects structural changes with a high anomaly score, such as a new edge linking a critical IP node to a previously unknown MAC node (ARP spoof) or a host node connecting to a new, isolated domain sub-graph (DNS compromise)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]