[
  {
    "information_requirement": "Is the adversary executing unauthorized scripts on critical ICS assets like Engineering Workstations or HMIs? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0853",
        "name": "Scripting",
        "evidence": [
          {
            "description": "A powershell.exe process creation event (Sysmon Event ID 1 / Windows Event ID 4688) or a PowerShell script block log (Windows Event ID 4104) is observed on a critical ICS asset where at least one of the following conditions is met: (1) The process command line contains high-risk arguments such as '-EncodedCommand', '-ExecutionPolicy Bypass', '-NonInteractive', or '-WindowStyle Hidden', or includes patterns indicative of download cradles (e.g., 'IEX(New-Object Net.WebClient).DownloadString'). (2) The parent process is not on an established allow-list of processes expected to spawn PowerShell on this asset class (e.g., parent is 'winword.exe'). (3) The associated script block content (Event ID 4104) has a Shannon entropy score exceeding the 98th percentile of the host's 30-day baseline or contains high-risk .NET API calls like 'System.Reflection.Assembly.Load'. (4) The powershell.exe process initiates an outbound network connection (Sysmon Event ID 3 / Zeek conn.log) to an IP or domain on a threat intelligence feed, or to a destination port outside the 99th percentile of commonly used ports for that specific asset.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Servers, Jump Servers, Domain Controllers, OT DMZ, Remote Access Servers",
            "action": [
              "Query for process creation events (Windows Event ID 4688, Sysmon Event ID 1) where process name is 'powershell.exe' AND the command line contains case-insensitive strings like '-enc', '-ep bypass', 'IEX(', or '-w hidden'. Separately, query for the same process where the parent process name is NOT IN {'explorer.exe', 'cmd.exe', 'pwsh.exe', 'sqlagent.exe', 'mmc.exe'}. Join process creation events with network connection logs (Sysmon Event ID 3 or Zeek conn.log by host IP and timestamp) and alert if the destination IP or resolved domain name matches a known-bad indicator from a threat intelligence feed.",
              "For each host, ingest all PowerShell script block logs (Windows Event ID 4104) over a 30-day period to compute a baseline distribution of Shannon entropy scores. Generate an alert when a new script block's entropy score exceeds the 98th percentile of that host's specific baseline. Separately, for each user-host pair, establish a 30-day baseline for PowerShell command-line length. Alert if a new command's length exceeds 3 standard deviations from the historical mean for that user on that host.",
              "Utilize a pre-trained text classification model (e.g., a fine-tuned BERT or a simpler logistic regression model on TF-IDF features) to analyze the content of all PowerShell script blocks (Windows Event ID 4104). Features for the model should include n-grams, presence of specific API calls, and obfuscated string patterns. Generate an alert for any script classified as malicious with a probability score greater than 0.85. Separately, feed process event features from Sysmon Event ID 1 (parent process, command-line length, argument count, user context, hour of day, day of week) into a trained anomaly detection model like Isolation Forest or a Variational Autoencoder. Alert on any event flagged as an anomaly."
            ]
          },
          {
            "description": "A python.exe or pythonw.exe process creation event (Sysmon Event ID 1 / Windows Event ID 4688) is observed on a critical ICS asset where at least one of the following conditions is met: (1) The full path of the Python interpreter is not on a pre-defined application allow-list for that specific asset. (2) The process executes a script (e.g., a .py or .pyc file) that was written to the disk (Sysmon Event ID 11 or Zeek files.log) within the previous 10 minutes. (3) The parent process is not on an established allow-list for that asset (e.g., a SCADA application process). (4) The process initiates a DNS request (Zeek dns.log) for a domain with a calculated inverse domain frequency (IDF) score in the top 1% (most rare) for the entire OT network segment, or initiates a network connection (Sysmon Event ID 3 / Zeek conn.log) to an IP address on a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 11",
              "Zeek files.log",
              "Zeek http.log",
              "Zeek smb.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Process Control Servers, Data Historians, OT Network Segments, Jump Servers, OT DMZ",
            "action": [
              "Query for process creation events (Windows Event ID 4688, Sysmon Event ID 1) where the process name is 'python.exe' or 'pythonw.exe' AND the full process path is NOT IN the organization's approved software inventory for that asset type. Create a correlation rule that joins file creation events (Sysmon Event ID 11) or file transfer logs (Zeek files.log) for files ending in '.py' or '.pyc' with process execution events (Sysmon Event ID 1) on the same host. Alert if the process execution occurs within 15 minutes of the file write. Join process creations with network connection logs (Sysmon Event ID 3) and alert if the destination IP matches a threat intelligence feed.",
              "For each host, maintain a historical set of all Python script paths executed (parsed from command-line arguments in Event ID 4688/Sysmon Event ID 1). Alert on any execution of a Python script from a path that has never been observed on that specific host before ('first seen' analysis). Separately, calculate the inverse domain frequency (IDF) for all unique domains queried (from Zeek dns.log) across the OT network over a 30-day window. For any DNS query originating from a python.exe process, alert if the requested domain's IDF score is in the top 1% (i.e., is one of the rarest domains requested network-wide).",
              "Apply a trained One-Class SVM model to score all Python execution events based on a feature vector including parent process name, command-line argument count, presence of interactive flags, user context, and subsequent network connection patterns (e.g., destination port, bytes transferred). Alert on any execution flagged as an outlier. For file write events involving .py files (Sysmon Event ID 11), extract the file content and apply a pre-trained Gradient Boosting classifier to classify it as benign or malicious, based on features like imported libraries (e.g., 'socket', 'os', 'subprocess') and function calls (e.g., 'eval', 'exec', 'system'). Alert if the file is classified as malicious with a confidence score > 0.90."
            ]
          },
          {
            "description": "A wscript.exe or cscript.exe process creation event (Sysmon Event ID 1 / Windows Event ID 4688) is observed on a critical ICS asset where at least one of the following conditions is met: (1) The executed script file (e.g., .js, .vbs, .wsf) resides in a directory commonly used for temporary or user-writable files, such as '%TEMP%', '%APPDATA%', or 'C:\\Users\\Public\\'. (2) The parent process is a non-administrative application, such as an Office suite program (winword.exe, excel.exe), a web browser, or a PDF reader. (3) The command-line argument containing the script path has a character length that exceeds the 99th percentile of that host's 90-day baseline for wscript/cscript executions. (4) The process initiates an outbound network connection (Sysmon Event ID 3 / Zeek conn.log) to an IP address on a threat intelligence feed or to a destination IP not previously contacted by that host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 11",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Servers, Jump Servers, OT DMZ",
            "action": [
              "Query for process creation events (Sysmon Event ID 1) where the process name is 'wscript.exe' or 'cscript.exe' AND the parent process name is IN {'winword.exe', 'excel.exe', 'outlook.exe', 'acrord32.exe', 'chrome.exe', 'firefox.exe'}. Create a correlation rule that looks for a file creation event (Sysmon Event ID 11) for a file with a .js, .vbs, or .wsf extension in a temporary directory (e.g., path contains '\\AppData\\Local\\Temp'), followed within 5 minutes by a process execution (Sysmon Event ID 1) of that same file. Join process creations with network connection logs (Sysmon Event ID 3) and alert if the destination IP matches a threat intelligence feed.",
              "For each host, establish a 90-day rolling baseline of command-line lengths for all wscript.exe and cscript.exe executions (from Event ID 4688). Alert if a new execution's command-line length exceeds the 99th percentile for that host's baseline. Separately, maintain a frequency map of all script file extensions (e.g., .vbs, .js) executed by wscript.exe and cscript.exe across the entire NAI. Alert if an extension that has not been observed in the past 90 days (e.g., .jse, .vbe) is executed, flagging it as a rare event.",
              "Apply a DBSCAN clustering model to process event data (Sysmon Event ID 1) for wscript.exe and cscript.exe executions. Use a feature vector including the parent process name, tokenized command-line arguments, user context, and hour of execution. Any execution that is classified as a 'noise' point (i.e., does not belong to any identified cluster of normal behavior) should generate an alert for analyst investigation as a potential anomaly. This is effective for finding novel execution patterns that don't match any known good behavior."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]