[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS environment via spearphishing attachments? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0865",
        "name": "Spearphishing Attachment",
        "evidence": [
          {
            "description": "An email is received by a high-value ICS target (e.g., a member of the 'ICS_Engineers' or 'OT_Operators' AD group) from an external source. The email, identified in Zeek smtp.log, contains an attachment identified by correlating the 'fuid' to Zeek files.log. The evidence is strengthened if: 1) The attachment has a high-risk file type (e.g., .exe, .vbs, .docm, .xlsm, .iso, .zip, or ICS-specific project files like .ACD, .PCV, .S7P). 2) The attachment filename or email subject contains ICS-specific keywords (e.g., 'PLC Update', 'SCADA Alert', 'HMI Configuration', 'firmware', 'Rockwell', 'Siemens', 'Project OT-Upgrade'). 3) The sender's domain is not on an organizational allowlist or fails DMARC/SPF/DKIM checks.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Zeek x509.log",
              "Active Directory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway, OT Network Mail Relay (if present), Corporate-to-OT DMZ, Engineering Workstations (local email client logs), Control System Network (for internal email traffic if applicable)",
            "action": [
              "Create and maintain watchlists for: a) high-risk ICS personnel email addresses, b) high-risk file extensions including archives (.zip, .rar, .iso) and ICS project files (.ACD, .PCV, .S7P, .ap16), and c) ICS-specific keywords ('PLC', 'HMI', 'firmware', 'SCADA', vendor names, project codes). Construct a query to join Zeek smtp.log and files.log on the 'fuid' field. Generate a high-priority alert if an email to a watchlisted recipient from an external source contains an attachment whose hash matches a known-bad value from threat intelligence, or if the attachment's 'filename' or 'mime_type' is on the high-risk list AND the 'subject' or 'filename' contains a watchlisted keyword.",
              "For all external emails with attachments sent to high-risk ICS personnel, establish a 90-day rolling baseline of sender-recipient communication frequency. Alert if a high-risk attachment is received from a sender domain that is new or falls below the 1st percentile of observed frequency for that recipient group. Concurrently, calculate the Shannon entropy of both the attachment filename (from files.log) and the email subject (from smtp.log). Alert when an attachment's filename or subject entropy exceeds the 99th percentile of its respective baseline, suggesting randomization or obfuscation.",
              "Implement a supervised classification model (e.g., Gradient Boosting, Random Forest) trained on historical email metadata to produce a phishing probability score for each incoming email. Features should include: sender domain age/reputation (via enrichment), DMARC/SPF/DKIM results, presence and density of ICS keywords, attachment MIME type, attachment filename entropy, historical communication frequency between sender-recipient pair, and NLP-derived features from the subject/body indicating urgency or unusual requests. Generate a critical alert when the model classifies an email to a high-risk user as 'phishing' with a confidence score > 0.90."
            ]
          }
        ]
      },
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "On an ICS asset (e.g., Engineering Workstation, HMI), a process creation event (Windows Event ID 4688) shows a parent process associated with an email client or document reader (e.g., 'OUTLOOK.EXE', 'WINWORD.EXE', 'ACRORD32.EXE', 'EXCEL.EXE') spawning a child process that is a command-line interpreter, scripting engine, or known Living Off the Land Binary (LOLBAS) (e.g., 'cmd.exe', 'powershell.exe', 'wscript.exe', 'mshta.exe', 'bitsadmin.exe'). This event is highly suspicious if it occurs within minutes of the user receiving a suspicious email.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Windows Event ID 4103",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Human-Machine Interfaces (HMIs), Operator Consoles, Jump Servers within the OT network, Data Historians",
            "action": [
              "On all hosts within the NAI, monitor Windows Event ID 4688. Maintain a strict, environment-specific allowlist of approved parent-child process relationships. Generate a critical alert if a process pair is observed where 'ParentProcessName' is in ('WINWORD.EXE', 'EXCEL.EXE', 'ACRORD32.EXE', 'OUTLOOK.EXE') and 'NewProcessName' is in ('cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', 'rundll32.exe', 'certutil.exe', 'bitsadmin.exe'), and this specific pair is not on the allowlist. Enhance the alert by inspecting the 'CommandLine' for suspicious arguments (e.g., '-enc', '-nop', '-noni', 'download', 'IEX') and cross-correlating the event timestamp with the delivery time of a suspicious email to that user.",
              "For each host in the NAI, calculate the historical frequency of all unique parent-child process pairs and unique command-line argument tokens from Windows Event ID 4688 over a 60-day baseline. Alert when a new, never-before-seen parent-child pair is observed involving a document handler and a LOLBAS. Additionally, for processes like 'powershell.exe', alert if the command-line entropy exceeds the 98th percentile of its historical baseline or if it contains an argument token that falls below the 1st percentile of frequency (i.e., is extremely rare for your environment).",
              "Deploy a process execution anomaly detection model using a graph-based algorithm or Recurrent Neural Network (RNN) on Windows Event ID 4688 data from ICS workstations. The model should learn normal process execution trees and sequences. Features should include process names, parent process names, parent process path, command-line arguments, and process token integrity level. Generate a high-severity alert when the model flags a process execution chain originating from a document handler with an anomaly score greater than 0.9, indicating a significant deviation from learned safe behavior patterns."
            ]
          },
          {
            "description": "A process identified as suspicious by prior evidence (e.g., 'powershell.exe' spawned by 'WINWORD.EXE') initiates an outbound network connection from an ICS asset. The connection, observed in Zeek logs and Windows Event ID 5156, is anomalous if: 1) The destination IP ('id.resp_h') or domain ('query') is on a threat intelligence list. 2) The TLS SNI ('server_name') is a newly observed domain or uses a self-signed certificate. 3) The JA3/JA3S TLS fingerprint is associated with known C2 tooling. 4) Data volume ('orig_bytes' or 'resp_bytes') is unusually large. 5) Connection timing is periodic, suggesting C2 beaconing.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, HMIs, OT Network Egress Firewalls, Industrial Demilitarized Zone (IDMZ) Firewalls, Corporate-to-OT DMZ",
            "action": [
              "Correlate the ProcessID from a suspicious Windows Event ID 4688 with a network connection event from Windows Event ID 5156. Use the connection details (destination IP/port) to find the corresponding Zeek conn.log entry. Generate a critical alert if the 'id.resp_h' (destination IP), 'query' (DNS query), 'server_name' (TLS SNI), or JA3/JA3S hash matches an entry in a threat intelligence feed. Also alert if the 'validation_status' in Zeek ssl.log is 'self-signed' for a connection initiated by the suspicious process.",
              "For each host in the NAI, establish a 30-day baseline of network behavior per process, including destination ports, protocols, data volumes, and connection intervals. Alert if a connection from a suspicious process uses a destination port that falls below the 1st percentile of historical usage for that host. For C2 beaconing, calculate the variance of inter-arrival times for connections to the same destination. Alert if the variance is near zero, indicating highly regular communication. Also, alert if the ratio of outbound to inbound bytes ('orig_bytes'/'resp_bytes') exceeds the 98th percentile of the host's baseline.",
              "Use an unsupervised time-series anomaly detection model (e.g., LSTM Autoencoder) on aggregated network flow data (Zeek conn.log) for each critical ICS host. The model should be trained on sequences of features like (timestamp, destination IP, destination port, bytes out, bytes in, protocol, duration). Generate a high-severity alert for any connection sequence originating from a suspicious process that receives a high reconstruction error from the model, indicating it does not conform to learned normal network traffic patterns and may represent C2 beaconing or data exfiltration."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]