[
  {
    "information_requirement": "Are unauthorized tools or files being transferred to critical ICS assets like HMIs, Engineering Workstations, or Historians? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0867",
        "name": "Lateral Tool Transfer",
        "evidence": [
          {
            "description": "A network file transfer event is observed over SMB, FTP, or SFTP where a file with a high-risk extension (e.g., .exe, .dll, .ps1, .bat, .zip) or an ICS-specific project file extension (e.g., .ACD, .PC5, .XEF) is transferred to a critical ICS asset from a source IP not on an approved whitelist for such transfers.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek ftp.log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors deployed at key chokepoints, such as the IT/OT boundary (Purdue Level 3.5), between control and supervisory zones (Purdue Level 2/3), and monitoring traffic to and from critical assets like Engineering Workstations (EWS), Human Machine Interfaces (HMIs), and Historian databases.",
            "action": [
              "Create a SIEM rule to query Zeek logs (smb_files.log, ftp.log, files.log) for file transfers destined for IP addresses of critical ICS assets. Trigger an alert if the filename ends in a high-risk extension (.exe, .dll, .ps1, .bat, .sh, .zip, .rar) or common ICS project/logic file extensions (.ACD, .PC5, .XEF, .L5K), OR if the SMB path includes an administrative share (e.g., C$, ADMIN$) and the source IP (id.orig_h) is not on a pre-defined whitelist of authorized administrative or engineering systems.",
              "For all file transfers to critical ICS assets, establish a 30-day rolling baseline of (1) file sizes, (2) filename Shannon entropy, and (3) unique source-destination IP pairs. Generate an alert if a new transfer's file size or filename entropy exceeds the 98th percentile for that destination asset, or if the transfer occurs between a source-destination pair observed for the first time in the 30-day window.",
              "Train a multivariate time-series anomaly detection model (e.g., Isolation Forest or Variational Autoencoder) on historical Zeek log data. Features should include the hourly count of transfers, volume of data transferred, distribution of file extensions, unique source/destination subnets, and protocol used (SMB, FTP, etc.). Deploy the model to alert on significant deviations from learned normal operational patterns, such as a sudden spike in .exe transfers to HMIs or transfers from a source subnet never before seen communicating with an Engineering Workstation."
            ]
          },
          {
            "description": "A Windows Event ID 5145 is generated on a critical ICS host, indicating a network share object access where the 'Accesses' field contains 'WriteData' or 'AppendData' (or access mask 0x2). The access is to a sensitive directory or administrative share (e.g., C$, ADMIN$) and the source account or IP address is not on an approved whitelist for that specific host and share.",
            "data_sources": [
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical ICS hosts (e.g., HMIs, Engineering Workstations, Historians, SCADA servers) where Windows security auditing for detailed file share access is enabled.",
            "action": [
              "Create a SIEM rule to filter for Windows Event ID 5145 on critical ICS hosts (HMIs, EWS). Alert if the 'Accesses' field contains 'WriteData' or 'AppendData', the 'ShareName' is an administrative share (e.g., '\\\\*\\C$') OR the 'RelativeTargetName' points to a sensitive directory (e.g., directories containing PLC project files), and the 'SourceAddress' or 'AccountName' is not on a pre-defined whitelist of authorized entities for that host.",
              "For each critical ICS host, establish a 30-day baseline of normal write activity (Event ID 5145) by unique 'SourceAddress'-'AccountName'-'ShareName' combinations. Track the count of events and the set of file extensions written. Alert when the hourly count of write events for a specific combination exceeds three standard deviations from its historical mean, a write event occurs from a 'SourceAddress' or 'AccountName' never before seen writing to that share, or a file with an extension never before seen in that context is written.",
              "Implement a User and Entity Behavior Analytics (UEBA) model, such as One-Class SVM or a graph-based model, trained on historical Windows Event ID 5145 data. The model should profile normal write access patterns based on a feature set including source IP, account, share name, target path, time of day, and day of the week. Alert when the model flags a write event with a high anomaly score, indicating a significant deviation from learned normal behavior for that user or source entity."
            ]
          },
          {
            "description": "A Windows Event ID 5145 indicating a successful file write is followed within 300 seconds by a Windows Event ID 4688 for process creation on the same ICS host, where the file path from the write event exactly matches the new process name from the process creation event. This sequence is not associated with a whitelisted software deployment or maintenance activity.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical ICS hosts (e.g., HMIs, Engineering Workstations, Historians) with security event logging enabled for both detailed file share auditing and process creation.",
            "action": [
              "Create a high-priority SIEM correlation rule that triggers when a Windows Event ID 5145 (with 'WriteData' access) is observed on an ICS host, and is followed within 300 seconds by a Windows Event ID 4688 on the same host. The correlation must match where EventID_5145.RelativeTargetName matches EventID_4688.NewProcessName. Further refine by alerting only if the 'ParentProcessName' in Event ID 4688 is not on a whitelist of expected processes (e.g., explorer.exe, services.exe, approved software deployment tools) and the source account is not an approved administrative or service account.",
              "Analyze historical correlations of Event ID 5145 and 4688 to baseline legitimate file-write-then-execute behavior. For each unique process name executed from a network share, calculate the frequency and the typical time delta between write and execution. Alert if a process is created from a share that is statistically rare (e.g., has occurred fewer than 5 times in the past 90 days), or if the time delta between write and execution is below the 5th percentile of the baseline for that process. Additionally, calculate the entropy of the file path and alert if it exceeds a threshold, indicating potential randomization.",
              "Develop a sequence-based anomaly detection model (e.g., a Hidden Markov Model or Recurrent Neural Network) to learn normal sequences of file writes (Event ID 5145) followed by process creation (Event ID 4688) in the ICS environment. The model state should be defined by features including the source user, source host, target host, parent process name, and process name. Alert when an observed sequence of events has a low probability score according to the trained model, indicating a rare or malicious sequence of lateral tool transfer and remote execution."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]