[
  {
    "information_requirement": "Has an adversary successfully tricked an ICS operator or engineer into executing malicious code?",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "A Windows Event ID 4688 records a process creation on an ICS host (e.g., EWS, HMI) where a parent process from an approved Office application or PDF reader whitelist (e.g., winword.exe, excel.exe, powerpnt.exe, acrord32.exe) launches a suspicious child process. The child process is considered suspicious if it is a command-line interpreter or scripting engine (e.g., cmd.exe, powershell.exe, wscript.exe, cscript.exe, rundll32.exe) and its command line contains indicators of obfuscation (e.g., base64 encoding, excessive carets) or download/execution cradles. This event is further corroborated if the child process initiates an outbound network connection, observed in Zeek conn.log, within 15 seconds of its creation to an IP address with a low reputation, a newly registered domain (from Zeek dns.log), or a destination IP/port combination not seen for that host group in the last 30 days.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices within the ICS network, including Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, and ICS DMZ servers; network traffic monitoring points at ICS zone boundaries and egress points.",
            "action": [
              "Implement a SIEM rule to detect Windows Event ID 4688 where ParentProcessName IS IN ('winword.exe', 'excel.exe', 'powerpnt.exe', 'acrord32.exe') AND NewProcessName IS IN ('cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'rundll32.exe'). Enhance the rule to check if the child process's CommandLine contains suspicious arguments such as '/c', '-EncodedCommand', '-nop', '-w hidden', 'IEX', 'Invoke-Expression', 'DownloadString', or 'FromBase64String' that are not part of an approved baseline. Correlate by ProcessId and timestamp with Zeek conn.log to flag if the child process initiates any outbound connections to non-RFC1918 addresses not on a pre-approved destination whitelist within 15 seconds. Cross-reference destination domains from Zeek dns.log against threat intelligence feeds for age and reputation.",
              "For all process chains matching the parent-child pattern (Office app -> interpreter), calculate the Shannon entropy of the CommandLine argument. Alert if the entropy exceeds a dynamically calculated baseline threshold (e.g., > 4.5), indicating probable obfuscation. Separately, maintain a 90-day baseline of all unique ParentProcessName, NewProcessName, and CommandLine combinations. Alert if a new combination is observed (a zero-frequency event) or if its frequency falls in the bottom 1st percentile of historical observations for that host, indicating rarity. Also, alert if the command line length exceeds the 99th percentile for that specific parent-child process pair.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) on process creation events. Features should include ParentProcessName, NewProcessName, CommandLine length, CommandLine entropy, and features extracted from correlated Zeek pe.log data for the process executable (e.g., number of sections, imphash, presence of high-entropy sections). The model should be trained on a 'golden' dataset representing at least 30 days of normal ICS operations. Flag process events with high anomaly scores (e.g., top 0.5%). For alerted events, automatically enrich with correlated network data (Zeek conn.log, dns.log) and file hash reputation (Zeek files.log) to prioritize anomalies."
            ]
          },
          {
            "description": "A Windows Event ID 4688 records a process creation where the executable path (NewProcessPath) is within a non-standard or user-writable directory on an ICS host (e.g., C:\\Users\\*\\Downloads\\, C:\\Users\\*\\AppData\\Local\\Temp\\, C:\\ProgramData\\, C:\\PerfLogs\\). The event's suspicion level increases if the process's metadata (OriginalFileName, Description) is missing or mismatched with the NewProcessName, if its code signature is invalid or absent, or if its file hash does not appear on a known-good software inventory list. This is strongly corroborated if, within 30 seconds, the new process initiates a network connection (seen in Zeek conn.log) to an external IP address not on an approved whitelist, especially over a non-standard port for that host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek x509.log",
              "Zeek files.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices such as Engineering Workstations (EWS), HMIs, Maintenance Laptops, and Jump Boxes within ICS zones; network egress points from the ICS network; ICS DMZ network segments where software updates might be staged.",
            "action": [
              "Create a SIEM rule to detect Windows Event ID 4688 where NewProcessPath matches patterns for user-writable or temporary directories ('\\\\Users\\\\', '\\\\AppData\\\\', '\\\\ProgramData\\\\', '\\\\PerfLogs\\\\', '\\\\$Recycle.Bin\\\\') and is not on a pre-approved installer/updater path whitelist. Alert if the process's ImageHash (SHA256) matches a known-bad value from threat intelligence or is absent from a centrally managed software inventory database. Also, flag if the OriginalFileName is empty or does not match NewProcessName (e.g., NewProcessName is 'svchost.exe' but OriginalFileName is 'legit_app.exe'). Correlate by ProcessId with Zeek conn.log to flag any outbound connections within 30 seconds to destinations not on an approved IP/port whitelist.",
              "For all processes launched from user-writable directories, establish a 60-day baseline of destination Autonomous System Numbers (ASNs) and countries from correlated Zeek conn.log data. Alert if a connection is made to a rare ASN or country (e.g., in the bottom 5th percentile of frequency for that host group). Also, baseline destination port usage per host; alert if a process connects to a destination port that has not been used by that host in the last 30 days. Calculate the Jaccard similarity between the CommandLine of a new process and the set of all historical command lines for the same NewProcessName on that host. A score below 0.2 indicates a novel execution pattern warranting investigation.",
              "Develop a supervised classification model (e.g., Gradient Boosting) trained on labeled historical data. Features should include: NewProcessPath (encoded as categorical features like 'is_temp', 'is_user_dir'), CommandLine entropy, process signature status, destination IP reputation, destination port prevalence, connection duration, data volume (orig_bytes, resp_bytes), and features from Zeek pe.log such as the executable's imphash and whether it is likely packed. The model will classify each process execution/connection pair as 'benign', 'suspicious', or 'malicious'. Suspicious or malicious classifications should trigger an automated workflow to query Zeek dns.log for related domain lookups and Zeek x509.log to check for self-signed or unusual certificates associated with the connection."
            ]
          },
          {
            "description": "A process on an ICS host is created with elevated privileges, identified by Windows Event ID 4688 where the 'Token Elevation Type' is 'Type 2' ('%%1937'), indicating a full, elevated token. This event is highly suspicious if the process name (NewProcessName) and its path (NewProcessPath) do not exactly match an entry in a strictly maintained whitelist of applications authorized to run with elevated privileges in the ICS environment. Suspicion is amplified if the process is unsigned, originates from a user-writable directory, or is executed by a user account (correlated via Windows Event ID 4624) that does not typically perform administrative functions.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows-based ICS assets requiring strict change control, including Engineering Workstations, SCADA servers, Data Historians, and Domain Controllers in the process control network.",
            "action": [
              "Implement a high-priority SIEM alert for any Windows Event ID 4688 with Token Elevation Type '%%1937' where the combination of NewProcessName, NewProcessPath, and ImageHash (SHA256) does NOT exist in a tightly controlled whitelist of approved administrative tools and installers. The rule should also check the SubjectUserName and cross-reference with Active Directory to flag if a non-administrative account is executing the privileged process. This rule should have zero expected false positives in a properly configured ICS environment.",
              "For each user account, establish a 90-day baseline of the specific privileged processes (NewProcessName) they execute and the parent processes that spawn them. Alert if a user account executes a privileged process they have never run before or if an elevated process is spawned by an unusual parent (e.g., `winword.exe` instead of `explorer.exe`). Additionally, monitor the overall daily count of privileged process executions per host. Using a moving average and standard deviation (e.g., over a 14-day window), alert if the daily count exceeds the mean by more than 3 standard deviations.",
              "Employ a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) on the aggregated count of privileged executions (Token Elevation Type '%%1937') per host and per user role (e.g., 'Operator', 'Engineer'). Train the model on at least 90 days of data to learn normal operational rhythms, including maintenance windows. For each anomaly detected by the time-series model, use a secondary classification model to assign a risk score. This model's features should include the user's role, historical frequency of privileged executions by that user, CommandLine entropy, and whether the process path is in a standard system directory."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]