[
  {
    "information_requirement": "Is the adversary attempting to disable or manipulate the Safety Instrumented System (SIS)? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0880",
        "name": "Loss of Safety",
        "evidence": [
          {
            "description": "A logic file transfer (e.g., .L5X, .ACD, .PRO) to a Safety Instrumented System (SIS) PLC that meets one or more of the following conditions: occurs outside a documented maintenance window, originates from an unauthorized source IP address or user account, or utilizes a protocol other than the standard engineering protocol for that device.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4672",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek smb.log",
              "Zeek ftp.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at SIS network segment ingress/egress points; Authentication logs on Domain Controllers; File access and process execution logs on Engineering Workstations (EWS) and file servers; Network protocol logs from network sensors.",
            "action": [
              "Implement a real-time correlation rule in the SIEM that triggers an alert when network file monitoring (Zeek files.log) detects a PLC logic file extension being transferred to a destination IP within the SIS asset group, AND the source IP is not on the 'Authorized EWS' watchlist OR the event timestamp falls outside a 'Scheduled Maintenance' calendar.",
              "For each authorized EWS-to-SIS PLC communication channel, profile normal file transfer behavior using Zeek logs. Calculate 30-day rolling 99th percentile values for transfer size (from files.log 'total_bytes') and connection duration (from conn.log 'duration'). Generate a medium-severity alert if a new logic file transfer exceeds both the size and duration thresholds simultaneously, indicating a statistically anomalous update.",
              "Train and deploy a supervised anomaly detection model (e.g., Random Forest Classifier) to classify each logic file download as 'authorized' or 'malicious'. Feature engineering should include: time-of-day, day-of-week, source/destination IP, user account context, file size, connection duration, protocol used, and a binary flag for 'is_maintenance_window'. An alert is generated for any transfer classified as 'malicious' with a confidence score > 0.95."
            ]
          },
          {
            "description": "An ICS protocol command sent to an SIS PLC that is on a watchlist of safety-critical functions (e.g., 'Stop CPU', 'Write to safety memory'), originates from a host not on the authorized EWS watchlist, or contains parameter values known to place the system in an unsafe state.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at the SIS network segment; ICS protocol logs from network sensors monitoring communication to SIS PLCs; Process execution logs on HMIs and Engineering Workstations; Asset inventory database defining SIS device roles and IP addresses.",
            "action": [
              "Deploy a protocol-aware detection rule (e.g., using a Zeek script or SIEM parser) that inspects deep packet inspection logs (e.g., Zeek s7comm.log). The rule should maintain a static list of critical function codes and target memory addresses for SIS devices. An alert is triggered instantly if a command matching this list is observed originating from a source IP not on the authorized EWS watchlist.",
              "For each SIS PLC, establish a baseline of command entropy and frequency. In 5-minute intervals, calculate the Shannon entropy of observed function codes and the frequency of any 'write' or 'program' commands from Zeek protocol logs. An alert is generated if the function code entropy increases by more than 3 standard deviations from the baseline, OR if the frequency of critical commands exceeds its 99th percentile.",
              "Develop and deploy a recurrent neural network (RNN) or LSTM-based autoencoder trained on historical sequences of normal ICS command traffic for each SIS PLC. The model learns the 'grammar' of safe operations. The live command stream is fed into the model, and if the reconstruction error for a given sequence of commands exceeds a dynamically tuned threshold, it signifies a grammatical anomaly and triggers an alert for analyst review."
            ]
          },
          {
            "description": "A rate of new connection attempts, protocol errors, or total data volume directed at an SIS PLC that exceeds established operational baselines by a statistically significant margin (e.g., >3 standard deviations), and which correlates temporally with Zeek weird.log or notice.log events for that device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek weird.log",
              "Zeek packet_filter.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at the SIS network segment and IDMZ boundaries; Logs from network infrastructure (firewalls, switches) protecting the SIS; Network sensor logs (Zeek conn.log, notice.log) capturing connection state information; Performance and availability monitoring data for SIS PLCs.",
            "action": [
              "Create a SIEM rule that triggers a high-severity alert if the count of new connections from a single source IP to a single SIS PLC IP with a conn_state of 'S0', 'S1', or 'REJ' in Zeek conn.log exceeds 100 connections in a 1-minute window. Supplement this with a rule that alerts on any Zeek notice of type 'Scan::Address_Scan' or 'DoS::Excessive_Connections' where the victim IP is a member of the SIS asset group.",
              "For each SIS PLC, use a time-series database to track per-minute metrics from Zeek conn.log: total inbound bytes, count of unique source IPs, and the ratio of incomplete connections ('S0', 'S1', 'REJ') to established connections ('SF'). Generate an alert if the inbound byte count or unique source IP count exceeds its 99.9th percentile, or if the incomplete connection ratio exceeds 3 standard deviations above its 30-day rolling average.",
              "Implement a multivariate time-series anomaly detection model (e.g., Vector Autoregression) that forecasts expected traffic volume, packet counts, and protocol distribution for each SIS PLC based on at least 30 days of historical data from Zeek conn.log. The model should account for operational seasonality. An alert is triggered if the observed metrics consistently deviate from the forecasted values beyond a 99% confidence interval for more than 3 consecutive minutes."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]