[
  {
    "information_requirement": "Is an adversary using a commonly used ICS or IT port for Command and Control?",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0885",
        "name": "Commonly Used Port",
        "evidence": [
          {
            "description": "A network connection on a common ICS or IT port (e.g., TCP/502, TCP/443) has a dynamically identified application protocol in Zeek's 'service' field that does not match the expected protocol for that port, indicating protocol masquerading.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring the IT/OT boundary, ICS DMZ, and internal ICS network segments (Purdue Model Levels 1-3).",
            "action": [
              "Execute a query to filter Zeek conn.log for connections where the destination port (`id.resp_p`) is a common ICS/IT port and the identified service (`service`) does not match the expected protocol. Example rules: (`id.resp_p`=502 AND `service`!='modbus'), (`id.resp_p`=443 AND `service`!='ssl'), (`id.resp_p`=53 AND `service`!='dns'). Triage any matches for further investigation.",
              "For each source IP (`id.orig_h`) exhibiting protocol mismatches, establish a 30-day baseline of the daily count of such events. Calculate the 95th percentile of these daily counts. Generate an alert when a source IP's daily mismatch count exceeds this historical 95th percentile, indicating a statistically significant increase in this specific anomalous behavior.",
              "Deploy a supervised classification model, such as a Random Forest, trained on labeled historical conn.log data. Engineer features including `proto`, `id.resp_p`, `service`, `duration`, `orig_bytes`, `resp_bytes`, `conn_state`, and a binary feature for `port_service_match`. The model will classify each connection as 'benign' or 'malicious_protocol_mismatch'. Review high-confidence predictions by examining feature importance to understand the classification."
            ]
          },
          {
            "description": "An outbound network connection is initiated from a critical ICS asset (e.g., PLC, EWS, HMI) to an external IP address, which is not an RFC1918 address or on an approved whitelist, over a common IT or OT port.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical ICS assets including Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), and controllers on ICS network Levels 1 (Basic Control) and 2 (Supervisory Control).",
            "action": [
              "Correlate host and network data by creating a query to filter Zeek conn.log where `id.orig_h` is on a watchlist of critical ICS assets AND `id.resp_h` is a non-private, non-whitelisted IP address AND `id.resp_p` is a common port. For any match on a Windows-based asset, pivot to host logs (Windows Event ID 5156) using the timestamp and IP addresses to identify the initiating process (`Application`). Alert if the process is not on an approved application whitelist.",
              "For each critical ICS asset, establish a 14-day rolling baseline of its outbound connection behavior to external IPs. Calculate the moving average and standard deviation of the daily connection count and total data volume (`orig_bytes` + `resp_bytes`). Generate an alert if an asset's daily metrics exceed three standard deviations above its moving average, signaling an abnormal communication pattern.",
              "Apply a density-based clustering algorithm, such as HDBSCAN, to connection metadata from critical ICS assets, using features like `id.resp_h` (categorically), `id.resp_p`, `duration`, and `orig_bytes`. Normal, repetitive operational traffic will form dense clusters. Automatically flag and investigate all connections classified as noise or outliers, as these represent deviations from established communication patterns."
            ]
          },
          {
            "description": "A network connection on a common IT/OT port exhibits behavioral anomalies such as unusually long duration, high data volume, non-standard protocol artifacts, or high payload entropy compared to a historical baseline for similar communications in the ICS environment.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at the ICS DMZ, core network switches, and DNS servers within the Purdue Model Levels 2 and 3.",
            "action": [
              "Create targeted queries for protocol abuse. For DNS (port 53), search Zeek dns.log for queries with `query_length` > 255 or where the `qtype_name` is 'TXT' and the `query` field contains characteristics of encoded data. For HTTPS (port 443), search Zeek ssl.log for connections from ICS assets that use self-signed certificates or have anomalous JA3/JA3S hashes not present in a known-good baseline.",
              "For each unique 5-tuple communication flow, establish a 30-day baseline for `duration`, `orig_bytes`, and the ratio of `resp_bytes` to `orig_bytes`. Calculate the Shannon entropy of the initial payload data if available via Zeek scripts or file extraction. Generate an alert if a new connection's metrics deviate by more than three standard deviations from the historical baseline for that specific flow, indicating a behavioral outlier.",
              "Implement a time-series anomaly detection model, such as an LSTM Autoencoder, on aggregated network traffic metrics for critical OT ports (e.g., 502, 102, 20000). Feed the model with time-binned data, such as total bytes per minute and connection count per minute. The model learns the normal operational rhythm and flags time windows with high reconstruction error, which indicate a significant deviation from the learned pattern of normal industrial process communication."
            ]
          },
          {
            "description": "A non-browser process on an ICS endpoint, such as an Engineering Workstation or HMI, establishes periodic, low-volume outbound connections to the same external IP address on a common web port (e.g., 80, 443), indicative of C2 beaconing.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows-based endpoints in the ICS environment, including Engineering Workstations (EWS), HMIs, and data historians located at Purdue Model Levels 2 and 3.",
            "action": [
              "Correlate process creation with network connections by filtering Windows Event ID 4688 for new processes not on an application whitelist. For each suspicious process ID, find the corresponding network connections in Windows Event ID 5156. If a connection is made to an external IP on port 80/443, pivot to Zeek conn.log using the 5-tuple and timestamp to confirm the connection and check for threat intelligence matches on the destination IP.",
              "Group Zeek conn.log records by the 4-tuple (`id.orig_h`, `id.resp_h`, `id.resp_p`, `proto`) over 24-hour windows. For each group, calculate the time deltas between consecutive connections. Identify potential beaconing by flagging groups that have at least 5 connections, a low standard deviation of time deltas (e.g., < 5 seconds), and consistently small connection sizes (e.g., `orig_bytes` + `resp_bytes` < 2048).",
              "Train a supervised binary classification model, such as Gradient Boosting, to distinguish beaconing sessions from normal web browsing. Engineer features from connection groups (sessions), such as: standard deviation of inter-arrival times, mean and variance of packet sizes, ratio of outbound to inbound bytes, and entropy of destination IP addresses. Deploy the model to score sessions originating from ICS endpoints in near-real-time and alert on high-probability beaconing."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]