[
  {
    "information_requirement": "Has an adversary modified program logic on an ICS controller to establish persistence?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0889",
        "name": "Modify Program",
        "evidence": [
          {
            "description": "A program modification command (e.g., S7COMM 'Program Download', Modbus 'Write Multiple Registers', EtherNet/IP 'Write Tag') is observed in network traffic, and the command originates from a source IP not on the authorized Engineering Workstation (EWS) allowlist or occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors at choke points between the enterprise network (Level 4/5) and the process control network (Level 3), taps on EWS subnets (Level 3), and span ports monitoring traffic to and from critical PLCs/controllers (Level 1/2).",
            "action": [
              "Create a SIEM detection rule that triggers when a Zeek log (e.g., `s7comm.log`, `modbus.log`, `enip.log`) records a program modification function code. The rule must perform the following enrichment and correlation: 1. Extract the source IP from the corresponding `conn.log` entry. 2. Compare the source IP against a maintained allowlist of authorized EWS IPs. 3. Compare the event timestamp against a schedule of approved maintenance windows. 4. Generate an alert if the source IP is not on the allowlist OR the event occurs outside a scheduled window.",
              "For each controller IP, use a scheduled query to aggregate ICS protocol logs (e.g., `s7comm.log`) and count the number of program modification commands per hour. Calculate a 30-day rolling baseline, establishing the mean and standard deviation for the command count for each hour of the day and day of the week. Generate an alert if the current hourly count for any controller exceeds its historical baseline by more than 3 standard deviations, indicating a statistically significant burst of modification activity.",
              "Train a multivariate time-series anomaly detection model, such as an LSTM Autoencoder, on historical Zeek logs. Engineer features for each 5-minute window, including: count of modification commands, number of unique source IPs, number of unique destination PLCs, protocol used (one-hot encoded), and average payload size. The model learns the normal patterns of program modifications across the network. Deploy the model to score live traffic and generate a high-severity alert when the reconstruction error for a time window exceeds a dynamically tuned threshold, indicating activity that deviates from learned legitimate behavior."
            ]
          },
          {
            "description": "An ICS controller mode change command (e.g., S7COMM 'CPU Control' to STOP/PROGRAM, EtherNet/IP 'Set Attribute Single' to change operational mode) is observed in network traffic, and the command either originates from an unauthorized source IP or is not correlated with an approved change management ticket for the target device and time.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek dnp3.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of critical PLCs/Controllers (Level 1/2), Process Control Network (Purdue Level 2/3) monitoring points, network choke points between Level 3 and Level 2, and logs from change management systems.",
            "action": [
              "Implement a SIEM rule to detect specific controller mode change commands (e.g., to 'STOP' or 'PROGRAM') within Zeek ICS protocol logs (`s7comm.log`, `enip.log`). For each detection, the rule must execute the following logic: 1. Check if the source IP from `conn.log` is on the authorized EWS allowlist. 2. Automatically query a change management system's API or database for an approved ticket matching the controller, timestamp, and action. 3. Generate an alert if no approved ticket exists OR the source IP is unauthorized.",
              "For each critical controller, use Zeek protocol logs to calculate the total time per day it spends in a non-'RUN' state (e.g., 'STOP', 'PROGRAM'). Establish a 90-day baseline to determine the 99th percentile of this daily duration. Configure a scheduled daily job to calculate the total time spent in these states for the past 24 hours. Generate an alert if this duration exceeds the established 99th percentile threshold, indicating the controller was in a modifiable state for an unusually long period.",
              "Develop a sequence analysis model, such as a Hidden Markov Model (HMM), to learn legitimate operational sequences. Train the model on historical event sequences from Zeek logs, where a state is a tuple of (controller_IP, controller_state, source_IP_category). Example legitimate sequence: ('10.1.2.3', 'RUN', 'Auth_EWS') -> ('10.1.2.3', 'STOP', 'Auth_EWS') -> ('10.1.2.3', 'DOWNLOAD', 'Auth_EWS') -> ('10.1.2.3', 'RUN', 'Auth_EWS'). Generate an alert when an observed sequence has a low probability under the trained model, such as a state change originating from an unknown IP or a 'STOP' command that is not followed by an authorized modification and 'RUN' command within a typical timeframe."
            ]
          },
          {
            "description": "A mismatch is detected between an ICS project file and its trusted 'golden' baseline, identified by a change in file hash, size, modification timestamp, or logical content. This can be detected on an Engineering Workstation (EWS) or during network transfer.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 11 (Sysmon)",
              "Windows Event ID 23 (Sysmon)",
              "Windows Event ID 4663",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of Engineering Workstations (EWS) (Level 3), version control systems for ICS projects, centralized log servers, network file transfer inspection points (Level 3), and dedicated ICS integrity monitoring platforms.",
            "action": [
              "On EWS hosts, configure a File Integrity Monitoring (FIM) rule using Sysmon to audit for write events (Event ID 11) and delete events (Event ID 23) in directories containing critical ICS project files (e.g., `C:\\Projects\\*.ACD`, `D:\\Siemens\\*.S7P`). For any file transfer of these types detected via `Zeek files.log`, automatically compare the file's MD5/SHA256 hash against both a 'golden image' baseline and a threat intelligence feed of known-malicious hashes. Alert on any unauthorized host modification, deviation from baseline, or match to a malicious hash.",
              "For ICS project files transferred over the network and logged in `Zeek files.log`, calculate the Shannon entropy of the file's content. For each file extension (e.g., .ACD, .S7P), establish a baseline entropy range based on historical legitimate files (e.g., 95% of legitimate .ACD files have an entropy between $$4.5$$ and $$5.5$$). Generate an alert if a transferred file's entropy score is a statistical outlier (e.g., > $$7.0$$, suggesting encryption/packing, or < $$2.0$$, suggesting null-padding) for its type.",
              "Train a Random Forest classifier to distinguish between 'authorized' and 'unauthorized' modifications to ICS project files. Engineer features by correlating host logs (Sysmon, Windows Events) with network logs (Zeek). Features should include: the parent process name that wrote the file (Sysmon Event ID 1), the user account associated with the process (Event ID 4624), time of day (as a cyclical feature), file entropy (`Zeek files.log`), whether the file transfer originated from an authorized EWS IP, and a boolean for whether the modification occurred during a scheduled maintenance window. Alert when the model classifies a file modification or transfer as 'unauthorized' with a confidence score above a 95% threshold."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]