[
  {
    "information_requirement": "Is the adversary exfiltrating data using traffic duplication?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1020.001",
        "name": "Traffic Duplication",
        "evidence": [
          {
            "description": "An outbound network flow in Zeek conn.log from an internal host to an external IP or domain is observed, where the destination address or resolved domain name is present on a high-confidence threat intelligence feed with a category of 'Command and Control' or 'Exfiltration Dropzone'.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, Cloud virtual network gateways",
            "action": [
              "Implement a continuous query that joins Zeek conn.log and dns.log data. Cross-reference the destination IP ('id.resp_h') and resolved domain ('query') fields against a threat intelligence feed of known malicious infrastructure. Generate a high-severity alert upon any match.",
              "For connections to external IP addresses not seen in the last 30 days, calculate the ratio of bytes sent ('orig_bytes') to bytes received ('resp_bytes'). Flag connections where this ratio exceeds 100:1 and the total data sent is above the 95th percentile for all connections to newly observed IPs, suggesting one-way data transfer.",
              "Deploy a pre-trained domain generation algorithm (DGA) classifier model. Ingest all domain queries from Zeek dns.log and apply the model to score each domain's likelihood of being algorithmically generated. Escalate domains with a score above a 0.9 confidence threshold for analyst review, as these are likely C2 domains not yet on threat feeds."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) on a network management host contains command-line arguments for traffic mirroring configuration, OR an encapsulated traffic flow (e.g., GRE/ERSPAN) is observed in Zeek conn.log directed to an external destination not on a pre-defined allowlist of authorized network monitoring partners.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management servers, Core switches/routers, Virtual network control planes (Cloud)",
            "action": [
              "Create a SIEM rule to monitor Windows Event ID 4688 on hosts tagged as 'Network Management'. Alert on any process creation where the command line contains keywords such as 'monitor session', 'port-mirroring', 'span', 'erspan', 'gre', 'vTap', or 'create-traffic-mirror'.",
              "Maintain an allowlist of approved destination IPs for encapsulated traffic (IP protocol 47 for GRE). For all observed GRE traffic in Zeek conn.log, establish a baseline of legitimate source-destination pairs. Alert when a new flow appears where the destination is an external IP not on the allowlist, especially if the flow's duration or volume exceeds the 95th percentile of historical encapsulated traffic.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) on sequences of commands executed by network administrators. Ingest command history from Windows Event ID 4688 logs and flag any administrative session containing a sequence of commands with a high anomaly score, indicating a deviation from normal administrative workflows that could include configuring illicit traffic duplication."
            ]
          },
          {
            "description": "An outbound network flow in Zeek conn.log shows a total data volume (orig_bytes) from a single internal source to a single external destination that exceeds a dynamically calculated historical baseline (e.g., 3 standard deviations above the 30-day mean) for that specific source host or its subnet.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Server subnets, User workstation subnets, Database server segments",
            "action": [
              "Define a static threshold rule that alerts when any single connection from a standard user workstation subnet to an external IP address exceeds a hard limit of 1 GB. This rule serves as a high-volume tripwire for egregious data transfers.",
              "For each internal source IP, calculate a rolling 30-day baseline of daily outbound data volume (sum of 'orig_bytes' in Zeek conn.log per day). Generate an alert if the daily volume for a host exceeds its historical mean by more than 3 standard deviations, indicating a statistically significant increase in data transfer.",
              "Implement a time-series forecasting model (e.g., ARIMA) for the aggregate outbound traffic volume of critical network segments, such as database server subnets. Generate an alert when the observed traffic volume significantly deviates from the forecasted volume's 99% confidence interval, indicating an unexpected event consistent with large-scale exfiltration."
            ]
          },
          {
            "description": "A high-volume outbound network connection in Zeek conn.log is associated with a Zeek 'weird' log entry (e.g., 'inappropriate_FIN', 'data_before_established'), or DNS traffic associated with the flow exhibits an abnormally high Shannon entropy score in the queried domain name, indicating potential algorithmic generation or tunneling.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Application servers, DNS resolvers",
            "action": [
              "Create a correlation rule to alert on any event logged in Zeek's weird.log that is associated with an outbound connection from Zeek conn.log where the total bytes sent ('orig_bytes') exceeds 100MB. Focus on notices like 'inappropriate_FIN', 'possible_split_routing', and 'data_before_established'.",
              "For each DNS request in Zeek dns.log, calculate the Shannon entropy of the queried domain name ('query' field). Establish a baseline of entropy scores across the enterprise. Flag any query where the entropy score exceeds the 98th percentile of all observed values, as this indicates a high degree of randomness common in DGA-based C2.",
              "Train a supervised classification model (e.g., Random Forest) to distinguish between legitimate encrypted traffic (like TLS) and obfuscated or tunneled data. Use features from Zeek conn.log such as connection state, byte counts, packet size distribution, and inter-arrival times. Score all outbound traffic and alert on connections classified as 'obfuscated' with high confidence."
            ]
          },
          {
            "description": "A successful login (Windows Event ID 4624) to a critical network management host is identified as anomalous based on source IP, time of day, or user history, and is followed within a 15-minute window by a high-volume, long-duration outbound network flow (Zeek conn.log) originating from the network segment managed by that host.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory), Network management servers, VPN concentrators, Network egress points",
            "action": [
              "Create a correlation rule that triggers when a successful administrative login (Event ID 4624) is preceded by a failed login (Event ID 4625) from the same source IP within 5 minutes, and this is followed within 15 minutes by the execution of a process on the same host containing a mirroring-related keyword (e.g., 'port-mirror', 'erspan').",
              "For each administrative user account, build a statistical profile of normal login behavior (typical hours, source subnets/countries, session durations). Assign a risk score to each login based on deviations from this profile. If a login's risk score exceeds a defined threshold, monitor for any subsequent outbound connections from related network segments that are statistical outliers in terms of volume or duration.",
              "Construct a graph model where nodes represent users, hosts, and external IPs. Create edges for 'logs into' and 'sends traffic to'. Use a graph-based anomaly detection algorithm to identify unusual paths, such as a user logging into a network device for the first time, followed immediately by that device initiating a large data transfer to a previously unknown external IP address."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]