[
  {
    "information_requirement": "Is the adversary executing commands or payloads using Windows Management Instrumentation (WMI)?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1047",
        "name": "Windows Management Instrumentation",
        "evidence": [
          {
            "description": "A command-line argument for wmic.exe or a PowerShell script block containing WMI cmdlets exhibits characteristics of malicious execution, such as known malicious strings, obfuscation patterns, or high character entropy.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Windows PowerShell Event ID 4103"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Create a rule to scan process command-line arguments (Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104) for regular expressions or strings matching known malicious WMI usage, such as 'wmic.exe shadowcopy delete', 'process call create', or PowerShell commands containing obfuscation flags like '-e', '-enc', or '-EncodedCommand'.",
              "Statistical: Calculate the Shannon entropy for the command line arguments of all wmic.exe processes and for the script block content of all PowerShell WMI cmdlets (e.g., Get-WmiObject, Invoke-WmiMethod). Establish a host-specific baseline and alert on any command whose entropy score exceeds the 95th percentile or is more than 3 standard deviations above the mean for that host, indicating probable obfuscation.",
              "Machine Learning: Deploy a pre-trained logistic regression classifier to score new WMI-related command lines in near real-time. Features for the model should include command length, character distribution, Shannon entropy, and the presence of keywords such as 'Create', 'Invoke', '-enc', 'shadowcopy', 'Win32_Process', and 'Invoke-Expression'. Alert on commands with a high malicious probability score."
            ]
          },
          {
            "description": "An invocation of a sensitive WMI class and method combination known to be abused for execution, persistence, or defense evasion is observed in WMI activity logs or command line arguments. This includes Win32_Process.Create, Win32_ShadowCopy.Delete, or the creation of a persistent WMI event subscription via __EventFilter and __FilterToConsumerBinding.",
            "data_sources": [
              "Microsoft-Windows-WMI-Activity/Operational Event ID 5861",
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, Management Servers",
            "action": [
              "Symbolic: Create a high-severity alert for any WMI activity log (Microsoft-Windows-WMI-Activity/Operational Event ID 5861) showing the creation of a '__FilterToConsumerBinding' instance that links an '__EventFilter' to an 'ActiveScriptEventConsumer' or 'CommandLineEventConsumer'. Additionally, alert on command lines explicitly calling 'Win32_Process.Create' or 'Win32_ShadowCopy.Delete'.",
              "Statistical: For each host and user, establish a baseline of normal WMI class and method usage by calculating the frequency of each (class, method) pair from WMI activity logs. Alert when a pair is observed that is statistically rare for that entity (e.g., in the bottom 1% of historical usage) or across the entire enterprise (e.g., observed on fewer than 0.5% of endpoints).",
              "Machine Learning: Deploy an unsupervised autoencoder model trained on sequences of WMI class and method calls derived from normal system and administrative activity. Flag any sequence of WMI calls that results in a high reconstruction error, as this indicates a deviation from learned normal behavior and could represent a novel malicious pattern."
            ]
          },
          {
            "description": "Network traffic on WMI-related ports (TCP/135 for DCOM/RPC, TCP/5985-5986 for WinRM) is observed between hosts where no such communication baseline exists, such as workstation-to-workstation traffic, or shows anomalous volume or temporal patterns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Core Network Switches, Server VLANs",
            "action": [
              "Symbolic: Maintain an allow-list of approved management servers (e.g., SCCM, monitoring tools) and their expected communication partners. Generate an alert for any network connection in Zeek conn.log on destination ports 135, 5985, or 5986 where the source-destination pair is not on the allow-list, with high severity for any workstation-to-workstation connections.",
              "Statistical: For each network segment and for key servers, model the expected byte volume and connection count for WMI-related ports using a time series forecast (e.g., SARIMA) on Zeek conn.log data. Alert when the observed traffic in a 5-minute interval exceeds the 99th percentile of the forecasted value, indicating a potential lateral movement sweep or data transfer.",
              "Machine Learning: Employ a graph-based anomaly detection model where hosts are nodes and WMI connections are time-weighted edges. Identify anomalies by detecting the formation of new edges between previously disconnected host communities (e.g., a host in the development VLAN connecting to a host in the finance VLAN), or a sudden, significant increase in a node's centrality score, suggesting it is being used as a pivot point for lateral movement."
            ]
          },
          {
            "description": "A successful remote network logon (Windows Event ID 4624, Logon Type 3) from a source IP is immediately followed, within a short time window, by WMI-based process execution on the target host, originating from the same source IP.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (Domain Controllers), High-Value Servers, Endpoint Subnets",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a successful 'Logon Type 3' (Windows Event ID 4624) is followed within 5 minutes by a WMI-driven process creation (Windows Event ID 4688 or 4104) on the same destination host, where the Source Network Address in the logon event matches the remote source in the WMI command (e.g., wmic /node:<IP>). Escalate if the source IP is not an approved management server.",
              "Statistical: For each user account, build a profile of normal remote WMI usage by tracking common source/destination host pairs and logon times from correlated log data. Use the interquartile range (IQR) method to define normal behavior. Alert when a remote WMI session involves a source or destination host that is an outlier (e.g., > 1.5 * IQR from the quartile) or occurs at a statistically anomalous time for that user.",
              "Machine Learning: Apply a clustering algorithm like DBSCAN to historical remote WMI sessions, using features such as source IP geolocation, destination hostname, user account role, and time of day. Classify new sessions against the resulting clusters of normal activity. Flag any session that is classified as noise (i.e., does not belong to any established cluster) as a high-confidence anomaly requiring investigation."
            ]
          },
          {
            "description": "A WMI execution process (wmic.exe) or a script host executing WMI commands (powershell.exe) is spawned by a parent process that is not a standard administrative tool, interactive shell, or scheduled task (e.g., parent is WINWORD.EXE, OUTLOOK.EXE, or a web browser).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Create a detection rule that alerts whenever the Parent Process Name for 'wmic.exe' or 'powershell.exe' (when the command line contains WMI cmdlets) is not on a strict allow-list of expected parents (e.g., 'cmd.exe', 'explorer.exe', 'services.exe', 'taskeng.exe', 'mmc.exe'). Assign a critical severity if the parent process is an Office application, web browser, or PDF reader.",
              "Statistical: Analyze historical parent-child process data (Windows Event ID 4688) to establish a baseline of common process lineages involving WMI. Calculate the conditional probability of a WMI-related child process given a specific parent process across the enterprise. Alert when a parent-child pair is observed that has a historically low probability (e.g., <0.01%), indicating a rare and suspicious execution chain.",
              "Machine Learning: Deploy a pre-trained random forest classifier to predict whether a parent-child process relationship involving WMI is malicious. Use features such as parent process name, parent process path, integrity level, child process command line content, and user context. Classify new process creation events in real-time and alert on those predicted to be malicious with a high confidence score."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]