[
  {
    "information_requirement": "Is an adversary exfiltrating data from the network over an encrypted, non-C2 channel? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048.002",
        "name": "Exfiltration Over Asymmetric Encrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "An outbound encrypted connection (TLS/SSL) is established with an external destination IP address or domain known to be associated with malicious activity or data exfiltration services, as defined by a threat intelligence source.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Internal DNS Resolvers, Outbound Web Proxies",
            "action": [
              "Symbolic: Join Zeek conn.log, dns.log, and ssl.log data on UID. Correlate the destination IP (`id.resp_h`), requested domain (`query`), and Server Name Indication (`server_name`) against a threat intelligence feed of known malicious indicators. Generate an alert upon a match.",
              "Statistical: Calculate the frequency of connections to newly observed domains or IPs across the enterprise. Flag destinations that are rare (e.g., contacted by <1% of hosts) and correlate with high outbound byte counts (`orig_bytes` in conn.log). Alert if a rare destination receives data in the top 5th percentile of all outbound transfers.",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on features from Zeek logs (JA3/JA3S hash, certificate details, connection stats) and threat intel labels (malicious/benign) to predict the likelihood of a new connection being malicious. Alert on connections classified as malicious with high confidence."
            ]
          },
          {
            "description": "An outbound encrypted connection uses a TLS certificate with objectively suspicious attributes (e.g., self-signed, validity period less than 90 days, low-entropy subject/issuer name), and is associated with a high-volume data transfer where outbound bytes significantly exceed inbound bytes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Endpoints initiating TLS traffic",
            "action": [
              "Symbolic: Filter Zeek ssl.log for connections where `validation_status` is 'self-signed certificate' or `validation_status` contains 'error'. Join with conn.log on UID and alert if `orig_bytes` exceeds a static threshold (e.g., 10MB).",
              "Statistical: For each TLS connection, calculate an anomaly score. Increment the score for self-signed status, low-entropy subject/issuer names (using Shannon entropy), and short validity duration. Alert on connections where the score exceeds the 98th percentile of all outbound TLS connections and the `orig_bytes` to `resp_bytes` ratio is greater than 10:1.",
              "Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on a feature set derived from Zeek ssl.log, including certificate validity duration, public key length, and categorical features for issuer and subject. Flag connections identified as outliers by the model, especially when correlated with high outbound byte counts from conn.log."
            ]
          },
          {
            "description": "The total volume of outbound data from a single host to a single external destination over an encrypted protocol exceeds the host's established 30-day baseline by a statistically significant margin (e.g., > 3 standard deviations).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, High-Value Asset Servers, User Workstations",
            "action": [
              "Symbolic: From Zeek conn.log, filter for outbound connections where `orig_bytes` exceeds a large static threshold (e.g., 500MB) in a single session. Exclude connections to known, sanctioned large-file-transfer services (e.g., corporate cloud storage). Alert on all others.",
              "Statistical: For each internal host, calculate a daily rolling baseline (mean and standard deviation) of total outbound bytes (`orig_bytes`) per destination over the last 30 days. Alert if the daily outbound volume to any single destination exceeds 3 standard deviations above the mean for that host-destination pair.",
              "Machine Learning: Apply a time series forecasting model (e.g., ARIMA or Prophet) to each host's aggregate daily outbound data volume. Generate an alert when the observed volume significantly exceeds the model's predicted volume (i.e., falls outside the forecast's 95% confidence interval), indicating a sudden, unpredicted spike in data transfer."
            ]
          },
          {
            "description": "An encrypted connection shows a highly asymmetric data flow, where the volume of outbound data is an order of magnitude greater than inbound data (e.g., a 20:1 ratio), which is uncharacteristic of normal interactive sessions like web browsing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Symbolic: From Zeek conn.log, filter for completed connections where `resp_bytes` > 0, `orig_bytes` > 1MB, and the ratio of (`orig_bytes` / `resp_bytes`) is greater than 50. Alert on matching connections.",
              "Statistical: For all outbound encrypted connections with `resp_bytes` > 0, calculate the ratio of `orig_bytes / resp_bytes`. Establish a percentile-based baseline of this ratio for different services (identified by `service` or `id.resp_p` in conn.log). Flag any connection where the ratio exceeds the 99th percentile for its observed service or for all traffic if the service is unknown.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection features from Zeek conn.log, including `duration`, `orig_bytes`, `resp_bytes`, and the byte ratio. Identify and investigate clusters characterized by high `orig_bytes`, low `resp_bytes`, and short `duration`, as these are indicative of data dumping behavior."
            ]
          },
          {
            "description": "A process that is not on an approved application allowlist, is running from a non-standard directory (e.g., C:\\Users\\*\\AppData\\Local\\Temp\\*), or is a dual-use tool (e.g., powershell.exe) initiates an outbound encrypted connection involving a large data upload.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Servers, Domain Controllers",
            "action": [
              "Symbolic: Using host and time-based correlation in a SIEM, link Zeek conn.log entries to process execution events (Windows Event ID 4688/Sysmon Event ID 1). Alert if the process name (`powershell.exe`, `certutil.exe`) or executable path (`C:\\Windows\\Temp\\*`) is on a watchlist and the associated connection's `orig_bytes` in conn.log exceeds a 5MB threshold.",
              "Statistical: Correlate processes (Sysmon Event ID 1) to their network connections (Sysmon Event ID 3). Build a frequency table of all network-communicating parent-child process relationships across the enterprise. Alert when a statistically rare parent-child process pair (e.g., `winword.exe` spawning `powershell.exe`) initiates an outbound encrypted connection where the `orig_bytes` value is in the top 5th percentile of all outbound connections.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) on process command-line arguments (using features like argument count, length, and entropy from Sysmon Event ID 1) to identify suspicious commands. If a process execution is flagged as suspicious by the model and is correlated with a network connection in Zeek conn.log exhibiting a high outbound-to-inbound byte ratio, generate a high-priority alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]