[
  {
    "information_requirement": "Is the adversary using publish-subscribe protocols for command and control? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1071.005",
        "name": "Publish-Subscribe Protocols",
        "evidence": [
          {
            "description": "An internal host establishes a network connection using a pub/sub protocol (e.g., MQTT, XMPP, AMQP) to an external IP address or domain present on a high-confidence threat intelligence feed of known C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek mqtt.log",
              "Zeek xmpp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise network egress points (e.g., firewalls, proxies); Internal DNS resolvers",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log on `id.resp_h`) and DNS query logs (Zeek dns.log on `answers`) with a high-confidence CTI feed of known malicious IPs and domains. Generate a high-priority alert for any connection on a common pub/sub port (e.g., 1883, 8883, 5222, 5269) where the destination IP or resolved domain matches the CTI feed.",
              "Statistical: For pub/sub traffic matching CTI, aggregate the count of unique source-destination pairs per hour. Establish a 90-day baseline of this metric. Generate a medium-priority alert if the hourly count exceeds the 95th percentile, which may indicate a widespread C2 campaign deployment.",
              "Machine Learning: Train a logistic regression model to classify pub/sub connections as malicious or benign. Feature engineer using CTI match (binary), destination ASN reputation, connection duration, total bytes transferred, and protocol-specific metadata (e.g., presence of MQTT). Score all new pub/sub connections and flag those with a probability greater than 0.8 of being malicious for analyst review."
            ]
          },
          {
            "description": "Pub/sub protocol metadata (e.g., MQTT topic, client_id; XMPP JID) contains strings or patterns that match signatures of known malware families or attack tools.",
            "data_sources": [
              "Zeek mqtt.log",
              "Zeek xmpp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors with application layer visibility (e.g., Zeek sensors); Internal or cloud-hosted message brokers",
            "action": [
              "Symbolic: Apply regular expression or Yara rules against pub/sub metadata fields (e.g., `topic`, `client_id`, `username` in Zeek mqtt.log). Rules should search for patterns indicative of C2, such as long hexadecimal strings, GUIDs, base64 encoded strings, or hardcoded values identified from malware analysis. Generate an alert on any match.",
              "Statistical: For each pub/sub session, calculate the Shannon entropy of metadata fields like `topic` and `client_id`. Establish a baseline entropy value for legitimate traffic within the environment. Alert if the entropy of a new session's metadata exceeds the 98th percentile of the established baseline, suggesting auto-generated C2 values.",
              "Machine Learning: Train a one-class SVM or isolation forest model on features derived from legitimate pub/sub metadata (e.g., string length, character distribution, n-gram frequency of `topic` and `client_id` fields). Use the trained model to score new sessions, flagging any that are classified as outliers for further investigation."
            ]
          },
          {
            "description": "An internal host's pub/sub traffic profile deviates from its own historical baseline or the baseline of its peer group in terms of data volume (orig_bytes/resp_bytes), connection duration, or connection frequency.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek mqtt.log",
              "Zeek xmpp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Host network interfaces; Network segment gateways; Enterprise network egress points",
            "action": [
              "Symbolic: Create static threshold alerts for egregious outliers. For example, trigger an alert if a single pub/sub connection (identified by port in Zeek conn.log) has a `duration` greater than 24 hours, or if a non-server host initiates more than 1,000 pub/sub connections in one hour.",
              "Statistical: For each host, establish a 30-day rolling baseline of its pub/sub traffic profile, including daily connection count, total data volume (`orig_bytes` + `resp_bytes`), and mean connection `duration`. Generate an alert if any of these daily metrics for a host exceeds the 99th percentile of its own historical profile.",
              "Machine Learning: Use a time series forecasting model (e.g., Prophet, ARIMA) on each host's hourly total pub/sub data volume. Generate an alert when the observed volume significantly deviates from the forecasted value's confidence interval. Concurrently, use a clustering algorithm (e.g., k-means) to group hosts with similar roles and traffic patterns and flag hosts that become outliers within their cluster."
            ]
          },
          {
            "description": "An internal host initiates a pub/sub connection to an external domain or IP address that is not on an established allow-list of known-good brokers and exhibits suspicious characteristics such as recent registration (e.g., < 30 days old) or a low reputation score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers; Enterprise network egress points; Endpoint devices",
            "action": [
              "Symbolic: Maintain an organizational allow-list of approved external pub/sub broker domains and IPs. Correlate Zeek conn.log (filtered by pub/sub ports) with this list. Generate an alert for any connection to a destination not on the allow-list and enrich the alert with the initiating process name from Windows Event ID 4688.",
              "Statistical: For all external pub/sub destinations not on the allow-list, calculate their prevalence (the number of unique internal hosts connecting to them) over a 30-day period. Flag destinations in the bottom 5th percentile of prevalence (rare destinations) for enrichment with domain age and reputation data. A recently registered, low-prevalence domain is highly suspicious.",
              "Machine Learning: Apply a clustering algorithm (e.g., DBSCAN) to all non-allow-listed pub/sub connections. Use features such as destination ASN, destination country, data volume patterns, and connection duration. Investigate small, isolated clusters or noise points (outliers) as these often represent targeted C2 infrastructure rather than legitimate, widespread services."
            ]
          },
          {
            "description": "A host utilizes an MQTT or XMPP topic that is statistically rare for that host or the organization, has high character-level entropy, or is new to the host's established topic profile.",
            "data_sources": [
              "Zeek mqtt.log",
              "Zeek xmpp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors with application layer visibility; Internal hosts generating pub/sub traffic; Message broker servers",
            "action": [
              "Symbolic: Scan `topic` fields in Zeek mqtt.log for suspicious substrings that may indicate command execution, file transfer, or reconnaissance (e.g., 'cmd', 'exec', 'shell', 'run', 'upload', 'download', 'whoami'). Generate a high-priority alert on any match.",
              "Statistical: For each host, maintain a historical set of unique topics used and alert when a host uses a topic for the first time. Separately, calculate the Shannon entropy of all topic strings across the organization and alert if a topic's entropy exceeds a high threshold (e.g., > 4.5) or is in the 99th percentile, suggesting algorithmic generation.",
              "Machine Learning: Apply Natural Language Processing (NLP) topic modeling (e.g., Latent Dirichlet Allocation) to the entire corpus of organizational pub/sub topic names to discover legitimate 'themes' of communication. Score new topics based on their probability of belonging to an established theme and flag topics with a very low probability score as anomalous."
            ]
          },
          {
            "description": "A temporal correlation is observed on a host where a network connection using a pub/sub protocol is immediately followed by a high-risk process execution event (e.g., PowerShell, rundll32.exe, or an executable in a non-standard path).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek mqtt.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers); Domain Controllers",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when a network connection event from Zeek conn.log involving a pub/sub port is followed within a 30-second window by a process creation event (Windows Event ID 4688) on the same host for a suspicious process (e.g., 'powershell.exe', 'cmd.exe') or a process running from an unusual directory (e.g., %TEMP%).",
              "Statistical: For each host, calculate the daily rate of correlated pub/sub-to-process-execution events as defined in the symbolic rule. Establish a 30-day baseline for this rate. Alert if the daily rate for a host exceeds the 99th percentile of its own historical data, indicating an unusual increase in this suspicious behavior.",
              "Machine Learning: Train a supervised learning classifier (e.g., Random Forest) to score the risk of a process execution event that is temporally correlated with inbound pub/sub traffic. Features should include: time delta, destination IP reputation, process name, parent process name, and command-line arguments. Deploy the model to score these correlated event pairs in real-time."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]