[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by deleting files to cover their tracks? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.004",
        "name": "File Deletion",
        "evidence": [
          {
            "description": "A file deletion event (Windows Event ID 4663) occurs for a file whose hash is present on a high-confidence threat intelligence feed of malicious indicators.",
            "data_sources": [
              "Windows Event ID 4663",
              "EDR file monitoring logs",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Query for file deletion events (Windows Event ID 4663) and extract the file hash. Cross-reference this hash against a curated list of known malicious file hashes from a threat intelligence platform. Generate a high-severity alert for any match.",
              "Statistical: For each deletion event matching a malicious hash, calculate the prevalence of the parent process (from Event ID 4663) across all endpoints over the last 30 days. Assign a risk score inversely proportional to the process prevalence (e.g., score = 1 / prevalence). Alert on any deletion where the risk score exceeds the 99th percentile for all deletion events.",
              "Machine Learning: Deploy a pre-trained classification model (e.g., Gradient Boosting) that takes a file deletion event as input. Use features such as: file hash threat intelligence match (boolean), parent process prevalence (float), file path entropy (float), and time between file creation and deletion (integer, in seconds). An output probability score > 0.9 triggers an alert for manual review."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) is logged containing a command line that invokes a known secure deletion utility (e.g., sdelete.exe) or a native command with parameters used for anti-forensic purposes (e.g., cipher.exe /w:, wevtutil.exe cl).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688) for command lines containing case-insensitive strings like 'sdelete', 'cipher /w:', 'wevtutil cl', 'del *.log', or 'del *.evtx'. Generate an alert for any match, noting the parent process and user context.",
              "Statistical: For each host, compute a 30-day rolling baseline (mean and standard deviation) of the daily count of deletion-related command executions (`del`, `rm`, `sdelete.exe`). Alert when the daily count for a host exceeds its baseline by more than 3 standard deviations (Z-score > 3).",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the hourly frequency of process creations for `wevtutil.exe`, `cipher.exe`, and `sdelete.exe` across the enterprise. The model should identify and alert on significant, unexpected spikes in usage that deviate from established patterns of administrative activity."
            ]
          },
          {
            "description": "On a single host, a file creation event is followed by a process creation event from that file's path, which is then followed by a deletion event for the same file, all within a short time window (e.g., less than 5 minutes).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "EDR file creation logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Staging Servers, Public-facing Web Servers",
            "action": [
              "Symbolic: Using a SIEM, create a correlation rule that joins events by hostname and file path. Trigger an alert when a process creation event (Windows Event ID 4688) for a specific file is followed by a file deletion event (Windows Event ID 4663) for the same file within a 5-minute window. Prioritize alerts where the initial process's parent is `powershell.exe`, `cmd.exe`, `wscript.exe`, `cscript.exe`, or a web browser.",
              "Statistical: For every identified 'execute-then-delete' sequence, calculate the time delta between the execution and deletion. Flag any sequence where the delta is in the lowest 5th percentile (fastest deletions). Further score the event by the rarity of the parent process across the environment, alerting on the top 2% of combined scores.",
              "Machine Learning: Utilize a sequence analysis model (e.g., LSTM Autoencoder) trained on streams of host events (process creation, file deletion, network connections). The model learns normal sequences of activity for different host roles. Flag any sequence containing the 'execute-delete' pattern that the model reconstructs with a high error, indicating it's a deviation from learned normal behavior."
            ]
          },
          {
            "description": "A single process ID or user account generates a volume of file deletion events (Windows Event ID 4663) that is statistically anomalous compared to its established baseline, particularly when the deleted files have extensions associated with logs or forensic evidence (e.g., .log, .evtx, .bak, .history).",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, User Workstations, Domain Controllers, Log Aggregation Servers",
            "action": [
              "Symbolic: Query for file deletion events (Windows Event ID 4663) and aggregate by Process ID over a 5-minute time window. Generate an alert if the count exceeds 500 and the file paths match patterns such as `*.log`, `*.evtx`, or `*history*`.",
              "Statistical: For each user, calculate the Shannon entropy of file extensions deleted per hour based on Event ID 4663 logs. Establish a 14-day rolling average for this entropy score. Alert if the hourly entropy drops by more than 50% from the user's average, indicating a shift from varied, normal deletions to targeted deletions of specific file types.",
              "Machine Learning: Use a clustering algorithm like DBSCAN on file deletion events, with features like user account, parent process, and file path directory. The algorithm will group routine deletions (e.g., temp file cleanup by `svchost.exe`). Any deletions that do not fall into a known 'normal' cluster are flagged as anomalous for analyst review."
            ]
          },
          {
            "description": "A file identified as an executable in network traffic logs (e.g., Zeek files.log with mime_type of 'application/x-dosexec') is downloaded to a host, and a corresponding file deletion event (Windows Event ID 4663) for that same file path is observed on the host within a short timeframe (e.g., less than 1 hour).",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, DNS Servers, User Workstations, Web Proxies",
            "action": [
              "Symbolic: Join Zeek `files.log` (where mime_type is 'application/x-dosexec' or 'application/octet-stream') with Windows Event ID 4663 on destination IP and filename. Generate an alert if the timestamp of the deletion event is within 1 hour of the timestamp of the download event.",
              "Statistical: For all downloaded executables, calculate the lifespan (deletion time - download time). Create a distribution of these lifespans. Alert on any downloaded executable whose lifespan is in the bottom 5th percentile. Additionally, query Zeek `dns.log` to find the prevalence of the source domain; increase the alert severity if the domain is in the bottom 10% of all requested domains.",
              "Machine Learning: Construct a graph database where nodes are IPs, domains, file hashes, hosts, and processes, and edges are actions (download, execute, delete). Use a graph neural network (GNN) to learn embeddings for subgraphs. A trained model can then classify new subgraphs representing the 'download-delete' sequence as malicious or benign based on learned patterns of features like IP reputation, domain age, and process lineage."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]