[
  {
    "information_requirement": "Is the adversary using file transfer protocols (FTP, SMB, TFTP) for command and control communications? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1071.002",
        "name": "File Transfer Protocols",
        "evidence": [
          {
            "description": "A successful network connection using FTP (TCP/21), SMB (TCP/445), or TFTP (UDP/69) is established between an internal host and an external IP address or domain present on a high-confidence C2 threat intelligence list.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log",
              "Zeek dns.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway Firewalls, DNS Resolvers, Network Egress Points, Cloud Access Security Brokers (CASB)",
            "action": [
              "Symbolic: Ingest a high-confidence threat intelligence feed of known C2 servers. Create a rule to continuously monitor Zeek conn.log for connections where `id.resp_p` is 21, 445, or 69, the destination IP `id.resp_h` is external, and `id.resp_h` matches an IP in the intelligence feed. Generate a high-priority alert for any match.",
              "Statistical: From Zeek dns.log, correlate DNS queries with subsequent FTP/SMB/TFTP connections in conn.log. For each external domain contacted, calculate its enterprise-wide prevalence (number of unique internal hosts contacting it) and age. Flag connections to domains that are both low-prevalence (e.g., seen by < 0.1% of hosts) and newly registered (e.g., age < 60 days).",
              "Machine Learning: Train a supervised classification model (e.g., XGBoost, Random Forest) to predict if a connection is malicious. Use features from Zeek conn.log and dns.log, including destination IP reputation, ASN information, domain age, DNS query type, country code, and connection duration. Promote connections with a probability score above a tuned threshold (e.g., > 0.90) for immediate investigation."
            ]
          },
          {
            "description": "A sequence of FTP commands, SMB file/share access patterns, or TFTP read/write requests matches the known operational signature of a C2 framework or malware family, such as staging a payload and then executing it.",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek smb_files.log",
              "Zeek smb_mapping.log",
              "Zeek smb_cmds.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal File Servers, Domain Controllers, Endpoint Workstations, Network Segments with high-value assets",
            "action": [
              "Symbolic: Implement a detection rule that looks for a specific sequence of actions within a short time window, such as an SMB write to a sensitive share (e.g., ADMIN$, C$) followed by a remote service creation event, or an FTP 'PUT' of a temporary file followed immediately by a 'RNTO' (rename) to an executable extension.",
              "Statistical: For each user, establish a 30-day baseline of their typical FTP command distribution (e.g., % PUT, % GET, % DELE) and SMB share access patterns. Use a Chi-squared test to compare a user's daily activity against their historical baseline and their peer group's baseline. A significant deviation (e.g., p-value < 0.01) indicates anomalous behavior.",
              "Machine Learning: Train a sequence-based anomaly detection model (e.g., a Long Short-Term Memory Autoencoder) on legitimate sequences of FTP and SMB commands extracted from Zeek logs. Apply the model to new command sequences in real-time, flagging sessions with a high reconstruction error, which indicates a deviation from learned normal patterns."
            ]
          },
          {
            "description": "The ratio of bytes sent to bytes received for an FTP, SMB, or TFTP session to an external destination significantly deviates from the established baseline, or the total data volume exceeds the 99th percentile for that host or protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Core Network Switches, Endpoint Network Interfaces, VPN Concentrators",
            "action": [
              "Symbolic: Create a rule to alert when `orig_bytes` is greater than `resp_bytes` by a factor of 20 for any single SMB, FTP, or TFTP connection to an external destination in Zeek conn.log, where the destination is not on an approved allowlist of backup or file-sharing services.",
              "Statistical: For each host, compute a 30-day rolling baseline of the mean and standard deviation for daily data volume (sent and received) and the send/receive ratio over file transfer protocols. Use Z-scores to identify any day where a host's traffic volume or ratio exceeds 3 standard deviations from its own historical mean.",
              "Machine Learning: For each host and protocol (FTP, SMB, TFTP), implement a time series anomaly detection model (e.g., Prophet or ARIMA) to forecast expected traffic volume. The model should account for weekly and daily seasonality. Flag any observed traffic volume that falls outside the 99% prediction confidence interval as a potential C2 data transfer."
            ]
          },
          {
            "description": "An internal host establishes repeated FTP, SMB, or TFTP connections to the same external destination with a low standard deviation in the time interval between connections (low jitter), which is characteristic of automated C2 beaconing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points, Firewall and Proxy Servers, DNS sinkholes",
            "action": [
              "Symbolic: Create a rule to alert when a single source host (`id.orig_h`) connects to the same external destination (`id.resp_h`) on ports 21, 69, or 445 more than 10 times in 5 minutes, with each connection lasting less than 10 seconds.",
              "Statistical: For each unique source-destination-port triplet, calculate the time deltas between consecutive connections over a 24-hour window. Compute the standard deviation of these deltas. A standard deviation below a small threshold (e.g., < 3 seconds) combined with a low destination prevalence across the enterprise indicates highly periodic, suspicious beaconing.",
              "Machine Learning: Use a clustering algorithm like DBSCAN on connection metadata from Zeek conn.log. Use features such as destination IP, destination port, connection duration, bytes sent, bytes received, and the standard deviation of inter-arrival times. Isolate and investigate small, dense clusters that do not correspond to known legitimate services, as these often represent C2 beaconing."
            ]
          },
          {
            "description": "A network connection over FTP/SMB/TFTP ports is initiated by a process not typically associated with file transfers (e.g., powershell.exe, svchost.exe running from a user context, rundll32.exe) or from a non-standard file path (e.g., C:\\Users\\user\\AppData\\Local\\Temp\\).",
            "data_sources": [
              "Sysmon Event ID 3",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations and Servers), Domain Controllers, Application Servers",
            "action": [
              "Symbolic: Correlate Sysmon Event ID 3 (Network Connection) with process creation logs (Windows Event ID 4688). Alert if a process initiating a connection on port 21, 69, or 445 has a name on a watchlist (e.g., `powershell.exe`, `wscript.exe`), is unsigned, or is running from a user-writable directory like `%APPDATA%`.",
              "Statistical: Build a baseline of all processes that legitimately initiate outbound FTP/SMB/TFTP connections in your environment. Calculate the prevalence of each process performing this action. Flag any process that is a statistical outlier (e.g., a process that has never been observed making such a connection before, or is in the bottom 1% of prevalence).",
              "Machine Learning: Develop a classification model to score the maliciousness of a process-network event. Features should include process name, command line arguments, parent process name, process integrity level, code signature status, file path, and network connection details (destination IP, port, reputation). Flag events with a high maliciousness score for analyst review."
            ]
          },
          {
            "description": "A file transferred over FTP or SMB is identified by its content as an executable or script, but has a mismatched file extension (e.g., a PE file named 'image.jpg'), or the file content has a Shannon entropy value greater than 7.5, suggesting it is packed or encrypted.",
            "data_sources": [
              "Zeek files.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs providing data to Zeek sensors, File Servers, Web Proxies",
            "action": [
              "Symbolic: In Zeek files.log, create a rule to alert on any file where the `mime_type` is `application/x-dosexec` but the `filename` extension is not `.exe`, `.dll`, or `.scr`. Also alert if a file is transferred to an external destination with a filename extension of `.exe`, `.ps1`, or `.dll`.",
              "Statistical: For all files analyzed by Zeek, calculate the Shannon entropy from the file content. Establish a baseline entropy for common file types (e.g., .txt, .docx, .jpg). Alert when a file's entropy exceeds the 99th percentile for its stated MIME type or has an absolute entropy value greater than 7.5, indicating potential obfuscation.",
              "Machine Learning: Train a classification model (e.g., a shallow neural network) using features extracted by Zeek, such as byte frequency histograms, entropy, and string statistics from the file content. The model should predict the true file type. Flag any file transferred via FTP/SMB where the model's predicted type (e.g., 'PE executable') does not match the file's stated extension (e.g., '.log')."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]