[
  {
    "information_requirement": "Is the adversary using DNS for Command and Control (C2)? (TA0011 - Command and Control) (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1071.004",
        "name": "Application Layer Protocol: DNS",
        "evidence": [
          {
            "description": "A DNS query is made for a domain, or a DNS response contains an IP address, that matches an entry on a high-confidence threat intelligence feed of known C2 indicators.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal DNS Resolvers, DNS Forwarders",
            "action": [
              "Ingest high-confidence threat intelligence feeds of known C2 domains and IP addresses. Create a SIEM rule to perform a real-time join between the `query` and `answers` fields in Zeek dns.log and the intelligence data. Generate a high-priority alert on any match.",
              "For domains not present on threat intelligence feeds, calculate their prevalence by counting the unique source IPs (`id.orig_h`) that query them over a rolling 24-hour window. Flag domains queried by fewer than 5 hosts that also have a Top-Level Domain (TLD) not present in the top 95th percentile of TLDs observed across the enterprise.",
              "Employ a classification model (e.g., Random Forest) that uses features such as domain age, registrar, IP geolocation, ASN reputation, and lexical analysis of the domain name to predict its likelihood of being malicious. Score all DNS resolutions and alert when a score surpasses a 'likely C2' threshold."
            ]
          },
          {
            "description": "A sequence of DNS queries from a single host exhibits patterns characteristic of a known DNS C2 tool, such as an unusually high ratio of TXT, NULL, or CNAME requests to a single domain compared to its baseline of A/AAAA requests.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal DNS Resolvers",
            "action": [
              "Develop and maintain a library of regular expressions that match query patterns of known DNS C2 tools (e.g., Iodine, dnscat2, Cobalt Strike). Scan the `query` field in Zeek dns.log and alert on any matches.",
              "For each source IP, calculate the frequency distribution of DNS query types (`qtype_name`). Establish a network-wide baseline for typical distributions (mostly A, AAAA, PTR). Flag hosts where the proportion of TXT, NULL, or MX queries to a single domain exceeds the 98th percentile for those query types.",
              "Use a sequence analysis model, such as a Hidden Markov Model (HMM), trained on normal DNS query sequences (e.g., A query -> CNAME -> A query). The model can then identify and flag anomalous sequences, such as a long series of TXT queries or an unusually rapid succession of CNAME lookups to subdomains of the same parent domain."
            ]
          },
          {
            "description": "DNS queries contain subdomain labels that exhibit statistically significant high length or high Shannon entropy, indicating data is being encoded into the query name for exfiltration.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Endpoint Devices, Network Egress Points",
            "action": [
              "Create a rule to flag any DNS query where a single label (the string between dots) in the `query` field exceeds 63 characters or the total query length exceeds 253 characters, as these violate RFC standards and are a strong indicator of abuse.",
              "For each query in Zeek dns.log, calculate the Shannon entropy and character length of the longest subdomain label. Establish a baseline for these two metrics across the enterprise. Use a Z-score to identify queries where entropy or length is more than 3 standard deviations above the mean.",
              "Train an anomaly detection model, such as an Isolation Forest, on a feature set derived from DNS queries, including query length, subdomain entropy, number of subdomain levels, and TLD. The model will learn the profile of normal queries and can identify novel encoded queries that deviate from this profile."
            ]
          },
          {
            "description": "A single client host generates a sustained, abnormally high volume of DNS queries to a single registered domain, characteristic of a C2 'beacon' or data transfer.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Client Network Subnets, Internal DNS Resolvers",
            "action": [
              "Implement a hard-threshold rule that generates an alert if any single source IP (`id.orig_h`) sends more than 500 DNS queries to the same second-level domain within a 10-minute window.",
              "Aggregate DNS queries by source IP and registered domain per minute. For each pair, establish a baseline of normal query volume. Flag any source IP whose query rate to a specific domain exceeds the 99th percentile of its own historical baseline or the global baseline for all hosts.",
              "For each high-volume client-domain pair, apply a time-series forecasting model (e.g., ARIMA) to the query counts. Generate an alert when the observed query count significantly exceeds the forecasted value and its confidence interval, indicating a statistically significant and unexpected spike in traffic."
            ]
          },
          {
            "description": "The ratio of data sent (query size) to data received (response size) for a DNS transaction is anomalously high, indicating data is being uploaded via the DNS query itself.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal DNS Resolvers",
            "action": [
              "Create a rule to flag any DNS transaction where the `query_length` in Zeek dns.log is greater than 100 characters and the DNS response code (`rcode_name`) is `NOERROR` but the `answers` field is empty, a pattern indicative of data upload where no IP resolution is expected.",
              "Using the `uid` field, join Zeek dns.log with conn.log to get byte counts for each transaction. Calculate the ratio of bytes sent (`orig_ip_bytes`) to bytes received (`resp_ip_bytes`). Normal DNS ratios are << 1. Calculate the 98th percentile for this ratio across the network and alert on any transaction that exceeds this threshold, especially if the ratio is > 1.0.",
              "Use a clustering algorithm (e.g., DBSCAN) on DNS transactions, using features like the sent/received byte ratio, query length, and query type. This can automatically isolate a small, dense cluster of 'upload' traffic that is structurally different from the large cluster of normal 'lookup' traffic."
            ]
          },
          {
            "description": "A DNS query originates from a process not typically associated with generating network traffic, such as a command shell, a script interpreter, or an unsigned executable running from a temporary or user-writable directory.",
            "data_sources": [
              "Windows Sysmon Event ID 22",
              "Windows Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations and Servers), Domain Controllers",
            "action": [
              "Using Windows Sysmon Event ID 22 (DnsQuery), create a high-fidelity alert rule that triggers whenever the process image (`Image` field) is cmd.exe, powershell.exe, cscript.exe, wscript.exe, rundll32.exe, or any executable located in user-writable paths like `%APPDATA%`, `%TEMP%`, or `%PUBLIC%`.",
              "Using Sysmon Event ID 22, aggregate DNS queries by process image name to build a baseline of domain rarity. For each process, calculate the inverse document frequency (IDF) score for every domain it queries. Flag instances where a common process (e.g., svchost.exe) queries a domain with an extremely high IDF score (i.e., a very rare domain), indicating a deviation from its normal operational profile.",
              "Train a classification model (e.g., Decision Tree) using features from Sysmon Event ID 1 (ProcessCreate) and Event ID 22 (DnsQuery). Features should include the process name, parent process, command line arguments, and the entropy of the DNS query. The model will learn to distinguish legitimate from malicious process-network behavior chains and can flag suspicious activity, such as Microsoft Word spawning PowerShell which then makes high-entropy DNS requests."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]