[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by clearing mailbox data?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.008",
        "name": "Clear Mailbox Data",
        "evidence": [
          {
            "description": "A process creation event where the command-line arguments or the script block's SHA256 hash exactly match a known malicious signature associated with mailbox clearing tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers, Mail Gateway Servers, Administrator Workstations, Microsoft 365 / Exchange Online tenancy",
            "action": [
              "Symbolic: Create a detection rule that matches the command-line field in Windows Event ID 4688 or the script block text hash in PowerShell Event ID 4104 against a maintained list of known malicious signatures (full strings and SHA256 hashes) for mailbox clearing tools. Trigger a high-confidence alert upon an exact match.",
              "Statistical: Aggregate all command-line executions by their SHA256 hash across the enterprise over a 30-day rolling window. Calculate the prevalence of each hash. Flag any command-line executed on a mail server or by an administrator that has a prevalence below a defined threshold (e.g., seen on fewer than 5 hosts), indicating a rare and potentially suspicious command.",
              "Machine Learning: Train a one-class Support Vector Machine (SVM) model using features extracted from benign command-lines and PowerShell scripts executed on mail servers (e.g., command length, argument count, character entropy). Apply the model to new executions to identify anomalous outliers that do not conform to the established profile of normal administrative activity."
            ]
          },
          {
            "description": "A process creation or cloud audit log event containing specific PowerShell cmdlets or command-line arguments used for mailbox data deletion, export request removal, or mail rule manipulation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers, Microsoft 365 / Exchange Online tenancy, Domain Controllers (for PowerShell remoting logs), Administrator Workstations",
            "action": [
              "Symbolic: Implement a regular expression search across process command-lines (Event ID 4688), PowerShell script logs (Event ID 4104), and M365 audit logs for keywords indicative of data clearing, such as 'Remove-MailboxExportRequest', 'Search-Mailbox -DeleteContent', 'New-ComplianceSearchAction -Purge', or 'Set-InboxRule -Delete'. Alert on matches, prioritizing those from non-administrative or unexpected accounts.",
              "Statistical: For each user, establish a baseline of the daily frequency and variety of Exchange management cmdlets they execute. Calculate the 95th percentile for the daily count of deletion-related cmdlets per user. Generate an alert when a user's daily count exceeds this personalized threshold. Additionally, monitor the entropy of cmdlet names within a user session; a sudden decrease can indicate repetitive, scripted activity.",
              "Machine Learning: Develop a sequence analysis model, such as a Long Short-Term Memory (LSTM) network, trained on sequences of cmdlets from normal administrative sessions. Feed real-time cmdlet execution sequences into the model to predict the next likely command. Trigger an alert if the observed sequence has a low probability (e.g., `New-MailboxExportRequest` followed immediately by `Remove-MailboxExportRequest`), indicating a deviation from learned administrative workflows."
            ]
          },
          {
            "description": "A file deletion or access event with delete permissions where the target file path corresponds to mail server databases (*.edb), transaction logs (*.log, *.jrs), or user mail archives (*.pst, *.ost).",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 23"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Server database and log directories, User profile directories containing PST/OST files on endpoints and file servers",
            "action": [
              "Symbolic: Configure file system auditing and create a rule to alert on Windows Event ID 4663 (with 'Accesses' containing 'DELETE') or Sysmon Event ID 23 (FileDelete) where the target file path matches critical mail data locations (e.g., `...\\Mailbox\\*.edb`, `...\\Users\\*\\*.pst`). Escalate the alert if the initiating process is not a standard mail client or backup service (e.g., `outlook.exe`, `veeam.exe`).",
              "Statistical: For monitored mail directories, aggregate file deletion events per hour by the initiating process name. Calculate a 30-day baseline and standard deviation for the deletion count for each process. Alert if the hourly deletion count for a non-standard process (e.g., `powershell.exe`, `cmd.exe`) exceeds three standard deviations above its historical mean.",
              "Machine Learning: Apply an unsupervised clustering algorithm like DBSCAN to file deletion events, using features such as process name, parent process, user account, file extension, and time of day. This model can isolate anomalous clusters, such as deletions initiated by an unusual process (`rundll32.exe`) outside of business hours, which would be distinct from the dense clusters of normal activity."
            ]
          },
          {
            "description": "A high volume of mail deletion commands or file deletion events associated with mail data, initiated by a single user, host, or process within a short time window (e.g., under 10 minutes).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows PowerShell Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers, User endpoints, Microsoft 365 / Exchange Online tenancy audit logs",
            "action": [
              "Symbolic: Implement a threshold-based rule that triggers when a single user or source host generates more than a fixed number (e.g., >50) of deletion-related events ('Search-Mailbox -DeleteContent', 'Remove-InboxRule', file deletes on *.pst) within a 10-minute window. This acts as a tripwire for bulk clearing activity.",
              "Statistical: For each user, profile the hourly count of mail deletion events over a 30-day period to establish a personal baseline. Generate an alert if a user's hourly deletion count exceeds their personal 99th percentile, providing a more adaptive alternative to a global, static threshold.",
              "Machine Learning: Deploy a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the organization-wide stream of mail deletion events, aggregated per minute. The model will learn the normal rhythm of deletions (e.g., higher during business hours) and detect sudden, anomalous bursts of activity that deviate from these learned seasonal patterns, which could indicate an automated script."
            ]
          },
          {
            "description": "A mailbox clearing event that occurs in temporal proximity (e.g., within 30 minutes) to other suspicious activities, such as an anomalous login, credential access, or a large data transfer from the same user or host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows Event ID 4624",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire enterprise network, including Domain Controllers, Exchange Servers, VPN Concentrators, and Internet Gateway",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers if a confirmed mailbox clearing alert (from any of the above evidence) is preceded or followed within 30 minutes by another high-confidence alert for the same user or host, such as lsass.exe memory access, a successful remote login (Event ID 4624, Logon Type 3 or 10) from an unusual IP, or a `net use` command to a new server.",
              "Statistical: Implement a host-based composite risk score that is incremented by weighted values for various suspicious events. Assign a high weight to mailbox clearing events. Add points for other anomalies, such as a login from a rare geolocation (Zeek conn.log enriched with GeoIP data) or an unusually large data upload (Zeek conn.log `orig_bytes` > 95th percentile for that host). Trigger an alert when a host's risk score crosses a statistically determined threshold.",
              "Machine Learning: Utilize a graph-based analysis model where nodes represent entities (users, hosts, processes, IPs) and edges represent actions. Train a graph neural network (GNN) to identify subgraphs that match known attack patterns. Flag any subgraph where a 'mailbox-clearing' event is linked to the same user/host node as 'credential-dumping', 'lateral-movement', and 'external-data-transfer' events."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]