[
  {
    "information_requirement": "Has an adversary moved laterally by placing malicious code in a shared location? (PIR)",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1080",
        "name": "Taint Shared Content",
        "evidence": [
          {
            "description": "A file written to a network share is identified as malicious based on its hash matching a known threat, or its filename exhibiting statistically unusual properties.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4663",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise file shares (e.g., SMB, NFS), document management systems (e.g., SharePoint), and departmental or public-access network drives.",
            "action": [
              "Symbolic: Query file creation events (Sysmon Event ID 11, Windows Event ID 4663) on network shares. Calculate the SHA256 hash for each new file. Join the calculated hash against a threat intelligence database of known malicious file hashes. Generate a high-severity alert on any match.",
              "Statistical: For each network share, build a baseline of typical filenames. For each new file, calculate the Shannon entropy of its filename and its n-gram frequency against the baseline. Flag filenames with high entropy (e.g., above the 95th percentile) or those containing statistically rare character sequences, as these may indicate randomly generated names used by malware.",
              "Machine Learning: Develop or use a pre-trained classification model that inputs file metadata (file extension, size, source user, source process name). The model should output a probability score of maliciousness ($$ p(malicious) $$). Generate an alert when the score exceeds a calibrated threshold (e.g., $$ p > 0.85 $$), indicating a high likelihood of a malicious file drop."
            ]
          },
          {
            "description": "A script file (.ps1, .vbs, .bat) or shortcut file (.lnk) created on a network share contains suspicious commands, obfuscated code, or points to an unexpected executable.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4663",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User home directories on network shares, software deployment and update repositories, and staging directories used by developers or system administrators.",
            "action": [
              "Symbolic: Scan new files on shares with extensions .lnk, .ps1, .vbs, .bat. For .lnk files, parse the target path and command-line arguments for calls to scripting engines (powershell.exe, cmd.exe). For script files, use regular expressions (YARA) to search for common obfuscation patterns (e.g., 'Invoke-Expression', 'FromBase64String', character array manipulation) or suspicious API calls.",
              "Statistical: For each script file created on a share, calculate its character-level Shannon entropy. Establish a baseline entropy score for benign scripts of the same type (e.g., PowerShell scripts for system administration). Alert on any new script whose entropy score is a significant outlier (e.g., > 3 standard deviations above the mean), which is a strong indicator of packing or encryption.",
              "Machine Learning: Utilize a Natural Language Processing (NLP) model, such as a transformer-based classifier, trained on a large corpus of benign and malicious scripts. Feed the content of new scripts into the model. Alert when the model classifies a script as 'malicious' with a confidence score above a set threshold (e.g., 90%), based on its analysis of code structure, function calls, and embedded strings."
            ]
          },
          {
            "description": "A user or process modifies an unusually high volume of files on a network share, or modifies files with atypical extensions, deviating from established behavioral baselines.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5140",
              "Zeek smb_files.log",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical file servers hosting intellectual property, financial records, or PII. Also includes application servers with shared configuration files and backup storage locations.",
            "action": [
              "Symbolic: Create a watchlist of sensitive file extensions (e.g., .exe, .dll, .ps1) and critical system processes (e.g., lsass.exe). Alert when a user process other than standard software deployment tools writes or modifies files with these extensions on a network share, as logged in Windows Event ID 4663 or Sysmon Event ID 11.",
              "Statistical: For each user, create a baseline of file write activity on network shares using logs from Zeek smb_files.log and Windows Event ID 5140. The baseline should include metrics like (a) count of files written per hour, and (b) distribution of file extensions written. Use the Interquartile Range (IQR) method to detect anomalies, such as a user writing 100 files in an hour when their 75th percentile is 10, or suddenly writing .exe files when they normally only write .docx files.",
              "Machine Learning: Apply a time-series anomaly detection model (e.g., Seasonal-ARIMA or an LSTM-based autoencoder) to the aggregate count of file write events (Sysmon Event ID 11) per network share, aggregated in 5-minute windows. Train the model on at least 30 days of historical data. An alert is generated when the observed write volume significantly exceeds the model's forecasted volume, indicating a potential mass file tainting event."
            ]
          },
          {
            "description": "A process is executed from a network share path shortly after the file was written, especially if the writing and executing entities (user/host) are different.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Sysmon Event ID 11",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints with mounted network shares, especially those belonging to users with broad access (e.g., domain admins, help desk staff) and servers that execute tasks from shared locations.",
            "action": [
              "Symbolic: Correlate process creation events (Sysmon Event ID 1, Windows Event ID 4688) where the Image path is a UNC path with file creation events (Sysmon Event ID 11, Windows Event ID 4663) for the same UNC path. Generate a high-priority alert if (a) the process execution occurs within a short time window of the file write (e.g., $$ \\Delta t < 5 $$ minutes) and (b) the Account Name/Host that wrote the file differs from the Account Name/Host that executed it.",
              "Statistical: For each network share, build a frequency table (a 'least-frequently seen' list) of all process names executed from it. Alert when a process is executed from a share that is statistically rare (e.g., executed by < 1% of users or seen < 5 times in the last 90 days). This helps find novel malware execution that isn't on a threat intel list yet.",
              "Machine Learning: Employ a User and Entity Behavior Analytics (UEBA) model, such as an isolation forest or one-class SVM, to profile each user's normal process execution behavior (e.g., common processes, parent/child relationships, execution locations). The model should flag any process execution from a network share that it classifies as a significant anomaly for that specific user's learned profile, indicating a deviation from normal work patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]