[
  {
    "information_requirement": "Is the adversary maintaining persistence by modifying local or domain groups?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098.007",
        "name": "Additional Local or Domain Groups",
        "evidence": [
          {
            "description": "A user account is added to a group that enables persistence (e.g., 'Remote Desktop Users', 'Server Operators', 'Distributed COM Users') where the modifying user's session originates from an IP address associated with a high-risk ASN or a known malicious source.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Internet Gateway/Firewall, VPN Concentrators",
            "action": [
              "Create a correlation rule that joins a group modification event (Windows Event ID 4732, 4728, or 4756) with the logon session of the modifying user (Windows Event ID 4624) on the `SubjectUserName`. Enrich the logon's `IpAddress` using Zeek conn.log data and an external threat intelligence feed. Alert on any match to a known malicious IP or ASN.",
              "For each user, build a historical profile of their source IP addresses from logon events (Event ID 4624). Calculate the frequency of each source Autonomous System Number (ASN) and source country over the last 90 days. Flag any group modification event where the source IP's ASN/country pair falls into the bottom 5th percentile of frequency for that specific user.",
              "Train a binary classification model (e.g., Random Forest) to predict the likelihood of a group modification being malicious. Use features such as IP geolocation data (country, ASN), time of day, day of week, target group name, and whether the source IP is new for the user. The model should output a probability score, and an alert should be generated for events exceeding a high threshold (e.g., >0.90)."
            ]
          },
          {
            "description": "A command-line process (net.exe, net1.exe) or PowerShell cmdlet (Add-LocalGroupMember, Add-ADGroupMember) modifies a group and is spawned by a non-standard or suspicious parent process, such as an Office application or a web server worker process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Member Servers (Web, Application)",
            "action": [
              "Create a detection rule for Windows Event ID 4688 where the `NewProcessName` is `net.exe`, `net1.exe`, or `powershell.exe` and the `CommandLine` contains 'localgroup', 'group', 'Add-LocalGroupMember', or 'Add-ADGroupMember'. Alert if the `ParentProcessName` is a non-administrative process like `winword.exe`, `excel.exe`, `outlook.exe`, `w3wp.exe`, or `httpd.exe`.",
              "For each host, profile the historical parent-child process relationships for `net.exe` and `powershell.exe` over 30 days. Calculate the Shannon entropy of the parent process name distribution. A sudden spike in entropy or the appearance of a parent process with a frequency below a defined threshold (e.g., seen less than 5 times) should trigger an alert.",
              "Implement a graph-based anomaly detection model on process execution trees using Event ID 4688 data. Model normal process parent-child relationships as a baseline graph. A group modification event originating from a process chain with a high anomaly score, indicating a significant deviation from the baseline graph, should be flagged for investigation."
            ]
          },
          {
            "description": "A non-administrative account or a service account adds a member to a sensitive group, or such a change occurs at a statistically unusual time outside of standard change windows.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Tier 0 Assets, Change Management Systems",
            "action": [
              "Maintain a centrally managed allowlist of accounts authorized to modify specific sensitive groups. Create a rule that triggers on Event IDs 4732, 4728, 4756 and alerts if the `SubjectUserName` performing the modification is not on the authorized list for the given `TargetGroupName`.",
              "For each sensitive group, create an hourly time series of modification events from the past 90 days. Calculate the mean and standard deviation for each hour of the week. Generate an alert if a modification occurs in a time slot where the count is more than 3 standard deviations above the historical mean for that slot.",
              "Develop a peer group analysis model by clustering users based on Active Directory attributes like department, role, or OU. For any group modification event, compare the action to the historical behavior of the user's peer group. Flag events as anomalous if a user modifies a group that no members of their peer group have ever modified."
            ]
          },
          {
            "description": "An account, within 24 hours of being added to a sensitive group, is used to create a new scheduled task, a new service, or modify a persistence-related registry key.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4698",
              "Windows Event ID 7045",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices, Member Servers",
            "action": [
              "When Event ID 4732 or 4728 shows a user added to a sensitive group, add that `TargetUserName` to a watchlist for 24 hours. Generate a high-priority alert if that same account, as the `SubjectUserName`, is observed in Event ID 4698 (Scheduled Task Created), Event ID 7045 (Service Installed), or Event ID 4657 (Registry 'Run' Key Modified) within that window.",
              "Calculate the distribution of time deltas between a user being added to a group and subsequently creating a persistence mechanism (task, service, run key). Flag events where this delta falls in the 1st percentile of all observed deltas for such chained events, as this indicates scripted activity.",
              "Train a sequence analysis model, such as a Hidden Markov Model (HMM), on ordered sequences of user security events (logon, group add, process create, service create, etc.). The model can identify event chains with a high probability of being malicious, such as 'Group Add -> Service Create', which are rare in benign activity."
            ]
          },
          {
            "description": "A machine account (ending in '$') is added to a sensitive domain group and subsequently used for an interactive logon or to request Kerberos service tickets for non-standard services.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4756",
              "Windows Event ID 4624",
              "Windows Event ID 4769",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices, Key Distribution Center (KDC)",
            "action": [
              "Create a rule that triggers on Event ID 4728 or 4756 where the `MemberName` ends in '$'. If triggered, monitor for Event ID 4624 where the `TargetUserName` is the same machine account and `LogonType` is 2 (Interactive) or 10 (RemoteInteractive). Alert immediately on such a logon.",
              "For all machine accounts, baseline the set of Service Principal Names (SPNs) they normally request tickets for, using Event ID 4769 or Zeek kerberos.log. After a machine account is added to a new group, alert if it requests a ticket for an SPN that is statistically rare for machine accounts, such as `krbtgt` or `HOST/workstation_name`.",
              "Train an unsupervised anomaly detection model, such as an Isolation Forest, on the network logon behavior of all machine accounts, using features like source/destination host, logon type, and time. If a machine account's logon activity significantly deviates from this learned 'normal' profile after being added to a new group, classify it as an anomaly."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary elevated privileges by modifying local or domain groups?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098.007",
        "name": "Additional Local or Domain Groups",
        "evidence": [
          {
            "description": "A user is added to a high-privilege group (e.g., 'Administrators', 'Domain Admins') by a source account whose name matches a known suspicious pattern (e.g., 'test', 'backup') or appears to be algorithmically generated.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices",
            "action": [
              "Create a rule for Event IDs 4732, 4728, 4756 that checks for additions to high-privilege groups. Compare the `SubjectUserName` against a watchlist of suspicious patterns (e.g., 'test', 'admin', 'backup', 'support_*', names with long random strings) and alert on any match.",
              "Calculate the character-level Shannon entropy of all usernames that perform privileged group modifications. Flag any modification where the `SubjectUserName` has an entropy score that exceeds the 99th percentile for the organization, as this indicates a likely algorithmically generated name.",
              "Utilize a pre-trained NLP model or a custom-trained classifier to score usernames on their likelihood of being 'human-generated' versus 'machine-generated'. Feed the `SubjectUserName` from privileged group modification events into this model and alert on usernames that receive a low 'human-likeness' score."
            ]
          },
          {
            "description": "A rapid sequence of events occurs on a host: a suspicious process starts, it spawns a command to add a user to a privileged group, and the modification completes, all within seconds.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4732",
              "Windows Event ID 4728"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Member Servers",
            "action": [
              "Create a time-bound correlation rule that triggers if the following events occur on the same host within a 5-second window: 1) Event 4688 with a suspicious parent process (e.g., wscript.exe), followed by 2) Event 4688 for `net.exe` or `powershell.exe` with group modification arguments, and 3) Event 4732/4728 confirming the group modification.",
              "Measure the time delta between a process creation event (4688) and a subsequent group modification event (4732/4728) originating from the same Process ID. A time delta in the sub-second range (e.g., below the 1st percentile of all observed deltas) is highly indicative of an automated script and should be alerted.",
              "Apply a time-series anomaly detection model to the rate of security events per host, per second. A sudden burst of critical events (process creation, group modification) that is classified as an anomaly by the model indicates a potential automated exploit chain in progress."
            ]
          },
          {
            "description": "An account not on an explicit allowlist adds a member to a high-privilege group (e.g., 'Administrators', 'Domain Admins'), or the modification occurs outside a pre-defined change management window.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Change Management Systems, Tier 0 Assets",
            "action": [
              "For any modification to a Tier 0 group like 'Domain Admins' or 'Enterprise Admins' (Event IDs 4728, 4756), compare the `SubjectUserName` against a strict, minimal allowlist of authorized administrators. Generate a critical alert if the account is not on the list.",
              "Establish a baseline of normal change windows (e.g., 9 AM - 5 PM, Mon-Fri) for privileged group modifications. For any modification outside this window, calculate a risk score based on how far it deviates (e.g., +1 for outside business hours, +2 for weekend, +3 for holiday). Alert on scores exceeding a defined threshold.",
              "Train a Bayesian model to calculate the posterior probability of a change being unauthorized. Inputs should include the administrator (`SubjectUserName`), the group being modified, the time of day, and source IP. If the model outputs a high probability of the change being unauthorized based on historical patterns, flag it for immediate review."
            ]
          },
          {
            "description": "An account, within minutes of being added to a privileged group, executes commands to access the SAM database, dump credentials from LSASS, or interact with ntdsutil.exe.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices, LSASS Process Memory",
            "action": [
              "When an account is added to a privileged group (4732/4728), add the `TargetUserName` to a high-risk watchlist for 1 hour. If that user's account then creates a process (4688) with a command line indicating credential dumping (e.g., `mimikatz`, `ntdsutil`, `reg save HKLM\\SAM`), generate a critical alert.",
              "Calculate the 'privilege-to-action' latency: the time between an account gaining privilege (Event 4732/4728) and using it for a sensitive action (Event 4688). A latency in the bottom 1st percentile (likely seconds to minutes) for actions like running `ntdsutil` indicates a pre-planned, automated attack chain.",
              "Use a state-machine model to track user sessions through distinct states: 'Standard Session', 'Privilege Gained', and 'Credential Access Activity'. A session that transitions from 'Privilege Gained' to 'Credential Access' in a very short time frame is a high-confidence indicator of attack and can be classified as malicious by the model."
            ]
          },
          {
            "description": "An account, immediately after being added to a domain-level privileged group, initiates network logons to an anomalously high number of distinct hosts or performs a Golden Ticket-style Kerberos ticket request.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4756",
              "Windows Event ID 4624",
              "Windows Event ID 4769",
              "Zeek conn.log",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Subnets, Key Distribution Center (KDC)",
            "action": [
              "After an account is added to 'Domain Admins' (4728/4756), create a rule to monitor for Kerberos ticket requests (Event ID 4769 or Zeek kerberos.log) from that account where the Service Name is 'krbtgt'. This is a direct indicator of Golden Ticket attack preparation and should be a critical alert.",
              "In a 1-hour window after an account is added to a domain privileged group, count the number of distinct destination hosts for its network logons (Event ID 4624 Type 3). If this count exceeds the 99th percentile for all users in a 1-hour window, alert for anomalous lateral movement (spraying).",
              "Model lateral movement using a graph network where nodes are hosts and directed edges are logons. Train a graph neural network (GNN) to learn normal privileged access patterns. Flag newly privileged users whose subsequent logon activity creates paths or subgraphs that the model identifies as topologically anomalous."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]