[
  {
    "information_requirement": "Is the adversary maintaining persistence through account manipulation? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098",
        "name": "Account Manipulation",
        "evidence": [
          {
            "description": "A successful account modification event, such as a password reset or property change, originates from a source IP address present on a threat intelligence feed of known malicious IPs or anonymizing services.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4724",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Servers, Internet Gateway",
            "action": [
              "Symbolic: Create a rule to correlate the 'Source Network Address' from Windows Event IDs 4738 and 4724 against a threat intelligence feed of known malicious IPs, such as TOR exit nodes or known C2 servers. Trigger a high-priority alert on any match and use the source IP to pivot into Zeek conn.log to investigate the full scope of network activity.",
              "Statistical: For each successful account modification event, extract the source IP address. Join this with historical login data for the target user to determine the frequency of the source IP. Flag modifications originating from IPs in the 99th percentile of rarity for that user. Separately, calculate the Shannon entropy of the source countries for all modification events over a 24-hour window; alert if entropy exceeds a dynamically calculated baseline by 3 standard deviations.",
              "Machine Learning: Implement a time-series forecasting model (e.g., SARIMA) on the hourly count of account modification events (Event IDs 4738, 4724), accounting for weekly seasonality. Generate an alert when the observed event count exceeds the upper bound of the 99% confidence interval of the forecast, indicating an anomalous burst of activity."
            ]
          },
          {
            "description": "An account's 'UserAccountControl' attribute is modified to include the 'DONT_EXPIRE_PASSWD' flag, or a Domain Policy is altered to set 'Password Not Required' for an account, particularly for high-value, dormant, or service accounts.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4739"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Database",
            "action": [
              "Symbolic: Create a high-priority rule to detect when Windows Event ID 4738 shows a 'UserAccountControl' change that adds the 'DONT_EXPIRE_PASSWD' flag (0x10000). Immediately alert if the target account is a member of a privileged group, is a designated service account, or is on a watchlist of critical accounts.",
              "Statistical: Continuously monitor the population of accounts with the 'DONT_EXPIRE_PASSWD' flag set. Calculate the weekly moving average and standard deviation of new additions to this population. Trigger an investigation if the number of additions in a single 24-hour period exceeds the moving average by more than 3 standard deviations.",
              "Machine Learning: Train an unsupervised anomaly detection model, such as an Isolation Forest, using features from Event ID 4738. Features should include a one-hot encoded vector of the attribute changed, the time of day represented as a cyclical feature, the day of the week, and categorical codes for the subject and target account's primary group. The model will identify modifications that are outliers from normal administrative behavior."
            ]
          },
          {
            "description": "An account with no successful logon activity for over 90 days is associated with a successful logon, password reset, or other modification event.",
            "data_sources": [
              "Windows Event ID 4724",
              "Windows Event ID 4738",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Logs, HR System (for termination status)",
            "action": [
              "Symbolic: Maintain a dynamic watchlist of dormant accounts (last logon > 90 days), especially those that are also disabled or belong to former employees. Trigger a high-priority alert if any account on this list generates a successful logon (Event ID 4624), password reset (4724), or account modification (4738).",
              "Statistical: For every successful logon event (Event ID 4624), calculate the time difference since the user's previous successful logon. Flag any logon where this delta exceeds the 99th percentile for that user's historical logon deltas, or a global 90-day threshold if no specific user history exists.",
              "Machine Learning: Periodically run a K-Means clustering algorithm on all users based on features of their recent activity: logon frequency, average session duration, and number of unique systems accessed. Flag any user account that abruptly transitions from a 'low-activity' or 'dormant' cluster to a 'high-activity' cluster for immediate review."
            ]
          },
          {
            "description": "A security-sensitive account modification like a password reset or MFA method change occurs outside of standard business hours (e.g., 10 PM - 5 AM local time) or is performed by an account not belonging to a designated administrative or helpdesk group.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4724",
              "Windows Event ID 4739"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Helpdesk Systems, Privileged Access Workstations (PAWs)",
            "action": [
              "Symbolic: Define a list of authorized administrative groups (e.g., 'Helpdesk', 'Domain Admins'). Alert on any account modification event (4738, 4724) where the 'Subject' account performing the action is not a member of these authorized groups.",
              "Statistical: For each administrative account, establish a baseline of activity hours by analyzing historical modification events (4738, 4724). For each new modification event, convert the timestamp to 'hour of the week' (an integer from 0-167). Flag the event if the hour falls outside the 5th and 95th percentile of that specific admin's historical activity hours.",
              "Machine Learning: Train a classification model (e.g., Gradient Boosting) to predict if a modification is 'suspicious'. Use features including: time of day, day of week, source IP geolocation data from Zeek conn.log, subject account group memberships, target account group memberships, and the historical frequency of the subject-target interaction pair. Flag modifications classified as 'suspicious' with a probability score greater than 0.9."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary escalated privileges through account manipulation? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098",
        "name": "Account Manipulation",
        "evidence": [
          {
            "description": "A user account is added to a privileged group, and the parent process that initiated the change is anomalous (e.g., winword.exe) or not on an allowlist of administrative tools.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoints, Privileged Access Workstations",
            "action": [
              "Symbolic: Create a rule that triggers on a privileged group addition (Event IDs 4728, 4732, 4756). Correlate the Logon ID from the event to find the originating process via Event ID 4688. Alert if the process name is not on an allowlist of legitimate administrative tools (e.g., 'mmc.exe', 'lsass.exe', 'powershell_ise.exe').",
              "Statistical: Maintain a frequency count of process names that are parents of privileged group additions. Alert when an addition is triggered by a process that falls into the bottom 5th percentile of historical frequency, indicating a rare and suspicious parent process for this type of administrative action.",
              "Machine Learning: Construct a process-user-group interaction graph from security events. Use a graph-based anomaly detection algorithm (e.g., running PageRank on the derived graph) to identify nodes (users, processes) with unusually high influence scores related to privileged group additions, indicating a central point of potentially malicious activity."
            ]
          },
          {
            "description": "A new account is created and, within a 5-minute time window, is added to a privileged group, especially if the new account name matches suspicious patterns like random characters or ending in a '$'.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, HR Systems (for name validation)",
            "action": [
              "Symbolic: Trigger a high-severity alert when an Event ID 4720 (account creation) is followed by an Event ID 4728, 4732, or 4756 (privileged group add) for the same target account SID within a 5-minute window.",
              "Statistical: For all new accounts (Event ID 4720), calculate the Shannon entropy of the username. Alert on any new account added to a privileged group where the username has an entropy score in the top 5th percentile (indicating randomness) or a Levenshtein distance of 1 or 2 from an existing privileged account's name (indicating typosquatting).",
              "Machine Learning: Train a Hidden Markov Model (HMM) on the typical sequence of events that follow a new account creation (Event ID 4720). The model will learn the probability of transitioning between states (e.g., 'Created', 'Added to Standard Group', 'Logged On'). A sequence like 'Created -> Added to Domain Admins' will have a very low probability and be flagged as highly anomalous."
            ]
          },
          {
            "description": "An account not currently in a privileged group is added to one, and the action is performed by a subject account that is not a member of a designated administrative group like 'Domain Admins' or 'Account Operators'.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: For every privileged group addition (4728, 4732, 4756), enrich the event with the group memberships of the 'Subject' account. If the 'Subject' is not a member of a pre-defined list of authorized administrator groups, trigger a high-severity alert.",
              "Statistical: Maintain a baseline of which administrative accounts add users to which privileged groups. Represent this as a matrix of (Admin, Group) pairs with historical counts. Flag any new addition where the (Admin, Group) pair has never been seen before or is in the bottom 5th percentile of historical frequency for that Admin.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) to group administrative accounts based on the types of actions they perform. An alert is generated when an administrator performs a privileged group addition that is anomalous for their assigned cluster (e.g., a 'Helpdesk' cluster admin performs an 'Enterprise Admins' group modification)."
            ]
          },
          {
            "description": "The 'nTSecurityDescriptor' attribute is modified on a critical Active Directory object, such as AdminSDHolder or the Domain Admins group, to grant a non-administrative principal dangerous permissions like 'Full Control' or 'WriteDACL'.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4670"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (specifically the one holding the PDC Emulator FSMO role)",
            "action": [
              "Symbolic: Create a critical-severity alert rule that triggers on Windows Event ID 5136 where the 'Object DN' matches a watchlist of critical objects (e.g., 'CN=AdminSDHolder,CN=System,...', 'CN=Domain Admins,...') and the 'Attribute LDAP Display Name' is 'nTSecurityDescriptor'.",
              "Statistical: Track the rate of nTSecurityDescriptor modifications (Event ID 5136) across all AD objects. Calculate a baseline rate (e.g., weekly moving average). Trigger an alert if the number of these events in a 24-hour period exceeds the baseline by 2 standard deviations, which could indicate a widespread permission change attack.",
              "Machine Learning: Develop a parser for the Security Descriptor Definition Language (SDDL) strings in the 'Value' field of Event ID 5136. Extract features such as the trustee, access rights (e.g., GA, GW, WD), and ACE type (Allow/Deny). Train a classification model (e.g., logistic regression) on a labeled dataset of benign and malicious SDDL changes to automatically flag high-risk modifications."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]