[
  {
    "information_requirement": "Is the adversary attempting to gain credentials via brute force?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1110",
        "name": "Brute Force",
        "evidence": [
          {
            "description": "A series of failed authentication events (Windows Event ID 4625) originating from a source IP address, or involving a user-agent string, that is present on a threat intelligence feed of known malicious infrastructure within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN, OWA, RDP gateways), cloud identity providers (e.g., Microsoft Entra ID, Okta), perimeter firewalls, web application firewalls",
            "action": [
              "Symbolic (IOC Match): For each failed authentication event (Windows Event ID 4625), extract the source IP address. For web-based services, also extract the user-agent string from the corresponding Zeek http.log entry. Compare the extracted IP and user-agent against subscribed threat intelligence feeds for known brute-force indicators. Generate a high-severity alert upon any match.",
              "Statistical: Calculate the rate of authentication failures per source IP over a 1-hour sliding window. Flag any IP whose failure rate exceeds the 95th percentile of all external source IPs observed over the last 30 days. Augment the finding by checking if the IP's Autonomous System (AS) has a poor reputation score (e.g., in the bottom 10% of all observed ASNs).",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on historical authentication data. Use features such as source IP geolocation, ASN, time of day, protocol, and user-agent string from Zeek logs. Label data using known malicious IPs from threat intelligence. Deploy the model to score new authentication failures in real-time, alerting on attempts with a high probability of being malicious."
            ]
          },
          {
            "description": "A pattern of ten or more failed authentication attempts (Windows Event ID 4625) from a single source IP targeting a list of common administrative or default account names (e.g., 'admin', 'administrator', 'root', 'support') within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, authentication servers (e.g., RADIUS), Linux/UNIX servers, database servers, network device administration interfaces, and IoT/OT device management portals",
            "action": [
              "Symbolic (Dictionary Match): Create and maintain a dictionary of common administrative, default, and service account usernames. Monitor Windows Event ID 4625 for failed logins. For each source IP, count the number of failed attempts that target usernames from this dictionary within a 5-minute window. Trigger a high-severity alert if the count exceeds 10.",
              "Statistical: For each source IP, calculate the ratio of failed logins against the admin dictionary to the total number of failed logins from that IP over a 1-hour window. Establish a baseline for this ratio across all source IPs. An IP whose ratio exceeds the 99th percentile of this baseline is a strong indicator of a dictionary attack and should be investigated.",
              "Machine Learning: Use a sequence analysis model (e.g., a Recurrent Neural Network or Hidden Markov Model) on the stream of attempted usernames originating from a single source IP. Train the model on legitimate login attempt sequences. An anomalous sequence, characterized by a low probability score from the model and a high density of common admin names, indicates a dictionary attack."
            ]
          },
          {
            "description": "A high count of failed login attempts, greater than 20 within 10 minutes, against a single user account originating from a small set of source IP addresses (fewer than 3).",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing services (RDP, VPNs, webmail), Domain Controllers, user workstations with remote access enabled, critical application servers",
            "action": [
              "Symbolic (Rule-based Threshold): Create a stateful rule that triggers an alert when the count of failed logins (Windows Event ID 4625) for a single user account from a single source IP exceeds 20 events in a 10-minute window. The rule should correlate with Zeek conn.log to confirm the destination service (e.g., port 3389 for RDP, 443 for HTTPS) and include this information in the alert.",
              "Statistical: For each user account, model the normal distribution of failed login counts per 10-minute interval using at least 30 days of historical data. A new 10-minute interval where the failure count exceeds 3 standard deviations from the mean for that user ($$ z > 3 $$) indicates a statistically significant anomaly consistent with a brute-force attempt.",
              "Machine Learning: Apply time series forecasting (e.g., ARIMA or Prophet) to the failed login count for each active user account. Generate a forecast with a 95% confidence interval. If the observed number of failures in a given time window exceeds the upper bound of the model's predicted confidence interval, classify the event as a brute-force anomaly and generate an alert."
            ]
          },
          {
            "description": "A pattern of single failed login attempts (1-3 failures per account) across a large number of unique user accounts (more than 50) originating from a single source IP within a 1-hour window.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud authentication services (e.g., Microsoft Entra ID, Okta), federated identity providers (e.g., ADFS), Domain Controllers, externally-facing web applications with corporate SSO",
            "action": [
              "Symbolic (Rule-based Threshold): From a single source IP, if the distinct count of user accounts with failed logins (Windows Event ID 4625) is greater than 50 and the failure count per account is less than 4 within a 1-hour window, generate an alert for a potential password spraying attack.",
              "Statistical: Group failed logins by source IP per hour. For each source IP group, calculate the Shannon entropy of the set of targeted usernames. An entropy score that is anomalously high (e.g., exceeds the 98th percentile of the historical distribution of entropy scores for all source IPs), combined with a high distinct count of targeted users, indicates a password spraying attack.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on authentication failure events. Use features such as source IP, number of unique target accounts per hour, and average failures per account. A dense cluster characterized by a single (or few) source IPs, a high number of unique target accounts, and a low number of failures per account represents a password spraying attack pattern."
            ]
          },
          {
            "description": "A successful login (Windows Event ID 4624) that occurs from a source IP and for a user account that has experienced more than 10 failed login attempts (Windows Event ID 4625) within the preceding 15 minutes.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, critical asset servers, VPN concentrators, privileged access workstations, cloud administration consoles",
            "action": [
              "Symbolic (Stateful Rule): Create a stateful rule that triggers upon a successful logon (Windows Event ID 4624). The rule should then query the past 15 minutes of logs for failed logons (Windows Event ID 4625) that share the same 'Account Name' and 'Client Address' fields. If the count of failures is greater than 10, generate a high-priority alert for a successful brute-force logon.",
              "Statistical: For each user, establish a baseline distribution of the number of failed login attempts that precede a successful login from the same IP. A successful login (Event ID 4624) that follows a failure count (Event ID 4625) exceeding the 99th percentile of that user's specific baseline is flagged as a likely successful brute-force attack.",
              "Machine Learning: Train a classifier (e.g., Logistic Regression) to distinguish 'normal' from 'post-brute-force' successful logins. Use features such as the count of preceding failures in the last hour, time since the user's last successful login, source IP reputation, time of day, and day of the week. Score all new successful logins and alert when the probability of a successful brute-force exceeds a defined threshold (e.g., 0.90)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]