[
  {
    "information_requirement": "Is the adversary capturing audio from endpoint devices? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1123",
        "name": "Audio Capture",
        "evidence": [
          {
            "description": "A process, identified by its hash or name, is created that matches a known indicator of compromise (IOC) for audio capture malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Defender Event ID 1116",
              "Windows Defender Event ID 1117"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, laptops, conference room systems, and executive endpoints.",
            "action": [
              "Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for process hashes and names against a threat intelligence list of known audio capture malware. Separately, query antivirus logs (Windows Defender Event IDs 1116, 1117) for alerts containing threat names associated with audio capture or spyware.",
              "Calculate a 30-day moving average and standard deviation for the daily count of antivirus alerts (Windows Defender Event ID 1116) tagged as spyware or audio capture tools. Generate an alert for any day where the count exceeds three standard deviations above the moving average, indicating a statistically significant spike.",
              "Apply a pre-trained logistic regression classifier to metadata from new process creation events (Sysmon Event ID 1). Use features such as file path entropy, signature status, parent process name, and command-line length to generate a risk score. Prioritize investigation of processes with scores indicating a high probability of being malicious audio capture tools."
            ]
          },
          {
            "description": "A command-line or script block log contains keywords, arguments, or API calls used to initiate audio recording, such as `ffmpeg`, `mciSendString`, or `System.Media.SoundPlayer`.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Developer machines, Administrator jump boxes",
            "action": [
              "Using regular expressions, scan command-line arguments (Windows Event ID 4688, Sysmon Event ID 1) and PowerShell script block content (Event ID 4104) for keywords of audio capture utilities (e.g., `ffmpeg`, `sox`, `soundrecorder`) and audio-related API calls (e.g., `System.Media.SoundPlayer`, `waveInOpen`, `mciSendString`).",
              "For all PowerShell script blocks (Event ID 4104), calculate the information entropy of the decoded script content. Establish a baseline of entropy scores for legitimate scripts. Flag for review any script whose entropy score is in the top 5th percentile, as high entropy may indicate obfuscation or packing.",
              "Deploy a Long Short-Term Memory (LSTM) autoencoder trained on a baseline of legitimate command-line argument sequences. Process new command-line executions and flag any that produce a high reconstruction error, indicating a statistically rare and potentially malicious sequence of arguments used to invoke audio capture."
            ]
          },
          {
            "description": "An audio-capable application (e.g., Teams.exe, VoiceRecorder.exe) is launched by an unusual parent process, or itself spawns a suspicious child process like cmd.exe or powershell.exe.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Executive laptops, Endpoints with collaboration software installed",
            "action": [
              "Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) to identify when known audio-capable applications are started by a parent process that is not on a pre-defined allowlist (e.g., `explorer.exe`, `svchost.exe`), is unsigned, or is running from a non-standard directory like `%TEMP%` or `%APPDATA%`.",
              "Build a frequency table of all parent-child process relationships observed over a 30-day period. For known audio-capable child processes, generate an alert for any relationship that falls into a low percentile of frequency (e.g., bottom 1%), indicating a rare and anomalous execution chain.",
              "Model process ancestry as a directed graph and apply a graph-based anomaly detection algorithm (e.g., PageRank, Louvain community detection). Identify processes with unusual centrality or that bridge otherwise disconnected communities of processes, especially if they are parents to audio-capable applications, as potential indicators of a malicious execution chain."
            ]
          },
          {
            "description": "A process creates files with audio-related extensions (e.g., .wav, .mp3, .m4a) or exhibits periodic file-write behavior to temporary or user-writable directories.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User home directories, Shared network drives, Temporary file system locations (e.g., C:\\Users\\<user>\\AppData\\Local\\Temp)",
            "action": [
              "Monitor file creation events (Sysmon Event ID 11) for new files with audio extensions (.wav, .mp3, .m4a, .ogg, .aac) created by any process not on an allowlist of legitimate media applications. Correlate the creating ProcessGUID with process creation logs (Sysmon Event ID 1) to inspect the parent process and command line.",
              "For each process, analyze the timestamps of its file creation events (Sysmon Event ID 11). Calculate the inter-arrival time between file creations and flag processes that exhibit a low standard deviation, indicating periodic activity. Combine this with a check for file sizes that are consistently within a range typical for audio recordings (e.g., 100KB - 5MB).",
              "Apply a time-series anomaly detection model (e.g., Prophet, Seasonal-Hybrid-ESD) to the volume and frequency of file writes (Sysmon Event ID 11) on a per-process, per-host basis. Trigger an alert when a process initiates a pattern of file writes that is anomalous compared to its own history and the behavior of its peers."
            ]
          },
          {
            "description": "An outbound network connection transmits a large volume of data to a rare destination, occurring within a short time window after a process creates a file with audio-like characteristics.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log",
              "Sysmon Event ID 3",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS servers, Proxy servers, User workstations",
            "action": [
              "Correlate process activity with network activity by joining Sysmon Event ID 11 (File Creation) with Sysmon Event ID 3 (Network Connection) on ProcessGUID. Alert if a process writes a file with an audio extension and, within 5 minutes, makes a network connection to an IP or domain on a threat intelligence blocklist.",
              "For outbound connections (Zeek conn.log), calculate the 99th percentile for `orig_bytes` (bytes sent) per source host over a 30-day baseline. Alert on any connection exceeding this threshold. Enrich the alert by checking if the destination IP or domain is rare (seen by <1% of hosts) and if the JA3 hash of the TLS connection is rare across the enterprise.",
              "Use an unsupervised learning model, such as an Isolation Forest, on enriched network connection data from Zeek conn.log. Use features like duration, `orig_bytes`, `resp_bytes`, destination port, protocol, JA3 hash, and DNS query rarity. Prioritize investigation of anomalies originating from processes that have also recently created files (Sysmon Event ID 11), especially if those files have audio extensions."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]