[
  {
    "information_requirement": "Is the adversary capturing video from endpoint devices? (PIR) [1]",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "references": [
      {
        "id": 1,
        "description": "Wardle, P. (2017). The Art of Mac Malware: Analysis. Objective-See. Retrieved from https://objective-see.com/products/books/TheArtOfMacMalware_v1.pdf"
      }
    ],
    "indicators": [
      {
        "technique_id": "T1125",
        "name": "Video Capture",
        "evidence": [
          {
            "description": "A process execution event where the process name or file hash matches a known malicious indicator associated with video capture malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, particularly those assigned to executives, developers, and system administrators.",
            "action": [
              "Execute a query for process creation events (Windows Event ID 4688, Sysmon Event ID 1). Join the process name and file hash against a threat intelligence feed of known indicators for T1125 malware (e.g., FruitFly, Proton). Generate an alert for any match.",
              "For any process matching a known indicator, analyze the prevalence of its parent process across the enterprise. A parent process prevalence below the 5th percentile is a supplementary indicator of anomalous execution, suggesting a rare or suspicious process is launching the malware.",
              "Deploy a pre-trained Random Forest or Gradient Boosting classifier that uses static and dynamic process features (e.g., parent process, command-line arguments, file path, authenticode signature status, user context). Feed all new process creation events into the model to generate a real-time maliciousness score. An event with a high score constitutes a high-fidelity alert."
            ]
          },
          {
            "description": "A legitimate utility (e.g., powershell.exe, ffmpeg.exe) is executed with command-line arguments indicating non-interactive or scripted video capture.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, particularly those belonging to high-value targets.",
            "action": [
              "From process creation logs with command-line auditing (Windows Event ID 4688, Sysmon Event ID 1), search for regular expression patterns indicative of malicious use. For example, 'powershell.exe' invoking .NET classes like 'DirectShowLib' or 'ffmpeg.exe' with arguments like '-f dshow -i video=...' and an output file.",
              "For executions of video-capable utilities (powershell.exe, ffmpeg.exe), tokenize the command-line arguments. Calculate the Jaccard similarity score comparing the current argument set to a historical baseline of benign argument sets for that user and host. Flag executions with a similarity score below the 10th percentile as anomalous.",
              "Apply a pre-trained NLP model (e.g., TF-IDF vectorizer with a Logistic Regression classifier) to the command-line arguments of video-capable utilities. The model, trained on labeled benign and malicious commands, will classify the intent of new executions. Flag commands classified as malicious."
            ]
          },
          {
            "description": "A process not on a pre-defined allowlist of approved video-conferencing applications creates a handle to a video capture device (e.g., '\\Device\\Video0').",
            "data_sources": [
              "Sysmon Event ID 10",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints equipped with integrated or peripheral webcams.",
            "action": [
              "Filter Sysmon Event ID 10 (ProcessAccess) events where the 'CallTrace' contains 'dxgkrnl.sys' and the 'TargetObject' ends with a video device identifier (e.g., '\\Device\\Video0'). Compare the 'SourceImage' process against an allowlist of approved applications (e.g., teams.exe, zoom.exe, slack.exe). Alert on any process not on the list.",
              "For all processes observed accessing video devices via Sysmon Event ID 10, calculate their enterprise-wide prevalence (count of distinct hosts). Flag processes with a prevalence in the bottom 5th percentile as rare and potentially unauthorized.",
              "Train an autoencoder neural network on feature vectors derived from legitimate video-access events (e.g., process path, parent process, user context, signature status from Sysmon). For new access events, calculate the reconstruction error. A high reconstruction error indicates the process behavior is anomalous and does not conform to the learned pattern of legitimate activity, warranting an alert."
            ]
          },
          {
            "description": "A process not on the approved video application allowlist creates files with video or image extensions (e.g., .mp4, .avi, .jpg) in a common staging directory (e.g., %TEMP%, %PUBLIC%).",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Common staging directories on user endpoints, such as %APPDATA%, %TEMP%, C:\\Users\\Public, and temporary internet file locations.",
            "action": [
              "Monitor Sysmon Event ID 11 (FileCreate) events. Alert when a file with a video/image extension is created in a suspicious directory (e.g., %APPDATA%, %TEMP%, C:\\Users\\Public) by a process ('Image' field) that is not on the video application allowlist.",
              "For file creation events involving video/image types, calculate the Shannon entropy of the filename ('TargetFilename' field). Establish a baseline for normal filename entropy from approved applications. Flag files with an entropy score exceeding a high threshold (e.g., > 3.5), suggesting programmatic naming.",
              "Use a DBSCAN clustering algorithm on file creation events, using features like file size, directory path, creating process, and the time delta between creations from the same process. Identify and investigate clusters of events that are dense and separated from normal activity, as they may represent periodic captures by malware."
            ]
          },
          {
            "description": "A significant volume of outbound network traffic or file transfers with video/image MIME types occurs from an endpoint shortly after a potential video capture event is detected on the same host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Sysmon Event ID 1",
              "Sysmon Event ID 10",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies) and the network interfaces of individual endpoints.",
            "action": [
              "Create a correlation rule that triggers on a host-based T1125 alert (e.g., from Evidence 1-4). Within a 10-minute window following the alert, search Zeek files.log for transfers from the source host where 'mime_type' is 'video/*' or 'image/*'. Alert if the destination is not an approved corporate or cloud service.",
              "For each host, baseline hourly outbound data volume using 'orig_bytes' from Zeek conn.log. Alert if a host's outbound traffic in a given hour exceeds the 99th percentile of its own historical baseline, especially if correlated with a recent T1125-related host event.",
              "For each host, use a time series forecasting model (e.g., SARIMA, LSTM) trained on historical outbound network traffic (Zeek conn.log 'orig_bytes'). If the actual observed traffic significantly exceeds the forecasted volume (i.e., the residual is anomalous), flag it as a potential exfiltration event. Prioritize these alerts if they occur within minutes of a host-based T1125 detection."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]