[
  {
    "information_requirement": "Is an adversary using the JamPlus build utility to evade defenses and execute malicious code? (TA0005 - Defense Evasion)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1127.003",
        "name": "JamPlus",
        "evidence": [
          {
            "description": "The file hash of an executed 'jam.exe' or 'JamPlus.exe' process matches a known-malicious hash. Alternatively, a network connection initiated by the JamPlus process, or any of its child processes, communicates with an IP address, domain, or URL on a C2 blocklist.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer Workstations, CI/CD Build Servers, Network Egress Points, DNS Servers",
            "action": [
              "For each process creation event (Windows Event ID 4688) where the process name is 'jam.exe' or 'JamPlus.exe', compute its file hash. Simultaneously, monitor network logs (Zeek conn.log, dns.log, http.log) for connections originating from the same host. Alert if the file hash, destination IP, requested domain, or requested URL matches an entry in a threat intelligence feed.",
              "Correlate JamPlus process executions (Windows Event ID 4688) with subsequent DNS queries (Zeek dns.log). For each queried domain, calculate its enterprise-wide rarity (e.g., query count in the bottom 1st percentile) and its lexical entropy. Generate a risk score by combining these metrics. Alert when the combined score for a domain queried by JamPlus exceeds a dynamically determined threshold (e.g., 3 standard deviations above the mean score for all domains).",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled historical data of process executions (Windows Event ID 4688) and their associated network flows (Zeek conn.log). Engineer features such as: parent process name, command-line argument entropy, JA3/JA3S hash from the TLS handshake (Zeek ssl.log), destination IP reputation, destination port, ratio of outbound to inbound bytes, and connection duration. Use the trained model to classify new JamPlus-initiated network sessions in near-real-time, alerting on those classified as malicious."
            ]
          },
          {
            "description": "A 'jam.exe' or 'JamPlus.exe' process is executed from a file path that is not an organizationally approved installation directory (e.g., not '%PROGRAMFILES%\\Jam'), or the process runs on a host not designated as a developer workstation or build server in the asset inventory.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "General User Endpoints, File Servers, Domain Controllers, Asset Management Systems",
            "action": [
              "Maintain an asset inventory that tags hosts by role (e.g., 'developer', 'build-server') and a configuration management database (CMDB) with approved installation paths for developer tools. Create a SIEM rule to alert on any 'jam.exe' or 'JamPlus.exe' process creation event (Windows Event ID 4688) where the hostname does not have the appropriate role tag OR the executable path is not in the approved list. Also, include common suspicious paths like 'C:\\Users\\Public\\' or '%TEMP%' in a specific blocklist for higher-fidelity alerts.",
              "For all 'jam.exe' or 'JamPlus.exe' executions (Windows Event ID 4688), build a frequency distribution of unique execution directory paths across the enterprise over a 90-day rolling window. Alert when an execution occurs from a path that falls in the bottom 5th percentile of frequency, indicating an abnormally rare location for this tool to be run from.",
              "Implement an unsupervised anomaly detection model, such as an Isolation Forest, trained on legitimate JamPlus execution events (Windows Event ID 4688) enriched with user and asset context. Features should include: user's department, user's role, host's role, hour of day, day of week, execution path, and parent process name. The model will create a profile of normal development activity. Flag any new execution that the model assigns a high anomaly score to for further investigation."
            ]
          },
          {
            "description": "The parent process of 'jam.exe' or 'JamPlus.exe' is a process not typically associated with software development or command-line interaction, such as a Microsoft Office application ('winword.exe', 'outlook.exe'), a web browser ('msedge.exe', 'chrome.exe'), or a scripting host ('wscript.exe').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "General User Endpoints, Developer Workstations, CI/CD Build Servers",
            "action": [
              "Create a SIEM rule that generates a high-severity alert upon detection of a process creation event (Windows Event ID 4688) where the child process is 'jam.exe' or 'JamPlus.exe' and the parent process name is on a blocklist of non-standard initiators, such as 'winword.exe', 'excel.exe', 'outlook.exe', 'wscript.exe', or 'mshta.exe'.",
              "Over a 30-day period, generate a baseline frequency table of all parent-child process relationships involving 'jam.exe' or 'JamPlus.exe' as the child from process creation events (Windows Event ID 4688). Alert when a new execution occurs where the parent process is not in the established baseline or its frequency falls below a 1% threshold, indicating a rare and potentially suspicious spawning event.",
              "Train a supervised classification model (e.g., Naive Bayes or Logistic Regression) on a dataset of labeled parent-child process pairs (from Windows Event ID 4688). Features can be one-hot encoded parent and child process names. Use the model to predict the probability that a new, unseen parent-child pair (e.g., 'outlook.exe' -> 'jam.exe') is malicious. Alert on classifications that exceed a predefined probability threshold (e.g., > 0.8)."
            ]
          },
          {
            "description": "A 'jam.exe' or 'JamPlus.exe' process spawns a child process that is not a known compiler (e.g., 'cl.exe', 'gcc.exe'), linker, or other legitimate build tool, but is instead a utility commonly abused for post-exploitation, such as 'powershell.exe', 'rundll32.exe', 'certutil.exe', or 'wmic.exe'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer Workstations, CI/CD Build Servers, General User Endpoints",
            "action": [
              "Implement a SIEM detection rule that triggers on process creation events (Windows Event ID 4688) where the parent process name is 'jam.exe' or 'JamPlus.exe' and the child process name is on a curated watchlist of suspicious utilities (e.g., 'powershell.exe', 'cmd.exe', 'wscript.exe', 'certutil.exe', 'bitsadmin.exe', 'rundll32.exe', 'regsvr32.exe').",
              "For every child process spawned by JamPlus (identified via Windows Event ID 4688), calculate the Shannon entropy of its command-line arguments. Establish a baseline entropy score for legitimate build-related commands by analyzing historical data. Flag any child process whose command-line entropy exceeds the 95th percentile of the established baseline, as high entropy can indicate obfuscated or encoded payloads.",
              "Apply an unsupervised clustering algorithm like DBSCAN to child processes spawned by JamPlus. Use features extracted from Windows Event ID 4688, including the child process name (as a categorical feature), command-line argument length, and command-line argument entropy. Legitimate build commands should form one or more dense clusters. Investigate any processes that the algorithm labels as noise points (outliers), as they deviate significantly from normal build activity."
            ]
          },
          {
            "description": "A network connection initiated by 'jam.exe', 'JamPlus.exe', or one of its child processes exhibits characteristics of command-and-control (C2) communication. This includes periodic 'heartbeat' beacons, unusually long connection durations with low data transfer, data transfers to non-standard ports, or the use of self-signed or anomalous TLS certificates.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, Developer Workstations",
            "action": [
              "Correlate JamPlus process executions (Windows Event ID 4688) with network connection events (Windows Event ID 5156, Zeek conn.log). For each connection, check the destination IP address and the resolved domain name (from Zeek dns.log) against a threat intelligence feed of known malicious indicators. Also, inspect the TLS certificate issuer (from Zeek ssl.log) and alert if it is self-signed or belongs to a known-malicious entity.",
              "For a given JamPlus process and its children, group all outbound network connections (from Zeek conn.log) by destination IP address. For each group with more than 10 connections in a 30-minute window, calculate the time delta between each consecutive connection. Compute the standard deviation of these time deltas. A standard deviation below a low threshold (e.g., < 1.5 seconds) indicates a highly regular, machine-generated beaconing pattern and should be alerted.",
              "Develop a time-series anomaly detection model using an autoencoder or LSTM network. Train the model on legitimate network flow data (Zeek conn.log) associated with normal build processes. The feature set for each flow should include: connection duration, total bytes sent, total bytes received, protocol, destination port, and JA3 hash (from Zeek ssl.log). Monitor network traffic from new JamPlus executions and their children, feeding the corresponding flows into the model. Flag any flow that results in a reconstruction error significantly higher than the baseline established during training."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]