[
  {
    "information_requirement": "Has the adversary escalated privileges using token manipulation on the enterprise network?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1134.003",
        "name": "Make and Impersonate Token",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) with a file hash matching a known malicious indicator is followed within 60 seconds on the same host by a new logon session (Windows Event ID 4624, Logon Type 9) where the target user possesses higher privileges than the user who initiated the original process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Administrative Workstations, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Create a detection rule that joins process creation events (Windows Event ID 4688) with a threat intelligence list of malicious file hashes. If a process hash matches, pivot on the hostname and timestamp to find a subsequent new logon event (Windows Event ID 4624 with Logon Type 9) within a 60-second window. Alert if the 'TargetUserName' in the logon event belongs to a higher-privileged group (e.g., Domain Admins, Enterprise Admins) than the 'SubjectUserName' from the initial process creation event.",
              "Statistical: For every Logon Type 9 event (Windows EID 4624), identify the parent process that created the logon session. Maintain a historical baseline of (parent process name, target user account) pairs for all Logon Type 9 events across the enterprise. Calculate the frequency of each pair. Generate a high-risk score when a rare pair is observed (e.g., a pair in the bottom 1st percentile of frequency), indicating a process is impersonating a user it normally does not.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) using labeled historical logon events (Windows Event ID 4624, Logon Type 9) as the target. Engineer features from the logon event and its parent process creation event (Windows Event ID 4688), including: parent process command line entropy, rarity of parent process name, rarity of the target username for that parent, time delta between process creation and logon, and a boolean feature for privilege level increase. The model will output a probability score for each Logon Type 9 event being part of a malicious privilege escalation chain."
            ]
          },
          {
            "description": "A new logon session (Windows Event ID 4624, Logon Type 9) is created by a parent process that does not typically perform such actions, such as a web server worker process (w3wp.exe), a document application (WINWORD.EXE), or a non-administrative scripting engine (wscript.exe).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application Servers, Web Servers, User Workstations, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Filter for all Windows Event ID 4624 with Logon Type 9. For each, identify the parent process name from the corresponding Windows Event ID 4688 ('Creator Process Name'). Alert if the parent process name is on a blocklist of suspicious parents (e.g., 'w3wp.exe', 'WINWORD.EXE', 'EXCEL.EXE') or is not on a pre-defined allowlist of known-good parent processes that perform impersonation (e.g., 'runas.exe', 'services.exe', 'taskeng.exe').",
              "Statistical: For each parent process name observed creating a Logon Type 9 event, calculate the entropy of the set of 'TargetUserName' values it has created sessions for over a 30-day baseline. Alert when a process creates a new session for a user that causes a statistically significant increase in this entropy score, suggesting it is beginning to impersonate a wider, more anomalous set of users.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features extracted from parent process (EID 4688) and logon (EID 4624, Type 9) event pairs. Features should include vectorized parent process name, vectorized target user name, command line length, and the user security identifier (SID) type of both the subject and target. Identify clusters of anomalous behavior that are marked as noise or form small, distinct clusters separate from the large, dense clusters of normal administrative activity."
            ]
          },
          {
            "description": "A non-privileged user account ('SubjectUserName') successfully initiates a new logon session (Windows Event ID 4624, Logon Type 9) for a privileged account ('TargetUserName'), and the resulting logon session ('TargetLogonId') is then used to perform sensitive actions like accessing LSASS memory or modifying critical registry keys.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4656",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, High-Value Asset Servers, Tier 0 Administrator Workstations, Certificate Authorities",
            "action": [
              "Symbolic: Create a chained rule that triggers when a Windows Event ID 4624 (Logon Type 9) shows a 'SubjectUserName' from a low-privilege group creating a session for a 'TargetUserName' in a high-privilege group (e.g., Domain Admins). Correlate this event's 'TargetLogonId' with subsequent object access events (Windows Event ID 4656) on the lsass.exe process (indicating credential access) within a 5-minute window.",
              "Statistical: For each user, build a profile of the accounts they typically impersonate via Logon Type 9. Calculate a 'privilege gap score' (e.g., based on group membership tiers) for each impersonation. Alert when a user initiates an impersonation where the privilege gap score is a statistical outlier for that user (e.g., exceeds the 99th percentile of all their historical impersonation gaps), or when the target account is one they have never impersonated before.",
              "Machine Learning: Implement a time-series anomaly detection model on the sequence of actions performed by a logon session ('TargetLogonId'). After a Logon Type 9 event creates a new session, monitor the sequence of subsequent event IDs (file access, process creation, registry modification) associated with that Logon ID. The model, trained on normal user and admin session behavior, will flag sequences that are improbable or highly associated with known attack patterns (e.g., a sequence matching the MITRE ATT&CK kill chain)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary bypassing defenses on the enterprise network using token manipulation?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1134.003",
        "name": "Make and Impersonate Token",
        "evidence": [
          {
            "description": "A process, potentially spawned from a web shell or other initial access vector, executes 'runas.exe' with the '/netonly' flag to authenticate to remote systems using different credentials, followed by network connections to internal assets from the source host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal-facing Servers, Staging Servers, User Workstations, Network Egress Points",
            "action": [
              "Symbolic: Create a rule that triggers when a process creation event (Windows Event ID 4688) for 'runas.exe' contains '/netonly' in the command line AND the parent process is a web server process (e.g., 'w3wp.exe', 'tomcat.exe') or a script interpreter. Correlate with subsequent outbound network connections (Zeek conn.log) from the same host to internal IP ranges on ports like 445, 3389, or 5985.",
              "Statistical: Establish a baseline of which users and source workstations legitimately use 'runas.exe /netonly'. Alert when usage deviates from this baseline, such as use by a service account for the first time, or when the destination host of the subsequent network connection is in the 99th percentile of rarity for that source host/user pair.",
              "Machine Learning: Use a graph-based anomaly detection model where nodes are users, processes, and hosts. An edge is created for each interaction. A path representing 'w3wp.exe' -> 'cmd.exe' -> 'runas.exe /netonly' -> 'CRITICAL_DB_SERVER' would form an anomalous subgraph if such a path has never or rarely been seen, indicating a web shell performing lateral movement under a different user context."
            ]
          },
          {
            "description": "The 'runas.exe' command is executed with the '/savecred' argument from a non-interactive process (e.g., a Windows Service) or a process running from a temporary or user-writable file path (e.g., %TEMP%, %APPDATA%).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Multi-user Servers (e.g., Citrix, RDS), SIEM/Log Aggregator",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for 'NewProcessName' ending in 'runas.exe'. Alert if the command line contains '/savecred' AND the 'SubjectLogonId' corresponds to a non-interactive session (e.g., 0x3e7 for SYSTEM) OR the parent process's path is in a non-standard location like '%PUBLIC%\\Downloads' or a browser cache folder.",
              "Statistical: Profile the parent process paths and user accounts associated with 'runas.exe /savecred' executions. Calculate the string entropy and rarity (inverse document frequency) of the parent process path. Alert when 'runas.exe /savecred' is executed from a path that is a statistical outlier, such as having entropy in the 95th percentile or a path rarity score below the 5th percentile.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to distinguish between legitimate and malicious 'runas.exe /savecred' executions. Features should include the parent process name, the full command line, user context (interactive vs. non-interactive), working directory path characteristics (length, entropy, known temp location), and time of day. The model can identify malicious usage by learning the patterns of legitimate administrative use and flagging deviations."
            ]
          },
          {
            "description": "A new logon session (Windows Event ID 4624, Logon Type 9) is created, followed immediately by outbound network connections to unusual FQDNs or IP addresses, or using uncommon ports, suggesting evasion of network monitoring by operating under a different user's network context.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, Critical Asset Subnets, Proxy Logs",
            "action": [
              "Symbolic: Upon detection of a Windows Event ID 4624 (Logon Type 9), correlate the 'ProcessId' with DNS queries (Zeek dns.log) and network connections (Zeek conn.log) from the same host within 60 seconds. Alert if the resolved IP address or FQDN is on a known C2 blocklist or has a newly registered domain age.",
              "Statistical: For each user, build a baseline of normal network behavior (e.g., common destination countries/ASNs, ports, JA3 hashes, requested domain entropy). After a Logon Type 9 event impersonates that user, monitor subsequent network traffic. Alert if the traffic deviates significantly, such as connecting to a destination country for the first time, using a port in the 99th percentile of rarity for that user, or generating DNS requests for domains with a character frequency distribution that is a statistical outlier.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA or Prophet) on key network traffic metrics (e.g., bytes out, connection count, unique destinations) for each host. When a Logon Type 9 event occurs, compare the subsequent network traffic against the model's forecast. A significant, unpredicted spike in outbound traffic following the token creation event indicates a high-probability anomaly."
            ]
          },
          {
            "description": "A process creates a Logon Type 9 session to impersonate a legitimate system account (e.g., 'NT AUTHORITY\\SYSTEM') and then modifies or deletes security logs, tools, or configurations to evade detection, evidenced by log clearing events or modification of security tool directories.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 1102",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log Aggregation Servers, Domain Controllers, Security Appliance Management Interfaces, EDR servers",
            "action": [
              "Symbolic: Create a high-fidelity chained rule: (1) A Windows Event ID 4624 (Logon Type 9) occurs where 'TargetUserName' is 'SYSTEM'. (2) Within 2 minutes, the 'ProcessId' from event (1) or one of its children spawns 'wevtutil.exe' with 'cl' or 'clear-log' arguments (from EID 4688) OR a Windows Event ID 1102 (The audit log was cleared) is logged on the same host. This sequence is a strong indicator of log tampering.",
              "Statistical: Establish a baseline for the frequency of log clearing events (Event ID 1102) per host and per user. Alert if a log clearing event occurs on a host where it has never happened before (e.g., a production web server), or if the time between a Logon Type 9 for a privileged account and a subsequent log clearing event is a statistical outlier (e.g., below the 1st percentile of all such observed time deltas), suggesting an automated and immediate evasive action.",
              "Machine Learning: Deploy a Hidden Markov Model (HMM) trained on sequences of security events from endpoints. The model learns the probabilities of transitioning between hidden states (e.g., from 'Normal Operation' to 'Privilege Escalation' to 'Defense Evasion'). A sequence of 'Logon Type 9 for SYSTEM' -> 'Access to security tool process' -> 'Terminate Process' -> 'Clear Security Log' would represent a low-probability path through the model, triggering a high-confidence alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]