[
  {
    "information_requirement": "Is the adversary maintaining persistence using Office application startup mechanisms? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1137",
        "name": "Office Application Startup",
        "evidence": [
          {
            "description": "A file creation event is logged for a file written to a known Office startup or template path, or a registry modification event is logged for a key related to Office add-ins.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers, File servers hosting shared Office templates",
            "action": [
              "Symbolic: For file write events (Windows Event ID 4663) in Office startup paths (`%APPDATA%\\Microsoft\\{Word,Excel,PowerPoint}\\STARTUP`, `%APPDATA%\\Microsoft\\Templates`), hash the created file and join against a threat intelligence feed of malicious file hashes; alert on match. For registry modifications (Windows Event ID 4657) under `HKCU\\Software\\Microsoft\\Office\\<app>\\Addins`, match the `ValueName` or `Data` against a watchlist of known malicious add-in names or CLSIDs.",
              "Statistical: Calculate the file name entropy for all files written to these paths and flag files with entropy scores in the 99th percentile, suggesting obfuscation. Additionally, establish a prevalence baseline for all add-in DLL paths seen across the enterprise and flag any add-in pointing to a path seen on less than 1% of endpoints.",
              "Machine Learning: Train a time-series model (e.g., ARIMA) on the volume of file and registry modifications in these sensitive locations per user and alert on observed volumes that significantly exceed the prediction confidence interval, indicating anomalous setup activity."
            ]
          },
          {
            "description": "An Office application process (e.g., winword.exe, excel.exe) spawns a child process (e.g., powershell.exe, wscript.exe) with a command line that contains obfuscation patterns, download cradles, or encoded payloads.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers, Internet gateway",
            "action": [
              "Symbolic: For process creation events (Windows Event ID 4688) where the parent is an Office application, apply regular expressions to the child process command line to detect high-risk patterns like `-enc`, `-nop`, `IEX`, `DownloadString`, or base64 patterns (`[A-Za-z0-9+/]{20,}=*`); alert on match.",
              "Statistical: Calculate the length and character entropy of each command line, establish a baseline for each parent-child pair (e.g., `winword.exe` -> `powershell.exe`), and flag instances where length or entropy is greater than 3 standard deviations above the mean for that specific pair.",
              "Machine Learning: Develop a classification model (e.g., Random Forest) trained on a labeled dataset of command lines, using features like keyword presence, n-grams, and entropy, to predict the probability of maliciousness and alert on high-probability events."
            ]
          },
          {
            "description": "An Office application spawns a child process that is statistically rare for the environment or is a system or network utility not typically launched from Office, such as `net.exe`, `regsvr32.exe`, or `whoami.exe`.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers",
            "action": [
              "Symbolic: Maintain an explicit denylist of high-risk child processes for Office applications (e.g., `net.exe`, `whoami.exe`, `regsvr32.exe`, `rundll32.exe`, `powershell.exe`, `wscript.exe`, `cscript.exe`) and alert whenever an Office parent spawns a process on this list.",
              "Statistical: Build a frequency table of all parent-child process relationships observed over a 30-day rolling window. Alert when a parent-child relationship occurs that is new or falls below a low prevalence threshold (e.g., seen in less than 0.1% of all process creation events or on fewer than 5 unique hosts).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features from process creation events (parent process name, child process name, user, hostname group) to identify clusters of normal behavior. Flag any new event that does not fit into an existing cluster as an anomaly requiring investigation."
            ]
          },
          {
            "description": "A file with an executable or script extension (.dll, .vbs, .ps1, .js) is written to an Office startup or template directory by a process that is not an Office application or a known software installer (e.g., msiexec.exe).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, File servers hosting shared templates, Terminal servers",
            "action": [
              "Symbolic: Monitor file write events (Windows Event ID 4663) in Office startup or template paths. Correlate the ProcessID with process logs (Windows Event ID 4688) and alert if the writing process is on a denylist of non-installer and non-Office processes (e.g., `powershell.exe`, `cmd.exe`, `wscript.exe`, `rundll32.exe`).",
              "Statistical: Baseline the set of processes that normally write to these directories across the enterprise. Alert on any file write event from a process that has never been observed writing to these locations before. Additionally, track the prevalence of file extensions written to these paths and flag statistically rare extensions like `.exe` or `.dll`.",
              "Machine Learning: Use a sequence analysis model (e.g., a Hidden Markov Model) to analyze the sequence of events preceding a file write in a startup path (e.g., network connection from a rare IP in `Zeek conn.log` -> `powershell.exe` process creation -> file write to XLSTART). Flag sequences that deviate significantly from learned models of normal user behavior."
            ]
          },
          {
            "description": "A registry value under an Office add-in key (`HKCU\\Software\\Microsoft\\Office\\...\\Addins`) is created or modified by an anomalous process (e.g., powershell.exe), or the modification installs an add-in whose `FriendlyName` or DLL path is rare across the enterprise.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Domain Controllers, Terminal servers",
            "action": [
              "Symbolic: Monitor registry modifications (Windows Event ID 4657) to Office add-in keys. Correlate the ProcessID with process logs (Windows Event ID 4688) and alert if the modifying process is on a denylist (e.g., `cmd.exe`, `powershell.exe`, `reg.exe`) and not a known installer or updater process.",
              "Statistical: Build an enterprise-wide baseline of all Office add-in `FriendlyName` and DLL paths. Calculate the prevalence (percentage of hosts) of each add-in. Alert on the installation of any new add-in that is present on fewer than 1% of endpoints or is entirely new to the environment.",
              "Machine Learning: Apply an unsupervised anomaly detection model (e.g., Isolation Forest) to features of the registry modification event (process name, username, time of day, add-in prevalence score, add-in path). Flag modifications that are identified as significant outliers from normal software installation and configuration profiles."
            ]
          },
          {
            "description": "An Outlook rule is created that is configured to launch an external application, contains keywords associated with scripting (`.vbs`, `.ps1`), or has a name with high entropy or consisting only of non-alphanumeric characters (e.g., '.', '..').",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4663",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Microsoft Exchange servers, Office 365 tenant",
            "action": [
              "Symbolic: From Microsoft 365 Unified Audit Logs, search for `New-InboxRule` events where the `-RunAnApplication` parameter is used. On endpoints, monitor registry modifications (Windows Event ID 4657) to keys containing Outlook rule data and scan the data content for strings indicating application execution (`.exe`, `.dll`, `.vbs`, `.ps1`); alert on match.",
              "Statistical: Calculate the character entropy of all new Outlook rule names. Flag rule names that are in the 99th percentile for entropy or consist entirely of non-alphanumeric characters. Additionally, track the rate of rule creation per user and alert if it exceeds their historical baseline by more than 3 standard deviations for a 30-day window.",
              "Machine Learning: Apply a time-series anomaly detection model to the volume of Outlook rule modifications (`New-InboxRule`, `Set-InboxRule`) across the organization to alert on anomalous spikes in activity. A classification model could also be trained to predict malicious rules based on features like name entropy, action type, and condition complexity."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]