[
  {
    "information_requirement": "Is the adversary communicating via command and control using non-standard encoding?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1132.002",
        "name": "Non-Standard Encoding",
        "evidence": [
          {
            "description": "A JA3/JA3S hash or a combination of HTTP headers observed in network traffic has an exact match in a threat intelligence feed identifying C2 frameworks known to use non-standard encoding.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, Web proxies, TLS-terminating load balancers",
            "action": [
              "Ingest a threat intelligence feed of known malicious JA3/JA3S hashes and HTTP header signatures. Create a watchlist and run a continuous query against Zeek ssl.log and http.log records to alert on any exact matches.",
              "On a daily basis, compute the population frequency of all JA3/JA3S hashes and unique HTTP User-Agent strings observed in Zeek logs. Isolate and investigate any hash or string that appears on fewer than 5 unique hosts enterprise-wide but is associated with persistent, beacon-like connections from one of those hosts.",
              "Engineer features from Zeek ssl.log (e.g., one-hot encoded cipher suites, count of TLS extensions) and http.log (e.g., header counts, User-Agent string length). Apply an unsupervised clustering algorithm like DBSCAN to group client sessions. Manually label large clusters as 'known good' (e.g., Chrome, Firefox) and schedule periodic reviews of small, newly formed clusters or outlier points for signs of non-standard clients."
            ]
          },
          {
            "description": "Evidence of a patterned data channel is present in the form of DNS queries with abnormally long, high-entropy subdomains or HTTP requests containing static, non-standard custom headers.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Web proxies, Egress firewalls",
            "action": [
              "Create a detection rule to search Zeek http.log for the presence of known-bad custom HTTP headers (e.g., 'X-Config', 'X-Session-ID') used by C2 frameworks. Trigger an alert if a matching header is found in traffic exhibiting periodic connections (beaconing) in Zeek conn.log.",
              "For each internal source IP, calculate the standard deviation of query name length and the average Shannon entropy of query names from Zeek dns.log over a 1-hour window. Generate an alert if the standard deviation of length is below 1.0, the average length is greater than 32 characters, and the average entropy is above 3.5, indicating a fixed-length, high-entropy data channel.",
              "Build a labeled dataset of DNS queries from known DGA and DNS tunneling tools, and a sample of legitimate internal DNS traffic. Train a classifier (e.g., Random Forest) using features like query length, entropy, numeric character ratio, and vowel-to-consonant ratio. Deploy the model to score all outbound DNS queries in real-time and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A network connection shows a statistically anomalous ratio of bytes sent to bytes received when compared against the historical baseline for its destination port and protocol, suggesting data upload or a non-standard heartbeat.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, Internal network core switches, Firewall egress points",
            "action": [
              "Create a rule to alert on any Zeek conn.log entry where `orig_bytes` is more than 10 times `resp_bytes` on destination ports 80, 443, or 53, and the destination IP is present on a threat intelligence blocklist.",
              "Over a 30-day rolling window, calculate the mean and standard deviation of the ratio `orig_bytes / resp_bytes` for each common destination port (e.g., 80, 443, 22, 53) from Zeek conn.log. Generate a high-severity alert for any new connection where this ratio exceeds 3 standard deviations above the historical mean for its port.",
              "For each host, model the time series of total outbound bytes per hour using a forecasting model like Prophet or ARIMA. Generate an alert whenever the actual outbound data volume in a given hour exceeds the model's predicted upper confidence interval (e.g., 99% CI), indicating an unforeseen spike in data transfer."
            ]
          },
          {
            "description": "The calculated Shannon entropy of data within a specific protocol field (e.g., HTTP URI, DNS query name, TLS SNI) is a statistical outlier relative to the historical baseline for that field, indicating the presence of non-textual, encoded data.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, Internal DNS resolvers, Internet gateways",
            "action": [
              "Implement a regular expression search across the URI field in Zeek http.log to find strings longer than 50 characters that match the format of Base64 encoding. Alert on any match, especially when correlated with a POST request.",
              "For the 'uri' field in http.log and the 'query' field in dns.log, calculate the 99th percentile of Shannon entropy scores based on the last 30 days of data. Create a real-time rule that calculates the entropy for each new log entry and triggers an alert if the value exceeds this dynamic 99th percentile threshold.",
              "From a baseline of known-good traffic, extract entropy scores for HTTP URIs and DNS queries. Train a One-Class SVM anomaly detection model on this dataset. Deploy the model to score new events in real time, flagging any data point identified as an anomaly (outside the learned decision boundary) for analyst review."
            ]
          },
          {
            "description": "A network connection with indicators of non-standard encoding (e.g., high entropy URI, anomalous data ratio) is initiated by a process executing from a suspicious file path (%TEMP%, %APPDATA%) or a process not on an established application allowlist.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Critical application servers, Domain Controllers",
            "action": [
              "Correlate Windows Event ID 5156 (Network Connection) with Windows Event ID 4688 (Process Creation) using the Process ID. Alert if the process name is 'powershell.exe', 'rundll32.exe', or 'mshta.exe', the process is executing from a user-writable path (e.g., C:\\Users\\*), and the remote address in the 5156 event is on a threat intelligence blocklist.",
              "From Windows Event ID 5156 logs, build a frequency table of 'Application' file paths that initiate outbound connections. Alert on any connection from an application path that has been seen on fewer than 10 endpoints enterprise-wide in the last 30 days, prioritizing alerts for paths in temporary or user-writable directories.",
              "Create a feature set by joining host events (Windows Event ID 4688/5156 for process path, parent process) with network events (Zeek conn.log for data volumes, duration). Train a supervised classification model (e.g., Gradient Boosting) on a labeled dataset of malicious and benign connections. Deploy the model to score all new outbound connections, and create high-priority alerts for connections classified as malicious with a confidence score > 0.9."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]