[
  {
    "information_requirement": "Is an adversary enumerating network shares to identify data for collection or hosts for lateral movement?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1135",
        "name": "Network Share Discovery",
        "evidence": [
          {
            "description": "A process or script executes where the file hash (e.g., SHA256) matches a known indicator of compromise (IOC) for network discovery tools like PowerView or BloodHound.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Workstation Subnets, Server Subnets, Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule to continuously monitor process creation (Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104). For new processes or scripts, calculate the file or script block hash. Compare the hash against a curated threat intelligence list of known discovery tool hashes. Generate a high-severity alert upon any match.",
              "Statistical: Maintain a baseline of all executable and script block hashes observed across the environment. Calculate the prevalence (rarity) of each hash based on the number of hosts it has been seen on. Flag any hash that is both rare (e.g., seen on < 0.1% of hosts) and not on an established allowlist of known-good software for investigation.",
              "ML: Deploy a pre-trained machine learning classifier (e.g., Gradient Boosting, Random Forest) that uses static file features (e.g., file entropy, imported API functions, embedded strings) to predict if a previously unseen executable is a 'discovery tool'. Run this classifier on newly observed, low-prevalence files to proactively identify unknown threats."
            ]
          },
          {
            "description": "Built-in network share discovery commands (e.g., `net view`, `net share`) or PowerShell equivalents (e.g., `Get-SmbShare`) are executed from an unusual parent process, such as a web server process or a Microsoft Office application.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Workstation Subnets, Server Subnets, Domain Controllers, Web Servers",
            "action": [
              "Symbolic: Create detection rules that search process command-line arguments (Event ID 4688) and PowerShell script content (Event ID 4104) for regular expressions matching discovery commands like '(?i)net\\\\.exe\\\\s+(view|share)' or 'Get-SmbShare'. Heighten alert severity if the parent process is not 'cmd.exe' or 'powershell.exe' (e.g., 'winword.exe', 'w3wp.exe').",
              "Statistical: Profile all parent-child process relationships across the environment to establish a frequency baseline. Calculate the conditional probability of a discovery command being executed by each unique parent process, $$ P(\\text{child} | \\text{parent}) $$. Flag any execution where the parent process falls below a low probability threshold (e.g., < 1%) as anomalous.",
              "ML: Utilize a sequence-aware model (e.g., LSTM) trained on command-line histories per user session to learn normal sequences of activity. Flag user sessions containing command sequences that are statistically unlikely but characteristic of reconnaissance, such as a user running `whoami`, then `ipconfig /all`, then `net view \\\\fileserver01` in a short time frame."
            ]
          },
          {
            "description": "A single source host establishes SMB connections (TCP/445) to an anomalously high number of unique destination hosts or shares within a short time window, indicative of scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb_mapping.log",
              "Windows Event ID 5140",
              "Firewall Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs and SPAN ports on core switches, Network Egress/Ingress points, File Servers, Domain Controllers",
            "action": [
              "Symbolic: Implement a stateful rule that triggers when a single source IP ('id.orig_h' in Zeek conn.log) connects to more than 20 unique destination IPs ('id.resp_h') on destination port 445 within a 5-minute window. Alert on this potential SMB scanning activity.",
              "Statistical: For each source host, aggregate SMB connection events (from Zeek smb_mapping.log or Windows Event ID 5140) over a 10-minute rolling window. Calculate the count of unique destination hosts and unique shares accessed. Compare this count against a dynamically calculated 98th percentile for all hosts. A count exceeding this percentile indicates statistically significant scanning behavior.",
              "ML: Apply a time-series anomaly detection algorithm (e.g., ARIMA, Prophet) to the rate of new SMB connections originating from each host. The model will learn the normal 'heartbeat' of SMB traffic for each host and alert on sudden, unexplained spikes that deviate from the forecast. Alternatively, use a clustering algorithm like DBSCAN on features such as (unique_dest_count, total_connections, total_bytes) to identify outlier hosts that represent scanners."
            ]
          },
          {
            "description": "A user account or host accesses a set of network shares that is inconsistent with its established baseline of activity, such as accessing shares for the first time or shares belonging to a different business unit.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Windows Event ID 5140",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, Domain Controllers (for authentication correlation), Application Servers with sensitive shares, HR and Finance department servers",
            "action": [
              "Symbolic: Maintain a state table or lookup file of (user, share) access pairs seen over the last 30-60 days. Generate a low-severity alert whenever a new (user, share) pair is observed for the first time. This can be used for correlation with other suspicious activity.",
              "Statistical: For each user, create a historical profile of accessed shares and their access frequency. On a daily basis, calculate the Shannon entropy of the shares accessed by the user: $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. A sudden, sharp increase in entropy suggests the user is accessing a wider and more varied set of shares than usual, indicating potential discovery activity.",
              "ML: Model the environment as a bipartite graph of users and shares, where edges represent access events. Use a graph-based anomaly detection algorithm (e.g., GraphSAGE) to learn embeddings for each user and share based on normal access patterns. Flag new access attempts (new edges) that have a high anomaly score, indicating the access is inconsistent with the user's learned role or community cluster."
            ]
          },
          {
            "description": "A non-administrative user account or a host not designated for management activities attempts to access administrative shares (e.g., C$, ADMIN$, IPC$) on one or more systems.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Windows Event ID 5140"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Workstation Subnets, Server Subnets, Domain Controllers, Privileged Access Workstations (PAWs)",
            "action": [
              "Symbolic: Filter SMB access logs (Windows Event ID 5140's 'ShareName' field or Zeek smb_mapping.log's 'path' field) for attempts to access shares matching the regex '^\\\\\\\\.*\\\\(C|ADMIN|IPC)\\\\$'. Cross-reference the source user account with an identity management group of privileged accounts. Generate a high-severity alert if the source user is not in the privileged group.",
              "Statistical: Profile the set of source hosts that legitimately connect to administrative shares (e.g., SCCM servers, admin jump boxes). Alert when an admin share connection originates from a host not in this established baseline set. Additionally, calculate the ratio of admin share connections to total share connections per user; a ratio significantly higher than the user's historical norm or the peer group norm is suspicious.",
              "ML: Train a classification model (e.g., Logistic Regression) to score each administrative share access event for maliciousness. Use features such as: 'source_is_privileged_user', 'source_is_management_host', 'time_of_day', 'target_is_domain_controller', and 'is_first_time_access_from_host'. An event with a high probability score from the model indicates likely malicious activity."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]