[
  {
    "information_requirement": "Is the adversary maintaining persistence using malicious or abused software extensions?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1176",
        "name": "Software Extensions",
        "evidence": [
          {
            "description": "A browser process (e.g., chrome.exe, firefox.exe) establishes a network connection to a destination IP, domain, or URL that is present on a high-confidence threat intelligence feed categorized as a command-and-control (C2) server.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Network egress points, DNS resolvers, SIEM/Data Lake",
            "action": [
              "Symbolic: Correlate process creation logs (Windows Event ID 4688 identifying browser processes) with network connection logs (Zeek conn.log) and DNS queries (Zeek dns.log). Generate an alert if the destination IP address or resolved domain matches an entry on a high-confidence C2 threat intelligence feed.",
              "Statistical: Analyze Zeek conn.log to identify browser processes communicating with IP addresses that have a very low prevalence (e.g., seen on <0.01% of hosts) across the enterprise over the last 30 days. Separately, calculate the Jaccard similarity between the set of domains contacted by a user's browser today and their historical 90-day baseline; a score below a tuned threshold (e.g., 0.5) indicates a significant behavioral change warranting review.",
              "Machine Learning: Use a pre-trained Natural Language Processing (NLP) model to classify DNS query names as either legitimate or algorithmically generated (DGA). Flag browser-initiated DNS queries that are classified as DGA with high confidence, as this can indicate C2 communication from a malicious extension."
            ]
          },
          {
            "description": "A process, such as a browser or script interpreter, launches with command-line arguments indicating the loading of an unpacked extension from a non-standard or user-writable directory (e.g., '--load-extension=C:\\Users\\Public\\...').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers)",
            "action": [
              "Symbolic: Create a detection rule that searches process creation events (Windows Event ID 4688, Sysmon Event ID 1) for browser executables (e.g., chrome.exe, msedge.exe) launched with '--load-extension=' or '--user-data-dir='. Alert if the specified path is in a high-risk directory like %TEMP%, %APPDATA%\\..\\LocalLow, or C:\\Users\\Public.",
              "Statistical: For each user, profile the parent processes that typically launch browser executables (e.g., explorer.exe). Calculate the enterprise-wide rarity of each parent-child process relationship. Flag instances where a rare parent (e.g., winword.exe, powershell.exe) launches a browser with extension-loading flags, particularly if the relationship's frequency is below the 1st percentile.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on command-line arguments from browser process launch events. Extract features such as argument count, total length, entropy of path arguments, and the presence of keywords like 'load-extension' or 'debug'. Use the model to score new process events for their likelihood of being a malicious sideloading attempt."
            ]
          },
          {
            "description": "A process other than the parent browser executable, its legitimate updater, or a whitelisted administrative tool, accesses sensitive browser data files such as those storing credentials, cookies, or session tokens (e.g., 'Login Data', 'Cookies').",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, File servers hosting roaming user profiles",
            "action": [
              "Symbolic: Deploy file access auditing (SACL) on sensitive browser directories (e.g., '%LOCALAPPDATA%\\Google\\Chrome\\User Data\\Default\\'). Monitor file access events (Windows Event ID 4663) or process access events (Sysmon Event ID 10). Create an allowlist of legitimate processes (chrome.exe, software_reporter_tool.exe). Alert whenever a process not on the allowlist accesses protected files like 'Login Data' or 'Cookies'.",
              "Statistical: For key browser data files like 'Login Data', establish a baseline of unique processes that access them per host over a rolling 24-hour window. Calculate the Shannon entropy of the set of accessing process names. A sudden increase in entropy on a host, exceeding 3 standard deviations from its historical mean, indicates an anomalous number of new processes are accessing the file.",
              "Machine Learning: Use an anomaly detection algorithm, such as an Isolation Forest, on enriched file access events (Event ID 4663). Model features should include the source process name, target file path, access type (e.g., ReadData, WriteData), and time of day. Train the model on normal activity to flag highly anomalous access patterns, such as a script interpreter accessing the cookie database at 3:00 AM."
            ]
          },
          {
            "description": "A browser process initiates network connections exhibiting characteristics of command-and-control (C2) communication, such as high-entropy domain names, communication to recently registered domains, use of non-standard ports, or highly periodic, low-volume 'heartbeat' traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Web proxies, DNS servers, SIEM/Data Lake",
            "action": [
              "Symbolic: From DNS logs (Zeek dns.log), enrich queries with WHOIS data. Generate an alert for any DNS query from a browser process that resolves to a domain registered within the last 30 days. Additionally, from connection logs (Zeek conn.log), alert on any connection from a browser process to a destination port other than 80 or 443, excluding known-good services.",
              "Statistical: For each host, calculate the Shannon entropy of requested domain names (from Zeek dns.log) from browser processes over a 5-minute window. Alert if a host's entropy score exceeds the 95th percentile of the enterprise-wide baseline. Separately, analyze connection logs (Zeek conn.log) to identify beaconing: for a given source-destination IP pair, calculate the standard deviation of the time delta between consecutive connections. A standard deviation close to zero for a series of at least 5 connections indicates a periodic heartbeat.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., LSTM Autoencoder) on network traffic features aggregated per host per minute (e.g., bytes out, bytes in, connection count). Train the model on several weeks of baseline activity. Use the model to identify time windows where a host's reconstruction error is high, indicating a significant deviation from normal traffic patterns."
            ]
          },
          {
            "description": "Following the creation of a new file in a browser's extension directory, a subsequent persistence-related event is observed on the same host within a 10-minute window. Such events include new service creation, new scheduled task creation, or modification of a registry run key.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 7045",
              "Windows Event ID 4698",
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Active Directory domain controllers",
            "action": [
              "Symbolic: Create a time-bound correlation rule that triggers an alert if a file creation event (Sysmon Event ID 11) in a known browser extension path is followed within 10 minutes on the same host by a new service creation (Windows Event ID 7045), a new scheduled task (Windows Event ID 4698), or a modification to a registry autorun key (Windows Event ID 4657).",
              "Statistical: Calculate the baseline conditional probability of a persistence event (e.g., new service) occurring given a new extension installation has occurred within the last hour. Use a chi-squared test to assess if the association between 'new extension' and 'new persistence' event types is statistically significant (p-value < 0.01) compared to their independent baseline frequencies.",
              "Machine Learning: Use a sequence analysis model (e.g., frequent pattern mining) on streams of host events. Define 'extension_install' as an event item. The model can learn common, benign event sequences that follow an installation. Flag any sequence that deviates significantly from learned patterns or contains a rare transition from 'extension_install' to a 'persistence' state (e.g., New-Service, Schtasks-Create)."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]