[
  {
    "information_requirement": "Is the adversary attempting to gather credentials using forced authentication?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1187",
        "name": "Forced Authentication",
        "evidence": [
          {
            "description": "An outbound SMB (TCP/445, TCP/139) or WebDAV (TCP/80, TCP/443) connection is initiated from an internal, RFC1918-spaced IP address to an external, non-RFC1918 IP address that is present on a threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, DNS resolvers, Perimeter firewalls, Web proxies",
            "action": [
              "Create a SIEM rule that joins Zeek conn.log with a threat intelligence feed of known malicious IPs. Alert when an internal id.orig_h connects to an external id.resp_h that is on the feed, and the id.resp_p is 445 or 139. For WebDAV, alert if id.resp_p is 80 or 443 and Zeek http.log shows a PROPFIND or OPTIONS method for the same connection.",
              "Enrich Zeek conn.log with GeoIP and ASN data. For all outbound connections on ports 139, 445, 80, and 443, establish a 30-day baseline of destination countries and ASNs. Calculate the frequency distribution and alert on any connection to a destination country or ASN that falls into the bottom 5% of the frequency table, indicating a rare destination.",
              "Train a supervised classification model (e.g., Random Forest) on labeled historical connection data (benign vs. malicious). Engineer features such as destination IP reputation, ASN, country, connection duration, service identified by Zeek, and whether the destination FQDN from dns.log is newly registered. Deploy the model to score new outbound connections in real-time and alert on high-probability malicious attempts."
            ]
          },
          {
            "description": "A file with a .lnk, .scf, or .url extension is created on an endpoint, and the file's target path contains a UNC path (\\\\...) pointing to an external IP address or a domain not on an approved list of corporate or partner domains.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 11",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Shared network drives, Publicly accessible file shares, Terminal servers, Domain Controllers",
            "action": [
              "Monitor for Sysmon Event ID 11 (FileCreate) events where the TargetFilename ends in .lnk, .scf, or .url. For each event, parse the file content or properties to extract the target path. Alert if the path starts with `\\\\` and the subsequent server name is a non-RFC1918 IP address or a domain not on an allowlist.",
              "From file creation events (Sysmon Event ID 11), parse the server name from the target path of all new .lnk, .scf, and .url files. Maintain a 90-day baseline of the most frequent server names. Alert when a newly created file points to a server name that is not in the top 99% of the historical frequency list.",
              "Train a text classification model (e.g., using a transformers-based model) to distinguish between benign and malicious link file paths. Features can be engineered from the path string, including length, character entropy, presence of IP addresses, TLD of domain, and presence of keywords. Use the model to scan the target paths of new files and alert on those classified as malicious."
            ]
          },
          {
            "description": "An Office document (.docx, .xlsx, .rtf, .dotm) or HTML file transferred over the network contains an embedded resource tag (e.g., OLE object, picture, template) that references an external SMB share using a `file://` or `\\\\` URI scheme.",
            "data_sources": [
              "Zeek files.log",
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email gateways, Web proxies, Endpoint download directories, Network file shares",
            "action": [
              "Configure Zeek to extract and scan the content of transferred files (e.g., application/msword, text/html) from files.log. Alert if the file content matches the regex pattern `(file:|\\\\)\\\\\\\\[^\\\\]+` which identifies a UNC path. Correlate with endpoint logs (Sysmon Event ID 1) to identify the parent process (e.g., OUTLOOK.EXE, CHROME.EXE) that handled the file.",
              "Over a 30-day period, extract and baseline all domains and IPs found in `file://` URIs within documents. Create a frequency distribution of these destinations. Alert when a new document contains a `file://` URI pointing to a destination that is statistically rare (e.g., has not been seen before or is in the bottom 1% of occurrences) and is not an internal corporate resource.",
              "Develop a document classifier using a gradient boosting model. Extract features from documents, including: count of `file://` links, whether the link target is an external IP, whether the link is hidden, presence of VBA macros, and file source metadata from Zeek. Train the model to predict a malice score for documents received from external sources."
            ]
          },
          {
            "description": "The number of unique external destinations for outbound SMB (TCP/445, TCP/139) or WebDAV (TCP/80, TCP/443) connections from a single internal host exceeds a dynamic or established baseline by a statistically significant margin within a 24-hour period.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internet gateways, Firewall logs",
            "action": [
              "Create a SIEM rule that triggers if a single internal host (id.orig_h) initiates more than 10 outbound SMB or WebDAV connections to distinct external IP addresses (id.resp_h) within a 60-minute window. This threshold should be tuned based on environmental norms.",
              "For each internal host, establish a 30-day rolling baseline of the daily count of unique external destinations for SMB/WebDAV traffic. Alert if a host's current daily count exceeds 3 standard deviations above its historical mean, or if it exceeds the 98th percentile of its historical daily counts.",
              "For each host, apply a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the hourly count of unique outbound SMB/WebDAV destinations. Train the model on at least 30 days of historical data to learn the host's normal behavior patterns, including seasonality. Alert when a new data point is flagged as an anomaly by the model."
            ]
          },
          {
            "description": "A user workstation, not designated as a management or scanning system, initiates SMB (TCP/445) connections to more than 50 other internal workstations within a 1-hour timeframe, deviating from a baseline of zero or near-zero workstation-to-workstation SMB traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, VLANs for user workstations, Domain Controller security logs, Core network switches",
            "action": [
              "Using an asset inventory to distinguish workstation subnets from server subnets, create a rule that alerts when a source IP in a workstation subnet initiates SMB connections to more than 50 unique destination IPs, also in workstation subnets, within a 1-hour window. Exclude known administrative systems from triggering this alert.",
              "Construct a daily communication graph of all internal SMB traffic. For each node identified as a workstation, calculate its out-degree (number of unique destinations). Establish a baseline for this metric across all workstations. Alert if any workstation's out-degree exceeds the 99th percentile for all workstations, indicating anomalous fan-out activity.",
              "On a daily basis, create a feature vector for each workstation including: number of outbound SMB connections to other workstations, number of failed SMB connections, and the entropy of destination workstation IPs. Use a density-based clustering algorithm (e.g., DBSCAN) to group hosts by behavior. Investigate hosts that are classified as noise points, as they represent a significant deviation from normal peer-to-peer communication patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]