[
  {
    "information_requirement": "Is the adversary collecting sensitive information from internal SharePoint repositories? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1213.002",
        "name": "Data from Information Repositories: Sharepoint",
        "evidence": [
          {
            "description": "A user account accesses a SharePoint document or list item whose title, path, or content contains sensitive keywords (e.g., 'password', 'network diagram', 'API key'), and the access is anomalous based on the user's role, historical access patterns, or source geolocation.",
            "data_sources": [
              "SharePoint Audit Logs (AuditData.Read)",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Farm Servers, Domain Controllers, Internet Gateway/VPN Concentrators, User Workstations",
            "action": [
              "Create and maintain a watchlist of sensitive keywords ('password', 'secret', 'API_key', 'network_diagram', 'credentials'). Query SharePoint audit logs for read events on documents whose metadata or content matches these keywords. Generate a high-priority alert if the accessing user is not a member of a pre-approved Active Directory group for that data type.",
              "For each user, establish a 30-day rolling baseline of their sensitive keyword access frequency. Use descriptive statistics to calculate the mean and standard deviation. Generate an alert if a user's daily keyword-hit count exceeds their personal baseline by 3 standard deviations (Z-score > 3) or surpasses the 95th percentile of their departmental peer group's activity.",
              "Train a supervised classification model (e.g., Random Forest) using features such as user role, source IP geolocation and reputation, time of day, day of week, and historical access frequency. Label known benign access and simulated malicious access. Deploy the model to classify each new sensitive document access in real-time as 'benign' or 'suspicious', alerting on high-probability suspicious events."
            ]
          },
          {
            "description": "HTTP requests to SharePoint servers contain User-Agent strings, API call patterns (e.g., /_vti_bin/, /_api/web/lists), or URI query parameters associated with known SharePoint reconnaissance tools. Separately, PowerShell script block logs on client machines show execution of SharePoint enumeration cmdlets.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Web Front-End Servers, User Workstations, Network Egress/Ingress Points",
            "action": [
              "Deploy regular expression rules against Zeek http.log `user_agent` and `uri` fields to detect signatures for tools like SharePointMapper, PowerSploit, or other enumeration scripts (e.g., `/_vti_bin/usergroup.asmx`, `/_api/web/siteusers`). Separately, search Windows Event ID 4104 logs for execution of cmdlets like `Get-SPOSite` or `Get-SPOList` outside of known administrative scripts or interactive sessions from non-admin users.",
              "For each source IP interacting with SharePoint APIs, calculate the Shannon entropy of the URI query parameters within a 5-minute sliding window. Establish a baseline entropy score for normal API traffic. Generate an alert if the entropy score for a given IP's window exceeds 3 standard deviations from the global baseline, indicating potential scanning or fuzzing.",
              "Implement a time-series anomaly detection model (e.g., LSTM Autoencoder) on the frequency of `/_api/` and `/_vti_bin/` calls per user or source IP. Train the model on historical Zeek http.log data to learn normal request patterns and flag sessions with anomalous sequences or volumes of API calls that deviate from the learned norm."
            ]
          },
          {
            "description": "A single user account accesses a number of unique SharePoint files, pages, or sites that is statistically significant compared to the user's own 30-day baseline and the baseline of their departmental peer group.",
            "data_sources": [
              "SharePoint Audit Logs (AuditData.Read)",
              "Active Directory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Farm Servers, Domain Controllers",
            "action": [
              "Create a high-threshold rule that generates a critical alert if any single user account accesses more than 1,000 unique document URLs in a one-hour period. This serves as a simple tripwire for egregious data collection activity.",
              "For each user, calculate a rolling 30-day baseline (mean and standard deviation) of unique documents accessed per hour. Generate an alert if a user's hourly access count exceeds their personal baseline by 3 standard deviations (Z-score > 3) and also exceeds the 99th percentile for their departmental peer group (defined by AD attributes).",
              "Develop a user-level anomaly detection model using clustering (e.g., DBSCAN) on features like 'number_of_unique_files_accessed_per_hour', 'diversity_of_site_collections_accessed', and 'off_hours_access_ratio'. Users who are classified as outliers from the main 'normal user' cluster should be flagged for investigation."
            ]
          },
          {
            "description": "An Active Directory account belonging to a highly privileged group (e.g., Domain Admins, Enterprise Admins, Schema Admins) authenticates to and accesses resources on a SharePoint server, where such activity is not part of documented, routine administrative duties.",
            "data_sources": [
              "SharePoint Audit Logs (AuditData.Read)",
              "Windows Event ID 4624",
              "Active Directory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Farm Servers, Domain Controllers",
            "action": [
              "Create and maintain a watchlist of all user accounts in privileged AD groups (e.g., 'Domain Admins'). Generate an immediate, critical alert for any SharePoint access event (read, write, browse) attributed to a user on this watchlist, as this activity should be explicitly forbidden by policy.",
              "If a privileged account has a documented, legitimate reason for SharePoint access, baseline that specific activity profile (e.g., specific document paths, source workstation, time of day). Any access event from that account that deviates from the narrowly defined baseline should trigger a high-priority alert.",
              "Use a one-class SVM model trained exclusively on documented, legitimate administrative access patterns (if any exist). Any SharePoint access by a privileged account that the model classifies as an anomaly should trigger an immediate high-priority alert for SOC investigation."
            ]
          },
          {
            "description": "A user account accesses one or more sensitive documents on SharePoint, and within a 30-minute window, the source endpoint associated with that user initiates network connections to internal file shares or external destinations not previously associated with the user's profile.",
            "data_sources": [
              "SharePoint Audit Logs (AuditData.Read)",
              "Zeek conn.log",
              "Windows Event ID 5145",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Farm Servers, Internal File Servers, User Workstations, Network Core Switches, DNS Servers",
            "action": [
              "Create a correlation rule: IF a user triggers a 'sensitive SharePoint document access' alert, THEN search for subsequent network connections from the same source IP within 30 minutes. IF a connection to an internal host on port 445 (SMB) or an external IP is observed, escalate the original alert's priority.",
              "For each user, establish a baseline of common internal IP destinations (from Zeek conn.log) and DNS query domains (from Zeek dns.log). Following a SharePoint sensitive file access event, if the user connects to an internal IP they have never connected to before, or queries for a rare or new external domain, flag the sequence for review.",
              "Develop a sequence analysis model (e.g., a Hidden Markov Model) where states represent user actions ('browse SharePoint', 'access sensitive file', 'connect to file share', 'connect to external IP'). Train the model on normal user behavior. An observed sequence of 'access sensitive file' -> 'connect to new internal share' would have a low probability under the model and trigger a high-confidence alert."
            ]
          },
          {
            "description": "A user account downloads a volume of data or number of files from SharePoint that is statistically anomalous compared to their history. This activity is followed within one hour by either the execution of an archival utility (e.g., 7z.exe, rar.exe) on the user's endpoint or a large data transfer to an external destination.",
            "data_sources": [
              "SharePoint Audit Logs (FileDownloaded)",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Farm Servers, User Workstations, Network Egress/Ingress Points",
            "action": [
              "Create a correlation rule: IF a SharePoint 'FileDownloaded' event for a single user exceeds 500MB in 1 hour, THEN monitor the associated endpoint. IF a process creation event (Windows Event ID 4688) for `7z.exe`, `rar.exe`, or `tar.exe` is observed on that user's workstation within the next hour, generate a high-priority alert.",
              "For each user, calculate a rolling 30-day baseline (mean, standard deviation, 98th percentile) for total data volume downloaded from SharePoint per day. Generate an alert if a user's daily download volume exceeds the 98th percentile of their own historical data or 3 standard deviations above their mean.",
              "Train a regression model to predict a user's expected daily outbound data transfer volume (from Zeek conn.log `orig_bytes`) based on their role, time of day, and recent SharePoint download activity. If the actual outbound data transfer significantly exceeds the model's prediction (i.e., a large residual error), flag it as a potential exfiltration event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]