[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using msiexec.exe?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.007",
        "name": "Msiexec",
        "evidence": [
          {
            "description": "An msiexec.exe process is observed initiating a network connection to download a package from a URL or IP address present in a threat intelligence feed, or the hash of the downloaded file matches a known malicious signature.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and servers; Network egress points including forward proxies and perimeter firewalls; DNS resolvers.",
            "action": [
              "Symbolic: Query for msiexec.exe process creation events (Windows Event ID 4688) with command lines containing '/i http' or '/i //'. Correlate the source host IP and timestamp with network logs (Zeek conn.log, http.log, dns.log). Alert if the remote domain, URL, or IP address matches an active threat intelligence feed of malicious indicators.",
              "Statistical: For all remote installations via msiexec.exe, extract the domain from the URL. Calculate the domain's registration age and its prevalence (count of unique hosts contacting it) across the enterprise over a 30-day baseline. Generate an anomaly score where a domain age < 90 days and a prevalence < 5 hosts receives a high score. Alert on scores exceeding a defined threshold.",
              "ML: Train a Random Forest classification model using features from command line and network data, including URL path entropy, query parameter count, destination port, domain TLD, and threat intelligence reputation score. Classify each msiexec.exe execution involving a remote package to produce a maliciousness probability score. Alert on any score greater than 0.90."
            ]
          },
          {
            "description": "An msiexec.exe process is executed with suspicious argument combinations, such as silent remote installation (/q /i http...) or DLL registration/unregistration (/y or /z).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers; Centralized SIEM platform with command-line argument logging enabled.",
            "action": [
              "Symbolic: Create a high-fidelity SIEM rule to detect msiexec.exe process creation (Windows Event ID 4688) where the command line contains the argument '/y' or '/z'. Create a separate, medium-fidelity rule for command lines matching the pattern '* /q* /i http*' to detect silent remote installations.",
              "Statistical: Establish a 90-day baseline of all msiexec.exe command-line argument combinations observed in the environment. For each new execution, score its argument combination based on its frequency. Alert on any combination that falls into the bottom 1st percentile of frequency, indicating it is statistically rare and anomalous.",
              "ML: Train a one-class SVM (Support Vector Machine) anomaly detection model on a baseline of legitimate msiexec.exe command-line arguments, vectorized using techniques like TF-IDF. Use the model to identify and alert on novel or unusual combinations of arguments that deviate significantly from the learned 'normal' behavior, such as the co-occurrence of silent flags and remote sources."
            ]
          },
          {
            "description": "The parent process of msiexec.exe is an application not typically associated with software installation, such as an Office application, a scripting engine, or a web browser.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows workstations and servers configured to log process creation events with parent process information.",
            "action": [
              "Symbolic: Create a SIEM rule that alerts when a msiexec.exe process (Windows Event ID 4688) is created with a parent process from a defined list of suspicious initiators, including winword.exe, excel.exe, outlook.exe, powershell.exe, wscript.exe, cscript.exe, chrome.exe, msedge.exe, and firefox.exe.",
              "Statistical: For each user and host, build a historical baseline of parent-child process relationships involving msiexec.exe. Calculate the frequency of each parent process. Alert on any msiexec.exe execution where the parent process is statistically rare for that specific user or host profile (e.g., a parent process never seen before or accounting for <1% of historical invocations).",
              "ML: Use a graph-based anomaly detection algorithm on a process-spawning graph to identify unusual process lineage. Model normal process creation sequences over a 30-day period. Alert when a new msiexec.exe execution creates a low-probability path in the graph, such as being spawned by a browser which then terminates, indicating a potential drive-by download scenario."
            ]
          },
          {
            "description": "Within minutes of an msiexec.exe execution, the source host establishes network connections to an external IP address that is not related to the initial package download and matches known C2 patterns.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls and network taps capturing egress traffic; DNS resolvers; All Windows workstations and servers.",
            "action": [
              "Symbolic: Correlate msiexec.exe process creation events (Windows Event ID 4688) with subsequent network connections (Zeek conn.log) from the same host within a 5-minute window. Alert if the destination IP or domain (from dns.log) matches a C2 threat intelligence feed and was not the source of the initial MSI package.",
              "Statistical: For each outbound TLS connection (Zeek ssl.log) following an msiexec.exe execution, analyze the JA3/JA3S hash. Alert if the hash is statistically rare (e.g., seen in <0.1% of connections enterprise-wide) or if the server certificate issuer or subject field has high entropy, suggesting a self-signed certificate common to C2 frameworks.",
              "ML: Train a time-series forecasting model (e.g., ARIMA) on the expected outbound data volume (orig_bytes in Zeek conn.log) per host. If, following an msiexec.exe execution, the actual data volume significantly exceeds the forecasted volume (e.g., >3 standard deviations above the mean), flag it as a potential data exfiltration or C2 heartbeat anomaly."
            ]
          },
          {
            "description": "An msiexec.exe process is executed with a full command line string that has a low frequency of occurrence or high character-level entropy when compared to a 30-day rolling baseline of all msiexec.exe command lines in the environment.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM or data lake containing command-line logs from all Windows endpoints and servers.",
            "action": [
              "Symbolic: Create a SIEM rule to detect msiexec.exe command lines (Windows Event ID 4688) containing substrings indicative of obfuscation or secondary execution, such as 'powershell -e', 'certutil', 'rundll32', or long Base64-encoded strings (e.g., '[A-Za-z0-9+/=]{50,}').",
              "Statistical: Maintain a 30-day rolling baseline of all unique msiexec.exe command lines observed in the environment. For each new execution, alert if the exact command string has a frequency count below a threshold (e.g., < 5 occurrences). Additionally, calculate the Shannon entropy of the command-line string and alert on commands with entropy scores in the 99th percentile or higher.",
              "ML: Implement a character-level Long Short-Term Memory (LSTM) autoencoder trained on a large corpus of legitimate msiexec.exe command lines. For each new command line, calculate the reconstruction error. A high error score signifies that the command is anomalous and does not conform to learned legitimate patterns, indicating potential obfuscation or malicious syntax."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]