[
  {
    "information_requirement": "Is the adversary using legitimate remote access software for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1219",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "A network connection is established from an internal asset to an external IP address, domain, or SSL certificate subject known to be associated with Remote Access Software command and control infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS resolvers",
            "action": [
              "Continuously match outbound network connection logs against a threat intelligence feed of known malicious Remote Access Software C2 indicators. Generate an alert for any match found in Zeek conn.log destination IPs, Zeek dns.log queried domains, or Zeek ssl.log server name (SNI) fields.",
              "For all outbound TLS connections, calculate the Levenshtein distance between the observed SNI in Zeek ssl.log and a known-good list of legitimate remote access service domains. Alert on domains with a low distance (e.g., 1 or 2) to a legitimate domain but which are not an exact match, indicating potential typosquatting.",
              "Feed all newly observed, non-allowlisted domains from Zeek dns.log into a pre-trained Domain Generation Algorithm (DGA) detection model. Alert on any domain that the model classifies as algorithmically generated with a high confidence score."
            ]
          },
          {
            "description": "The creation of a new Windows Service (Event ID 7045) or a persistence-focused Registry modification (Event ID 4657) for a known remote access application occurs within a 5-minute window of its execution (Event ID 4688), especially when using command-line arguments for unattended access.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7045",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers), Domain Controllers (for Group Policy changes)",
            "action": [
              "Create a correlation rule that triggers when a process creation event (Windows Event ID 4688) for a known remote access executable (e.g., anydesk.exe) containing silent installation arguments (e.g., '--silent') is followed within 5 minutes by a service creation event (Windows Event ID 7045) or a Run key registry modification (Windows Event ID 4657) for the same executable. Suppress alerts for activity associated with authorized change management tickets.",
              "For each authorized remote access tool, establish a baseline of common parent processes and command-line argument combinations from Windows Event ID 4688 data. Calculate the historical frequency of each combination. Alert when a remote access tool is executed with a combination of arguments and a parent process that falls into the bottom 5th percentile of historical frequency.",
              "Apply a pre-trained classification model (e.g., Random Forest) to score new process creation events (Windows Event ID 4688) for remote access software. Use features including process name, parent process name, command-line entropy, and the presence of keywords like 'install' or 'password'. Alert on events classified as 'malicious' with a confidence score above a defined threshold (e.g., 0.90)."
            ]
          },
          {
            "description": "A process execution event (Windows Event ID 4688) shows a known remote access tool executable being launched from an atypical path (e.g., C:\\Users\\...\\AppData\\, C:\\Windows\\Temp\\), by an unusual parent process (e.g., winword.exe, chrome.exe), or with a filename that impersonates a standard Windows binary.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers)",
            "action": [
              "Create a detection rule that triggers on process creation (Windows Event ID 4688) where the parent process is a Microsoft Office application, a web browser, or a script interpreter (powershell.exe, cscript.exe) AND the child process is a known remote access tool executable. Also, alert if a known remote access tool executable is launched from any directory outside of 'C:\\Program Files\\' and 'C:\\Program Files (x86)\\'.",
              "For all process creation events, maintain a statistical model of parent-child process relationships. Alert when a remote access tool is launched by a parent process where the co-occurrence probability is below a threshold (e.g., <0.01%). Additionally, calculate the Shannon entropy of file paths for executing processes; alert when a process in a common system directory has an anomalously high entropy score, indicating a randomly named payload.",
              "Using an unsupervised clustering algorithm (e.g., DBSCAN) on process execution data (Windows Event ID 4688), group remote access tool executions based on features like file path, parent process, and command-line structure. Automatically flag and investigate small, outlier clusters that are distinct from the large clusters representing legitimate administrative activity."
            ]
          },
          {
            "description": "Network connection logs (Zeek conn.log) show that an endpoint's data egress volume to a known remote access service destination exceeds its 99th percentile of a 30-day baseline, or a connection exhibits a highly periodic, non-interactive pattern (beaconing).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, internal network sensor grid (e.g., core switch SPAN ports)",
            "action": [
              "Filter Zeek conn.log for connections on default remote access tool ports (e.g., 5938/TCP, 6568/TCP). Generate an alert if the connection originates from a host within a server VLAN where remote access tools are prohibited, or if the connection remains active for an unusually long duration (e.g., > 48 hours) without a known operational reason.",
              "For each host, establish a 30-day rolling baseline of network statistics (bytes sent, bytes received, connection count) per destination service using Zeek conn.log. Alert when a host's total outbound bytes ('orig_bytes') to a remote access service in a 24-hour period exceeds its 99th percentile. Also, alert if the ratio of bytes sent to bytes received is anomalously high (e.g., > 20:1), indicating large data exfiltration rather than interactive use.",
              "Apply a time-series anomaly detection model (e.g., ARIMA) to the aggregated hourly connection count and data volume for known remote access services across the enterprise. The model should learn the normal daily and weekly business rhythm. Flag and alert on time periods with anomalous spikes in activity, particularly during non-business hours or holidays."
            ]
          },
          {
            "description": "A sequence of process creations (Windows Event ID 4688) on a single host within a 2-minute window shows an initial execution vector (e.g., Microsoft Office application spawning PowerShell) immediately followed by the download and execution of a remote access tool.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers), Web proxy/gateway",
            "action": [
              "Define a SIEM correlation rule that alerts when the following sequence occurs on one host within a 2-minute window: 1) A parent process (e.g., winword.exe) spawns a script interpreter (e.g., powershell.exe). 2) The script interpreter makes an outbound network connection to download a file (observed in Zeek http.log). 3) A new process is created for a known remote access tool.",
              "Analyze the time delays between sequential process creation events (Windows Event ID 4688) on endpoints to build a distribution of user-driven vs. scripted actions. Alert on any sequence where a script interpreter launches a remote access tool with a time delta below the 1st percentile (e.g., < 500ms), as this speed is indicative of automated execution from a script rather than manual operator action.",
              "Deploy a sequence-based model, such as a Hidden Markov Model (HMM), trained on labeled benign and malicious process execution chains. The model's states represent process categories (e.g., 'Browser', 'Scripting', 'RAT'). Feed real-time process event streams (Windows Event ID 4688) into the model and alert when a sequence is classified as malicious with high probability, such as the 'Office App -> Scripting -> RAT' state transition path."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]