[
  {
    "information_requirement": "Is the adversary evading defenses by proxying execution through the signed SyncAppvPublishingServer.vbs script? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1216.002",
        "name": "SyncAppvPublishingServer",
        "evidence": [
          {
            "description": "The command line for a wscript.exe or cscript.exe process contains 'SyncAppvPublishingServer.vbs' followed by the 'n;' abuse pattern.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Create a detection rule using a regular expression to search process creation logs (Windows Event ID 4688) for command lines where 'wscript.exe' or 'cscript.exe' executes 'SyncAppvPublishingServer.vbs' with arguments matching the pattern 'n;'. This is a high-fidelity signature for known abuse.",
              "For all 'SyncAppvPublishingServer.vbs' executions, calculate the Shannon entropy of the command-line arguments. Establish a baseline entropy score from historical data across all hosts. Alert on any execution where the command-line entropy exceeds 3 standard deviations from the mean, indicating potentially obfuscated or lengthy proxied commands.",
              "Apply a one-class SVM model trained on the character n-grams and length of command-line arguments from known benign 'SyncAppvPublishingServer.vbs' executions. Score new executions in real-time; any instance classified as an outlier indicates a significant deviation from normal usage and is potentially malicious."
            ]
          },
          {
            "description": "A wscript.exe or cscript.exe process executing SyncAppvPublishingServer.vbs spawns a child process, such as powershell.exe, cmd.exe, or other network-capable binaries (e.g., bitsadmin.exe, certutil.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Create a detection rule that triggers when a parent process (identified by Parent PID in Windows Event ID 4688) is 'wscript.exe' or 'cscript.exe' with 'SyncAppvPublishingServer.vbs' in the command line, and it spawns a child process of 'powershell.exe', 'cmd.exe', 'bitsadmin.exe', or 'certutil.exe'. This parent-child relationship is a strong indicator of abuse.",
              "For each host, profile the frequency of all parent-child process relationships over a 30-day period. For parent processes matching 'wscript.exe' or 'cscript.exe' executing 'SyncAppvPublishingServer.vbs', alert if a child process is spawned that has never been seen before for that parent on that host, or falls below a 1% global frequency threshold.",
              "Apply a graph-based anomaly detection model to process lineage data. Model normal process execution chains originating from script hosts (wscript.exe, cscript.exe) as a graph. Identify and alert on anomalous subgraphs where a 'SyncAppvPublishingServer.vbs' execution leads to a sequence of child processes that deviates in structure (e.g., unexpected depth, breadth, or node types) from the established baseline graph."
            ]
          },
          {
            "description": "The SyncAppvPublishingServer.vbs script is executed from a file path other than C:\\Windows\\System32\\.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Create a high-priority alert for any process creation event (Windows Event ID 4688) where the command line contains 'SyncAppvPublishingServer.vbs' but the script path is not exactly 'C:\\Windows\\System32\\SyncAppvPublishingServer.vbs'. This is a strong indicator of a masquerading or dropped malicious script.",
              "Aggregate and count all execution paths for 'SyncAppvPublishingServer.vbs' across the enterprise over a 24-hour period. Any path other than the most frequent one (which should be 'C:\\Windows\\System32\\...') is highly anomalous and should be treated as a high-severity alert.",
              "Apply a pre-trained classification model to evaluate the file path from which 'SyncAppvPublishingServer.vbs' is executed. The model should be trained on features such as directory depth, path string length, and the presence of suspicious keywords (e.g., 'Temp', 'Public', 'Downloads', 'AppData'). A classification of 'suspicious' or 'malicious' should trigger an alert."
            ]
          },
          {
            "description": "Network traffic associated with a SyncAppvPublishingServer.vbs execution exhibits anomalous characteristics, such as a DNS query with high character entropy, a connection to an uncommonly used destination port, or an unusually large data upload volume.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points; DNS Servers; All Windows Endpoints and Servers",
            "action": [
              "Join process events (Windows Event ID 4688) for 'SyncAppvPublishingServer.vbs' with DNS query logs (Zeek dns.log) on the source host and time. Match the queried domain against a threat intelligence feed of known command-and-control (C2) or Domain Generation Algorithm (DGA) domains. An exact match is a high-confidence indicator of compromise.",
              "Correlate 'SyncAppvPublishingServer.vbs' executions with associated DNS queries (Zeek dns.log). Calculate the Shannon entropy of the queried domain name string. Compare the score to a baseline of all DNS queries in the organization. Alert on any query whose entropy score is in the 98th percentile or higher, which is indicative of a DGA.",
              "Apply a time-series anomaly detection model (e.g., an LSTM autoencoder) to the volume of outbound data (orig_bytes in Zeek conn.log) for all connections. Correlate 'SyncAppvPublishingServer.vbs' executions with network flows that are flagged by the model as having a high reconstruction error. This indicates a significant deviation from normal traffic patterns and is suggestive of data exfiltration."
            ]
          },
          {
            "description": "A network connection is initiated to a destination IP address or domain present on a threat intelligence blocklist, originating from a process within the process tree of a wscript.exe or cscript.exe execution of SyncAppvPublishingServer.vbs.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers; Network Egress Points; DNS Servers",
            "action": [
              "Join process creation events (Windows Event ID 4688) where the command line contains 'SyncAppvPublishingServer.vbs' with network connection logs (Zeek conn.log) on the source IP and a short time window (e.g., 1 minute). Match the destination IP or the associated DNS query (from Zeek dns.log) against a threat intelligence feed of known malicious indicators. Alert on any match.",
              "For network connections correlated to SyncAppvPublishingServer.vbs executions, establish a baseline of typical destination ports and data volume (orig_bytes) per host. Calculate the 99th percentile for data volume over a 30-day rolling window. Alert on connections to non-standard ports (e.g., not 80, 443, 53) where the data volume exceeds this percentile, indicating potential C2 activity.",
              "Apply a pre-trained supervised classification model (e.g., Random Forest) to score network connections associated with SyncAppvPublishingServer.vbs. Features for the model should include: command-line argument length and entropy, destination IP reputation (from enrichment), destination port, data volume transferred (orig_bytes), and connection duration. A high probability score from the model indicates likely malicious activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]