[
  {
    "information_requirement": "Is the adversary using PubPrn.vbs to execute remote code and evade defenses? (TA0005 - Defense Evasion)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1216.001",
        "name": "PubPrn",
        "evidence": [
          {
            "description": "Execution of cscript.exe or wscript.exe launching pubprn.vbs with a 'script:' moniker followed by a URL whose domain or IP is present in threat intelligence, is newly registered, or has a high entropy score.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers), Enterprise DNS resolvers, Network egress points (e.g., firewalls, proxies)",
            "action": [
              "Symbolic: Parse command lines from Windows Event ID 4688 for cscript.exe or wscript.exe processes executing pubprn.vbs. Extract any URL following the 'script:' moniker. Compare the URL's domain and IP address against a threat intelligence feed of known malicious indicators. Alert on any match.",
              "Statistical: For each domain extracted from a pubprn.vbs execution, determine its registration date via WHOIS data or internal DNS logs (Zeek dns.log). Calculate the Shannon entropy of the domain name. Alert if the domain was registered within the last 60 days or if its entropy score exceeds the 95th percentile of a baseline established from the organization's legitimate domain requests.",
              "Machine Learning: Extract features from the pubprn.vbs URL, including domain length, TLD, character frequency, and n-gram analysis. Input these features into a pre-trained malicious URL classification model (e.g., Gradient Boosting or Random Forest). Alert on any URL where the model's maliciousness probability score exceeds a tuned threshold (e.g., > 0.90)."
            ]
          },
          {
            "description": "Execution of pubprn.vbs where the command line contains the 'script:' moniker immediately followed by a non-LDAP protocol handler (e.g., http:, https:, ftp:, file:).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers, particularly legacy systems (Windows < 10) where this technique is viable.",
            "action": [
              "Symbolic: Create a detection rule that triggers on Windows Event ID 4688 process creation events where the parent process is cscript.exe or wscript.exe and the command line contains both 'pubprn.vbs' and the literal string 'script:http' or 'script:https'. This is a high-fidelity indicator of abuse.",
              "Statistical: Aggregate all pubprn.vbs command lines over a 30-day period. Use regular expressions to extract the protocol handler following the 'script:' moniker. Generate a frequency distribution of all observed handlers. Alert on any observation of a non-'ldap:' handler, as this represents a 100% deviation from expected legitimate behavior and is statistically a zero-frequency event.",
              "Machine Learning: Train a simple decision tree or Naive Bayes classifier using labeled command-line data. Use the presence of keywords ('pubprn.vbs', 'script:', 'ldap:', 'http:', 'https:') as binary features. Deploy the model to classify new command lines in real-time. Any classification as 'malicious' (i.e., contains 'script:' but not 'ldap:') should trigger an alert."
            ]
          },
          {
            "description": "A cscript.exe process executing pubprn.vbs spawns an anomalous child process, such as a command shell, scripting engine, or other Living-Off-the-Land Binary (LOLBin).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers with process relationship logging enabled.",
            "action": [
              "Symbolic: From Windows Event ID 4688 data, identify parent-child process relationships. Trigger an alert if a cscript.exe process (with 'pubprn.vbs' in its command line) spawns a child process from a watchlist, including powershell.exe, cmd.exe, rundll32.exe, regsvr32.exe, certutil.exe, or mshta.exe.",
              "Statistical: Build a baseline of all parent-child process relationships across the enterprise over the last 90 days. For any new cscript.exe ('pubprn.vbs') -> child process event, calculate the rarity of that specific relationship. Alert if the observed parent-child pair frequency falls below a defined rarity threshold (e.g., in the bottom 1st percentile of all observed pairs, or seen on < 3 hosts).",
              "Machine Learning: Model normal process execution chains using n-gram analysis on process creation logs. Treat each process name as a 'word' in a sequence. Calculate the probability of sequences like (cscript.exe -> powershell.exe). If a sequence initiated by cscript.exe ('pubprn.vbs') has a probability score below a learned threshold, flag it as an anomalous and potentially malicious event chain."
            ]
          },
          {
            "description": "cscript.exe initiates an outbound network connection to a suspicious destination or with anomalous characteristics (e.g., port, data volume) within minutes of executing pubprn.vbs.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers), Network egress points (e.g., firewalls, proxies), Network TAPs/SPANs generating Zeek data.",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 process creation events for cscript.exe executing pubprn.vbs with Zeek conn.log records by source IP and a 2-minute time window. Alert if the destination IP or domain in the conn.log record is present on a threat intelligence blocklist.",
              "Statistical: For each host, establish a baseline of destination ports and countries for network connections originating from cscript.exe. Following a pubprn.vbs execution, alert if cscript.exe connects to a destination port or country that is statistically rare for that host (e.g., outside the top 95% of historical connections). Additionally, monitor file downloads in Zeek files.log or http.log associated with the connection and alert if the file size exceeds the 99th percentile for that host/process.",
              "Machine Learning: Apply a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) to each host's outbound network traffic volume (bytes_out) from Zeek conn.log. Correlate process execution events (Event ID 4688) with the time series data. An anomalous spike in traffic volume occurring within 1-2 minutes after a pubprn.vbs execution is a strong indicator of malicious payload activity and should generate a high-priority alert."
            ]
          },
          {
            "description": "pubprn.vbs is executed by a non-administrative user account, on a non-print-server host, or with a frequency that is statistically anomalous for the user, host, or environment.",
            "data_sources": [
              "Windows Event ID 4688",
              "Active Directory security logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers, Domain Controllers, Identity and Access Management (IAM) systems, Asset Inventory Database.",
            "action": [
              "Symbolic: Maintain an Active Directory group for 'Printer Administrators' and a static list of designated print servers in an asset inventory. Create a rule to alert on any execution of pubprn.vbs (from Windows Event ID 4688) by a user not in the admin group or on a host not classified as a print server.",
              "Statistical: For every user and host, establish a 90-day rolling baseline of pubprn.vbs execution counts per hour and per day. Alert if a user or host's hourly execution count exceeds 3 standard deviations from their personal mean. Additionally, flag any execution by a user or on a host with a historical execution count of zero, as this is a first-time occurrence.",
              "Machine Learning: Use an unsupervised clustering model (e.g., DBSCAN) on process execution events. Use features such as user role (from AD), host role (from asset inventory), time of day (binned), and parent process name. Legitimate printer administration will form a dense cluster. Any pubprn.vbs execution that the model classifies as noise or an outlier warrants immediate investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]