[
  {
    "information_requirement": "Is the adversary attempting to degrade or block endpoint service availability? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1499",
        "name": "Endpoint Denial of Service",
        "evidence": [
          {
            "description": "A high volume of inbound connections to a single endpoint service from source IP addresses that are present on a threat intelligence feed for known botnets or DoS-for-hire services.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, Public-facing web servers, External DNS servers, API Gateways, Load Balancers",
            "action": [
              "Create a detection rule that generates an alert when a source IP address in Zeek conn.log, connecting to a critical service port (e.g., 80, 443, 53), matches an IP address in a threat intelligence feed categorized as 'botnet' or 'DDoS'.",
              "For traffic matching the symbolic rule, calculate the rate of connections per minute from the matching IP. If the rate exceeds the 95th percentile of historical connection rates from any single IP to that service, escalate the alert priority.",
              "Train a classification model (e.g., Random Forest) using features from Zeek conn.log (duration, orig_bytes, resp_bytes, service, proto) and the threat intelligence match as a label. Use the trained model to score new connections in real-time to predict the likelihood of being part of a DoS attack, even for IPs not yet on a threat list."
            ]
          },
          {
            "description": "An endpoint executes a process matching a known DoS tool, or network logs show a high number of concurrent, long-duration connections with minimal data transfer, characteristic of a low-and-slow attack.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web application servers, Critical internal servers, Domain Controllers, User workstations",
            "action": [
              "Deploy a SIEM rule to alert on process creation events (Windows Event ID 4688) where the process name matches a list of known DoS tools (e.g., 'loic.exe', 'hping3', 'slowhttptest'). Simultaneously, use a network signature to detect traffic patterns matching specific DoS tools, such as the unique User-Agent strings or request structures they generate in Zeek http.log.",
              "For a single source IP targeting a web server, calculate the ratio of established connections (from Zeek conn.log with state 'SF') to the total number of connection attempts. A persistently low ratio, combined with a high number of connections in 'S1', 'RSTO', or 'SHR' states, indicates a potential SYN flood. Alert if this ratio drops below a 2 standard deviation threshold from the baseline for that service.",
              "Develop a time-series anomaly detection model (e.g., LSTM) for the duration of connections in Zeek conn.log. A sudden, sustained increase in the number of long-duration, low-data-transfer connections to a web server is a strong indicator of a Slowloris-type attack and should be flagged by the model."
            ]
          },
          {
            "description": "Sustained resource consumption (CPU, memory, disk I/O) on a critical endpoint that exceeds a statistical baseline and correlates in time with a specific process or an increase in inbound network connections.",
            "data_sources": [
              "Windows Performance Counters",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical application servers, Database servers, Authentication servers, Virtualization hosts",
            "action": [
              "Create a rule that triggers an alert if '% Processor Time' on a critical server remains above 95% for more than 5 consecutive minutes and the top consuming process is a web service or database process (identified via Windows Event ID 4688 or Sysmon Event ID 1).",
              "For each critical server, establish a baseline for key performance counters (CPU, Memory, Network I/O) using a 30-day rolling average and standard deviation. Generate an alert if any metric exceeds 3 standard deviations above its average for a sustained period (e.g., 10 minutes). Correlate the timing of the alert with spikes in connection counts from Zeek conn.log.",
              "Use a multivariate time-series forecasting model (e.g., VAR) to predict expected resource utilization based on time of day, day of week, and other historical patterns. An alert is generated when the actual observed resource usage significantly and persistently deviates from the predicted range, indicating an anomaly that is not explained by normal cyclical business operations."
            ]
          },
          {
            "description": "An anomalous spike in application or service error events on a critical endpoint, such as crashes or unexpected terminations, exceeding a statistically defined threshold.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 7031",
              "Windows Event ID 7034"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application servers hosting custom or third-party software, Web servers (IIS, Apache), Database servers, Domain Controllers",
            "action": [
              "Create a high-severity alert for any occurrence of Windows Event ID 7031 (Service Crash) or 7034 (Unexpected Termination) for a critical business service (e.g., 'W3SVC', 'MSExchangeIS', 'KDC').",
              "For each critical server, calculate the hourly count of Windows Event ID 1000 (Application Error). Establish a historical distribution for these hourly counts. Trigger an alert if the count in any given hour exceeds the 99th percentile of the historical distribution for that server and time of day.",
              "Train a time-series anomaly detection model (e.g., a Seasonal Hybrid ESD model) on the frequency of application error events (Event ID 1000). Use the model to identify sudden, anomalous spikes in the error rate that are inconsistent with past behavior, automatically adjusting for normal fluctuations like patch deployments or reboots."
            ]
          },
          {
            "description": "A sustained, anomalous volume of inbound connections or HTTP requests to a specific service, characterized by a rate exceeding a statistical baseline and an abnormal distribution of source IPs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network load balancers, Public-facing web servers, API gateways, External-facing DNS servers",
            "action": [
              "Define a hard threshold for connections per minute to a critical service (e.g., 10,000 connections/min to a specific web server). Trigger a medium-severity alert if this threshold is breached.",
              "Calculate a 30-day rolling baseline (mean and standard deviation) of connections per minute for each critical service from Zeek conn.log. Alert if the current rate exceeds 4 standard deviations above the mean for more than 3 consecutive minutes. In the alert, include the Shannon entropy of the source IPs; low entropy suggests a single-source DoS, while high entropy suggests a DDoS.",
              "Use an unsupervised learning algorithm like DBSCAN to cluster incoming connections based on features like source IP subnet, user-agent, request rate, and connection duration. Identify clusters of connections that deviate significantly from the 'normal' cluster of legitimate traffic, which could represent a coordinated attack from a botnet with similar characteristics."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]