[
  {
    "information_requirement": "Is the adversary impacting system or service availability by hijacking resources? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1496",
        "name": "Resource Hijacking",
        "evidence": [
          {
            "description": "An internal host establishes a network connection where the destination IP address, DNS query, or TLS Server Name Indication (SNI) matches a known indicator of compromise (IOC) associated with cryptocurrency mining pools or resource hijacking command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), Internal DNS resolvers, Core network switches",
            "action": [
              "ACTION: Join conn.log, dns.log, and ssl.log records by UID. Match the id.resp_h, query, and server_name fields against a threat intelligence feed of known cryptomining pool domains/IPs. Generate an alert for any match.",
              "ACTION: For each source host (id.orig_h), count the number of distinct connections to known mining pool IPs over a 1-hour window. Establish a baseline for this count across all hosts. Flag any host whose count exceeds the 99th percentile of the enterprise-wide baseline.",
              "ACTION: Develop a supervised classification model (e.g., Gradient Boosting) using labeled historical network data. Feature engineer from conn.log and ssl.log to include: connection duration, total bytes, destination port, protocol, TLS version, and a binary flag for presence in an IOC list. Deploy the model to score new connections in real-time, alerting on those with a high probability score of being malicious."
            ]
          },
          {
            "description": "A process is created with a process name, file path, or command-line arguments matching signatures of known resource hijacking or cryptomining software.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., web servers, database servers), Domain Controllers, user workstations, virtual desktop infrastructure (VDI) fleet",
            "action": [
              "ACTION: Ingest Windows Event ID 4688 logs. Apply a ruleset of regular expressions to the NewProcessName and CommandLine fields to detect known miner names (e.g., xmrig.exe, nbminer.exe) and associated command-line arguments (e.g., -o stratum+tcp://, --user, --pass x). Generate an alert on any match.",
              "ACTION: Calculate the Shannon entropy of the CommandLine field for all process creation events (Event ID 4688). Establish a baseline entropy score for common processes (e.g., svchost.exe). A process with an unusually high entropy score, especially one with subsequent network connections, may indicate obfuscated or randomized miner arguments. Flag any process whose command line entropy exceeds 3 standard deviations above the mean for that process name.",
              "ACTION: Apply an unsupervised clustering algorithm (e.g., DBSCAN) to vectorized process creation events (Event ID 4688). Use features such as command line length, argument count, parent process name, and process name entropy. Investigate outlier processes or small, dense clusters that do not correspond to known legitimate software deployment or execution patterns."
            ]
          },
          {
            "description": "A process is executed with a name of a common system utility (e.g., svchost.exe, lsass.exe) but originates from a file path not in the established allowlist for that utility (e.g., C:\\Users\\..., C:\\Temp).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers, Application servers, User workstations, Domain Controllers",
            "action": [
              "ACTION: For process creation events (Event ID 4688), compare the NewProcessName and its path against a predefined allowlist of common system executables and their legitimate locations (e.g., svchost.exe must be in C:\\Windows\\System32). Generate an alert for any execution from a non-whitelisted path.",
              "ACTION: Join process creation (Event ID 4688) and termination (Event ID 4689) events by Process ID to calculate process duration. For each host, establish a historical baseline (e.g., 30-day rolling average and standard deviation) of runtimes for key processes. Flag any process instance whose duration exceeds 3 standard deviations from its historical mean on that host.",
              "ACTION: Train a classification model (e.g., Logistic Regression) to distinguish legitimate from masquerading processes. Use features from Event ID 4688 such as: process name, parent process name, file path depth, and whether the path is in a user-writable directory. Use the model to score new process creations and alert on those classified as high-probability masquerades."
            ]
          },
          {
            "description": "An internal host maintains a network connection to a single external IP address for a duration that is statistically anomalous for the host or its peer group, particularly when using non-standard ports or occurring outside of business hours.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), Internet Gateway, Core network switches",
            "action": [
              "ACTION: Query Zeek conn.log for connections where the proto is 'tcp', the duration field is greater than 8 hours, and the id.resp_p (destination port) is in a list of known mining ports (e.g., 3333, 4444, 5555, 7777, 14444). Generate an alert for any resulting connection.",
              "ACTION: For each source host (id.orig_h), calculate the 99th percentile of connection durations over a 30-day baseline from Zeek conn.log. Alert on any new connection that exceeds this percentile. Concurrently, calculate the entropy of destination ports per host over a 1-hour window; a low entropy score combined with a long-duration connection is highly indicative of mining.",
              "ACTION: Apply a clustering algorithm (e.g., K-Means) to Zeek conn.log data, using features such as duration, orig_bytes, resp_bytes, and id.resp_p. Identify clusters with characteristics of mining traffic (e.g., very long duration, high and symmetrical byte counts, non-standard ports). Investigate hosts that are members of these anomalous clusters."
            ]
          },
          {
            "description": "Network traffic content contains protocol-specific keywords or structures, such as JSON-RPC method calls ('login', 'submit') within HTTP/S payloads, or exhibits the periodic, low-variance inter-arrival packet times characteristic of the Stratum protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Web proxies, Core network switches",
            "action": [
              "ACTION: From Zeek http.log, search for HTTP POST requests where the request body contains JSON-RPC method calls like 'login', 'submit', or 'getjob', which are common in mining protocols. Generate an alert on any match.",
              "ACTION: For long-duration TCP connections identified in Zeek conn.log, analyze the corresponding packet inter-arrival times (if available from PCAP or advanced flow logs). Calculate the variance of these times. A near-zero variance suggests a highly periodic, automated 'heartbeat' communication pattern, which is anomalous for user-driven traffic but typical for mining protocols. Flag connections with exceptionally low variance.",
              "ACTION: For each host, create a time series of total outbound bytes (orig_bytes from Zeek conn.log) aggregated per hour. Apply a time series anomaly detection model (e.g., SARIMA or Prophet) to identify sustained increases in traffic that deviate from the host's established daily and weekly seasonal patterns. An unexplained, persistent rise in outbound data can indicate the constant submission of mining 'shares'."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]