[
  {
    "information_requirement": "Has the adversary successfully escalated privileges on a macOS host using an execution prompt?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1548.004",
        "name": "Elevated Execution with Prompt",
        "evidence": [
          {
            "description": "Execution of the '/usr/libexec/security_authtrampoline' binary, the underlying mechanism for the AuthorizationExecuteWithPrivileges API call, where the parent process is unsigned, uncommon, or located in a user-writable directory.",
            "data_sources": [
              "macOS Process Execution Logs",
              "macOS Unified Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "macOS Endpoints (laptops, desktops, servers)",
            "action": [
              "Create a detection rule to alert on any process execution of '/usr/libexec/security_authtrampoline' where the parent process is unsigned, has a low reputation score, or is executing from a non-standard path like '/tmp/', '/Users/Shared/', or a user's home directory.",
              "For each 'security_authtrampoline' execution, calculate the historical prevalence of its parent process across all macOS endpoints. Flag parent processes that are statistical outliers, such as those in the bottom 5th percentile of prevalence or those not seen in the last 90 days.",
              "Train a decision tree classifier using features of the parent process (e.g., is_signed, path_entropy, parent_process_name, has_network_connection, file_age) to classify each 'AuthorizationExecuteWithPrivileges' call as benign or malicious, and generate an alert for malicious classifications."
            ]
          },
          {
            "description": "A network connection from a macOS host to an external IP address or domain matching a threat intelligence feed (e.g., C2, malware) within 15 minutes of a process executing via '/usr/libexec/security_authtrampoline'.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "macOS Process Execution Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring Sensors",
            "action": [
              "Correlate destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log against a real-time threat intelligence feed of known malicious or C2 indicators. Generate a high-severity alert on any match originating from a macOS host.",
              "Calculate the Shannon entropy of all requested domain names in Zeek dns.log. Alert on domains originating from macOS hosts with an entropy score above a dynamically calculated threshold, such as the 95th percentile of daily entropy scores.",
              "Implement a time-series anomaly detection model (e.g., ARIMA) to forecast the expected volume of outbound data (bytes_out) per macOS host. Generate an alert if the observed connection volume to new or rare external IP addresses significantly exceeds the forecasted value (e.g., > 3 standard deviations) within a short time window."
            ]
          },
          {
            "description": "HTTP or TLS traffic from a macOS host contains specific artifacts (e.g., User-Agent, URI path, JA3/JA3S hash) that are strongly associated with known macOS C2 frameworks or post-exploitation toolkits like Shlayer, Sliver, or Mythic.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Taps providing traffic to Zeek sensors",
            "action": [
              "Create detection rules to match specific User-Agent strings, URI patterns, or JA3/JA3S hashes found in Zeek http.log and ssl.log that are unique to known macOS C2 frameworks.",
              "Profile the distribution of JA3/JA3S hashes across all endpoints. Identify and alert on hashes that are statistically rare (e.g., seen on < 1% of hosts or < 5 times enterprise-wide) or have never been seen before, as this indicates non-standard client software potentially used for C2.",
              "Train a logistic regression classifier on Zeek ssl.log features (e.g., certificate validity period, issuer, subject, SNI length, JA3S hash, cipher suite) to distinguish between legitimate and malicious C2 traffic. Use the model to score new connections from macOS hosts for potential maliciousness."
            ]
          },
          {
            "description": "A successful remote logon (Windows Event ID 4624 with Logon Type 3 or 10) to a Windows system, especially a high-value asset like a domain controller, originating from a macOS host IP address that has no prior history of authenticating to that destination.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Alert when a Windows Event ID 4624 (Logon Type 3 or 10) is generated on a server, and the Source Network Address corresponds to a macOS device, if that device-to-server or user-to-server pair has never been seen before.",
              "For each user, maintain a statistical profile of typical source hosts and destination servers for remote logons based on 90 days of history. Alert if a logon occurs from a macOS host when the user's historical logons are exclusively from Windows hosts (p-value < 0.01), representing a statistically significant deviation.",
              "Use a graph-based clustering algorithm (e.g., Louvain Modularity) to group users with similar remote access patterns. Flag a user whose logon from a macOS host to a Windows server causes them to shift clusters or be identified as an inter-cluster anomaly, indicating unusual lateral movement."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of data transferred (e.g., > 95th percentile of historical baseline) from a macOS host to an external destination, particularly involving file types commonly used for data staging and archiving (e.g., .zip, .rar, .tgz, .7z).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Create a rule to alert when Zeek files.log shows a file transfer from a macOS host to an external IP where the file MIME type is 'application/zip', 'application/x-rar-compressed', or 'application/x-7z-compressed', and the file size exceeds a static threshold (e.g., 50MB).",
              "For each macOS host, establish a baseline of daily outbound data volume (sum of 'orig_bytes' from Zeek conn.log to external IPs). Alert when the daily volume exceeds a dynamic threshold, such as the 99th percentile of the host's historical 30-day traffic.",
              "Apply a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the outbound byte count per host, aggregated hourly. The model will learn the normal 'rhythm' of data transfers and alert on spikes that are not explained by normal seasonality or trends."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses following a privilege escalation event originating from a macOS host?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1548.004",
        "name": "Elevated Execution with Prompt",
        "evidence": [
          {
            "description": "A DNS query from a macOS host for a domain associated with anonymization services (VPN, Tor, Proxy), dynamic DNS providers, or known offensive security tool hosting, indicating an attempt to obscure C2 traffic.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Servers",
            "action": [
              "Match DNS queries from Zeek dns.log against threat intelligence category lists for 'Anonymization', 'Dynamic DNS', and 'Hacking'. Generate an alert for any match from a macOS endpoint.",
              "Calculate the prevalence of each fully qualified domain name (FQDN) resolved across the enterprise. Alert on queries from macOS hosts for domains that are statistically rare (e.g., resolved by fewer than 5 hosts or seen for the first time).",
              "Deploy a pre-trained Domain Generation Algorithm (DGA) detection model (e.g., a recurrent neural network) to classify all queried domains in real-time. Generate an alert if a domain queried by a macOS host is classified as algorithmically generated."
            ]
          },
          {
            "description": "A command is executed on a Windows host to disable security tools, clear logs, or modify firewall rules, where the parent process is part of a remote session (Windows Event ID 4624, Logon Type 3 or 10) originating from a macOS host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1102",
              "Windows Event ID 4719",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Windows Servers",
            "action": [
              "Create a correlation rule that triggers when a Windows Event ID 4624 (Remote Logon) from a macOS IP is followed within 5 minutes by Event ID 4688 containing command-line arguments such as 'wevtutil cl', 'netsh advfirewall', 'sc config', 'Set-MpPreference -Disable', or 'taskkill'. Also monitor for Event ID 1102 (The audit log was cleared).",
              "Establish a baseline for the frequency of security policy changes (e.g., Event ID 4719) or log clearing events (Event ID 1102) on servers. An event originating from a session traced back to a macOS host is a zero-frequency event in most environments and is therefore a high-confidence statistical anomaly.",
              "Train a sequence analysis model (e.g., Hidden Markov Model) on streams of security events from high-value servers to learn normal administrative sequences. Trigger an alert when a sequence involving a logon from a macOS host followed by defense disabling commands is observed, as this represents a highly improbable state transition."
            ]
          },
          {
            "description": "A TLS session initiated from a macOS host exhibits a combination of anomalous characteristics, such as a self-signed certificate, a non-standard destination port for TLS (not 443), a statistically rare JA3 hash, and a short certificate validity period, suggesting a custom C2 channel.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Create a rule that alerts if a TLS session from a macOS host in Zeek ssl.log uses a non-standard port (not 443), AND the associated certificate in x509.log has an issuer that matches its subject (self-signed), OR the JA3 hash matches a known malicious hash.",
              "For each TLS session from a macOS host, calculate a risk score by summing points for anomalous features: rare JA3 hash (enterprise prevalence < 1%) adds 2 points, non-443 port adds 1 point, self-signed certificate adds 2 points, certificate validity < 90 days adds 1 point. Alert on any session with a cumulative score exceeding a threshold, such as 3.",
              "Use a one-class SVM (Support Vector Machine) trained on features from legitimate enterprise TLS traffic (port, JA3 hash, certificate issuer, duration, server name indication). The model will create a boundary around 'normal' traffic and alert on any new connection from a macOS host that falls outside this boundary."
            ]
          },
          {
            "description": "A new service (Windows Event ID 7045) or scheduled task (Windows Event ID 4698) is created on a Windows system, where the creation event is linked to a security logon session from a recent remote logon (Windows Event ID 4624, Logon Type 3 or 10) originating from a macOS host IP address.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 4698",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Servers",
            "action": [
              "Create a correlation rule that alerts when a Windows Event ID 7045 or 4698 occurs, and the security context of the event (Logon ID) can be traced back to a recent logon event (Event ID 4624, Logon Type 3 or 10) from an IP address belonging to a macOS device.",
              "Analyze the frequency of service or task creation on servers by source host operating system. The creation of persistence from a macOS host is a zero- or near-zero-frequency event in most environments and is therefore a high-confidence statistical anomaly that warrants an immediate alert.",
              "Use a graph-based anomaly detection model where nodes are hosts (with OS attribute) and edges are actions (logon, service creation). An edge representing 'service creation' from a 'macOS node' to a 'Windows Server node' would be flagged as a structurally anomalous pattern in the graph."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]