[
  {
    "information_requirement": "Is the adversary maintaining persistence by modifying network device firmware? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1542.004",
        "name": "ROMMONkit",
        "evidence": [
          {
            "description": "A file transferred to a network device has a hash matching a known malicious ROMMONkit image (e.g., from Cisco Synful Knock intelligence [1]), or the device initiates a connection to a destination IP or domain known to be associated with ROMMONkit command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core routers, edge firewalls, TFTP/SCP/FTP management servers, and DNS resolvers.",
            "action": [
              "Create a rule to hash all files transferred via protocols monitored by Zeek (e.g., TFTP, FTP, SCP) from Zeek files.log. Compare these hashes against a threat intelligence feed of known malicious firmware hashes. In parallel, monitor Zeek conn.log and dns.log for any connections or queries from network device management IP addresses to destinations present on a C2 threat feed. Trigger a high-severity alert upon any match.",
              "For all DNS queries originating from network device management IPs (from Zeek dns.log), calculate the Shannon entropy of the requested domain name. Establish a per-device baseline of domain entropy. Alert on queries with entropy scores exceeding the 99th percentile of the device's specific baseline, which may indicate Domain Generation Algorithm (DGA) activity for C2.",
              "Develop a time-series model (e.g., ARIMA or SARIMA) to forecast the expected volume of outbound connections from each network device, segmented by protocol, based on Zeek conn.log data. Generate an anomaly alert when the observed connection volume for a given protocol significantly exceeds the forecast's confidence interval, especially on non-standard ports, suggesting a newly activated implant."
            ]
          },
          {
            "description": "A sequence of commands executed via a CLI session on a network device, as recorded in TACACS+ or syslog, matches a known pattern for unauthorized firmware modification (e.g., copying a new image, changing boot parameters, and forcing a reload) [2].",
            "data_sources": [
              "Network Device CLI Logs",
              "Zeek tftp.log",
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device configuration management systems (e.g., TACACS+/RADIUS servers), central syslog aggregators, and core network switches and routers.",
            "action": [
              "Implement a correlation rule that detects a specific sequence of commands (e.g., `copy tftp flash:`, `config-register`, `boot system flash`, `reload`) in Network Device CLI Logs within a 15-minute window. Escalate the alert if the command sequence originates from a non-privileged user, a source IP outside the management subnet, or occurs outside a scheduled maintenance window.",
              "From Network Device CLI Logs, establish a baseline of command usage frequency per user and per device. Profile the count of privileged-mode commands (e.g., `copy`, `reload`, `write memory`). Alert when a user's session exhibits a count of privileged commands that exceeds three standard deviations above their individual or role-based average, indicating an unusual escalation of administrative activity.",
              "Train a sequence-based classification model, such as a Recurrent Neural Network (RNN) or a Hidden Markov Model (HMM), using labeled datasets of legitimate and malicious command-line session logs. Feed live command streams from Network Device CLI Logs into the deployed model to classify each session in near real-time as either benign or potentially malicious, based on the sequence and combination of commands used."
            ]
          },
          {
            "description": "A file transfer to a network device's management interface is initiated from an unauthorized source IP address, occurs at a time outside a defined maintenance window, or the file's size is a statistical outlier compared to historical legitimate firmware updates for that device model.",
            "data_sources": [
              "Zeek tftp.log",
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Management VLANs, administrator workstations, jump servers, and TFTP/SCP/FTP servers.",
            "action": [
              "Maintain an explicit allow-list of authorized IP addresses for servers and workstations permitted to transfer firmware. Create a rule to monitor Zeek conn.log for TFTP (port 69/udp), FTP (port 21/tcp), or SCP (port 22/tcp) connections to network device management interfaces from any source IP not on this list. Generate an immediate alert for any unauthorized transfer attempt.",
              "For each network device model, build a statistical profile of legitimate firmware image file sizes using data from Zeek files.log. Use the Interquartile Range (IQR) method to define a normal size range. Generate an alert for any firmware file transfer where the file size is an outlier (e.g., smaller than Q1 - 1.5*IQR or larger than Q3 + 1.5*IQR), as malicious images may be smaller or padded.",
              "Train a classification model (e.g., Random Forest or Gradient Boosting) to predict the legitimacy of a file transfer event. Use features such as source IP reputation, source port, destination device type, time of day (categorical), day of week (categorical), and file size. A prediction of 'malicious' with high confidence should trigger an automated investigation workflow, including correlating with login events (Windows Event ID 4624) on the source host."
            ]
          },
          {
            "description": "A network device reboots outside a scheduled maintenance window, and this is immediately followed by network connections from the device that deviate from its established post-reboot traffic baseline, such as contacting new external destinations.",
            "data_sources": [
              "Network Device CLI Logs",
              "SNMP Trap Logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Central syslog aggregators, core and edge network devices, and DNS resolvers.",
            "action": [
              "Create a correlation rule that triggers when a 'device reboot' message is received from syslog or an SNMP trap. If, within the subsequent 5 minutes, Zeek conn.log shows a connection from that device's IP to an external IP on a non-standard port (not 22, 80, 443, etc.), enrich the destination IP with threat intelligence. Alert if the destination is categorized as malicious or suspicious.",
              "For each network device, create a baseline of normal post-reboot network activity, defined as the set of unique destination IPs, ports, and protocols contacted within the first 15 minutes after a reboot. Use frequency analysis (Jaccard similarity or a simple count of new elements) to compare the post-reboot connection set against the baseline. Alert if the set of new connections exceeds a predefined threshold (e.g., >5 new destinations).",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest or a one-class SVM) on features extracted from post-reboot network connections (e.g., destination IP, port, protocol, total bytes, connection duration). Train the model on connection data from legitimate, scheduled reboot events. Any connection flagged as a significant anomaly after an unscheduled reboot should be escalated for analyst review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by modifying network device firmware? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1542.004",
        "name": "ROMMONkit",
        "evidence": [
          {
            "description": "A pattern of failed connection attempts (e.g., TCP resets, timeouts) originating from known security infrastructure (vulnerability scanners, log collectors) is observed for traffic passing through a suspect network device, while other non-security traffic flows unimpeded, suggesting targeted filtering.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Security tool subnets, central log collectors, suspect network devices, and network taps monitoring traffic to/from these devices.",
            "action": [
              "Maintain an IP set of all security infrastructure (e.g., scanners, SIEM forwarders). Create a rule that alerts if Zeek conn.log shows a rate of rejected ('REJ') or reset ('RST') connections from this IP set to internal assets that is significantly higher (e.g., > 90%) than the rate for all other traffic traversing the same device.",
              "For each core network device, calculate a moving average of the connection success rate (ratio of 'SF' to total states) for traffic originating from the security subnet. Alert if the success rate for a specific device drops by a statistically significant margin (e.g., > 3 standard deviations below the moving average) compared to its historical baseline and peer devices.",
              "Apply time-series anomaly detection (e.g., using Seasonal Hybrid ESD) to the count of 'REJ' and 'RST' connection states in Zeek conn.log, specifically for traffic sourced from security subnets. A sudden, sustained spike in these failure states that is not correlated with a known network outage or maintenance activity should be flagged as a high-confidence anomaly indicative of active blocking."
            ]
          },
          {
            "description": "Network traffic traversing a suspect device exhibits low-level artifacts matching threat intelligence on a known ROMMONkit, such as manipulated IP Time-to-Live (TTL) values or DNS queries using non-standard opcodes or record types for C2 [1].",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs at key aggregation points (e.g., data center core, internet edge), DNS resolvers, and suspect network devices.",
            "action": [
              "Deploy a Zeek script or SIEM rule to inspect DNS traffic (from Zeek dns.log) originating from network devices. The rule should alert on queries that use non-standard opcodes, request unusual record types like TXT for C2, or have response sizes that are unusually large for their type, based on specific threat intelligence indicators.",
              "For traffic flows in Zeek conn.log, use the `id.orig_h` and inferred initial TTL to profile the normal TTL distribution for each internal source subnet. Alert on any connection where the initial TTL is a statistical outlier (e.g., in the 99.9th percentile or not a common power of 2 like 64, 128) for its source subnet, as a compromised router may inject or modify packets with anomalous TTLs.",
              "Train a supervised classification model (e.g., Gradient Boosting) on labeled PCAP or Zeek log data to distinguish benign traffic from flows modified by known firmware implants. Engineer features from Zeek logs, including initial TTL, IP flags, packet size distribution statistics (mean, std dev), and inter-arrival time statistics. Deploy the model to classify live traffic flows in real-time."
            ]
          },
          {
            "description": "A persistent and statistically significant deviation in traffic flow metrics (e.g., total volume, protocol distribution, source/destination pairings) is observed on a network device, which cannot be attributed to a scheduled network change or known business driver.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek conn_summary.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Key network choke points, such as internet gateways, data center core switches, and inter-site VPN routers.",
            "action": [
              "Define a set of 'never event' rules for critical network segments. For example, create a rule that alerts if Zeek conn.log shows traffic from a production database server directly to an external IP address, bypassing designated proxy gateways, as this would indicate a routing policy violation by the compromised device.",
              "For each major network path or interface monitored, establish a baseline of the protocol distribution (e.g., % TCP, % UDP, % ICMP) using Zeek conn.log. Calculate the Shannon entropy of this distribution on an hourly basis. A sudden and sustained drop in entropy, indicating a less diverse protocol mix, could signal that a malicious implant is manipulating or redirecting specific traffic types.",
              "Use a multivariate time-series model (e.g., VAR - Vector Autoregression) to forecast expected traffic volumes for multiple protocols simultaneously across a key network device. Detect anomalies when the actual observed traffic vector shows a significant residual error (deviation from the forecast), suggesting an unobserved factor, like a firmware implant, is influencing traffic patterns in a coordinated way."
            ]
          },
          {
            "description": "A significant decrease or complete cessation of expected management traffic (e.g., syslog, SNMP, NTP) from a network device is observed, particularly after an unscheduled reboot, when compared against its own historical baseline and peer devices.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek snmp.log",
              "Zeek ntp.log",
              "Network Device CLI Logs",
              "Central Syslog Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Central syslog/SNMP trap servers, NTP servers, and network device management interfaces.",
            "action": [
              "For each critical network device, implement a 'dead man's switch' rule. If no syslog messages are received at the Central Syslog Server from a device for a defined period (e.g., 60 minutes), and the device's management IP is still reachable via ICMP (from Zeek conn.log), generate a high-priority alert for potential log suppression.",
              "For each network device, model the expected rate of syslog messages per hour using a moving average and standard deviation. Alert if the observed rate drops below the lower bound of the confidence interval (e.g., mean - 3 * std_dev) for a sustained period, indicating a statistically significant drop in logging activity.",
              "Employ a time-series anomaly detection model (e.g., Prophet, which handles seasonality) to forecast the expected volume of management traffic (e.g., Syslog bytes per hour, SNMP packet count) from each device. The model can account for daily/weekly patterns. Flag any device whose actual traffic volume deviates significantly from the model's forecast, suggesting an anomalous reduction in visibility."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]