[
  {
    "information_requirement": "Is the adversary attempting to gain access to credentials using AS-REP Roasting?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1558.004",
        "name": "AS-REP Roasting",
        "evidence": [
          {
            "description": "A Kerberos AS-REQ for a user without pre-authentication is observed where the source IP address matches an entry on a threat intelligence watchlist or an internal list of compromised systems.",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, Network Egress/Ingress Points with Zeek Sensors",
            "action": [
              "Symbolic Logic: Join Windows Event ID 4768 (where 'Pre-Authentication Type' is '0') or Zeek kerberos.log (where success='T' and preauth_required='F') with a threat intelligence feed of known malicious IP addresses. An exact match on the client IP ('Client Address' in 4768, 'id.orig_h' in kerberos.log) triggers a high-severity alert.",
              "Statistical Method: For all authentication attempts where pre-authentication is disabled, use Zeek conn.log data to determine the historical rarity of the source IP's Autonomous System Number (ASN). An attempt originating from an ASN that accounts for less than the 1st percentile of legitimate Kerberos traffic over the last 90 days should be flagged for review.",
              "Machine Learning: Train a logistic regression classifier on historical AS-REQ events using features such as source IP reputation, ASN rarity, time of day, and if the target user is privileged. Use the model to score new events in real-time and alert when the probability of maliciousness exceeds a predefined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A process is created with a filename or command-line argument strongly associated with known AS-REP Roasting tools (e.g., Rubeus, PowerView, Get-ADUser).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, Member Servers, User Workstations",
            "action": [
              "Symbolic Logic: Create a detection rule that searches process creation logs (Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104) for command lines matching known tool usage, such as `Rubeus.exe asreproast` or PowerShell containing `Get-ADUser -Filter {DoesNotRequirePreAuth -eq $true}`. An exact match triggers an immediate alert.",
              "Statistical Method: Profile parent-child process relationships and calculate the entropy of command-line arguments for PowerShell.exe. A PowerShell process that spawns from an unusual parent (e.g., w3wp.exe, svchost.exe) and has a command-line entropy score exceeding the 98th percentile of historical PowerShell commands should be flagged for investigation.",
              "Machine Learning: Use an anomaly detection model like an autoencoder trained on benign process creation events (Windows Event ID 4688) and their command-line arguments. Flag any new process event that results in a high reconstruction error from the autoencoder as anomalous and potentially malicious."
            ]
          },
          {
            "description": "One or more Kerberos AS-REP messages are requested for user accounts that are not on an approved allow-list and are configured with 'Do not require Kerberos preauthentication' ('Pre-Authentication Type' of '0').",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, Network Security Monitoring Sensors",
            "action": [
              "Symbolic Logic: On Domain Controllers, filter Windows Event ID 4768 for events where 'Pre-Authentication Type' is '0'. Cross-reference the 'Account Name' with a maintained allow-list of service accounts authorized to have pre-authentication disabled. Any request for an account not on this list is a high-confidence indicator of malicious activity.",
              "Statistical Method: For each source host ('Client Address'), calculate the ratio of requests for pre-auth disabled accounts to total AS-REQs over a 1-hour window. Establish a baseline for this ratio across all hosts. A host whose ratio exceeds 3 standard deviations above the mean should be investigated for enumeration activity.",
              "Machine Learning: Employ a time-series forecasting model (e.g., ARIMA) to predict the expected hourly volume of AS-REPs for pre-auth disabled accounts across the environment. If the observed count significantly exceeds the model's predicted upper confidence interval, generate an alert for a potential widespread AS-REP Roasting attempt."
            ]
          },
          {
            "description": "A single client IP address generates Kerberos AS-REQ messages for a statistically significant number of distinct user accounts in a short time frame, especially for accounts not requiring pre-authentication.",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, Network Security Monitoring Sensors",
            "action": [
              "Symbolic Logic: Create a rule that triggers if a single client IP address ('Client Address' in Event ID 4768) generates requests for more than 10 distinct user accounts ('Account Name') within a 5-minute window where the 'Pre-Authentication Type' is '0'.",
              "Statistical Method: Aggregate Windows Event ID 4768 events by 'Client Address' and count the number of distinct target 'Account Name's per source over a 10-minute sliding window. Calculate the 99th percentile for both the request count and distinct account count from a 30-day baseline. An alert is generated if a single source IP exceeds both thresholds simultaneously.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features from AS-REQ events over a 15-minute window, including source IP, count of distinct target users, and count of pre-auth disabled requests. The algorithm will group normal activity into large clusters; identify any event or small group of events classified as noise (outliers) as a potential targeted AS-REP Roasting attack."
            ]
          },
          {
            "description": "A statistically significant increase in Kerberos AS-REP messages using the weak RC4-HMAC encryption cipher ('Ticket Encryption Type' of '0x17') is observed, deviating from an established baseline of stronger AES ciphers.",
            "data_sources": [
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, Network Security Monitoring Sensors",
            "action": [
              "Symbolic Logic: Create a high-severity alert for any Kerberos authentication event (Windows Event ID 4768 or Zeek kerberos.log) where 'Ticket Encryption Type' is '0x17' (RC4-HMAC) AND 'Pre-Authentication Type' is '0'. This combination is a hallmark of a classic AS-REP Roasting attack.",
              "Statistical Method: For each user account, establish a baseline profile of normally requested 'Ticket Encryption Types'. Alert if a user who historically uses only AES (0x11, 0x12) suddenly requests an RC4 ticket (0x17). Also, calculate the ratio of RC4 to AES requests across the environment per hour. An increase in this ratio exceeding the 95th percentile of its historical values indicates a potential attack.",
              "Machine Learning: Train a decision tree classifier to distinguish between legitimate and malicious AS-REQs. Use features such as 'Pre-Authentication Type', 'Ticket Encryption Type', time of day, and source IP reputation. A request classified as malicious, particularly one involving RC4 encryption and no pre-authentication, should trigger an investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]