[
  {
    "information_requirement": "Has an adversary hijacked a SIP or Trust Provider to evade defenses? (TA0005 - Defense Evasion)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1553.003",
        "name": "SIP and Trust Provider Hijacking",
        "evidence": [
          {
            "description": "A SIP or Trust Provider registry value is modified to point to a DLL whose file hash matches a known malicious indicator, or the DLL path itself is associated with known adversary tooling.",
            "data_sources": [
              "Sysmon Event ID 13",
              "Windows Event ID 4657",
              "Sysmon Event ID 11",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint registry hives (HKLM\\SOFTWARE\\Microsoft\\Cryptography), Endpoint file systems, Network egress points, Threat intelligence platforms",
            "action": [
              "Create a detection rule that triggers on a Sysmon Event ID 13 or Windows Event ID 4657 event where the TargetObject matches a known SIP/Trust provider registry path. Extract the DLL path from the event details. Correlate this path with file creation events (Sysmon Event ID 11) or files transferred over the network (Zeek files.log) to find the file's hash. Alert if this hash matches any hash in a threat intelligence feed of known SIP hijacking tools.",
              "For every modification to a SIP/Trust Provider registry key (Sysmon Event ID 13), extract the new DLL file path. Calculate the prevalence of this file path across the enterprise over a 30-day rolling window. Flag any modification for review where the path's enterprise-wide prevalence is below the 1st percentile and the modifying process is not part of a pre-defined allowlist of system management or software installation tools.",
              "Train a logistic regression classifier on labeled historical data of registry modifications (Sysmon Event ID 13). Use features such as: process name, parent process name, process command line, user context, a boolean flag for whether the target key is a known SIP/Trust path, and a boolean flag indicating if the new DLL path is in a common user-writable directory (e.g., %APPDATA%, %TEMP%). Deploy the model to score new registry modification events in real-time and alert on those classified as suspicious with high confidence."
            ]
          },
          {
            "description": "A process such as reg.exe, regedit.exe, or regsvr32.exe is observed modifying a registry value under HKLM\\SOFTWARE\\Microsoft\\Cryptography\\OID or HKLM\\SOFTWARE\\Microsoft\\Cryptography\\Providers\\Trust.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Sysmon Event ID 13",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint registry hives (HKLM\\SOFTWARE\\Microsoft\\Cryptography), Endpoint process execution logs",
            "action": [
              "Create a high-fidelity detection rule to alert on any process creation event (Sysmon Event ID 1, Windows Event ID 4688) where the process image is reg.exe, regedit.exe, or regsvr32.exe and the command line includes strings such as 'CryptSIPDllGetSignedDataMsg', 'CryptSIPDllVerifyIndirectData', 'FinalPolicy', or a known SIP GUID.",
              "For each host, aggregate Sysmon Event ID 13 events that target SIP/Trust provider cryptography keys, grouping them by the parent process name that initiated the change. Calculate the Shannon entropy of the parent process name distribution on an hourly basis. Alert when the hourly entropy score for a host exceeds 3 standard deviations from its 30-day rolling average, as this indicates an unusual variety of processes are making these sensitive changes.",
              "Use an Isolation Forest model for anomaly detection on registry modification events. For each Sysmon Event ID 13 event targeting a SIP/Trust key, create a feature vector including the modifying process name, parent process name, user context (e.g., SYSTEM, Administrator, standard user), and command-line arguments. Train the model on a baseline of normal administrative activity and deploy it to score new events, alerting on those identified as strong anomalies."
            ]
          },
          {
            "description": "A process not on an established allowlist of system and software management tools (e.g., TrustedInstaller.exe, msiexec.exe) modifies a SIP or Trust Provider registry key.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 13",
              "Windows Event ID 4688",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint registry hives (HKLM\\SOFTWARE\\Microsoft\\Cryptography), Enterprise-wide process execution baselines, Software deployment and patching servers",
            "action": [
              "Create a detection rule that triggers when a Sysmon Event ID 13 or Windows Event ID 4657 event records a modification to a key under HKLM\\SOFTWARE\\Microsoft\\Cryptography\\OID or HKLM\\SOFTWARE\\Microsoft\\Cryptography\\Providers\\Trust, and the process image associated with the event is NOT on a pre-defined allowlist of legitimate system utilities and software installers.",
              "Maintain a 30-day rolling frequency table of all process names that modify SIP/Trust Provider keys across the enterprise. Any modification (Sysmon Event ID 13) by a process name that falls in the bottom 5th percentile of frequency should be flagged as anomalous, as it represents a statistically rare event.",
              "Implement a time-series forecasting model, such as SARIMA or Prophet, on the daily count of SIP/Trust key modifications made by 'rare' processes (as defined by the statistical method above). Generate an alert when the actual daily count exceeds the forecasted upper confidence interval, which indicates a statistically significant surge that may represent a coordinated campaign."
            ]
          },
          {
            "description": "A specific sequence of events is observed on a single host in a short time window: 1) A new DLL is created in a user-writable directory. 2) A SIP/Trust Provider registry key is modified to point to this new DLL. 3) A successful code signature validation event occurs.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 13",
              "Microsoft-Windows-CAPI2/Operational Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint file systems (e.g., %APPDATA%, %TEMP%, %PUBLIC%), Endpoint registry hives (HKLM\\SOFTWARE\\Microsoft\\Cryptography), Windows CAPI2 event logs on endpoints",
            "action": [
              "Create a stateful correlation rule that triggers an alert if the following sequence occurs on the same host within a 5-minute window: 1. A Sysmon Event ID 11 (FileCreate) for a .dll file in a user-writable directory. 2. A Sysmon Event ID 13 (RegistryValueSet) where the TargetObject is a SIP/Trust key and the Details field contains the path to the newly created DLL. 3. A CAPI2 Event ID 11 (Successful X509 Chain Building) for any process.",
              "For each host, calculate the baseline probability of a CAPI2 Event ID 11 (successful validation) occurring within 5 minutes *after* a Sysmon Event ID 13 modification to a SIP/Trust key. As this probability is expected to be near zero for normal operations, trigger an alert for any occurrence of this sequence, as it represents a significant deviation from the norm (i.e., exceeds the 99.9th percentile of this conditional probability).",
              "Use a sequence-aware model, such as a Hidden Markov Model (HMM), trained on event logs (Sysmon, CAPI2). Define states such as 'Benign Activity', 'Suspicious DLL Write', 'Critical Registry Modify', and 'Anomalous Validation'. Train the model on known benign sequences of events. When a live event stream matches the high-probability transition path from 'Suspicious DLL Write' to 'Critical Registry Modify' to 'Anomalous Validation', flag it as a likely hijack."
            ]
          },
          {
            "description": "A process, whose signature was successfully validated, is executed from an atypical directory (e.g., %APPDATA%, %TEMP%) and subsequently initiates external network communication to a low-reputation or newly-observed IP address or domain.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Microsoft-Windows-CAPI2/Operational Event ID 11",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process and network connection logs, Windows CAPI2 event logs, Network gateway traffic logs, DNS server logs",
            "action": [
              "Create a correlation rule that joins CAPI2 Event ID 11 with Sysmon Event ID 1 on ProcessGUID. If the process path is in a suspicious directory (e.g., C:\\Users\\*\\AppData\\*, C:\\Windows\\Temp\\*) and is followed within 60 seconds by an outbound connection (Sysmon Event ID 3 or Zeek conn.log) to an IP address on a threat intelligence blocklist, generate a high-severity alert.",
              "For each process name, build a statistical profile of its normal execution paths and parent processes. For any execution of a validated process (CAPI2 Event ID 11), if its execution path or parent process is statistically rare (e.g., outside the top 95% most frequent paths/parents for that process), elevate monitoring. If that process then communicates with a domain first seen in the last 24 hours (via Zeek dns.log), escalate to an alert.",
              "Use a graph-based anomaly detection model where nodes are processes, files, and remote IPs, and edges represent interactions. Train the model on benign activity to learn normal graph structures. A hijack sequence would appear as an anomalous subgraph: a rare process modifies a SIP key, which then executes a 'validated' file from a strange path that connects to a low-prevalence external IP node. The model would score this subgraph as a high-confidence anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]