[
  {
    "information_requirement": "Is an adversary using VBA stomping to execute malicious code while evading static analysis?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.007",
        "name": "VBA Stomping",
        "evidence": [
          {
            "description": "A static analysis tool reports a structural discrepancy between the VBA source code and the compiled p-code within an MS Office document, specifically flagging the file for 'VBA Stomping'.",
            "data_sources": [
              "File analysis tool logs (e.g., Olevba JSON output)",
              "Zeek files.log",
              "Email security gateway logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Automated file analysis sandbox, Network file shares, Email gateway quarantine, Endpoint devices",
            "action": [
              "Symbolic: Deploy a script to automatically extract MS Office files from network traffic (via Zeek files.log) and email attachments. Execute `olevba --decode` on each file and parse the output. Generate a high-severity alert if the analysis result contains the keyword 'VBA Stomping'.",
              "Statistical: For all scanned documents with macros, extract the line count of the VBA source code and the instruction count of the p-code. Calculate the ratio of source code lines to p-code instructions. Establish a baseline distribution of this ratio for benign documents in your environment. Alert on any document where the ratio is zero or falls more than 3 standard deviations below the mean, indicating source code is missing or anomalously small.",
              "ML: Train a binary classifier on features extracted from the document's VBA project structure. Key features include: presence/absence of source code streams, count of auto-executing function names (e.g., AutoOpen, Document_Open), ratio of suspicious to benign keywords in both source and p-code, and the `olevba` stomping flag itself. Use this model to assign a risk score to all new documents containing macros."
            ]
          },
          {
            "description": "An MS Office parent process (e.g., winword.exe, excel.exe, powerpnt.exe) spawns a child process associated with command execution, scripting, or reconnaissance (e.g., cmd.exe, powershell.exe, wscript.exe, whoami.exe).",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Security Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Virtual Desktop Infrastructure (VDI), Remote Desktop Session Hosts, Corporate servers with MS Office installed",
            "action": [
              "Symbolic: Create a detection rule that triggers when a ParentProcessName of 'winword.exe', 'excel.exe', or 'powerpnt.exe' spawns a ProcessName from a watchlist, including 'powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', 'rundll32.exe', 'certutil.exe', and 'regsvr32.exe'.",
              "Statistical: For each MS Office parent process, build a frequency table of all child processes and their command-line arguments observed over a 30-day baseline period. Alert when a new parent-child process relationship is observed for the first time in the environment (first-seen), or when the command-line arguments for a known relationship have an entropy score that is a statistical outlier (e.g., >95th percentile), suggesting obfuscation.",
              "ML: Use an unsupervised anomaly detection model, such as an Isolation Forest, trained on benign process creation events from Office applications. Use features like parent process name, child process name, command-line length, command-line entropy, and the presence of suspicious substrings (e.g., 'http:', '-enc', 'IEX'). The model should flag any new event that significantly deviates from the established normal profile."
            ]
          },
          {
            "description": "An MS Office process initiates an outbound network connection with anomalous characteristics, such as a non-standard destination port, a high-entropy domain name, or an unusually large data payload.",
            "data_sources": [
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log",
              "Sysmon Event ID 22"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, DNS resolvers, Network egress points",
            "action": [
              "Symbolic: Alert when a process image path ending in 'winword.exe', 'excel.exe', or 'powerpnt.exe' initiates an outbound network connection (Sysmon EID 3) to a destination IP address (not a domain) on a port other than 80, 443, or 53. This helps catch direct C2 callbacks.",
              "Statistical: For each host, baseline the daily volume (bytes_out) of network traffic originating from Office applications using a 30-day moving average and standard deviation. Generate an alert if the daily volume exceeds 4 standard deviations above the average. Additionally, calculate the Shannon entropy for all requested domain names (from Zeek dns.log or Sysmon EID 22) originating from Office processes and alert on domains with entropy scores > 3.5, which is indicative of DGA.",
              "ML: Implement a time-series anomaly detection model (e.g., Seasonal-ARIMA) on a per-host basis for the count of new connections per hour from Office applications. The model should learn the normal daily and weekly 'rhythm' of activity. An alert is generated when the observed connection count significantly deviates from the model's forecast, indicating a potential beaconing pattern."
            ]
          },
          {
            "description": "An MS Office process on an endpoint establishes a network connection to a destination IP, domain, or URL matching a threat intelligence feed, or a downloaded Office document's hash matches a known malicious signature.",
            "data_sources": [
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, DNS resolvers, Network egress points (e.g., Firewalls, Web Proxies)",
            "action": [
              "Symbolic: Query for network events (Sysmon EID 3, Zeek conn.log) where the initiating process is an MS Office application and the destination IP or resolved domain is present in the malicious indicators threat intelligence feed. Separately, query file creation logs (Zeek files.log) for MS Office file types and join the file hash against a malicious file hash feed, alerting on any match.",
              "Statistical: For network connections from MS Office processes, aggregate destination IP addresses by their registered Autonomous System Number (ASN). Establish a baseline of frequently contacted ASNs for the organization. Alert when a connection is made to an ASN that falls into the bottom 5th percentile of connection frequency, indicating a rare and potentially suspicious destination.",
              "ML: Train a supervised classification model (e.g., Random Forest) using labeled data of benign and malicious network connections from Office applications. Features should include: destination port, bytes sent/received, connection duration, JA3/JA3S hash, destination domain entropy, and time-of-day. Deploy the model to score new connections in real-time and alert on those classified as malicious with high confidence."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]