[
  {
    "information_requirement": "Are adversaries using bind mounts to hide processes or files from standard inspection tools? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.013",
        "name": "Bind Mounts",
        "evidence": [
          {
            "description": "The 'mount' command is executed with command-line arguments indicating a bind mount ('--bind', '-o bind', or '-B'), particularly when the source or destination path involves the /proc filesystem.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Linux auditd logs",
              "Sysmon for Linux Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Linux servers, container host nodes (Kubernetes, Docker), and developer workstations using Windows Subsystem for Linux (WSL).",
            "action": [
              "Create a detection rule that generates a high-priority alert when a process creation event for 'mount' is observed and the command line contains '--bind', '-o bind', or '-B'. Escalate the priority if '/proc/' is present in the command-line arguments.",
              "For each host, establish a baseline of 'mount' command executions per user over a 30-day period. Calculate the 99th percentile for the daily frequency of these commands. Generate an alert when the daily count for any user or host exceeds this statistical threshold, indicating an anomalous volume of mount activity.",
              "Train a logistic regression classifier on historical process execution data (e.g., Linux auditd, Sysmon Event ID 1). Use features such as the parent process name (e.g., 'bash', 'sshd'), user context (e.g., 'root', 'www-data'), command-line argument patterns, and time of day. Deploy the model to classify new 'mount' events as benign or suspicious, flagging those with a high probability of being malicious for analyst review."
            ]
          },
          {
            "description": "A discrepancy exists between the set of process IDs (PIDs) enumerated via kernel-level system calls and the set of PIDs enumerated by listing the contents of the /proc filesystem, indicating a process is hidden from user-space tools.",
            "data_sources": [
              "EDR kernel-level process listings",
              "Osquery ('processes' table)",
              "Custom audit script output comparing 'ps' with 'ls /proc'"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-value Linux servers, bastion hosts, servers hosting sensitive data, and containerized environments.",
            "action": [
              "Periodically execute a script that compares the output of a kernel-aware process listing (e.g., from an EDR API or 'ps aux') with a directory listing of '/proc'. Generate a critical alert if any PID from the kernel-aware list does not have a corresponding '/proc/[PID]' directory.",
              "On each host, track the count of mismatched PIDs over time. Apply a statistical process control (SPC) C-chart to this count. Trigger an alert if the count exceeds the upper control limit, defined as the historical mean plus three times the standard deviation, indicating a statistically significant anomaly in process visibility.",
              "Train an unsupervised autoencoder model on vectors representing the process table state at regular intervals. Each vector should include features like total process count, distribution of processes by user, and a hash of the process list. A high reconstruction error for a given state vector suggests a significant deviation from normal, such as a hidden process, and should be flagged for investigation."
            ]
          },
          {
            "description": "A bind mount event on a host is followed within a 60-minute window by network traffic from the same host exhibiting command-and-control (C2) characteristics, such as periodic beaconing or connections to known malicious infrastructure.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Linux auditd logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, critical Linux servers, and developer workstations.",
            "action": [
              "Create a SIEM correlation rule that triggers when a 'mount --bind' event is detected on a host. For the next 60 minutes, search for any network connection from that host's IP address (from Zeek conn.log) to a destination IP or domain on a threat intelligence feed of known C2 servers. Generate a critical alert on any match.",
              "Following a bind mount event, analyze the host's subsequent 60 minutes of network connections from Zeek conn.log. For each repeating destination IP, calculate the standard deviation of the inter-arrival times between connections. Alert if the standard deviation is below a low threshold (e.g., less than 2 seconds), which is indicative of automated, machine-generated beaconing.",
              "Deploy a Long Short-Term Memory (LSTM) autoencoder trained on time-series data of network flows for each host (e.g., bytes_out, connection_duration, packets_out from Zeek conn.log). If a bind mount event occurs, monitor the model's anomaly score for that host's network traffic. A significant spike in the anomaly score following the mount event suggests the hidden process is initiating anomalous network activity."
            ]
          },
          {
            "description": "A host, previously flagged for bind mount activity and added to a watchlist, initiates outbound network connections to destination domains or IP addresses that are statistically rare for the host or its peer group.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic logs at the internet gateway, internal network segments, and from corporate DNS servers.",
            "action": [
              "For any host IP on a 'suspected bind mount activity' watchlist, create a SIEM rule to join its outbound DNS queries (from Zeek dns.log) against a threat intelligence feed of known malicious domains. Generate a critical alert on any match.",
              "For hosts on the watchlist, analyze their DNS requests from Zeek dns.log. Calculate a rarity score for each requested domain based on its query frequency across the enterprise over the last 30 days. Alert on any requests for domains that fall into the 99.9th percentile of rarity (i.e., are almost never seen), indicating a potential connection to a newly established C2 domain.",
              "Develop a 'new destination' anomaly detector using a clustering algorithm like DBSCAN. For each host, create a profile of historically accessed destination Autonomous System Numbers (ASNs) and countries derived from Zeek conn.log IPs. If a new connection from a watchlisted host maps to a destination that falls outside of its established clusters, flag it as a network-topological anomaly requiring investigation."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]