[
  {
    "information_requirement": "Has the adversary manipulated stored data to impact business operations or conceal their activities?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1565.001",
        "name": "Stored Data Manipulation",
        "evidence": [
          {
            "description": "A process executes that matches the file hash or name of a known data wiper or manipulation tool from a threat intelligence source.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Database Servers, Critical Application Servers, Enterprise File Shares, Internet Gateways",
            "action": [
              "1. Symbolic: Continuously monitor Windows Event ID 4688 for new process creation. Compare the 'ProcessName' and 'ProcessHash' fields against a curated threat intelligence list of known data wiper and manipulation tools (e.g., WhisperGate, NotPetya, IsaacWiper). Generate a critical alert upon any match.",
              "2. Statistical: For any process with an unusually high number of file write or delete operations (Windows Event ID 4663), calculate the rate of file modification events per minute. Establish a per-host baseline for this metric. Generate an alert if the rate for a given process exceeds the host's historical mean by four standard deviations ($$ rate > \\mu + 4\\sigma $$).",
              "3. ML: Utilize a pre-trained classification model (e.g., Gradient Boosting) to score process executions. Input features should include process metadata (parent process, user context, command line arguments), file I/O statistics (rate of writes/deletes), and network activity (connections initiated). A classification of 'malicious wiper' should trigger an automated host isolation workflow."
            ]
          },
          {
            "description": "A legitimate system utility (e.g., cipher.exe, sdelete.exe) is executed with command-line arguments indicative of data destruction or overwriting.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, particularly those hosting sensitive data (e.g., financial records, intellectual property) or critical system configurations.",
            "action": [
              "1. Symbolic: Apply regular expression matching on the 'CommandLine' field within Windows Event ID 4688 logs. Search for patterns associated with destructive operations, such as 'cipher.exe /w:', 'format.com /p:', or 'sdelete.exe -p'. An alert should be generated for any match.",
              "2. Statistical: For each execution of a potentially destructive utility, calculate a rarity score based on its historical frequency of use by the specific user and on the specific host. Flag any execution falling in the 99th percentile for rarity. Additionally, calculate the Shannon entropy of the command line; commands with anomalously low entropy (suggesting scripted, non-interactive use) or high entropy (suggesting obfuscation) should increase the event's risk score.",
              "3. ML: Employ a multivariate anomaly detection model (e.g., Isolation Forest) that analyzes clusters of user, host, parent process, and command. A process execution that is flagged as an anomaly (i.e., falls into a new or sparsely populated cluster), especially one involving a destructive command from a non-administrative user, should be escalated for immediate investigation."
            ]
          },
          {
            "description": "The cryptographic hash of a critical system file or configuration file is modified and no longer matches its established known-good baseline hash.",
            "data_sources": [
              "Windows Event ID 4663",
              "File Integrity Monitoring (FIM) tool logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Configuration-sensitive systems such as Domain Controllers, Public Key Infrastructure (PKI) Servers, Web Servers, Database Servers, and hosts with critical business applications.",
            "action": [
              "1. Symbolic: Upon detection of a file write event (Windows Event ID 4663) to a file on a monitored critical asset list, trigger an on-demand hash calculation. Compare the newly computed hash against a stored baseline of known-good hashes. Generate a critical alert on any mismatch.",
              "2. Statistical: Analyze the time series of file modification events (Windows Event ID 4663) on critical assets. A sudden spike in modifications occurring outside of a defined maintenance window (as sourced from a change management database), where the volume exceeds the 98th percentile of a 30-day rolling average, should be flagged for review.",
              "3. ML: Train a classification model (e.g., Random Forest) to assign a legitimacy score to each file modification event on a critical file. Features should include: modifying process name, parent process, user account privileges, time of day, a binary flag indicating if it is 'within maintenance window', and the reputation of the process hash. A low legitimacy score from the model triggers an alert for analyst review."
            ]
          },
          {
            "description": "The rate of file modification or deletion events on a single host or file share significantly exceeds its statistically normal baseline over a short time frame.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4659",
              "Windows Event ID 4660",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-value file shares, document management systems, source code repositories, database servers, and backup storage volumes.",
            "action": [
              "1. Symbolic: Implement a rule to alert if the count of delete events (Windows Event ID 4660) or SMB file delete actions (Zeek smb_files.log where action is 'SMB::FILE_DELETE') from a single user exceeds a hard threshold, such as 500 events in a 5-minute window on a critical NAI.",
              "2. Statistical: For each host and user, calculate a rolling baseline (mean and standard deviation) of file write (4663) and delete (4660) operations per minute. Flag any time window where the operation count exceeds the baseline mean plus three standard deviations ($$ count > \\mu + 3\\sigma $$). The baseline should be multi-faceted, accounting for time of day and day of week.",
              "3. ML: Implement a time-series anomaly detection model (e.g., Prophet or ARIMA) on the stream of file modification and deletion event counts for critical servers. The model will learn the normal rhythm of file activity, including daily and weekly cycles. Alert on any observation where the actual count is significantly different from the model's predicted count with its confidence interval."
            ]
          },
          {
            "description": "A high volume of file rename operations occurs in a short period, where the new filenames uniformly adopt a new, often unrecognized, file extension.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, file servers, backup servers, and network egress points.",
            "action": [
              "1. Symbolic: Monitor file modification events (Windows Event ID 4663) that correspond to a rename operation. Search for events where the new file name includes an extension from a known ransomware or malicious tool blocklist. Correlate this activity with any network connections (Zeek conn.log) to known malicious IPs or newly observed domains (Zeek dns.log) from the same host within a 5-minute window.",
              "2. Statistical: For each monitored directory, calculate the Shannon entropy of the file extensions present on a rolling basis. A sudden, sharp drop in entropy below a dynamic threshold (e.g., falling below 20% of the 24-hour moving average) indicates a loss of diversity characteristic of mass-renaming. Alert on such drops.",
              "3. ML: Use a density-based clustering algorithm (e.g., DBSCAN) on features extracted from file system events over a short time window. The feature set should include event type (create, write, rename), file extension, the process name responsible, and the time delta between events. A dense cluster of 'rename' events to a single, novel extension by a non-system process should be classified as a high-confidence ransomware indicator and trigger automated response."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]