[
  {
    "information_requirement": "Is the adversary using fast flux DNS for command and control communications? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1568.001",
        "name": "Fast Flux DNS",
        "evidence": [
          {
            "description": "A DNS query for a domain or an outbound network connection to an IP address matches an entry on a high-confidence threat intelligence feed categorized as 'fast flux'.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Internet Gateway, Corporate DNS Resolvers",
            "action": [
              "Ingest a high-confidence threat intelligence feed for known fast flux domains and IPs. Create a rule to generate a high-severity alert upon any match between the feed and the 'query' field in Zeek dns.log or the 'id.resp_h' field in Zeek conn.log.",
              "For any host triggering a fast flux IOC match, calculate the percentile rank of the query count for the malicious domain compared to all other domains queried by that host in the last 24 hours. Escalate the alert if the query count is above the 95th percentile, indicating repetitive C2 beaconing behavior.",
              "Train a supervised classification model (e.g., Random Forest) using features from both the threat intelligence feed (e.g., domain age, registrar reputation) and internal network metadata (e.g., query frequency, data payload size). Use the trained model to score new IOC matches, predicting the likelihood that a domain is associated with a specific campaign to prioritize incident response."
            ]
          },
          {
            "description": "A domain queried by an internal host has a high character-entropy score (indicative of DGA) and resolves to multiple IP addresses with high geographic or Autonomous System (AS) diversity within a 60-minute window.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Endpoint devices",
            "action": [
              "Deploy a watchlist of known Domain Generation Algorithm (DGA) patterns using regular expressions and public DGA domain feeds. Generate an alert when a domain in the Zeek dns.log 'query' field matches an entry on this watchlist.",
              "For all domains in Zeek dns.log, calculate the Shannon entropy of the domain name string. Enrich the resolved IPs ('answers') with GeoIP and ASN data. Flag domains where the entropy score is greater than 3.5 and the set of resolved IPs spans more than 3 distinct countries or Autonomous Systems within a 60-minute period.",
              "Implement a pre-trained DGA detection model (e.g., a Long Short-Term Memory network) to classify domain names from Zeek dns.log in near-real-time. For domains classified as DGA, apply a clustering algorithm (e.g., HDBSCAN) to the enriched IP address data (latitude, longitude, ASN). Flag clusters with high geographic dispersion as potential fast flux C2 infrastructure."
            ]
          },
          {
            "description": "A single fully qualified domain name (FQDN) resolves to a high number of unique IP addresses (A or AAAA records) within a short time frame (e.g., under 60 minutes), and the associated DNS records have a Time-To-Live (TTL) value significantly lower than the network baseline (e.g., < 300 seconds).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Network Egress/Internet Gateway",
            "action": [
              "Create a SIEM rule that alerts when a single domain in the Zeek dns.log 'query' field is associated with more than 10 unique IP addresses in the 'answers' field and an average 'TTL' value of less than 300 seconds, both measured over a 30-minute sliding window.",
              "For each domain, calculate a 'flux ratio' over a 60-minute window, defined as $$ (Number of Unique IPs) / (Average TTL) $$. Establish a baseline distribution of this ratio for all domains. Generate an alert for any domain whose flux ratio exceeds the 99th percentile of the established baseline.",
              "Use an unsupervised anomaly detection algorithm like DBSCAN to cluster domains based on features such as the count of unique resolved IPs, the average TTL, the standard deviation of TTLs, and the number of distinct /24 subnets for the resolved IPs over a 60-minute window. Label clusters that are identified as outliers or form their own distinct, dense clusters as highly probable fast flux activity."
            ]
          },
          {
            "description": "The set of authoritative Name Server (NS) records for a domain zone changes more than a baseline number of times within a 24-hour period, and the TTLs for these NS records are consistently low (e.g., < 1800 seconds), indicating double-flux activity.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, External-facing authoritative DNS servers",
            "action": [
              "Create a stateful rule that tracks the set of authoritative name servers for each domain zone observed in Zeek dns.log (where 'qtype_name' is 'NS'). Generate an alert if this set changes more than 5 times in a 24-hour period and the average TTL for the NS records is below 1800 seconds.",
              "For each domain zone, calculate the rate of change of its NS record set and the average TTL of those records over a 24-hour sliding window. Create a 2D scatter plot of (NS Change Rate vs. Average TTL) for all domains. Flag domains that fall into the high-change-rate, low-TTL quadrant (e.g., top 5th percentile for change rate and bottom 5th percentile for TTL) for analyst review.",
              "Model the DNS ecosystem as a graph where nodes represent domains, IPs, and name servers, and edges represent resolutions. Apply a dynamic graph analysis algorithm to detect communities with high 'churn' or rapid changes in their internal structure over time. A community where the name server nodes for a domain are frequently replaced is a strong indicator of a double-flux network."
            ]
          },
          {
            "description": "An endpoint exhibits a burst of DNS queries for a single domain, followed immediately by a series of outbound network connections to multiple, distinct IP addresses that were provided in the DNS responses for that domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Network Egress/Internet Gateway, Domain Controllers",
            "action": [
              "Create a correlation rule that triggers when: 1) A DNS query for a domain on a fast flux IOC list is observed from a host (Zeek dns.log). 2) Within 60 seconds, a network connection event (Windows Event ID 5156 or Zeek conn.log) is logged from the same host to one of the IPs resolved in step 1. 3) Enrich the alert with the parent process information from the corresponding process creation event (Windows Event ID 4688).",
              "For each internal host, establish a 30-day baseline of DNS query counts per external domain. Calculate the Z-score for the query count in a 5-minute window. If the Z-score > 3, join Zeek dns.log and conn.log data for that host and domain in the same window. Calculate a 'connection success ratio' as $$ (Unique IPs Connected To) / (Unique IPs Resolved) $$. A ratio > 0.5 combined with the high Z-score indicates active C2 communication.",
              "Develop a per-host anomaly detection model (e.g., an LSTM autoencoder) trained on a time-series of features including DNS query rate, number of unique domains queried, and number of unique destination IPs. An alert is generated when the model's reconstruction error for a host's current activity exceeds a learned threshold. Use feature importance techniques (e.g., SHAP) on the anomalous window to confirm if a spike in DNS queries to a single domain is the primary driver."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]