[
  {
    "information_requirement": "Has an adversary successfully exfiltrated data by uploading it to a public or private text storage site? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567.003",
        "name": "Exfiltration to Text Storage Sites",
        "evidence": [
          {
            "description": "An outbound HTTP POST request is made to a known text storage site, or a TLS connection is established where the Server Name Indication (SNI) in the client hello matches a known text storage site domain. The connection involves a data upload.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, Web Proxies, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Maintain a threat intelligence list of known text storage site hostnames, IPs, and SSL certificate subjects. Create a detection rule to alert on any network connection where the `id.resp_h` from Zeek conn.log, `host` from Zeek http.log, or `server_name` from Zeek ssl.log matches an entry on this list, especially where the `method` in http.log is 'POST'.",
              "Statistical: For each host, establish a 30-day baseline of bytes sent (`orig_bytes`) to all external destinations. Alert if a connection to a known text storage site results in an `orig_bytes` value that exceeds the 99th percentile of the host's typical outbound connection size, indicating an anomalously large upload.",
              "Machine Learning: Train a random forest classifier on labeled network connection data (Zeek conn.log, http.log) to distinguish between benign and malicious exfiltration activity. Use features such as `orig_bytes`, `resp_bytes`, `duration`, `proto`, destination port, HTTP method, and a binary feature indicating if the destination is a known text storage site. Deploy the model to score new connections in real-time."
            ]
          },
          {
            "description": "A command-line execution containing a process such as `curl.exe` or `powershell.exe` that includes both a URL for a known text storage site and arguments indicative of data upload (e.g., `curl -d`, `Invoke-RestMethod -Method Post`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Production Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule using regular expressions to scan command-line arguments in Windows Event ID 4688 and script block logging in Event ID 4104. The regex should look for the co-occurrence of a process like `curl.exe`, `powershell.exe`, or `wget.exe` with data upload flags (e.g., `-d`, `--data`, `-F`, `-Body`, `Invoke-RestMethod -Method Post`) and a hostname from a list of text storage sites.",
              "Statistical: Calculate the Shannon entropy of command-line strings for common processes like PowerShell and cURL. A high entropy score can indicate obfuscated or data-laden commands. Establish a baseline entropy for normal commands per host and alert when a command involving a text storage site URL has an entropy score exceeding 3 standard deviations above the mean.",
              "Machine Learning: Use a one-class Support Vector Machine (SVM) trained on benign command-line invocations for processes like `powershell.exe` and `curl.exe`. Apply the model to new process creation events. Flag any command-line execution that the model identifies as a significant outlier for analyst review, with high priority if it contains a URL to a text storage site."
            ]
          },
          {
            "description": "A single host's data upload volume (total `orig_bytes` in Zeek conn.log) or connection frequency to the category of text storage sites exceeds a dynamically generated statistical threshold derived from its own 30-day historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Define a hard threshold-based rule. Alert if any single host makes more than 10 connections to known text storage sites within a 1-hour window OR if any single connection uploads more than 10MB of data. These thresholds should be tuned based on environmental norms.",
              "Statistical: For each host, create a 30-day rolling baseline of daily data volume sent to the category of text storage sites. Use the interquartile range (IQR) method to define normal behavior. Alert if a host's daily upload volume to these sites exceeds Q3 + (1.5 * IQR), identifying a statistically significant outlier.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or Seasonal-Trend decomposition using Loess) on the aggregate data volume sent to all text storage sites per hour for the entire network. The model will learn the normal 'rhythm' of traffic. Alert when the actual observed volume significantly deviates from the model's predicted confidence interval."
            ]
          },
          {
            "description": "A network connection to a known text storage site is initiated by a process that is not an approved web browser (e.g., `powershell.exe`, `cscript.exe`, `svchost.exe`).",
            "data_sources": [
              "Windows Sysmon Event ID 3",
              "Windows Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, SIEM for correlation",
            "action": [
              "Symbolic: Create and maintain a list of approved browser executable names (e.g., `chrome.exe`, `firefox.exe`, `msedge.exe`). In Sysmon Event ID 3 (Network Connection) events, check if the `DestinationIp` or `DestinationHostname` matches a watchlist of text storage sites. Alert if the `Image` (process path) is not on the approved browser list.",
              "Statistical: For each host, build a profile that maps processes to the destination categories they typically connect to. Calculate the frequency of these process-destination pairings over a 30-day period. Alert when a rare pairing occurs, such as `svchost.exe` connecting to a 'Text Storage Site' category, if its observed frequency is below a 1st percentile threshold for that host's activity.",
              "Machine Learning: Train a Naive Bayes or Logistic Regression classifier to predict the legitimacy of a network connection. Use features from Sysmon Event ID 3 such as `Image`, `User`, `DestinationPort`, and a categorical feature for the destination IP's reputation. Label data as 'legitimate' for browser processes connecting to text sites and 'suspicious' for all others. Deploy the model to flag connections with a high probability of being suspicious."
            ]
          },
          {
            "description": "A timed sequence of events on a single host where a process first accesses a file on a designated sensitive network share or local directory, and then the same process or its child initiates an outbound network connection to a known text storage site within a short time window (e.g., under 5 minutes).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Sysmon Event ID 11",
              "Windows Sysmon Event ID 1",
              "Windows Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, Databases, User Workstations with access to sensitive data, SIEM for correlation",
            "action": [
              "Symbolic: Configure SACLs on critical file shares to generate Windows Event ID 4663 on access, and enable Sysmon file creation logging (Event ID 11). Create a SIEM correlation rule that triggers when a `ProcessGuid` from a Sysmon Event ID 1 (ProcessCreate) is associated with an Event ID 4663/11 on a sensitive file, and is then followed within 5 minutes by a Sysmon Event ID 3 (Network Connection) from the same `ProcessGuid` to a destination associated with a text storage site.",
              "Statistical: For processes that access sensitive files (triggering Event ID 4663 or Sysmon 11), calculate the conditional probability P(Connects to Text Site | Accesses Sensitive File) based on historical data. Alert if this sequence occurs and its calculated probability is in the bottom 1st percentile of all observed sequential behaviors for that host or user, indicating a rare and suspicious event chain.",
              "Machine Learning: Use a sequence analysis model like a Hidden Markov Model (HMM) or Recurrent Neural Network (RNN) trained on event logs from endpoints. The model learns normal sequences of behavior (e.g., `open_word.exe` -> `access_document.doc` -> `connect_to_sharepoint.com`). The model can then identify and alert on anomalous sequences, such as `run_powershell.exe` -> `access_customer_data.csv` -> `connect_to_pastebin.com`, which deviate from learned legitimate workflows."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]