[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by creating hidden user accounts?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.002",
        "name": "Hidden Users",
        "evidence": [
          {
            "description": "A new user account is created (Windows Event ID 4720) and the associated 'Target User Name' has characteristics, such as high entropy or non-standard characters, that deviate from established organizational naming conventions.",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Endpoint Devices",
            "action": [
              "Monitor for user creation events (Windows Event ID 4720) where the 'Target User Name' matches a threat intelligence watchlist of known malicious account names or a regular expression pattern designed to catch tool-generated names (e.g., '/^support_[a-f0-9]{6}$/').",
              "For each new user creation event (Event ID 4720), calculate the Shannon entropy of the 'Target User Name'. Compare this value against a pre-computed baseline distribution of entropy for all legitimate usernames. Generate an alert for any new username whose entropy score exceeds the 98th percentile of the baseline distribution.",
              "Train a one-class Support Vector Machine (SVM) or an autoencoder model on the character n-gram frequencies (e.g., trigrams) of all existing, legitimate usernames in Active Directory. For each new user creation event (4720), extract its n-gram features and use the trained model to classify the username as 'inlier' (normal) or 'outlier' (anomalous). Flag all outliers for review."
            ]
          },
          {
            "description": "A registry modification event (Windows Event ID 4657 or 4688) sets a value to '0' for a user-specific subkey under `HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList`, effectively hiding the account from the login screen.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Endpoint and Server Registries",
            "action": [
              "Create a high-fidelity alert that triggers upon detection of a registry modification event (Windows Event ID 4657) where the 'Object Name' field contains the string `\\Winlogon\\SpecialAccounts\\UserList\\` and the associated registry value is set to `0` or `0x00000000`.",
              "For all processes observed modifying the `...\\SpecialAccounts\\UserList` registry key, maintain a frequency count of the parent process names (from Event ID 4688 or 4657). Establish a baseline of common administrative processes that perform this action. Alert when a statistically rare parent process (e.g., `winword.exe`, `powershell.exe` running from a user directory) modifies this key.",
              "Implement a time-series forecasting model (e.g., SARIMA) for each host, trained on the historical count of `SpecialAccounts\\UserList` modifications per hour. Generate an alert if the observed number of modifications in a given interval significantly exceeds the model's forecasted value plus a confidence interval, indicating a potential scripted or automated attack."
            ]
          },
          {
            "description": "A command-line process (Windows Event ID 4688) is executed using the `reg.exe` utility with arguments to add or modify a subkey under `...\\SpecialAccounts\\UserList` to hide a user account.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Command-Line Logs, Server Command-Line Logs",
            "action": [
              "Deploy a detection rule that inspects the 'CommandLine' field in process creation events (Windows Event ID 4688) for the execution of `reg.exe` with arguments matching a regular expression like `/reg\\.exe\\s+add\\s+\"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Winlogon\\\\SpecialAccounts\\\\UserList.*\"\\s+\\/d\\s+0/i`.",
              "For every execution of `reg.exe` that modifies the `SpecialAccounts\\UserList` key, analyze the parent process. Calculate the conditional probability of this parent-child relationship occurring based on historical data. Alert when a low-probability parent (e.g., an Office application, a web browser) spawns `reg.exe` for this purpose.",
              "Train a classification model (e.g., Random Forest) on features extracted from process creation events (4688). Features should include command-line argument entropy, argument length, parent process name, and the presence of specific keywords (`SpecialAccounts`, `Winlogon`). The model will classify each `reg.exe` execution as benign administrative activity or malicious hiding activity."
            ]
          },
          {
            "description": "A user account creation event (Windows Event ID 4720) is followed within a 5-minute window by a registry modification (Windows Event ID 4657 or 4688) that hides the newly created user account on the same host system.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Device Event Logs, Server Event Logs",
            "action": [
              "Implement a stateful correlation rule in the SIEM that triggers if a user creation event (4720) for a specific 'Target User Name' on a host is followed by a registry modification event (4657 or 4688) that hides the same user account on the same host within a 5-minute window.",
              "For each host, track the time delta between a user creation event (4720) and a subsequent event hiding that same user. Calculate the distribution of these time deltas across the environment. Alert when this delta falls into a statistically unlikely low percentile (e.g., below the 5th percentile, or less than 5 minutes), as legitimate user creation is rarely followed immediately by a hiding action.",
              "Employ a sequence analysis model, such as a Hidden Markov Model (HMM), trained on typical sequences of user-related security events (e.g., 4720 -> 4624 -> 4634). The model learns normal state transitions. An alert is generated when an anomalous sequence like '4720 (Create User) -> 4657 (Hide User)' is observed, as this represents a low-probability state transition."
            ]
          },
          {
            "description": "An authentication event (Windows Event ID 4624) or network connection (Zeek conn.log) is attributed to a user account that is confirmed to be hidden via its entry in the `SpecialAccounts\\UserList` registry key.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, Network Gateway, DNS Servers, Endpoint Device Event Logs",
            "action": [
              "Periodically generate a definitive list of hidden users by querying the `SpecialAccounts\\UserList` registry key across all managed endpoints. Maintain this list as a high-priority watchlist. Create a detection rule that generates a critical alert if any authentication event (Windows Event ID 4624, especially Logon Types 2, 3, or 10) or network connection (from Zeek conn.log, mapping IP to user) is attributed to a username on this watchlist.",
              "For all successful network logins (Event ID 4624, Logon Type 3 or 10), enrich the source IP address with geolocation data. For each user, establish a baseline of typical source countries/ISPs. If a login from a hidden user occurs, compare its geolocation to the organization's normal operational footprint. Alert if the login originates from a country with a zero or near-zero historical login probability for any user.",
              "Construct a user-entity behavior graph where nodes represent users, hosts, and destination IPs, and edges represent authentication events (4624) and network flows (Zeek conn.log). Augment user nodes with an 'is_hidden' attribute derived from registry state. Apply a graph-based anomaly detection algorithm to identify hidden user nodes that exhibit unusual centrality, connect to new communities of assets, or demonstrate activity patterns that deviate significantly from their (likely non-existent) baseline."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]