[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by modifying cloud compute infrastructure? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578",
        "name": "Modify Cloud Compute Infrastructure",
        "evidence": [
          {
            "description": "Execution of a process on a host, identified by its hash or command-line arguments, that matches a known malicious tool or script used for unauthorized cloud infrastructure modification.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, Developer endpoints, CI/CD pipeline servers, Bastion hosts",
            "action": [
              "Create a detection rule to monitor Windows Event ID 4688 for new process creations. Compare the process name, command-line arguments, and file hash against a threat intelligence feed of known cloud-focused malware (e.g., Pacu, Cloud-Sniper) or suspicious script names (e.g., 'get_creds.ps1').",
              "For processes that interact with cloud APIs (e.g., 'aws.exe', 'az.cmd'), calculate the rarity of specific command-line argument combinations across the enterprise over a 30-day baseline. Flag any command-line invocation that is in the 99th percentile of rarity for further review.",
              "Train a Random Forest classification model on features extracted from command lines (e.g., length, character entropy, keyword count, presence of credentials) to distinguish between benign and malicious cloud tool usage. Correlate alerts with anomalous outbound network connections to cloud API endpoints in Zeek conn.log."
            ]
          },
          {
            "description": "A network connection to a cloud provider API endpoint is observed with a User-Agent string that is either on a denylist of malicious tools or is statistically rare within the organization's network traffic.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internet gateways, Forward proxy servers",
            "action": [
              "In Zeek http.log and ssl.log, filter for traffic to known cloud provider API IP ranges or hostnames. Alert if the 'user_agent' field (in http.log) or client information matches a curated list of signatures associated with hacking tools, outdated SDKs, or generic clients like 'curl' or 'wget'.",
              "For all connections to cloud APIs, aggregate and count the frequency of each User-Agent string (from http.log) and TLS client version (from ssl.log) over a 30-day rolling baseline. Alert on any User-Agent or TLS version that falls below a 1% frequency threshold.",
              "Use a DBSCAN clustering algorithm on vector representations of User-Agent strings to group them. Manually investigate outlier clusters, which may represent previously unknown or custom malicious tools, for potential threats."
            ]
          },
          {
            "description": "A sequence of API calls or CLI commands is executed by a single identity within a short time window, matching a known attack pattern for infrastructure manipulation, such as creating a snapshot, making it public, and copying it to an external account.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider IAM and audit logging services (e.g., AWS CloudTrail S3 bucket, Azure Monitor), Administrator workstations, CI/CD servers",
            "action": [
              "Implement a SIEM correlation rule to detect the specific sequence in cloud audit logs: (Event A: 'CreateSnapshot') followed by (Event B: 'ModifySnapshotAttribute' with public permissions) followed by (Event C: 'CopySnapshot' to an untrusted account ID) from the same user identity within a 30-minute window.",
              "Model the transition probabilities between different cloud API call types (e.g., Create, Modify, Copy, Delete) for normal administrative behavior using a first-order Markov chain. Flag any observed sequence of API calls with a joint probability that falls below a dynamically set threshold, indicating a rare and suspicious workflow.",
              "Train a sequence-based anomaly detection model, such as an LSTM autoencoder, on benign sequences of cloud API calls from audit logs. A high reconstruction error on a new sequence indicates a significant deviation from normal operational patterns and a potential attack."
            ]
          },
          {
            "description": "A cloud API call or CLI command is executed with parameters that configure an overly permissive security setting or disable a security control, such as creating a public VM snapshot or a security group rule allowing all traffic from any source ('0.0.0.0/0').",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider IAM and audit logging services, Configuration Management Databases (CMDB), Administrator workstations",
            "action": [
              "Use regular expressions to search cloud audit log event parameters and process command-line arguments (in Windows Event ID 4688) for high-risk patterns such as 'CidrIp: 0.0.0.0/0', 'allUsers', 'allAuthenticatedUsers', or API calls like 'PutBucketPolicy' with a principal of '*'.",
              "Establish a baseline of 'risky' API calls (e.g., 'ModifySecurityGroupIngress') per user role. Alert if a user's execution rate of risky commands exceeds two standard deviations above their role's average during a 24-hour period.",
              "Train a binary classification model (e.g., Logistic Regression) to label a cloud API call as 'high-risk' or 'low-risk' based on its parameters. Use features like the presence of wildcards, specific keywords ('public', 'all'), and the resource type being modified. Flag any command classified as 'high-risk' for immediate review."
            ]
          },
          {
            "description": "A cloud infrastructure modification API call is executed in a context that is anomalous compared to the user's established baseline, considering factors like time-of-day, source IP geolocation, or Multi-Factor Authentication (MFA) status.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Cloud provider IAM and audit logging services, Endpoints of privileged users, Geolocation databases",
            "action": [
              "Create a SIEM rule that alerts when a sensitive cloud modification API call (e.g., 'DeleteSubnet', 'ModifyInstanceAttribute') is made by a user identity that is not MFA-authenticated, as indicated by the 'MfaAuthenticated' field in the audit log being false.",
              "For each cloud administrator, build a multi-faceted baseline profile from audit logs, including typical API call hours, source IP Autonomous System Numbers (ASNs), and countries. Alert if a new API call deviates from this baseline on two or more facets (e.g., call at 3 AM from a previously unseen country).",
              "Employ an Isolation Forest model on a feature vector for each API call: [user_id, hour_of_day, day_of_week, source_ASN, is_mfa_authenticated]. The model learns normal operational patterns and flags outliers that represent significant contextual deviations."
            ]
          },
          {
            "description": "A statistically significant spike in the rate of cloud compute resource creation or deletion API calls (e.g., for VMs, snapshots, volumes) is observed from a single user identity or source IP, suggesting automated or scripted activity.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider audit logs (e.g., AWS CloudTrail, Azure Activity Log), CI/CD servers, Automation service accounts",
            "action": [
              "Trigger a SIEM alert if the count of API calls like 'RunInstances', 'TerminateInstances', 'CreateSnapshot', or 'DeleteSnapshot' from a single user identity or source IP address exceeds a hard threshold (e.g., 50 calls in 15 minutes).",
              "For each user identity, calculate a moving average and standard deviation for the rate of resource modification API calls per hour. Alert when the current rate exceeds the moving average by more than 3 standard deviations, adjusting for known automation accounts.",
              "Apply a SARIMA time-series forecasting model to the event counts of modification API calls per user. Generate an alert when the observed count significantly exceeds the model's forecasted value and its confidence interval, indicating an unexpected burst of activity."
            ]
          },
          {
            "description": "A large or anomalous outbound network data transfer is observed from a cloud environment, correlated in time with a cloud infrastructure modification event that could enable data access (e.g., making a snapshot public).",
            "data_sources": [
              "AWS CloudTrail",
              "AWS VPC Flow Logs",
              "Azure Network Watcher flow logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider network gateways (e.g., NAT Gateway, Internet Gateway), VPC/VNet flow log collectors, Cloud storage buckets, Cloud provider audit logging services",
            "action": [
              "Create a correlation rule: If a cloud audit log shows a snapshot was made public ('ModifySnapshotAttribute'), and within 1 hour, cloud network flow logs show a large data transfer (>1GB) from an IP associated with that resource to a non-corporate IP, generate a high-severity alert.",
              "After a high-risk modification event (e.g., new instance created in a foreign region), monitor cloud network flow logs for outbound traffic from that resource's network interface. Alert if the traffic volume in the first hour is in the 99th percentile of typical outbound traffic for new instances.",
              "Use a graph-based anomaly detection model where nodes are users, cloud resources (VMs, snapshots), and external IP addresses. If an event sequence creates a path such as (User -> 'CreateSnapshot' -> 'ModifySnapshotAttribute' to public -> 'CreateInstance' -> large egress from new Instance to untrusted IP), flag the entire path as a likely exfiltration chain."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]