[
  {
    "information_requirement": "Is the adversary creating new cloud instances to evade defenses or stage data?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578.002",
        "name": "Create Cloud Instance",
        "evidence": [
          {
            "description": "An instance creation event (e.g., AWS RunInstances) is initiated from an IP address on a threat intelligence feed or uses a public image ID (e.g., AMI) on a deny-list.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "GCP Admin Activity audit logs",
              "Threat Intelligence Feed",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider management plane API endpoints, Threat Intelligence Platform, Internet Gateway",
            "action": [
              "Join cloud provider audit logs on `sourceIPAddress` with a threat intelligence feed of known malicious IPs. Separately, compare the `imageId` from the event against a curated deny-list of non-standard or malicious public images. Generate a high-severity alert on any match.",
              "For all instance creation events, enrich the `sourceIPAddress` with ASN and geolocation data using a tool like MaxMind. Calculate the historical frequency of the source ASN and country over the last 90 days. Flag any instance creation from an ASN or country that appears in less than 1% of historical events.",
              "Deploy a pre-trained classification model (e.g., Random Forest) that uses features such as source IP geolocation, ASN, image owner, image public/private status, and time of day. Use the model to classify each instance creation event with a 'malicious' or 'benign' label and an associated confidence score. Trigger an investigation for events classified as 'malicious' with >85% confidence."
            ]
          },
          {
            "description": "An instance creation event includes an instance name, tag, or User-Agent string that contains suspicious keywords, matches known offensive tool signatures, or has a character entropy value in the 99th percentile of the organizational baseline.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "GCP Admin Activity audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider management plane, SIEM / Log Analytics Workspace, Organizational Naming Convention Policy Documents",
            "action": [
              "Scan the `userAgent`, instance `name`, and `tag` fields within instance creation events using a list of regular expressions that match known C2 tool names (e.g., 'Pacu', 'CloudSploit'), generic placeholders ('temp', 'test'), or base64 encoded strings. Alert on any positive match.",
              "Calculate the Shannon entropy for all new instance names. Establish a baseline distribution of these entropy scores from the last 90 days of activity. Alert on any new instance whose name has an entropy score in the 99th percentile or higher, indicating a high degree of randomness common in machine-generated names.",
              "Train a Natural Language Processing (NLP) classifier on historical instance names and tags, labeling them according to known projects and naming conventions. Use the model to flag new instance names or tags that do not conform to the learned grammatical structure or have a low similarity score to known legitimate patterns."
            ]
          },
          {
            "description": "An instance is created by a user principal that has been inactive for more than 90 days, was created in the last 72 hours, or is creating instances at a rate exceeding 3 standard deviations from their individual or peer group baseline.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "GCP Admin Activity audit logs",
              "Azure AD Sign-in logs",
              "Okta System Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity and Access Management (IAM) service, IdP Administration Portal and Logs, Human Resources Information System (for peer grouping)",
            "action": [
              "For each instance creation event, query the corresponding IAM or IdP service for the `principalId`'s creation timestamp and last activity timestamp. Generate an alert if the account's age is less than 72 hours or if its last activity was more than 90 days prior to the event.",
              "For each user principal, calculate a daily count of instance creation events over a rolling 30-day window to establish a personal baseline. Use a Z-score to flag any day where a user's creation activity exceeds 3 standard deviations from their mean. Additionally, compute a peer group baseline (e.g., 'developers') and flag users whose activity deviates significantly from their group's average.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to user activity data, using features like API call frequency, resource types accessed, and active hours. Identify users classified as 'noise' or belonging to very small, distant clusters as potential outliers representing compromised or anomalous accounts for further investigation."
            ]
          },
          {
            "description": "An instance is created with a configuration that is statistically rare for the organization, such as being deployed in an unused region, using a non-standard instance type, or having a security group rule that permits ingress from `0.0.0.0/0` on a sensitive port (e.g., 22, 3389).",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "GCP Admin Activity audit logs",
              "AWS Config",
              "Azure Policy"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider management plane, Virtual network configuration (VPC/VNet), Cloud Security Posture Management (CSPM) tool findings",
            "action": [
              "Continuously scan new and modified security groups attached to instances. Generate a critical alert if a rule allows inbound traffic from `0.0.0.0/0` or `::/0` on any port not on a pre-approved list (e.g., 80, 443), with special focus on management ports like 22, 3389, 5985, and 1433.",
              "Create frequency distributions for instance attributes like `awsRegion`, `instanceType`, and `instanceSize` based on the last 180 days of activity. Assign a rarity score to each attribute in a new instance creation event. Sum these scores and alert on any event where the total risk score exceeds the 98th percentile of historical scores.",
              "Implement a time-series anomaly detection model (e.g., Prophet or LSTM) for the volume of instances created per region and per instance family. An alert should be triggered if the model detects a sudden spike in creations that significantly deviates from the forecasted volume and its uncertainty interval, suggesting automated, non-standard provisioning."
            ]
          },
          {
            "description": "A sequence of API calls (e.g., `CreateSnapshot`, `RunInstances`, `AttachVolume`) from the same principal occurs within a 15-minute window, particularly if the new instance is in a different region or has a less restrictive security policy than the original.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "GCP Admin Activity audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider management plane, SIEM correlation engine, Cloud data storage services (e.g., AWS EBS, Azure Managed Disks)",
            "action": [
              "Implement a stateful correlation rule in the SIEM that triggers on a `CreateSnapshot` event. The rule should then look for `RunInstances` and `AttachVolume` events by the same principal within the next 15 minutes. Escalate the alert to critical if the `awsRegion` of the new instance differs from the snapshot's source region.",
              "Analyze historical time deltas between related API calls (e.g., `CreateSnapshot` -> `RunInstances`) for legitimate workflows. Calculate the 5th percentile for these time deltas. Flag any new sequence where the time between events falls below this threshold, indicating an unusually fast, likely scripted, operation.",
              "Train a sequence analysis model (e.g., Hidden Markov Model or Recurrent Neural Network) on legitimate sequences of cloud API calls related to system administration and deployment. Use the trained model to score the probability of new, observed sequences. Flag sequences with a low probability score as anomalous and potentially malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]