[
  {
    "information_requirement": "Has the adversary attempted to evade detection by deleting cloud instances? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578.003",
        "name": "Delete Cloud Instance",
        "evidence": [
          {
            "description": "A cloud instance deletion API call (e.g., AWS 'TerminateInstances', Azure 'virtualMachines/delete', GCP 'instances.delete') originates from an IP address that is either a known indicator of compromise (IOC) or is geographically/organizationally anomalous for the executing user or role.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log",
              "Windows Security Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, Identity and Access Management (IAM) Service, Internet Gateway/VPC Flow Logs, Threat Intelligence Platform, Administrator Workstations",
            "action": [
              "Query for instance deletion events. For each event, extract the `sourceIPAddress`. Compare this IP against an aggregated threat intelligence feed containing known malicious IPs, TOR exit nodes, and anonymizing proxy services. Trigger an alert on any match.",
              "For each user/role, maintain a historical baseline of source countries and Autonomous System Numbers (ASNs) from which they perform administrative actions. For each new deletion event, calculate the rarity of its source country/ASN against the user's baseline. Trigger an alert if the source's frequency is below a percentile threshold (e.g., <1st percentile).",
              "Apply a trained unsupervised anomaly detection model (e.g., Isolation Forest) to enriched deletion events. Use features including `source_IP_geo_rarity_score`, `source_ASN_rarity_score`, `time_of_day_anomaly`, `user_role_privilege_level`, and `is_MFA_enabled`. Alert on events with an anomaly score exceeding a predefined threshold."
            ]
          },
          {
            "description": "A cloud instance deletion API call is executed with a User-Agent string that matches a known malicious tool, is not on an organizational allow-list, or is statistically rare for the actor.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek http.log",
              "Windows Security Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, CI/CD Pipeline Servers, Administrator Workstations, Proxy and Egress Firewalls",
            "action": [
              "Extract the `userAgent` string from each instance deletion event. Trigger an alert if the User-Agent is not found in an allow-list of approved administrative tools (e.g., 'Terraform', 'Boto3', 'AWS-CLI/2.x', 'Azure-PowerShell') OR if it matches a signature from a deny-list of known hacking tools.",
              "For each user/role, maintain a frequency distribution of `userAgent` strings used for administrative actions. For a new deletion event, alert if the User-Agent has never been observed for that user/role before, or if its organizational usage frequency falls in the bottom percentile (e.g., <2nd percentile).",
              "Vectorize User-Agent strings using a character-level TF-IDF model. Apply a pre-trained clustering algorithm (e.g., DBSCAN) to the vector space. Alert on any deletion event whose User-Agent vector is classified as noise or belongs to a small, anomalous cluster, indicating a deviation from common toolsets."
            ]
          },
          {
            "description": "A cloud instance is deleted by the same user or role that created it, and the time between creation and deletion is a statistical outlier compared to the lifespans of similar instances.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, Virtual Private Cloud (VPC), Cloud Asset Inventory Database (CMDB), Cloud orchestration and automation platforms",
            "action": [
              "For each instance deletion event, find the corresponding creation event by correlating `instanceId`. Calculate the lifespan (`deletion_timestamp - creation_timestamp`). Trigger an alert if the `userIdentity` for both events is the same AND the lifespan is less than a static threshold (e.g., 15 minutes), filtering out known automation service accounts.",
              "Maintain historical distributions of instance lifecycles, grouped by `instanceType`, `imageID`, or creation tags (e.g., 'project:temp-build'). For each new deletion, compare its lifespan to the historical distribution of its group. Trigger an alert if the lifespan falls below a low percentile threshold (e.g., 5th percentile).",
              "Model the distribution of instance lifecycles using a probability distribution (e.g., Weibull or log-normal). For each new deletion event, calculate the p-value of its observed lifespan under the fitted model. Alert if the p-value is extremely low (e.g., < 0.01), indicating it is a significant outlier from expected behavior."
            ]
          },
          {
            "description": "A cloud instance with 'critical' or 'production' tags, or an instance whose uptime is in the top decile of all active instances, is deleted by a user not in a designated administrator group or outside an approved change window.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "CMDB/Asset Inventory",
              "Change Management System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Production Environment VPCs, Cloud Asset Inventory Database (CMDB), IT Service Management (ITSM) Platform, Identity and Access Management (IAM) Service",
            "action": [
              "Create a rule that triggers an alert when a deletion event's target `instanceId` has a tag `{'environment': 'production'}` OR `{'criticality': 'high'}` AND the `userIdentity.principalId` is NOT a member of the `CloudSystemAdministrators` IAM group OR the event timestamp does not fall within a time window specified in an approved change request ticket for that instance.",
              "Periodically calculate the uptime distribution for all currently running instances. When a deletion event occurs, check the instance's last known uptime. Trigger an alert if the uptime was in the top decile (e.g., >90th percentile) of the active instance population, indicating the removal of a stable, long-running asset.",
              "Train a binary classification model (e.g., Gradient Boosting) to predict `is_deletion_authorized`. Use features such as `[actor_role_permissions_score, is_outside_business_hours, is_in_change_window, instance_uptime_percentile, number_of_critical_tags]`. Deploy the model to score incoming deletion events and alert on those classified as 'unauthorized' with high confidence."
            ]
          },
          {
            "description": "A single user, role, or source IP address executes a number of instance deletion API calls that significantly exceeds their own historical baseline or an organization-wide dynamic threshold within a short time window.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, Identity and Access Management (IAM) Service, Billing and Cost Management Dashboard",
            "action": [
              "Using a sliding 10-minute window, count the number of distinct `instanceId`s targeted by deletion events, grouped by `userIdentity.principalId`. Trigger an alert if this count exceeds a static threshold (e.g., >20 instances), tuned to avoid noise from legitimate automation.",
              "For each user/role, maintain a moving average and standard deviation of instance deletions per hour. For each new deletion event, update the count within the current hour's window and calculate its Z-score against the user's historical baseline. Trigger an alert if the Z-score exceeds 3.5.",
              "Apply a time series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the minute-by-minute count of organization-wide instance deletions. The model should account for known periodicities (e.g., daily, weekly). Alert when the observed count is a statistically significant outlier that falls outside the model's predicted confidence interval."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]