[
  {
    "information_requirement": "Is the adversary leveraging botnet infrastructure for operations targeting our organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.005",
        "name": "Botnet",
        "evidence": [
          {
            "description": "A successful outbound network connection or an accepted inbound connection is established with an IP address or domain identified as botnet C2 infrastructure by a high-confidence threat intelligence source.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, DNS resolvers, web proxies, and perimeter firewalls.",
            "action": [
              "Symbolic: Continuously join network logs (Zeek conn.log, dns.log) with a threat intelligence feed of known botnet C2 IPs and domains. Generate a high-severity alert for any successful outbound connection or DNS query that matches an indicator.",
              "Statistical: For IPs not on a blocklist but present in lower-confidence reputation feeds, calculate a risk score for each internal host based on the number and severity of connections to these IPs. Establish a baseline of risk scores across all hosts. Alert if an internal host's cumulative risk score over a 24-hour period exceeds the 95th percentile of all host scores.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from CTI feeds (e.g., IP reputation, ASN, country, domain age, domain entropy) to predict the likelihood that a new, unseen IP/domain is part of a botnet. Score all outbound connections in near real-time and alert on any connection with a probability score above a high-confidence threshold (e.g., >0.90)."
            ]
          },
          {
            "description": "An outbound HTTP or TLS connection exhibits artifacts associated with known botnet families, such as a blacklisted User-Agent string, a rare JA3/JA3S hash, or a malicious JARM fingerprint.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, web proxies, SSL/TLS inspection appliances.",
            "action": [
              "Symbolic: Create and maintain watchlists of User-Agent strings, JA3/JA3S hashes, and JARM fingerprints associated with known botnet families (e.g., Qakbot, IcedID, Emotet). Scan Zeek http.log and ssl.log for exact matches in outbound traffic and generate a high-severity alert.",
              "Statistical: For every JA3 hash and User-Agent string observed in outbound traffic, calculate its prevalence (rarity) across the enterprise over the last 30 days. Generate a medium-severity alert on any connection using a JA3 hash or User-Agent that falls into the bottom 1% of prevalence (i.e., is seen on less than 1% of hosts), as this indicates anomalous tooling.",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on features extracted from Zeek ssl.log (e.g., numerical representations of JA3, JARM, certificate issuer, certificate subject) and http.log (e.g., User-Agent length, URI length, request method). Flag connections that are identified as significant outliers from established baseline traffic patterns for analyst review."
            ]
          },
          {
            "description": "A sudden, anomalous increase in the volume and source diversity of inbound network connections targeting a single internal service, exceeding historical norms and indicative of a Distributed Denial of Service (DDoS) attack.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, internet-facing application servers, public DNS servers, VPN concentrators.",
            "action": [
              "Symbolic: Monitor Zeek conn.log for a high rate of connections with a state of 'S0' (connection attempt seen, no reply) or 'REJ' (connection rejected) to a single destination. Generate a high-severity alert if the rate from distinct source IPs exceeds a static threshold (e.g., >10,000 connections/minute).",
              "Statistical: In 5-minute windows, calculate the Shannon entropy of source IP addresses connecting to any single destination host/port pair. Establish a rolling 24-hour baseline for this entropy metric. Alert if the current value exceeds 3 standard deviations from the baseline mean, indicating a significant increase in source diversity characteristic of a DDoS attack.",
              "Machine Learning: Employ a time-series forecasting model (e.g., ARIMA or LSTM) on key metrics like total inbound connection counts per minute and unique source IPs per minute for critical services. Generate an alert when the observed values significantly deviate from the forecasted range, indicating a volumetric anomaly."
            ]
          },
          {
            "description": "An internal host initiates an anomalously high number of outbound connections to unique external destinations (outbound scanning) or makes DNS queries for non-existent, random-looking domains (DGA), indicating it may be a compromised bot.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers), internal DNS resolvers, and network egress points.",
            "action": [
              "Symbolic: Create a rule to detect if a single internal host initiates connections to more than 500 unique external destination IPs on any port within one hour (from Zeek conn.log). Correlate the timestamp and host IP with Windows Event ID 5156 (Network Connection) and its parent process from Event ID 4688 to identify the responsible executable.",
              "Statistical: For each internal host, calculate a 30-day baseline of the number of unique destination IPs connected to per hour. Alert if a host's hourly activity exceeds the 99th percentile of its own historical baseline. Separately, for each host, calculate the Shannon entropy of the second-level domains in its DNS queries per 15-minute window. A high entropy value compared to the host's baseline suggests DGA activity.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on host network behavior features (e.g., total connections, unique destinations, bytes out, connection frequency, DNS query count). Hosts that are not assigned to the large 'normal' cluster are flagged as anomalous and warrant investigation as potential bots."
            ]
          },
          {
            "description": "An internal host establishes a series of outbound connections to a single external destination where the time interval (jitter) between connections is near-zero and/or the size of the data payload is highly consistent, indicating automated C2 beaconing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, endpoint devices (workstations, servers).",
            "action": [
              "Symbolic: Correlate all outbound connections from Zeek conn.log against a threat intelligence list of known C2 servers. Additionally, search for connections where the protocol identified by Zeek (e.g., `ssh`) is on a non-standard port (e.g., port 443), and alert on any matches.",
              "Statistical: For each internal source IP and external destination IP pair, group connections into sessions and calculate the standard deviation of the time deltas between consecutive connections within a session. A standard deviation near zero (e.g., < 1 second) over 10 or more connections is indicative of automated beaconing. Alert on such low-jitter connections.",
              "Machine Learning: Apply a Fast Fourier Transform (FFT) to the time series of connection events for each host-destination pair over a 24-hour period. A strong, dominant peak in the resulting frequency spectrum indicates a periodic signal characteristic of C2 beaconing, even with moderate network jitter. Alert on the presence of a strong periodic signal above a noise threshold."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]