[
  {
    "information_requirement": "Has an adversary established accounts on external services for use in targeting our organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585",
        "name": "Establish Accounts",
        "evidence": [
          {
            "description": "An inbound email is received where the sender's source IP address or mail-from domain is present on a high-confidence threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud-based Email Security Service, On-premise Mail Transfer Agent (MTA), Network Egress/Ingress Points (Firewalls/Proxies)",
            "action": [
              "Continuously query Zeek conn.log for `id.orig_h` and smtp.log for the sender's domain against a watchlist of IPs and domains from threat intelligence feeds. Generate a high-severity alert for any match.",
              "For each matched IOC, calculate a risk score. The score is weighted by the CTI feed's historical true-positive rate and inversely by the IOC's age (newer = higher score). Alert if the risk score exceeds a dynamically adjusted threshold based on the 95th percentile of scores from the last 7 days.",
              "Using features from Zeek logs (IP geolocation, ASN, protocol, port, sender domain reputation) and CTI feed data, train a supervised classification model (e.g., Random Forest) on a labeled dataset of malicious and benign connections. Score all new inbound connections in real-time and alert when the predicted probability of being malicious exceeds a threshold of 0.90."
            ]
          },
          {
            "description": "An inbound email is received from a sender domain that is either algorithmically identified as a typosquat/homoglyph of the organization's domain, or whose WHOIS registration date is less than 30 days old.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "External WHOIS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Internal/External DNS Resolvers, Domain Registrar Data Feeds",
            "action": [
              "Maintain a pre-generated list of typosquat/homoglyph variations of the organization's domains. Create a rule to query the Zeek smtp.log `from` field for exact matches against this list. Separately, for each new sender domain, perform a WHOIS lookup and alert if the creation date is less than 30 days old.",
              "For all inbound sender domains observed in Zeek smtp.log, query their creation date. Calculate the 5th percentile of domain age for all inbound mail over the last 90 days. Generate a medium-severity alert for any email from a domain with an age below this percentile.",
              "Apply time series forecasting (e.g., Prophet) to the daily count of newly observed sender domains from Zeek dns.log and smtp.log. An alert is generated when the daily count of new domains with an age less than 30 days exceeds the model's forecasted upper confidence interval, indicating an anomalous spike."
            ]
          },
          {
            "description": "A single external source IP or domain sends a low volume of emails (e.g., < 20) to a high number of distinct internal recipients (e.g., > 10) within a 24-hour window, with no observed replies from internal recipients.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Exchange (MX) Servers, Email Gateway, Network Egress Points",
            "action": [
              "In a sliding 24-hour window, aggregate Zeek smtp.log data to identify source IPs/domains where the count of unique internal recipients is > 10 and the total email count is < 20. Cross-reference with egress conn.log data to ensure no reply traffic (SMTP/S, IMAP/S, POP3/S) was sent back to the source. Alert if all conditions are met.",
              "For each external sender, calculate the Shannon entropy of their recipient list within a 24-hour window. Establish a baseline entropy distribution for legitimate external senders. Alert on any sender whose entropy is in the top 5th percentile (wide distribution) and whose total email volume is in the bottom 10th percentile (low volume).",
              "Model sender-recipient interactions from Zeek smtp.log as a bipartite graph. Apply a clustering algorithm like DBSCAN to the feature vectors of senders (e.g., features: recipient count, email count, byte count). Senders identified as noise points by the algorithm are anomalous and may represent probing activity; flag for investigation."
            ]
          },
          {
            "description": "The daily volume of emails or total bytes transferred from domains associated with free webmail (e.g., gmail.com) or dynamic DNS providers significantly deviates from the established historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, DNS Resolvers, Network Egress/Ingress Points (Firewalls/Proxies)",
            "action": [
              "Maintain a categorized list of domains (e.g., free webmail, dynamic DNS, public cloud). Create a rule that alerts if the count of unique source IPs from any single domain on this list communicating with the organization in a 1-hour window exceeds a static threshold (e.g., 100 unique IPs).",
              "For each domain category, calculate a 30-day moving average and standard deviation for both email count (from Zeek smtp.log) and total bytes transferred (from Zeek conn.log). Generate an alert when the daily volume for a category exceeds the moving average by more than 3 standard deviations.",
              "For each high-risk domain category, train a time series anomaly detection model (e.g., Isolation Forest on time-based features) on hourly connection counts from Zeek conn.log. The model learns normal communication patterns, including seasonality. Alert on any data point flagged as an anomaly, as it represents a statistically significant deviation from the norm."
            ]
          },
          {
            "description": "An account is created on an external service (e.g., social media, code repository) using a corporate email address, or a new profile is discovered that impersonates a key employee (e.g., executive, system administrator).",
            "data_sources": [
              "CASB Logs",
              "Web Proxy Logs",
              "OSINT Monitoring Service Data",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Access Security Broker (CASB), Secure Web Gateway, Public Internet (Social Media, Code Repositories), File Servers hosting HR data",
            "action": [
              "Configure CASB policies to alert on any new user account creation on non-sanctioned platforms using a corporate email address. Separately, create a watchlist of key employee names and titles to be used by an OSINT monitoring service to detect newly created matching profiles.",
              "From web proxy logs, establish a baseline of domains visited per user. Alert when a user visits a social media profile of a newly created persona (identified via OSINT) claiming to be an employee, especially if that profile's connection/follower count is below the 1st percentile of legitimate employee profiles.",
              "Use an NLP entity recognition model on data from OSINT feeds to extract person names and associated company names from new social media profiles. If the company name matches the organization, use a classification model (trained on features like account age, follower count, post frequency) to predict if the profile is a legitimate employee or a suspicious persona. Alert on profiles classified as suspicious with high confidence."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]