[
  {
    "information_requirement": "Has the adversary deployed a newly developed capability within our environment? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1587",
        "name": "Develop Capabilities",
        "evidence": [
          {
            "description": "The MD5, SHA1, or SHA256 hash of a process executable or a file transferred over the network matches a known-malicious hash from a threat intelligence source specializing in newly developed malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Network egress points, Threat intelligence platforms",
            "action": [
              "Symbolic: Continuously join process creation events (Windows Event ID 4688 or Sysmon Event ID 1) and file transfer events (Zeek files.log) with a threat intelligence feed of known-malicious file hashes. Generate a critical alert upon any match.",
              "Statistical: For any executable file hash observed for the first time, calculate its prevalence (count of unique endpoints) across the environment. Flag hashes with a prevalence below a defined threshold (e.g., seen on fewer than 5 hosts or <0.1% of the total fleet) for investigation, excluding hashes associated with known legitimate software patches or internal development builds by cross-referencing a software inventory database.",
              "Machine Learning: Utilize a pre-trained supervised classification model (e.g., Gradient Boosting, Random Forest) that uses file metadata (e.g., PE header fields, section entropy, string features from the binary) and execution context (e.g., parent process, file path) to classify newly observed, low-prevalence executables as benign or malicious. New confirmed malicious samples should be used to retrain and update the model."
            ]
          },
          {
            "description": "A client-server TLS handshake is observed with a JA3 or JA3S hash that has a statistically insignificant prevalence within the organization's 30-day traffic baseline, suggesting the use of a non-standard or custom-built application.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internal network segments, TLS inspection points",
            "action": [
              "Symbolic: Query Zeek ssl.log for connections where the JA3 or JA3S hash matches an entry on a high-confidence watchlist of hashes associated with known malware families or adversary tools. Trigger an alert for any match.",
              "Statistical: Maintain a 30-day rolling baseline of all JA3 and JA3S hashes observed in Zeek ssl.log. For each new TLS session, check if the JA3/JA3S hash falls below a low-frequency threshold (e.g., 1st percentile of observations). Escalate alerts for rare hashes that are also connecting to newly registered domains or IP addresses with low reputation.",
              "Machine Learning: Apply a density-based clustering algorithm (e.g., DBSCAN) to the feature space of JA3 hashes and associated connection metadata (destination port, Server Name Indication, connection duration, total bytes). Isolate small clusters and noise points (outliers) which represent client behaviors that deviate from large, well-established clusters of legitimate applications like web browsers or OS update services."
            ]
          },
          {
            "description": "A single process exhibits a suspicious sequence of behaviors within a short time frame (< 5 minutes), such as creation of a novel executable, followed by the establishment of a persistence mechanism (e.g., new service, scheduled task, or Run key), and culminating in an external network connection.",
            "data_sources": [
              "Windows Event ID 1",
              "Windows Event ID 11",
              "Windows Event ID 13",
              "Windows Event ID 7045",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers), Domain Controllers, Active Directory",
            "action": [
              "Symbolic: Define and deploy a correlation rule that triggers when a single process GUID (from Sysmon Event ID 1) is observed creating a file (Sysmon Event ID 11), then modifying a common persistence registry key (Sysmon Event ID 13), and is finally associated with an outbound connection to an external IP (Zeek conn.log), all within a 60-second window.",
              "Statistical: For all parent-child process relationships (Sysmon Event ID 1), calculate the frequency of each unique relationship across the environment. Flag relationships that are statistically rare (e.g., `services.exe` spawning `powershell.exe`). Further risk-score these events by analyzing the subsequent actions of the child process and flagging sequences with very low joint probability based on historical data.",
              "Machine Learning: Implement a Hidden Markov Model (HMM) or Recurrent Neural Network (RNN) where states or nodes represent discrete host events (e.g., 'ProcessCreate', 'FileWrite', 'RegKeySet', 'NetConnOutbound'). Train the model on sequences of events generated by known-benign applications. Use the trained model to calculate the likelihood score of new event sequences observed on endpoints; sequences with a likelihood score below a critical threshold are flagged as anomalous and potentially malicious."
            ]
          },
          {
            "description": "Outbound network traffic to a single destination IP exhibits a highly regular time interval between connections (beaconing) or involves a sustained, unusually large data upload (staging), especially when the destination domain was registered within the last 30 days.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS servers (recursive resolvers), Network egress points, Web proxies",
            "action": [
              "Symbolic: Correlate Zeek dns.log with a threat intelligence feed of newly registered domains (NRDs). Generate an alert for any internal host resolving a domain registered within the last 72 hours, excluding domains on an allow-list.",
              "Statistical: For each internal source to external destination IP pair in Zeek conn.log, group connections into 1-hour windows and calculate the standard deviation of the time delta between sequential connections. A standard deviation near zero (e.g., < 1 second) indicates beaconing. Separately, for each connection, calculate the ratio of `orig_bytes` to `resp_bytes`. A very high ratio on a connection to a new or low-reputation IP that also exceeds the 99th percentile of `orig_bytes` for the source host is indicative of data staging.",
              "Machine Learning: For each internal host, use a time series anomaly detection model (e.g., Seasonal-ARIMA, Prophet) on the volume of outbound data (`orig_bytes` from Zeek conn.log), aggregated per hour. An anomaly is flagged when the observed data volume significantly deviates from the forecasted volume and its confidence interval, especially if the traffic is directed to a single, previously unseen destination."
            ]
          },
          {
            "description": "An external TLS connection is initiated using a server certificate that is self-signed, has a validity period of less than 90 days, a 'not_before' date within the last 7 days, or contains subject/issuer fields with Shannon entropy below a baseline threshold, indicating a likely disposable certificate for C2.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "TLS inspection points, Network egress points, Web proxies",
            "action": [
              "Symbolic: Create a detection rule to alert on any outbound TLS session from Zeek ssl.log where the 'issuer' field string is identical to the 'subject' field string AND the destination IP is not on an allow-list of known internal services or trusted vendors that use self-signed certificates.",
              "Statistical: From Zeek ssl.log, calculate the Shannon entropy for all certificate 'subject' common name (CN) fields. Flag certificates with entropy scores below the 10th percentile of the historical distribution. Additionally, flag any certificate where the validity duration ('not_after' - 'not_before') is less than 90 days or the 'not_before' date is within the last 7 days. Combine these flags into a risk score.",
              "Machine Learning: Train a binary classification model (e.g., XGBoost) to predict certificate maliciousness. Features should include: 'is_self_signed' (boolean), 'validity_period_days' (integer), 'subject_issuer_entropy' (float), number of Subject Alternative Names (SANs), and public key algorithm. Train the model using labeled data from Certificate Transparency logs and known-malicious certificates from threat feeds."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]