[
  {
    "information_requirement": "Has the adversary gathered reconnaissance information via private threat intelligence sources that enables subsequent attacks?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1597.001",
        "name": "Threat Intel Vendors",
        "evidence": [
          {
            "description": "A connection attempt or authentication event originates from an external IP address that is either 'first-seen' in logs within the last 24 hours or is present on an active threat intelligence feed of malicious infrastructure. The event may also involve a username present on a list of compromised credentials from a recent data breach.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, VPN Concentrators, External-facing Authentication Services (e.g., ADFS, OWA), Domain Controllers",
            "action": [
              "Symbolic: Continuously ingest threat intelligence feeds of malicious IPs and compromised credentials. For every external connection (Zeek conn.log) and authentication event (Windows Event ID 4624/4625), query the source IP and username against the ingested feeds. Generate a high-severity alert upon a direct match.",
              "Statistical: For each external source IP address, calculate the ratio of failed logins (Windows Event ID 4625) to successful logins (Windows Event ID 4624) over a 1-hour sliding window. Flag any IP address whose failure ratio exceeds the 99th percentile of all external authenticating IPs. Increase the risk score of the flagged IP if it is also associated with usernames from a known breach list.",
              "Machine Learning: Train a logistic regression classifier on labeled historical authentication data. Use features such as source IP reputation, time of day, geolocation, user agent, and a binary feature indicating if the username appeared in a recent breach list. Deploy the model to score new login events (Windows Event ID 4624/4625) in near real-time, flagging events with a predicted probability of being malicious greater than $$ 0.9 $$ for immediate investigation."
            ]
          },
          {
            "description": "HTTP requests to public-facing web servers contain User-Agent strings, URI paths, or request header combinations that are exact signatures for known reconnaissance or vulnerability scanning tools (e.g., Nmap, Metasploit, Nuclei), particularly within a 72-hour window following a relevant threat intelligence report.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Gateways, Web Application Firewalls (WAFs)",
            "action": [
              "Symbolic: Create and maintain a detection rule that uses a set of regular expressions to match known malicious User-Agent strings and URI patterns from scanning tools in Zeek http.log data (e.g., `/(nmap|masscan|zgrab|nuclei|metasploit)/i` in the `user_agent` field). Trigger an alert on any match.",
              "Statistical: For each source IP in Zeek http.log, calculate the Shannon entropy of the requested URI paths within a 5-minute window. Flag any IP whose entropy score exceeds the 98th percentile of all external IPs, as this indicates directory scanning or fuzzing. Correlate these high-entropy IPs with connection logs (Zeek conn.log) to see if they are also connecting to an unusually high number of distinct ports.",
              "Machine Learning: Apply a k-means clustering algorithm to features extracted from Zeek http.log, such as request method, response status code, content length, and URI path depth. Profile normal user behavior into one or more clusters. Periodically analyze traffic that falls into outlier clusters or forms new, distinct clusters to identify previously unknown scanning or reconnaissance tools."
            ]
          },
          {
            "description": "A statistically significant increase in connection attempts or scanning activity against a specific service or port, where the timing is correlated within 72 hours of a threat intelligence publication detailing a new vulnerability or exploit for that service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Perimeter Firewalls, Demilitarized Zone (DMZ) services, Public IP address space",
            "action": [
              "Symbolic: Upon ingestion of a CTI report for a new vulnerability on a specific port (e.g., TCP/445), immediately deploy a rule to count connection attempts to that port from any single external IP in Zeek conn.log. Alert if the count exceeds a threshold of 100 connection attempts within a 5-minute window.",
              "Statistical: For each public-facing service (destination IP and port), create a time series of unique source IPs connecting per hour. Calculate a 24-hour moving average and standard deviation for this metric. Generate an alert whenever the current hourly count exceeds three standard deviations above the moving average, indicating a statistically significant spike.",
              "Machine Learning: For critical external services, implement a time series forecasting model (e.g., Prophet or an LSTM-based model) on historical connection volume from Zeek conn.log. Train the model to predict expected traffic volume for the next 24 hours. Generate an anomaly alert if the observed traffic volume significantly exceeds the model's forecasted prediction interval, especially if this occurs shortly after a related vulnerability disclosure."
            ]
          },
          {
            "description": "A high volume of failed authentication attempts from a single source IP across many different user accounts (password spraying) or against a single account with many different passwords (credential stuffing), using credentials known from a recently disclosed data breach.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN servers, Single Sign-On (SSO) platforms, Externally accessible applications (e.g., Outlook Web Access)",
            "action": [
              "Symbolic: Create a rule that triggers when a single source IP generates more than 10 failed login events (Windows Event ID 4625) for more than 5 distinct user accounts within a 10-minute window. This is a clear signature of a password spraying attack.",
              "Statistical: Calculate the baseline rate of failed logins (Event ID 4625) per source IP per hour. Identify source IPs where the failed login count is a statistical outlier (e.g., greater than the 99th percentile or more than 3 interquartile ranges above the third quartile). For these outlier IPs, verify if the targeted usernames match a common corporate format (e.g., `first.last`) and correlate with recent breach data.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) to distinguish between normal failed logins and credential-based attacks. Engineer features like the count of unique usernames per source IP in a time window, time delta between login attempts, and source IP reputation. Use the model to classify authentication failures (Event ID 4625) and flag high-probability attacks for automated blocking."
            ]
          },
          {
            "description": "Targeted scanning or exploitation attempts directed at specific assets (e.g., servers, applications) within 48 hours after those assets or their underlying technologies were mentioned in a threat intelligence report, press release, or job posting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Asset Management Database, Public DNS records, Network infrastructure mentioned in public reports or job postings",
            "action": [
              "Symbolic: Maintain a dynamic 'watch list' of high-value or recently exposed asset IPs and hostnames. Create a high-priority alert to trigger on any connection attempt (Zeek conn.log) to an asset on this list from a source IP found on a CTI feed of known malicious actors or scanning infrastructure.",
              "Statistical: For each asset on the watch list, establish a baseline of daily connection volume and variety (number of unique source IPs). After a CTI report mentions the asset, perform a change point detection analysis on the connection volume time series. A statistically significant upward shift in the mean volume post-report indicates targeted interest.",
              "Machine Learning: For each high-value asset, train an autoencoder on a baseline of normal network traffic patterns from Zeek conn.log, using features like source/destination IP, port, protocol, and connection duration. In production, feed new connection data to the model. Flag any connection that produces a high reconstruction error, as it deviates from the learned normal behavior and may represent novel reconnaissance or an exploit attempt."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]