[
  {
    "information_requirement": "Is the adversary conducting reconnaissance against the organization using passive DNS?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.001",
        "name": "DNS / Passive DNS",
        "evidence": [
          {
            "description": "An external IP address, listed on a threat intelligence feed with a 'reconnaissance' or 'scanner' tag, performs one or more DNS queries for the organization's domains. Alternatively, DNS queries are observed for FQDNs that mimic the organization's domain and are known to be associated with adversary C2 or phishing infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Threat Intelligence Platform Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DNS Servers, Public-facing DNS Resolvers, Network Egress/Ingress Points (Firewalls), Threat Intelligence Subscription Services",
            "action": [
              "1. (Symbolic) Implement a SIEM rule to cross-reference the source IP (`id.orig_h`) of each query in `Zeek dns.log` against a threat intelligence feed of known reconnaissance scanners. Generate a high-severity alert upon a match.",
              "2. (Statistical) For IPs that match the threat intelligence list, calculate the query frequency over a rolling 24-hour period. Escalate alerts for IPs that are both on the list and exhibit a query frequency above the $$ 95^{th} $$ percentile of all other external DNS clients to prioritize active threats.",
              "3. (Machine Learning) Deploy a supervised classification model (e.g., Random Forest) trained on labeled historical data (IP reputation, ASN, query type, FQDN patterns). Use the model to score incoming queries, and trigger an investigation for any query classified as 'reconnaissance' with a confidence score greater than $$ 0.90 $$."
            ]
          },
          {
            "description": "A single external source IP issues a sequence of DNS queries for sensitive service discovery (SRV) records (e.g., `_gc._tcp`, `_ldap._tcp`, `_kerberos._tcp`) within a short time frame (e.g., under 60 seconds). Alternatively, an external source issues multiple A/AAAA record queries for the same FQDN with a low TTL and receives different IP addresses in response, including an internal (RFC1918) address, indicating a potential DNS Rebinding attack.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DNS Servers, Network Egress/Ingress Points (Firewalls)",
            "action": [
              "1. (Symbolic) Create a detection rule that triggers when an external source IP (`id.orig_h`) in `Zeek dns.log` queries for more than three distinct sensitive SRV records (e.g., `_gc._tcp.*`, `_ldap._tcp.*`) within a 5-minute window.",
              "2. (Statistical) For each external source IP, calculate the ratio of SRV queries to its total queries over a 1-hour window. Establish a baseline for this ratio across all external clients and flag any IP whose SRV query ratio exceeds the $$ 99.9^{th} $$ percentile.",
              "3. (Machine Learning) Utilize a sequence analysis model (e.g., Hidden Markov Model) trained on query sequences from known reconnaissance tools (e.g., DNSenum) versus benign traffic. The model should identify and alert on query patterns (sequences of `qtype` and subdomain structures) that match known malicious enumeration behavior."
            ]
          },
          {
            "description": "A DNS query with a `qtype` of 'AXFR' or 'IXFR' is received by an organizational authoritative name server from an external IP address not explicitly authorized for zone transfers. Alternatively, a statistically anomalous volume of 'ANY' `qtype` queries is observed from a single external source IP.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DNS Servers",
            "action": [
              "1. (Symbolic) Implement a high-severity, zero-tolerance alert that fires immediately if a query in `Zeek dns.log` has a `qtype` of 'AXFR' or 'IXFR' and the source IP (`id.orig_h`) is not on a pre-approved allow-list of secondary DNS servers.",
              "2. (Statistical) For 'ANY' `qtype` queries from external sources, establish a baseline count per source IP over a 1-hour window. Flag any source IP whose 'ANY' query count exceeds $$ 3\\sigma $$ (3 standard deviations) above the mean of this baseline.",
              "3. (Machine Learning) Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on normal DNS traffic features (`qtype` distribution, query volume). Use the model to identify outliers, such as queries with rare `qtype` values like 'AXFR' or an anomalously high frequency of 'ANY' queries from a single source."
            ]
          },
          {
            "description": "A single external source IP generates a high volume of DNS queries for the organization's domain, where a large percentage (e.g., $$ > 80\\% $$) of the responses are 'NXDOMAIN'. The queried subdomains may also exhibit high character-level entropy, indicating algorithmically generated names.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DNS Servers, DNS Resolvers",
            "action": [
              "1. (Symbolic) Create a rule that counts, per external source IP (`id.orig_h`) over a 5-minute window, the total queries and queries with an 'NXDOMAIN' response (`rcode_name`). Trigger an alert if the ratio `(NXDOMAIN_count / total_count)` exceeds $$ 0.8 $$ and the `total_count` is over 50.",
              "2. (Statistical) For each source IP, calculate the Shannon entropy of the set of unique queried subdomains within a 10-minute window using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. Flag any IP with an entropy score above the $$ 98^{th} $$ percentile of all clients, especially when correlated with a high NXDOMAIN rate.",
              "3. (Machine Learning) Apply a clustering algorithm (e.g., DBSCAN) to DNS traffic, using features such as query count, NXDOMAIN ratio, query rate, and average subdomain entropy per source IP. Investigate IPs that the model classifies as noise or outliers, as they are not part of normal traffic clusters."
            ]
          },
          {
            "description": "A sudden, significant increase in the total volume of DNS queries for the organization's domains is observed, exceeding historical norms by several standard deviations. This surge originates from a large, diverse set of source IPs (geographically and by ASN) and is not attributable to a legitimate event like a marketing campaign or service rollout.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DNS Servers, Network Egress/Ingress Points (Firewalls)",
            "action": [
              "1. (Symbolic) Monitor the rate of incoming DNS queries per minute. If the rate increases by over 300% compared to its 1-hour moving average and persists for more than 5 minutes, trigger a low-severity alert for analyst review.",
              "2. (Statistical) Maintain a time series of DNS query volume per minute. For each 15-minute interval, calculate a rolling 30-day baseline mean and standard deviation. Generate a medium-severity alert when the current query volume exceeds the baseline mean by more than $$ 4\\sigma $$ (4 standard deviations).",
              "3. (Machine Learning) Implement a time series forecasting model (e.g., SARIMA) that learns daily and weekly seasonality of DNS traffic. Flag traffic as anomalous and generate an alert if the observed volume falls outside the model's $$ 99\\% $$ confidence interval for a sustained period (e.g., > 5 minutes)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]