[
  {
    "information_requirement": "Is the adversary conducting reconnaissance against our enterprise using open technical databases?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596",
        "name": "Search Open Technical Databases",
        "evidence": [
          {
            "description": "Widespread port scanning activity from an external IP address, identified by a high ratio of destination ports to connections, or originating from a known scanning service.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, external-facing firewalls, and cloud network flow logs.",
            "action": [
              "Ingest CTI feeds of known internet scanners (e.g., Shodan, Censys, GreyNoise) and malicious IPs into a reference set. Join this set with source IPs from Zeek conn.log over a 5-minute window. Alert on any match that targets a non-public or sensitive port (e.g., 22, 3389, 5985).",
              "For each external source IP, calculate the number of unique destination ports contacted within a 1-hour window. Establish a baseline distribution of this metric and alert on any IP exceeding the 98th percentile, as this indicates port scanning behavior.",
              "Implement a time-series anomaly detection model (e.g., ARIMA, Prophet) on the volume of connection attempts from the known scanner IP category. Generate an alert when the observed volume significantly deviates from the forecasted volume, suggesting a targeted campaign."
            ]
          },
          {
            "description": "Inbound HTTP/S requests containing User-Agent strings, request headers, or URI patterns characteristic of automated internet scanning or vulnerability assessment tools.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers, load balancers, and reverse proxies.",
            "action": [
              "Apply regular expression matching on the 'user_agent' and 'uri' fields in Zeek http.log to detect signatures of known tools (e.g., 'masscan', 'zgrab', 'nuclei', 'nessus', 'X-Censys-Scanner').",
              "For each source IP, calculate the Shannon entropy of its requested URIs over a 15-minute period. A low entropy score indicates repetitive, non-human browsing; alert on IPs falling below the 5th percentile of the established baseline entropy for external traffic.",
              "Train a classification model (e.g., Logistic Regression, Random Forest) on labeled datasets of benign and scanner-based HTTP requests. Use features like URI length and structure, User-Agent string, header count, and request frequency to score new requests in near real-time and identify scanner traffic that evades simple signature checks."
            ]
          },
          {
            "description": "A pattern of widespread, low-and-slow connection attempts from a single or distributed set of external IPs across the organization's public IP space, targeting a high number of unique hosts or non-standard ports.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls, internet gateways, and DMZ network segments.",
            "action": [
              "Create a rule to immediately alert on any external connection attempt to a predefined list of 'honey-ports'—ports that are firewalled and should never receive legitimate external traffic.",
              "Aggregate Zeek conn.log data over 24 hours. Identify external source IPs that connect to an unusually high number of unique destination hosts (e.g., >95th percentile) while maintaining a low connection count per host (e.g., <5th percentile), indicative of slow scanning.",
              "Apply a clustering algorithm (e.g., DBSCAN) to connection data features (source IP, destination port, inter-arrival time). This can group seemingly disparate low-and-slow connections into a single cluster representing a coordinated scan, even from multiple source IPs, that would be missed by simple thresholding."
            ]
          },
          {
            "description": "A spike in authentication failures or anomalous successful authentications for accounts whose usernames are derived from public data sources (e.g., WHOIS, certificate transparency logs, data breach corpuses).",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, ADFS servers, VPN concentrators, and other external authentication gateways (e.g., OWA).",
            "action": [
              "Proactively compile a watchlist of usernames/emails from public sources (WHOIS, certificate transparency logs). Create a rule for a high-severity alert on any successful authentication (Windows Event ID 4624) from an external source for an account on this list that has been dormant for >90 days.",
              "For each external-facing service, baseline the authentication failure rate (Windows Event ID 4625). Alert if the failure count for any single user exceeds 4 standard deviations from their personal baseline, or if the total failures for the service exceed the 99th percentile of the service's historical baseline, indicating password spraying.",
              "For each successful login (Windows Event ID 4624), use a pre-trained geolocation model on the source IP (from Zeek conn.log) and a time-series model on login times. Classify the login as anomalous if it deviates significantly from the user's established geographic and temporal baseline using a composite anomaly score."
            ]
          },
          {
            "description": "Anomalous external DNS query patterns indicative of subdomain enumeration, such as a high rate of NXDOMAIN responses from a single source or queries for historically rare subdomains.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External DNS servers, internal DNS resolvers forwarding external queries, and network egress points.",
            "action": [
              "Monitor Zeek dns.log for external queries of type 'AXFR' or 'ANY', which are commonly used for zone transfers, and generate a high-severity alert. Correlate with firewall logs to ensure the source is external.",
              "For each external source IP, calculate the ratio of NXDOMAIN responses to total queries within a 5-minute window. Alert on IPs exceeding the 99th percentile, indicating potential subdomain brute-forcing. Additionally, flag any sudden spike in queries for subdomains that are historically in the bottom 10th percentile of query volume.",
              "Use an Isolation Forest model on DNS query features (query length, number of sub-levels, query type, entropy of the query name). Correlate the source IP of any identified anomalous query with a subsequent connection attempt in Zeek conn.log to the resolved IP within 5 minutes to increase detection confidence and prioritize alerts."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]