[
  {
    "information_requirement": "Is the adversary performing reconnaissance by searching open websites and domains for information about our organization?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1593",
        "name": "Search Open Websites-Domains",
        "evidence": [
          {
            "description": "A connection from an external source IP or using a User-Agent string that matches a known malicious signature from a threat intelligence feed, targeting public-facing web assets such as the corporate website or login portals.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers, Reverse proxies, Cloud-hosted web applications",
            "action": [
              "Using a SIEM, create a rule to query Zeek http.log and conn.log for source IP addresses or User-Agent strings that match a high-confidence threat intelligence feed of known malicious scanners and reconnaissance tools (e.g., ZGrab, Nuclei, specific nmap scripts).",
              "For all inbound traffic to public web servers, establish a baseline of common User-Agent strings over a 30-day period. Calculate the frequency of each observed User-Agent. Flag User-Agents that are statistically rare (e.g., seen in less than 0.1% of requests) and originate from IPs not associated with legitimate services like search engine crawlers.",
              "Train a classification model (e.g., Random Forest, Gradient Boosting) on labeled datasets of benign and malicious web requests, using features such as User-Agent string length and entropy, source IP reputation, request header count, and presence of anomalous headers. Apply the model in real-time to classify incoming requests and alert on those predicted as malicious reconnaissance."
            ]
          },
          {
            "description": "A single external source IP address generates a high volume of HTTP requests (e.g., >500 requests in 5 minutes) to a public web server, where the ratio of client error status codes (4xx) to successful status codes (2xx) exceeds a defined threshold (e.g., > 75%).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers, API Gateways",
            "action": [
              "Create a rule to alert when a single source IP address generates more than 100 requests resulting in a 404 status code within a 1-minute window to any single public web server.",
              "For each source IP interacting with public web servers, calculate the 95th percentile of its request rate and the 95th percentile of its ratio of 4xx/5xx to 2xx status codes over a 10-minute sliding window. Alert on any IP exceeding these personalized statistical baselines by more than 3 standard deviations.",
              "Use a time-series anomaly detection model (e.g., Seasonal-ARIMA) on the aggregated volume of 404 errors per source IP. Train the model on at least 30 days of historical data to learn normal patterns. Alert when the observed error count significantly deviates from the model's forecasted range, indicating a potential content discovery or enumeration attack."
            ]
          },
          {
            "description": "An unauthorized external IP address requests a full DNS zone transfer (AXFR/IXFR), or a single external IP generates a high rate of DNS queries (e.g., >100 queries in 1 minute) for the organization's domain, resulting in a high ratio of non-existent domain (NXDOMAIN) responses (e.g., >80%).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative external DNS servers",
            "action": [
              "Monitor Zeek dns.log for any DNS query where the qtype is 'AXFR' or 'IXFR' that originates from an IP address not on an approved list of secondary DNS servers and generate a high-priority alert.",
              "For each source IP querying the external DNS server, calculate the Shannon entropy of the requested subdomains (qname field in Zeek dns.log) over a 5-minute window. A sustained entropy score above a pre-calculated network-wide baseline threshold indicates a likely subdomain enumeration attempt. Also, flag IPs where the ratio of NXDOMAIN responses exceeds 80% of their total queries within the same window.",
              "Develop a clustering model (e.g., DBSCAN) to group external source IPs based on DNS query features like query rate, NXDOMAIN ratio, qname entropy, and query type distribution. Periodically analyze clusters and flag those exhibiting characteristics of reconnaissance (high rate, high NXDOMAIN ratio, high entropy) as anomalous, as they will be separated from legitimate traffic clusters."
            ]
          },
          {
            "description": "A statistically significant increase in failed authentication attempts (Windows Event ID 4625, Logon Type 3) against external-facing services for a set of user accounts, where the increase occurs within a short time window (e.g., 30 days) following the appearance of those accounts' credentials in a monitored public data breach feed.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Threat Intelligence Breach Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Externally-facing authentication servers (e.g., ADFS, Exchange), Remote Desktop Gateway servers, Cloud Identity Providers (e.g., Azure AD)",
            "action": [
              "Continuously cross-reference the usernames from a breached credential intelligence feed against Windows Event ID 4625 logs for externally-facing services. Generate an alert for any failed login attempt (Logon Type 3) for a username that has appeared on a breach list within the last 90 days.",
              "For each user account, establish a baseline of failed login attempts per hour from external sources. After an account appears in a public breach, monitor for a statistically significant increase (e.g., hourly count exceeding 3 standard deviations above the mean) in failed logins for that specific account. Correlate with Zeek conn.log to verify the attempts are from new or unusual external IP addresses.",
              "Apply a change point detection algorithm (e.g., CUSUM, Bayesian Online Change Point Detection) to the time series of failed login events (Event ID 4625) for high-value user accounts or accounts known to be in recent breaches. An algorithm-detected change point, indicating a sudden and sustained shift in the rate of failed logins from external sources, should be flagged for investigation as a potential credential stuffing attack."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]