[
  {
    "information_requirement": "Has an adversary leveraged purchased technical data (credentials, infrastructure details) to conduct targeted reconnaissance or initial access against the enterprise? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1597.002",
        "name": "Purchase Technical Data",
        "evidence": [
          {
            "description": "A successful or failed authentication attempt matches a username or credential hash from an available data breach corpus or threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Threat Intelligence Feed (Breached Credentials)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Domain Controllers, ADFS), VPN Concentrators, Cloud Identity Providers (e.g., Azure AD)",
            "action": [
              "Symbolic (IOC Match): Ingest and continuously update a threat intelligence database of breached credentials. Create a SIEM rule to alert when a username from a failed (Windows Event ID 4625) or successful (Windows Event ID 4624) login event matches a username in the breached credential database.",
              "Statistical (Frequency Analysis): For any account flagged by the symbolic match, analyze login history over the last 90 days. Calculate the 95th percentile for daily failed login counts from distinct source IPs per user. Generate a high-severity alert if a matched account's failed login count exceeds this threshold, indicating a password spraying attempt.",
              "Machine Learning (Classification): Train a logistic regression model on historical login data, using features such as time of day, source IP geolocation, source ASN, and a binary feature indicating if the account is on a known breach list. Use the model to classify each new successful login as 'benign' or 'suspicious'. Escalate for investigation any successful login by a breached account that the model classifies as 'suspicious' with a confidence score greater than 0.8."
            ]
          },
          {
            "description": "An anomalous spike in network scanning or authentication failures from external sources targeting specific internal assets occurs within a 72-hour window following a threat intelligence report about the sale of the organization's technical data.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Threat Intelligence Report"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateways, Demilitarized Zone (DMZ) Servers, Threat Intelligence Platforms",
            "action": [
              "Symbolic (Correlation Rule): Upon ingesting a threat intelligence report detailing a data sale, create a time-bound SIEM correlation rule for a 7-day window. The rule must alert on any connection attempts (Zeek conn.log) or authentication failures (Windows Event ID 4625) originating from IOCs (IPs, domains) specified in the report.",
              "Statistical (Change Point Detection): Establish a 30-day rolling baseline of daily connection attempts to non-public services and a baseline of failed login counts. Apply a change point detection algorithm, such as CUSUM, to these time series. Generate an alert if a statistically significant upward change point is detected within 72 hours of ingesting a high-confidence threat intelligence report.",
              "Machine Learning (Time Series Forecasting): Develop a SARIMA forecasting model to predict the expected volume of scanning traffic and authentication failures based on historical data. Generate an alert if the actual observed volume exceeds the model's upper 99% confidence interval for a sustained period (e.g., more than 1 hour) immediately following a relevant intelligence trigger."
            ]
          },
          {
            "description": "An external source IP establishes connections to multiple distinct, non-public internal ports, where the Shannon entropy of destination ports for that source IP is anomalously low, indicating targeted probing instead of random scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Asset Inventory Database",
              "Windows Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Taps at Internet Egress/Ingress Points, Firewall Log Aggregators, Critical Servers",
            "action": [
              "Symbolic (List-Based): Maintain a dynamic list of public-facing services and ports based on the asset inventory database. Create a SIEM rule to alert on any successful external connection (Zeek conn.log conn_state = 'SF') to an internal IP address on a port not on this public services list.",
              "Statistical (Entropy): For each external source IP in Zeek conn.log, calculate the Shannon entropy of the destination ports it attempts to connect to within a 5-minute rolling window. Establish a baseline entropy distribution for typical internet background traffic. Alert when a source IP's entropy score drops below the 5th percentile of the baseline, suggesting it is targeting a small, specific set of ports.",
              "Machine Learning (Clustering): Apply a DBSCAN clustering algorithm to connection events using features from Zeek conn.log (source IP, destination IP, destination port, protocol). Isolate and investigate small, dense clusters that are flagged as noise or separate from the large 'background internet' cluster, as these represent groups of similar, anomalous connections indicative of a coordinated scan."
            ]
          },
          {
            "description": "A single user account has a successful login from a geographic location that is physically impossible to reach given the time and location of the previous successful login.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "IP Geolocation Database",
              "Cloud Provider Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (Domain Controllers), VPN Concentrators, Network Flow Collectors, Cloud Identity Providers (e.g., Azure AD)",
            "action": [
              "Symbolic (Rule-Based): For each successful login (Windows Event ID 4624 or cloud audit log), enrich the source IP with geolocation data. Generate a low-severity alert if the source country is on a pre-defined denylist of high-risk or non-business-related countries.",
              "Statistical (Impossible Travel Calculation): For each new successful login, retrieve the timestamp and geolocation of the previous successful login for the same user. Calculate the required travel speed (distance / time difference). Generate a high-severity 'impossible travel' alert if this speed exceeds a physically improbable threshold, such as 600 mph (965 kph).",
              "Machine Learning (User Behavior Anomaly Detection): Build a behavioral profile for each user that includes their typical source countries, ASNs, and login time-of-day windows. Employ an Isolation Forest model trained on this historical 'normal' profile. Flag any new login event that the model scores as a significant outlier for immediate investigation."
            ]
          },
          {
            "description": "Network traffic targeting a non-public web application contains URI patterns or payloads matching exploit signatures, originating from an external source IP with no prior interaction history.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek notice.log",
              "Windows Event ID 4688",
              "Vulnerability Scan Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Application Servers (DMZ and Internal), Intrusion Detection System (IDS) Sensors, Network Taps",
            "action": [
              "Symbolic (Signature Match): Correlate vulnerability scan data with the asset inventory to identify unpatched, non-public services. Create a specific SIEM rule that alerts on known exploit patterns (e.g., specific URIs in Zeek http.log, signatures in Zeek notice.log) targeting these specific services from external IP addresses.",
              "Statistical (URI Rarity): For each non-public web application, generate a frequency distribution of all requested URIs from the last 90 days of Zeek http.log data. Generate an alert for any request to a URI that falls in the bottom 1st percentile of rarity, as this may indicate enumeration of a hidden or forgotten endpoint.",
              "Machine Learning (Sequence Analysis): Model user sessions on web applications as sequences of URI requests. Train an LSTM autoencoder to learn normal user navigation patterns. Flag any session from an external IP that produces a high reconstruction error, as its navigation sequence is anomalous and deviates from typical user flows."
            ]
          },
          {
            "description": "A cloud environment session authenticated from a previously unseen IP address or Autonomous System Number (ASN) is followed by a statistically unusual volume of data egress or access to sensitive data repositories like S3 buckets or SharePoint sites.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek dns.log",
              "Cloud Provider Audit Logs (e.g., Azure AD Sign-in logs, AWS CloudTrail)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Log Aggregator (SIEM), Cloud Identity Provider, Network Flow Collectors monitoring traffic to cloud provider IP ranges",
            "action": [
              "Symbolic (Correlation Rule): Create a SIEM rule that correlates a successful cloud login from a new country or ASN (from Cloud Provider Audit Logs) with subsequent DNS requests (Zeek dns.log) for known data exfiltration or file-sharing domains originating from the same internal source IP within a 1-hour window.",
              "Statistical (Data Egress Anomaly): For each user, establish a baseline of daily data egress volume from key cloud data stores (e.g., S3, SharePoint Online). Calculate a 30-day moving average and standard deviation for this volume. Generate an alert if a user's daily egress volume exceeds 4 standard deviations above their moving average, particularly after an anomalous login.",
              "Machine Learning (Peer Group Analysis): Use K-Means clustering to group users into peer groups based on their roles and typical cloud application usage patterns derived from audit logs. If a user's activity (e.g., services accessed, data volume downloaded) deviates significantly from the calculated centroid of their assigned peer group, flag the session as anomalous for review."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]