[
  {
    "information_requirement": "Is the adversary performing reconnaissance by sending spearphishing links to gather information?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598.003",
        "name": "Spearphishing Link",
        "evidence": [
          {
            "description": "An endpoint's DNS query or network connection resolves or connects to a domain, URL, or IP address present on a threat intelligence feed for phishing, credential harvesting, or reconnaissance.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., Firewalls, Web Proxies), Internal DNS Resolvers, Mail Gateway",
            "action": [
              "Symbolic: Continuously correlate domains from DNS queries (Zeek dns.log), destination IPs from connections (Zeek conn.log), and host headers from HTTP requests (Zeek http.log) against a high-confidence, daily-updated threat intelligence feed of known phishing infrastructure. Alert on any match.",
              "Statistical: Profile the frequency of threat intelligence hits by user and department over a 30-day rolling window. Generate an alert for any user or group whose hit rate exceeds the 95th percentile for the organization, as this may indicate a targeted campaign.",
              "Machine Learning: Develop and apply a supervised classification model (e.g., Random Forest) trained on labeled log features (connection duration, bytes transferred, requested host, user agent) to score and classify all new outbound connections in near real-time, alerting on connections with a high probability of being malicious."
            ]
          },
          {
            "description": "A DNS query or HTTP request is made for a URL that exhibits phishing characteristics, such as typosquatting, obfuscation (e.g., 'google.com@1.2.3.4'), use of URL shorteners, or the presence of credential-related keywords like 'login' or 'verify'.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Web Proxies, User Workstations",
            "action": [
              "Symbolic: Apply regular expressions to Zeek dns.log queries and http.log URIs to detect patterns like URL obfuscation (e.g., /@\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}/), and keywords such as 'login', 'verify', 'account', or 'password' in combination with a non-corporate domain.",
              "Statistical: Calculate the Shannon entropy of subdomain labels and URL paths for all requested domains. Flag any domain or path with an entropy score exceeding the 99th percentile of the established 30-day baseline. Separately, calculate the Levenshtein distance between requested domains and a list of legitimate company and partner domains to identify potential typosquatting.",
              "Machine Learning: Use an unsupervised learning model, such as an Isolation Forest, trained on features extracted from legitimate URLs (e.g., length, character distribution, keyword counts, entropy, TLD type) to detect anomalous structures indicative of phishing. Alert on URLs identified as significant outliers."
            ]
          },
          {
            "description": "A statistically significant spike in outbound connections from multiple distinct endpoints to a single, newly observed, or low-reputation external domain, suggesting a coordinated spearphishing campaign click-through.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internal DNS Resolvers",
            "action": [
              "Symbolic: For any domain not seen in the last 30 days of logs, perform a passive WHOIS lookup. Flag any domain registered within the last 30 days that receives connections from more than 5 distinct internal hosts within a 1-hour window.",
              "Statistical: For each external destination domain, calculate the number of unique internal source IPs connecting to it over a rolling 5-minute window. Generate an alert when this count exceeds 3 standard deviations above the mean or surpasses the 99th percentile for all external domains observed in that window.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or Prophet) on the request volume per destination domain. Train the model on historical data and alert on significant positive deviations between observed and predicted request counts, which indicate a sudden traffic spike."
            ]
          },
          {
            "description": "An HTTP POST request, indicative of credential or form data submission, is sent from an endpoint to an external domain that is newly observed, uncategorized, has a low reputation, or is not on an established allow-list for such activity.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Proxies, Network Egress Points",
            "action": [
              "Symbolic: From Zeek http.log, filter for all events where the HTTP method is 'POST' and the destination is external. Correlate the destination host with threat intelligence and an organizational allow-list of sites approved for POST submissions. Alert on any POST to a known-bad or non-allow-listed domain.",
              "Statistical: Maintain a baseline of all external domains that receive HTTP POSTs from the enterprise and calculate their frequency. Flag any POST to a domain that falls below the 5th percentile of frequency (i.e., is very rare) or has never previously received a POST in the last 90 days.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features from POST requests (e.g., URI path structure, Content-Type header, destination domain reputation, data volume) to group similar submission behaviors. Investigate clusters that form around low-reputation or newly observed domains."
            ]
          },
          {
            "description": "Following an email being accessed, an endpoint makes an immediate, short-lived network connection with minimal data transfer to a suspicious domain, consistent with a tracking pixel or web bug used to validate email receipt.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations (specifically email client processes), Network Egress Points",
            "action": [
              "Symbolic: Create a rule that triggers when a DNS query (Zeek dns.log) for a domain is immediately followed (within 2 seconds) by a TCP connection (Zeek conn.log) from the same source IP, where the total bytes transferred ('orig_bytes' + 'resp_bytes') is less than 500 bytes and the connection duration is less than 1 second. Alert if the domain is also newly observed.",
              "Statistical: For all completed network connections (Zeek conn.log), calculate descriptive statistics for 'duration' and total bytes transferred. Identify connections in the lowest 1st percentile for both metrics and cross-reference their destination domains with a list of newly registered or high-entropy domains.",
              "Machine Learning: Train a logistic regression classifier to distinguish legitimate API 'ping' traffic from malicious 'pingbacks'. Use features such as connection duration, byte count, destination domain age, domain entropy, and user agent. Alert on connections classified as high-probability 'pingbacks'."
            ]
          },
          {
            "description": "A mobile device on the corporate network makes a direct connection to a suspicious or newly observed domain, potentially after a user scans a malicious QR code ('quishing') from an email on another device.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Network Segments, Internal DNS Resolvers, User Mobile Devices",
            "action": [
              "Symbolic: Filter Zeek http.log for user agents associated with mobile devices (e.g., 'iPhone', 'Android'). Correlate network connections from these devices (Zeek conn.log) against threat intelligence feeds specifically tracking QR code-based phishing campaigns. Alert on any match.",
              "Statistical: Establish a baseline of normal domain access patterns for mobile device user agents. Alert when a mobile device accesses a domain that is both newly registered (less than 30 days old) and has a high Levenshtein distance from a list of known-good corporate and popular domains, suggesting a typosquatted domain.",
              "Machine Learning: Develop an unsupervised anomaly detection model (e.g., Isolation Forest) for network sessions originating from mobile devices. Use features such as destination domain category, reputation, connection frequency, and data volume. Flag sessions that the model identifies as highly anomalous for further investigation."
            ]
          },
          {
            "description": "Anomalous process creation on an endpoint where a web browser spawns an unexpected child process or a process with suspicious command-line arguments, potentially related to a Browser-in-the-Browser (BitB) attack framework.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Endpoint Devices",
            "action": [
              "Symbolic: Create a detection rule for a browser process (e.g., chrome.exe, msedge.exe, firefox.exe) spawning an unexpected child process (e.g., another browser instance, powershell.exe, cscript.exe) using Windows Event ID 4688. Enhance the alert by correlating the event time with a recent network connection (Zeek conn.log) from that host to a low-reputation domain.",
              "Statistical: Using Windows Event ID 4688 data, establish a baseline of normal parent-child process relationships for all common web browsers in the environment. Alert when a browser on an endpoint spawns a child process that is a statistical outlier (e.g., a process relationship that occurs less than 0.1% of the time for that parent).",
              "Machine Learning: Train a decision tree classifier on process creation events (Windows Event ID 4688), using features like parent process name, child process name, command-line argument length, and presence of suspicious keywords (e.g., 'base64', 'invoke'). Use the model to classify process relationships as benign or suspicious, alerting on high-confidence suspicious events."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]