[
  {
    "information_requirement": "Is the adversary gathering information about our host hardware during reconnaissance?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1592.001",
        "name": "Hardware",
        "evidence": [
          {
            "description": "An external IP address, listed on a threat intelligence feed of known scanners or malicious actors, initiates connections to multiple internal hosts or across multiple ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, perimeter firewalls, public-facing web servers, DMZ subnets",
            "action": [
              "Symbolic: Create a SIEM rule to alert on any inbound connection from Zeek conn.log where the originating IP address ('id.orig_h') matches a pre-populated list of known malicious IPs, scanners, or TOR exit nodes from an ingested threat intelligence feed.",
              "Statistical: Using Zeek conn.log data, calculate the fan-out ratio (unique destination hosts) and port scan ratio (unique destination ports) per external source IP within a 10-minute window. Generate an alert for source IPs that exceed the 99th percentile for either metric, indicating potential horizontal or vertical scanning.",
              "Machine Learning: Train and apply a Random Forest classification model on labeled network traffic features (e.g., connection duration, bytes transferred, protocol, flags, service) from Zeek conn.log. Use the model to classify incoming connections as 'benign', 'scan', or 'malicious', and route 'scan' classifications to an analyst for review."
            ]
          },
          {
            "description": "The execution of a command or script used for hardware enumeration (e.g., 'systeminfo', 'Get-ComputerInfo') on a host, particularly when initiated by an anomalous user or parent process (e.g., a web server).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain controllers, database servers, developer workstations, executive endpoints, web servers",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for process creation events. Alert if the 'NewProcessName' or 'CommandLine' field contains hardware reconnaissance commands (e.g., 'systeminfo', 'dxdiag', 'msinfo32', 'Get-ComputerInfo', 'Get-WmiObject -Class Win32_ComputerSystem') and the parent process is anomalous, such as a web server process ('w3wp.exe') or a Microsoft Office application.",
              "Statistical: For each user and host, establish a baseline of normal execution frequency for hardware reconnaissance commands. Calculate a rarity score for each new execution based on historical data. Generate an alert if the rarity score for a command execution exceeds the 95th percentile across the environment.",
              "Machine Learning: Deploy a pre-trained Isolation Forest model to baseline normal parent-child process relationships and command-line arguments using Windows Event ID 4688 data. Feed all process creation events into the model and alert on any instance flagged as an anomaly, prioritizing those involving known reconnaissance commands."
            ]
          },
          {
            "description": "A single external source IP address initiates a high volume of connections with a 'REJ' (rejected) or 'RST' (reset) status across many distinct internal hosts or ports, consistent with a network sweep.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, internet-facing network sensors, network backbone taps",
            "action": [
              "Symbolic: Create a SIEM rule that triggers if a single external source IP ('id.orig_h') in Zeek conn.log generates more than 100 connections with a state of 'REJ', 'RSTO', or 'RSTR' within a 5-minute window, indicating a high-volume failed connection sweep.",
              "Statistical: For each external source IP in Zeek conn.log, calculate the Shannon entropy of destination ports ('id.resp_p') and the ratio of successful ('SF') to failed connections within 1-minute intervals. Alert on source IPs with an entropy score in the top 98th percentile or a successful connection ratio below the 5th percentile.",
              "Machine Learning: Apply a time series anomaly detection model (e.g., LSTM autoencoder) to the volume of inbound connection attempts from new, previously unseen external IPs. Use this model to detect low-and-slow scanning activity that deviates from the learned pattern of normal network background noise."
            ]
          },
          {
            "description": "SNMP or SMB queries originate from an external IP address or from an internal host not explicitly authorized for network administration or scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb_mapping.log",
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal server subnets, network management segments, legacy equipment zones",
            "action": [
              "Symbolic: Maintain an allowlist of authorized internal network administration hosts. Create a high-priority alert for any SNMP (UDP/161) or SMB (TCP/445) traffic observed in Zeek logs that either originates from an external source or from an internal host not on the authorized allowlist.",
              "Statistical: Over a 30-day period, baseline normal internal SMB/SNMP activity by counting source-destination communication pairs. Alert if a new, previously unseen communication pair appears, or if the daily connection count for an existing pair exceeds 3 standard deviations from its historical average.",
              "Machine Learning: Model the internal network as a graph where hosts are nodes and communications are edges. Apply a community detection algorithm (e.g., Louvain) to identify normal clusters of activity. Trigger an alert if a host initiates SMB or SNMP communication with a high number of nodes outside its typical community, indicating potential reconnaissance."
            ]
          },
          {
            "description": "A hardware enumeration command is executed on a host, and within 60 seconds, the same host initiates an outbound network connection to an external IP address that has a low reputation score.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical application servers, administrator workstations, endpoints handling sensitive data",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when a hardware reconnaissance process (e.g., 'systeminfo.exe' in Windows Event ID 4688) is followed within 60 seconds by an outbound network connection (from Windows Event ID 5156 or Zeek conn.log) from the same host to an external IP with a poor reputation score from a threat intelligence provider.",
              "Statistical: For each host, calculate the baseline probability of an outbound network connection occurring within 60 seconds of any process execution. If a hardware reconnaissance command is run followed by an outbound connection, calculate the conditional probability of this sequence. Flag the event if its p-value is less than 0.01 compared to the baseline, indicating a statistically significant correlation.",
              "Machine Learning: Train a sequence analysis model, such as a Hidden Markov Model (HMM), on sequences of process creation and network connection events. The model learns the transition probabilities between states (e.g., 'benign process' -> 'benign network activity'). Generate an alert if the model observes a low-probability sequence, such as 'reconnaissance process' -> 'outbound connection to new IP'."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]