[
  {
    "information_requirement": "Has the adversary modified system images to evade defenses? (TA0005 - Defense Evasion) (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1601",
        "name": "Modify System Image",
        "evidence": [
          {
            "description": "A file transfer via TFTP, FTP, SCP, or HTTP/S to a network device containing a system image file (e.g., .bin, .img, .swi) whose file hash or filename matches a known malicious indicator from threat intelligence.",
            "data_sources": [
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress/ingress points, management network segments, threat intelligence platform, file servers used for staging firmware updates.",
            "action": [
              "Extract file hashes (MD5, SHA1, SHA256) from Zeek files.log for all files transferred to network device management subnets. Correlate these hashes against a threat intelligence feed of known malicious firmware/image hashes. Generate a high-severity alert on any match.",
              "Calculate the Shannon entropy of filenames observed in Zeek files.log and http.log for transfers to network device management subnets. Establish a baseline of filename entropy for legitimate firmware updates. Flag filenames with entropy scores in the 95th percentile or that deviate significantly (e.g., z-score > 3) from the baseline of known vendor naming conventions.",
              "Develop a supervised classification model (e.g., Random Forest, Gradient Boosting) using features extracted from Zeek logs, including file MIME type, source/destination IP reputation, filename entropy, transfer protocol, and transfer size. Train the model on historical data labeled as legitimate maintenance or known malicious activity. Apply the trained model to classify all new file transfers to network devices and alert on transfers classified as malicious with a confidence score above a predefined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "An administrative host executes a file transfer client process (e.g., tftp.exe, scp.exe, curl.exe) with arguments indicating a firmware file, immediately followed by a network connection from that host to a network device's management port (e.g., TCP/22, TCP/23, UDP/69).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrative workstations, jump servers, domain controllers, Endpoint Detection and Response (EDR) logs.",
            "action": [
              "Monitor administrative hosts for process creation events (Windows Event ID 4688) where the new process name is a file transfer client (e.g., tftp.exe, scp.exe, curl.exe, wget.exe) and the command line includes a firmware file extension (.bin, .img, .swi). Correlate this event within a short time window (e.g., 2 minutes) with an outbound network connection from the same host to a known network device IP on a management port (22, 23, 69) observed in Zeek conn.log. Trigger an alert on a successful correlation.",
              "For each administrative user account, create a historical baseline of command-line process executions from Windows Event ID 4688. Calculate the frequency of execution for each process. Flag any execution of a file transfer client (tftp.exe, etc.) by a user where that client's usage frequency is a statistical outlier (e.g., a z-score > 3 compared to the user's own baseline, or a process that has never been executed by that user before).",
              "Construct user-specific session sequences by chaining process creation events (Windows Event ID 4688) and subsequent network connections (Zeek conn.log). Train a sequence analysis model (e.g., Hidden Markov Model or an LSTM-based autoencoder) on these sequences to learn normal administrative workflows. Apply the model to real-time activity and flag any sequence with a low probability score, indicating a deviation from established patterns, such as an unexpected 'download-then-upload' sequence of a firmware file."
            ]
          },
          {
            "description": "A file transfer to a network device's management interface where the total transferred bytes significantly exceeds the historical average for firmware updates, or the transfer occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, core network traffic sensors, change management system/schedule.",
            "action": [
              "Create a rule that triggers an alert for any file transfer (identified by filename extension like .bin, .img, .swi in Zeek logs) to a network device's management IP that occurs outside of an officially defined and machine-readable maintenance window schedule (e.g., Sunday 2 AM - 6 AM UTC).",
              "For each class of network device (e.g., Cisco Catalyst 9300, Palo Alto PA-440), establish a baseline of legitimate firmware update file sizes. Analyze file transfer sizes from Zeek files.log. Flag any transfer to a device where the file size exceeds the 99th percentile for that device class or is more than 1.5 times the interquartile range (IQR) above the third quartile (Q3).",
              "Aggregate the total bytes transferred to the network device management subnet into time-series buckets (e.g., 15-minute intervals). Apply a time-series anomaly detection model (e.g., Prophet, SARIMA) that accounts for weekly seasonality (maintenance windows). Flag any time bucket where the data volume is identified as an anomaly and correlates with a large file transfer event in Zeek files.log."
            ]
          },
          {
            "description": "A management session (SSH, HTTPS) to a network device originates from a source IP address not on the authorized administrative host allow-list and the session involves a data transfer volume characteristic of a firmware update.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, authentication servers, asset inventory database, IP address management (IPAM) system.",
            "action": [
              "Maintain a list of authorized administrative source IP addresses. Create a rule that alerts when a connection to a network device's management port (e.g., 22, 443) originates from an IP not on this list, and the total session bytes in Zeek conn.log exceeds a static threshold indicative of a firmware file (e.g., 10 MB).",
              "Profile the historical source IPs connecting to each network device's management interface from Zeek conn.log. Calculate the connection frequency for each source IP. Flag any session originating from a source IP that has never been seen before or is in the bottom 5th percentile of connection frequency, where the session byte count is in the top 5th percentile of all management sessions.",
              "Vectorize management sessions using features from Zeek conn.log and ssh.log (e.g., source IP subnet, protocol, bytes transferred, duration). Apply an unsupervised clustering algorithm (e.g., DBSCAN, Isolation Forest) to identify clusters of normal activity. Any session that is classified as noise/outlier by the model, particularly those involving large data transfers, should be flagged for immediate investigation."
            ]
          },
          {
            "description": "A network device, subsequent to a suspected image modification event, exhibits a significant deviation from its established network behavior baseline, such as initiating outbound connections to new external IPs, using non-standard protocols or ports, or generating anomalous DNS queries.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dns.log",
              "Zeek software.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors monitoring traffic to/from network devices, DNS servers, threat intelligence feeds, device configuration backups.",
            "action": [
              "Following a separate alert indicating a potential image modification on a network device, monitor all subsequent outbound traffic from that device's IP. If the device initiates a connection to an IP on a C2 blocklist or resolves a domain on a DGA watchlist (via Zeek dns.log), escalate to a high-priority incident.",
              "For each network device, create a multi-faceted network behavior baseline including: the set of unique destination IPs, destination ports, protocols used, and JA3/HASSH fingerprints. After a suspected modification event, compare the device's new activity against its baseline. Flag statistically significant deviations, such as the appearance of a new JA3 hash or a change in protocol distribution detected by a chi-squared test.",
              "For each network device, train a time-series model (e.g., LSTM autoencoder) on metrics like outbound connection frequency, data volume, and number of unique destination IPs. After a potential compromise event, feed the device's post-event network telemetry into the model. A sustained high reconstruction error, indicating the new behavior does not match the learned normal patterns, should be flagged as anomalous C2-like activity."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]