[
  {
    "information_requirement": "Is an adversary attempting to perform or facilitate financial theft against the organization?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1657",
        "name": "Financial Theft",
        "evidence": [
          {
            "description": "An internal host establishes a network connection to an external IP address, domain, or URL that is a known indicator of compromise for financial malware, ransomware C2, or cryptocurrency mining.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, including internet gateways, DNS resolvers, and web proxies.",
            "action": [
              "Query network connection logs (Zeek conn.log, dns.log, http.log) to match destination IPs, domains, and URLs against a threat intelligence feed of known malicious indicators related to financial theft. Generate a high-priority alert for any match.",
              "For all outbound TLS connections (Zeek ssl.log), calculate the JA3 hash. Establish a baseline of common JA3 hashes within the environment. Alert on connections using a JA3 hash that falls below the 1st percentile of frequency, especially when the destination IP has a low reputation or is newly observed.",
              "Train a supervised classification model (e.g., Random Forest) to predict malicious connections. Use labeled data from threat intelligence and past incidents, with features from Zeek logs such as connection duration, byte counts, protocol, connection state, DNS query length, and DNS query entropy. Deploy the model to score new connections and alert on those with a high probability of being malicious."
            ]
          },
          {
            "description": "A process is created on an endpoint with a process name, command-line argument, or file hash that matches a known signature for financial fraud tools, ransomware, or cryptomining software.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints and servers, particularly those used by Finance/Accounting personnel or hosting financial applications.",
            "action": [
              "Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) for process names (e.g., xmrig.exe), file hashes, or command-line arguments that match a watchlist of indicators for cryptominers or financial malware. Trigger an alert on any match.",
              "For each host, profile the entropy of command-line arguments for common processes like powershell.exe and cmd.exe. Establish a baseline distribution of entropy scores. Alert on any execution where the command-line entropy exceeds the 99th percentile, indicating probable obfuscation or complex scripting.",
              "Apply an unsupervised anomaly detection algorithm (e.g., Isolation Forest) to process creation events. Use features such as parent process name, user context, token elevation status, and command-line length from Windows Event ID 4688 or Sysmon Event ID 1. Flag any process identified as a significant outlier from the host's learned baseline behavior."
            ]
          },
          {
            "description": "An email is received containing multiple indicators of a Business Email Compromise (BEC) attempt, such as a mismatched 'From' and 'Reply-To' header, a lookalike domain, and body text containing keywords of urgency related to a financial transaction (e.g., 'urgent payment', 'wire transfer').",
            "data_sources": [
              "Zeek smtp.log",
              "Email gateway logs",
              "Microsoft 365 audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email gateways, mail servers, network sensors monitoring SMTP traffic, and cloud email tenants (e.g., Microsoft 365, Google Workspace).",
            "action": [
              "Analyze email headers (from Zeek smtp.log or gateway logs) to detect mismatches between 'From' and 'Reply-To'/'Return-Path' fields. Use regular expressions to scan sender domains for lookalike patterns (e.g., acme-corp.com vs. acmecorp.co) and search email subjects/bodies for keywords like 'urgent payment', 'wire transfer', or 'updated invoice'.",
              "Model the organizational communication graph by baselining sender-recipient pair frequency. Calculate a rarity score for each incoming email based on the historical frequency of that specific sender-recipient pair. Flag emails containing financial keywords where the communication pair's frequency is in the bottom 5th percentile, indicating an unusual communication pattern.",
              "Implement a Natural Language Processing (NLP) classification model (e.g., a fine-tuned BERT model) to analyze email body text. Train the model on a labeled dataset of legitimate and BEC emails to classify incoming messages based on features like sentiment, urgency cues, topic modeling (financial vs. non-financial), and linguistic patterns associated with social engineering."
            ]
          },
          {
            "description": "A successful user authentication with multiple high-risk characteristics (e.g., rare geolocation, anomalous time) is followed within a 30-minute window by network connections from the user's host to known financial services websites or APIs.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "VPN logs",
              "SSO provider logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory), VPN concentrators, SSO platforms, and network egress points.",
            "action": [
              "Create a stateful detection rule that triggers when a successful login event (Windows Event ID 4624) from an IP on a TOR exit node or known malicious IP watchlist is followed within 30 minutes by an outbound connection (Zeek conn.log) from the same source host to a destination IP/domain categorized as 'Financial Services'.",
              "For each user account, develop a risk score for each login event. Increment the score based on deviations from a multi-faceted baseline (e.g., rare source country=+3, non-business hours=+1, new device=+2). Correlate login events with a risk score in the 98th percentile with subsequent HTTP POST requests (Zeek http.log) to URIs containing keywords like 'transfer', 'payment', or 'beneficiary'.",
              "Model user session activity as a sequence of events (e.g., login type, applications accessed, network protocols used). Train a sequence-based anomaly detection model, such as an LSTM autoencoder, on normal user behavior. Flag any session sequence that has a high reconstruction error, particularly sequences that start with a high-risk login and proceed directly to financial web application access."
            ]
          },
          {
            "description": "A user account or system process accesses a sensitive financial file share, database, or application in a manner inconsistent with its established behavioral baseline, such as access by a non-standard process or at an unusual time of day.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Database audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Financial databases (e.g., ERP systems), payment processing servers, file servers containing sensitive accounting or payroll data, and cloud storage buckets containing financial data.",
            "action": [
              "Create an alert that triggers on any access event (Windows Event ID 4663 or database audit log) to a designated critical financial file share or database table from a user account or process not on an explicit allow list. Prioritize alerts where access rights requested include write or delete.",
              "For critical financial servers, baseline the number of unique users accessing them per hour and the time-of-day access patterns. Use a moving average and standard deviation to model this behavior. Alert when the number of accessing users in a one-hour window exceeds 3 standard deviations from the average, or when access occurs during a time window with a historically zero-access baseline (e.g., 2 AM - 4 AM).",
              "Use unsupervised clustering (e.g., k-means or DBSCAN) to perform peer group analysis. Group users based on their data access patterns (files, databases, applications accessed). Monitor for real-time activity and flag any instance where a user's access behavior deviates significantly from their assigned cluster's centroid, such as a marketing user suddenly accessing payroll database tables."
            ]
          },
          {
            "description": "An outbound network flow originating from a server hosting financial data exhibits a significant anomaly in data volume, file types, destination reputation, or protocol usage, suggesting data exfiltration for extortion.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "DLP solution logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical data repositories, database servers, file servers, and network egress points.",
            "action": [
              "Monitor file transfer logs (Zeek files.log) for outbound transfers of files with MIME types or extensions not typically transferred from sensitive servers (e.g., application/zip, .bak, .7z, .rar). Create a high-priority alert if the source is a production database server and the destination is an external IP address.",
              "For each critical server, establish a time-series baseline of its outbound data volume per hour (sum of orig_bytes in Zeek conn.log). Use the interquartile range (IQR) method to detect statistical outliers. Trigger an alert if the data volume in any 1-hour window exceeds the 75th percentile plus 1.5 times the IQR.",
              "Train a one-class SVM (Support Vector Machine) model on features of normal outbound connections from sensitive servers. Features should include destination IP ASN, destination port, data volume, protocol, and connection duration. Deploy the model to classify new connections, flagging any that fall outside the learned boundary of 'normal' as a potential exfiltration attempt."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]