[
  {
    "information_requirement": "Is the adversary attempting to impact network or data availability/integrity using email bombing? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1667",
        "name": "Email Bombing",
        "evidence": [
          {
            "description": "An inbound SMTP transaction involves a sender IP, sender domain, or email subject that is present on a threat intelligence feed cataloging email bombing indicators.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) servers, Email security gateway, Perimeter firewalls, Threat Intelligence Platform (TIP)",
            "action": [
              "Create a real-time correlation rule that joins inbound SMTP metadata (from Zeek smtp.log and conn.log) with a threat intelligence feed of known email bombing indicators. Trigger a medium-severity alert if the sender IP (`id.orig_h`), `HELO` domain, sender domain (`from`), or `subject` field matches an indicator.",
              "For all traffic matching the symbolic IOC rule, perform a statistical aggregation. Group by recipient (`rcpt_to`) and calculate the count of unique sender IPs (`id.orig_h`) and sender domains (`from`) over a 10-minute window. Escalate the alert to high-severity if a single recipient is associated with more than 10 unique malicious senders, indicating a targeted campaign rather than random spam.",
              "Deploy a pre-trained supervised classification model (e.g., Gradient Boosting) that scores each incoming email's likelihood of being malicious. Features should include sender domain age and reputation, IP ASN and geolocation, presence of URLs, and TF-IDF vectors of the subject line. If an email triggers the symbolic IOC rule AND its maliciousness score from the model is above a 0.8 threshold, automatically escalate the alert to critical and trigger a containment playbook."
            ]
          },
          {
            "description": "A single recipient email address receives messages from a high number of unique sender domains or IP addresses within a 5-minute window, where the email subjects exhibit high similarity (e.g., all are subscription confirmations).",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) servers, Email security gateway",
            "action": [
              "Create a sliding-window rule that triggers if a single recipient address (`rcpt_to`) receives emails from more than 20 unique sender IPs (`id.orig_h`) within a 5-minute window, AND where more than 80% of the subjects are identical.",
              "For each recipient, calculate two metrics over a 5-minute window: 1) The Shannon entropy of the sender domains (`from` field in smtp.log). 2) The average Jaccard similarity of the subject lines. Generate a high-severity alert when the sender domain entropy exceeds a high threshold (e.g., > 4.0) while the average subject similarity also exceeds a high threshold (e.g., > 0.9), a strong sign of a subscription bomb.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to 5-minute batches of email metadata. Use a feature space including the recipient address, a fuzzy hash (ssdeep) of the subject line, and the sender's top-level domain. A dense cluster indicates a group of emails with the same recipient and highly similar subjects but from varied senders. Flag any cluster containing more than 20 points as a potential email bombing event."
            ]
          },
          {
            "description": "An internal host is observed making HTTP POST requests to an anomalously high number of unique external domains, where the POST body contains an internal email address, indicating automated registration for services or newsletters.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, DNS resolvers, Egress points of the network, User workstations",
            "action": [
              "Create a rule that inspects HTTP POST requests in `Zeek http.log`. Alert if a single source IP (`id.orig_h`) is observed sending POST requests containing a corporate email address (`@yourcompany.com`) in the body to more than 15 unique destination hostnames (`host` field) within a 10-minute window.",
              "For each internal source IP, establish a 30-day rolling baseline of the number of unique domains to which it POSTs corporate email addresses per day. Alert if the daily count for a host exceeds its own 99th percentile or 3 standard deviations above its moving average, which detects anomalous sign-up behavior on a per-host basis.",
              "Develop a time-series anomaly detection model (e.g., Prophet) for the network-wide count of unique (source IP, destination domain) pairs per hour where the HTTP POST contains a corporate email. The model learns the normal rhythm of sign-ups. Generate an alert when the observed count significantly exceeds the model's predicted upper confidence bound, indicating a potential bot-driven registration campaign."
            ]
          },
          {
            "description": "The rate of inbound SMTP connections or total email volume for a specific recipient, or the mail server as a whole, exceeds a dynamic, statistically-derived threshold based on historical patterns for that specific entity and time of day/week.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) servers, Email security gateway, Network load balancers",
            "action": [
              "Implement a tiered threshold rule. Generate a low-severity alert if a single recipient (`rcpt_to`) receives > 50 emails/minute. Generate a medium-severity alert if > 100 emails/minute. Generate a high-severity alert if the total inbound SMTP connections (port 25/587/465) to an MTA exceed a hard limit of 1000 new connections/minute.",
              "For each individual recipient and for the server overall, calculate a 30-day rolling baseline of email volume per 5-minute interval, creating separate profiles for weekdays and weekends. Generate a high-severity alert if the current volume for an entity exceeds the 99th percentile of its historical baseline for that specific time window (e.g., a Tuesday at 2:00 PM vs. a Saturday at 3:00 AM).",
              "Train a time-series anomaly detection model, such as an LSTM Autoencoder, on historical SMTP connection and email volume data from `Zeek smtp.log` and `conn.log`. The model learns the complex, non-linear patterns of normal mail flow. It will flag any 5-minute interval where the reconstruction error of the observed traffic pattern is high, indicating a deviation from normalcy characteristic of a volumetric attack."
            ]
          },
          {
            "description": "Following the onset of a confirmed email bombing event targeting a specific user, the user's host machine initiates suspicious network activity or process executions, suggesting the bombing is a distraction for a separate attack.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Domain Controllers, Internal network segments, DNS resolvers, Egress firewalls",
            "action": [
              "Create a correlation rule that, upon a high-severity email bomb alert for a user, automatically queries all activity from that user's host(s) for the next 60 minutes. Generate a critical alert if the host executes a process matching a watchlist of remote access tools (e.g., `anydesk.exe`, `mstsc.exe` with suspicious parameters, via Event ID 4688) OR initiates a network connection (Event ID 5156, Zeek conn.log) to an IP on a threat intelligence blocklist.",
              "When an email bomb alert triggers for a user, immediately analyze their host's network traffic (`Zeek conn.log`, `dns.log`) against its own 30-day baseline. Calculate the rarity of destination domains, ports, and IP geolocations. Generate a high-severity alert if the host connects to a domain in the bottom 1% of popularity for the organization or communicates with an IP from an ASN it has never communicated with before.",
              "Upon an email bomb alert, apply a pre-trained behavioral anomaly detection model (e.g., an Isolation Forest) to the user's host activity. The model is trained on features like process command-line arguments, parent-child process relationships (Event ID 4688), and network connection tuples. An alert is generated if the user's activity during the email bomb is flagged as an outlier, indicating behavior that deviates significantly from their own established normal activity profile."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]