[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by modifying the cloud resource hierarchy? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1666",
        "name": "Modify Cloud Resource Hierarchy",
        "evidence": [
          {
            "description": "A process execution event (Windows Event ID 4688) with a command line signature or process hash matching a known offensive cloud security tool (e.g., Pacu, Cloudsploit), occurring on a host that also establishes a network connection (Zeek conn.log) to a known command-and-control IP address or a domain with high entropy within a 10-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint event logs from administrative workstations, developer workstations, and CI/CD servers; Network traffic logs from internet gateways and VPN concentrators.",
            "action": [
              "Symbolic Logic: Create a SIEM correlation rule that triggers when a Windows Event ID 4688 event contains a ProcessHash or CommandLine matching a threat intelligence list of offensive cloud tools, AND a Zeek conn.log event from the same source host IP shows a connection to an IP on a C2 watchlist within a 10-minute window.",
              "Statistical Method: For every host executing a cloud CLI process (e.g., aws.exe, az.exe), establish a baseline of destination domain entropy from Zeek dns.log queries. Generate an alert if a new DNS query from that host has an entropy score in the 98th percentile or higher, indicating a likely DGA, and co-occurs with the execution of the cloud tool.",
              "Machine Learning: Train a Random Forest classifier to predict malicious activity. Use features from Windows Event ID 4688 (e.g., parent_process_name, command_line_length, command_line_entropy) and correlated Zeek conn.log data (e.g., destination_port, connection_duration, is_known_c2_ip). An alert is triggered if the model's prediction score for 'Malicious Cloud Activity' exceeds a 0.9 confidence threshold."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) containing an exact command-line match for a sensitive cloud hierarchy modification command (e.g., `aws organizations leave-organization`, `aws organizations create-account`, `az account subscription transfer`, `gcloud organizations move`) executed by a user account not belonging to a predefined 'Cloud Administrators' group.",
            "data_sources": [
              "Windows Event ID 4688",
              "Active Directory Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrative workstations, CI/CD pipeline servers, Bastion hosts, and servers with cloud management SDKs installed.",
            "action": [
              "Symbolic Logic: Implement a high-severity SIEM rule that triggers an immediate alert if the CommandLine field in Windows Event ID 4688 exactly matches any command from a watchlist of sensitive hierarchy modification commands. Enrich the event with the user's Active Directory group memberships and escalate if the user is not in the 'Cloud Administrators' group.",
              "Statistical Method: For each user in the 'Cloud Administrators' group, establish a baseline for the frequency and timing of their execution of sensitive hierarchy modification commands. Generate an alert if an authorized user executes one of these commands at a time that is more than 3 standard deviations from their typical usage hours, or if the daily frequency exceeds the 99th percentile of their historical activity.",
              "Machine Learning: Use a sequence analysis model (e.g., LSTM) trained on benign administrative command sequences. An alert is triggered if a sensitive hierarchy modification command is observed as part of a command sequence that has a low probability under the trained model, suggesting an anomalous workflow (e.g., it was preceded by unusual discovery commands and not by typical planning commands)."
            ]
          },
          {
            "description": "Execution of a cloud administrative tool process (e.g., `aws.exe`, `az.exe`, `gcloud.cmd`) from a source IP address that geolocates to a country from which the user has never authenticated, or from an IP address with a low reputation score.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate endpoints and servers with cloud SDKs/CLIs installed, VPN access logs, Domain Controllers, and network egress points.",
            "action": [
              "Symbolic Logic: Create a SIEM rule that triggers when Windows Event ID 4688 shows the execution of a cloud CLI tool. Enrich the event with the source IP from the most recent successful logon for that user (Windows Event ID 4624, Type 3 or 10). If the enriched IP geolocates to a country not on an approved list for that user's role, generate a high-severity alert.",
              "Statistical Method: For each user, build a historical profile of source IP subnets/ASNs and login times (e.g., hour of day) from Windows Event ID 4624. Generate an alert if a cloud CLI tool is executed (Windows Event ID 4688) following a login from an IP whose ASN has never been seen for that user, or if the login time falls into the bottom 5th percentile of their activity distribution (e.g., 3 AM for a 9-5 worker).",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., SARIMA) on the volume of outbound traffic to cloud management API endpoints (e.g., management.azure.com, *.amazonaws.com) as seen in Zeek conn.log, aggregated by hour. An alert is triggered when the observed traffic volume significantly exceeds the model's predicted upper confidence interval, suggesting anomalous bulk operations."
            ]
          },
          {
            "description": "A sequence of events on a single host within a 30-minute window, beginning with a process accessing local cloud credential files (e.g., `type %USERPROFILE%\\.aws\\credentials`), followed by a scripting engine process (e.g., `powershell.exe`, `python.exe`) making a network connection to a cloud management API endpoint.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer workstations, Administrator workstations, servers hosting automation scripts, and CI/CD runners.",
            "action": [
              "Symbolic Logic: Create a stateful correlation rule that triggers if a Windows Event ID 4688 event with a command line accessing known cloud credential paths (e.g., `.aws/credentials`, `.azure/accessTokens.json`) is followed within 30 minutes on the same host by another 4688 event for a scripting engine, which is then correlated with a Zeek conn.log entry showing a connection from that host to a known cloud provider API endpoint.",
              "Statistical Method: Calculate the Shannon entropy of the CommandLine field in Windows Event ID 4688 for all scripting engine processes that make network connections to cloud APIs. Generate an alert if the entropy score for a given command is in the 95th percentile or higher, as this may indicate obfuscated or dynamically generated malicious commands.",
              "Machine Learning: Train a Hidden Markov Model (HMM) on sequences of benign administrative activity, where states represent actions like 'Read Config', 'Run Script', 'Connect to API'. If an observed sequence of events (derived from EID 4688 and Zeek conn.log) has a very low probability of being generated by the trained 'benign' model, trigger an alert for a potentially malicious workflow."
            ]
          },
          {
            "description": "The execution of a cloud hierarchy modification command (e.g., `aws organizations leave-organization`), co-occurring within a 5-minute window of commands intended to disable security services (e.g., `sc.exe config WinDefend start=disabled`), stop logging services, or clear event logs (`wevtutil.exe cl Security`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1102",
              "Windows Event ID 7040"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint event logs on administrative workstations and servers, Domain Controller security logs, and centralized logging infrastructure.",
            "action": [
              "Symbolic Logic: Create a high-priority correlation rule that alerts if a process creation (EID 4688) for a sensitive cloud command occurs on the same host within 5 minutes of a log clearing event (EID 1102), a security service being stopped (EID 7040 with a relevant service name), or another process creation (EID 4688) for a known defense evasion tool (e.g., `wevtutil.exe`, `sc.exe`).",
              "Statistical Method: Profile the baseline frequency of defense evasion commands (e.g., `wevtutil cl`, `net stop`) per host. Generate a high-risk score for a host if such a command is executed, as this is statistically rare on most systems. If a cloud hierarchy modification command is then executed from that high-risk host within the next hour, escalate the event to a critical alert.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to predict a 'Host Defense Evasion State' based on features like the recent count of `wevtutil` executions, log clearing events, and security service stop events. If a host is classified as being in this state, automatically escalate the priority of any subsequent cloud administrative commands originating from it for the next 60 minutes."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]