[
  {
    "information_requirement": "Has an adversary performed an Endpoint Denial of Service attack against a mobile device? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1642",
        "name": "Endpoint Denial of Service",
        "evidence": [
          {
            "description": "Network traffic from a mobile device's IP address matches an indicator in a threat intelligence feed, where the indicator is tagged as Command and Control (C2) infrastructure for malware with known Endpoint DoS capabilities (e.g., KeyRaider).",
            "data_sources": [
              "Zeek intel.log",
              "Zeek conn.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and Guest Wi-Fi network gateways, VPN concentrators, DNS resolvers, Mobile Device Management (MDM) platform.",
            "action": "1. (Symbolic) Implement a SIEM rule that generates a high-severity alert when Zeek intel.log shows a `notice.type` of `Intel::MATCH` where `seen.where` is `Conn::IN_ORIG` or `DNS::IN_QUERY`, the source IP is from a mobile device network segment, and `meta.source` contains a tag like 'mobile_malware' or 'T1642'. 2. (Statistical) For all mobile devices, compute a 30-day baseline of unique destination Autonomous System Numbers (ASNs). If a device communicates with an ASN not seen in its baseline and that ASN has a low reputation score, calculate the hourly connection frequency. An hourly connection frequency exceeding the 99th percentile for that device's peer group (e.g., other iOS 17 devices) flags the device for investigation. 3. (Machine Learning) Deploy a pre-trained Logistic Regression model to score each connection from Zeek conn.log. Features should include: connection duration, protocol, service, orig_bytes, resp_bytes, and enrichments like destination IP reputation, ASN, and geographic rarity. A score above 0.9 triggers an automated workflow to query the MDM API for the device's compliance status and user details."
          },
          {
            "description": "A mobile device exhibits a sequence of high-entropy DNS queries (indicative of a Domain Generation Algorithm), or queries for newly registered domains (age < 72 hours), immediately followed by a complete and sustained loss of network traffic from that device's IP address for a period exceeding its typical idle time.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, network traffic monitoring points at internet gateways.",
            "action": "1. (Symbolic) Create a detection rule that triggers if a DNS query from a mobile device IP in Zeek dns.log is for a domain whose registered date (from WHOIS enrichment) is less than 3 days old, AND this is followed by a connection attempt in Zeek conn.log to the resolved IP. 2. (Statistical) For each query in Zeek dns.log, calculate the Shannon entropy of the queried domain (qname). Establish a moving average of entropy for all mobile devices. Flag any device that generates more than 5 queries in a minute with entropy scores greater than 3.5 or 3 standard deviations above the population mean. Correlate this flag with a subsequent absence of traffic in Zeek conn.log from that source IP for over 1 hour. 3. (Machine Learning) Utilize a time-series anomaly detection model (e.g., Seasonal-ARIMA) on per-minute connection counts and total byte volume for each mobile device IP. A forecasted drop to zero that is validated by Zeek conn.log data, when the model predicts activity, generates a 'Device Offline Anomaly' alert. Enhance the alert's priority if it is preceded within 30 minutes by high-entropy DNS queries or other IOC matches for that IP."
          },
          {
            "description": "A corporate-managed mobile device, identified via its IP address, connects to a domain or IP address known to host mobile device rooting (Android) or jailbreaking (iOS) tools, or exhibits unusual HTTP User-Agents indicative of device tampering.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek intel.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, web proxies, Mobile Device Management (MDM) platform.",
            "action": "1. (Symbolic) Ingest and maintain a threat intelligence feed of domains/IPs associated with rooting/jailbreaking tools into the Zeek Intel Framework. A match in Zeek intel.log from a device in the corporate mobile IP range generates a critical alert. 2. (Statistical) From Zeek http.log, extract and analyze the `user_agent` strings for all mobile devices. Calculate the frequency of each unique user agent. Flag any device reporting a user agent string that appears in less than 0.5% of the total mobile device population, as this indicates non-standard or potentially malicious software. 3. (Machine Learning) Apply an unsupervised clustering algorithm like DBSCAN to device-level network profiles. Engineer features from Zeek logs over a 24-hour period, including: count of unique destination ports, protocol ratio (TCP vs UDP), average connection duration, and data transfer volume. Devices identified as noise or in small, sparse clusters are anomalous. Cross-reference these anomalous devices with MDM compliance reports to confirm or deny a jailbroken/rooted state."
          },
          {
            "description": "A managed mobile device reports the elevation of an application to Device Administrator (Android) or the installation of a new, unverified MDM profile (iOS), particularly if the application or profile is not on an approved list or is installed outside of standard enterprise workflows.",
            "data_sources": [
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform, Enterprise Mobility Management (EMM) server logs.",
            "action": "1. (Symbolic) Configure the MDM to generate a critical alert for any 'Device Administrator privilege granted' event on Android, or 'Profile Installed' event on iOS, where the application name or profile signer is not on a pre-approved enterprise allowlist. 2. (Statistical) Establish a baseline for the daily rate of new application installations and profile changes across the mobile fleet. An alert is triggered if the rate for a single device or a specific group of devices exceeds the 99th percentile of the historical daily rate, suggesting a coordinated or automated campaign. 3. (Machine Learning) Use a classification model, such as a Decision Tree, to score the risk of a newly installed application. Features should include the application's requested permissions, its prevalence across the organization, and whether it's from an official app store. An app that requests Device Administrator privileges, is not widely installed, and is not from the Google Play Store would receive the highest risk score."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]