[
  {
    "information_requirement": "Has an adversary staged or searched for local system data in preparation for exfiltration?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1005",
        "name": "Data from Local System",
        "evidence": [
          {
            "description": "A process creation event is observed where the process's file hash or name matches a known signature for data staging or collection utilities (e.g., secretsdump.py, SharpHound.exe, Rubeus.exe, 7z.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (Domain Controllers, Database Servers), Executive workstations, Developer endpoints, Privileged Access Workstations (PAWs)",
            "action": [
              "Symbolic: Continuously monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1). Compare the file hash (SHA256, MD5) and process image name against a regularly updated threat intelligence feed of known malicious file indicators associated with data collection. Generate a high-severity alert upon any match.",
              "Statistical: For each process execution, calculate the prevalence of its file hash across all endpoints over a 30-day rolling window. Flag any process whose hash has been observed on fewer than 5 systems or less than 0.1% of the total endpoint population for analyst review, as this indicates rare or non-standard software.",
              "Machine Learning: Train a binary classification model (e.g., Random Forest, Gradient Boosting) using features extracted from process creation events, including ParentProcessName, User context, command-line length, command-line entropy, and the statistical hash prevalence. Use the model to score each new process, flagging executions with a high probability of being malicious collection activity."
            ]
          },
          {
            "description": "A command-line interpreter (cmd.exe, powershell.exe) or scripting host is executed with arguments containing patterns for recursive file discovery (`dir /s`, `Get-ChildItem -Recurse`), content searching (`findstr`, `Select-String`), or data archiving (`tar`, `zip`, `Compress-Archive`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Logging Event ID 4104",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, File servers, SharePoint servers, Code repositories, Application servers",
            "action": [
              "Symbolic: Implement a detection rule that uses regular expressions to scan command-line arguments (Event ID 4688/Sysmon EID 1) and PowerShell script block content (Event ID 4104). The regex should search for combinations of search utilities (`dir /s`, `findstr`, `grep`, `Get-ChildItem -Recurse`), sensitive keywords ('password', 'secret', 'config', 'backup'), sensitive file extensions (`*.kdbx`, `*.pem`, `*.sql`), and archiving commands (`tar`, `zip`, `Compress-Archive`).",
              "Statistical: For each command-line execution, calculate the Shannon entropy of the command-line arguments. Establish a baseline entropy score for common processes (e.g., cmd.exe, powershell.exe) per user role. Alert when a new execution's entropy exceeds the 99th percentile of the historical distribution, as high entropy can indicate obfuscated commands or encoded data passed as arguments.",
              "Machine Learning: Employ a time-series anomaly detection model (e.g., Seasonal-ARIMA) to monitor the frequency of file search and archiving commands per user and per host. The model should learn normal daily and weekly patterns, accounting for seasonality (e.g., end-of-month reporting scripts). Trigger an alert if the observed frequency significantly deviates from the forecasted range, indicating a potential burst of collection activity."
            ]
          },
          {
            "description": "A single process generates file access events for a number of unique files or unique directories that exceeds a statistically established baseline for that process name within a 5-minute window, indicating mass file enumeration or copying.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers containing sensitive PII/PHI/Financial data, Critical system directories (e.g., C:\\Windows\\System32), User profile directories, Cloud storage synchronization folders (e.g., OneDrive, Dropbox) on endpoints",
            "action": [
              "Symbolic: Create a rule that triggers when a single Process ID (from Event ID 4663) generates read access events for more than 500 unique files across more than 20 unique directories within a 5-minute window. Maintain an exclusion list for known backup processes and indexing services (e.g., wbengine.exe, SearchIndexer.exe) and tune thresholds based on system role.",
              "Statistical: For each process name, establish a baseline distribution of 'unique files accessed per minute'. Generate an alert if a given process instance's count exceeds the 99.5th percentile of the historical distribution for that specific process name across the environment. This is more robust against outliers than standard deviation.",
              "Machine Learning: Implement a clustering algorithm (e.g., DBSCAN) on file access events. Use features such as ProcessName, UserName, FileExtension, DirectoryDepth, and HourOfDay. The algorithm will group normal, high-volume activity (like backups) into dense clusters. Any file access pattern that does not belong to an established cluster and is marked as a 'noise' point should be flagged as an anomalous outlier for investigation."
            ]
          },
          {
            "description": "A process accesses files in a directory path inconsistent with its established behavioral profile, such as a web server worker process (w3wp.exe) reading from `C:\\Windows\\NTDS\\` or `iisstart.exe` spawning `cmd.exe` to access user profile directories.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web servers (IIS, Apache), Application servers, Domain Controllers, Endpoints with local administrator privileges",
            "action": [
              "Symbolic: Define and monitor for specific anomalous parent-child process relationships indicative of collection, such as `winword.exe -> powershell.exe`, `w3wp.exe -> cmd.exe`, or `services.exe -> whoami.exe`. Also create high-fidelity rules that flag any non-SYSTEM account attempting to read `NTDS.dit` or the SAM/SYSTEM/SECURITY registry hives.",
              "Statistical: Create a baseline of file path access patterns for critical processes and user roles. For each file access event, calculate the rarity of the `(ProcessName, DirectoryPrefix, UserName)` tuple. For example, the tuple `(w3wp.exe, C:\\Users\\, DefaultAppPool)` would be extremely rare. Alert on any tuple that falls below a 0.01% prevalence threshold in the last 90 days.",
              "Machine Learning: Develop a User and Entity Behavior Analytics (UEBA) model to create a 'file access fingerprint' for each user and host. The model should profile which applications each user runs, the directory paths and file types they typically access, and their hours of activity. An alert should trigger when a user's activity significantly deviates from their established profile, such as a user suddenly accessing file shares belonging to a different department."
            ]
          },
          {
            "description": "A command is executed on a network device to display, copy, or transfer the device's running or startup configuration file, particularly when the command is executed by a non-standard administrative account or targets a remote TFTP/SCP/FTP server.",
            "data_sources": [
              "Zeek syslog.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, Edge routers, Firewalls, VPN concentrators, Wireless LAN Controllers",
            "action": [
              "Symbolic: In syslog data forwarded from network devices, create a regex-based rule to detect commands such as `show running-config`, `copy running-config tftp:`, `scp export configuration`, or `show tech-support`. Generate a high-severity alert for any command that copies the configuration to a remote location (TFTP, SCP, FTP), especially if the destination is an external or unknown IP.",
              "Statistical: Correlate the source IP from the syslog message with Zeek conn.log data. Calculate the rarity of the source IP, ASN, and geographic location for administrative sessions. Alert on sessions originating from IP addresses outside of whitelisted management subnets or from historically unseen ASNs. Also, baseline command frequency per admin account and alert on spikes in configuration-viewing commands.",
              "Machine Learning: Model command sequences within a single administrative session (defined by source IP and a time window). Use a sequence analysis model (e.g., Markov Chain) to learn common command chains for legitimate troubleshooting. Flag sessions containing a configuration export command without preceding diagnostic commands (`show interface`, `debug`, etc.), as this may indicate 'smash and grab' behavior. Correlate with Zeek conn.log to score the risk of the destination IP."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]