[
  {
    "information_requirement": "Is an adversary leveraging the Directory Replication Service (DRS) Remote Protocol via DCSync to exfiltrate credentials from a Domain Controller?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003.006",
        "name": "DCSync",
        "evidence": [
          {
            "description": "A directory services replication event (Windows Event ID 4662) is logged on a Domain Controller where the 'Properties' field indicates access to 'DS-Replication-Get-Changes' (GUID `1131f6aa-9c07-11d1-f79f-00c04fc2dcd2`) or 'DS-Replication-Get-Changes-All' (GUID `1131f6ad-9c07-11d1-f79f-00c04fc2dcd2`), and the 'Subject/Security ID' or the source IP address (from correlated network logs) does not belong to a known, authorized Domain Controller account or IP address.",
            "data_sources": [
              "Windows Security Event ID 4662",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Domain Controllers within the enterprise.",
            "action": [
              "Create and maintain an explicit allow-list of authorized Domain Controller IP addresses and machine account SIDs. Implement a detection rule to generate a high-severity alert for any Windows Event ID 4662 where the 'Properties' field contains GUID `1131f6aa-9c07-11d1-f79f-00c04fc2dcd2` or `1131f6ad-9c07-11d1-f79f-00c04fc2dcd2`, and the 'Subject/Security ID' or the correlated source IP (from Zeek `conn.log`) is not present in the established allow-list.",
              "Profile all accounts that generate Windows Event ID 4662 events with replication GUIDs. Establish a baseline set of authorized replication accounts (which should only be Domain Controller machine accounts). Alert on any account generating these events that is not part of the baseline set, as this represents a zero-expected-frequency anomaly for non-DC accounts.",
              "Deploy an anomaly detection model (e.g., Isolation Forest, One-Class SVM) to profile normal directory replication activity. Ingest features such as source account SID, source IP, destination DC, time of day, and day of week from Windows Event ID 4662 and Zeek `conn.log`. Train the model to identify outlier replication requests that deviate from established patterns, which could indicate a compromised administrative account or a legitimate (but compromised) DC being used for the attack."
            ]
          },
          {
            "description": "Network traffic from a non-Domain Controller source IP to a Domain Controller destination IP over the DRSUAPI RPC interface (UUID `E3514235-4B06-11D1-AB04-00C04FC2DCD2`), characterized by an abnormally large data transfer volume in the response.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dcerpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensor monitoring traffic on internal network segments containing Domain Controllers, and at key network choke points.",
            "action": [
              "Create a detection rule to flag all RPC connections logged in `Zeek dcerpc.log` with the `drsapi` operation or the DRSUAPI interface UUID `E3514235-4B06-11D1-AB04-00C04FC2DCD2`, where the connection in the corresponding `conn.log` originates from an IP address not on the authorized Domain Controller allow-list.",
              "For all connections between known DC-to-DC pairs, establish a baseline of normal replication traffic volume by calculating the mean and standard deviation of `resp_bytes` in `Zeek conn.log`. Monitor connections from non-DC IPs to DCs using the DRSUAPI interface and alert if the `resp_bytes` value exceeds the 99th percentile or 3+ standard deviations of the established DC-to-DC baseline, indicating a probable full directory synchronization.",
              "Implement a time-series forecasting model (e.g., Prophet, ARIMA) for network traffic volume (`resp_bytes`) between specific non-DC systems (e.g., administrative workstations) and DCs. Generate an alert when the observed traffic volume on the DRSUAPI port significantly exceeds the forecasted volume and its confidence interval, detecting data transfers that are anomalous for that specific source-destination relationship."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) on any system, particularly a non-Domain Controller, where the process command line contains strings indicative of DCSync tools, such as `lsadump::dcsync`, `secretsdump.py -just-dc`, or `-just-dc-ntlm`.",
            "data_sources": [
              "Windows Security Event ID 4688 (with Command Line Auditing enabled)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All workstations and member servers within the Active Directory environment, with heightened monitoring on systems used by administrators or those with network access to Domain Controllers.",
            "action": [
              "Deploy a SIEM rule that searches process creation logs (Windows Event ID 4688) for command lines matching a comprehensive regular expression for DCSync tools, such as `/(lsadump.*::.*dcsync|secretsdump\\.py.*(-just-dc|-just-dc-user|-just-dc-ntlm))/i`. Alert on any match, especially on non-DC endpoints.",
              "Calculate the Shannon entropy of command-line arguments for processes that commonly initiate network connections, such as `powershell.exe`, `python.exe`, or `rundll32.exe`. Establish a baseline entropy score for command lines across the environment and alert on processes whose command-line entropy exceeds the 98th percentile, as this can indicate obfuscated or encoded payloads used to stage DCSync attacks.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) using features extracted from command lines (e.g., length, character frequency, n-grams, argument count, presence of IP addresses). Use a labeled dataset of known benign and malicious (including DCSync) commands to classify new process creation events in near real-time as malicious or benign."
            ]
          },
          {
            "description": "A Zeek notice with a type of `DCSync::Replication_From_Non_DC` or `Mimikatz::DCSync_Transaction` is generated, indicating that a network transaction matching a DCSync signature was observed. This is contingent on the appropriate Zeek policy scripts being loaded and active.",
            "data_sources": [
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring traffic to and from Domain Controllers.",
            "action": [
              "Configure a high-severity, immediate-response alert for any log entry in `Zeek notice.log` where `note == 'DCSync::Replication_From_Non_DC'`. This is a high-fidelity indicator that requires immediate investigation. Ensure the relevant Zeek policy scripts are enabled on all appropriate sensors.",
              "Apply burst detection algorithms to the time series of `DCSync::Replication_From_Non_DC` notice events. While a single event is highly significant, a sudden burst or increase in frequency (e.g., multiple events in a short window from different sources) could indicate a widespread, automated attack campaign, elevating the incident priority.",
              "Develop an alert triage model using supervised learning (e.g., Logistic Regression) to score the severity of DCSync-related notices. Incorporate features such as the source IP's internal vs. external status, its historical reputation (e.g., has it been seen in other alerts?), the target DC's criticality, and the time of day. This model helps analysts prioritize which high-fidelity alerts to investigate first."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]