[
  {
    "information_requirement": "Is the adversary using steganography (T1001.002) for command and control (TA0011)? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1001.002",
        "name": "Steganography",
        "evidence": [
          {
            "description": "A file hash observed on the network matches a known hash of a steganography tool executable, or a network connection is established with an external IP address or domain known to be associated with steganography-based C2.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateways, DNS Resolvers, Proxy Servers, Endpoints",
            "action": [
              "Symbolic (IOC Match): Continuously compare file hashes from Zeek files.log (sha1, md5) and process hashes from Windows Event ID 4688 against a threat intelligence feed of known steganography tool hashes. Also, compare destination IPs from Zeek conn.log and DNS queries from Zeek dns.log against known malicious C2 infrastructure lists. Generate a high-severity alert for any match.",
              "Statistical (Frequency Analysis): For all external connections in Zeek conn.log, calculate the frequency of connections to destination IP addresses and domains over a 30-day baseline. Flag destinations that are rare for the organization (e.g., in the bottom 5th percentile of connection frequency) but are present on CTI watchlists for suspicious activity. A combination of organizational rarity and a low-confidence IOC match increases the risk score.",
              "Machine Learning (Domain Classification): Utilize a pre-trained machine learning model (e.g., a random forest or gradient boosting classifier) to classify domains requested in Zeek dns.log. Use features like domain length, character entropy, n-grams, TLD, and domain age to predict the likelihood of a domain being algorithmically generated (DGA) or otherwise malicious. A high maliciousness score for a domain that is also observed receiving file uploads (correlated via Zeek conn.log and files.log) warrants investigation for steganography."
            ]
          },
          {
            "description": "Specific byte sequences, metadata keywords (e.g., 'Steg'), or anomalous header values characteristic of steganography tool watermarks are present within transferred files such as images, audio, video, or documents.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring (NSM) Sensor Grid, Internet Gateways, File Servers",
            "action": [
              "Symbolic (Signature Match): Deploy a set of YARA or regex rules to scan the content and metadata of files extracted via Zeek's file extraction framework. The rules should match known signatures, magic numbers, or text strings (e.g., 'stegdetect', 'OpenStego', 'L-S-B') inserted by common steganography tools into file headers, footers, or metadata fields. Alert on any rule match.",
              "Statistical (Metadata Anomaly): For common file types (e.g., JPEG, PNG, PDF) extracted from Zeek files.log, parse and establish a baseline of normal metadata field values and lengths. Flag any file where a metadata field's length is a statistical outlier (e.g., exceeds the 99th percentile for that field and file type), as custom metadata fields are often abused to hide data. For example, an unusually large 'comment' field in a JPEG.",
              "Machine Learning (File Structure Classification): Train a classifier (e.g., a Support Vector Machine) to distinguish between benign files and files containing steganographic content. Use features extracted from the file structure, such as the size and entropy of different file segments (e.g., EXIF chunks in JPEGs, iTXt chunks in PNGs), and the presence/absence of optional chunks. A high probability score from the classifier indicates a likely steganographic payload."
            ]
          },
          {
            "description": "A transferred file (e.g., PNG, JPG, WAV) has a size that is a statistical outlier compared to a dynamically established baseline of file sizes for its specific MIME type and source or destination context.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateways, Web Application Servers, Content Delivery Networks (CDNs)",
            "action": [
              "Symbolic (Rule-Based Threshold): For highly standardized image types used by internal applications (e.g., UI icons, standard-size logos), establish static file size thresholds. For example, 'alert if favicon.ico > 100KB'. Alert if a file of this type exceeds a hard-coded threshold, as any deviation is unexpected.",
              "Statistical (Z-Score/IQR): For each MIME type identified in Zeek files.log, maintain a rolling 30-day baseline of file sizes (mean, standard deviation). For each new file transferred, calculate its Z-score relative to its MIME type baseline. Flag any file with a Z-score greater than 3. Alternatively, use the Interquartile Range (IQR) method and flag any file with a size greater than Q3 + 1.5 * IQR.",
              "Machine Learning (Time Series Forecasting): Model the aggregate volume (in bytes) of specific file types (e.g., 'image/png') transferred per hour as a time series. Use a forecasting model like SARIMA or Prophet to predict the expected data volume for the next interval, including a confidence band. A significant, unexplained spike in data volume that deviates from the model's prediction and its confidence interval could indicate large-scale exfiltration or C2 activity using steganography."
            ]
          },
          {
            "description": "A process that does not normally initiate network connections (e.g., mspaint.exe, notepad.exe) is observed creating a network socket and establishing an external connection, particularly when the connection involves the upload or download of image or media files.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Virtual Desktop Infrastructure (VDI) Environments",
            "action": [
              "Symbolic (Process Whitelist): Maintain a curated whitelist of process image paths (e.g., 'C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe') authorized to make network connections. Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 5156 or Sysmon Event ID 3 (Network Connection) using the Process ID. Generate an alert when the process image path from the creation event is not on the whitelist and is associated with an outbound network connection.",
              "Statistical (Process Rarity): Create a baseline of all processes that make network connections across the enterprise, and calculate the frequency of each process name. Identify the rarest processes (e.g., those in the bottom 1st percentile of connection frequency). Any network activity from these rare processes, such as 'mspaint.exe' or 'calculator.exe', should be flagged for immediate review, especially if the corresponding connection in Zeek conn.log involves a file transfer (inferred from `orig_bytes` and `resp_bytes`).",
              "Machine Learning (Behavioral Clustering): Use an unsupervised learning algorithm (e.g., K-Means or DBSCAN) to cluster endpoints based on vectors of their process execution and network connection patterns (e.g., counts of processes, destination ports, data volumes). An endpoint that suddenly moves from a 'normal' cluster to a new, sparsely populated cluster characterized by anomalous process-to-network behavior (e.g., a cluster where text editors make network connections) is a strong candidate for compromise."
            ]
          },
          {
            "description": "The calculated Shannon entropy of the least-significant bit (LSB) plane of a transferred image file approaches the theoretical maximum (e.g., > 7.9 for 8-bit color channels), a pattern inconsistent with natural images where LSBs have some correlation.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring (NSM) Sensor Grid, Data Loss Prevention (DLP) Systems",
            "action": [
              "Symbolic (Embedded File Header): For files extracted via Zeek, programmatically extract the LSB data from image files. Scan this extracted bitstream for known magic numbers or headers of common file types (e.g., 'PK' for ZIP, '%PDF' for PDF, 'MZ' for executables). The presence of a complete file header embedded in the LSB plane is a definitive sign of steganography.",
              "Statistical (Chi-Square Test): For image files extracted from Zeek files.log, perform a chi-square goodness-of-fit test on the byte-value distribution of the LSB plane. Compare the observed distribution to an expected uniform distribution, which is characteristic of random or encrypted data. A resulting p-value greater than the significance level (e.g., p > 0.05) suggests the data is random-like. If the LSB plane passes this test for randomness while higher-order bit planes do not, it is a strong statistical indicator of an embedded encrypted payload.",
              "Machine Learning (Steganalysis CNN): Feed images extracted from Zeek files.log into a pre-trained convolutional neural network (CNN) specifically designed for steganalysis. Such models are trained to identify subtle statistical artifacts and spatial correlations in the pixel domain that are introduced by steganographic embedding algorithms. A high-confidence 'steganographic' classification from the model should trigger a high-priority alert for analyst review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]