[
  {
    "information_requirement": "Is the adversary performing host or network discovery activities to check for Internet connectivity?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1016.001",
        "name": "Internet Connection Discovery",
        "evidence": [
          {
            "description": "An outbound network connection event (captured in Zeek conn.log) or DNS query event (captured in Zeek dns.log) where the destination IP address or queried domain matches an entry on a subscribed threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Web Proxies), DNS Resolvers, Endpoint Devices",
            "action": [
              "Create a SIEM rule to generate a high-severity alert whenever a DNS query (Zeek dns.log) or an outbound connection (Zeek conn.log) is logged with a destination IP or domain that matches an entry in the threat intelligence blocklist.",
              "For any connection matching a threat feed, calculate the historical prevalence of the destination IP/domain across the enterprise over the last 30 days. If the destination is rarer than the 99th percentile of all external destinations, escalate the alert priority.",
              "Feed connection metadata (source/destination IP, port, protocol, JA3/S hash, process context from Windows Event ID 4688, threat intel match) into a pre-trained Random Forest or Gradient Boosting classifier to score the connection's likelihood of being malicious. A score above a 0.9 confidence threshold should trigger an automated response, such as host isolation."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a common network utility (e.g., ping.exe, tracert.exe, curl.exe, nslookup.exe) or a PowerShell script block log (Windows Event ID 4104) for a connectivity testing cmdlet (e.g., Test-NetConnection) that targets a public IP address, where the parent process is not a typical interactive user shell (e.g., explorer.exe, cmd.exe) or an authorized administrative tool.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (Workstations, Laptops), Servers (especially those with restricted internet access like Domain Controllers)",
            "action": [
              "Create a detection rule for Windows Event ID 4688 where the NewProcessName is one of ('ping.exe', 'tracert.exe', 'curl.exe', 'nslookup.exe') and the CommandLine targets a public IP. Correlate with PowerShell logs (Event ID 4104) for 'Test-NetConnection' or 'Resolve-DnsName'. Alert if the ParentProcessName is not in an allow list of ('explorer.exe', 'cmd.exe', 'powershell.exe' run interactively).",
              "For each host, establish a 30-day rolling baseline of the execution frequency of these network utilities. Generate an alert if the count in a one-hour window exceeds the 95th percentile of the host's historical activity, or if the process is executed by a user account that has never run it before.",
              "Implement a time-series anomaly detection model (e.g., ARIMA or Seasonal-Trend decomposition) to monitor the execution frequency of these utilities per host. A statistically significant spike that deviates from the forecast, especially if temporally correlated with other suspicious host events like service creation or scheduled task modification, should be flagged as a high-confidence anomaly."
            ]
          },
          {
            "description": "A single host initiates outbound connections using three or more distinct network protocols (e.g., ICMP, DNS, HTTP, raw TCP) to multiple external destinations within a 5-minute window, where the initiating process (from Windows Event ID 4688) is not a web browser or known software update agent.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Endpoint devices, DNS Resolvers",
            "action": [
              "Create a correlation rule that triggers if a single source IP address generates events in Zeek conn.log across three or more distinct protocols (e.g., 'icmp', 'udp', 'tcp') to external destinations within a 2-minute window. Enrich with process data from the endpoint to exclude known browsers and updaters.",
              "For each host, calculate a 'protocol diversity' score over a 5-minute rolling window by counting the unique protocols in outbound connections (Zeek conn.log). Generate an alert if this score exceeds the 99th percentile of the host's historical protocol diversity scores.",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN) on 5-minute windows of connection events, using features like source host, protocol, and destination port. Identify and alert on temporally dense clusters from a single host that contain a high diversity of protocols, indicating a potential automated discovery sequence."
            ]
          },
          {
            "description": "An outbound network connection event (Zeek conn.log) originates from a host belonging to a strictly controlled asset group (e.g., Domain Controllers, PCI-DSS segment) or is initiated by a process running under a service account context (identified via Windows Event ID 4624 Logon Type 5), where the destination is not on a pre-approved allow list.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Server Subnets (e.g., Domain Controllers, Database Servers), Network Egress Points, Authentication Logs",
            "action": [
              "Maintain an asset list of 'Restricted Internet Access' hosts and a list of service account names. Create a high-severity alert that triggers on any outbound connection event in Zeek conn.log where the source IP is on the restricted list or the associated user account is a service account, and the destination is not on an explicit allow-list.",
              "For each critical server role, profile the set of processes that normally initiate outbound connections. If a network connection is initiated by a process that falls outside the 95th percentile of common processes for that role (e.g., a database server spawning powershell.exe to connect to the internet), generate an alert.",
              "Train a one-class SVM model on the normal network behavior of critical servers, using features like destination IP/port, protocol, bytes transferred, and initiating process name. Any new connection that the model classifies as an anomaly should be immediately alerted for investigation."
            ]
          },
          {
            "description": "A host exhibits a pattern of low-volume DNS queries (Zeek dns.log) for a large number of unique second-level domains over a 24-hour period, resulting in a high Shannon entropy score for the set of resolved domains, excluding known CDN and cloud provider domains.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers",
            "action": [
              "Create a hunting query that flags hosts resolving more than 50 unique, non-categorized, and previously unseen second-level domains in a 24-hour period, especially if the connection volume per domain (from Zeek conn.log) is minimal (<1KB).",
              "On a daily basis, calculate the Shannon entropy of the set of unique second-level domains queried by each host (from Zeek dns.log). Flag the top 1% of hosts with the highest entropy scores for manual review, after filtering out traffic to known high-diversity services like CDNs and public cloud providers.",
              "Use a time-series forecasting model (e.g., Prophet) to predict the daily count of unique destination IPs contacted per host. An observation where the actual count significantly exceeds the model's prediction interval (e.g., yhat_upper) indicates an anomalous increase in destination diversity and should be flagged for a hunt-centric review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]