[
  {
    "information_requirement": "Is the adversary collecting data from removable media?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1025",
        "name": "Data from Removable Media",
        "evidence": [
          {
            "description": "A process is launched from a removable media drive path (e.g., D:\\, E:\\) and its executable name or file hash matches a known threat intelligence indicator for data theft malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (desktops, laptops) with USB ports, physical servers with USB access, and virtual machine hosts with USB passthrough enabled.",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for events where the process path starts with a removable drive letter (e.g., D: through Z:) AND the process name or hash is present in a threat intelligence feed of known data collection tools.",
              "Statistical: For all processes launched from a removable drive path, calculate the enterprise-wide prevalence (count of unique hosts) for each process hash. Generate an alert for hashes seen on a statistically insignificant number of hosts (e.g., < 0.1% of endpoints or < 5 total machines). Additionally, calculate the entropy of the process filename and alert on high-entropy names that suggest randomization.",
              "Machine Learning: Train a classification model (e.g., Random Forest, Gradient Boosting) on labeled process creation events originating from removable media. Use features such as parent process name, command-line argument length and entropy, process path depth, and whether the process is signed. Apply the trained model to new events to classify them as benign or malicious in real-time."
            ]
          },
          {
            "description": "Execution of a native command-line utility (e.g., xcopy, robocopy) or PowerShell cmdlet (e.g., Copy-Item) is observed with arguments specifying a source path on a removable drive and a destination on the local file system or a network share.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (desktops, laptops) with USB ports, and command-line/scripting log collection infrastructure.",
            "action": [
              "Symbolic: Create a detection rule that searches command-line logs (Windows Event ID 4688, Sysmon Event ID 1) and PowerShell script block logs (Event ID 4104) for the co-occurrence of file copy commands and a source path on a removable drive. Example Logic: `(ProcessName IN ('xcopy.exe', 'robocopy.exe', 'powershell.exe')) AND (CommandLine MATCHES REGEX '([D-Z]:\\\\.*)' AND (CommandLine CONTAINS 'Copy-Item' OR CommandLine CONTAINS 'xcopy' OR CommandLine CONTAINS 'robocopy'))`.",
              "Statistical: For each user, establish a baseline of file copy operations originating from removable media, measuring the daily volume of data transferred and the frequency of such commands. Generate an alert when a user's activity exceeds a high percentile (e.g., 95th) of their own historical baseline or the baseline of their peer group (e.g., other users in the same department).",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) on features extracted from command-line arguments. Features should include the number of wildcards, use of recursive flags, quantity and types of file extensions targeted, and the ratio of source-to-destination path depth. The model learns normal administrative and user behavior and flags command-line executions that deviate significantly."
            ]
          },
          {
            "description": "A single process generates a high volume of file read access events (e.g., >100 events in <1 minute) from a removable media drive, where the accessed files have extensions associated with sensitive data (e.g., .docx, .xlsx, .pdf, .kdbx).",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints and file servers where sensitive data is stored and where object access auditing (SACL) for removable media file reads is enabled.",
            "action": [
              "Symbolic: Assuming object access auditing is enabled for removable drives, create a rule that triggers when a single process ID generates more than a set threshold (e.g., 100) of file read events (Event ID 4663 with Accesses: `ReadData` or `ReadAttributes`) from a removable drive path within a short window (e.g., 60 seconds).",
              "Statistical: Aggregate file access events (Event ID 4663) by user, process, and source drive. For each user session involving a removable drive, calculate the rate of file access events per minute and the Shannon entropy of accessed file extensions. Alert when the access rate exceeds the 99th percentile of historical activity for that user or when the file extension entropy is anomalously high, suggesting indiscriminate data gathering.",
              "Machine Learning: Use a sequence analysis model (e.g., an LSTM-based autoencoder) to analyze the sequence of file paths accessed by a user from a removable drive during a session. Train the model on benign access patterns (e.g., opening a single presentation, accessing a few documents). The model should flag sequences indicative of automated collection, such as rapid, recursive directory traversal or accessing an unusual combination of file types."
            ]
          },
          {
            "description": "A temporal correlation is observed on a single host where data collection from removable media is followed within a 30-minute window by either the creation of a compressed archive file or an outbound network connection to a rare or suspicious destination.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS servers, and endpoints with direct internet access. Correlation must occur across data from these NAIs.",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers an alert if a host that generated a 'Data from Removable Media' signal also exhibits one of the following within 30 minutes: 1) Process creation for an archiving utility (e.g., `7z.exe`, `rar.exe`, `tar.exe`) with 'add' or 'compress' arguments, or 2) An outbound network connection (Zeek conn.log) to an IP address with a low reputation score or to a destination country not typically associated with business operations.",
              "Statistical: For each host, monitor the volume of outbound network traffic (Zeek conn.log `orig_bytes`) in the 15 minutes following any confirmed file copy operation from a removable drive. Establish a baseline for this post-copy traffic volume for each host. Alert if the outbound traffic exceeds a statistically significant threshold (e.g., 3 standard deviations above the mean) for that specific host's baseline.",
              "Machine Learning: Develop a graph-based model where nodes represent hosts, processes, and network destinations. An edge is created when a removable media access event is detected. Analyze the sub-graph that forms around this event in the subsequent 30 minutes. Use a graph neural network (GNN) to classify this sub-graph as malicious or benign based on features like the presence of archiving processes, rarity of the destination IP, and total data egress volume."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]