[
  {
    "information_requirement": "Has the adversary exfiltrated sensitive data using automated methods? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1020",
        "name": "Automated Exfiltration",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to an external IP address or domain that is present on a threat intelligence feed and categorized for C2 or data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points, Internal DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) with a threat intelligence feed of known malicious domains/IPs. Generate an alert for any match where the indicator's category is 'Command and Control', 'Exfiltration', or 'Malware'.",
              "Statistical: For all outbound connections to destinations with a low reputation score or category (e.g., 'Dynamic DNS', 'Newly Registered Domain'), calculate the total outbound bytes ('orig_bytes'). Generate an alert if the bytes transferred in a single connection exceeds the 95th percentile for all historical connections to that specific category.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled network connection data. Use features such as destination IP reputation, destination port, protocol, connection duration, total bytes sent, total bytes received, and connection state. Use the trained model to classify each new outbound connection as 'benign' or 'potential exfiltration' and alert on high-confidence 'potential exfiltration' classifications."
            ]
          },
          {
            "description": "A series of DNS queries from a single internal host where subdomain labels are abnormally long (e.g., > 64 characters) and exhibit high character entropy, or HTTP POST requests containing headers or body content with high-entropy, Base64-encoded strings.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Web Proxies, Application Servers",
            "action": [
              "Symbolic: Scan Zeek http.log POST requests for User-Agent or Cookie headers that match regular expression patterns of known exfiltration tools (e.g., Iodine, DNSCat2, Cobalt Strike). Also, scan DNS queries in Zeek dns.log for signatures of known DNS tunneling tools. Alert on any match.",
              "Statistical: For each DNS query in Zeek dns.log, calculate the Shannon entropy of the query name (subdomain portion). Establish a baseline entropy for normal traffic (e.g., mean of 3.2). Alert on any query where the entropy exceeds a high threshold (e.g., 4.5). Additionally, for HTTP POST requests, calculate the entropy of the request body; alert if the entropy exceeds the 99th percentile of all POST request bodies for that destination.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features extracted from DNS queries, including query length, query entropy, character frequency distribution, and query type (A, AAAA, TXT, CNAME). Investigate any emergent clusters that are distinct from the main 'benign traffic' cluster as potential DNS tunneling activity."
            ]
          },
          {
            "description": "The execution of a known archiving utility (e.g., 7z.exe, tar.exe, rar.exe, zip.exe) with command-line arguments targeting sensitive user or system directories, followed within a short time window (e.g., < 15 minutes) by a large outbound network transfer (> 50MB) from the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, File Servers, Domain Controllers, Application Servers",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Windows Event ID 4688) shows a known archiver process (7z.exe, rar.exe, zip.exe, tar.exe) with a command line targeting sensitive directories (e.g., 'C:\\Users\\', 'C:\\inetpub\\', network shares), AND this event is followed within 15 minutes by a Zeek conn.log entry from the same source IP with 'orig_bytes' > 50,000,000 to an external destination.",
              "Statistical: For each host, establish a 30-day rolling baseline of daily outbound data volume (sum of 'orig_bytes' from Zeek conn.log). After observing an archive process execution (Windows Event ID 4688), monitor that host's outbound traffic. Alert if the outbound traffic volume in the subsequent hour exceeds 3 standard deviations above the host's daily average baseline.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., an LSTM autoencoder) for each host's outbound network traffic profile (bytes per minute). Feed process creation events for known archivers as an exogenous variable into the model. An alert is generated if the model's reconstruction error for network traffic significantly spikes immediately following the archival event, indicating a deviation from normal patterns."
            ]
          },
          {
            "description": "A single, unusual process instance (e.g., not a known backup or indexing service) accesses an anomalously high number of files (>1000) or a high variety of distinct file extensions (>10) within a short time frame (< 5 minutes), indicative of data staging.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive Data Repositories, User Workstations, Source Code Repositories, File Servers",
            "action": [
              "Symbolic: Alert when a scripting host process (powershell.exe, cscript.exe, wscript.exe) is created (Windows Event ID 4688) and is subsequently observed accessing (Windows Event ID 4663) more than 100 files with sensitive extensions (e.g., '.docx', '.pdf', '.xlsx', '.sql') within a 1-minute window.",
              "Statistical: For each process name on each host, create a baseline of file access counts per minute and the entropy of file extensions accessed per minute. Alert if a given process instance's file access count (from Windows Event ID 4663) exceeds the 99th percentile of its historical baseline. Raise severity if the entropy of the file extensions accessed by that same process instance also exceeds its 99th percentile.",
              "Machine Learning: Use an unsupervised anomaly detection model (e.g., Isolation Forest) to profile normal process behavior. Features should include parent process name, command-line arguments, file access count per minute, and the set of accessed directory paths. The model will identify outliers that represent anomalous process behavior, which should be investigated for data staging activity."
            ]
          },
          {
            "description": "File access events (Windows Event ID 4663) targeting similar file paths or types occur across multiple hosts (>5) in a narrow time window (<10 minutes), followed by a correlated spike in outbound traffic from those hosts to a single, shared external destination IP address.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire Workstation Subnet, Server Farm, Internet Egress Points, Domain Controllers",
            "action": [
              "Symbolic: Define a rule that looks for a specific exfiltration script name or hash (e.g., 'data_grabber.ps1') being executed (Windows Event ID 4688) on more than 5 hosts within a 10-minute window. If this condition is met, automatically query Zeek conn.log for any common external destination IP that all of these hosts communicated with shortly after execution.",
              "Statistical: Group hosts by organizational unit or subnet. For each group, monitor the number of hosts concurrently accessing sensitive network shares (identified by Windows Event ID 4663 on file servers). Alert if the number of concurrently active hosts exceeds 3 standard deviations from the hourly baseline for that group. Correlate this alert with a concurrent spike in traffic from the same group of hosts to a single, non-categorized external IP.",
              "Machine Learning: Use graph analysis to model relationships between internal hosts and external destinations. Create nodes for internal IPs and external IPs, and create edges for connections with properties like timestamp and bytes transferred. A high-risk anomaly, indicative of coordinated exfiltration, is a sudden convergence where multiple internal host nodes (that are not typically related) all create new edges to a single external destination node within a short time window."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]