[
  {
    "information_requirement": "Is the adversary moving laterally within the network using Distributed Component Object Model (DCOM)?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.003",
        "name": "Distributed Component Object Model",
        "evidence": [
          {
            "description": "Correlated network and host events showing DCOM/RPC traffic (TCP port 135) from a source IP address or user account on a watchlist, resulting in a successful remote logon (Logon Type 3) on the destination host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, Domain Controllers, Member Servers, Core network switches providing traffic telemetry",
            "action": [
              "Construct a SIEM correlation rule that triggers when: (1) A Zeek conn.log event shows a successful TCP connection to destination port 135. (2) The `id.orig_h` (source IP) from the conn.log is present in a 'suspicious_ips' watchlist. (3) Within 1 minute, a Windows Event ID 4624 with Logon Type 3 occurs on the destination host, where the Source Network Address matches `id.orig_h` and the Account Name is on a 'suspicious_users' watchlist.",
              "For each host, profile the hourly count of outbound DCOM connections (destination port 135). Generate an alert if the connection count in a given hour exceeds 3 standard deviations above the host's 30-day rolling average for that specific hour of the day, indicating an abnormal burst of activity.",
              "Develop a supervised classification model (e.g., Random Forest) to score the maliciousness of DCOM connections. Engineer features including: source/destination IP, historical communication frequency between the pair, time of day, bytes transferred (from Zeek conn.log), and whether the source user/host is on a watchlist. Train the model on labeled data and deploy it to score all new DCOM connections in near real-time."
            ]
          },
          {
            "description": "A process creation event where a parent process commonly associated with DCOM instantiation (e.g., mmc.exe, excel.exe, outlook.exe) spawns a child process used for command-line interaction or scripting (e.g., cmd.exe, powershell.exe, wscript.exe).",
            "data_sources": [
              "Windows Event ID 4688 (with command line logging enabled)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstations, Application Servers, Domain Controllers, High-value user endpoints",
            "action": [
              "Create a detection rule that triggers on a Windows Event ID 4688 event where the ParentProcessName is one of ['mmc.exe', 'excel.exe', 'winword.exe', 'outlook.exe', 'mshta.exe'] and the ProcessName is one of ['cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'rundll32.exe'].",
              "For all process creation events, build a baseline of parent-child process pairs. Calculate the conditional probability P(Child | Parent) for all observed pairs across the enterprise over a 90-day period. Generate an alert when a DCOM-related parent (e.g., excel.exe) spawns a child (e.g., powershell.exe) and the observed probability P(powershell.exe | excel.exe) is in the bottom 1st percentile of all observed conditional probabilities, indicating an extremely rare event.",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest) on process creation events. Engineer features such as: parent process name, child process name, user context, command-line length, and command-line argument entropy. The model will identify unusual combinations of these features that deviate from the established norm, such as 'outlook.exe' spawning 'powershell.exe' with a high-entropy command line under a standard user's context."
            ]
          },
          {
            "description": "The DCOM Surrogate process, dllhost.exe, spawns a child process that is either not on an established application allowlist or is spawned by a non-SYSTEM user account.",
            "data_sources": [
              "Windows Event ID 4688 (with command line logging enabled)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application Servers, Workstations with custom COM objects, Member Servers",
            "action": [
              "Deploy a detection rule for Windows Event ID 4688 where ParentProcessName is 'dllhost.exe', the user account context is not 'NT AUTHORITY\\SYSTEM', and the child ProcessName is not on a curated allowlist of known-good applications spawned by COM surrogates in your environment.",
              "For each child process spawned by 'dllhost.exe', profile the distribution of command-line argument entropy. Establish a baseline entropy range (e.g., mean and standard deviation) for each legitimate child process. Alert when a new instance of a known child process has a command-line entropy that is more than 3 standard deviations above its specific baseline, suggesting obfuscation or unusual parameters.",
              "Use a density-based clustering algorithm (e.g., DBSCAN) on feature vectors derived from 'dllhost.exe' child process events. Vectorize features including the child process name (using one-hot encoding), user context, and a TF-IDF representation of the command-line arguments. Normal, repetitive activity will form dense clusters. Configure alerting for any events classified as noise points by the algorithm, as these represent rare and potentially malicious deviations."
            ]
          },
          {
            "description": "Network flow data showing a single internal source host initiating DCOM/RPC connections (TCP port 135) to a number of unique internal destination hosts that significantly exceeds a behavioral baseline within a short time frame.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "East-West traffic on core network switches, Internal network segments, VLANs containing servers and workstations",
            "action": [
              "Implement a SIEM rule based on network segmentation policies. Generate a high-severity alert for any observed DCOM traffic (Zeek conn.log with `id.resp_p` == 135) between network zones where such communication is explicitly forbidden (e.g., from a user VLAN to a PCI or SCADA VLAN).",
              "In a 1-hour sliding window, calculate the out-degree (count of unique destination IPs) for each source IP making connections on TCP port 135. Profile this metric for all hosts. Alert if any host's out-degree exceeds the 99th percentile of all host out-degrees in that same window, flagging potential DCOM spraying activity.",
              "Apply a time-series forecasting model (e.g., Prophet, SARIMA) to the aggregate count of new DCOM source-destination pairs per minute across the entire network. The model will learn the network's normal 'heartbeat,' including time-of-day and day-of-week patterns. Generate an alert when the observed count of new pairs significantly exceeds the model's predicted upper confidence bound."
            ]
          },
          {
            "description": "Modification of registry keys associated with DCOM permissions or COM object servers (e.g., AppID, CLSID), followed by network logon activity from a remote host.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Registry hives on critical servers and workstations, Domain Controllers",
            "action": [
              "Create a correlation rule that triggers when: (1) A registry modification event (Windows Event ID 4657) is observed for a key path containing '\\AppID\\' or '\\CLSID\\'. (2) Within 10 minutes, a remote network logon (Windows Event ID 4624, Logon Type 3) occurs on the same host from an IP address not on an allowlist of administrative subnets.",
              "Profile the rate of modifications to registry keys under `HKEY_CLASSES_ROOT\\CLSID\\` and `HKEY_CLASSES_ROOT\\AppID\\`. Establish a baseline rate of change per host. Alert if the number of modification events (Event ID 4657) in a 1-hour window on a single host exceeds 3 standard deviations above its historical average, indicating potential COM hijacking setup or reconnaissance.",
              "Train a sequence analysis model (e.g., LSTM) on streams of host events (registry mods, process creations, network logons). The model learns normal sequences of administrative and user behavior. Flag event sequences as anomalous if they have a low probability according to the trained model, such as the sequence [Registry CLSID Key Write -> Remote Network Logon -> dllhost.exe process creation]."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]