[
  {
    "information_requirement": "Is the adversary conducting active user discovery on the network? (TA0007 - Discovery)",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1033",
        "name": "System Owner-User Discovery",
        "evidence": [
          {
            "description": "A process is executed whose file hash is associated with known user discovery utilities or malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations, Servers), Centralized Log Repository (SIEM)",
            "action": [
              "Symbolic: Continuously compare file hashes from new process events against a curated threat intelligence feed of hashes known to be associated with discovery tools (e.g., Seatbelt, BloodHound). Generate a high-severity alert upon any match.",
              "Statistical: For all executed file hashes, calculate their prevalence across the enterprise over a 30-day window. Flag any executable that is not digitally signed by a trusted publisher and has a prevalence of less than 1% (i.e., seen on a small fraction of endpoints) for investigation.",
              "Machine Learning: Utilize a pre-trained classification model (e.g., Gradient Boosting, Random Forest) on file features (e.g., entropy, import/export tables, string analysis for terms like 'whoami', 'net user') from newly observed executables. Triage executables classified as malicious with high confidence for immediate incident response."
            ]
          },
          {
            "description": "Execution of built-in user discovery commands (e.g., whoami, query user, qwinsta, id, w) or PowerShell cmdlets from a parent process not typically associated with administrative or interactive user activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations, Servers), Domain Controllers, Centralized Log Repository (SIEM)",
            "action": [
              "Symbolic: Create a detection rule that triggers when a user discovery command (e.g., 'whoami.exe', 'query.exe user') is spawned by an atypical parent process such as a Microsoft Office application (winword.exe, excel.exe), a web browser (chrome.exe), or a system service process (services.exe).",
              "Statistical: For each user-host pair, establish a baseline of discovery command execution frequency over a 30-day rolling window. Generate an alert when the command count within a one-hour period exceeds the 99th percentile of that specific baseline, indicating an unusual burst of activity for that user on that machine.",
              "Machine Learning: Develop a sequence analysis model (e.g., Hidden Markov Model) trained on command-line histories to learn normal command sequences for different user roles. Flag sequences with low transitional probability, such as a discovery command directly following a document opening or a web download, as potentially malicious behavior."
            ]
          },
          {
            "description": "A rapid succession of multiple, distinct user discovery commands executed on a host, immediately followed by an outbound network connection to a non-standard destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations, Servers), Network Egress Points, Centralized Log Repository (SIEM)",
            "action": [
              "Symbolic: Trigger a correlated alert if a single host executes three or more unique user discovery commands (e.g., 'whoami', 'query user', 'net user') within a five-minute window, and this activity is followed within the next minute by a network connection (Zeek conn.log) from that host to an external IP address with a low reputation score or on a non-standard port (e.g., not 80, 443, 53).",
              "Statistical: For each host, calculate a daily Z-score for the total count of discovery command executions against its historical 90-day mean and standard deviation. Concurrently, calculate the entropy of destination ports in its outbound traffic. An alert is generated if the command count Z-score is > 3 and the port entropy is anomalously high, suggesting scanning or unusual C2 activity.",
              "Machine Learning: Apply a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the enterprise-wide count of discovery commands per minute. Flag significant positive spikes (anomalies) in the time series. Enrich these flagged time windows with network connection data to identify hosts that contributed to the spike and also initiated suspicious outbound connections."
            ]
          },
          {
            "description": "A connection to a network device's management interface (e.g., SSH, Telnet) from an unauthorized source IP, followed by a session exhibiting characteristics of automated command execution, such as very short duration and minimal data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Network Device Syslog"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Infrastructure (Switches, Routers, Firewalls), Management Network Segment, Network Security Monitoring (NSM) Sensor Grid",
            "action": [
              "Symbolic: Maintain an explicit allow-list of administrative workstations and subnets authorized for network device management. Generate a critical alert for any connection to a network device on port 22 or 23 originating from an IP address not on this list.",
              "Statistical: From Zeek ssh.log, profile the distribution of session duration and total bytes transferred for all authenticated sessions to network devices. Flag any session that falls into the bottom 5th percentile for both duration (< 5 seconds) and bytes transferred (< 500 bytes), as this pattern is indicative of a scripted 'login-run command-logout' action.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means or DBSCAN) on SSH session features (source IP, source port, duration, bytes transferred, authentication method) to identify normal clusters of administrative activity. Treat any new session that is classified as an outlier or belongs to a very small, sparse cluster as anomalous and requiring investigation."
            ]
          },
          {
            "description": "A single source host queries an unusually large number of distinct Active Directory user or group objects via LDAP or MSRPC within a short time frame.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Security Event ID 4662",
              "Zeek conn.log",
              "Zeek ldap.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Centralized Log Repository (SIEM), Network Security Monitoring (NSM) Sensor Grid",
            "action": [
              "Symbolic: Generate an alert when a non-Domain Controller host executes commands like 'net user /domain' or 'net group /domain', or when a single user account generates more than 100 'An operation was performed on an object' events (Event ID 4662) for user or group objects on a DC within one minute.",
              "Statistical: Using Zeek ldap.log, track the number of unique user/group objects queried by each source IP in a 10-minute sliding window. Calculate a moving average and standard deviation for this metric across all source IPs. Flag any source IP whose query count exceeds 4 standard deviations above the moving average.",
              "Machine Learning: Implement peer group analysis by clustering users based on their role attributes from Active Directory. For each peer group, model the normal volume and diversity of their LDAP queries. Use an isolation forest or one-class SVM to detect when a user's query behavior (e.g., volume, attributes requested, object types) significantly deviates from their established peer group baseline, indicating potential credential compromise or insider threat activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]