[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by masquerading account names? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1036.010",
        "name": "Masquerade Account Name",
        "evidence": [
          {
            "description": "A user account creation event (Windows Event ID 4720) is logged where the 'New Account Name' field contains a username matching a curated list of known malicious or suspicious account names (e.g., 'haxor', 'system.service', 'backup_admin').",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Workstations",
            "action": [
              "Continuously monitor for Windows Event ID 4720 (A user account was created) on all NAIs. Compare the 'Target Account Name' value against a regularly updated threat intelligence blocklist of known malicious account names. Generate a high-severity alert for any exact match.",
              "For each new account creation (Windows Event ID 4720), calculate the Shannon entropy of the 'Target Account Name'. Compare this value against a pre-computed baseline distribution of entropy for all existing, legitimate usernames. Generate an alert for usernames with entropy scores in the top 5th percentile (indicating high randomness, e.g., 'x7g3f_svc') or bottom 5th percentile (indicating over-simplicity, e.g., 'a'), as these may be programmatically generated.",
              "Train a supervised classification model (e.g., Random Forest) using a labeled dataset of known-benign and known-malicious account creations. Extract features for each event (Windows Event ID 4720) including: username length, character-type ratios (alpha, numeric, special), source hostname of creation, time of day/day of week, and the name of the creating account. Deploy the model to score all new account creations in real-time and alert on any classified as malicious with high confidence (>0.9)."
            ]
          },
          {
            "description": "A user account creation event (Windows Event ID 4720) is logged for an account whose name matches common administrative or service account patterns (e.g., 'svc_*', '*_adm', 'backup'), and the 'Creator Subject' is not an authorized IT administrator account or automated provisioning service.",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Cloud IAM Services (e.g., Azure AD)",
            "action": [
              "Create a SIEM rule to monitor Windows Event ID 4720. The rule should apply a list of regular expressions to the 'Target Account Name' to detect common service or admin naming conventions, such as '^(svc|sql|backup|adm|sys|net|hlp|help|dsk|desk|test).+', '.*(admin|service|backup|local|system)$', or '.*(adm|svc|bak)$'. If a name matches and the 'Subject Account Name' is not on a pre-approved allowlist of IT administrator accounts or service principals, generate a medium-severity alert for analyst review.",
              "For all accounts matching the service/admin patterns, query historical Windows Event ID 4720 logs to build a baseline distribution of creation times (hour of day, day of week). For each new matching account creation, compare its timestamp to this baseline. An event occurring outside the typical 95% confidence interval (e.g., 2 AM on a Saturday when normal creations are 9-5 on weekdays) should trigger an alert for anomalous timing.",
              "Implement a time series anomaly detection model (e.g., SARIMA or Prophet) that is trained on the historical frequency (e.g., hourly counts) of account creations matching the service/admin patterns. Feed real-time creation counts into the model. An observed count that significantly exceeds the model's forecasted value and its uncertainty interval indicates a potential burst of malicious account creation and should be flagged as a high-priority anomaly."
            ]
          },
          {
            "description": "A user account creation or rename event (Windows Event ID 4720, 4781) is logged where the new account name contains non-standard ASCII characters or homoglyphs, and when normalized, visually resembles an existing high-privilege account name (e.g., 'ɑdmin' vs 'admin').",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4781"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, HR Systems, Financial Systems",
            "action": [
              "For each account creation (Windows Event ID 4720) or rename (Windows Event ID 4781), parse the 'Target Account Name' to detect the use of mixed character sets (e.g., Latin and Cyrillic) or characters from a predefined list of common homoglyphs (e.g., 'о' vs 'o', 'І' vs 'l'). If such a character is detected, generate an alert for manual comparison against existing privileged accounts.",
              "On a scheduled basis or upon creation (Windows Event ID 4720, 4781), iterate through new account names. For each name, create a 'normalized skeleton' by applying a homoglyph map to convert confusable characters to their standard ASCII equivalents, removing all non-alphanumeric characters, and converting to lowercase. Calculate the Levenshtein distance between this new skeleton and the pre-computed skeletons of all privileged accounts. Alert if the distance is 1 or 2 while the original account names differ, indicating a probable homoglyph or typosquatting attack.",
              "Train a character-level autoencoder neural network on the complete set of existing, legitimate usernames. The model learns to reconstruct normal usernames with a low reconstruction error. For every new account creation (Windows Event ID 4720) or rename (Windows Event ID 4781), pass the username through the autoencoder. If the reconstruction error exceeds a statistically determined threshold (e.g., 3 standard deviations above the mean reconstruction error of the training set), flag the username as anomalous and potentially containing malicious patterns like homoglyphs."
            ]
          },
          {
            "description": "A user account creation or rename event (Windows Event ID 4720, 4781) is logged where the Jaro-Winkler similarity score between the new account name and an existing privileged account name exceeds a predefined threshold (e.g., > 0.95), indicating a potential typosquatting attempt (e.g., 'admnistrator' vs 'administrator').",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4781"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged Access Workstations (PAWs), Key IT Personnel Endpoints",
            "action": [
              "For each account creation/rename (Windows Event ID 4720, 4781), compare the new 'Target Account Name' against a pre-generated list of typosquatted variations of critical account names (e.g., 'administrator', 'CEO_account'). This list should be generated using a script that creates common typos (character swaps, omissions, insertions, doubles). An exact match to this typosquatting list should generate a high-severity alert.",
              "For each new account name from events 4720 or 4781, calculate the Jaro-Winkler similarity score against every account in a list of privileged users. Create a baseline of 'nearest-neighbor' scores for legitimately created accounts. A new account whose highest similarity score to a privileged account is an outlier (e.g., in the top 1% of all calculated scores, such as > 0.95), suggests a deliberate attempt at typosquatting and should be alerted.",
              "Generate vector representations (e.g., TF-IDF or bag-of-characters on n-grams) for all account names in the environment. Apply an unsupervised density-based clustering algorithm like DBSCAN. Most legitimate accounts will form dense clusters based on naming conventions. Flag any new account that is marked as a 'noise' point by the algorithm (i.e., does not belong to any cluster) for review. Increase the alert priority if this anomalous account also has a high string similarity score to a known privileged account."
            ]
          },
          {
            "description": "A newly created account (within 72 hours of creation per Event ID 4720) performs a privileged action, such as being added to an administrative group (Event ID 4732), or exhibits anomalous network behavior, such as a high volume of failed connections or connections to rare external IP addresses (Zeek conn.log).",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4781",
              "Windows Event ID 4624",
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Gateway, DNS Servers, Endpoint Devices",
            "action": [
              "Create a stateful correlation rule that triggers when a 'A user account was created' event (Windows Event ID 4720) is followed within 1 hour by a 'A member was added to a security-enabled group' event (Windows Event ID 4728, 4732, or 4756) for the same 'Target Account Name', where the group is a high-privilege one (e.g., 'Domain Admins', 'Enterprise Admins', 'Administrators'). This 'newborn admin' activity should generate a critical-severity alert.",
              "For all accounts created within the last 7 days (identified by Windows Event ID 4720), correlate their login events (Windows Event ID 4624) with network connection logs (Zeek conn.log) by timestamp and username. For each connection, enrich the source IP with GeoIP and ASN data. Calculate the historical frequency of source countries and ASNs for the entire organization. If a new account makes an interactive login (Logon Type 2 or 10) from a country or ASN that falls below the 5th percentile of historical frequency, increment a risk score for that account. Escalate for review if the score passes a set threshold.",
              "Develop a survival analysis or anomaly detection model to establish a baseline for 'time to first privileged action' for new accounts. Train the model on historical data, using account creation (Windows Event ID 4720) as the birth event and actions like first RDP login (Windows Event ID 4624 Logon Type 10), first privilege escalation (Windows Event ID 4732), or first access to a critical server as subsequent events. A new account that performs one of these key actions in a time window that the model flags as anomalously short (e.g., in the fastest 1% of historical times) should be alerted on."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]