[
  {
    "information_requirement": "Is the adversary maintaining persistence using RC scripts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1037.004",
        "name": "RC Scripts",
        "evidence": [
          {
            "description": "A network connection from a known-malicious IP address to a Unix/Linux host on TCP port 22 is immediately followed by a file transfer whose hash matches a known malware signature.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, Demilitarized zones (DMZ), Critical Unix/Linux server segments (e.g., ESXi management networks, web server farms)",
            "action": [
              "Query Zeek conn.log for connections where `id.resp_p` is 22 and `id.orig_h` is present in a threat intelligence feed of malicious IPs. Using the `uid` from matching connections, join with Zeek files.log to identify if the `sha1` or `md5` hash of the transferred file matches a known malicious hash.",
              "For all SSH connections (`id.resp_p` = 22), aggregate connection counts by source country and ASN over a 30-day baseline. Generate an alert if a new connection's source country or ASN falls into the bottom 1st percentile of the established frequency distribution, indicating an anomalously rare origin.",
              "Deploy a time-series anomaly detection model (e.g., ARIMA, LSTM) trained on historical SSH connection volume (count and bytes) to critical Unix hosts. The model should forecast expected traffic patterns. Generate an alert when the observed traffic significantly deviates from the forecast, especially outside of standard administrative hours."
            ]
          },
          {
            "description": "A process creation event on a Windows host shows a remote administration tool (e.g., scp.exe, plink.exe) being used with command-line arguments that explicitly reference a Unix RC script path like /etc/rc.local.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows administrative workstations, Windows jump servers/bastion hosts, Endpoint devices of system administrators and developers",
            "action": [
              "Create a SIEM rule to monitor Windows Event ID 4688 for `NewProcessName` matching `scp.exe`, `sftp.exe`, `plink.exe`, or `ssh.exe`. The rule triggers if the `CommandLine` field contains a regular expression matching common RC script paths, such as `(\\/etc\\/rc\\.(local|common|d))|(\\/etc\\/init\\.d\\/)`.",
              "For all process creation events involving remote admin tools, parse the command line arguments. Calculate the frequency of unique command line patterns observed over a 30-day baseline. An alert is generated for command lines that are statistically rare or have never been seen before, particularly those containing keywords like `echo`, `>`, `>>`, and `/etc/`.",
              "Train a supervised classification model, like Random Forest, to predict the probability of a command line being malicious. Use features such as command length, presence of special characters (`>`, `|`, `&`), keyword frequency (`/etc/`, `chmod`, `wget`), and the entropy of the command string. Deploy the model to score new Event ID 4688 events in real-time."
            ]
          },
          {
            "description": "A file transfer to a critical Unix host, such as an ESXi server, originates from a source IP not belonging to an authorized administrative group, occurs outside a defined maintenance window, and involves a file size that deviates from the historical norm for that traffic path.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ESXi management networks, Virtualization infrastructure, Core network switches and routers monitoring traffic to critical servers",
            "action": [
              "Define asset groups for 'Administrative Workstations' and 'Critical Unix Servers'. Create a rule that alerts when a connection is seen in Zeek conn.log with a source IP not in the admin group and a destination IP in the critical server group, on destination port 22.",
              "For each unique source-destination pair involving SSH/SCP to critical Unix hosts, establish a historical baseline of data transfer volume (`orig_bytes` + `resp_bytes` in Zeek conn.log). Generate an alert when a new session's data volume exceeds the 95th percentile of this specific baseline.",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest) on enriched connection data. Features should include: source IP, destination IP, destination port, time of day, day of week, connection duration, total bytes transferred, and a binary flag indicating if the source is a known admin host. The model will identify sessions that are outliers across this multi-dimensional feature space."
            ]
          },
          {
            "description": "Within one hour of a system reboot, a Unix host initiates periodic outbound network connections (beaconing) to a destination IP or domain not present in its 30-day communication baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Syslog"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, Egress points of the network, DNS resolvers, Centralized log aggregators (SIEM)",
            "action": [
              "Upon detection of a reboot event for a critical Unix host (from syslog), monitor Zeek conn.log for outbound connections from that host's IP. Alert if the destination IP (`id.resp_h`) is found on a C2 threat intelligence list. Concurrently, query Zeek dns.log for DNS requests from the host to domains flagged as malicious or newly registered (NRDs).",
              "For each critical Unix host, maintain a 30-day baseline of known communication partners (IPs, domains). After a reboot, monitor for connections to new partners. For any new, persistent connection, calculate the time difference between consecutive connections. A low standard deviation in these time intervals (low jitter) is indicative of automated beaconing and should trigger an alert.",
              "Apply a time-series decomposition model (e.g., STL) to outbound network traffic metrics (connection count, data volume) for each critical host to establish baselines for trend and seasonality. After a reboot, compare new traffic patterns to the baseline. An alert is generated if the residual component (unexplained variance) shows a strong, periodic signal, indicating new, regular beaconing activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary elevating privileges using RC scripts?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1037.004",
        "name": "RC Scripts",
        "evidence": [
          {
            "description": "A file transferred to a Unix/Linux host has a hash matching a known exploit or a filename matching patterns associated with privilege escalation tools (e.g., 'dirtycow.c').",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps monitoring traffic between workstations and server segments, File transfer proxies, DMZ",
            "action": [
              "Scan the `filename` field in Zeek files.log for regular expressions matching known exploit scripts (e.g., `.*dirty.*\\.c`, `linux.*\\.sh`, `exploit\\.py`). Simultaneously, match the `sha1` and `md5` hashes from files.log against a threat intelligence feed of known exploit file hashes.",
              "For file transfers to Unix systems, create a baseline profile of `mime_type` and file sizes from Zeek files.log. Alert when a file transfer involves a statistically rare MIME type for the destination host (e.g., a C source file `text/x-c` to an ESXi host) or a file size that exceeds the 99th percentile of typical transfers for that asset.",
              "Train a supervised classifier (e.g., Logistic Regression) to identify suspicious file transfers. Use metadata features from Zeek files.log such as `tx_hosts`, `rx_hosts`, `conn_uids`, `source`, `depth`, `mime_type`, and `is_orig`, enriched with context like asset criticality. The model learns to distinguish routine transfers from those associated with exploit delivery."
            ]
          },
          {
            "description": "A remote shell command originating from a Windows host, captured in process creation logs, contains both a shell redirection operator (`>` or `>>`) and a path to a system RC script (e.g., /etc/rc.common).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows administrative workstations, Windows jump servers/bastion hosts, Domain Controllers (for auditing originating user context)",
            "action": [
              "Create a high-priority SIEM alert for Windows Event ID 4688 where `NewProcessName` is `ssh.exe` or `plink.exe` and the `CommandLine` contains both a redirection operator (`>>` or `>`) and a substring matching `/etc/rc.`.",
              "For all remote shell commands captured via Event ID 4688, parse and normalize all file paths. Maintain a frequency distribution of accessed paths. Generate an alert if a command modifies a path that falls in the bottom 5th percentile of access frequency, especially system-level paths like `/etc/rc.local`.",
              "Implement an NLP-based classification model to analyze command line strings. Use TF-IDF to convert command lines into feature vectors. Train a classifier (e.g., SVM) to categorize commands as 'benign' or 'malicious modification'. The model should learn to flag combinations of tools (`echo`, `curl`), redirection, and sensitive paths."
            ]
          },
          {
            "description": "A non-root user session, originating from a Windows host, is correlated with a subsequent file modification event on a root-owned RC script on the destination Unix host within a short time window.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Unix/Linux Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized log aggregation platform (SIEM), Critical Unix/Linux servers, Windows administrative workstations, Domain Controllers",
            "action": [
              "In the SIEM, correlate Unix auditd logs showing a write event (`type=SYSCALL`, `syscall=write`, `path` contains `/etc/rc.`) with Zeek conn.log. Alert if the audit log shows a non-root user escalating to root (`auid != 0` and `uid = 0`) and the corresponding network session in Zeek originates from an IP address not associated with an administrator.",
              "Develop a risk scoring model for file modifications on Unix hosts. Score events based on: user context (root vs. non-root), file path sensitivity (e.g., `/etc/` > `/home/`), historical user behavior (has this user modified this file before?), and source IP reputation. An alert is triggered when the cumulative score for a modification event exceeds a threshold determined by the 98th percentile of all event scores.",
              "Construct a bipartite graph where nodes are users and files, and edges represent file modification events. Use a graph-based anomaly detection algorithm, such as Community Detection, to find unusual edges. An edge connecting a 'standard user' node to a 'sensitive RC script' node, especially if those nodes are in different communities, represents a high-confidence anomaly."
            ]
          },
          {
            "description": "Within 15 minutes of a system reboot, a new process not present in the established baseline is executed with root privileges, and this process or its child subsequently initiates an outbound network connection.",
            "data_sources": [
              "Zeek conn.log",
              "Unix/Linux Audit Logs",
              "Syslog"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Unix/Linux servers (for process and reboot logs), Egress points of the network, Centralized log aggregation platform (SIEM)",
            "action": [
              "After a reboot event is logged for a Unix host, capture a list of `execve` events from auditd. Compare the set of running processes and their parent processes against a pre-defined, known-good baseline for that host. Alert on any new process running as root (`uid=0`). Correlate this alert with Zeek conn.log to see if that host initiates any outbound connections to IPs on a threat intelligence list.",
              "For each host, build a baseline of normal parent-child process relationships post-reboot (e.g., `init` spawning `systemd`). After a reboot, analyze new process creation events from auditd. Alert if a statistically rare parent-child relationship is observed, such as a process in the process tree that does not match the established baseline, especially if it spawns a network connection.",
              "Deploy a multivariate time-series model to forecast expected resource utilization (CPU, memory, network I/O, process count) for the first hour post-reboot. Train the model on historical reboot cycles. An alert is generated if the actual resource consumption metrics significantly and consistently exceed the model's prediction interval, indicating unexpected activity from a newly persisted process."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]