[
  {
    "information_requirement": "Has the adversary collected data from network shared drives? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1039",
        "name": "Data from Network Shared Drive",
        "evidence": [
          {
            "description": "A process execution event where the process name, hash, or command-line arguments match a known indicator of compromise (IOC) for tools used in data collection, such as credential dumpers or specialized file transfer utilities.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, Domain Controllers, File Servers",
            "action": [
              "Continuously query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) against a maintained threat intelligence watchlist of malicious file hashes (MD5, SHA256) and process names (e.g., secretsdump.py, ncp.exe). Generate a high-severity alert upon any match.",
              "For any process creation event, calculate the historical frequency (rarity) of the full command-line string for that specific user and host. Flag any process execution whose command-line rarity is in the bottom 1st percentile and which is followed by a network share access event (Windows Event ID 5145) from the same host within 5 minutes. This identifies rare commands that lead to collection behavior.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled process creation events. Engineer features such as process name, parent process name, command-line length, argument count, presence of UNC paths (\\\\), and user context. The model will output a probability score for each new process event being malicious. Flag events with a high probability score that are temporally correlated with network share access."
            ]
          },
          {
            "description": "Execution of a command-line or script block that combines file or directory enumeration and copy commands with a Universal Naming Convention (UNC) path, indicating interaction with a network share.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, File servers hosting network shares",
            "action": [
              "Apply regular expressions to command-line arguments (Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104). Search for patterns combining copy commands (xcopy, robocopy, Copy-Item) or enumeration (dir, Get-ChildItem) with UNC paths (\\\\server\\share). Generate an alert on any match, such as `robocopy \\\\filesrv01\\data C:\\temp /e`.",
              "For commands involving common file transfer utilities (xcopy, robocopy, powershell.exe, net.exe), calculate the Shannon entropy of the command-line string. Establish a per-utility baseline entropy profile. Flag commands whose entropy score exceeds the 98th percentile for that specific utility, especially when a UNC path is present, as this may indicate obfuscation or unusually complex parameters.",
              "Utilize a pre-trained Natural Language Processing (NLP) transformer model, fine-tuned on a corpus of benign administrative scripts and malicious data collection scripts. Feed all PowerShell script block logs (Windows Event ID 4104) into the model. Flag any script block classified with a high probability of having 'data collection' or 'staging' intent, particularly when the script text contains UNC paths or IP addresses."
            ]
          },
          {
            "description": "A single user account or host machine reads a volume of data or number of files from network shares that significantly exceeds its established historical baseline over a defined time window.",
            "data_sources": [
              "Windows Event ID 5145",
              "Zeek smb.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting network shares, Network backbone switches (for traffic monitoring), Domain Controllers",
            "action": [
              "Implement a stateful rule that triggers an alert if a single source host reads more than 5,000 unique files or transfers more than 2 GB of data from any combination of SMB shares within a 1-hour window, based on aggregated Windows Event ID 5145 or Zeek smb.log data.",
              "For each user-host pair, create a 30-day rolling baseline of bytes transferred and files accessed per hour from network shares. Continuously calculate the Z-score for these metrics in near real-time. Generate a medium-severity alert if the Z-score for either data volume or file count exceeds 3.0, indicating a statistically significant deviation from normal activity.",
              "For each high-value network share, deploy a time-series anomaly detection model (e.g., Seasonal ARIMA or an LSTM autoencoder). Train the model on historical data (e.g., bytes read per minute from Zeek smb.log) to learn normal access patterns, including daily and weekly seasonality (e.g., nightly backups). Trigger an alert when the observed read volume significantly deviates from the model's predicted range."
            ]
          },
          {
            "description": "A user or host accesses an anomalously high number of distinct network shares or a mix of file types inconsistent with their established role-based access patterns.",
            "data_sources": [
              "Windows Event ID 5145",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting network shares, Active Directory servers, Data classification repositories",
            "action": [
              "Correlate network share access events (Windows Event ID 5145) against a data classification map that links Active Directory user groups to authorized share access. Generate an immediate, high-severity alert if a user account from a non-authorized group (e.g., a 'Marketing' user) successfully reads from a share designated for 'Engineering-Source-Code'.",
              "For each user, establish a daily baseline for (a) the count of unique network shares accessed and (b) the Shannon entropy of file extensions accessed (e.g., .docx, .pdf, .dll). Flag any day where a user's unique share count exceeds the 99th percentile of their 90-day history, or where the file extension entropy shows a sharp increase, suggesting exploration or collection of varied data types.",
              "Model user-to-share access patterns as a bipartite graph. Apply a community detection algorithm (e.g., Louvain) to identify clusters of users with similar access needs (e.g., the 'Finance' community accessing finance shares). An alert is triggered when a user node creates multiple new edges to shares far outside its primary community, indicating a significant and suspicious pivot in access behavior."
            ]
          },
          {
            "description": "A 'fan-in' data staging pattern is observed, where a single host sequentially reads data from multiple distinct network shares and writes a large volume of data to a single local directory within a short time frame.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 11",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, File servers hosting network shares",
            "action": [
              "Create a stateful correlation rule that triggers when a single host (by IP or hostname) generates network share read events (Windows Event ID 5145 or Zeek smb.log) from at least 3 different UNC paths, immediately followed by a high volume of file creation events (Sysmon Event ID 11) to a single local directory (e.g., C:\\Users\\Public\\), all within a 30-minute window.",
              "On each endpoint, monitor and calculate the ratio of network read bytes (from SMB) to local disk write bytes over a 5-minute sliding window. Establish a per-host baseline for this ratio. Generate an alert if this ratio spikes significantly beyond 3 standard deviations of the host's normal behavior, indicating a burst of network data being written locally.",
              "Develop a sequence analysis model using a Recurrent Neural Network (RNN) or Hidden Markov Model (HMM) to specifically identify the malicious staging sequence: [Enumerate_Share_A -> Read_File_A -> Enumerate_Share_B -> Read_File_B -> Create_Local_Dir -> Write_Local_File]. Train the model on sequences of event IDs from both benign and simulated malicious activity. The model will score real-time event sequences, flagging those with a high probability of matching the malicious staging pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]