[
  {
    "information_requirement": "Is the adversary exfiltrating data using a custom or non-standard symmetric encryption scheme over a common protocol?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048.001",
        "name": "Exfiltration Over Symmetric Encrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "An outbound connection from an internal host is made to a destination IP, domain, or Autonomous System Number (ASN) listed on a threat intelligence feed as known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Internal DNS Servers, Network Security Monitoring (NSM) Sensors",
            "action": [
              "Symbolic: Execute a real-time query joining the `id.resp_h` field from Zeek conn.log and the `answers` field from Zeek dns.log against a high-confidence cyber threat intelligence (CTI) database of known malicious hosts or exfiltration points. Generate a critical alert upon any match.",
              "Statistical: Profile destination domains and ASNs accessed across the enterprise. Generate an alert for connections to destinations that are rare (e.g., seen by fewer than 5 hosts in the last 30 days) and exhibit a high sent-to-received byte ratio (e.g., `orig_bytes` / `resp_bytes` > 10) in Zeek conn.log.",
              "Machine Learning: Employ a graph-based anomaly detection algorithm to model internal-to-external connections. Identify and score anomalous edges that represent new or rare connections to subnets/ASNs, particularly when combined with high data volume, and classify them based on community detection of known malicious infrastructure graphs."
            ]
          },
          {
            "description": "The calculated Shannon entropy of an application-layer payload (e.g., DNS query, HTTP body) significantly exceeds the established baseline for that protocol and host, suggesting the presence of encrypted or compressed data.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Internal DNS Servers, Network Taps with Full Packet Capture",
            "action": [
              "Symbolic: Create a static rule to alert when the calculated Shannon entropy of a DNS TXT record query payload from Zeek dns.log exceeds a fixed threshold (e.g., 7.5 on a scale of 0-8) and the query length is over 200 bytes, indicating non-standard data encapsulation.",
              "Statistical: For each source host and protocol combination, calculate a rolling 30-day baseline of payload entropy. Generate an alert when a new connection's entropy exceeds the 99th percentile of its baseline AND the `orig_bytes` in the corresponding Zeek conn.log entry exceeds its own historical 99th percentile.",
              "Machine Learning: Train a Random Forest classifier using features from Zeek logs: `proto`, `resp_p` (port), calculated payload entropy, `orig_bytes`, `resp_bytes`, and connection `duration`. Use labeled data (known good traffic vs. synthetic encrypted traffic) to train the model to assign a probability score to new connections, flagging those with a score > 0.9 as potential exfiltration."
            ]
          },
          {
            "description": "An internal host sends a volume of data to an external destination that is anomalously high compared to its own historical baseline, or the ratio of sent-to-received bytes is abnormally skewed.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Critical Asset Subnets (e.g., Database Servers, File Servers), User Workstation Subnets",
            "action": [
              "Symbolic: Create a static threshold rule to alert when the `orig_bytes` field in a single Zeek conn.log entry from a user-zone asset to an external IP exceeds a high-water mark (e.g., 500MB) in a single session.",
              "Statistical: For each source-destination IP pair, calculate the mean and standard deviation of `orig_bytes` over a 30-day rolling window. Alert when a new 24-hour aggregate of `orig_bytes` for that pair exceeds the mean by more than 4 standard deviations.",
              "Machine Learning: Implement a time-series decomposition model (e.g., SARIMA) on hourly aggregated outbound bytes per host. This model separates data into trend, seasonality, and residual components. Flag any data point in the residual component that exceeds a predefined threshold as a significant anomaly indicative of an exfiltration event."
            ]
          },
          {
            "description": "A process, identified by its name or path, initiates an outbound network connection involving significant data transfer, where the process is not typically associated with network activity or is executing from a non-standard location.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 5156",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations and Servers), Domain Controllers, Application Servers",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when a Process Creation event (Sysmon Event ID 1) for a process on a watchlist (e.g., `certutil.exe`, `bitsadmin.exe`, `powershell.exe`) is followed within 60 seconds by a Network Connection event (Sysmon Event ID 3) from the same Process GUID to an external IP address.",
              "Statistical: Build a frequency table of all process image paths that initiate outbound connections (by joining Sysmon Event ID 3 and Event ID 1). Alert when a process in the bottom 5% of frequency initiates a connection where the corresponding `orig_bytes` in Zeek conn.log is in the top 5% of all connections by volume.",
              "Machine Learning: Apply an Isolation Forest model to a feature set derived from joining process and network events: process path rarity score, command line entropy, parent process path, destination port, destination ASN, and total bytes sent. The model will identify anomalous combinations of these features that deviate from normal host behavior without prior labeling."
            ]
          },
          {
            "description": "A standard network protocol (e.g., HTTP, DNS) is used in a way that violates its typical conversational structure, such as an extended session with a high ratio of client-to-server data transfer without corresponding server requests.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Internal DNS Servers, Web Proxies",
            "action": [
              "Symbolic: Create a signature to detect DNS queries where the query type is TXT or NULL, the query name contains more than 10 subdomains, and the total query length exceeds 100 characters, indicating data chunking for tunneling.",
              "Statistical: For each internal source IP, calculate a 1-hour rolling average of the ratio of HTTP POST request volume to GET request volume. Alert when this ratio exceeds the 98th percentile of its 30-day historical baseline for that IP, indicating an abnormal amount of data upload.",
              "Machine Learning: Develop a sequence-to-sequence autoencoder (using LSTMs) trained on sequences of protocol events within a connection (e.g., for HTTP: GET, POST, HEAD; for DNS: A, AAAA, TXT). A high reconstruction error for a given connection's event sequence indicates a deviation from normal protocol usage patterns and may signify tunneling."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]