[
  {
    "information_requirement": "Is an adversary exfiltrating data using a USB device? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1052.001",
        "name": "Exfiltration over USB",
        "evidence": [
          {
            "description": "A process is created from a removable drive path, and the executable file's hash matches a known malicious tool used for data staging or exfiltration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers, particularly those with sensitive data access or used by privileged accounts.",
            "action": [
              "Implement a SIEM query to join process creation events (Windows Event ID 4688) with a threat intelligence feed of file hashes for known exfiltration tools. Alert when a hash match is found and the process's path indicates it was launched from a removable drive (e.g., path starts with drive letters E: through Z:).",
              "For processes launched from removable media, calculate the Shannon entropy of the process name and command-line arguments. Establish a baseline of entropy scores across the enterprise. Flag any process whose process name or command-line entropy exceeds the 95th percentile of the historical baseline, as this may indicate obfuscation or packing.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) using features extracted from process creation events (e.g., parent process name, user context, command-line length, entropy, presence of sensitive keywords). Label data using known malware and benign software. Deploy the model to score new processes launched from USB devices, alerting on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A native command-line utility (e.g., robocopy, xcopy, PowerShell's Copy-Item) is executed with command-line arguments indicating a recursive copy from a sensitive internal location to a drive letter associated with removable media.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints with access to network shares, document management systems, and code repositories.",
            "action": [
              "Deploy a SIEM rule that monitors process creation events (Windows Event ID 4688) for `robocopy.exe`, `xcopy.exe`, and `powershell.exe`. The rule should use regular expressions on the command-line field to detect a source path (e.g., `C:\\Users`, `\\\\fileserver\\`) and a destination path that is a removable drive letter (e.g., `[E-Z]:\\`), especially when combined with recursive flags (`/E`, `/S`, `-Recurse`).",
              "For each user, create a baseline of their command-line usage for copy utilities. Profile features like frequency of use, argument count, and use of recursive flags. Generate a risk score when a command deviates significantly (e.g., > 3 standard deviations) from the user's established baseline, particularly when the destination is a removable drive.",
              "Implement a sequence analysis model (e.g., an LSTM or Transformer) to analyze sequences of user commands within a session. Train the model on benign command sequences. Flag sessions as anomalous when a sequence like `whoami`, `dir \\\\sensitive\\share`, `robocopy \\\\sensitive\\share E:\\backup` is detected, as it deviates from normal user workflow patterns."
            ]
          },
          {
            "description": "The total volume of data (in bytes) or the total count of files written to a removable storage device within a defined time window significantly exceeds the established historical baseline for a specific user or host.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstations of users in departments handling PII, PHI, or intellectual property (e.g., HR, Finance, R&D).",
            "action": [
              "After enabling file system object access auditing (SACL) on critical directories, create a SIEM rule to monitor file write events (Windows Event ID 4663). Alert if a single user writes a high volume of data (e.g., > 1 GB) or a high count of files (e.g., > 1000) to a removable drive path within a short time window (e.g., 15 minutes).",
              "For each user and host, ingest file write events (Windows Event ID 4663) to establish a rolling 30-day baseline of data volume written to USB devices, aggregated hourly. Alert when the data volume in any given hour exceeds the 99th percentile of that user/host's historical baseline, indicating an unusually large data transfer.",
              "Apply a time-series anomaly detection algorithm (e.g., SARIMA, Prophet) to the stream of file write counts and total bytes written to removable media, aggregated per user per hour. The model will learn normal user behavior, including seasonality (e.g., end-of-month reporting). Flag any activity that falls outside the model's predicted confidence interval as a potential exfiltration event."
            ]
          },
          {
            "description": "A temporal sequence of events is observed on a host: 1) A USB mass storage device is connected, 2) A data compression or archival process is launched, targeting sensitive directories, and 3) A high volume of file write operations to the newly connected USB device occurs within a short time frame.",
            "data_sources": [
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 400",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints, with a focus on air-gapped or high-security zone systems where USB is a primary vector for data movement.",
            "action": [
              "Create a stateful correlation rule that triggers when the following sequence occurs for a single host within a 10-minute window: (1) A USB Mass Storage Device connection event (e.g., Kernel-PnP Event ID 400), followed by (2) a process creation event (Windows Event ID 4688) for an archival tool (`7z.exe`, `winrar.exe`, `tar.exe`), followed by (3) a high count (>100) of file write events (Windows Event ID 4663) to the drive letter associated with the new device.",
              "For each user, calculate the historical probability of them creating an archive file (e.g., .zip, .7z) within 15 minutes of connecting a USB device. If a new occurrence of this sequence has a very low probability based on the user's past behavior (e.g., p-value < 0.01), generate an alert for anomalous staging activity.",
              "Construct a behavioral graph where nodes represent users, hosts, processes, and file objects (drives). An event sequence (USB connect -> archive process -> file writes) creates a specific subgraph pattern. Use a graph neural network (GNN) to identify subgraphs that deviate from common, benign patterns, indicating a likely malicious staging and exfiltration chain."
            ]
          },
          {
            "description": "File write operations to a removable storage device are performed by a non-interactive account (e.g., service account) or by a user account outside of their established baseline of normal working hours.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4634"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All servers (especially Domain Controllers, database servers) and workstations of privileged users (e.g., Domain Admins, developers).",
            "action": [
              "Create a high-priority alert that triggers on any file write event (Windows Event ID 4663) or process creation (Windows Event ID 4688) involving a removable drive path, where the associated user account is a designated service account (e.g., member of a 'Service Accounts' AD group). Additionally, alert on any such activity from a standard user account occurring outside of typical business hours (e.g., 10 PM - 6 AM local time).",
              "For each user, analyze login/logoff events (Windows Event ID 4624/4634) over a 90-day period to build a histogram of activity by hour of the day and day of the week. Generate an alert if a user writes data to a USB device during a time window that falls below the 5th percentile of their historical activity, indicating off-hours behavior.",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN or Isolation Forest) on features of USB write activity, including user account type, time of day, day of week, data volume, and host. The model will group normal activities into clusters. Any event that is flagged as an outlier or falls into a very small, isolated cluster should be investigated as potentially malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]