[
  {
    "information_requirement": "Is the adversary exfiltrating data via a physical medium? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1052",
        "name": "Exfiltration Over Physical Medium",
        "evidence": [
          {
            "description": "A file write to a removable media device is initiated by a process whose executable hash is present on a blocklist of known malicious indicators.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints (desktops, laptops), servers with accessible physical ports (e.g., USB), and workstations used by privileged accounts or users with access to sensitive data repositories.",
            "action": [
              "Symbolic (IOC Match): Correlate a file write event to removable media (Windows Event ID 4663 where Object Name contains a removable drive path) with its corresponding process creation event (Windows Event ID 4688 or Sysmon Event ID 1) using the Process ID. Calculate the SHA256 hash of the process executable and match it against a threat intelligence feed of known malicious file hashes. Generate a high-severity alert on any match.",
              "Statistical (Frequency Analysis): For all processes observed writing to removable media, establish a 30-day rolling baseline of process name frequency. Identify processes that are rare writers (e.g., in the bottom 5th percentile of frequency) or processes that have never been seen writing to removable media before. Alert on these statistical outliers for further investigation.",
              "Machine Learning (Classification): Train a supervised classification model (e.g., XGBoost, Random Forest) on features from process creation and file write events. Use features such as process name, parent process name, process integrity level, file extension of the written file, and whether the process is unsigned. Use the model to classify each removable media write event as benign or suspicious, alerting on predictions with high confidence scores."
            ]
          },
          {
            "description": "A process is created with command-line arguments indicating a file copy operation from a sensitive internal directory to a removable media drive path.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints and servers with command-line auditing enabled, administrative jump boxes, developer workstations, and servers hosting critical data.",
            "action": [
              "Symbolic (Regex/Rule Match): In process creation logs with command lines (Windows Event ID 4688, PowerShell 4104, Sysmon Event ID 1), apply a rule that looks for file transfer utilities (e.g., `xcopy`, `robocopy`, `Copy-Item`, `bitsadmin`) where the source argument is a monitored sensitive path (e.g., `C:\\Data\\Finance\\`, `\\\\fileshare\\HR`) and the destination argument is a removable media path (e.g., `E:\\`, `F:\\*`). Alert on any match.",
              "Statistical (Argument Analysis): For all command-line file copy operations to removable media, calculate the Shannon entropy of the source and destination file paths. Establish a baseline for path entropy across all commands. Flag commands where the path entropy exceeds the 95th percentile, suggesting obfuscation. Also, flag commands copying an anomalously large number of files (e.g., using `*` on a directory with >1000 files) compared to the user's historical average.",
              "Machine Learning (Sequence Modeling): Treat command lines as sequences of tokens (the command and its arguments). Train a sequence-based anomaly detection model (e.g., an LSTM autoencoder) on benign command-line activity. Feed new command lines involving removable media to the model. A high reconstruction error indicates that the command's structure and token combination are anomalous compared to learned benign patterns, suggesting a malicious or unusual operation."
            ]
          },
          {
            "description": "An archive file (e.g., .zip, .rar, .7z) is created, and the same file is then written to a removable media device by the same user or on the same host within a short time window (e.g., less than 10 minutes).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, file servers, staging servers, and temporary directories (`C:\\Users\\*\\AppData\\Local\\Temp`, `C:\\Windows\\Temp`) on application servers.",
            "action": [
              "Symbolic (Correlation Rule): Create a stateful correlation rule that triggers when two events are observed from the same host within a 10-minute window: 1) A file creation event (Sysmon Event ID 11) or process creation event (Windows Event ID 4688) for an archiving tool (e.g., `7z.exe`, `WinRAR.exe`, `tar.exe`) creating a file with an archive extension. 2) A file write event (Windows Event ID 4663) where the object name matches the archive file from the first event and the destination is a removable media device. Alert on this correlated sequence.",
              "Statistical (File Size and Time Delta): For all correlated 'stage-and-copy' sequences, analyze the file size and the time difference between archive creation and the copy action. Establish a baseline for these two metrics. A sequence where the archive size is in the top 2nd percentile (e.g., >1 GB) and the time delta is in the bottom 2nd percentile (e.g., < 30 seconds) is highly suspicious and should be prioritized for investigation.",
              "Machine Learning (Time-Series Anomaly Detection): Model the event stream (process creations, file creations, file writes) for each host as a multivariate time series. Train a time-series anomaly detection model (e.g., Isolation Forest on time-windowed feature sets) on normal operational behavior. The specific temporal pattern of 'spawn archiver -> create large archive -> write archive to USB' will be identified as a rare and anomalous sequence, distinct from benign activity."
            ]
          },
          {
            "description": "A user's activity of writing files to removable media deviates from their established 30-day baseline across multiple metrics, such as total data volume, file count, or frequency of high-risk file types, within a 24-hour period.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints with object access auditing enabled for removable storage, particularly those used by privileged users, executives, or personnel in sensitive roles (e.g., HR, Finance, R&D).",
            "action": [
              "Symbolic (High-Risk File Type Rule): For each user, count the number of files written to removable media within a 1-hour window that have high-risk extensions (e.g., `.pst`, `.ost`, `.bak`, `.sql`, `.pfx`, `.kdbx`, `.nsf`, `.mdb`). Generate an alert if this count exceeds a static threshold (e.g., more than 5 distinct high-risk files).",
              "Statistical (Multi-Metric Baselining): For each user, maintain a 30-day rolling baseline of daily removable media write activity, including: total data volume, total file count, count of unique file extensions, and average file size. For current daily activity, calculate the Z-score for each metric against the user's baseline. An alert is triggered if two or more metrics exceed a Z-score of 3, indicating a multi-faceted deviation from normal behavior.",
              "Machine Learning (Clustering/Peer Group Analysis): On a nightly basis, featurize each user's removable media activity from the past 24 hours (e.g., total volume, file count, time-of-day distribution, file type entropy). Use a clustering algorithm (e.g., DBSCAN or K-Means) to group users into behavioral cohorts (e.g., 'No Activity', 'Low-Volume Office Docs', 'Heavy Media Users'). An alert is generated when a user becomes a statistical outlier (DBSCAN) or unexpectedly moves to a higher-risk cluster (K-Means), indicating a significant change in behavior relative to their peers."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]