[
  {
    "information_requirement": "Has the adversary escalated privileges using PE injection?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1055.002",
        "name": "Portable Executable Injection",
        "evidence": [
          {
            "description": "A process creates a remote thread in another process, where the source-target process pair is atypical for the environment, especially when the target is a high-privilege process (e.g., lsass.exe, services.exe) and the source is not a standard system utility.",
            "data_sources": [
              "Sysmon Event ID 8",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, especially Privileged Access Workstations (PAWs) and Domain Controllers.",
            "action": [
              "Create a high-severity alert for any Sysmon Event ID 8 (CreateRemoteThread) where the SourceImage is not located in 'C:\\Windows\\System32\\' and the TargetImage is a critical system process such as 'lsass.exe', 'services.exe', 'wininit.exe', or 'csrss.exe'.",
              "Profile all legitimate CreateRemoteThread events to establish a baseline of normal SourceImage to TargetImage pairs. Calculate the frequency of each pair across the enterprise. Flag any pair that is statistically rare (e.g., has occurred fewer than 5 times in 90 days or falls below the 1st percentile of frequency) for manual review.",
              "Train a classification model (e.g., Random Forest, Gradient Boosting) on Sysmon Event ID 8 features, including SourceImage path, TargetImage path, user context, and the reputation of the StartFunction address. Use the model to assign a risk score to each remote thread creation event, flagging high-score events as likely PE injection."
            ]
          },
          {
            "description": "A process is created from an executable file whose SHA256 hash matches a known indicator of compromise (IOC) associated with PE injection tools, malware droppers, or loaders.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged Access Workstations (PAWs), Critical Application Servers, general user endpoints.",
            "action": [
              "Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) where the executable's file hash matches a list of known malicious hashes from a threat intelligence feed, specifically looking for hashes tagged as 'injector', 'loader', or 'Cobalt Strike'.",
              "For newly created processes not matching known threats, calculate the prevalence of their file hash across the environment. Generate a medium-priority alert for hashes seen on a very small percentage of endpoints (e.g., < 0.1%) that are also executing from uncommon or user-writable directories like 'C:\\Users\\Public\\', 'C:\\Temp\\', or '%APPDATA%'.",
              "Implement a machine learning classifier trained on process execution features (file path entropy, parent process name, user context, command-line arguments) to predict if a newly created process is malicious. Elevate the priority if a process flagged by the model is observed accessing a high-privilege process like lsass.exe (Sysmon Event ID 10)."
            ]
          },
          {
            "description": "A process is executed with command-line arguments indicative of process injection (e.g., specifying a target PID), or a parent-child process relationship is observed that is anomalous for the environment (e.g., a non-interactive service spawning an interactive shell).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers.",
            "action": [
              "Scan command-line arguments from process creation logs (Windows Event ID 4688, Sysmon Event ID 1) using regular expressions to find patterns indicative of injection, such as specifying a target Process ID (e.g., '--pid [0-9]+', '/pid:[0-9]+') or the use of 'rundll32.exe' to execute a function from a DLL in a non-standard directory.",
              "Establish a baseline of all parent-child process relationships and calculate the frequency of each pair. Alert on statistically rare relationships (e.g., in the bottom 1st percentile of frequency), especially when a non-interactive parent (e.g., 'services.exe') spawns an interactive shell ('cmd.exe', 'powershell.exe') or a reconnaissance tool ('whoami.exe', 'net.exe').",
              "Use a sequence analysis model (e.g., an LSTM) to learn normal sequences of child processes spawned by a common parent. Flag sequences that deviate significantly from learned benign behaviors, such as 'explorer.exe' spawning 'powershell.exe' which then spawns 'net.exe', as a potential post-injection discovery chain."
            ]
          },
          {
            "description": "A core system process (e.g., 'lsass.exe', 'services.exe', 'wininit.exe') initiates an outbound network connection or creates a child process, which is a deviation from its established, highly-constrained behavioral baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls/Gateways), Critical System Servers (e.g., Domain Controllers).",
            "action": [
              "Create a strict 'deny-by-default' rule that triggers a critical alert if a core system process ('lsass.exe', 'csrss.exe', 'wininit.exe', 'winlogon.exe') is observed as the source of an outbound network connection (Sysmon Event ID 3) or as the parent of any child process (Windows Event ID 4688, Sysmon Event ID 1).",
              "For critical system processes that may have legitimate network traffic (e.g., 'svchost.exe'), baseline normal network destinations and data volumes. Use a percentile-based threshold to alert on outliers, such as a connection to a destination IP with a reputation score in the bottom 5th percentile or a data transfer volume exceeding the 99th percentile of the process's historical activity.",
              "Employ an anomaly detection model like an Isolation Forest on a combined feature set of process and network data (process name, destination port, protocol, bytes sent). Train the model on known-good behavior for critical processes and flag any data point identified as an anomaly as a potential injection event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary using PE injection to evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1055.002",
        "name": "Portable Executable Injection",
        "evidence": [
          {
            "description": "A legitimate, trusted process (e.g., 'explorer.exe', 'svchost.exe', 'notepad.exe') initiates a network connection to a destination IP address or domain that is a known IOC, is newly registered, or has other suspicious characteristics such as a high-entropy name.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, Web Proxies, Host-based network sensors.",
            "action": [
              "Join network connection logs (Sysmon Event ID 3, Zeek conn.log) with DNS logs (Zeek dns.log) and threat intelligence feeds. Generate a high-priority alert if a common trusted process not typically associated with user browsing (e.g., 'svchost.exe', 'notepad.exe') connects to a known malicious IP or domain.",
              "For each trusted process, profile its normal destination domains. Alert if a process communicates with a domain registered within the last 30 days (from WHOIS data or passive DNS) or a domain with a calculated Shannon entropy score greater than 3.5, suggesting it may be algorithmically generated.",
              "Use a time-series anomaly detection model (e.g., SARIMA, Prophet) to monitor the volume of data sent by trusted processes to low-reputation domains. A sudden spike in data transfer that deviates significantly from the forecast indicates potential C2 or exfiltration from an injected process."
            ]
          },
          {
            "description": "A legitimate, trusted process that does not normally manage other processes (e.g., 'WINWORD.EXE', 'AcroRd32.exe') spawns a child process, especially a command-line interpreter or a living-off-the-land binary (LOLBin).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Virtual Desktop Infrastructure (VDI).",
            "action": [
              "Create a specific alert rule for any instance where a trusted, non-shell process (e.g., 'WINWORD.EXE', 'explorer.exe', 'outlook.exe') spawns a command-line interpreter ('cmd.exe', 'powershell.exe') or a known living-off-the-land binary ('net.exe', 'whoami.exe', 'certutil.exe').",
              "Calculate the Shannon entropy of command-line arguments for child processes spawned by trusted parents. A high entropy score for a PowerShell command spawned from 'WINWORD.EXE' suggests obfuscation. Alert when the calculated entropy exceeds a dynamically calculated baseline threshold (e.g., the 95th percentile for that parent-child pair).",
              "Train a sequence-to-sequence (Seq2Seq) model or a transformer-based model on legitimate command-line argument patterns for common processes like 'powershell.exe'. Use this model to flag command lines that are grammatically unusual or contain argument combinations that do not conform to learned benign patterns, indicating potential abuse."
            ]
          },
          {
            "description": "A legitimate process exhibits network patterns characteristic of command-and-control (C2) communication, such as periodic beaconing with low jitter, large data transfers to unusual destinations, or the use of non-standard TLS/SSL certificates.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Correlated Host Logs.",
            "action": [
              "Monitor Zeek ssl.log and x509.log for trusted processes (identified via Sysmon Event ID 3) initiating TLS connections that use self-signed certificates or where the certificate's subject common name (CN) does not match the server name indication (SNI), especially to non-corporate or non-well-known domains.",
              "For each source host and process pair, analyze the time delta between connections to the same destination. A low standard deviation of these time deltas (e.g., < 2 seconds) indicates periodic, machine-generated beaconing. Correlate this with the prevalence of the connection's JA3/JA3S hash; a hash that is rare (<1% prevalence) for that process type is highly suspicious.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to network connection metadata (duration, bytes sent, destination port, protocol, JA3 hash) for each common process. Investigate outlier clusters of activity that are distinct from the large, central cluster of benign behavior, as these represent anomalous network patterns indicative of injection."
            ]
          },
          {
            "description": "A sequence of events is observed on a host where a short-lived process, often spawned from a document or browser, executes and terminates, immediately followed by a persistent, legitimate process exhibiting new, anomalous network or process behavior.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Email Gateway Servers, Web Proxy Servers.",
            "action": [
              "Hunt for the specific correlated sequence: 1) A process is spawned from an email client or browser (e.g., ParentImage is 'outlook.exe'). 2) This process downloads a file (Zeek http.log, files.log) and terminates within 60 seconds (Sysmon Event ID 1). 3) Within 2 minutes on the same host, a legitimate process like 'explorer.exe' begins beaconing (Zeek conn.log) to a new, low-reputation domain. Alert on this sequence.",
              "On a per-host basis, create a time-series of short-lived process creations (lifetime < 60 seconds). Use change point detection to identify a sudden spike in the rate of these events. If a change point is detected, analyze subsequent network and process activity on that host for statistically significant deviations from its established baseline.",
              "Use a Hidden Markov Model (HMM) where the hidden states are 'Benign', 'Dropper Active', and 'Injected'. Observed events are process creations, network connections, and file modifications. Train the model on labeled attack scenarios to learn transition probabilities, then apply it to real-time event streams from each host to classify its current threat state."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]