[
  {
    "information_requirement": "Is an adversary using process hollowing to execute malicious code under the guise of a legitimate process? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1055.012",
        "name": "Process Hollowing",
        "evidence": [
          {
            "description": "A Windows process creation event (Windows Event ID 4688 or Sysmon Event ID 1) shows a typically trusted system process (e.g., svchost.exe, explorer.exe) being created by a parent process that is not its expected creator (e.g., services.exe for svchost.exe). Anomalous parents often include Microsoft Office applications, script interpreters, or binaries in user-writable locations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User Workstations, Member Servers",
            "action": [
              "Using Windows Event ID 4688 or Sysmon Event ID 1 data, create and maintain a rule that defines known-good parent-child process relationships for critical system binaries (e.g., Parent: 'services.exe', Child: 'svchost.exe'). Trigger a high-severity alert for any new process creation event that violates this established whitelist.",
              "Analyze parent-child process pairs from process creation logs across the environment. For each unique pair, calculate its frequency of occurrence over a 30-day baseline. Flag any pair whose frequency falls below the 1st percentile ($$ P(pair) < P_{1} $$), indicating a statistically rare and potentially suspicious event.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) on features extracted from process creation logs, including parent process name, child process name, and parent process path. The model will establish a baseline of normal process creation behavior. Score new events in real-time; events with high anomaly scores represent significant deviations from the norm and warrant investigation."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688 or Sysmon Event ID 1) is followed by a significant time delay before the process initiates its first network connection (Zeek conn.log), creates a child process (Windows Event ID 4688), or loads its first module (Sysmon Event ID 7), suggesting it was created in a suspended state for memory manipulation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 7",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Application Servers, Network Egress Points",
            "action": [
              "For a watchlist of commonly hollowed processes (e.g., 'svchost.exe', 'notepad.exe'), define a static time threshold (e.g., > 5 seconds) for the delta between its creation time (Event ID 4688) and its first subsequent activity (e.g., network connection, child process). Trigger an alert if this threshold is exceeded.",
              "For each process name, calculate the historical distribution of the time delta between process creation and its first observed activity. Flag any new process instance where this time delta exceeds a high percentile of its historical distribution, such as the 99th percentile ($$ \\Delta t > P_{99} $$), indicating an abnormally long startup delay.",
              "Implement a clustering algorithm (e.g., DBSCAN) using features such as time-to-first-action, parent process name, and process command-line entropy. Identify and label clusters that represent 'normal' and 'suspended' startup behavior. Classify new process events into these clusters and alert on any process that falls into a 'suspended' cluster."
            ]
          },
          {
            "description": "A process creation event (Sysmon Event ID 1) is followed by a process access event (Sysmon Event ID 10) from the parent to the child process with memory write access rights (e.g., `0x1F0FFF`, `0x147A`, `PROCESS_VM_WRITE`, `PROCESS_VM_OPERATION`), indicating the parent is modifying the child's memory space.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User Workstations, Member Servers",
            "action": [
              "Create a correlation rule that triggers when a Sysmon Event ID 1 (Process Creation) is immediately followed by a Sysmon Event ID 10 (Process Access) where the `SourceImage` is the parent of the `TargetImage`, and the `GrantedAccess` code includes flags for memory writing (e.g., `0x20` for `PROCESS_VM_WRITE` or `0x8` for `PROCESS_VM_OPERATION`).",
              "Profile the `GrantedAccess` codes used in Process Access events between parent-child processes. Calculate the frequency of each access code for specific parent-child pairs. Flag pairs that use statistically rare access codes, particularly those related to memory operations, that fall below a low frequency threshold (e.g., <0.1% of all access events for that pair).",
              "Train a sequence-based model (e.g., an LSTM or HMM) on sequences of Sysmon events per host. The model learns normal event sequences following a process creation. Flag sequences that contain the pattern [Process Create -> Process Access (with write rights)] as anomalous, especially if the child process is a common system binary."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to evade defenses using process hollowing? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1055.012",
        "name": "Process Hollowing",
        "evidence": [
          {
            "description": "A commonly hollowed process (e.g., 'notepad.exe', 'svchost.exe') initiates a network connection (Zeek conn.log) to a destination IP or domain on a threat intelligence feed, especially when the process was spawned by an unusual parent (e.g., 'winword.exe') and the connection occurs shortly after creation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, User Workstations",
            "action": [
              "Correlate network logs (Zeek conn.log) with process creation logs (Event ID 4688/Sysmon EID 1). Trigger a high-severity alert if a process like 'svchost.exe' is created by an anomalous parent (e.g., not 'services.exe') and subsequently connects to a destination IP/domain present in a real-time threat intelligence feed.",
              "For each process name, profile the Shannon entropy of destination domains queried (Zeek dns.log) and JA3/JA3S hashes observed (Zeek ssl.log) within a 5-minute window of process creation. A high entropy score ($$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$) or a connection to a statistically rare JA3S hash (e.g., <1% prevalence) indicates potential C2 activity.",
              "Develop a graph-based anomaly detection model where nodes represent processes, hosts, and destination IPs, and edges represent creation/connection events. Train the model on historical data to learn normal graph structures. Alert on the emergence of rare subgraphs, such as an Office application node creating a 'calculator.exe' node that connects to a low-reputation IP node."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688 or Sysmon Event ID 1) includes command-line arguments that match known malicious patterns, or contains highly randomized or obfuscated strings indicative of payload execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Deploy and maintain a set of YARA or regular expression rules that match known malicious command-line arguments and process names associated with process hollowing tools (e.g., Formbook, Dridex). Scan the `CommandLine` and `New Process Name` fields from Event ID 4688/Sysmon EID 1 against these rules and trigger an alert on any match.",
              "For each process creation, calculate the character entropy and the ratio of alphanumeric to non-alphanumeric characters in the command line. Establish a baseline for common processes. Flag any command line whose entropy or character ratio exceeds a statistical threshold (e.g., > 3 standard deviations from the mean for that process), suggesting obfuscation.",
              "Train a text classification model (e.g., using Word2Vec and a simple neural network) on a labeled dataset of benign and malicious command lines. The model learns to classify new command lines based on their content and structure. Deploy the model to score all process creation events in real-time and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A process that typically has no network activity (e.g., 'calculator.exe', 'mspaint.exe') is observed making an outbound network connection (Zeek conn.log), or a process with predictable network behavior ('svchost.exe') connects to a non-standard destination port or protocol.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, User Workstations, Application Servers",
            "action": [
              "Maintain a static blacklist of process names that should never initiate network connections (e.g., 'calculator.exe', 'notepad.exe'). Correlate process execution logs (Event ID 4688/Sysmon EID 1) with network connection logs (Zeek conn.log) and generate a high-severity alert for any outbound connection from a process on this list.",
              "For each process name, build a historical baseline of its network behavior, including a profile of normal destination ports, protocols, and data volume (bytes out). Alert when a new connection deviates significantly, such as using a port that falls outside the top 99.9% of historically used ports for that process, or when data volume exceeds the 99th percentile.",
              "Use an autoencoder neural network trained on features of normal network connections (e.g., process name, destination port, protocol, data volume, time of day). The model will learn a compressed representation and have low reconstruction error for normal activity. Monitor the reconstruction error for new connections; a high error indicates an anomalous pattern that deviates from the learned norm."
            ]
          },
          {
            "description": "A parent process creates a child process (Windows Event ID 4688) and then terminates (Windows Event ID 4689) within an extremely short time window (e.g., < 1 second), a pattern consistent with a dropper or loader handing off execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Implement a stateful correlation rule that looks for a sequence of [Event ID 4688 for parent] -> [Event ID 4688 for child, created by parent PID] -> [Event ID 4689 for parent PID]. Trigger an alert if the time difference between the child creation and the parent termination is less than a fixed threshold (e.g., 2 seconds).",
              "Calculate the 'parent post-spawn lifespan' for every parent-child process creation event. Group these lifespans by parent process name and calculate the distribution. Flag instances where the parent's lifespan falls into a low percentile (e.g., the 1st percentile) for its process type, indicating an abnormally fast termination after spawning a child.",
              "Train a sequence analysis model, such as a Recurrent Neural Network (RNN), on sequences of endpoint events (process creation, termination, network connections) per host. The model learns the probability of normal event sequences. Flag any sequence matching the 'create-child-then-terminate' pattern that has a low probability score and an unusually short time delta as a high-risk event."
            ]
          },
          {
            "description": "A `CreateRemoteThread` event (Sysmon Event ID 8) is detected where the source process injects a thread into a different target process, particularly when the target is a legitimate system process or a browser, a common method for evading process-based detections.",
            "data_sources": [
              "Sysmon Event ID 8",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Critical Application Servers",
            "action": [
              "Create a rule to alert on any occurrence of Sysmon Event ID 8 where the `SourceImage` and `TargetImage` are different, especially if the `TargetImage` is a common system process (e.g., 'svchost.exe', 'explorer.exe') and the `SourceImage` is not a known-good tool (like a debugger or AV).",
              "Build a baseline of normal `CreateRemoteThread` activity by profiling `(SourceImage, TargetImage)` pairs. Calculate the frequency of each pair. Alert on any pair that is statistically rare (e.g., has occurred < 5 times in the last 90 days) or involves a source process running from a non-standard location (e.g., `AppData`).",
              "Train a classification model (e.g., Random Forest) on features from Sysmon Event ID 8, including `SourceImage`, `TargetImage`, the reputation of the source/target, and whether the source process path is user-writable. The model will learn to predict if a `CreateRemoteThread` event is malicious. Score all new events and alert on those with a high probability of being malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]