[
  {
    "information_requirement": "Has the adversary attempted to discover permission groups or settings within the network? (PIR)",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1069",
        "name": "Permission Groups Discovery",
        "evidence": [
          {
            "description": "A process is created with a file hash or name matching a known discovery tool (e.g., BloodHound, SharpHound, AdFind.exe), or a common system utility (e.g., net.exe) is executed from a non-standard file path (e.g., C:\\PerfLogs\\, %APPDATA%).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, User Workstations, Endpoint Detection and Response (EDR) Platform",
            "action": [
              "Symbolic: Create and maintain a watchlist of discovery tool filenames (e.g., sharphound.exe, adfind.exe), file hashes, and code-signing certificates. Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for any matches in the ProcessName, OriginalFileName, or Hashes fields.",
              "Statistical: For common system utilities (net.exe, whoami.exe, nltest.exe), calculate the frequency of execution paths across all endpoints over a 30-day baseline. Flag any execution where the path's frequency falls below the 1st percentile, indicating an atypically rare location such as C:\\Users\\Public\\Downloads\\.",
              "Machine Learning: Train a random forest classifier on labeled historical process execution data (Sysmon Event ID 1). Use features such as parent process name (e.g., cmd.exe vs. explorer.exe), process path rarity score, command-line argument count, command-line entropy, and whether the process is signed. Use the model to score new process creations for potential malicious discovery activity."
            ]
          },
          {
            "description": "A command-line argument or PowerShell script block contains strings used for enumerating Active Directory groups, users, or access control lists, such as 'net group /domain', 'Get-ADGroupMember', or 'find-gplink'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, PowerShell Gateways, SIEM/Log Aggregation Platform",
            "action": [
              "Symbolic: Use regular expressions to search process command lines (Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104) for a watchlist of enumeration commands and cmdlets, such as 'net group', 'net localgroup', 'Get-ADGroupMember', 'Get-Acl', 'whoami /groups', and 'dsquery'.",
              "Statistical: For each user, establish a baseline of distinct discovery commands executed per day over a 30-day period. Calculate the Shannon entropy of the command set used by each user per hour. Alert if a user's hourly command entropy exceeds their 95th percentile, or if their raw count of discovery commands exceeds 3 standard deviations above their daily average.",
              "Machine Learning: Apply a time-series anomaly detection model (e.g., Seasonal-ARIMA) to the enterprise-wide count of discovery commands aggregated per 15-minute interval. Train the model on at least 90 days of data to learn normal administrative patterns. Generate an alert when the observed command volume significantly deviates from the forecasted volume, indicating an abnormal spike in discovery activity."
            ]
          },
          {
            "description": "Execution of container orchestration commands (e.g., 'kubectl auth can-i', 'docker inspect') to enumerate permissions or access controls within a containerized environment.",
            "data_sources": [
              "Windows Event ID 4688",
              "Kubernetes API Server Audit Logs",
              "Container Runtime Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Container Host Servers (Windows), Kubernetes Master Nodes, CI/CD Pipeline Servers, Cloud Provider Audit Logs",
            "action": [
              "Symbolic: Monitor process creation logs (Windows Event ID 4688) and Kubernetes audit logs for execution of commands like 'kubectl' or 'docker' with arguments matching a watchlist of enumeration commands, such as 'auth can-i', 'get rolebindings', 'describe role', and 'docker inspect'.",
              "Statistical: Establish a baseline for each user or service account of the number of distinct namespaces or containers they query per hour. Alert if an account queries a number of resources exceeding 3 standard deviations from its established baseline, or if the source IP address for these commands is outside the established list of administrative subnets.",
              "Machine Learning: Ingest Kubernetes API audit logs into an analytics platform. Use K-Means clustering to group sessions based on features like source IP, user agent, count of GET/LIST verbs, number of distinct resource types queried, and session duration. Periodically review small, isolated clusters, as they often represent anomalous or exploratory behavior distinct from typical administrative activity."
            ]
          },
          {
            "description": "A non-administrative user account generates events for enumerating privileged group memberships (e.g., 'Domain Admins', 'Enterprise Admins'), or any account performs such enumeration at a statistically unusual time.",
            "data_sources": [
              "Windows Event ID 4798",
              "Windows Event ID 4799",
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User and Entity Behavior Analytics (UEBA) Platform, SIEM Platform",
            "action": [
              "Symbolic: Create a SIEM rule that triggers when Windows Event ID 4799 (A user's local group membership was enumerated) or 4798 (A user's domain group membership was enumerated) is generated, where the 'Subject Account Name' is not in a pre-defined list of authorized administrators, and the 'Group Name' is in a watchlist of privileged groups.",
              "Statistical: For each role-based peer group (e.g., 'Help Desk', 'Developers'), create a baseline of normal enumeration activity (Event IDs 4798/4799) by hour of the day and day of the week. Generate an alert when a user performs enumeration during a time window that is anomalous for their peer group (e.g., falls in a time bucket with a historically near-zero frequency).",
              "Machine Learning: Train a One-Class SVM model on benign enumeration events (Event IDs 4798, 4799), using features like 'Subject Account Name', 'Source Hostname', 'Target Group Name', and time of day. The model will define a boundary of 'normal' behavior. Any new enumeration event that falls outside this boundary is flagged as a high-risk anomaly."
            ]
          },
          {
            "description": "A T1069 discovery event from a specific user or host is followed within a 60-minute window by a credential access (e.g., T1003) or lateral movement (e.g., T1021.002, T1550.002) event originating from the same entity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4798",
              "Windows Event ID 4799",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire Enterprise Network (via SIEM correlation), Key Lateral Movement Paths (e.g., workstation-to-server, server-to-DC), Authentication Logs",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when an alert for T1069 is generated for a user/host pair. If, within the next 60 minutes, an alert for Credential Access (e.g., LSASS memory read) or Lateral Movement (e.g., RDP logon Event ID 4624 Type 10) is observed from the same user or host, escalate the T1069 alert to a high-severity incident.",
              "Statistical: Maintain a transition matrix of ATT&CK techniques observed in historical incidents. When a T1069 alert fires for a user, increment their risk score. If a subsequent technique is observed from that user, increase the score by an amount weighted by the inverse frequency of that specific technique transition. An alert is triggered when a user's cumulative risk score crosses a dynamic threshold based on their role.",
              "Machine Learning: Model entity behavior using a graph database where nodes are users and hosts, and timed, directed edges represent ATT&CK techniques. When a T1069 event occurs, create an edge. Use a path-finding algorithm to identify chains of behavior originating from that node. Apply a trained Graph Neural Network (GNN) to classify these subgraphs (attack paths) as either benign or malicious based on the sequence, timing, and rarity of the techniques involved."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]