[
  {
    "information_requirement": "Has the adversary gained initial access using valid accounts?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful remote authentication (Logon Type 3 or 10) occurs using a username known to be part of a public or private credential breach dataset.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN gateways, OWA, RDP gateways), Domain Controllers, Cloud identity providers",
            "action": [
              "For each successful remote login (Windows Event ID 4624 with Logon Type 3 or 10), query the username against a local cache or API of known breached credentials. Generate a high-severity alert upon a match.",
              "For a user on a breach list, calculate their baseline login failure rate (count of 4625 / (count of 4624 + 4625)). If a successful login (4624) occurs from a new ASN or geolocation and the user's short-term failure rate drops to zero, flag as a statistically significant indicator of credential stuffing success.",
              "Deploy a classification model (e.g., Logistic Regression) that scores each remote login based on features like 'is_on_breach_list', 'is_new_geolocation', 'is_new_asn', and 'time_of_day_anomaly_score'. Alert on any login with a predicted probability of being malicious above a calibrated threshold (e.g., > 0.85)."
            ]
          },
          {
            "description": "A single source IP address generates a high volume of failed authentication events (Logon Type 3 or 10) across numerous distinct user accounts within a short time frame, indicative of a password spraying attack.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN gateways, OWA, RDP gateways), Domain Controllers",
            "action": [
              "Create a rule that triggers when a single source IP generates failed login events (Windows Event ID 4625) for more than a static threshold of distinct usernames (e.g., > 20) within a 5-minute window.",
              "Over a rolling 10-minute window, calculate the ratio of distinct usernames in failed logins (Event ID 4625) to the distinct source IPs generating them. Generate an alert if this ratio exceeds 3 standard deviations above the long-term established baseline.",
              "Feed authentication events into a DBSCAN clustering model using features like source IP, timestamp, and a numeric representation of the username. A dense cluster of failed logins from a single IP across many different users will be identified as an anomalous cluster indicative of password spraying."
            ]
          },
          {
            "description": "A successful login by a valid account exhibits multiple concurrent anomalous properties, such as a source IP from a rare country, occurring outside of the user's typical working hours, and originating from a device not previously associated with the user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Cloud identity providers, User workstations",
            "action": [
              "Implement a stateful rule that caches the last login location and time for each user. For each new successful login, if the time elapsed and distance from the previous login location yield a physically impossible travel speed (e.g., > 600 mph), generate a critical 'impossible travel' alert.",
              "For each user, create a baseline profile of their login behavior (source ASNs, countries, hours of day, days of week). For each new login, sum deviation scores (e.g., 1 if outside normal range, 0 otherwise). A total risk score exceeding a threshold (e.g., >= 3) indicates a high-risk login.",
              "For each user, train an unsupervised anomaly detection model (e.g., Isolation Forest) on a feature vector of their historical login data. Score each new login in real-time; logins identified as significant outliers by the model should be flagged for review."
            ]
          },
          {
            "description": "A valid, non-administrative user account successfully authenticates to a critical system (e.g., domain controller, financial server) where it has no previously established history of access.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical application servers (e.g., HR, Finance), Domain Controllers, Code repositories, Infrastructure management consoles",
            "action": [
              "Define and maintain an access control list (ACL) mapping user roles to authorized critical assets. For every successful login (Windows Event ID 4624) to a host on the critical asset list, validate that the user's role is on the ACL for that asset. Alert on any violation.",
              "For each user, maintain a historical list of hosts they have successfully logged into. A successful login to a host not on that user's historical list, especially if that host is classified as 'critical', should be flagged as a 'First Time Access to Critical Asset' statistical alert.",
              "Construct a bipartite graph of users and assets from historical login data. Apply a link prediction algorithm (e.g., based on Adamic-Adar index). A login that creates a new user-to-asset link with a very low prediction score from the model is anomalous and should be alerted on."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using valid accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful remote login (Logon Type 3 or 10) originates from an IP address present on a high-fidelity threat intelligence feed of known C2 servers, TOR exit nodes, or malicious proxies.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, RDP Gateways, Firewall and proxy servers, Network egress points",
            "action": [
              "For every successful remote login (Windows Event ID 4624, Logon Type 3 or 10), query the source IP address against a subscribed threat intelligence feed of known malicious IPs. An exact match triggers a high-severity alert.",
              "Enrich all inbound source IPs with ASN and geolocation data. Calculate the historical login success rate per ASN. If a successful login originates from an ASN with a historically very low success rate (e.g., bottom 5th percentile), flag it as a statistical anomaly.",
              "Utilize a pre-trained IP reputation model that provides a maliciousness score. Score every source IP from successful remote logins and alert on any IP with a score exceeding a high-confidence threshold (e.g., > 90/100)."
            ]
          },
          {
            "description": "A new scheduled task (Windows Event ID 4698) or service (Windows Event ID 7045) is created containing a command-line that indicates obfuscation, Living-Off-the-Land binary abuse, or directs execution of a payload from a non-standard location.",
            "data_sources": [
              "Windows Event ID 4698",
              "Windows Event ID 7045",
              "Windows Event ID 4688",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Application servers, Domain Controllers",
            "action": [
              "Apply a set of regular expressions to the command-line field of new service (7045) and scheduled task (4698) creation events to detect known malicious patterns like 'powershell -enc', 'rundll32.exe javascript:', or execution from temp directories. A match generates an alert.",
              "For every new scheduled task or service, calculate the Shannon entropy of its command-line string. Compare this value to the historical distribution of entropy for all commands. A value in the top percentile (e.g., > 98th percentile) suggests obfuscation and should be flagged.",
              "Feed the command-line string from new persistence mechanisms into a fine-tuned NLP classification model trained to distinguish between benign administrative commands and malicious ones. Classifications of 'malicious' with high confidence should trigger an alert."
            ]
          },
          {
            "description": "A user or service account with no successful login activity for over 90 days suddenly authenticates successfully, especially if subsequent logins occur at regular, machine-like intervals.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Legacy application servers, HR systems",
            "action": [
              "Dynamically maintain a watchlist of accounts with a 'lastLogonTimestamp' older than 90 days. Generate a high-severity alert for any successful login event (Windows Event ID 4624) where the 'TargetUserName' is on this watchlist.",
              "After a dormant account becomes active, capture the timestamps of its next 5-10 logins. Calculate the standard deviation of the time deltas between these logins. A standard deviation near zero (e.g., < 5 seconds) is statistically indicative of an automated beacon.",
              "For each user account, model the daily login count as a time series. Use a change point detection algorithm to detect a sudden shift from a prolonged period of zero activity to non-zero activity. This 'state change' is a high-confidence anomaly."
            ]
          },
          {
            "description": "A single non-administrative user account is observed initiating multiple remote connections (Logon Type 3 or 10) from a single source workstation to numerous other distinct hosts on the network in a hub-and-spoke pattern.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4648"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Jump servers, Internal network segments",
            "action": [
              "Create a stateful rule that counts the number of distinct destination hosts a single user account logs into remotely (Type 3 or 10) from a single source workstation within one hour. If the count exceeds a threshold (e.g., > 10 hosts) and the source is not a designated management server, alert.",
              "For each user, calculate the 99th percentile of distinct hosts they connect to from their primary workstation in a 24-hour period. A daily count exceeding this personal statistical threshold indicates anomalous lateral movement.",
              "Model user-to-host logins as a directed graph. A sudden, sharp increase in a user's 'out-degree' centrality (number of outgoing connections to new hosts) compared to their own historical baseline is a strong indicator their account is being used for lateral movement."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary achieved privilege escalation using valid accounts?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A default vendor account or a designated service account is used for a successful interactive (Logon Type 2) or remote interactive (Logon Type 10) login, contrary to its non-interactive purpose.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application servers, Network appliances, Virtualization infrastructure",
            "action": [
              "Maintain a watchlist of all service account and default vendor account names. Generate a critical alert for any successful login (Windows Event ID 4624) where the 'TargetUserName' is on the watchlist AND the 'LogonType' is 2 or 10.",
              "For each account on the service account watchlist, their historical logon type should be almost exclusively Type 5 (Service). Any occurrence of a Type 2 or 10 login is a zero-frequency event and thus a high-confidence statistical anomaly that requires an alert.",
              "Use a classification model to automatically tag accounts as 'service' or 'user' based on naming conventions, description, and group memberships. Apply a strict rule-based check (alert on Logon Type 2/10) to any account classified as a service account."
            ]
          },
          {
            "description": "An event where a user account is added to a privileged group (e.g., Domain Admins) is immediately followed by a successful login event from that same user account, indicating immediate abuse of privilege.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Implement a stateful rule: IF event (4728 or 4732 adding User 'X' to a privileged group) occurs, THEN trigger a critical alert IF event (4624 for User 'X') occurs within the next 10 minutes.",
              "During approved change windows, measure the average time between a user being added to a privileged group and their next login. An instance where this time is a significant outlier on the low end (e.g., < 1st percentile), suggesting automated action, should be flagged.",
              "Model chains of administrative events using a sequence mining algorithm. Flag event sequences that are historically rare or match known attack patterns, such as [User A adds User B to Admins] -> [User B logs into DC], especially if User A is not a designated administrator."
            ]
          },
          {
            "description": "A credential dumping attempt is detected on a host (e.g., a non-system process accessing lsass.exe), and this is followed by the user account associated with that host being used to log in to other systems it has not previously accessed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4648"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Domain Controllers, Member servers",
            "action": [
              "Create a correlation: IF an EDR alert for credential dumping (e.g., access to 'lsass.exe') fires for User 'X' on Host 'A', THEN create a high-severity alert for any subsequent remote login (4624/4648) by User 'X' to any host other than 'A' within the next 24 hours.",
              "Upon a credential dumping alert for User 'X', monitor their account activity. If the rate of 'first time' remote logins to new hosts by User 'X' in the following hour exceeds the 99th percentile of their normal hourly rate of new host access, flag as probable credential abuse.",
              "Use a Bayesian network where a 'Credential Dump' event on a host significantly increases the conditional probability of a subsequent 'Lateral Movement' event by the user. If the posterior probability of lateral movement crosses a threshold after observing the evidence, generate an alert."
            ]
          },
          {
            "description": "An unusually high number of distinct user accounts successfully perform interactive or remote interactive logins to a single host that is not a designated multi-user server (e.g., a standard user workstation).",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Member servers",
            "action": [
              "Maintain a list of designated multi-user hosts (e.g., terminal servers). For any host NOT on this list, trigger an alert if the count of distinct users with successful logins (Event ID 4624) exceeds a low threshold (e.g., > 3 users) within a 24-hour window.",
              "For each host, establish a baseline profile of the number of distinct daily users. Use a modified Z-score to account for non-normal distributions. If a host's daily distinct user count is more than 3.5 median absolute deviations from its median, flag it as anomalous.",
              "Periodically run a clustering algorithm (e.g., K-Means) on all hosts using features like 'distinct_user_login_count' and 'total_login_count'. If a host that has consistently belonged to a 'single-user workstation' cluster suddenly moves to a 'multi-user server' cluster, flag this state change."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using valid accounts?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A process is created (Windows Event ID 4688) under a valid user's context, and the SHA256 or MD5 hash of the process executable matches an entry in a threat intelligence database of known malware.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Servers",
            "action": [
              "For every process creation event (Windows Event ID 4688) where the executable hash is logged, perform a lookup against a threat intelligence database of known malware hashes. An exact match triggers a critical alert.",
              "Maintain a frequency count of all executable hashes seen across the environment. A hash that is globally rare (prevalence < 0.01%) and is not signed by a trusted publisher is statistically suspicious and should be flagged for sandbox analysis.",
              "For new or rare hashes, submit the hash to a static analysis machine learning model (e.g., a gradient boosting model trained on PE file features) to get a maliciousness score. High scores should be alerted on."
            ]
          },
          {
            "description": "A legitimate, signed Windows binary (e.g., certutil.exe, rundll32.exe) is executed with a command-line structure and arguments that are strongly indicative of malicious activity, such as downloading remote files or executing scriptlets.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Servers",
            "action": [
              "For every process creation event (4688), match the command line against a library of regular expressions designed to detect known Living-Off-the-Land Binaries and Scripts (LOLBAS) abuse patterns. A match triggers a high-severity alert.",
              "For high-risk system utilities (powershell.exe, mshta.exe), parse and baseline the frequency of command-line switches used. The use of a historically rare switch or combination of switches (e.g., 'powershell -w hidden -enc') for that binary is a statistical anomaly.",
              "Feed full command-line strings into a character-level Convolutional Neural Network (CNN) trained on a massive dataset of benign and malicious commands to classify novel command lines as malicious based on subtle structural and token-based patterns."
            ]
          },
          {
            "description": "Network connections originating from a process under a valid user account exhibit C2 characteristics, such as periodic connections with low-variance intervals (beaconing), high entropy in the DNS query name, or communication with a newly registered domain.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS servers, User workstations",
            "action": [
              "For DNS requests to domains with a 'creation_date' of less than 30 days (from enriched WHOIS data), correlate the source IP from 'dns.log' back to the process that initiated the connection. Alert on non-browser processes contacting newly registered domains.",
              "For each source-destination pair in 'conn.log', calculate the standard deviation of the inter-arrival time between connections. A very low standard deviation indicates machine-like beaconing. Additionally, calculate the entropy of DNS query names in 'dns.log' to detect DGA.",
              "Create a multivariate time series from a host's network traffic ('bytes_out', 'bytes_in', 'connection_count' per minute). Use an LSTM-based autoencoder to learn the normal network behavior. Flag time windows with a high reconstruction error as anomalous C2-like activity."
            ]
          },
          {
            "description": "A valid service account, which should only generate non-interactive logins, is used for an interactive or remote interactive login, allowing an adversary to masquerade their interactive activity as a legitimate automated process.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application Servers",
            "action": [
              "Maintain a watchlist of service account names. Trigger a critical alert for any successful login (Windows Event ID 4624) where the 'TargetUserName' is on the watchlist AND the 'LogonType' is 2 (Interactive) or 10 (RemoteInteractive).",
              "For each account on the service account watchlist, the historical probability of Logon Type 2 or 10 is effectively zero. Any observed login of these types is a zero-frequency event and a high-confidence statistical anomaly that requires an immediate alert.",
              "Use an unsupervised anomaly detector (e.g., Isolation Forest) trained on a feature vector for each account's logins (LogonType, source_hostname, time_of_day). An interactive login for a service account will be a severe deviation from its learned behavior and will be flagged."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary gained initial access to the network via external remote services?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful login to an external remote service (e.g., VPN, Citrix) originates from a source IP address present on a threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Network Gateway, SIEM",
            "action": [
              "Symbolic: Join successful remote authentication events (Windows Event ID 4624 on RADIUS/VPN servers) with network connection logs (Zeek conn.log) on timestamp and IP addresses. Generate a high-severity alert if the source IP address of the successful login matches an IP address from a high-confidence threat intelligence feed of known C2, proxy, or TOR exit nodes.",
              "Statistical: For each successful external login, enrich the source IP with ASN and geolocation data. Calculate the historical frequency of logins from that specific ASN for the entire organization. Flag logins from ASNs that fall below the 5th percentile of frequency (i.e., are extremely rare for the organization) for further review, as this may indicate an unusual origin even if not on a known-bad list.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) on features of login events, including IP reputation score, ASN, country, time of day, and user role. Use the model to classify each new external login as 'benign' or 'suspicious', alerting on high-probability suspicious events."
            ]
          },
          {
            "description": "A successful login to an external remote service deviates from the user's established baseline across two or more behavioral dimensions simultaneously (e.g., time, location, device).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, User Workstations, SIEM",
            "action": [
              "Symbolic: For each successful external login, check for concurrent alerts for the same user within the last 24 hours, such as 'impossible travel' or 'credential stuffing' alerts. A confluence of these symbolic alerts with an external login significantly increases the confidence of a compromise and should trigger a high-priority investigation.",
              "Statistical: For each user, establish a 90-day baseline of login behavior including typical login hours, source countries/ASNs, and session durations using percentiles. For each new login, flag deviations where the login time is outside the user's typical 5th-95th percentile range or the source country is new for the user. An alert is generated if two or more of these statistical anomalies occur for a single login event.",
              "Machine Learning: Implement an unsupervised learning model (e.g., Isolation Forest) for each user, trained on a feature set of their historical login events (e.g., time-of-day, day-of-week, source ASN). Score each new login for its anomaly score. Logins identified as significant outliers by the model should be flagged for analyst review as a potential account compromise."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using external remote services?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A user account, flagged as either a service account, a privileged account, or dormant for over 90 days, successfully authenticates to an external remote service for the first time.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Domain Controllers, SIEM",
            "action": [
              "Symbolic: Maintain an explicit deny-list of service accounts and privileged accounts that are forbidden from using external remote access services. Trigger a critical alert on any successful remote login (Windows Event ID 4624 with Logon Type 10) by an account on this list.",
              "Statistical: For all user accounts, maintain a list of accounts that have not had a successful remote login in the past 90 days. Generate a medium-severity alert if an account from this 'dormant remote access' list successfully authenticates from an external IP address for the first time.",
              "Machine Learning: Classify user accounts into roles (e.g., 'Admin', 'Developer', 'Service Account') based on Active Directory group memberships. Train a model to predict the probability of a given role using remote access. Generate an alert when a user from a low-probability role (e.g., 'Service Account') successfully authenticates remotely."
            ]
          },
          {
            "description": "A remote access session, identified by correlating logon (Windows Event ID 4624) and logoff (Windows Event ID 4634) events, exhibits non-human characteristics such as a fixed, repeating connection interval (beaconing) or an abnormally long duration.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4634",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Network Gateway, SIEM",
            "action": [
              "Symbolic: Query for remote access sessions (by correlating logon/logoff events or using Zeek conn.log durations) with exceptionally long durations (e.g., > 48 hours) or that reconnect with a precise, repeating interval (e.g., every 3600 +/- 5 seconds), which is indicative of automated beaconing.",
              "Statistical: For each user, calculate the mean and standard deviation of their remote session durations and the time between sessions over a 90-day period. Alert when a new session's duration or the time since the last login falls more than 3 standard deviations from the user's established baseline.",
              "Machine Learning: Apply a change-point detection algorithm to the time series of a user's remote connection frequency and duration. An alert is generated if the model detects a statistically significant shift from a sporadic, human-driven pattern to a regular, periodic one, suggesting the account is being used for automated persistence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has an adversary compromised a user's corporate account access by performing a SIM swap? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful user authentication to a corporate service (e.g., VPN, Azure AD) occurs within a 4-hour window following an MDM log that indicates a SIM card change for the same user account. A SIM card change is identified by a log entry showing a new International Mobile Subscriber Identity (IMSI), a new Integrated Circuit Card Identifier (ICCID), a 'SIM Not Present' status, or a device unenrollment event. The subsequent authentication is considered anomalous if it exhibits at least two of the following characteristics when compared against the user's 90-day behavioral baseline: 1) The source IP address geolocates to a country or Autonomous System Number (ASN) from which the user has never authenticated. 2) The login timestamp is in the bottom 5th percentile of the user's typical login hours. 3) The Jaccard similarity between the login's user-agent string and the user's set of historical user-agents is below 0.5.",
            "data_sources": [
              "MDM logs (IMSI/ICCID changes, SIM status, device compliance/enrollment status)",
              "Windows Event ID 4624",
              "Azure AD SignInLogs",
              "VPN authentication logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) Platform, Corporate Authentication Servers (e.g., Active Directory), Cloud Identity Providers (e.g., Azure AD, Okta), VPN Concentrators, and Network Egress Points/Internet Gateways",
            "action": [
              "Create a SIEM correlation rule that joins MDM logs with authentication logs (Windows Event ID 4624, Azure AD SignInLogs, VPN logs) on the user identity. Trigger a high-severity alert if an MDM log event for a user indicates a SIM change (e.g., event code for 'IMSI changed', 'ICCID changed', 'SIM removed', or 'Device Unenrolled') and is followed within 4 hours by a successful authentication log for the same user where the source IP address is present on a threat intelligence feed of known anonymizing proxies or Tor exit nodes.",
              "For each user, compute a 90-day rolling baseline of authentication behavior from VPN, Windows, and Azure AD logs. The baseline must include: (a) a set of all historical source countries and ASNs, (b) a frequency distribution of login hour-of-day, and (c) a set of all historical user-agent strings. For each new login, calculate a risk score. Add points for deviations: +3 for a new country, +2 for a new ASN, +2 for a login hour in the least frequent 5% of the user's distribution, +1 for a user-agent not in the baseline set. Generate a medium-severity alert if the cumulative score for a single login event exceeds 4. Escalate to critical if this alert occurs within 4 hours of a confirmed MDM SIM-change event for that user.",
              "For each user, develop an anomaly detection model using an Isolation Forest algorithm. For each login event, construct a feature vector including: sine/cosine transformations of the login hour and day of week to capture cyclical patterns, one-hot encoded categorical features for source country and ASN (from the user's top 10 most frequent), and a TF-IDF vectorization of the user-agent string. Train the model on the user's last 90 days of authentication data. Score each new login in real-time. An anomaly score in the top 1st percentile for that user, which also occurs within 4 hours of an MDM-logged SIM change event, generates a high-confidence alert for account takeover and triggers an automated response to suspend the account and invalidate active sessions."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]