[
  {
    "information_requirement": "Is an adversary actively enumerating domain accounts or groups?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1087.002",
        "name": "Domain Account",
        "evidence": [
          {
            "description": "Execution of a process where the process name (e.g., sharphound.exe, adrecon.exe) or command-line arguments match a known Active Directory enumeration tool or its unique parameters.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged User Workstations",
            "action": [
              "Create a SIEM detection rule to monitor for new process creation events (Windows Event ID 4688). Alert if the 'NewProcessName' field matches a watchlist of known AD enumeration tools (e.g., 'sharphound.exe', 'adrecon.exe', 'bloodhound-python') or if the 'CommandLine' field contains unique arguments associated with those tools.",
              "For all process creation events, calculate the entropy of the command-line arguments. Establish a baseline of command-line entropy for common administrative processes. Alert when a process, especially from a non-standard parent (e.g., w3wp.exe, powershell.exe), exhibits command-line entropy exceeding the 99th percentile, which may indicate obfuscated or packed enumeration scripts.",
              "Train a classification model (e.g., Random Forest, Gradient Boosting) using features from process creation events (Windows Event ID 4688), such as parent process name, user context, command-line argument length, and the presence of enumeration-related keywords. Deploy the model to score new process events in real-time and alert on those classified as high-probability malicious enumeration."
            ]
          },
          {
            "description": "Execution of native utilities (e.g., 'net.exe', 'dsquery.exe', 'nltest.exe', 'powershell.exe') with command-line arguments or script content specific to domain-level user, group, or trust enumeration (e.g., 'net user /domain', 'Get-ADUser -Filter *').",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, All Endpoint Devices",
            "action": [
              "Create a SIEM rule to monitor process creation (Windows Event ID 4688) for 'net.exe', 'dsquery.exe', or 'nltest.exe'. Alert when the command line contains enumeration strings like '/domain', '\"Domain Admins\"', 'dsquery user', or '/dclist'. Assign a higher severity if the parent process is non-interactive (e.g., 'w3wp.exe', 'sqlservr.exe') or a common living-off-the-land binary.",
              "For each source host, establish a 30-day rolling baseline of the execution frequency for 'net.exe', 'dsquery.exe', and 'nltest.exe'. Using a percentile-based threshold (e.g., 95th percentile), alert when a host's execution count for these commands significantly exceeds its own historical baseline or the baseline of its peer group (e.g., other developer workstations).",
              "Employ a clustering algorithm (e.g., DBSCAN) on features extracted from process execution events, including the user, host, parent process, command executed, and time of day. Identify and investigate clusters of command executions that deviate from normal administrative behavior, as these may represent an adversary's discovery workflow."
            ]
          },
          {
            "description": "A decoded PowerShell script block (Windows Event ID 4104) contains cmdlets, functions, or .NET API calls associated with Active Directory enumeration, such as 'Get-ADUser', 'Get-ADGroupMember', functions from the PowerView framework, or 'System.DirectoryServices.DirectorySearcher'.",
            "data_sources": [
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged User Workstations, Exchange Servers",
            "action": [
              "Create a SIEM detection rule to scan the 'ScriptBlockText' field of Windows Event ID 4104. Alert on regular expression matches for AD enumeration cmdlets ('Get-ADUser', 'Get-ADGroup'), PowerView functions ('Get-NetUser', 'Find-LocalAdminAccess'), or patterns indicating broad queries like '-Filter *' or '.Properties *'.",
              "For each decoded script block, calculate the character entropy and the ratio of alphanumeric to special characters. Establish a baseline for these metrics across all script blocks in the environment. Alert on scripts with high entropy scores or unusual character ratios (e.g., exceeding 3 standard deviations from the mean), which can indicate obfuscation techniques.",
              "Train and deploy a time-series forecasting model (e.g., ARIMA, Prophet) on the volume of PowerShell enumeration events per user. Alert when the observed volume of these specific events in a given time window significantly exceeds the predicted volume, indicating a burst of suspicious discovery activity from a single account."
            ]
          },
          {
            "description": "A single source IP address generates a statistically anomalous volume of LDAP (TCP/389, TCP/636) or SAMR (TCP/445) traffic to a Domain Controller, characterized by a high rate of queries, a high volume of data transferred, or an unusually large number of distinct objects being queried in a short time frame.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dce_rpc.log",
              "Zeek ldap.log",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Core Network Switches monitoring traffic to/from DCs",
            "action": [
              "On Domain Controllers, enable Directory Service Access auditing and configure a SACL on sensitive AD groups like 'Domain Admins'. Create a SIEM rule to alert when a non-administrative account triggers Windows Event ID 4662 by attempting to read the 'Member' attribute of a protected group.",
              "Using Zeek logs, baseline the number of unique LDAP queries and total bytes transferred (`orig_bytes`, `resp_bytes` in conn.log) per source IP to Domain Controllers over a 1-hour window. Alert when a source IP exceeds the 99th percentile of either metric. Correlate with Windows Event ID 4662 counts per user, alerting if the number of objects accessed in a 5-minute window is more than 3 standard deviations above the user's baseline.",
              "Apply an unsupervised anomaly detection algorithm (e.g., Isolation Forest) to a feature set derived from Zeek logs, including connection duration, bytes transferred, LDAP operation type, and number of entries returned per query. Train the model on normal traffic patterns to Domain Controllers to flag connections that are strong outliers, potentially representing enumeration tools like BloodHound or SharpHound."
            ]
          },
          {
            "description": "One or more Kerberos Ticket Granting Service (TGS-REQ) requests (Windows Event ID 4769) are observed from a client using a weak encryption type (RC4-HMAC) for a Service Principal Name (SPN) associated with a user account, or a single client requests tickets for an anomalously high number of distinct SPNs in a short time.",
            "data_sources": [
              "Windows Event ID 4769"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Create a SIEM rule to monitor Windows Event ID 4769. Generate a high-severity alert if the 'Ticket Encryption Type' is '0x17' (RC4-HMAC) and the 'Service Name' does not end in '$' (i.e., is a user account, not a machine account). This is a high-fidelity indicator of a Kerberoasting attempt.",
              "From Windows Event ID 4769 logs, aggregate by 'Client Address' over a 5-minute window. For each client, count the number of distinct 'Service Names' requested. Alert when a client's distinct SPN request count exceeds the 98th percentile for all clients in the environment, indicating a potential reconnaissance scan.",
              "Train a one-class SVM (Support Vector Machine) on features from normal Kerberos TGS requests (Event ID 4769), including client subnet, time of day, and requested service category (e.g., web, sql, file). Deploy the model to identify and alert on new requests that fall outside the learned 'normal' boundary, which are likely part of an enumeration or Kerberoasting attack."
            ]
          },
          {
            "description": "A correlated sequence of process execution or PowerShell events from a single source host or user demonstrates a logical progression of domain discovery, such as enumerating privileged groups followed by enumerating the members of those groups within a short time window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM / Log Aggregator Platform, Domain Controllers, Member Servers",
            "action": [
              "Define a stateful SIEM correlation rule that triggers when Event A (e.g., process creation of 'net.exe' with command line containing 'group \"Domain Admins\" /domain') is followed within 15 minutes by Event B (e.g., PowerShell script block containing 'Get-ADGroupMember -Identity \"Domain Admins\"') from the same source host and user.",
              "Develop a 'Discovery Activity Score' by assigning weighted points to different discovery commands (e.g., 'net user /domain'=1, 'Get-ADGroupMember'=2, 'Find-DomainTrusts'=3). Sum these scores per user over a 1-hour window. Use a moving average and standard deviation to alert when a user's score spikes anomalously compared to their own historical activity.",
              "Utilize a sequence mining algorithm (e.g., GSP, PrefixSpan) on command-line and PowerShell logs (Event IDs 4688, 4104) to identify statistically rare sequences of commands. Flag sequences that are infrequent across the enterprise but are known to be associated with adversary discovery TTPs, providing context beyond single-event alerts."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]