[
  {
    "information_requirement": "Is the adversary using multi-hop proxy chains for command and control? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1090.003",
        "name": "Multi-hop Proxy",
        "evidence": [
          {
            "description": "An outbound TCP/UDP connection from an internal asset to an external IP address or domain known to be associated with Tor, public proxies, or adversary-controlled proxy infrastructure based on threat intelligence.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Centralized DNS Resolvers, Endpoint Devices",
            "action": [
              "Symbolic: Correlate the destination IP address (id.resp_h) from Zeek conn.log and the resolved IP from Zeek dns.log against a threat intelligence feed of known Tor exit nodes, public proxies, and C2 servers. Generate an alert for any match.",
              "Statistical: For all outbound connections, calculate the historical rarity of the destination Autonomous System Number (ASN) and country. Flag connections where the destination ASN is in the bottom 5th percentile of observed ASNs for the organization or originates from a country with no business nexus, suggesting communication with an unusual service provider.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled network flows, using features such as destination port, total bytes transferred, connection duration, destination ASN/country rarity, and threat intelligence matches. Use the model to score and classify new outbound connections in real-time as 'benign', 'suspicious-proxy', or 'malicious-proxy'."
            ]
          },
          {
            "description": "An observed TLS handshake where the JA3 or JA3S hash matches a known fingerprint for proxy or C2 tooling, or where the presented X.509 certificate is self-signed, has an abnormally short validity period (e.g., less than 90 days), or contains high-entropy subject/issuer fields.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal Server Segments, DMZ",
            "action": [
              "Symbolic: Scan Zeek ssl.log for JA3/JA3S hashes that match a watchlist of fingerprints for tools like Tor, Psiphon, or Cobalt Strike. Also, check x509.log for certificates where the issuer and subject are identical (self-signed) or where the certificate validity period is less than 90 days. Alert on any match.",
              "Statistical: For each new X.509 certificate observed in x509.log, calculate the Shannon entropy of the 'certificate.subject' and 'certificate.issuer' common name fields. Flag certificates where the entropy exceeds a threshold of 3.5, which is indicative of algorithmically generated names used by C2 frameworks.",
              "Machine Learning: Develop a one-class SVM or autoencoder model trained on features from legitimate TLS sessions (JA3, cipher suites, certificate details). Use the model to identify anomalous TLS handshakes that deviate from the established baseline, flagging them as potential C2 or proxy communication."
            ]
          },
          {
            "description": "An internal host, particularly in a DMZ or server segment, exhibiting a traffic pattern indicative of pivoting: a low count of unique external source IPs (fan-in < 3) establishing connections to it, followed by connections from it to a high count of unique internal destination IPs (fan-out > 10) within a 60-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Demilitarized Zone (DMZ), User Workstation Subnets, Critical Server VLANs",
            "action": [
              "Symbolic: Create a rule that, for each internal host IP, counts distinct external source IPs and distinct internal destination IPs over a sliding 1-hour window using conn.log. Trigger an alert if the external source count is less than 3 and the internal destination count is greater than 10.",
              "Statistical: For every host, calculate a 'pivot score' as $$ (1 + \text{outbound_destinations}) / (1 + \text{inbound_sources}) $$. Establish a baseline distribution of this score across all assets. Alert on hosts whose pivot score exceeds the 99th percentile of the population, indicating anomalous fan-out behavior.",
              "Machine Learning: Construct a network graph where hosts are nodes and connections are edges weighted by data volume. Use a community detection algorithm (e.g., Louvain) to identify normal traffic clusters. Then, use an anomaly detection algorithm (e.g., Isolation Forest) on graph-based features like 'betweenness centrality' and 'degree' to identify hosts acting as anomalous bridges between communities."
            ]
          },
          {
            "description": "A sequence of outbound connections from a single internal source to a single external destination, characterized by low jitter (inter-arrival time standard deviation < 2 seconds), low data volume variance, and a destination IP/domain not on an organizational allowlist.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstation Subnets, Server Subnets, Network Egress Points",
            "action": [
              "Symbolic: Identify hosts making outbound connections to non-categorized or newly observed domains. If a host connects to the same destination IP on a common C2 port (e.g., 443, 80, 53) more than 50 times in one hour, flag for review.",
              "Statistical: For each source-destination pair over a 24-hour period, calculate the standard deviation of the time delta between consecutive connections and the variance of the 'orig_bytes' and 'resp_bytes' fields from conn.log. Alert if the time standard deviation is less than 2 seconds and the byte variance is below a low threshold, indicating machine-like beaconing.",
              "Machine Learning: Apply a Fast Fourier Transform (FFT) to the time series of connection event counts (binned per second) for each source-destination pair. A strong, sharp peak in the resulting frequency spectrum indicates a highly periodic signal characteristic of C2 beaconing. Use the magnitude of this peak as a feature to classify traffic as beaconing or benign."
            ]
          },
          {
            "description": "Anomalous protocol usage indicative of tunneling, such as: ICMP echo request/reply packets with a payload size greater than 64 bytes; DNS queries with unusually long query strings (>250 characters) or high-entropy subdomains; or encrypted TCP traffic (e.g., SSH, TLS) to a network device like a router or switch not designated as a VPN or management endpoint.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek icmp.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Infrastructure Segments (Routers, Switches), DNS Servers, Network Egress Points",
            "action": [
              "Symbolic: Create alerts for: 1) any ICMP packet in icmp.log with a payload size greater than 64 bytes; 2) any DNS query in dns.log with a query length > 250 characters; 3) any connection in conn.log to a network infrastructure device IP on an encrypted port (e.g., 22, 443) where that device is not on an approved list of VPN/management endpoints.",
              "Statistical: For DNS traffic, calculate the Shannon entropy of the query name in dns.log. Flag queries with an entropy score > 4.0. Additionally, monitor the ratio of TXT queries to A queries per client; a ratio significantly above the 98th percentile of the organizational baseline suggests DNS abuse for C2.",
              "Machine Learning: Train an autoencoder model on feature vectors derived from legitimate protocol traffic (e.g., for DNS: query type, length, entropy; for ICMP: type, code, payload size). Use the trained model to calculate a reconstruction error for all new traffic. A high reconstruction error indicates the traffic deviates from learned normal patterns and is likely anomalous or malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]