[
  {
    "information_requirement": "Is the adversary establishing persistent access by registering malicious devices? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098.005",
        "name": "Device Registration",
        "evidence": [
          {
            "description": "A successful device registration, indicated by an HTTP 200/OK response from a known IdP registration endpoint (e.g., enterpriseregistration.windows.net, device.login.microsoftonline.com), where the source IP address is present on a threat intelligence feed or the HTTP User-Agent string in Zeek http.log matches a signature for a known malicious tool (e.g., AADInternals, BPRT).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Azure AD Audit Logs",
              "Azure AD Signin Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway (for Zeek logs), Cloud Identity Provider (IdP) consoles (e.g., Azure AD, Okta, Duo), VPN concentrators",
            "action": [
              "Correlate the source IP (`id.orig_h`) from Zeek conn.log sessions to IdP registration endpoints with a threat intelligence feed of known malicious IPs. Separately, search Zeek http.log `user_agent` fields for signatures of malicious tools like 'AADInternals' or 'BPRT'. Alert on any match.",
              "For each registration source IP, look up its Autonomous System Number (ASN) and country. Compare the frequency of this ASN/country pair against a 90-day baseline of all registration traffic. Generate an alert for registrations from any ASN/country pair that falls in the bottom 5th percentile of historical frequency.",
              "Train a classification model (e.g., XGBoost) using labeled historical registration data. Use features including: source IP geolocation, ASN, time of day (as a cyclical feature), day of week, HTTP User-Agent rarity, and whether the IP is a known TOR exit node or from a public cloud provider. Use the model to classify new registration events in real-time, alerting on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A successful device registration where the registered device name exhibits high character entropy, is inconsistent with organizational naming conventions, or fails to comply with an established regex pattern for valid names (e.g., `^ORG-[A-Z]{3}-\\d{7}$`).",
            "data_sources": [
              "Zeek http.log",
              "Azure AD Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider (IdP) audit logs (for Azure AD `OperationName: Add device`), Network decryption points for SSL/TLS inspection (for Zeek http.log visibility)",
            "action": [
              "In Azure AD Audit Logs where `OperationName` is 'Add device', or in decrypted HTTP POST bodies from Zeek http.log, apply a regular expression that negates the organizational naming convention (e.g., `(?!^ORG-[A-Z]{3}-\\d{7}$).*`). Also, search for device names matching signatures of known malicious tools. Alert on any match.",
              "For each new device registration, calculate the Shannon entropy of the device name string found in the Azure AD audit log (`targetResources[0].displayName`). Compare this value to a distribution of entropy scores from all legitimate device names created in the last 180 days. Alert if a new device name's entropy score exceeds the 95th percentile of this baseline.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to all device names, using vectorized features such as string length, character entropy, ratio of numeric to alphabetic characters, and presence of special characters. Manually review emergent clusters that do not correspond to known, legitimate naming patterns. Flag new devices that fall into these anomalous clusters for investigation."
            ]
          },
          {
            "description": "A successful device registration for a user account (e.g., Azure AD Audit Log `OperationName: Add device`) is preceded by five or more failed login attempts (e.g., Windows Event ID 4625 or Azure AD Signin Log `resultType: 50126`) for the same user within a 15-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Azure AD Signin Logs",
              "Azure AD Audit Logs",
              "Azure AD Risky Users"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory Domain Controllers for Windows Events), Cloud Identity Provider (IdP) sign-in and audit logs, VPN concentrators",
            "action": [
              "Create a stateful rule that triggers when an `Azure AD Audit Log` event with `OperationName: Add device` for a specific user principal name is observed, and is preceded by more than 5 `Azure AD Signin Log` events for the same user with `resultType: 50126` (Invalid username or password) within the previous 15 minutes.",
              "For each user, build a profile of typical registration attributes (source country, ASN, time of day) from the past 180 days. For each new registration, assign points for deviations: +3 for a new country, +2 for a new ASN, +1 for registration between 10 PM and 6 AM local time. Alert if the total risk score for an event exceeds a threshold of 4.",
              "For each user, train a one-class SVM model on feature vectors derived from their historical registration events (e.g., source IP geolocation, ASN, time of day, User-Agent). Classify each new registration event in real-time. Events classified as outliers by the model should be flagged as anomalous and investigated as a potential account compromise."
            ]
          },
          {
            "description": "The count of successful device registrations (e.g., Azure AD Audit Log `OperationName: Add device`) from a single source IP address exceeds 5 registrations across any number of users within an hour, or a single user account registers more than 2 devices within an hour.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Azure AD Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider (IdP) audit logs, Internet gateway",
            "action": [
              "Using a SIEM, create a threshold rule to count Azure AD Audit Log events with `OperationName: Add device`. Group counts by `ipAddress` and by `targetResources[0].userPrincipalName` over a 1-hour sliding window. Alert if the count per IP exceeds 5, or the count per user exceeds 2.",
              "Calculate a 30-day rolling average and standard deviation of device registration events per hour for the entire organization. Alert if the count in any given hour exceeds the rolling average by more than 3 standard deviations.",
              "Implement a time-series forecasting model (e.g., Prophet) trained on historical hourly device registration counts, accounting for weekly and daily seasonality. Continuously compare the actual registration count against the model's prediction. An actual count that exceeds the upper boundary of the model's 99% confidence interval (`yhat_upper`) should trigger an alert for an anomalous spike."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary elevating privileges or bypassing policies using a newly registered device? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098.005",
        "name": "Device Registration",
        "evidence": [
          {
            "description": "Within 24 hours of a device registration, the device's assigned internal IP address initiates an outbound connection where the destination IP (`id.resp_h` in Zeek conn.log) or the resolved domain (`query` in Zeek dns.log) matches an entry on a C2 threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway (for Zeek logs), DNS resolvers, Endpoint devices (for Windows Event Logs)",
            "action": [
              "Maintain a dynamic watchlist of internal IP addresses assigned to devices registered in the last 24 hours. Correlate this list against Zeek dns.log and conn.log. Alert if a host on the watchlist resolves a domain or connects to an IP present in a C2 threat intelligence feed.",
              "For DNS queries (`query` in Zeek dns.log) from newly registered devices, calculate the frequency of each TLD requested. Compare this to the organizational baseline TLD frequency. Flag devices whose TLD distribution shows a high percentage of requests to low-reputation TLDs (.xyz, .top, .online).",
              "For all DNS queries originating from newly registered devices, process the query string through a pre-trained DGA detection model (e.g., a Long Short-Term Memory (LSTM) network). Alert on any domain that receives a high DGA score (e.g., > 0.85), indicating it is likely algorithmically generated for C2 communications."
            ]
          },
          {
            "description": "A user operating from a newly registered device successfully accesses more than 3 distinct high-value applications (monitored via Zeek http.log) or sensitive file shares (monitored via Windows Event ID 4663) with less than 1 second between each access, indicating automated activity.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 4663",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web servers hosting sensitive applications, File servers hosting sensitive data, Internal network segments monitored by network taps",
            "action": [
              "Define a list of 'crown jewel' assets (URLs, server IPs, file share UNC paths). Create a stateful rule that tracks access from IPs of newly registered devices. Alert if an IP successfully accesses more than 3 distinct assets from this list within a 5-minute window.",
              "For each user, establish a baseline distribution of the time delays between consecutive accesses to different internal resources. After a user registers a new device, monitor their activity. Flag any session from the new device where the median time delta between resource accesses falls below the 1st percentile of that user's historical baseline.",
              "For each user, model their typical application access patterns as a first-order Markov chain, where states are applications and edges are transition probabilities. For a sequence of accesses from a new device, calculate the joint probability of that sequence occurring under the user's model. Alert if the sequence probability is exceptionally low, indicating a significant deviation from normal behavior."
            ]
          },
          {
            "description": "A user's access attempt to a resource, which was previously blocked by a Conditional Access policy (e.g., Azure AD Signin Log `conditionalAccessStatus: failure`), is now successful (`conditionalAccessStatus: success`) from a new device registered within the last 24 hours for that same user.",
            "data_sources": [
              "Zeek http.log",
              "Azure AD Signin Logs",
              "Azure AD Conditional Access Logs",
              "Azure AD Identity Protection Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider (IdP) conditional access policy logs, Web Application Firewalls (WAFs), Application-level authentication logs",
            "action": [
              "Create a rule that, for any user who registered a device in the last 24 hours, queries their Azure AD Sign-in logs for the past 90 days. Alert if a successful login (`conditionalAccessStatus: success`) to a specific application is observed from the new device, where all previous sign-in attempts by that user to that same application resulted in `conditionalAccessStatus: failure`.",
              "For each user, maintain a historical set of resources where access attempts result in failure >99% of the time. Monitor for successful access events to any resource in this 'denied set' from a newly registered device. Since the prior probability of success is near zero, any single success event is statistically significant and should be flagged for immediate review.",
              "For each user-resource pair, train a simple classification model (e.g., Naive Bayes) to predict access success or failure based on features like device compliance status, IP geolocation, and time of day. If a request from a newly registered device is predicted to fail but results in success, flag it as a high-confidence anomaly indicative of a policy bypass."
            ]
          },
          {
            "description": "An IP address associated with a newly registered device initiates connections to more than 10 unique internal hosts on common administrative or reconnaissance ports (e.g., 22, 135, 445, 3389, 5985, 5986) within a 5-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (monitored by network taps for Zeek), Endpoint devices (for Windows Event Logs), Core switches (for NetFlow/IPFIX data)",
            "action": [
              "From an IP address tagged as a newly registered device, monitor Zeek conn.log for outbound connections to internal IP ranges. Count the number of distinct destination hosts (`id.resp_h`) being connected to on ports 22, 135, 445, 3389, 5985, or 5986. Alert if this count exceeds 10 within a 5-minute sliding window.",
              "For an IP address tagged as a newly registered device, use a 1-minute sliding window to calculate the Shannon entropy of the set of unique destination IP addresses (`id.resp_h`) it connects to, based on Zeek conn.log. An entropy score that exceeds 3 standard deviations above the baseline for a typical workstation indicates network scanning activity.",
              "Create a baseline network behavior profile for a 'standard workstation' using features from Zeek conn.log aggregated per host over 5-minute intervals (e.g., protocol distribution, avg/max connections, bytes sent/received, number of unique peers). Use an anomaly detection algorithm (e.g., Isolation Forest) to score the behavior of newly registered devices against this multi-feature profile. High anomaly scores indicate behavior inconsistent with a normal endpoint."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]