[
  {
    "information_requirement": "Is the adversary collecting sensitive information via email forwarding rules?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114.003",
        "name": "Email Forwarding Rule",
        "evidence": [
          {
            "description": "An email header indicates auto-forwarding (e.g., `X-MS-Exchange-Organization-AutoForwarded: true`) to an external domain that is either present on a threat intelligence list of malicious domains or is not on a pre-approved allow-list of known business partners.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log",
              "Microsoft 365 Message Trace Logs",
              "Exchange Message Tracking Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Mail Gateway Servers, Cloud Mail Service Tenant (e.g., Microsoft 365, Google Workspace)",
            "action": [
              "From mail server logs (e.g., M365 Message Trace) or Zeek smtp.log, extract the recipient address and forwarding headers (`X-MS-Exchange-Organization-AutoForwarded`, `X-Forwarded-To`) for all outbound emails. Filter for events where forwarding is indicated. Compare the destination domain against a threat intelligence feed of known malicious domains and a curated allow-list of expected business partner domains. Generate an alert for any match to the threat feed or any forwarded-to domain not present on the allow-list.",
              "For all externally forwarded emails, extract the destination domain. Maintain a 30-day baseline of all destination forwarding domains across the organization and calculate the frequency of each. Flag any domain that appears for the first time and is the destination for forwarding rules from multiple (e.g., >2) distinct user accounts within a 24-hour period. Assign a risk score based on the rarity of the domain (inverse frequency) and the number of users forwarding to it.",
              "Develop a supervised classification model (e.g., Random Forest) to classify each forwarding event as 'benign' or 'malicious'. Train the model using features such as: destination domain TLD, domain age, ASN, IP geolocation, whether the domain is newly observed, and the reputation score of the domain from a third-party service. Generate an alert for any event classified as 'malicious' with a confidence score above a specified threshold (e.g., 0.90)."
            ]
          },
          {
            "description": "A command is executed via PowerShell or another command-line interface that creates or modifies an email inbox rule using specific parameters (`-ForwardTo`, `-ForwardingSmtpAddress`) to exfiltrate messages to an external email address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Exchange Servers (On-premise), Domain Controllers, Endpoint Devices, Cloud Mail Service Tenant (e.g., Microsoft 365, Google Workspace)",
            "action": [
              "From PowerShell script block logs (Windows Event ID 4104) and process command-line logs (Windows Event ID 4688), create a detection rule that searches for the execution of `powershell.exe` or `pwsh.exe` with command-line arguments containing cmdlets like `Set-InboxRule`, `New-InboxRule`, or `Set-Mailbox` AND parameters such as `-ForwardTo`, `-ForwardingSmtpAddress`, `-RedirectTo`, or `-ForwardAsAttachmentTo`. Trigger an immediate alert if the target address points to an external domain not on an approved partner allow-list.",
              "Establish a baseline of accounts that legitimately use mail-related PowerShell cmdlets (e.g., Exchange administrators). For each command execution event, calculate the Shannon entropy of the command-line arguments. Flag any execution by a non-privileged user or any execution with an entropy score that deviates by more than 2 standard deviations from the user's or group's historical baseline, suggesting obfuscation. Also, alert if the frequency of these commands by any single user exceeds the 99th percentile of their 30-day activity.",
              "Implement an anomaly detection model (e.g., Isolation Forest) on features extracted from command execution events. Features should include: executing user account, user's role/privileges, parent process name, time of day, day of week, and parsed command parameters (e.g., cmdlet used, presence of forwarding parameter). The model identifies executions that are statistical outliers compared to the historical norm for the user and the entire organization. An anomalous execution that creates or modifies a forwarding rule is a high-fidelity alert."
            ]
          },
          {
            "description": "A new email forwarding rule is created in a cloud mail service tenant, and the volume of forwarded emails from the associated account immediately exceeds a statistically significant threshold compared to its historical baseline of zero or near-zero.",
            "data_sources": [
              "Microsoft 365 Unified Audit Log",
              "Google Workspace Audit Logs",
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Mail Service Tenant (e.g., Microsoft 365, Google Workspace), Network Egress Points, Mail Gateway Servers",
            "action": [
              "Monitor Microsoft 365 Unified Audit Logs for `New-InboxRule` and `Set-InboxRule` operations where the `ForwardTo` or `ForwardAsAttachmentTo` parameter is populated with an external address. Correlate this audit event (by user and timestamp) with network logs (Zeek smtp.log) showing an immediate and sustained flow of forwarded emails from that user to the new address. Generate an alert on this direct temporal correlation.",
              "For each user, maintain a daily baseline of forwarded email volume using a 30-day moving average and standard deviation derived from mail server or Zeek logs. Generate an alert if a user's daily forwarded email count exceeds 3 standard deviations above their personal baseline. For users with no prior forwarding history, alert if they enable forwarding for the first time and their forwarded volume on the first day exceeds the 95th percentile of the organization's daily forwarding volume per user.",
              "For each user account, apply a time series forecasting model (e.g., SARIMA or Prophet) to the daily volume of forwarded emails. The model predicts the expected volume for the next day with a confidence interval. Generate an alert when the actual observed volume significantly exceeds the upper bound of the predicted confidence interval, indicating a statistically significant and unexpected change in forwarding behavior."
            ]
          },
          {
            "description": "A process not on an allow-list of approved applications (e.g., outlook.exe, powershell.exe) performs a write or modification action on files or registry keys known to store email client rules.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 11",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoint Devices, Virtual Desktop Infrastructure (VDI) Servers",
            "action": [
              "Using Sysmon logs, create a detection rule to alert on File Create events (Event ID 11) for files with `.rwz` or `.srs` extensions, or Registry Set events (Event ID 13) to keys under `HKCU\\Software\\Microsoft\\Office\\<version>\\Outlook\\Profiles\\`. The rule should trigger if the `Image` (process path) performing the action is NOT in a pre-defined allow-list containing `outlook.exe`, `pwsh.exe`, and other legitimate administrative tools.",
              "Profile the set of all processes that interact with email rule files and registry keys across all endpoints over a 30-day period. Maintain a frequency count of these process names. Generate an alert if a process that has never been observed or is exceptionally rare (e.g., observed on <0.1% of endpoints) performs a write or modification action on these specific assets. This highlights unusual tools being used for rule manipulation.",
              "Train a supervised classification model (e.g., Gradient Boosting Machine) to predict whether a file or registry modification related to email rules is malicious. Use features such as: the process name, parent process name, process command-line arguments, user context, and the specific file path or registry key being modified. Train the model on known benign activity and simulated malicious activity. Deploy the model to score new events in real-time and alert on modifications classified as malicious with high confidence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]