[
  {
    "information_requirement": "Is the adversary attempting to gain access to accounts via password guessing (brute-force or password spraying)?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1110.001",
        "name": "Password Guessing",
        "evidence": [
          {
            "description": "Authentication events (successful or failed) originate from a source IP address or contain a User-Agent string matching a known malicious entry on a threat intelligence feed specializing in brute-force or credential stuffing activity.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssh.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing Web Applications (e.g., OWA, SharePoint), VPN Concentrators, Network Edge Firewalls, Cloud Service Provider Portals, Domain Controllers",
            "action": [
              "Symbolic: Create a SIEM rule to continuously join the source IP address from authentication logs (Windows Event ID 4625, 4624; Zeek conn.log) and the User-Agent from web logs (Zeek http.log) against a threat intelligence feed of known brute-force sources. Generate a high-severity alert for any match.",
              "Statistical: For each external source IP, calculate the ratio of failed logins (Windows Event ID 4625) to successful logins (Windows Event ID 4624) over a 1-hour sliding window. Establish a baseline for this ratio across all external IPs. Generate an alert if the ratio for a single IP exceeds the 95th percentile of the baseline.",
              "Machine Learning: Train a classification model (e.g., logistic regression, random forest) on labeled historical login data. Features should include: IP reputation score from threat intelligence, User-Agent string rarity (calculated via frequency analysis), time of day, protocol, and country of origin. Deploy the model to score all incoming login attempts in near real-time and alert on any attempt classified as 'malicious' with a confidence score above 0.9."
            ]
          },
          {
            "description": "A single source IP address generates a high volume of failed login attempts targeting a diverse set of common or default usernames (e.g., 'admin', 'root', 'guest', 'test') within a short time frame.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Servers (RADIUS, Kerberos), Application Servers with default accounts, Network Appliances (routers, switches)",
            "action": [
              "Symbolic: Maintain a watchlist of 100+ common/default usernames. Create a SIEM rule that triggers an alert if a single source IP generates failed logins (Windows Event ID 4625) for more than 5 distinct usernames from this watchlist within a 15-minute window.",
              "Statistical: For each source IP address, calculate the Shannon entropy of the set of unique target usernames from failed login events (Windows Event ID 4625) over a 30-minute sliding window. Establish a baseline entropy value for typical user activity. Alert if the entropy for a specific source IP exceeds the 98th percentile of this baseline, indicating an unusually diverse set of targeted accounts.",
              "Machine Learning: Use a density-based clustering algorithm (e.g., DBSCAN) on authentication failure events. Use features such as source IP and a categorical representation of the target username. Identify and alert on clusters that represent a single source IP ('core point') connecting to many different common usernames, which is indicative of a dictionary attack."
            ]
          },
          {
            "description": "A pattern of authentication failures indicates either password spraying (one-to-many or many-to-many) or brute-forcing (one-to-one or many-to-one) relationship between source IPs and target accounts.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Cloud Service Provider Portals (e.g., Azure AD, AWS Console), VPN Concentrators, Externally-facing Web Applications",
            "action": [
              "Symbolic: For password spraying, create a rule that alerts if a single source IP generates failed logins (Windows Event ID 4625) for more than 20 distinct accounts with 3 or fewer attempts per account within a 1-hour window. For brute-force, create a rule that alerts if a single target account experiences more than 50 failed logins from any source IP within a 30-minute window.",
              "Statistical: For each source IP, track the count of distinct target accounts with failed logins per hour. For each target account, track the count of distinct source IPs generating failed logins per hour. For both metrics, calculate a 30-day moving average and standard deviation. Alert if the current hour's count for any IP or account exceeds 3 standard deviations above its historical average.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., Isolation Forest) on two distinct data streams: (1) the rate of unique target accounts per source IP, and (2) the rate of unique source IPs per target account. The model should learn normal baseline fluctuations and alert on sudden spikes that deviate significantly from the predicted pattern, indicating the start of a spray or brute-force attack."
            ]
          },
          {
            "description": "A statistically significant spike in account lockout events (Windows Event ID 4740) that is temporally correlated with preceding bursts of failed login attempts (Windows Event ID 4625) for the same user accounts.",
            "data_sources": [
              "Windows Event ID 4740",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS) Servers",
            "action": [
              "Symbolic: Create a correlation rule that, upon observing an account lockout event (Windows Event ID 4740), queries for failed logon events (Windows Event ID 4625) for the same TargetUserName in the preceding 15 minutes. If the count of failures from a single IpAddress exceeds the configured account lockout threshold, escalate the alert with the source IP and target account details.",
              "Statistical: Calculate an hourly baseline rate of account lockouts (Windows Event ID 4740) across the entire organization using a 30-day historical window. Generate an alert if the current hour's lockout count exceeds the 99th percentile of this historical baseline, indicating a widespread event like password spraying.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) to predict the expected number of account lockouts for the next hour based on historical data, accounting for seasonality. Generate an alert if the actual number of observed lockouts significantly exceeds the forecasted model's upper confidence interval, suggesting an anomaly not explained by normal patterns."
            ]
          },
          {
            "description": "A persistent, low-and-slow pattern of failed login attempts from a single source IP, targeting multiple accounts over an extended period (hours or days), designed to evade simple rate-based detection thresholds.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-Value Asset Servers, Domain Controllers, Executive user workstations, Cloud administrative accounts",
            "action": [
              "Symbolic: Create a stateful rule that tracks source IPs over a 24-hour window. The rule should alert if a source IP is observed generating at least one failed login attempt (Windows Event ID 4625) per hour for 6 or more consecutive hours, while targeting at least 3 different user accounts during that total period.",
              "Statistical: For each source IP, aggregate the total count of failed login attempts over a 24-hour sliding window. Maintain a historical profile for each IP's daily failure count. Use a Z-score to identify any source IP whose current 24-hour failure count is persistently elevated (e.g., Z-score > 2.0 for 3 consecutive days) compared to its own long-term baseline.",
              "Machine Learning: Model the inter-arrival time (time between consecutive failed login events) from each source IP. Train a Hidden Markov Model (HMM) with two states: 'benign activity' and 'low-and-slow attack'. The model, trained on sequences of these inter-arrival times, can identify a transition to the 'low-and-slow attack' state, which is characterized by a different, more regular statistical distribution of attempt timing than random benign failures."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]