[
  {
    "information_requirement": "Has the adversary collected sensitive data via local email files? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114.001",
        "name": "Local Email Collection",
        "evidence": [
          {
            "description": "A process, identified by a file hash known to be malicious, accesses a local email data file ending in .pst or .ost.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Executive laptops, Mail archive servers, Backup servers",
            "action": [
              "Symbolic: Continuously monitor file access events (Windows Event ID 4663) where the target object name ends in '.pst' or '.ost'. For each event, retrieve the associated Process ID and use it to find the corresponding process creation event (Windows Event ID 4688). Extract the process image's file hash and alert if it matches any entry in a threat intelligence feed of known malicious hashes.",
              "Statistical: For all processes accessing .pst or .ost files, calculate the enterprise-wide prevalence of the process name. Separately, calculate the entropy of the file path for each process executable. Generate a risk score by combining low prevalence (e.g., process seen on <1% of endpoints) and high file path entropy. Alert when the combined score exceeds a defined threshold.",
              "Machine Learning: Train a random forest classifier using features from process execution data (Windows Event ID 4688) enriched with file access events (Windows Event ID 4663). Key features should include process name, parent process name, command-line arguments, process path entropy, and a binary feature indicating if the process accessed a .pst or .ost file. Deploy the model to classify new process and file-access event pairs in real-time as 'benign' or 'malicious collection'."
            ]
          },
          {
            "description": "A command-line interpreter or script host (e.g., cmd.exe, powershell.exe, wscript.exe) is executed with command-line arguments that reference, copy, or archive files with '.pst' or '.ost' extensions.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Virtual Desktop Infrastructure (VDI) instances, Administrative jump boxes, Domain Controllers",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for common interpreters (cmd.exe, powershell.exe, pwsh.exe, robocopy.exe). Apply a library of regular expressions to the command-line field to detect arguments targeting email files, such as patterns like 'copy *.pst', 'robocopy . \\\\backupserver\\ *.ost', or 'Compress-Archive -Path *.pst'. Alert on any match.",
              "Statistical: For each command-line execution event, tokenize the process name and its arguments to create a unique signature. Calculate a rarity score for each signature based on its frequency across the enterprise over a 30-day baseline. Flag any command that both references '.pst' or '.ost' and has a rarity score in the 99th percentile or higher for further investigation.",
              "Machine Learning: Implement a Natural Language Processing (NLP) pipeline using a TF-IDF vectorizer to convert raw command-line argument strings into numerical feature vectors. Train a logistic regression model on a labeled dataset of benign and malicious command lines. Use the trained model to classify new, unseen command lines that reference email file extensions as 'benign administrative action' or 'suspicious collection activity'."
            ]
          },
          {
            "description": "A process not on a pre-defined allowlist (e.g., not outlook.exe) reads a .pst or .ost file and subsequently initiates an external network connection with anomalous characteristics.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Network egress points (Firewalls, Proxies), DNS servers, Cloud storage gateways",
            "action": [
              "Symbolic: Create a stateful SIEM rule that triggers when a process not on an 'Email-Access-Allowlist' (e.g., outlook.exe, searchindexer.exe) reads a .pst or .ost file (Windows Event ID 4663). Within a 5-minute window, if the same source host initiates a network connection (Zeek conn.log) to an external IP address categorized as malicious by threat intelligence, generate a high-severity alert.",
              "Statistical: For each process that accesses a .pst or .ost file, establish a baseline of its typical network behavior using historical Zeek conn.log data, including average bytes sent and common destination ports. Alert when a process, after accessing an email file, initiates a network connection that deviates significantly from its baseline (e.g., bytes sent is >3 standard deviations above its mean).",
              "Machine Learning: For each host, train a time-series anomaly detection model (e.g., an LSTM Autoencoder) on its outbound network traffic volume (bytes_out from Zeek conn.log) to learn its normal data transfer pattern. When a process accesses a .pst or .ost file (Windows Event ID 4663), feed the subsequent outbound network traffic data for that host into the model. An anomaly score exceeding a dynamically tuned threshold indicates a potential exfiltration event."
            ]
          },
          {
            "description": "A process reads data from a .pst or .ost file and subsequently creates a new file of a similar size in a common staging directory (e.g., C:\\Users\\Public, C:\\Windows\\Temp) by the same process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, File servers, Publicly writable network shares, Temporary file directories",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for utilities like cmd.exe, powershell.exe, or robocopy.exe. Search the command line arguments for patterns indicating a .pst or .ost file is being copied to a common staging directory (e.g., 'copy C:\\Users\\*\\*.pst C:\\PerfLogs\\'). Alert on a direct match.",
              "Statistical: Monitor file read events (Windows Event ID 4663) on .pst/.ost files. For the process performing the read, monitor its subsequent file write operations to staging directories. Over a 10-minute window, if the count of write operations to staging directories is unusually high for the user/process and follows a read from an email file, generate an alert. Define a high-volume threshold as being above the 95th percentile of daily file write activity for that user.",
              "Machine Learning: Construct a process-file interaction graph where nodes represent processes and files, and a directed edge represents access. Use a graph algorithm to detect a specific subgraph pattern: a non-standard process node (not outlook.exe) creating an edge to a .pst/.ost file node, which is then followed by the same process node creating an edge to a new file node in a temporary directory. The discovery of this 'read-then-write-to-temp' subgraph is a high-confidence indicator of staging."
            ]
          },
          {
            "description": "A single user account or process accesses .pst or .ost files belonging to multiple, distinct user profiles within a one-hour window, exceeding an established baseline.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting roaming profiles, Shared workstations, Citrix/VDI servers, Backup and archive servers",
            "action": [
              "Symbolic: Maintain an allowlist of authorized administrative and service accounts (e.g., backup agents). Monitor file access events (Windows Event ID 4663) for .pst/.ost files. If a user or process not on the allowlist accesses email files from more than one distinct user profile path (e.g., 'C:\\Users\\user1\\...' and 'C:\\Users\\user2\\...') within one hour, trigger a high-severity alert.",
              "Statistical: For each source user account, aggregate all .pst/.ost file access events (Windows Event ID 4663) over a rolling 1-hour window. Count the number of unique user profiles targeted by extracting the username from the file path. Establish a baseline for each source user (for most, this count will be 1). Alert if the count for any user exceeds a threshold of >2 or a value that is 3 standard deviations above their personal baseline.",
              "Machine Learning: Use an unsupervised learning model, such as DBSCAN, to cluster file access events. Features for each event can include the source user, source process, and target user profile. The model will group normal, single-user access into a large, dense cluster. Outlier points or small clusters identified by DBSCAN would represent anomalous access patterns, such as one user accessing many different profiles, and should be flagged for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]