[
  {
    "information_requirement": "Has the adversary gained initial access to the network via external remote services?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1133",
        "name": "External Remote Services",
        "evidence": [
          {
            "description": "An external IP address initiates a connection and interacts with an exposed administrative service that should not be public, such as a Docker API port or Kubernetes API server.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ, Cloud Environment Subnets, Container Orchestration Platforms, Network Gateway",
            "action": [
              "Symbolic: Create a detection rule that alerts on any connection from an external IP address (not within a defined internal or trusted range) to known administrative ports associated with remote services like the Docker Engine API (2375, 2376) or Kubernetes API Server (6443, 8080).",
              "Statistical: Continuously monitor Zeek conn.log for any new listening services on hosts within the DMZ or cloud environments. Compare the list of observed open ports against an approved baseline list of ports for each host role. Generate an alert for any new, unexpected open port that deviates from the established baseline.",
              "Machine Learning: Train a classification model to distinguish between user-driven web traffic and API interaction traffic based on features from Zeek http.log like URI structure, user-agent strings, and presence of authorization headers. Flag traffic classified as 'API interaction' originating from external sources for review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]