[
  {
    "information_requirement": "Is the adversary maintaining persistence by creating new domain accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1136.002",
        "name": "Domain Account",
        "evidence": [
          {
            "description": "A domain account creation event (Windows Event ID 4720) is linked to a parent process (via Windows Event ID 4688) whose file hash is present in a threat intelligence database or that originates from a host with an anomalously high risk score.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4688",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Log Aggregation Platform (SIEM), Endpoint Detection and Response (EDR) Platform",
            "action": [
              "For each Event ID 4720, join with the corresponding parent process's Event ID 4688 using the Process ID. Extract the file hash of the parent process executable. Query a threat intelligence feed for this hash. Generate an alert for any match.",
              "Maintain a 14-day rolling risk score for each host, incrementing the score based on the severity of security alerts (e.g., AV alerts, IDS alerts). Calculate the 95th percentile of risk scores across all hosts daily. Generate an alert if an account creation event (4720) originates from a host whose risk score exceeds this percentile.",
              "Train a supervised classification model (e.g., XGBoost, Random Forest) using features from both the account creation event (4720) and the parent process event (4688). Features should include: parent process name, command line arguments, user context of the creator, source host, and time of day. The model's target variable is a binary label (malicious/benign) based on historical incident data. Deploy the model to score new account creation events in real-time and alert on any event classified as malicious with a confidence score greater than 0.8."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) on a Domain Controller includes command-line arguments containing specific substrings for domain account creation (e.g., `net user /add /domain`, `New-ADUser`) or exhibits anomalous string characteristics.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstations",
            "action": [
              "Create a detection rule that scans the command-line field of Windows Event ID 4688 logs from Domain Controllers. The rule should trigger if the command line contains (`net` or `net1`) and `user` and `/add` and `/domain` as substrings, OR if it contains `New-ADUser`. Generate a high-severity alert on any match.",
              "For all process creation events on Domain Controllers, calculate the Shannon entropy of the command-line string. Establish a per-process-name baseline of normal entropy values (e.g., for `net.exe`, `powershell.exe`). Generate an alert if a process involving account creation keywords has a command-line entropy that exceeds 3 standard deviations from its process-specific baseline, suggesting obfuscation.",
              "Apply a Natural Language Processing (NLP) topic modeling algorithm (e.g., Latent Dirichlet Allocation - LDA) to the command-line arguments of historical process creation events from Domain Controllers to identify clusters of normal administrative activity. For each new command-line event containing account creation keywords, classify it against the established clusters. Flag any command that does not fit well into an existing legitimate cluster or forms a new, low-volume cluster, indicating a novel or anomalous command structure."
            ]
          },
          {
            "description": "A domain account creation event (Windows Event ID 4720) has metadata attributes that are statistically rare compared to a historical baseline of legitimate account creations. Anomalous attributes include the time of creation, the source workstation, or the user account that performed the creation.",
            "data_sources": [
              "Windows Event ID 4720",
              "Active Directory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Human Resources Systems, Help Desk Ticketing Systems, Active Directory",
            "action": [
              "Maintain an explicit list of authorized administrator accounts and a list of designated administrative workstations. Create a rule to generate an alert for any domain account creation event (Windows Event ID 4720) where the 'Subject/Security ID' is not on the authorized user list OR the 'Source Network Address' is not on the designated workstation list.",
              "For each authorized administrator, build a historical profile of their account creation activity, modeling the distribution of hour-of-day and day-of-week. For each new creation event, calculate the probability of it occurring at that specific time based on the creating user's historical profile. Generate an alert if the event falls within the bottom 5th percentile of frequency for that user, indicating an unusual time for the activity.",
              "Train an anomaly detection model, such as an Isolation Forest or One-Class SVM, on a dataset of legitimate account creation events (Event ID 4720). Use features like creator account SID, source workstation IP, and hour-of-day/day-of-week. Deploy the model to score new creation events. Generate an alert for any event that the model flags as an outlier or anomaly."
            ]
          },
          {
            "description": "A newly created domain account exhibits anomalous behavior within its first 24-48 hours, such as logging into an excessive number of systems, accessing unusual network resources, or generating a high volume of outbound traffic, when compared to the established baseline for new accounts.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Servers, Network Gateway/Egress Points, Endpoint Devices",
            "action": [
              "For any new account identified via Event ID 4720, monitor its activity for 48 hours. Generate an alert if the account's first successful logon (Event ID 4624) is to a server on a predefined 'Crown Jewel' asset list (e.g., Domain Controllers, database servers containing PII) and the logon type is interactive (Type 2) or remote interactive (Type 10).",
              "Establish a baseline for the number of distinct destination hosts a typical new user account logs into (via Event ID 4624) during its first 48 hours. For each new account, count the unique 'Workstation Name' or 'Source Network Address' fields. Generate an alert if a new account exceeds the 99th percentile of this count, indicating potential rapid lateral movement.",
              "For new accounts, model the expected sequence and volume of network connections using time-series analysis (e.g., ARIMA or LSTM) on historical Zeek conn.log data from the first 48 hours of legitimate new accounts. Monitor the network activity (bytes sent/received, connection count, distinct destination ports) originating from the IP addresses used by the new account. Generate an alert if the observed traffic pattern significantly deviates from the forecasted pattern (i.e., falls outside the 95% prediction interval)."
            ]
          },
          {
            "description": "A newly created domain account (Windows Event ID 4720) is immediately followed by events indicating privilege escalation (e.g., addition to a high-privilege group, Windows Event ID 4728/4732/4756) or has a username that is suspiciously similar to an existing privileged account.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4738",
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Database",
            "action": [
              "Create a correlation rule that triggers when a 'User Account Was Created' event (4720) is followed within 10 minutes by a 'Member Was Added to Security-Enabled Group' event (4728, 4732, or 4756) for the same 'Target/User SID'. The rule should fire if the 'Group Name' is on a watchlist of high-privilege groups (e.g., 'Domain Admins', 'Enterprise Admins', 'Schema Admins', 'Administrators'). Generate a critical alert on this sequence.",
              "Upon each new account creation (4720), extract the 'New Account Name'. Retrieve a list of all members of privileged groups (e.g., 'Domain Admins'). Calculate the Levenshtein distance between the new account name and every privileged account name. Generate an alert if the distance is less than or equal to 2, suggesting a typosquatting attempt.",
              "Model the sequence of Active Directory management events (e.g., 4738, 4728, 4732, 4756) that occur within the first hour of a new account's lifecycle using a sequence analysis algorithm (e.g., Markov Chain or LSTM-based autoencoder). Train the model on sequences from legitimate account provisioning processes. Flag any new account whose management event sequence has a low probability under the trained model, indicating an anomalous provisioning workflow."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]