[
  {
    "information_requirement": "Is the adversary attempting to obfuscate command and control traffic using data encoding? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1132",
        "name": "Data Encoding",
        "evidence": [
          {
            "description": "A network connection to a destination IP or domain identified as malicious C2 via threat intelligence has a corresponding data payload with a Shannon entropy score greater than 6.0, indicating a high degree of randomness typical of encoded or encrypted data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, DNS resolvers, Proxy servers, Threat intelligence platform",
            "action": [
              "Query for all network connections (Zeek conn.log) where the destination IP ('id.resp_h') or resolved domain name ('server_name' from ssl.log, 'host' from http.log, or resolved 'id.resp_h' via dns.log) matches an entry in a threat intelligence feed of known C2 indicators. Generate a high-severity alert for any match.",
              "For all outbound connections, calculate the Shannon entropy of the initial data packet (IDP) payload. Group connections by destination port and protocol ('proto') and calculate the 99th percentile for entropy over a 30-day rolling window. Generate an alert for any new connection where the payload entropy exceeds this established 99th percentile baseline for its port and protocol.",
              "Train a supervised classification model (e.g., Random Forest or Gradient Boosting) on a labeled dataset of benign and malicious (encoded C2) network flows. Use features such as payload entropy, byte ratio (orig_bytes/resp_bytes), connection duration, destination port, and protocol. Deploy the trained model to classify new, live network connections in real-time, flagging those predicted as malicious."
            ]
          },
          {
            "description": "A DNS query name in dns.log or an HTTP header value (e.g., User-Agent, Cookie, URI parameter) in http.log contains a string exceeding 50 characters that exhibits high entropy or is composed primarily of characters from the Base64 character set ([A-Za-z0-9+/=]).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers, Web proxies, Application servers",
            "action": [
              "Scan the 'query' field in Zeek dns.log and the 'user_agent', 'uri', and 'cookie' fields in Zeek http.log. Apply a regular expression `(^[A-Za-z0-9+/]{50,}[=]{0,2}$)` to detect long, Base64-encoded strings. Generate an alert for every match.",
              "For each unique HTTP header (e.g., 'User-Agent') and for DNS query names, calculate a baseline character frequency distribution from a 30-day sample of traffic. For new requests, calculate the character frequency and use a Chi-squared goodness-of-fit test to compare it against the baseline. Alert on any value with a p-value below a defined threshold (e.g., 0.01), indicating a statistically significant deviation from normal character patterns.",
              "Train an anomaly detection model, such as a One-Class SVM or an autoencoder, on a large dataset of legitimate DNS query strings and HTTP header values. The model will learn the manifold of normal data. Apply the model to new DNS and HTTP traffic to identify outliers that do not conform to the learned patterns, flagging them as potential encoded C2 communications."
            ]
          },
          {
            "description": "An outbound network flow over a common service port (e.g., 53, 80, 443) contains a payload whose Shannon entropy or byte frequency distribution is a statistical outlier compared to the historical baseline for traffic on that specific port.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Core network switches, Servers hosting critical applications",
            "action": [
              "Create a rule to detect traffic on well-known cleartext ports (e.g., FTP-21, Telnet-23, SMTP-25) where the payload Shannon entropy exceeds a high static threshold (e.g., > 6.5). This indicates unexpected encoding or encryption on a protocol that is normally human-readable.",
              "For each common destination port (e.g., 53, 80, 443), maintain a rolling 30-day baseline of payload entropy scores from Zeek connection data. Calculate the 95th and 99th percentiles for this baseline. Generate a medium-severity alert for connections with entropy between the 95th and 99th percentiles and a high-severity alert for connections exceeding the 99th percentile.",
              "For a specific host or service, model the time series of its average payload entropy using a forecasting model like SARIMA or Prophet. The model should account for weekly and daily seasonality. Generate an alert when the observed entropy for a given time window deviates significantly from the model's forecast and falls outside the predicted confidence interval, indicating an abnormal change in communication patterns."
            ]
          },
          {
            "description": "A sustained pattern of communication is observed where either DNS query lengths to a single domain consistently exceed 100 characters, or the ratio of bytes sent to bytes received (`orig_bytes`/`resp_bytes`) for HTTP/S sessions to a single server is a statistical outlier (e.g., > 3 standard deviations above the mean).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers, Web proxies, Endpoints making external connections",
            "action": [
              "Create a rule that triggers an alert if the 'qlen' field (query length) in Zeek dns.log exceeds 255, which violates the RFC standard for a fully qualified domain name, or if the length of a TXT record query response exceeds 512 bytes, a common size limit for legacy DNS.",
              "For each destination server IP, compute the mean and standard deviation of the client-to-server byte ratio (`orig_bytes` / `resp_bytes`) over a 30-day rolling window from Zeek conn.log. Generate an alert for any new connection where this ratio exceeds the mean by more than three standard deviations.",
              "Perform clustering (e.g., K-Means or DBSCAN) on network connection data using features from Zeek conn.log such as `orig_bytes`, `resp_bytes`, `duration`, and `service`. Analyze the resulting clusters to identify small, dense clusters of anomalous activity. Profile these clusters; those characterized by unusually high `orig_bytes` to `resp_bytes` ratios and connections to non-standard ports are highly suspect of being encoded C2."
            ]
          },
          {
            "description": "A process that does not typically make network connections (e.g., notepad.exe, calc.exe) or a system process running from an unusual path (e.g., svchost.exe from C:\\Users\\) is observed initiating an outbound network connection. This is identified by correlating process creation events (Windows Event ID 4688) with network connection creation events (Windows Event ID 5156).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Domain controllers, Critical application servers",
            "action": [
              "Maintain a watchlist of process names that should never initiate network connections (e.g., 'notepad.exe', 'calc.exe'). Monitor Windows Event ID 5156 and generate a high-severity alert whenever the 'Application Name' field matches an entry on the watchlist and the 'Destination Address' is external.",
              "For each process executable path, profile its typical network behavior, including the set of destination ports it connects to and the frequency of connections. For each new connection from a process (Event ID 5156), calculate the rarity of the destination port for that process path. Alert if a process connects to a port that falls below the 1st percentile of historical usage, indicating a rare and potentially suspicious event.",
              "Construct a process parent-child relationship graph using Windows Event ID 4688 data. Use a graph algorithm or a trained model to score the rarity or anomalousness of process execution chains. If a process that is part of a highly anomalous chain (e.g., Word spawning PowerShell) then initiates an external network connection (identified via Event ID 5156), elevate the event to a high-priority incident for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]