[
  {
    "information_requirement": "Is the adversary maintaining persistence by creating local accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1136.001",
        "name": "Local Account",
        "evidence": [
          {
            "description": "A Windows Event ID 4720 (User Account Created) is observed on a host, and within the preceding 24 hours, the same host is observed in Zeek conn.log or dns.log communicating with a destination IP address or domain on a high-confidence threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4720",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers, Internet Gateway, DNS Resolvers",
            "action": [
              "Create a SIEM rule to join Windows Event ID 4720 events with network logs (Zeek conn.log, Zeek dns.log) on the hostname/source IP. Trigger an alert if a host that created an account communicated with an IP or domain on a high-confidence threat intelligence list within the previous 24-hour window.",
              "Calculate the daily rate of local account creation per host. For any host observed communicating with a low-reputation IP (e.g., from a grey-list, newly registered domain feed), flag any subsequent account creation if the host's creation rate exceeds the 95th percentile of its 30-day historical baseline or the baseline of its assigned peer group (e.g., all developer workstations).",
              "Deploy a supervised classification model (e.g., Random Forest) trained on labeled account creation events. Features should include: account name entropy, parent process name of creator, time of day, and boolean flags for recent communication with known-bad IPs/domains. An event classified as 'malicious' with a confidence score over 0.9 triggers a high-severity alert."
            ]
          },
          {
            "description": "A single command-line execution, captured in a Windows Event ID 4688, contains substrings for both local user creation (`net user ... /add`) and the addition of that user to a privileged local group (`net localgroup Administrators ... /add`), often chained with '&&'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, User Workstations, Privileged Access Workstations",
            "action": [
              "Create a detection rule that uses a regular expression like `/(?=.*net\\.exe\\s+user\\s+.*\\s+\\/add)(?=.*net\\.exe\\s+localgroup\\s+(Administrators|Remote Desktop Users)\\s+.*\\s+\\/add)/i` on the Process Command Line field of Windows Event ID 4688.",
              "For all process creation events involving `net.exe`, calculate the Shannon entropy of the command-line string. Establish a baseline distribution of entropy scores for legitimate `net.exe` commands. Flag any command whose entropy score exceeds 3 standard deviations above the mean, as this indicates potential obfuscation or non-interactive scripting.",
              "Utilize an NLP-based command-line classifier trained to distinguish between benign and malicious shell commands. Features can be derived from the command's tokens (n-grams), structure, and presence of sensitive keywords. Flag commands classified as malicious, particularly those containing both `net user` and `net localgroup` substrings."
            ]
          },
          {
            "description": "A Windows Event ID 4720 (User Account Created) is immediately followed, within a 60-second window on the same host, by a Windows Event ID 4732 (A member was added to a security-enabled local group). The `TargetUserName` in event 4720 matches the `MemberName` in event 4732, and the `GroupName` in event 4732 corresponds to a privileged group (e.g., 'Administrators', 'Remote Desktop Users').",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations",
            "action": [
              "Implement a SIEM correlation rule that triggers when EventID 4720 and 4732 are detected on the same Hostname within 60 seconds, where 4720.TargetUserName == 4732.MemberName AND 4732.GroupName IN ('Administrators', 'Remote Desktop Users', 'Power Users').",
              "For all legitimate administrative parent processes (e.g., `mmc.exe`, `lsass.exe`), calculate the distribution of time delays between a 4720 event and a subsequent 4732 event for the same user. Flag any such correlated event pair where the parent process is not on the administrative allowlist (e.g., `cmd.exe`, `powershell.exe`) and the time delay falls below the 10th percentile of the legitimate baseline, indicating suspicious automation.",
              "Implement a sequence analysis model (e.g., Markov Chain) to learn the probability of transitioning from any given event ID to another on a per-host basis. An alert is generated when the observed state transition from event 4720 to a privileged 4732 has a very low probability according to the host's learned historical model."
            ]
          },
          {
            "description": "For a newly created local account (identified by Windows Event ID 4720), the first observed logon (Windows Event ID 4624) is a remote type (Logon Type 3 or 10), or the initial process executions (Windows Event ID 4688) within the first logon session consist primarily of reconnaissance commands.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers, VPN Concentrators, Authentication Servers",
            "action": [
              "Create a watch list of newly created local accounts from Event ID 4720. For any account on this list, trigger an alert if its first corresponding Event ID 4624 has a Logon Type of 3 (Network) or 10 (RemoteInteractive). Also, correlate with Event ID 4688 from the same Logon ID and alert if process names match a watchlist of reconnaissance tools (e.g., 'whoami.exe', 'net.exe', 'ipconfig.exe', 'systeminfo.exe').",
              "For each new local account's first logon session, collect the set of unique process names executed. Calculate the Jaccard similarity index between this set and a predefined set of 'reconnaissance processes'. Generate an alert if the similarity score exceeds a statistically determined threshold (e.g., > 0.5), indicating behavior inconsistent with normal user setup.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to the initial session activity of all newly created accounts. Features should include Logon Type, source IP geolocation (internal/external), count of distinct processes executed, and the ratio of discovery commands to total commands. Sessions that fall into sparse clusters, separate from dense clusters of normal activity, should be flagged as anomalous."
            ]
          },
          {
            "description": "Within one hour following a local account creation (Windows Event ID 4720) on a host, that same host exhibits anomalous network egress behavior, evidenced by a significant increase in outbound data volume, connections to new or rare external destinations, or traffic patterns indicative of C2 beaconing.",
            "data_sources": [
              "Windows Event ID 4720",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internet Gateway, Core Switches, Hosts with newly created accounts",
            "action": [
              "Upon detection of a Windows Event ID 4720, initiate targeted monitoring on the host's IP address. Alert if, within the next hour, the host is observed in Zeek conn.log connecting to a destination IP on a threat intel feed, or is observed in Zeek dns.log querying for a domain with a DGA (Domain Generation Algorithm) classification.",
              "For each host, maintain a 30-day rolling baseline of key network metrics from Zeek conn.log (e.g., total outbound bytes, unique destination IPs) aggregated in 5-minute windows. After a 4720 event on a host, apply a change-point detection algorithm (e.g., CUSUM) to these metrics. A statistically significant change point detected after the event time triggers an alert.",
              "Employ a pre-trained network traffic autoencoder model. Following a local account creation (Event ID 4720), feed the host's subsequent network connection vectors (features: protocol, destination port, duration, sent bytes) from Zeek conn.log into the model. Connections that yield a reconstruction error exceeding the 99th percentile of historical errors are flagged as anomalous."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]