[
  {
    "information_requirement": "Has an adversary achieved execution via user interaction with a malicious link? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1204.001",
        "name": "Malicious Link",
        "evidence": [
          {
            "description": "An endpoint initiates a network connection to a domain or IP address on a threat intelligence blocklist, or a requested URL exhibits anomalous lexical characteristics.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Web Gateway, DNS Resolvers, Firewall Egress Points",
            "action": [
              "Continuously correlate domains from Zeek dns.log records and destination IPs from Zeek conn.log against a high-confidence, machine-readable threat intelligence feed of known malicious indicators. Generate an alert upon a match.",
              "For each requested URL in Zeek http.log, calculate the string entropy of the hostname and path, the total length, and the ratio of numeric to alphabetic characters. Establish a baseline distribution for these metrics across the enterprise and alert on any URL with metrics exceeding the 95th percentile, as this may indicate DGA or obfuscation.",
              "Train and apply a URL classification model (e.g., logistic regression, Gradient Boosting) using lexical features (length, character n-grams, keyword presence, number of special characters, entropy) to predict if a URL is malicious. Ingest Zeek http.log and dns.log data and flag URLs with a model-generated probability score above a predetermined threshold (e.g., 0.90)."
            ]
          },
          {
            "description": "A process associated with web browsing, email, or document viewing (e.g., chrome.exe, outlook.exe, acrord32.exe) spawns a command-line interpreter or a known Living-off-the-Land Binary (LOLBin).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Remote Desktop Servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) for high-risk parent-child process relationships. Alert when a parent process like 'outlook.exe', 'chrome.exe', 'msedge.exe', or 'acrord32.exe' spawns a child process such as 'powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', or 'certutil.exe'.",
              "Baseline all parent-child process relationships observed via Sysmon Event ID 1. Use frequency analysis to identify statistically rare pairs (e.g., those occurring in less than 0.01% of events). For child processes that are interpreters, calculate the entropy and length of their command-line arguments and alert on values exceeding 3 standard deviations from the established norm for that specific parent-child pair.",
              "Train a classification model (e.g., Random Forest) on process creation event features (parent process image, child process image, command-line arguments, user context, integrity level). Apply the model to new events to assign a risk score. An event with a score exceeding a tuned threshold is flagged as a suspicious execution attempt."
            ]
          },
          {
            "description": "A file downloaded via a web browser or email client is executed within a short time window (e.g., under 60 seconds) after being written to disk.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Enterprise Web Gateway, Email Gateway",
            "action": [
              "Correlate network file creation events (Zeek files.log) or host file creation events (Sysmon Event ID 11) with process creation events (Sysmon Event ID 1). If the executed file's hash matches a known malicious hash from a threat intelligence feed, generate a high-severity alert.",
              "For all instances where a downloaded file (identified via Zeek files.log or Sysmon Event ID 11 from a browser process) is subsequently executed (Sysmon Event ID 1), calculate the time delta between file creation and execution. Create a distribution of these deltas per user and alert on any event falling in the 1st percentile (e.g., under 30 seconds), indicating immediate, potentially automated execution.",
              "Apply a time-series anomaly detection model (e.g., SARIMA) to the aggregate count of 'download-then-execute' events per hour across the enterprise. A sudden, anomalous spike in this event rate can indicate a widespread phishing campaign is in progress and should be flagged for investigation."
            ]
          },
          {
            "description": "A process spawned by a browser or email client executes from a non-standard or user-writable directory (e.g., %APPDATA%\\Local\\Temp, %USERPROFILE%\\Downloads, C:\\Users\\Public\\).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Terminal Servers",
            "action": [
              "Define a deny-list of execution paths for child processes of browsers and email clients. Monitor Sysmon Event ID 1 and alert whenever a child process of 'chrome.exe', 'msedge.exe', 'outlook.exe', etc., is observed executing from a forbidden path like '%APPDATA%', '%TEMP%', or '%USERPROFILE%\\Downloads\\'.",
              "For each parent process (e.g., 'outlook.exe'), build a baseline of all child process execution paths seen in the environment. Use frequency analysis to flag any execution from a path that has never been seen before or is in the bottom 1% of historical occurrences for that parent-child pair.",
              "Employ a clustering algorithm (e.g., DBSCAN) on process execution events. Use features derived from the event data, such as tokenized file paths, parent process name, and user context. This will group normal behaviors into clusters; events that are classified as noise or outliers by the algorithm represent anomalous executions from unusual locations and should be investigated."
            ]
          },
          {
            "description": "A process, created by a browser or document reader, establishes an outbound network connection to a destination not on an established allow-list or with characteristics of C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Firewall Egress Points, DNS Resolvers",
            "action": [
              "Correlate process creation events (Sysmon Event ID 1) with subsequent network connection events (Sysmon Event ID 3). Check the destination IP and domain name against a threat intelligence feed of known command-and-control (C2) servers. Alert on any match.",
              "For processes spawned by browsers, baseline their network behavior. Flag new connections where the destination IP's ASN or country is rare for the user/organization. For established connections, calculate the standard deviation of time intervals and data volume between connections; a low standard deviation in both metrics indicates periodic, automated C2 beaconing.",
              "Use a time-series anomaly detection model (e.g., LSTM Autoencoder) on network flow data (bytes out, packet count, connection frequency per minute) originating from a newly created process. The model, trained on benign process network traffic, will flag anomalous patterns such as periodic, low-volume 'heartbeats' indicative of C2 communication."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]