[
  {
    "information_requirement": "Is the adversary manipulating Active Directory data via a rogue domain controller? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1207",
        "name": "Rogue Domain Controller",
        "evidence": [
          {
            "description": "Observed network traffic containing DCE/RPC calls to the Directory Replication Service (DRS) Remote Protocol interface (DRSUAPI, UUID E3514235-4B06-11D1-AB04-00C04FC2DCD2) that match byte-level signatures of known DCShadow or DCSync tools like Mimikatz.",
            "data_sources": [
              "Zeek dce_rpc.log",
              "Zeek conn.log",
              "Packet Capture (PCAP)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at network chokepoints, such as core switches or firewalls segmenting Domain Controllers.",
            "action": [
              "Deploy and monitor NIDS signatures (e.g., Suricata) that target the network patterns of Mimikatz DCShadow and Impacket secretsdump. Create a high-severity alert for any signature match on traffic involving the DRSUAPI service UUID (E3514235-4B06-11D1-AB04-00C04FC2DCD2).",
              "From Zeek dce_rpc.log, calculate the entropy of DCE/RPC request payloads for all DRSUAPI operations. Establish a baseline entropy score for legitimate replication traffic between known DCs. Flag any DRSUAPI transaction whose payload entropy exceeds the 99th percentile of the established baseline, suggesting tool-specific payload structures.",
              "Train a supervised classification model (e.g., Random Forest) on labeled network sessions of legitimate vs. malicious (Mimikatz-based) replication. Use features like packet size distribution, inter-arrival times, and DCE/RPC operation sequences. Deploy the model to classify new replication sessions and alert on those classified as malicious."
            ]
          },
          {
            "description": "A process is created on a host with command-line arguments containing strings uniquely associated with DCShadow or DCSync tools (e.g., 'lsadump::dcshadow', 'impacket-secretsdump', 'Invoke-DCShadow', 'drsgetncchanges').",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Command-line and PowerShell script block logs from all domain-joined endpoints, especially member servers, Domain Controllers, and administrator workstations.",
            "action": [
              "Create a SIEM rule to alert on any process creation event (Windows Event ID 4688, Sysmon Event ID 1) or PowerShell Script Block log (Event ID 4104) where the command line or script content contains high-fidelity keywords such as 'dcshadow', 'drsgetncchanges', 'secretsdump.py', or 'Invoke-DCShadow'.",
              "Analyze process command lines (Event ID 4688/1) to build a frequency dictionary of all command-line arguments across the enterprise. Alert when arguments related to AD replication (e.g., 'drs', 'rep', 'sync') appear and have a historical frequency below a 0.1% threshold on non-DC hosts.",
              "Train an anomaly detection model (e.g., Isolation Forest) on a vectorized representation (e.g., TF-IDF) of command lines from a baseline period. Apply the model to new command-line executions and alert on any command identified as an anomaly, especially on non-DC hosts."
            ]
          },
          {
            "description": "Active Directory replication traffic (identified by DRSUAPI RPC calls in Zeek logs or by Windows Event IDs 4928/4929) is observed where either the source or destination host is not on a pre-defined list of authorized Domain Controllers.",
            "data_sources": [
              "Zeek dce_rpc.log",
              "Zeek conn.log",
              "Windows Event ID 4928",
              "Windows Event ID 4929"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic flows at network chokepoints and Directory Service replication logs on all Domain Controllers.",
            "action": [
              "Maintain an allowlist of authorized Domain Controller hostnames and IP addresses. Create a SIEM rule to trigger a critical alert if: 1) Zeek dce_rpc.log shows DRSUAPI traffic where the source or destination IP is not on the allowlist, or 2) Windows Event ID 4928/4929 shows a Source/Destination DRA that is not on the allowlist.",
              "For each known Domain Controller, establish a baseline of hourly data volume for replication traffic to its known replication partners using Zeek conn.log byte counts. Alert if the traffic volume to any partner exceeds 3 standard deviations from the hourly moving average, or if replication traffic is sent to a new, previously unknown partner IP.",
              "Apply a clustering algorithm (e.g., DBSCAN) to network connection data (Zeek conn.log) filtered for AD replication ports. Use features like source IP, destination IP, duration, and total bytes. Legitimate replication traffic between DCs should form dense clusters. Any connection identified as noise or a small, separate cluster, especially involving a non-DC host, is a high-confidence anomaly."
            ]
          },
          {
            "description": "A Kerberos Ticket-Granting Service (TGS) request (Windows Event ID 4769) is logged for a DC-specific Service Principal Name (SPN), such as the Directory Replication Service (DRSUAPI) GUID 'E3514235-4B06-11D1-AB04-00C04FC2DCD2' or the 'GC/' SPN for Global Catalog services, where the requesting client is not an authorized Domain Controller.",
            "data_sources": [
              "Windows Event ID 4769",
              "Zeek krb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Security event logs on all Domain Controllers and Kerberos network traffic captured at network chokepoints.",
            "action": [
              "Create a SIEM rule to monitor for Windows Event ID 4769 where the Service Name matches the DRS GUID 'E3514235-4B06-11D1-AB04-00C04FC2DCD2' or starts with 'GC/'. Trigger an alert if the 'Client Address' field is not on the allowlist of authorized Domain Controller IP addresses.",
              "For all Kerberos TGS requests, calculate the frequency of each unique SPN requested per client host over a 30-day rolling window. Identify the set of SPNs that are almost exclusively requested by DCs (e.g., requested by non-DCs <0.01% of the time). Alert if a non-DC host requests any SPN from this statistically-derived 'DC-only' set.",
              "Implement a peer group analysis model where hosts are grouped by role (e.g., DCs, workstations, web servers). For each group, the model learns the normal distribution of requested SPNs. Generate an alert when a host requests an SPN that is a statistical outlier for its peer group, such as a member server requesting the DRSUAPI SPN."
            ]
          },
          {
            "description": "A new nTDSDSA object is created in the Active Directory Configuration partition, which is a required step for registering a new domain controller.",
            "data_sources": [
              "Windows Event ID 5137"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory configuration partition, monitored via Directory Service Changes logs on all Domain Controllers.",
            "action": [
              "Create a high-priority SIEM alert that triggers on the creation of a Directory Service object (Event ID 5137) where the 'Object Class' is 'nTDSDSA'. Since this activity is extremely rare outside of planned DC promotions, any unexpected alert should be investigated immediately.",
              "Establish a baseline for the creation of all objects in the AD Configuration partition. The expected count for 'nTDSDSA' object creation should be zero over any given month. Alert on any non-zero count of 'nTDSDSA' object creations that does not correlate with a scheduled DC promotion in change management records.",
              "Train an anomaly detection model (e.g., One-Class SVM) on the attributes of objects created in the AD Configuration partition (Event ID 5137). Features could include Object Class, Object DN, and the user principal that created it. An 'nTDSDSA' object created by a non-service account or outside of a maintenance window would be flagged as a high-confidence anomaly."
            ]
          },
          {
            "description": "An anomalous number of Active Directory object modifications (Event ID 5136) or group membership changes (Event IDs 4732, 4738, 4756) are replicated from a single source Domain Controller in a short time period.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4738",
              "Windows Event ID 4732",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Security and Directory Service Changes logs on all Domain Controllers.",
            "action": [
              "Create a SIEM alert that triggers on modification of critical AD objects, such as Event ID 5136 for the 'krbtgt' object's 'msDS-KeyVersionNumber' attribute, or Event ID 4732/4756 for additions to the 'Domain Admins' or 'Enterprise Admins' groups. Correlate with change management tickets to reduce false positives.",
              "For each Domain Controller, establish a time-series baseline of the hourly count of AD modification events (e.g., 5136, 4738). Use a moving average and standard deviation to model normal activity. Trigger an alert if the count of modifications from a single DC exceeds 4 standard deviations above its baseline for a given hour.",
              "Use time-series forecasting (e.g., SARIMA) to model the expected volume of AD object modifications (Event ID 5136) across the entire domain. Generate an alert when the observed modification count significantly deviates from the model's prediction interval, indicating an anomalous burst of activity potentially caused by rogue-injected changes."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]