[
  {
    "information_requirement": "Is an adversary abusing the Microsoft Management Console (mmc.exe) for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.014",
        "name": "MMC",
        "evidence": [
          {
            "description": "Execution of mmc.exe with a console file (.msc) whose hash or name matches a known malicious indicator from threat intelligence.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "For each `mmc.exe` process creation event (Sysmon Event ID 1 or Windows Event ID 4688), parse the command line to extract the path to any `.msc` file. From the event data (Sysmon) or by calculating it on demand, obtain the file's hash. Alert if the hash matches any entry in the malicious file hash threat intelligence feed.",
              "Aggregate all `.msc` file paths executed via `mmc.exe` across the environment over a 30-day rolling window. Calculate the execution frequency for each unique path. Flag any execution of an `.msc` file whose path falls in the bottom 5th percentile of frequency, indicating it is exceptionally rare.",
              "Train a classification model (e.g., Random Forest, Gradient Boosting) on features extracted from `.msc` file paths, including path depth, directory name entropy, character distribution, and flags for user-writable or temporary locations. Apply the model to score the likelihood of malice for each new `.msc` execution. Investigate executions with a high malicious probability score."
            ]
          },
          {
            "description": "An `mmc.exe` process is executed with specific command-line arguments associated with abuse, such as `-Embedding`, `/a`, or the invocation of `wbadmin.msc` with `delete catalog`.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, Domain Controllers, Backup Servers",
            "action": [
              "Create a detection rule to inspect the command line of `mmc.exe` process creation events (Sysmon Event ID 1, Windows Event ID 4688). Alert if the command line contains the string `-Embedding` or matches a regular expression for destructive commands, such as `/(wbadmin\\.msc).*(delete\\s+catalog)/i`.",
              "For each host, profile the command-line arguments used with `mmc.exe` over a 90-day baseline period. For each new execution, calculate the Shannon entropy of the command-line string. Flag any execution where the entropy score is a statistical outlier (e.g., greater than 3 standard deviations from the host's historical mean) as a potentially obfuscated or anomalous command.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest, One-Class SVM) on a large corpus of legitimate `mmc.exe` command lines from your environment. Use feature engineering to convert command lines into numerical vectors (e.g., TF-IDF, character n-grams). Apply the trained model to score new `mmc.exe` executions and alert on any command line identified as a significant anomaly."
            ]
          },
          {
            "description": "`mmc.exe` is spawned by a parent process not typically associated with interactive administrative tasks, such as an Office application, web browser, or non-interactive script host.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Application Servers",
            "action": [
              "For each `mmc.exe` process creation event (Sysmon Event ID 1, Windows Event ID 4688), inspect the parent process name. Alert if the parent process is on a deny-list of suspicious parents, including `winword.exe`, `excel.exe`, `outlook.exe`, `powershell.exe`, `wscript.exe`, `cscript.exe`, `msedge.exe`, `chrome.exe`.",
              "Continuously build a frequency distribution of all parent-child process pairs where the child is `mmc.exe` across the enterprise. Flag any observed pair (e.g., `wscript.exe` -> `mmc.exe`) that falls below a rarity threshold (e.g., in the 1st percentile of observed frequencies), indicating a statistically uncommon execution chain.",
              "Model process execution sequences on each host. Train a sequence-based model (e.g., an LSTM or Markov model) on legitimate process chains to learn transition probabilities. Flag an `mmc.exe` execution if its parent process makes the transition statistically improbable according to the model, indicating a deviation from normal workflow."
            ]
          },
          {
            "description": "`mmc.exe` loads a console file (`.msc`) from a path outside of standard system directories, such as a user profile folder, temporary directory, or network share.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, File Servers, Network Shares",
            "action": [
              "From `mmc.exe` process creation events (Sysmon Event ID 1, Windows Event ID 4688), parse the command line to extract the `.msc` file path. Alert if the path matches a regex for non-standard locations, such as `C:\\\\Users\\\\`, `C:\\\\ProgramData\\\\`, `%APPDATA%`, `%TEMP%`, or network shares (`\\\\\\\\.*`).",
              "Establish a per-user baseline of directories from which `.msc` files are executed. For each new execution, if the directory is not in the user's historical baseline, calculate its rarity across the entire organization. Flag executions from directories that are rare for both the specific user and the organization as a whole (e.g., 99th percentile of rarity).",
              "Develop a classification model (e.g., Decision Tree) to predict if an `.msc` file path is suspicious. Train the model using features such as path depth, directory name keywords (e.g., 'temp', 'downloads'), whether the path is in System32, and whether it is in a user-writable location. Deploy the model to score and flag new `.msc` file executions in real-time."
            ]
          },
          {
            "description": "The `mmc.exe` process initiates an outbound network connection, which is highly anomalous behavior for this utility.",
            "data_sources": [
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, All Windows Endpoints and Servers",
            "action": [
              "Monitor for network connection events where the initiating process is `mmc.exe` (Sysmon Event ID 3). Alert on any connection, especially to destination IPs that are external (not RFC1918) and not on an organizational allow-list.",
              "Since network connections from `mmc.exe` are exceptionally rare, any observed destination IP should be treated as suspicious. Maintain a list of all destination IPs contacted by `mmc.exe` across the enterprise. Any destination IP that is a low-frequency outlier (e.g., seen only once or twice) and not explicitly allowed should be flagged for immediate investigation.",
              "On a per-host basis, model the volume of outbound bytes from the `mmc.exe` process as a time series (using data from Sysmon Event ID 3 or correlated Zeek logs). The expected baseline is zero. Apply a time-series anomaly detection model to this data. Any non-zero traffic spike is a significant anomaly and should trigger a high-severity alert, as it may indicate C2 activity or data staging."
            ]
          },
          {
            "description": "Creation of a suspicious COM Class Identifier (CLSID) registry key, followed by an `mmc.exe` execution that invokes it via an `.msc` file with the `-Embedding` flag.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 13",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Registry on all endpoints, All Windows Endpoints and Servers",
            "action": [
              "Monitor for registry value set events (Sysmon Event ID 13) under `HKCR\\CLSID\\` that point to a scriptlet (e.g., `scrobj.dll`) or an executable in a non-standard path. Correlate these events with subsequent `mmc.exe` process executions (Sysmon Event ID 1) that use the `-Embedding` flag. Alert if the `.msc` file used by `mmc.exe` was created shortly after the registry modification.",
              "Profile the file paths stored in `InprocServer32` default values within the registry. Calculate the character frequency distribution and path depth for all legitimate entries to form a baseline. For new or modified entries, calculate the same metrics and flag any entry that is a statistical outlier (e.g., high entropy, unusual path depth, location in a user profile) as a potential malicious COM registration.",
              "Train a classification model to distinguish between legitimate and malicious COM registry entries. Use features derived from the registry key and value, such as the path of the server DLL/EXE, the presence of threading model values, and whether the server is a known Microsoft binary. Apply the model to score new `HKCR\\CLSID` entries and alert on those classified as high-risk."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]