[
  {
    "information_requirement": "Is the adversary leveraging rundll32.exe to execute malicious code for defense evasion? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.011",
        "name": "Rundll32",
        "evidence": [
          {
            "description": "The command line of a rundll32.exe process specifies a DLL whose file hash matches a known malicious indicator, or the process initiates a network connection to a domain or IP address identified as malicious by threat intelligence.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, Domain Controllers, Internet Gateway/Egress Points",
            "action": [
              "For each rundll32.exe process creation (Windows Event ID 4688), extract the DLL path from the command line, calculate its file hash, and query the hash against threat intelligence feeds. Concurrently, correlate the Process ID with network connection events (Windows Event ID 5156, Zeek conn.log) and query destination IPs and domains against reputation services and blocklists. Generate a high-severity alert on any match.",
              "Calculate the enterprise-wide prevalence of each unique DLL file hash loaded by rundll32.exe over a 30-day baseline. After filtering known-good DLLs from common software and operating system components, alert on any DLL hash that is executed on a statistically rare number of hosts (e.g., fewer than 5 hosts or below the 1st percentile).",
              "Train a classification model (e.g., Random Forest) on a labeled dataset of benign and malicious rundll32.exe executions. Engineer features including the directory of the loaded DLL (e.g., System32, AppData), the parent process name, command line length, and associated network connection features (port, destination IP reputation, bytes transferred). Deploy the model to score new rundll32.exe executions in real-time and alert on events with a high probability score."
            ]
          },
          {
            "description": "A rundll32.exe command line includes patterns indicative of malicious proxy execution, such as the 'javascript:' protocol handler, invocation of Control Panel items (.cpl) via 'shell32.dll', or direct calls to DLL functions by ordinal number (e.g., '#1').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, User Workstations",
            "action": [
              "Deploy regular expressions within the SIEM to scan rundll32.exe command lines (Windows Event ID 4688) for high-fidelity malicious patterns, including: 'javascript:\\..\\mshtml,RunHTMLApplication', 'shell32.dll,Control_RunDLL', and ordinal exports like ',#\\d+'. Trigger a high-severity alert on a match.",
              "For each rundll32.exe execution, calculate the Shannon entropy of the command line arguments. Establish a baseline distribution of entropy scores for legitimate rundll32.exe invocations across the enterprise. Alert on any command line whose entropy score exceeds the 99th percentile of the established baseline, suggesting obfuscation or embedded script code.",
              "Train a text classification model using techniques like TF-IDF or word embeddings on a large dataset of labeled benign and malicious rundll32.exe command lines. The model should learn to identify suspicious combinations of arguments, paths, and function calls. Deploy the model to classify new command lines and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A process named rundll32.exe executes from a file path other than '%SystemRoot%\\System32' or '%SystemRoot%\\SysWOW64', a legitimate rundll32.exe process loads a DLL from a user-writable directory (e.g., AppData, Temp), or the parent process of rundll32.exe is anomalous.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, File servers hosting user profiles or shared drives",
            "action": [
              "Create SIEM rules to alert on the following conditions: 1) A process named 'rundll32.exe' executes from a path other than '%SystemRoot%\\System32\\' or '%SystemRoot%\\SysWOW64\\'. 2) A legitimate rundll32.exe process loads a DLL from a non-standard or user-writable directory (e.g., 'C:\\Users\\', 'C:\\ProgramData\\', 'C:\\Temp\\'). 3) The parent process of rundll32.exe is an unusual process such as a Microsoft Office application (winword.exe, excel.exe) or a scripting engine (wscript.exe, cscript.exe).",
              "Aggregate all parent-child process relationships involving rundll32.exe across the enterprise for a 30-day period. Calculate the frequency of each parent process. Alert when rundll32.exe is spawned by a parent process that falls below a low frequency threshold (e.g., the 1st percentile of all parent processes), indicating an anomalous execution chain.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest, One-Class SVM) on features derived from benign rundll32.exe executions. Features should include categorical representations of the parent process name, the directory of the loaded DLL, and the current working directory. Use the trained model to score new events and alert on those identified as anomalies."
            ]
          },
          {
            "description": "A single host exhibits a burst of rundll32.exe executions that significantly deviates from its own historical baseline, or a rundll32.exe process initiates network connections to a destination that is rare for the host or enterprise.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, Network Egress Points, DNS Servers",
            "action": [
              "Create a correlation rule that triggers if a single host generates more than 5 distinct suspicious rundll32.exe alerts (from other rules like pattern matching or rare paths) within a 10-minute window, escalating the event to a high-severity incident.",
              "For each endpoint, calculate a moving average and standard deviation of rundll32.exe executions (Windows Event ID 4688) over a rolling 24-hour window. Generate an alert if the execution count in a 5-minute interval exceeds 3 standard deviations above the moving average.",
              "For process execution volume, train a time-series anomaly detection model (e.g., ARIMA) on the per-host frequency of rundll32.exe events to identify significant deviations from predicted norms. For network behavior, use an unsupervised clustering algorithm (e.g., DBSCAN) on features from Zeek conn.log (destination port, bytes out, connection duration) for all rundll32.exe-initiated connections. Alert on connections that fall into sparse clusters or are classified as noise, indicating they do not conform to established patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]