[
  {
    "information_requirement": "Has an adversary abused the Microsoft Connection Manager Profile Installer (CMSTP.exe) for defense evasion on the enterprise network?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.003",
        "name": "CMSTP",
        "evidence": [
          {
            "description": "An execution of cmstp.exe is observed (Sysmon Event ID 1) that either references an INF file whose SHA256 hash is on a blocklist, or initiates a network connection (Sysmon Event ID 3, Zeek conn.log) to an IP address or domain on a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1: Process Creation",
              "Sysmon Event ID 3: Network Connection",
              "Sysmon Event ID 7: Image Loaded",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Network Egress Points/Gateways, Internal DNS Resolvers",
            "action": [
              "Join process creation events (Sysmon Event ID 1) with network connection logs (Sysmon Event ID 3, Zeek conn.log). Alert when `process.name` is 'cmstp.exe' and the `destination.ip` or `dns.question.name` matches a known-bad indicator from a threat intelligence feed.",
              "For all domains resolved in network connections originating from cmstp.exe (Zeek dns.log), enrich with domain metadata (age, registrar, TLD). Calculate the frequency of each domain being queried across the enterprise over the last 30 days. Flag any domain that is both younger than 30 days and falls in the 1st percentile of query frequency (i.e., is exceptionally rare).",
              "Deploy a pre-trained supervised classification model (e.g., Random Forest) to score cmstp.exe executions. Input features should include command-line length and entropy, parent process name, and reputation scores of any observed destination IPs or domains. Alert on any execution classified as 'malicious' with a confidence score greater than 0.9."
            ]
          },
          {
            "description": "An execution of cmstp.exe with the '/au' command-line switch is observed, followed within 60 seconds by a process access event to CMLUA.dll or a registry modification event involving the CMSTPLUA or CMLUAUTIL COM object CLSIDs.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1: Process Creation",
              "Sysmon Event ID 10: Process Access",
              "Sysmon Event ID 12: Registry Event (Create and Delete)",
              "Sysmon Event ID 13: Registry Event (Value Set)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Privileged Access Workstations",
            "action": [
              "Create a correlation rule that triggers when a Sysmon Event ID 1 for 'cmstp.exe' with command line '/au' is followed within 60 seconds by either: a Sysmon Event ID 10 where `TargetImage` contains 'CMLUA.dll', or a Sysmon Event ID 12/13 where `TargetObject` contains '3E5FC7F9-9A51-4367-9063-A120244FBEC7' or '3E000D72-A845-4CD9-BD83-80C07C3B881F'.",
              "Maintain a 90-day baseline of cmstp.exe command-line arguments per user and host. Generate an alert if cmstp.exe is executed with the '/au' switch by a user or on a host for the first time in the baseline period. This indicates a first-time, potentially anomalous behavior.",
              "Utilize a sequence mining algorithm to analyze ordered event logs (Sysmon 1, 10, 12, 13) on each host. Train the model to recognize the specific multi-event sequence of the UAC bypass. Flag any host event stream that matches the malicious sequence with a high probability score."
            ]
          },
          {
            "description": "An instance of cmstp.exe is executed from a file path other than 'C:\\Windows\\System32\\cmstp.exe' or its parent process is not a standard shell (e.g., 'explorer.exe', 'cmd.exe') or known administrative tool.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1: Process Creation"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Terminal Servers",
            "action": [
              "Create an alert for any Sysmon Event ID 1 where `process.executable` ends with '\\cmstp.exe' but the full path is not 'C:\\Windows\\System32\\cmstp.exe' (case-insensitive) OR where the `parent.process.executable` is not in an approved list (e.g., 'explorer.exe', 'cmd.exe', 'mmc.exe').",
              "On a weekly basis, tabulate all parent-child process relationships involving 'cmstp.exe' as the child. Calculate the frequency of each parent process across the enterprise. Any parent process that accounts for less than 1% of all cmstp.exe executions should be flagged for investigation as a rare occurrence.",
              "Apply an Isolation Forest anomaly detection model to all process creation events. Use features such as `parent.process.name`, `process.executable.path`, `user.name`, and command-line entropy. Review all cmstp.exe executions that are assigned a high anomaly score by the model."
            ]
          },
          {
            "description": "An execution of cmstp.exe is observed spawning a suspicious child process (e.g., powershell.exe, rundll32.exe) or initiating network connections with highly regular time intervals and consistent data packet sizes, indicative of C2 beaconing.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1: Process Creation",
              "Sysmon Event ID 3: Network Connection",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Network Egress Points/Gateways",
            "action": [
              "Generate an alert for any Sysmon Event ID 1 where `parent.process.name` is 'cmstp.exe' and the `process.name` is one of: 'powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', 'rundll32.exe', 'mshta.exe'.",
              "For network connections originating from the cmstp.exe process ID (Zeek conn.log), group connections by destination IP and port over a 1-hour window. Calculate the standard deviation of the time delta between connections and the standard deviation of the `orig_bytes` field. Alert if both standard deviations are below a low threshold (e.g., < 2 seconds for time, < 10 bytes for size), suggesting automated beaconing.",
              "Model process execution chains as directed graphs. Use a graph-based anomaly detection algorithm to identify cmstp.exe as a node with unusual child processes or a high out-degree (spawning many children) compared to a learned baseline of normal system activity graphs."
            ]
          },
          {
            "description": "A file with a '.inf' extension is created in a user-writable directory (e.g., %TEMP%, %APPDATA%), referenced in the command line of a cmstp.exe execution, and then deleted within 60 seconds of its creation.",
            "data_sources": [
              "Sysmon Event ID 11: File Create",
              "Sysmon Event ID 1: Process Creation",
              "Sysmon Event ID 23: File Delete"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers",
            "action": [
              "Using a stateful detection engine, trigger an alert when the following sequence occurs for the same file path within a 60-second window: (1) Sysmon Event ID 11 (FileCreate) for `*.inf` in a temporary directory, (2) Sysmon Event ID 1 (ProcessCreate) for `cmstp.exe` with the `*.inf` path in its command line, and (3) Sysmon Event ID 23 (FileDelete) for the same `*.inf` file.",
              "For all INF files, calculate the file lifetime by subtracting the Sysmon Event ID 11 timestamp from the Sysmon Event ID 23 timestamp. Plot the distribution of these lifetimes. Investigate all INF files with a lifetime in the bottom 1st percentile (e.g., less than 10 seconds), especially if they were referenced by a cmstp.exe process.",
              "Train a classifier (e.g., Gradient Boosting) on event triplets (FileCreate, ProcessCreate, FileDelete). Features should include file path, file extension, process name, process command line, and the time deltas between the three events. The model will learn to classify these sequences as benign (e.g., legitimate installer) or malicious (e.g., ephemeral script execution)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]