[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by proxying execution through signed binaries?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.013",
        "name": "Mavinject",
        "evidence": [
          {
            "description": "An execution of mavinject.exe where the injected DLL hash matches a known-malicious signature, or the target process initiates network connections to a destination IP/domain with a reputation score below a specified threshold (e.g., < 20/100).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers; Network egress points (e.g., perimeter firewalls, web proxies); Threat Intelligence Platform (TIP).",
            "action": [
              "For each mavinject.exe execution (Windows Event ID 4688), extract the injected DLL path. Correlate with file creation events or use Zeek files.log to retrieve the DLL's MD5/SHA256 hash. Query a threat intelligence feed for this hash and alert on any match.",
              "From the mavinject.exe command line (Windows Event ID 4688), extract the target PID. Correlate this PID with network logs (Zeek conn.log) within a 5-minute window post-injection. For each outbound connection, enrich the destination IP with reputation data. Calculate the average reputation score for all connections from the PID. Alert if the average score falls below a set threshold (e.g., 20/100).",
              "Train a logistic regression classifier on enriched network connection data (Zeek conn.log, dns.log) from known benign and malicious processes. Features should include destination IP/domain reputation, port entropy, connection duration, and data volume ratio (sent vs. received). Apply the model to classify network connections from processes injected by mavinject.exe."
            ]
          },
          {
            "description": "An execution of mavinject.exe where the command line includes '/INJECTRUNNING' or '/HMODULE' and the specified DLL path corresponds to a directory with an enterprise-wide prevalence in the bottom 5th percentile or is a known non-standard executable location (e.g., C:\\Users\\Public, C:\\Windows\\Temp, %APPDATA%).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers; User profile directories (C:\\Users\\*); System temporary folders (C:\\Windows\\Temp).",
            "action": [
              "Create a SIEM rule to detect process creation events (Windows Event ID 4688) where the ProcessCommandLine contains '/INJECTRUNNING' or '/HMODULE' and the DLL path specified in the command line matches a watchlist of suspicious directories (e.g., C:\\Windows\\Temp, %APPDATA%, C:\\PerfLogs, C:\\Users\\Public).",
              "For all process executions containing '/INJECTRUNNING' or '/HMODULE' in the command line (Windows Event ID 4688), extract the directory from the DLL file path. Maintain a 90-day baseline of directory path prevalence across the enterprise. Flag any injection using a DLL from a directory in the bottom 5th percentile of prevalence as highly suspicious.",
              "Train an Isolation Forest model on features extracted from DLL file paths used in injection events. Features should include path depth, directory name string entropy, presence of keywords (e.g., 'temp', 'public'), and character frequency. Use the trained model to score new injection paths, flagging those identified as anomalies."
            ]
          },
          {
            "description": "An execution of mavinject.exe where the parent process is a common user application (e.g., winword.exe, powershell.exe, chrome.exe) and the target process, identified by its PID in the command line, is a critical system process (e.g., lsass.exe, services.exe, svchost.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers; Critical application servers; Process creation logs from all Windows endpoints.",
            "action": [
              "Create a detection rule that triggers on a Windows Event ID 4688 event where NewProcessName is 'mavinject.exe', the ParentProcessName is in a set of suspicious parents (e.g., winword.exe, excel.exe, outlook.exe, powershell.exe, mshta.exe), and the command line specifies a target PID that resolves to a process in a set of sensitive targets (e.g., lsass.exe, csrss.exe, winlogon.exe, services.exe).",
              "For every mavinject.exe execution (Windows Event ID 4688), construct a triplet of (ParentProcessName, NewProcessName, TargetProcessName) by resolving the target PID. Calculate the frequency of each triplet based on 90 days of historical data. Flag any observed triplet that falls into the bottom 1st percentile of frequency as a rare and suspicious event chain.",
              "Model normal process ancestry using a graph database. Ingest Windows Event ID 4688 logs to build nodes (processes) and edges (parent-child relationships). Use a graph-based anomaly detection algorithm to identify and score rare paths. An event chain like 'winword.exe -> mavinject.exe -> lsass.exe' would appear as a high-scoring anomalous path, indicating a significant deviation from the baseline."
            ]
          },
          {
            "description": "The first observed execution of mavinject.exe on a given host within a defined lookback period (e.g., 90 days), or an enterprise-wide hourly execution count of mavinject.exe that exceeds 3 standard deviations above the 30-day moving average.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise-wide process execution logs stored in a SIEM; Host-based asset inventory; Baselining data for normal process counts.",
            "action": [
              "Maintain a stateful list or lookup table of all hosts that have executed mavinject.exe in the past 90 days. Trigger an alert for any mavinject.exe execution (Windows Event ID 4688) on a host not present in this list.",
              "Calculate an hourly moving average and standard deviation of mavinject.exe execution counts across the enterprise over the past 30 days. Generate an alert if the current hourly count exceeds the moving average by more than 3 standard deviations, indicating a statistically significant spike in activity.",
              "Apply a time-series decomposition model (e.g., Seasonal-Trend-Loess) to the hourly execution counts of mavinject.exe. A significant spike in the residual component, which represents unexplained variance or noise, can be used to detect anomalous bursts of activity that do not fit learned seasonal or trend-based patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]