[
  {
    "information_requirement": "Is an adversary leveraging remote document templates to execute malicious code for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1221",
        "name": "Template Injection",
        "evidence": [
          {
            "description": "An Office application process (e.g., winword.exe, excel.exe) initiates a network connection to download a remote template, and the destination URL/domain/IP is found on a threat intelligence feed, or the hash of the downloaded template file matches a known malicious signature.",
            "data_sources": [
              "Sysmon Event ID 3",
              "Sysmon Event ID 22",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewall logs, Web proxy logs, DNS server logs, User workstations",
            "action": [
              "Create a SIEM rule to cross-reference destination URLs, domains, and IPs from network connection events (Sysmon Event ID 3, Zeek conn.log) and DNS queries (Sysmon Event ID 22, Zeek dns.log) against threat intelligence feeds. Additionally, compare file hashes from Zeek files.log against known malware hash databases. Alert on any match originating from an Office application process.",
              "For network connections from Office applications, calculate the historical rarity of the destination TLD+1 based on the last 90 days of DNS logs. Generate an alert for any connection to a domain in the bottom 5th percentile of frequency, indicating it is statistically uncommon for the organization.",
              "Implement a URL classification model (e.g., Random Forest) trained on lexical features (length, entropy, special characters, domain age). Score all URLs requested by Office applications in real-time and investigate any URL classified as malicious with high confidence."
            ]
          },
          {
            "description": "An Office application (e.g., winword.exe, excel.exe, powerpnt.exe) spawns a child process whose command-line arguments contain strings or patterns indicative of remote payload download and execution.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers, Virtual Desktop Infrastructure (VDI) hosts",
            "action": [
              "Deploy a detection rule that scans the command-line arguments of child processes spawned by Office applications for high-confidence regular expressions indicative of second-stage execution, such as 'IEX(New-Object Net.WebClient).DownloadString', 'mshta.exe http', 'certutil -urlcache', or 'rundll32.exe javascript:'. Alert on any match.",
              "For each child process spawned by an Office application, calculate the Shannon entropy of its command-line arguments. Establish a baseline of normal entropy values and alert when a command line's entropy exceeds the 98th percentile, which can indicate the presence of encoded or obfuscated commands.",
              "Implement a command-line classification model (e.g., Naive Bayes with TF-IDF features) trained on known malicious and benign command lines. Automatically classify the command-line arguments of all child processes spawned by Office applications and create high-priority alerts for those classified as malicious."
            ]
          },
          {
            "description": "An RTF file contains the '*\\template' control word that references a remote resource via an HTTP/S URL or a UNC path, indicating a potential remote template injection.",
            "data_sources": [
              "Zeek files.log",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Email gateway file attachments, User workstations' file systems",
            "action": [
              "Inspect the content of RTF files captured via Zeek files.log or from endpoints following a FileCreate event (Sysmon Event ID 11). Use a regular expression to search for the literal strings '*\\template http' or '*\\template \\\\' to detect remote template injection attempts. Alert on any match.",
              "Monitor the frequency of RTF files containing the '*\\template' control word over time. While legitimate use exists, a sudden spike in its occurrence is anomalous. Alert on counts that represent a statistically significant increase (e.g., a 3-sigma deviation from the 30-day moving average).",
              "Train a supervised classification model (e.g., Support Vector Machine) on features extracted from RTF files (e.g., presence of '*\\template http', file size, number of embedded objects). Deploy the model to scan and classify all new RTF files, alerting on those predicted to be malicious."
            ]
          },
          {
            "description": "An Office application spawns a child process not typically associated with its normal operation, such as a command shell (cmd.exe), scripting interpreter (powershell.exe, wscript.exe), or a known Living-off-the-Land Binary (LOLBin).",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Application servers, Terminal servers",
            "action": [
              "Create and enforce an explicit allow-list of legitimate child processes for each Office application. Generate a high-priority alert for any parent-child process relationship not on this list, especially for suspicious children like cmd.exe, powershell.exe, wscript.exe, cscript.exe, mshta.exe, and certutil.exe.",
              "For each host, build a frequency table of all parent-child process relationships involving Office applications over a 30-day baseline period. Calculate the probability of each unique relationship. Alert when a relationship occurs that is statistically rare (e.g., has a probability of less than 0.01) for that host or across the enterprise.",
              "Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on features of process creation events (parent process name, child process name, user context). The model will learn a baseline of normal activity. Flag any new process creation event originating from an Office application that the model identifies as an outlier."
            ]
          },
          {
            "description": "An Office application process initiates an outbound SMB (TCP/445) connection to an external IP address, triggered by a template's remote resource reference, in an attempt to force NTLM authentication and capture credentials.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Security Event ID 5156",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewall logs, User workstations, Internal network segments, Domain Controllers",
            "action": [
              "Create a high-severity alert for any network connection event (Sysmon Event ID 3 or Zeek conn.log) where an Office application process initiates an outbound connection on TCP port 445 to an external (non-RFC1918) IP address.",
              "Profile the set of internal servers accessed via SMB by each user over a 30-day baseline. Alert when an Office application initiates an SMB connection to a server that is not on the user's established baseline, indicating an unusual destination.",
              "Implement a time-series anomaly detection model (e.g., SARIMA) to monitor the volume of outbound TCP/445 connections originating from Office applications. Train the model on historical data to forecast expected volumes and alert when a statistically significant deviation from the forecast occurs, potentially indicating a large-scale campaign."
            ]
          },
          {
            "description": "A correlated sequence of events is observed on a single host within a short time window: 1) An Office application makes a network connection to a statistically rare external domain, followed by 2) the spawning of a scripting interpreter or LOLBin by that same Office process.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 22",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM correlation engine, User workstations, DNS server logs, Web proxy logs",
            "action": [
              "Create a stateful correlation rule that triggers when, for a single host, an Office process makes a network connection to a domain on a CTI blocklist, and within 60 seconds, the same process ID spawns a child process like powershell.exe or cmd.exe.",
              "Develop a composite risk score by assigning points to suspicious events (e.g., +15 for an Office app spawning cmd.exe, +25 for a network connection to a domain in the bottom 5% of popularity). Correlate events by host and time, and alert if the cumulative score for a sequence exceeds a defined threshold (e.g., 35 points in 5 minutes).",
              "Deploy a sequence-based anomaly detection model (e.g., LSTM autoencoder) trained on typical endpoint event sequences (process, network, file events). Feed real-time event sequences from each host into the model and alert when the model's reconstruction error for a sequence involving an Office application exceeds a predefined threshold, indicating a novel and potentially malicious chain of actions."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage, Inc."
    ]
  }
]