[
  {
    "information_requirement": "Is an adversary's payload performing environment-specific checks to constrain its execution to an intended target?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1480",
        "name": "Execution Guardrails",
        "evidence": [
          {
            "description": "A process is created, performs multiple system enumeration checks (e.g., for domain name, specific registry keys, hardware properties), and then terminates in under 5 seconds without initiating network connections or writing files.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints (Workstations, Laptops), Virtual Desktop Infrastructure (VDI) Environments, Security Analyst and Developer Workstations",
            "action": [
              "Define a list of guardrail-related registry keys (e.g., 'HKLM\\SOFTWARE\\VMware, Inc.', 'HKLM\\SYSTEM\\CurrentControlSet\\Services\\VBoxGuest') and file paths ('C:\\Windows\\System32\\drivers\\VBoxMouse.sys'). Create a SIEM rule to alert when a process (Windows Event ID 4688) accesses one of these objects (Windows Event ID 4663) and then terminates (Windows Event ID 4689) within 5 seconds of creation.",
              "For each process creation event (Windows Event ID 4688), count the number of subsequent object access events (Windows Event ID 4663) and WMI queries within the first 5 seconds of its life. Establish a baseline count for legitimate processes. Flag any process where the count of these discovery activities exceeds the 95th percentile for that process name, especially if it terminates (Windows Event ID 4689) immediately after.",
              "Train a Random Forest classifier on labeled process execution data. Extract features from the first 5 seconds of a process's life, including: parent process name, command line arguments, a count of system-querying API calls, and a boolean flag for short lifetime (<5s). Use the trained model to classify new processes as 'benign' or 'guardrailing'."
            ]
          },
          {
            "description": "A process is created with a command line that contains a sequence of system discovery commands (e.g., 'whoami', 'hostname', 'ipconfig /all') chained with conditional logic (e.g., '&&', '||') and string matching (e.g., 'findstr') to validate the target environment before proceeding.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints (Workstations, Laptops), Domain Controllers, Application Servers",
            "action": [
              "Deploy a regular expression-based detection rule to scan command lines in process creation events (Windows Event ID 4688). The pattern should look for combinations of discovery tools and conditional logic, such as `/(systeminfo|whoami|hostname|net user|quser).*(?:&&|\\|\\|).*findstr.*(corp\\.domain\\.com|SPECIFIC_HOSTNAME)/i`. Alert on matches, especially from unexpected parent processes like Microsoft Office applications.",
              "For each process creation event (Windows Event ID 4688), calculate the Shannon entropy of its command-line string. Establish a per-process-name baseline for command-line entropy. Generate an alert when a process's command-line entropy exceeds 3 standard deviations above the mean for its type, indicating unusually high complexity or obfuscation.",
              "Utilize a pre-trained NLP transformer model (e.g., a lightweight version of BERT) fine-tuned on a labeled dataset of malicious and benign command lines. Feed new command-line strings from process creation events (Windows Event ID 4688) into the model to classify them as 'benign', 'administrative script', or 'malicious guardrail check'. This can identify novel or obfuscated command patterns."
            ]
          },
          {
            "description": "A process is created and terminates in an abnormally short duration (e.g., less than 3 seconds), where this behavior is not typical for the specific process executable or the host system, and no corresponding network connections are observed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints (Workstations, Laptops), Network Egress Points, Honeypots",
            "action": [
              "Create a SIEM rule that joins process creation events (Windows Event ID 4688) with process termination events (Windows Event ID 4689) on the Process ID. Alert if `TerminationTime - CreationTime < 3 seconds`. Maintain and apply an allowlist of known-good, short-lived processes to reduce false positives.",
              "For each unique process name, calculate the historical distribution of its execution duration across the environment. Alert when a new instance of a process terminates with a duration that falls below the 5th percentile of its historical lifetime distribution, especially if the parent process is suspicious (e.g., 'winword.exe', 'powershell.exe').",
              "Apply a time-series anomaly detection model (e.g., Seasonal-ARIMA or LSTM) to a metric tracking the count of short-lived (<3s) processes per host, per hour. A sudden, statistically significant spike in this metric on a host, compared to its own baseline and its peers, indicates a potential malware outbreak where guardrails are failing."
            ]
          },
          {
            "description": "A single process instance, within its first 15 seconds, accesses a diverse set of system objects that are functionally unrelated, such as querying Active Directory domain information, reading security product registry keys, and enumerating hardware identifiers via WMI.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints, Domain Controllers, Servers hosting security agents or management consoles",
            "action": [
              "Define categories of guardrail-related objects (e.g., 'Security-Product-Registry', 'Hardware-WMI-Class', 'Domain-Info-LDAP', 'VM-Artifact-File'). Create a stateful rule that tracks object accesses (Windows Event ID 4663) per Process ID. Alert if a process accesses objects from 3 or more distinct categories within a 15-second window after creation (Windows Event ID 4688).",
              "For each process instance, collect the set of all registry keys and file paths accessed (Windows Event ID 4663) in its first 30 seconds. Calculate the Shannon entropy on the set of unique top-level registry hives (e.g., HKLM, HKCU) and parent directories accessed. A high entropy score, relative to the baseline for that process name, indicates probing of disparate system areas and is suspicious.",
              "Use a density-based clustering algorithm like DBSCAN on process activity vectors. For each process, create a feature vector representing the categories of objects it accessed (e.g., a multi-hot encoded vector). The algorithm will group normal processes with similar access patterns. Processes that do not belong to any cluster (identified as noise/outliers) have unique access patterns and are strong candidates for guardrailing malware."
            ]
          },
          {
            "description": "A process makes an outbound network connection to a legitimate, high-reputation domain (e.g., 'www.google.com', 'www.microsoft.com') which receives a successful HTTP response, immediately followed by a DNS query and connection attempt to a low-reputation, newly registered, or threat-intel-flagged domain.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, DNS Servers, Web Proxies, All Endpoints",
            "action": [
              "Create a stateful SIEM rule that correlates events per source IP. If a DNS query (Zeek dns.log) for a domain on a 'high-reputation' list is followed by a successful connection (Zeek conn.log), and then within 30 seconds a DNS query is made for a domain on a 'low-reputation' or 'newly-registered-domain' threat feed, generate an alert.",
              "For each source host, analyze sequences of outbound connections. For each domain contacted, assign a reputation score (e.g., 0-100 based on age, category, threat intel). Calculate the 'reputation drop' between consecutive new domains contacted. Flag any sequence where the score drops by more than 80 points (e.g., from 95 to 15) within a 60-second window, as this indicates a potential canary check followed by C2 communication.",
              "Model legitimate network behavior using a sequence analysis algorithm like a Hidden Markov Model (HMM) or an LSTM-based autoencoder. Train the model on sequences of (domain, port, protocol) tuples from Zeek logs. The model learns valid transitions between states. Flag connection sequences that have a very low probability under the trained model, indicating a deviation from normal application behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]