[
  {
    "information_requirement": "What data is available for threat detection and modeling?",
    "tactic_id": "D3-D",
    "tactic_name": "Detect",
    "indicators": [
      {
        "technique_id": "D3-NTA",
        "name": "Network Traffic Analysis",
        "evidence": [
          {
            "description": "Logs generated from network activity such as network flow metadata and network traffic content.",
            "data_sources": [
              "Network appliance logs",
              "NetFlow logs",
              "Zeek logs",
              "full packet capture (PCAP)"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inventory available network log sources (e.g., networking appliances, Zeek, PCAP). For each source, perform a time series analysis to visualize data volume over at least the last 30 days to identify collection gaps or anomalies. Use descriptive statistics to summarize key fields like protocol distribution in Zeek conn.log and the frequency of top requested domains in dns.log to establish a cursory understanding of network activity. Compare across data sources to validate collection consistency and identify individual sensor blind spots."
          },
          {
            "description": "The earliest and latest event timestamps for each network log source.",
            "data_sources": [
              "Network appliance logs",
              "NetFlow logs",
              "Zeek logs",
              "full packet capture (PCAP)"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each inventoried network log source, execute a query to retrieve the earliest (MIN) and latest (MAX) event timestamps. Compile the results into a data retention report, formatted as a table with columns for 'Log Source', 'Earliest Event', and 'Latest Event'. This report will define the total observational window for network analysis."
          }
        ]
      },
      {
        "technique_id": "D3-PM",
        "name": "Platform Monitoring",
        "evidence": [
          {
            "description": "Logs generated from host activity such as endpoint events, antivirus alerts, and endpoint detection and response agent logs.",
            "data_sources": [
              "Windows Event logs",
              "Sysmon events",
              "Unix auditd logs",
              "antivirus alerts",
              "EDR logs"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Catalog all available host log types (e.g., Windows Event Logs, Sysmon, EDR). For each source, perform a time series analysis to visualize data volume over at least the last 30 days to identify collection gaps or anomalies. Create a data coverage matrix by correlating available host log sources against the asset inventory, prioritizing critical servers and user endpoints. For key event types like process creation, use descriptive statistics (mean, median, stddev) to model normal activity per host/role and identify significant deviations that could indicate malicious activity or sensor failure."
          },
          {
            "description": "The earliest and latest event timestamps for each host log source.",
            "data_sources": [
              "Windows Event logs",
              "Sysmon events",
              "Unix auditd logs",
              "antivirus alerts",
              "EDR logs"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each cataloged host log source, execute a query to find the minimum (MIN) and maximum (MAX) event timestamps across all reporting hosts. Consolidate these findings into a data retention summary table with columns for 'Log Source', 'Earliest Event', and 'Latest Event'. This defines the analytical time frame available for host-based investigations."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]
