[
  {
    "Is the adversary attempting to blend command and control traffic by impersonating legitimate protocols or services? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1001.003 - Protocol or Service Impersonation": {
          "Network traffic exhibiting uncommon data flow patterns (e.g., unusually large client-to-server data volume compared to server-to-client).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log to calculate client-to-server and server-to-client data ratios for network connections, especially on common C2 ports (e.g., 80, 443, potentially high ports). Use descriptive statistics (mean, median, variance) and IQR/box plots to identify connections with highly anomalous data flow ratios compared to typical traffic patterns for that protocol/port."
          },
          "Network traffic on standard service ports (e.g., 80, 443) where packet content or TLS/SSL certificates do not conform to expected protocol behavior or exhibit characteristics of known impersonation techniques (e.g., fake handshakes, mismatched certs).": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek http.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ssl.log, http.log, and x509.log. Identify connections on standard ports (80, 443) that exhibit characteristics inconsistent with legitimate traffic: check for non-standard TLS handshakes, unexpected JA3 hashes, invalid or self-signed certificates on connections claiming to be SSL/TLS, or HTTP headers/URIs mimicking legitimate services but showing unusual patterns. Use correlation analysis to link potentially anomalous network sessions with suspicious host processes."
          },
          "Network connections to external IPs from processes that typically do not establish external network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline network activity for common processes using Zeek conn.log and Windows Event ID 5156. Identify processes (via Windows Event ID 4688) that are initiating external network connections (seen in 5156 or Zeek conn.log) but which historically have little to no external network activity. Flag connections initiated by these anomalous processes, especially if communicating on common C2 ports (80, 443, etc.) or high ports. Use frequency analysis and descriptive statistics on destination IPs/ports for flagged processes to identify unusual communication patterns."
          },
          "Network traffic masquerading as legitimate services (e.g., Google, Yahoo) exhibiting unusual patterns in HTTP headers, URIs, or connection timing inconsistent with the genuine service.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for connections to destination IPs/domains known to be adversaries or suspicious, or connections with common legitimate service indicators (e.g., URIs containing '/drive/', '/mail/') but directed towards non-standard or suspicious destination IPs. Analyze HTTP headers (e.g., User-Agent, Referer), request methods, URI structure, and session timing using descriptive statistics and correlation analysis to identify deviations from typical legitimate service traffic patterns. Use time series analysis to identify unusual session durations or frequency."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]