[
  {
    "Has the adversary obtained credentials from the proc filesystem? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1003.007 - Proc Filesystem": {
          "Execution of suspicious command-line tools or scripts often associated with credential dumping on potential target systems.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command-line arguments containing patterns associated with memory scraping or known credential dumping tool names (even if conceptually for Linux techniques like this). Use regex matching on command line arguments. Calculate frequency of suspicious command executions per host using descriptive statistics (e.g., counting occurrences per hour/day) and identify outliers (e.g., using IQR)."
          },
          "Unauthorized authentication attempts or successful logins using credentials potentially obtained from system memory.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek kerberos.log; Zeek ssh.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624/4625 (Logon/Logoff) and Zeek logs (kerberos.log, ssh.log) for successful logins using accounts potentially compromised via this technique. Identify logins from unusual source IPs or outside normal working hours using correlation analysis against historical login patterns for the affected account. Flag accounts exhibiting high entropy in source IPs or access times using entropy calculation."
          },
          "Outbound network connections with characteristics of data exfiltration (e.g., unusual volume, destination, protocol) originating from systems where potential credential access activity occurred.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ftp.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek logs (conn.log, http.log, ftp.log, dns.log) for hosts that recently triggered alerts for suspicious process activity (via Windows Event ID 4688). Analyze outbound connections for unusual data volume (use descriptive statistics like mean/sum of bytes transferred, IQR), destinations (correlation against known good destinations, entropy of destinations), or protocols (identify connections on non-standard ports). Correlate with DNS queries to potentially malicious domains using correlation analysis."
          },
          "Successful privilege escalation attempts or access to sensitive system resources using accounts that recently exhibited suspicious activity or were potentially compromised.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4672",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 for logon types indicative of privilege usage or remote access (e.g., Type 10, Type 9, Type 5) involving accounts suspected of compromise (based on previous alerts). Correlate with Windows Event ID 4672 (Admin logon) for the same accounts. Analyze timestamps using time series analysis to identify privileged access occurring shortly after potential credential acquisition events (e.g., suspicious 4688). Use correlation analysis to link account usage to access of sensitive network shares or critical systems."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]