[
  {
    "Is the adversary attempting to blend command and control traffic by impersonating legitimate protocols or services? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1001.003 - Protocol or Service Impersonation": {
          "Network traffic exhibiting uncommon data flow patterns (e.g., unusually large client-to-server data volume compared to server-to-client).": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log to calculate client-to-server and server-to-client data ratios for network connections, especially on common C2 ports (e.g., 80, 443, potentially high ports). Use descriptive statistics (mean, median, variance) and IQR/box plots to identify connections with highly anomalous data flow ratios compared to typical traffic patterns for that protocol/port."
          },
          "Network traffic on standard service ports (e.g., 80, 443) where packet content or TLS/SSL certificates do not conform to expected protocol behavior or exhibit characteristics of known impersonation techniques (e.g., fake handshakes, mismatched certs).": {
            "Data": "Zeek conn.log, Zeek ssl.log, Zeek http.log, Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ssl.log, http.log, and x509.log. Identify connections on standard ports (80, 443) that exhibit characteristics inconsistent with legitimate traffic: check for non-standard TLS handshakes, unexpected JA3 hashes, invalid or self-signed certificates on connections claiming to be SSL/TLS, or HTTP headers/URIs mimicking legitimate services but showing unusual patterns. Use correlation analysis to link potentially anomalous network sessions with suspicious host processes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]