[
    {
        "information_requirement": "Has the adversary accessed credentials from domain controllers?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1003.006",
                "name": "DCSync",
                "evidence": [
                    {
                        "description": "High-confidence threat notices generated by network security monitoring tools specifically identifying a DCSync attack.",
                        "data_sources": [
                            "Zeek notice.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Deploy and monitor Zeek's DCSync detection script (or an equivalent IDS/IPS signature). This script is designed to identify the specific sequence and content of RPC calls used by tools like Mimikatz, generating a high-fidelity notice (e.g., `Mimikatz::DCSync_Transaction` or `DCSync::Replication_From_Non_DC`) in Zeek's `notice.log`. Treat any such notice as a high-priority selector for an active attack and initiate immediate incident response."
                    },
                    {
                        "description": "Process creation events on non-domain controller systems for commands explicitly used to initiate a DCSync attack.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On all non-Domain Controller systems, monitor process creation events (Windows Event ID 4688) for command lines containing strings characteristic of DCSync tools. Use regular expression matching to search for patterns such as `lsadump::dcsync`, `secretsdump.py`, or other known tool commands that leverage this technique. An alert on a non-DC system provides an early detection opportunity before domain-wide credential compromise."
                    },
                    {
                        "description": "Directory replication requests (e.g., GetNCChanges) originating from an IP address or initiated by a user/computer account that is not authorized for replication.",
                        "data_sources": [
                            "Windows Event ID 4662",
                            "Zeek dcerpc.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain an explicit allow-list of authorized source IP addresses (all Domain Controllers) and authorized account SIDs (e.g., Domain Controllers group). On all Domain Controllers, monitor Windows Event ID 4662 for specific replication access GUIDs (e.g., DS-Replication-Get-Changes `1131f6aa-9c07-11d1-f79f-00c04fc2dcd2`) and Zeek dcerpc.log for the associated RPC calls (`IDL_DRSGetNCChanges`). Correlate the source IP address and the Subject/user account from the event against the respective allow-lists. Alert on any replication attempt originating from an unauthorized source IP or account, as this is a primary indicator of a DCSync attack."
                    },
                    {
                        "description": "Anomalous network traffic volume or connection patterns to a Domain Controller's RPC endpoints from a non-Domain Controller system.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dcerpc.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal replication traffic between known Domain Controllers, focusing on connection duration, frequency, and total bytes transferred over RPC ports (TCP 135 and the dynamic range 49152-65535). Monitor Zeek conn.log for connections to these ports originating from non-DC IPs. Use time series analysis to detect replication activity occurring outside of normal schedules. Employ descriptive statistics (mean, standard deviation) and outlier detection methods like Inter-Quartile Range (IQR) to flag connections with significantly higher data transfer volumes than the baseline, which may indicate a full `Ntds.dit` replication by an adversary."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
