[
  {
    "Is the adversary maintaining command and control using fallback channels? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1008 - Fallback Channels": {
          "Network sessions with unusual client-to-server/server-to-client byte ratios compared to expected protocol behavior.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log. For common protocols/ports (e.g., HTTP/S on 80/443, DNS on 53), calculate the ratio of 'orig_bytes' to 'resp_bytes'. Use descriptive statistics (mean, median, IQR) or clustering techniques to identify connections with significantly different byte ratios compared to the norm for that protocol/port."
          },
          "Network connections using unexpected protocols on common ports or originating from processes not typically involved in network communication.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for traffic using unexpected protocols on common ports (e.g., ICMP over port 80). Correlate network connections (Zeek conn.log, Windows Event ID 5156) with process creation/network activity logs (Windows Event ID 4688) on endpoints to identify network connections originating from processes with low frequency of network activity or unknown executables. Use frequency analysis on process names associated with network connections."
          },
          "Network connections originating from processes with no prior history of network communication or known to be non-network-aware.": {
            "Data": "Windows Event ID 5156; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 (Network Connection) events. For each connection, identify the associated process name and path (using Event ID 4688 if necessary). Maintain a historical record or baseline of processes that typically initiate outbound network connections per endpoint type. Flag connections initiated by processes not in the baseline or those with extremely low frequency of network activity using frequency analysis. Investigate the legitimacy of the process and the connection destination."
          },
          "Repeated network connections to the same external destination IP address or domain name from the same internal host or process over time, particularly on non-standard ports or outside normal activity periods.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and Windows Event ID 5156 events to identify recurring connections (same source host/process to same destination IP/domain). Filter for connections on ports not typically associated with common user applications (e.g., not 80, 443, 53, etc.). Use time series analysis to track the frequency and timing of these connections. Flag internal hosts exhibiting persistent, low-volume, or unusual-timing connections to the same external destinations. Calculate connection frequency over time and use thresholds to identify persistent connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]