[
  {
    "Is the adversary using junk data in command and control communications? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1001.001 - Junk Data": {
          "Network connections exhibiting unusual data flow patterns (e.g., excessive client-to-server data compared to server-to-client).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, specifically 'orig_bytes' and 'resp_bytes'. Calculate the byte ratio (client-to-server vs server-to-client) for various connections. Identify connections with significantly skewed ratios, particularly connections where the client sends much more data than it receives, using statistical outliers detection (e.g., z-score, IQR) on the byte ratio distribution per destination port or protocol."
          },
          "Network traffic containing non-standard or malformed data payloads for the observed protocol/port, potentially indicative of appended/prepended junk.": {
            "Data": "Zeek weird.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (e.g., http.log, dns.log, weird.log) for connections on standard ports exhibiting non-standard or malformed payload structures or flags set incorrectly. Identify suspicious content within payloads that does not conform to expected protocol formats, potentially using pattern matching or entropy analysis to detect high randomness in non-encrypted traffic sections."
          },
          "Network connections associated with processes that typically do not perform network communication or have unusual network activity baselines.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation (Event ID 4688) and network connection (Event ID 5156) logs from endpoints/servers. Correlate Event ID 5156 entries with Zeek conn.log entries using timestamp, source/dest IP, and ports to identify the process responsible for a given network connection. Establish a baseline of normal network activity per process/executable path using descriptive statistics (e.g., average bytes sent/received, connection frequency). Flag connections initiated by processes with no prior network activity baseline or exhibiting connection patterns significantly deviating from their established norms (e.g., using statistical change detection)."
          },
          "Network connections on standard ports exhibiting data payload characteristics inconsistent with the expected protocol behavior or unusual payload size variations.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections on standard application ports (e.g., 80, 443, 53). Correlate with Zeek protocol logs (http.log, dns.log, ssl.log). Look for unusual 'orig_bytes'/'resp_bytes' values or ratios that cannot be explained by the parsed protocol data in corresponding logs. Use statistical methods (e.g., descriptive statistics, IQR) to profile expected byte counts and ratios for common protocols on specific ports and flag significant deviations. Examine relevant protocol logs (e.g., http.log) for unusual request/response sizes or structural anomalies that might contain junk data, beyond simple malformed headers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]