[
    {
        "information_requirement": "Is the adversary using steganography for command and control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1001.002",
                "name": "Steganography",
                "evidence": [
                    {
                        "description": "Files transferred over the network matching known hashes of steganography tools, or network connections to C2 infrastructure known to leverage steganography.",
                        "data_sources": [
                            "Zeek files.log",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate file hashes from files extracted via Zeek files.log and process hashes from Windows Event ID 4688 against a CTI feed of known steganography tool hashes. Separately, inner join destination IP addresses from Zeek conn.log with a CTI feed of C2 servers known to use steganography. Alert on any confirmed matches."
                    },
                    {
                        "description": "Identification of specific artifacts or structural markers within file metadata or headers that are characteristic of known steganography tools.",
                        "data_sources": [
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For files extracted via Zeek files.log (especially image, audio, and PDF files), perform automated metadata analysis. Scan EXIF data, comments, and other metadata fields for keywords, version numbers, or markers known to be inserted by common steganography tools. Maintain and use a library of regular expressions to match these tool-specific patterns and alert on detections."
                    },
                    {
                        "description": "Anomalous file sizes for common media types (e.g., PNG, JPG, WAV) that deviate significantly from historical baselines, potentially indicating embedded data payloads.",
                        "data_sources": [
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek files.log to establish a dynamic baseline of file sizes (mean, median, standard deviation) for common media file MIME types transferred within the network. Use statistical methods, such as calculating Z-scores or using the inter-quartile range (IQR) & box-plots, to flag files with sizes that are significant outliers (e.g., > 3 standard deviations from the mean). Investigate these anomalous files for other signs of steganography."
                    },
                    {
                        "description": "A process not typically associated with network communication (e.g., an image viewer, simple editor) initiates an external network connection, especially one involving the transfer of media files.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 5156 (Network Connection). Maintain a baseline of common network-aware processes using descriptive statistics on historical data. Alert when a process on the low-frequency list (e.g., mspaint.exe) initiates an external network connection. Use Zeek conn.log to enrich this alert by confirming the connection transferred a media file, which is highly anomalous behavior for such a process."
                    },
                    {
                        "description": "High entropy or statistical anomalies in the least significant bits (LSB) of transferred image files, indicating the presence of embedded, likely encrypted, data.",
                        "data_sources": [
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For image files extracted via Zeek files.log, perform automated statistical steganalysis. Extract the least significant bit (LSB) plane of the image's pixel data. Calculate the entropy of the LSB plane; a value close to the maximum (e.g., > 7.5 for an 8-bit plane) suggests randomly distributed data, characteristic of an embedded encrypted payload. Use correlation analysis to compare this to the entropy of higher-order bit planes, which should be significantly lower for natural images. A large discrepancy is a strong indicator of LSB steganography."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
