[
    {
        "information_requirement": "Is the adversary collecting data from local systems?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1005",
                "name": "Data from Local System",
                "evidence": [
                    {
                        "description": "Execution of a process with a file hash known to be associated with a malicious data collection tool or specific malware family.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events. Ensure process auditing is configured to include process hashes. Correlate the hashes of newly executed processes against a high-confidence threat intelligence feed of known malicious file hashes associated with data collection tools or malware variants. Alert on any match and isolate the host for further investigation."
                    },
                    {
                        "description": "Execution of native system utilities or scripting languages (e.g., findstr, dir, tar, PowerShell) with command-line arguments explicitly targeting sensitive file types or keywords.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) and 4104 (PowerShell Script Block Logging) for command-lines or script blocks containing patterns indicative of data discovery and staging. Use regular expressions to search for: 1) File search commands targeting sensitive extensions (e.g., *.doc, *.xls, *.pdf, *.kdbx, *.config, *.pem). 2) Use of archiving tools (tar, zip, 7z, rar) to compress data, especially when targeting user profile directories or system configuration paths. Correlate these patterns with the executing user and process to identify anomalous activity."
                    },
                    {
                        "description": "Anomalous high-volume file access from a single process, suggesting indiscriminate data gathering from the local system.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable and monitor Windows Event ID 4663 (An attempt was made to access an object) for file access events, focusing on read operations. Correlate these events by Process ID/Name (from the parent Event ID 4688). For a given process, calculate the number of unique files accessed and the number of unique directories traversed within a short time window (e.g., 5 minutes). Use statistical methods (e.g., Z-score, Inter-Quartile Range) to alert on processes that exhibit significantly higher file access counts than an established baseline, indicating mass data collection behavior."
                    },
                    {
                        "description": "File collection activity occurring in an anomalous context, such as from an unusual parent process, by a user outside of normal hours, or by a process accessing files outside its expected scope.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal process execution chains (parent-child relationships) and user file access patterns. Monitor for anomalies such as: 1) A common productivity application (e.g., winword.exe) spawning a command shell (cmd.exe) that performs file searching. 2) A web server process (e.g., w3wp.exe) reading files outside of its web root. 3) Any significant file collection activity initiated by a system account outside of scheduled administrative tasks. Use time series analysis to detect collection activity occurring outside of normal business hours for a given user or host."
                    },
                    {
                        "description": "Execution of specific configuration export commands on network devices, particularly when directed to a file or an external server.",
                        "data_sources": [
                            "Zeek syslog.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek syslog.log (with logs forwarded from network devices) for command execution patterns like 'show running-config', 'copy running-config tftp', or 'copy startup-config scp'. While 'show' commands are common for diagnostics, the pattern of copying the entire configuration to an external location via TFTP, FTP, or SCP is a strong indicator of collection. Use correlation analysis to link the command execution with the user account and source IP, flagging any activity from non-standard administrative accounts or subnets."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
