```json
[
  {
    "Has the adversary obtained credentials from the proc filesystem? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1003.007 - Proc Filesystem": {
          "Execution of known credential dumping tools that interact with the /proc filesystem on Linux systems, identified by name or file hash.": {
            "Data": "Linux Auditd logs; Sysmon for Linux Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process execution logs (Linux Auditd execve syscalls or Sysmon for Linux Event ID 1) for the execution of known /proc-scraping tools by name or file hash (e.g., Mimipenguin, procdump for Linux, custom scripts). Maintain and correlate against a high-fidelity list of malicious tool names and hashes. Alert on any matches and investigate parent process and subsequent activity."
          },
          "Use of common system utilities (e.g., grep, strings, dd) with command-line patterns targeting sensitive memory locations within the /proc filesystem, such as '/proc/[pid]/mem'.": {
            "Data": "Linux Auditd logs; Sysmon for Linux Event ID 1; Shell history logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor command-line logs for the execution of utilities like `grep`, `strings`, `cat`, `dd`, or `gdb` with arguments targeting `/proc/*/mem`, `/proc/*/maps`, or `/proc/*/cmdline`. Use regular expression matching to detect patterns such as `grep -i 'password' /proc/*/maps` or `dd if=/proc/[0-9]*/mem`. Calculate the frequency of such commands per host and user using descriptive statistics; use Inter-Quartile Range (IQR) to identify anomalous usage patterns not associated with legitimate debugging or administration."
          },
          "Anomalous inter-process memory access via the /proc filesystem, where an unexpected source process reads the memory of a sensitive target process.": {
            "Data": "Sysmon for Linux Event ID 10; Linux Auditd logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Using Sysmon for Linux Event ID 10 (ProcessAccess) or correlated Auditd syscalls (e.g., ptrace, open), create a baseline of normal inter-process memory access patterns (e.g., legitimate debuggers, system monitoring tools). Alert when a process accesses another process's memory in a way that deviates from this baseline. Prioritize alerts where the source process is network-facing (e.g., nginx, apache), user-initiated (e.g., bash), or otherwise unexpected, and the target process is a known credential holder (e.g., sshd, sudo, gnome-keyring, database processes). Use frequency analysis and correlation to identify rare source/target process access pairs."
          },
          "Anomalous authentication activity or lateral movement originating from a host shortly after suspicious /proc filesystem access was observed.": {
            "Data": "Linux Auditd logs; Zeek ssh.log; Zeek kerberos.log; Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate hosts that triggered any /proc access alerts with subsequent authentication events observed on the network. Analyze Zeek logs (ssh.log for new SSH sessions, kerberos.log for new ticket requests) or Windows logs (Event ID 4624 for logins to Windows systems) for successful authentications originating from the Linux host in question. Use correlation analysis to link the timing of the /proc access event (within minutes to hours) with the first new successful login to another system. Flag and investigate any such correlated authentication, especially to unusual destinations or with user accounts not typically used from that source host."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```