[
  {
    "Is the adversary using steganography for command and control? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1001.002 - Steganography": {
          "Unusual data flow patterns (e.g., large outbound data transfers from client to server) associated with common steganography channels (e.g., image, audio, video file transfers).": {
            "Data": "Zeek conn.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and file.log. Identify connections transferring file types commonly used for steganography (e.g., JPG, PNG, WAV). Calculate byte counts for client-to-server and server-to-client flows for these connections. Flag sessions where the client-to-server data size significantly exceeds the server-to-client size, using statistical methods like standard deviation or percentile analysis to define 'significantly exceeds'."
          },
          "Network traffic containing data that does not conform to expected protocol behavior for the communication port or identifiable hidden content within seemingly benign files (e.g., images).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek conn.log and http.log for traffic on common ports that shows unusual data patterns or structures. Correlate network traffic events (from Zeek) with process creation events (Windows Event ID 4688) to identify suspicious processes initiating communication. Analyze transferred files logged by Zeek (file.log) for anomalies that could indicate hidden data (e.g., using entropy measures if supported by logging)."
          },
          "Network connections originating from processes known to be associated with image/multimedia processing or non-standard applications, particularly if these processes have no normal network communication history or exhibit unusual data transfer patterns.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 5156 (Network Connection) and Zeek conn.log. Identify processes initiating external network connections that are not typically network-aware (e.g., image editors, media players not streaming) or have no historical network activity baseline. Use frequency analysis on process names observed making network connections. Investigate connections from rare or new processes exhibiting unusual data flow characteristics (e.g., high client-to-server bytes relative to server-to-client bytes in Zeek conn.log) compared to a calculated baseline."
          },
          "Anomalies in transferred file properties (size, metadata) or associated network protocol behavior indicative of hidden data.": {
            "Data": "Zeek file.log; Zeek http.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek file.log to identify transferred files, focusing on types commonly used for steganography (JPG, PNG, WAV, PDF, etc.). Calculate file size statistics (mean, standard deviation, IQR) for these types and flag outliers (e.g., using z-scores or IQR). Examine http.log for unusual headers or body sizes during transfers. Review weird.log for connections involving these transfers for protocol anomalies. Correlate file transfers with unusual data flow patterns detected via conn.log. Use entropy analysis on file content if this capability is available via logging or processing pipeline to detect randomness indicative of hidden data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]