[
  {
    "Has the adversary attempted to access credentials from LSASS memory? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1003.001 - LSASS Memory": {
          "Unexpected process attempting to access LSASS.exe memory (e.g., process injection, opening handle).": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event ID 4656 for handle requests targeting lsass.exe. Filter events for access masks indicating read access (e.g., PROCESS_VM_READ, PROCESS_QUERY_INFORMATION). Identify and analyze the frequency and source process name of such handle requests, flagging those from processes not typically interacting with LSASS memory. Use descriptive statistics to highlight processes with unusual access patterns compared to baselines."
          },
          "Execution of command-line tools or scripts known to dump LSASS memory (e.g., procdump, rundll32 with comsvcs.dll, Invoke-Mimikatz).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event ID 4688 for new process creations. Search the command line arguments field for strings associated with LSASS dumping tools (e.g., 'procdump', 'comsvcs.dll', 'MiniDump', 'mimikatz', 'sekurlsa', 'Invoke-Mimikatz'). Use correlation analysis to link flagged process executions with preceding or subsequent events on the host or network."
          },
          "Modification of Security Package registry keys to load malicious SSP DLLs into LSASS.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event ID 4657 for modifications to the registry keys HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Security Packages and HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\OSConfig\\Security Packages. Identify new DLL paths or suspicious modifications to existing entries. Compare new entries against a list of known legitimate SSP DLLs (e.g., msv1_0.dll, wdigest.dll, kerberos.dll, credssp.dll). Flag events where unknown DLLs are added. Use frequency analysis on observed registry modifications to identify unusual activity."
          },
          "Suspicious child process creation by processes running as SYSTEM, potentially indicating abuse of legitimate tools or services for LSASS dumping.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event ID 4688 for process creations by processes running under the SYSTEM account. Filter events for parent process names associated with legitimate remote access/admin tools or suspicious services. Analyze the command line of the child process for strings indicative of LSASS dumping tools/techniques (e.g., 'procdump', 'MiniDump', 'comsvcs.dll'). Identify instances where legitimate tools are used to execute suspicious child processes using correlation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]