
[
  {
    "Is the adversary attempting to discover system services? (TA0007 - Discovery)": {
      "Indicators": {
        "T1007 - System Service Discovery": {
          "Execution of system service discovery commands with highly specific, non-standard parameters or syntax known to be used by particular malware or threat actor groups.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and monitor for a list of exact, high-fidelity command-line strings and arguments associated with specific threat actor discovery tools. Scan Windows Event ID 4688 process creation logs for these exact string matches. This is distinct from general pattern matching as it targets unique, static indicators of a specific malicious tool or script."
          },
          "Execution of common system service discovery utilities (e.g., sc.exe, tasklist.exe, net.exe) from an unusual or suspicious parent process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the new process is `sc.exe`, `tasklist.exe`, or `net.exe`. Analyze the parent process that spawned it. Flag and investigate instances where the parent process is not a standard interactive shell (e.g., `cmd.exe`, `powershell.exe`) or system process, but is instead an office application (`winword.exe`, `excel.exe`), web server (`w3wp.exe`), or other unexpected process. Maintain a baseline of common parent-child relationships to identify these anomalies."
          },
          "Use of PowerShell or WMI to enumerate system services, especially when part of a larger, obfuscated discovery script.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 (PowerShell Script Block Logging) for script content containing service discovery cmdlets like `Get-Service`, `Get-WmiObject -Class Win32_Service`, or `Get-CimInstance -ClassName Win32_Service`. Analyze the surrounding script context for signs of obfuscation (e.g., concatenation, base64 encoding) or combination with other discovery commands. Also monitor Windows Event ID 4688 for `wmic.exe` process execution with the `service list` alias, and correlate its parent process."
          },
          "A high frequency or burst of diverse system service discovery commands executed by a single user or on a single host within a short timeframe, deviating from established baselines.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate service discovery command executions (e.g., `sc query`, `tasklist /svc`, `net start`, `Get-Service`) by host and user account over rolling time windows (e.g., 10 minutes). Establish a baseline for the normal frequency and diversity (using entropy measures) of these commands for different user roles and host types. Use statistical methods like Inter-Quartile Range (IQR) or Z-score analysis to detect significant spikes in command execution frequency or command entropy, indicating an abnormal burst of discovery activity."
          },
          "System service discovery activity chained with other discovery techniques or followed by actions consistent with lateral movement preparation.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a composite detection that triggers when system service discovery (T1007) is observed within a specific timeframe (e.g., 60 minutes) of other discovery activities (e.g., `net user`, `arp -a`, `ipconfig` from Event ID 4688) or subsequent suspicious actions (e.g., LSASS memory access, new outbound RDP/SMB connections seen in Zeek conn.log). Use correlation analysis to link these events by host, user, and timestamp to identify the logical progression of an attack chain."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
