[
  {
    "Has the adversary attempted to access credentials stored in the SAM database? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1003.002 - Security Account Manager": {
          "Access or attempted access to the SAM registry key or SAM database file.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes interacting with 'reg.exe' and the 'sam' or 'system' registry hives (e.g., command line arguments 'reg save HKLM\\\\sam...' or 'reg save HKLM\\\\system...'). Look for Event IDs 4656 or 4663 targeting the SAM registry key ('HKLM:\\\\SECURITY\\\\SAM') or the SAM file ('%SystemRoot%\\\\system32\\\\config\\\\SAM') on critical endpoints/servers. Use correlation analysis to identify sequences of these events."
          },
          "Suspicious process memory access patterns or loaded modules associated with credential dumping tools.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for known credential dumping tool process names (e.g., 'mimikatz.exe', 'gsecdump.exe') or suspicious command-line arguments often used by such tools. Monitor Windows Event ID 4697 for new service installations with suspicious names or executables. Use frequency analysis or baselining to identify newly created processes or services."
          },
          "Attempted unauthorized or unusual process access to the SAM database file (%SystemRoot%/system32/config/SAM).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on %SystemRoot%\\system32\\config\\SAM to log access (Event ID 4663). Filter Event ID 4663 for 'Accesses: ReadData (or ListDirectory)' on the SAM file. Identify and investigate access from processes other than known legitimate system processes (e.g., 'lsass.exe', 'System'). Use frequency analysis or whitelisting to identify unusual process names accessing the file."
          },
          "Creation of processes with SYSTEM integrity level from non-standard parent processes or execution of suspicious command lines indicative of dumping activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Filter events where 'New Process' runs with 'IntegrityLevel=System' (Requires advanced auditing policy 'Process Creation events include command line'). Analyze 'ParentProcessName' to identify SYSTEM processes spawned by unusual parents (e.g., user-level processes launching SYSTEM processes). Analyze 'CommandLine' for strings associated with dumping tools or techniques (e.g., 'dump', '::', 'sam'). Use correlation analysis to link suspicious process creation with subsequent file or registry access attempts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]