[
  {
    "Has the adversary accessed credentials from domain controllers? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1003.006 - DCSync": {
          "Replication requests (e.g., GetNCCChanges, GetNCChanges) observed originating from systems that are not authorized domain controllers.": {
            "Data": "Windows Event ID 4662; Zeek dcerpc.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4662 and Zeek dcerpc.log on Domain Controllers for replication API calls (e.g., IDL_DRSGetNCChanges, IDL_DRSReplicaSync). Filter these events by source IP address. Compare source IPs against a list of known, authorized Domain Controllers. Flag and investigate replication requests originating from non-DC IP addresses using correlation analysis."
          },
          "Specific Directory Replication Service Remote Protocol (DRS-RPC) calls (e.g., IDL_DRSGetNCChanges, IDL_DRSReplicaSync) or NetSync (NRPC) activity detected on domain controllers.": {
            "Data": "Windows Event ID 4662; Windows Event ID 5136; Zeek dcerpc.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dcerpc.log and Windows Event ID 4662/5136 on Domain Controllers for specific DRS-RPC methods (UUID 3e035192-4ca9-11d1-be26-00a0c906bacc) or NetSync activity. Identify frequency patterns of these calls by source IP. Identify rare source IPs or significant deviations from baseline frequency using descriptive statistics or anomaly detection techniques."
          },
          "Successful replication requests (DRS-RPC calls) on a domain controller initiated by a user account or computer account not authorized for directory replication.": {
            "Data": "Windows Event ID 4662",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4662 on Domain Controllers, filtering for 'Accesses' containing replication control GUIDs (e.g., 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2 for DS-Replication-GetNCChanges). Extract the Subject (user or computer account SID) from the event. Maintain a list of SIDs explicitly authorized to perform directory replication (e.g., Domain Controllers group, specific admin accounts). Flag and investigate any such events where the Subject SID is *not* in the authorized list using correlation analysis."
          },
          "Unusual network connection patterns or significant data transfer volumes using DRS-RPC or NRPC ports (TCP 135, 49152-65535 for dynamic RPC; TCP 135, 445 for Netlogon/NRPC initial binding) between a domain controller and a non-DC system, especially if outside normal replication schedules.": {
            "Data": "Zeek conn.log; Zeek dcerpc.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to Domain Controllers on standard RPC/DRS-RPC/NRPC ports (TCP 135, 445, dynamic ports 49152-65535) where the source IP is *not* a known Domain Controller. Correlate with Zeek dcerpc.log to confirm DRS-RPC activity. Analyze connection frequency, duration, and byte transfer volumes from these non-DC sources. Use time series analysis to detect unexpected spikes or recurring connections. Use descriptive statistics (mean, standard deviation of bytes transferred) to identify unusually large data transfers indicative of full database replication."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]