[
  {
    "Is the adversary collecting data from local systems? (TA0009 - Collection)": {
      "Indicators": {
        "T1005 - Data from Local System": {
          "Execution of commands or scripts to search/collect specific file types or sensitive data from local file systems.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs for command lines containing suspicious keywords related to file searching (e.g., \"findstr\", \"grep\", \"dir *.doc\", \"ls *.conf\") or copying/staging (e.g., \"copy\", \"xcopy\", \"tar\", \"zip\"). Identify command executions by unusual users or from unexpected directories. Use frequency analysis to identify rare command usage compared to a historical baseline for the user or system."
          },
          "Use of system management tools (PowerShell, WMI) to access or stage sensitive data on local systems.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and 4104 logs for PowerShell or WMI activity containing commands/scripts that access sensitive directories or file types (e.g., credentials, configuration files). Analyze the entropy of PowerShell command strings or script blocks for obfuscation indicators. Use correlation analysis to link management tool usage with subsequent file access events or suspicious network connections."
          },
          "Execution of configuration viewing commands on network devices by unusual users or from unexpected sources/times.": {
            "Data": "Zeek syslog.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek syslog.log for authentication/command execution events from network devices containing 'show' commands related to configuration (e.g., 'show running-config', 'show config'). Identify commands executed by non-administrative users, from unusual source IPs, or outside of scheduled maintenance windows. Use statistical baselining (e.g., frequency analysis of users, command types, time of day) to identify outliers."
          },
          "Execution of processes or commands designed to access or read sensitive data files (e.g., configuration files, database dumps, credential stores) from local system paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines indicating read access or interaction with known sensitive file types or paths (e.g., `Get-Content`, `type`, `cat`, `strings`, database dump utilities, or specific commands targeting `/etc/passwd`, `/etc/shadow`, `~/.ssh`, registry hives, specific application configuration files). Filter for access to file extensions like `.conf`, `.config`, `.xml`, `.db`, `.sqlite`, `.kcdb`, or specific file names containing 'pass', 'cred', 'config', 'secret'. Use frequency analysis to identify uncommon executables or command line patterns interacting with these sensitive files."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]