[
  {
    "Is the adversary attempting to discover system services? (TA0007 - Discovery)": {
      "Indicators": {
        "T1007 - System Service Discovery": {
          "Execution of common system service discovery commands (e.g., sc query, tasklist /svc, net start) by suspicious processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for creation of processes with command lines containing 'sc query', 'tasklist /svc', 'net start', or similar service discovery commands. Analyze the parent process and execution frequency. Identify processes executing these commands at unusual rates or times, potentially using frequency analysis or time series anomaly detection."
          },
          "Unusual use of management tools (WMI, PowerShell) or direct API calls for service enumeration.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5858; Windows Event ID 5859; Windows Event ID 5861",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for PowerShell execution with service-related cmdlets (e.g., Get-Service). Monitor Windows Event ID 5858/5859/5861 for WMI queries related to services. Correlate this activity with other suspicious process execution or network activity (e.g., via Zeek logs). Use correlation analysis to link service discovery commands/APIs with other adversarial actions."
          },
          "High volume or rapid execution of system service discovery commands or API calls from a single host or user account.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5858; Windows Event ID 5859; Windows Event ID 5861",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4688 (process creation) and WMI/PowerShell logs (Event IDs 5858, 5859, 5861) by host and user account. Count the frequency of execution of service discovery commands ('sc query', 'tasklist /svc', 'net start', 'Get-Service') or relevant WMI queries within short time periods (e.g., 5 minutes). Flag hosts or users exhibiting a sudden spike or unusually high rate of service discovery activity using rate-based anomaly detection or simple frequency thresholding."
          },
          "Execution of service discovery commands with output redirection, potentially followed by suspicious network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for service discovery commands being executed with command-line arguments indicating output redirection (e.g., `> services.txt`). Correlate execution of these commands with subsequent network connections captured in Zeek conn.log from the same source host, especially to external or unusual internal destinations. Use correlation analysis to identify potential exfiltration or transfer of discovery results."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]