
[
  {
    "Has the adversary attempted to access credentials stored in the SAM database? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1003.002 - Security Account Manager": {
          "Execution of processes with names matching known credential dumping tools used for SAM access.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for 'NewProcessName' or 'ProcessName' fields matching a list of known credential dumping tools (e.g., 'mimikatz.exe', 'gsecdump.exe', 'pwdump.exe', 'fgdump.exe', 'secretsdump.py', 'Invoke-Mimikatz.ps1' in command line). Maintain and regularly update this list from threat intelligence. Investigate any matches, focusing on processes launched with high privileges or by unexpected parent processes. Use frequency analysis to identify rare process executions matching these names."
          },
          "Use of specific command-line arguments or sequences indicative of SAM/SYSTEM hive dumping via tools like reg.exe or vssadmin.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor 'CommandLine' field in Windows Event ID 4688 for patterns such as 'reg.exe save hklm\\sam', 'reg.exe save hklm\\system', 'vssadmin.exe create shadow /for=%systemdrive%', 'vssadmin.exe delete shadows /all /quiet'. Correlate 'vssadmin create shadow' commands with subsequent access or copy operations targeting SAM/SYSTEM files from the created shadow copy path (e.g., `\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy*`). Use regular expression matching for these command patterns. Calculate descriptive statistics on the frequency of such commands; while 'vssadmin create shadow' can be legitimate, its correlation with SAM file access is highly suspicious."
          },
          "Anomalous process access to the SAM database file (%SystemRoot%\\system32\\config\\SAM) or its backup copies by non-standard system processes.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable SACLs (System Access Control Lists) on the SAM file (`%SystemRoot%\\system32\\config\\SAM`) and its backups (e.g., `%SystemRoot%\\System32\\config\\RegBack\\SAM`) to log access attempts (Windows Event ID 4663 for 'Object Access Attempt'). Filter for 'Accesses' field indicating read permissions (e.g., 'ReadData (or ListDirectory)', 'ReadEA', 'ReadAttributes'). Establish a baseline of legitimate processes accessing these files (e.g., 'lsass.exe', 'System', specific backup agents). Alert on access by any other processes, particularly those not signed by Microsoft or known vendors (e.g., 'powershell.exe', 'cmd.exe', or unsigned executables running from temporary locations). Use a whitelisting approach for known good processes and investigate deviations."
          },
          "An unauthorized process attempting to open a handle to the LSASS (Local Security Authority Subsystem Service) process with memory read permissions.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable auditing for process object access on LSASS. Monitor Windows Event ID 4656 (A handle to an object was requested) where the 'ObjectName' field contains the full path to 'lsass.exe'. Analyze the 'ProcessName' (source process requesting access) and 'AccessMask' or 'Accesses' fields. Alert on non-standard processes (e.g., not System, services.exe, wininit.exe, or known security tools) requesting handles with rights like `0x10` (PROCESS_VM_READ), `0x20` (PROCESS_VM_WRITE), `0x40` (PROCESS_DUP_HANDLE), `0x400` (PROCESS_QUERY_INFORMATION), or broad access masks like `0x1410`, `0x143A`, `0x1F0FFF`. Profile legitimate LSASS access and use anomaly detection or an inter-quartile range (IQR) method on access frequencies per source process to flag unusual requests."
          },
          "Anomalous access attempts or handle requests to SAM or SYSTEM registry hives (HKLM\\SAM, HKLM\\SYSTEM) by unexpected processes.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable auditing on `HKLM\\SAM` and `HKLM\\SYSTEM` registry hives. Monitor Windows Event ID 4656 (Handle Requested), 4657 (Registry Value Modified - less common for SAM read but relevant for System key manipulation), and 4663 (Object Access Attempt). Baseline legitimate processes that access these hives (e.g., 'System', 'services.exe', 'lsass.exe', 'regedit.exe' interactively by an administrator). Alert on access by unexpected processes (e.g., 'powershell.exe', unsigned executables, 'rundll32.exe' with suspicious parameters, or processes running from user profiles or temp directories). Analyze access types and frequency; use statistical methods like entropy measures on accessing process names or time series analysis on access counts to detect unusual patterns indicating enumeration or dumping."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
