[
  {
    "Has the adversary accessed or copied the NTDS database to steal credentials? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1003.003 - NTDS": {
          "Unauthorized access or modification attempts on the NTDS.dit file on a domain controller.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on Domain Controllers for access attempts to the NTDS.dit file (%SystemRoot%\\NTDS\\Ntds.dit). Filter events for non-SYSTEM or non-authorized accounts. Identify statistically rare access patterns based on user, time, or process using frequency analysis. Use time series analysis to detect unusual spikes in access events to this specific file."
          },
          "Execution of specific tools or command-line arguments associated with NTDS dumping (e.g., ntdsutil, secretsdump, Invoke-NinjaCopy, vssadmin create shadow).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on Domain Controllers for the creation of processes with command-line arguments containing keywords or patterns associated with NTDS dumping tools (e.g., 'ntdsutil', 'secretsdump.py', 'Invoke-NinjaCopy', 'vssadmin create shadow'). Calculate the frequency of execution of such commands per server and user and flag statistically infrequent occurrences."
          },
          "Creation of a Volume Shadow Copy on a domain controller outside of normal backup procedures or by an unauthorized user.": {
            "Data": "Windows Event ID 500; Windows Event ID 501; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 500 (VSS creation) and 501 (VSS deletion) on Domain Controllers. Correlate with Windows Event ID 4688 for command lines containing 'vssadmin create shadow'. Identify shadow copies created by non-SYSTEM accounts or accounts outside documented backup processes using frequency analysis of the user field. Establish baseline VSS activity using time series analysis (e.g., daily/weekly patterns) and flag creations during statistically unusual periods (e.g., using IQR or percentile analysis on timestamps) or by low-frequency users."
          },
          "Outbound network connections from a domain controller involving large file transfers or connections to suspicious external IPs, especially after VSS creation or tool execution.": {
            "Data": "Zeek conn.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections originating from Domain Controller IPs. Analyze connection records (`conn.log`) for large data transfers (e.g., analyze `orig_bytes` or `resp_bytes` fields). Use descriptive statistics (mean, median, percentiles) to establish baseline outbound transfer sizes for DCs and flag outliers (e.g., transfers > 95th percentile). Correlate suspicious outbound transfers with Threat Intelligence feeds for destination IPs. Utilize Zeek files.log if configured to analyze file names or types associated with large transfers. Further investigate connections occurring shortly after detection of VSS creation (Windows Event 500/501) or NTDS dumping tool execution (Windows Event 4688)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]