[
  {
    "Has the adversary accessed sensitive credentials stored in LSA secrets? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1003.004 - LSA Secrets": {
          "Access attempts to the LSA secrets registry key by unusual processes or accounts.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for access attempts to the 'HKEY_LOCAL_MACHINE\\\\SECURITY\\\\Policy\\\\Secrets' registry key. Identify the accessing process and user. Flag access by processes/users that are not typically associated with system maintenance or legitimate security tools. Use frequency analysis to identify rare or unusual accessors."
          },
          "Execution of known credential dumping tools (e.g., Mimikatz) or PowerShell scripts (e.g., Invoke-Mimikatz) with parameters related to LSA secrets.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Look for known credential dumping tool names (e.g., mimikatz.exe) or command-line parameters indicative of LSA secret dumping. Monitor Windows Event ID 4104 for PowerShell script blocks containing strings related to LSA secrets or Invoke-Mimikatz. Use correlation analysis to link process creation with subsequent suspicious activity."
          },
          "Read access attempts to critical system process memory (LSASS) or registry hive files containing LSA secrets by non-standard processes.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on endpoints/servers with SACLs configured to audit read access (`AccessMask` including `READ_CONTROL` or `SYNCHRONIZE`) to relevant objects like `lsass.exe` process memory or registry hive files (`\SystemRoot\System32\config\SYSTEM`, `\SystemRoot\System32\config\SECURITY`). Identify the `ObjectName` and `ProcessName` attempting the access. Flag access attempts by processes other than known legitimate system processes (e.g., services.exe, wininit.exe). Use frequency analysis on `ProcessName` to identify rare accessors."
          },
          "Outbound network connections from sensitive hosts to unusual external destinations potentially indicating data exfiltration after credential access.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections from servers/endpoints suspected of storing LSA secrets. Filter for connections to destinations outside of known/expected ranges (e.g., based on domain reputation, geographic location, or internal whitelist/blacklist). Use descriptive statistics to analyze `orig_bytes` and `resp_bytes` for these connections. Flag connections with unusually high outbound data volume (`orig_bytes`) compared to historical data (e.g., using IQR or percentile analysis) for that source host, especially over non-standard ports or to suspicious destinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]