[
  {
    "Is the adversary bypassing file access controls or monitoring via direct volume access? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1006 - Direct Volume Access": {
          "Creation of handles to logical volumes by unexpected processes or with unusual access rights.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for handle requests to volume object types (e.g., \\\\.\\C:). Filter events to identify requests from non-standard or unexpected processes. Use frequency analysis to identify rare process/volume access combinations. Investigate handles opened with excessive or unusual access rights flags."
          },
          "Execution of built-in or third-party utilities (e.g., vssadmin, esentutl, NinjaCopy) with command-line arguments suggestive of direct volume access or data copying.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation, specifically looking for command-line arguments containing 'vssadmin', 'esentutl', 'wbadmin', or 'NinjaCopy'. Analyze command-line arguments for patterns indicative of volume snapshot creation or file copying (e.g., 'create shadow', 'extract', 'copy'). Correlate process executions with user activity or other suspicious events using time series analysis."
          },
          "Unusual network connections or data transfer patterns originating from a host shortly after suspected direct volume access activity.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek connection logs (conn.log) with preceding host-based alerts or events indicating potential direct volume access (e.g., Windows Event IDs related to handle opens or suspicious process executions). Use descriptive statistics (e.g., data volume per session, number of connections to external IPs) and time series analysis on network logs (conn.log, http.log, ftp.log) originating from the suspect host to identify anomalous egress traffic patterns or sudden spikes in data transfer volume immediately after the suspected T1006 activity compared to baseline."
          },
          "Execution of uncommon processes or scripts with high privileges immediately following suspected direct volume access activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on systems where direct volume access is suspected. Specifically look for uncommon executables or script interpreter processes being launched shortly after potential T1006 activity. Correlate these process creations with Windows Event ID 4624 to identify the logon session and privilege level (e.g., SYSTEM, Administrator). Use frequency analysis or percentile analysis to identify processes that are rarely executed with high privileges on the system. Investigate processes launched with escalated privileges shortly after detected T1006 indicators."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]