[
  {
    "Has the adversary attempted to dump credentials from compromised systems? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1003 - OS Credential Dumping": {
          "Suspicious process access to the LSASS process memory (e.g., non-system/expected processes accessing lsass.exe).": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 on Endpoints and Servers with SACL auditing enabled for lsass.exe. Identify non-whitelisted processes requesting handles with potentially malicious access masks (e.g., PROCESS_VM_READ, PROCESS_QUERY_INFORMATION). Analyze the frequency and timing of such access using descriptive statistics to identify anomalies."
          },
          "Suspicious access or export of the SAM or SYSTEM registry hives or direct file system access to the SAM file.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for access to the SAM and SYSTEM registry hives and the %SystemRoot%/system32/config/SAM file. Monitor Windows Event ID 4688 for command lines attempting to export registry hives (e.g., 'reg save'). Monitor Zeek file.log for unexpected creation or access of SAM/SYSTEM hive files. Use correlation analysis to link suspicious file/registry access with process creation events."
          },
          "Execution of PowerShell commands or scripts indicative of credential dumping activities (e.g., containing Mimikatz-related keywords, suspicious API calls, or base64 encoded payloads).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for PowerShell execution with command-line arguments containing keywords like 'Invoke-Mimikatz', 'Get-GPPPassword', 'sekurlsa::logonpasswords', or heavily obfuscated/base64 encoded scripts. Monitor Windows Event ID 4104 (PowerShell Script Block Logging) for deobfuscated script content and search for common credential dumping function names or API calls (e.g., 'MiniDumpWriteDump', 'LsaRegisterLogonProcess'). Use correlation analysis to link suspicious PowerShell activity with subsequent network connections (Zeek conn.log) or suspicious file modifications."
          },
          "Anomalous network traffic patterns consistent with DCSync attacks, such as Directory Replication Service Remote Protocol (MS-DRSR) usage from non-domain controller sources to Domain Controllers.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4662",
            "Data Platform": "Servers (Domain Controllers), Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for MS-DRSR traffic (e.g., RPC calls over TCP, identified by UUIDs like E3514235-4B06-11D1-AB04-00C04FC2DCD2 - GetNCChanges) originating from IP addresses not whitelisted as Domain Controllers and targeting known DCs. Correlate this with Windows Event ID 4624 (Logon Type 3) on Domain Controllers from these non-DC sources. Monitor Windows Event ID 4662 on DCs for operations like 'Replicating Directory Changes' or 'Replicating Directory Changes All' initiated by non-standard accounts or from non-DC systems. Use frequency analysis and established baselines to identify anomalous replication requests."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]