```json
[
  {
    "Is the adversary using junk data to obfuscate command and control communications? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1001.001 - Junk Data": {
          "Network traffic to or from IP addresses/domains associated with C2 infrastructure known to use junk data padding for obfuscation.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) with a high-fidelity cyber threat intelligence (CTI) feed. Prioritize feeds that specifically tag indicators (IPs, domains) associated with malware families known to use T1001.001 for C2 obfuscation. Alert on any matches and prioritize investigation of the associated traffic for other behavioral anomalies."
          },
          "Detection of specific, non-standard padding patterns (e.g., known repeating characters, specific hardcoded strings, or predictable pseudo-random sequences) within network payloads consistent with known malware families.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Deploy and monitor network signatures (e.g., via an IDS/IPS integrated with Zeek) that detect known junk data patterns used by specific malware families. This includes using regular expression matching to scan captured payload data from Zeek conn.log for prepended/appended strings (e.g., repeating null bytes, specific magic numbers) identified from malware reverse engineering. Maintain and update this signature set based on ongoing threat intelligence."
          },
          "Network connections exhibiting anomalous payload sizes or client-to-server data ratios that deviate significantly from protocol or application baselines, suggesting the presence of extraneous padding data.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For common protocols (e.g., HTTP/S, DNS), establish baselines for typical request/response sizes ('orig_bytes', 'resp_bytes' in Zeek conn.log) and the ratio between them. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores on the byte counts and ratios to detect significant outliers. For example, a DNS query with an unusually large request payload or an HTTP GET request that sends significantly more data than it receives is highly suspicious. Use time series analysis to detect shifts in these metrics for specific destinations over time."
          },
          "Network payloads with unusually high entropy or containing data inconsistent with the expected protocol, suggesting random data has been inserted to obfuscate true C2 traffic.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For unencrypted traffic or within specific fields of protocols like HTTP, calculate the Shannon entropy of the payload data. Establish a baseline entropy for normal traffic on a given port/protocol combination. Flag connections with entropy levels that are unusually high (approaching the entropy of random data) and not attributable to legitimate compression or encryption. Analyze Zeek's weird.log for events like 'data_before_established' or 'unsolicited_response' which can be indicative of malformed, padded traffic."
          },
          "A process with no legitimate reason for network communication, or one running from an unusual path, initiates network connections exhibiting other characteristics of junk data padding.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection creation events (Windows Event ID 5156) with process creation events (Windows Event ID 4688) to identify the parent process and executable path for suspicious network traffic. Establish a baseline of processes that normally communicate on the network. Alert when processes running from unusual locations (e.g., %TEMP%, %APPDATA%) or processes that do not typically make network calls (e.g., calc.exe, notepad.exe) initiate connections. Use correlation analysis to link this host-based alert with network-based alerts for junk data to increase detection confidence and enable faster response."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```