[
  {
    "Has the adversary accessed cached domain credentials? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1003.005 - Cached Domain Credentials": {
          "Execution of known credential dumping tools (e.g., Mimikatz, secretsdump.py, Linikatz) or suspicious command-line arguments related to accessing cached credentials.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Filter for command-line arguments or executable names matching known credential dumping tools (e.g., mimikatz, secretsdump.py, tdbdump) or suspicious keywords (e.g., 'lsa', 'mscache', 'reg export', 'sam hive', '/var/lib/sss/db/', '/var/opt/quest/'). Analyze frequency of these events across hosts using descriptive statistics to identify outliers."
          },
          "Unauthorized access to or modification of cached credential files (e.g., /var/lib/sss/db/cache.*.ldb, /var/opt/quest/vas/authcache/vas_auth.vdb, Windows registry hives containing cached creds).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure auditing (SACLs) for access attempts on critical Windows registry hives (e.g., HKEY_LOCAL_MACHINE\\SAM, HKEY_LOCAL_MACHINE\\SECURITY, HKEY_LOCAL_MACHINE\\SYSTEM) or known Linux credential cache file paths (/var/lib/sss/db/, /var/opt/quest/vas/authcache/). Monitor Windows Event ID 4656/4663 for access/modification events. Analyze access patterns (user, process, time) using time series analysis or correlation to identify unusual access outside of expected administrative tasks. Calculate frequency of access by source process or user to identify anomalies."
          },
          "Outbound network connections to unusual destinations or protocols originating from a host shortly after suspected credential dumping activity.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts where suspected credential dumping tools/commands (based on Windows Event ID 4688 monitoring) were executed. Correlate these events with Zeek conn.log data from the same host/IP within a short time window (e.g., 15-30 minutes). Look for outbound connections to rare destination IPs, ports, or protocols compared to the host's historical network activity baseline. Use statistical analysis (e.g., frequency distribution, percentile analysis of destination ports/IPs, correlation analysis between process execution and outbound connection initiation time) to flag anomalous connections."
          },
          "Unusual number of failed authentication attempts using potentially compromised accounts originating from a host where credential dumping activity was suspected.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts where suspected credential dumping tools/commands (based on Windows Event ID 4688 monitoring) were executed. Monitor Windows Event ID 4625 (Failed Logon - various logon types) events originating *from* these hosts shortly after the suspected dumping activity (e.g., within an hour). Analyze failed logon attempts by target account and target host. Look for failed attempts against multiple accounts or hosts, especially if the source account on the dumping host is privileged. Use frequency analysis or count-based thresholds to flag excessive failed logon attempts originating from suspicious hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]