[
  {
    "Has the adversary attempted to collect credentials by dumping /etc/passwd or /etc/shadow? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1003.008 - -etc-passwd and -etc-shadow": {
          "Outbound network transfer of data matching patterns or sizes of /etc/passwd or /etc/shadow files.": {
            "Data": "Zeek files.log; Zeek http.log; Zeek ftp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (files.log, http.log, ftp.log, conn.log) for outbound file transfers or suspicious connections from potential Linux hosts. Use entropy analysis, regex matching for known patterns (e.g., 'root:', ':/bin/bash', '$[1,5,6]$'), or file size checks to identify potential password/shadow file content being exfiltrated. Investigate transfers to unusual external destinations or using uncommon ports/protocols."
          },
          "Network activity related to the download or execution of known Linux credential dumping or processing tools.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (http.log, dns.log, conn.log) for connections to malicious sites or file downloads with names of known Linux credential tools (e.g., 'unshadow', 'johntheripper', 'hashcat'). Correlate DNS lookups for suspicious domains used in tool delivery and investigate associated network connections."
          },
          "Process execution attempting to read or access /etc/passwd or /etc/shadow files, especially by non-root users or unusual processes.": {
            "Data": "AuditD logs (Linux syscall events for open, read, etc.)",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure AuditD rules to log access (read, open, attributes) to /etc/passwd and /etc/shadow. Monitor logs for events where the process executable path or user ID is not expected to access these files (e.g., 'cat', 'less', custom scripts, user-space applications vs. system daemons). Flag access attempts by non-root users or processes lacking a legitimate purpose. Use frequency analysis to identify hosts or processes with an unusual number of access attempts to these files."
          },
          "Execution of utilities like 'unshadow' or command lines that concatenate or process /etc/passwd and /etc/shadow content.": {
            "Data": "AuditD logs (Linux execve syscall events)",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure AuditD rules to log process execution (execve) events including command line arguments. Monitor logs for command lines containing 'unshadow', 'cat /etc/passwd', 'cat /etc/shadow', or patterns indicating combination/processing of these files (e.g., pipes, redirects involving both file paths). Use string matching and regex to identify suspicious command executions. Correlate execution events with subsequent suspicious network activity or file creation events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]