[
  {
    "Is the adversary performing host or network discovery activities? (TA0007 - Discovery)": {
      "Indicators": {
        "T1016.001 - Internet Connection Discovery": {
          "Execution of command-line utilities like 'ping' or 'tracert' to common external sites.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creation events related to 'ping.exe', 'tracert.exe', or similar network testing utilities. Analyze command-line arguments for target hosts (e.g., 8.8.8.8, google.com). Calculate frequency of these commands per host or user. Flag hosts exhibiting unusually high frequency or execution from atypical user accounts."
          },
          "Outbound network connections (e.g., HTTP GET requests) to well-known external websites or IP addresses from unusual processes or after suspicious activity.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for outbound connections to common external IPs/domains (e.g., google.com, microsoft.com, 8.8.8.8, 1.1.1.1) initiated by processes other than known browsers or update services. Use time series analysis to identify sudden bursts of connection attempts or changes in connection patterns (e.g., attempts from a host that previously had no internet access)."
          },
          "Unusual outbound connections (non-browser, non-standard port) to common Internet infrastructure (e.g., public DNS servers or widely distributed CDNs).": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections originating from internal hosts to common public DNS servers (e.g., 8.8.8.8, 1.1.1.1) or other widely distributed infrastructure over non-standard ports or protocols. Correlate with Zeek dns.log to see if these connections follow suspicious DNS queries. Use frequency analysis to identify hosts making unusual numbers of such connections or connections to new external IPs they haven't contacted before, comparing current activity to a historical baseline."
          },
          "Multiple internet connectivity checks (ping, HTTP GET) originating from a host within a short time frame, especially after initial compromise or other suspicious event.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify events indicating internet connectivity checks: Windows Event ID 4688 for ping/tracert execution, Zeek http.log/conn.log for outbound connections to known internet check sites/IPs. Group these events by source host and timestamp. Use time series analysis or statistical clustering (e.g., identify events occurring within 60 seconds of each other on the same host) to identify hosts exhibiting bursts of connectivity checks. Flag hosts showing this pattern, especially if correlated with other security alerts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]