```json
[
  {
    "Is the adversary performing remote system discovery? (TA0007 - Discovery)": {
      "Indicators": {
        "T1018 - Remote System Discovery": {
          "Execution of known non-native remote discovery tools (e.g., Nmap, Advanced IP Scanner) or network traffic containing their unique signatures.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) of known offensive discovery tools by process name (e.g., 'nmap.exe', 'Advanced_IP_Scanner.exe') or by file hash against a known-bad list. On the network, monitor Zeek http.log for unique User-Agent strings associated with these tools. Also, monitor Zeek conn.log for specific protocol-level signatures or port scanning sequences that are characteristic of tools like Nmap (e.g., specific TCP flag combinations, rapid connections to sequential ports)."
          },
          "Execution of native command-line utilities (e.g., ping, net view, arp, tracert) for remote system discovery, especially when used in scripts or with iterative arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events of native utilities like 'ping.exe', 'net.exe' (with 'view' argument), 'arp.exe', and 'tracert.exe'. Use correlation analysis to detect multiple rapid executions from the same parent process (e.g., cmd.exe, powershell.exe), which suggests scripted discovery. Establish host/user baselines for these commands and use frequency analysis (e.g., identifying counts beyond 3 standard deviations from the mean) to flag abnormal usage."
          },
          "Use of advanced native frameworks like PowerShell or WMI to enumerate remote systems, their properties, or network shares across the environment.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'powershell.exe' or 'wmic.exe' process creations with command-line arguments containing discovery-related cmdlets (e.g., 'Get-CimInstance', 'Get-WmiObject', 'Test-Connection', 'Resolve-DnsName') or WMIC arguments (e.g., '/node:', 'computersystem get'). Specifically flag usage that targets a large number of remote hosts (e.g., using '-ComputerName' with a list or file input) or is executed by non-administrative user accounts."
          },
          "A single source host generating a network sweep or scan, characterized by a high ratio of unique destination IPs to total connections or a high volume of failed connection attempts.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "From Zeek conn.log, aggregate connection data by source IP over short time windows (e.g., 5-10 minutes). Calculate the number of unique destination IPs, unique destination ports, and the ratio of failed ('REJ', 'RSTO', 'RSTRH') to successful ('SF') connections. Use time series analysis to establish baselines for these metrics per host and use statistical methods (e.g., standard deviation, Inter-Quartile Range) to identify outliers. A high entropy value in destination IPs from a single source is a strong indicator of scanning. Correlate with high volumes of DNS/NBNS lookups in Zeek dns.log from the same source."
          },
          "A 'fan-out' connection pattern where one host connects to many other internal systems on common service ports immediately following an inbound connection or a new user logon event.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful logon events (Windows Event ID 4624, especially Logon Type 3 for network and Type 10 for remote interactive) with subsequent network activity from that host using Zeek conn.log. Identify instances where, within minutes of a new logon, the host initiates connections to a large number of other internal IPs (>10 unique IPs in 5 minutes) on discovery-related ports (e.g., 135/RPC, 139/NetBIOS, 445/SMB, 3389/RDP). Use correlation analysis to explicitly link the initial access/lateral movement event with the subsequent internal discovery behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```