[
  {
    "Is the adversary attempting to exfiltrate data over an unusual network medium? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1011 - Exfiltration Over Other Network Medium": {
          "Processes exhibiting network communication that typically do not or initiate communication without user interaction.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and Windows Event ID 5156 (Filtering Platform Connection) on endpoints/servers. Identify processes initiating network connections. Compare against a baseline of normal process network activity established using frequency analysis. Flag processes without known network communication profiles or connections initiated without apparent user interaction. Use time series analysis to identify anomalous connection patterns by process name or execution time."
          },
          "Modifications to host network adapter configurations, such as enabling new interfaces or bridging connections.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of network configuration utilities (e.g., netsh.exe, PowerShell commands modifying adapters) on endpoints/servers. Look for rapid sequence of related events indicating configuration changes like enabling WiFi, Bluetooth, or creating network bridges. Identify instances where new network interfaces are configured. Use correlation analysis to link process execution with potential network state changes."
          },
          "Network connections observed originating from non-standard network interfaces (e.g., WiFi, Bluetooth, cellular modem) on endpoints or servers.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log or Windows Event ID 5156 for connections where the source interface is identified as non-standard (e.g., WLAN adapter, Bluetooth adapter, cellular modem). Correlate these connections with the initiating process (using Windows Event ID 4688 if available). Investigate connections made via these interfaces, especially outbound connections, using frequency analysis of destination IPs and ports, and traffic volume analysis (descriptive statistics on bytes transferred) to look for unusual patterns compared to typical usage for that interface type."
          },
          "Large or unusual data transfer volumes originating from processes over non-standard network interfaces.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log data, filtering by source interfaces identified as non-standard (WiFi, Bluetooth, cellular). Calculate the total bytes transferred ('orig_bytes' + 'resp_bytes') per connection and aggregate by process/source IP (using Windows Event ID 4688/5156 correlation). Identify connections or processes with significantly higher data transfer volumes than their established baseline or the baseline for that interface type using statistical methods like IQR, percentiles, or simple thresholds on total bytes transferred. Investigate flagged transfers for destination and content."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]