
[
  {
    "Is the adversary performing discovery using registry queries? (TA0007 - Discovery)": {
      "Indicators": {
        "T1012 - Query Registry": {
          "Execution of registry queries with command-line arguments that exactly match signatures of known malicious tools or reconnaissance scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and maintain a list of specific, full command-line strings used by known malware or threat actors for registry discovery (e.g., `reg.exe query HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows\\Installer /v AlwaysInstallElevated`). Scan Windows Event ID 4688 command-line data for exact matches to this list. This provides high-fidelity, selector-based alerting on known malicious artifacts."
          },
          "Querying of specific, high-value registry keys commonly targeted by adversaries for discovering security configurations, credentials, or system information using standard command-line or scripting utilities.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for common query utilities (`reg.exe`, `powershell.exe`, `wmic.exe`). Use regular expressions to detect queries targeting known sensitive paths (e.g., `...\\CurrentVersion\\Winlogon`, `...\\PuTTY\\Sessions`, `...\\Control\\Lsa`, `...\\Terminal Server Client\\...`, `...\\Security\\Cache`). Flag queries to these sensitive paths, especially when initiated by unusual parent processes (e.g., Word, Excel, Outlook), as a strong pattern of malicious discovery."
          },
          "A single process or user session executing an unusually high volume or broad scope of distinct registry queries in a short time frame, indicating automated reconnaissance activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4688 events where the process is a known registry query utility by user session ID or parent process ID over a short time window (e.g., 1-5 minutes). Calculate the frequency and diversity (using entropy measures) of registry keys being queried. Use descriptive statistics (IQR, standard deviation) to establish a baseline of normal query behavior per host and flag any sessions exhibiting an anomalously high number or scope of queries, which is a key behavior of automated reconnaissance tools."
          },
          "Registry query processes (e.g., `reg.exe`) spawned by non-standard parent processes such as web browsers, email clients, office productivity applications, or processes running from temporary user directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events for registry query utilities. Examine the `ParentProcessName` and `ParentProcessPath`. Maintain a baseline of common, legitimate parent processes (e.g., `explorer.exe`, `cmd.exe`, `taskeng.exe`). Generate alerts for any query process spawned from an anomalous parent such as `OUTLOOK.EXE`, `WINWORD.EXE`, `CHROME.EXE`, or any process executing from a user's temporary folder (`%APPDATA%`, `%TEMP%`, `%LOCALAPPDATA%`). This behavioral analysis detects abuse of legitimate tools in a suspicious context."
          },
          "Registry queries focused on network settings, proxy configurations, or stored credentials, immediately followed by suspicious outbound network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify Windows Event ID 4688 events with command lines querying network-related registry keys (e.g., `HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings`). Correlate these events by host and timestamp (within a 1-2 minute window) with subsequent outbound network connections observed in Zeek conn.log. Flag correlations where the connection is to an unusual port, a non-organizational IP space, or an IP with a poor reputation. Use correlation analysis to link the behavioral sequence of information gathering (registry query) with potential C2 communication or data staging."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
