
[
  {
    "Is the adversary attempting to discover network configuration information? (TA0007 - Discovery)": {
      "Indicators": {
        "T1016 - System Network Configuration Discovery": {
          "Execution of network discovery commands with specific arguments or output redirection patterns matching known malicious tool indicators.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and apply a list of atomic indicators (selectors) from threat intelligence related to T1016, such as highly specific command-line strings or output file names (e.g., 'ipconfig /all > C:\\Users\\Public\\net.tmp'). Use regular expression matching on the command-line field within Windows Event ID 4688 to find exact matches to these known malicious patterns. Alert immediately on any match, as these indicate a high-confidence threat."
          },
          "Execution of common system network configuration discovery commands (e.g., ipconfig, ifconfig, arp, route, nbtstat) via the command line or scripting interfaces.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) for a watchlist of common network discovery utilities (ipconfig, arp, route, nbtstat, netsh, etc.). Additionally, monitor PowerShell script block logs (Windows Event ID 4104) for patterns matching cmdlets like 'Get-NetIPConfiguration' or WMI calls to 'Win32_NetworkAdapterConfiguration'. This forms a baseline of discovery activity, and alerts should be correlated with other behavioral indicators."
          },
          "Rapid or sequential execution of multiple distinct network discovery commands from a single host, suggesting automated scripting or manual reconnaissance playbook execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate network discovery command executions (from Windows Event ID 4688) by host and user over short time windows (e.g., 1-5 minutes). Calculate the count of *distinct* commands executed (e.g., ipconfig, then arp, then route). Use time series analysis to detect unusual spikes in the frequency of discovery commands per host compared to its own baseline. Flag any host executing 3 or more distinct network discovery commands within a 60-second interval as highly suspicious behavior."
          },
          "Execution of network discovery commands from an unusual parent process or by a user account that does not typically perform administrative or network troubleshooting tasks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each execution of a network discovery command (Windows Event ID 4688), analyze its parent process name and user context. Maintain and use a baseline of common parent processes (e.g., cmd.exe, powershell.exe, explorer.exe) and typical administrative user accounts. Generate alerts for executions spawned by non-standard processes (e.g., Microsoft Office applications, web browsers, PDF readers) or by standard user accounts with no IT/administrative role. Use frequency analysis or entropy measures on parent-child process relationships across the environment to identify rare and potentially malicious outliers."
          },
          "Anomalous use of remote access protocols (SSH, Telnet) or remote procedure calls (DCE/RPC) to query network configuration information from network devices or other hosts.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek dce_rpc.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ssh.log and telnet.log for interactive sessions with network devices. Establish a baseline of legitimate source IPs and user accounts that access these devices. Alert on sessions from unusual sources or those executing a high volume of discovery commands (e.g., 'show ip route', 'show arp', 'show interface'). Profile normal DCE/RPC traffic using Zeek dce_rpc.log and use correlation analysis to identify a single source host making unusual remote network configuration queries to multiple destinations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
