[
  {
    "Is the adversary using rootkits to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1014 - Rootkit": {
          "Detection of unusual processes, files, or services that are hidden from standard system utilities or logs.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7045; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation, Event ID 7045 for service installation, and Zeek conn.log for unexpected network connections. Correlate these logs to identify processes/services created or communicating unexpectedly, especially if they lack typical parent/child relationships or communicate on unusual ports/protocols. Analyze patterns in process creation times (time series analysis) or common parent processes (descriptive statistics) to identify outliers that might indicate hidden activity."
          },
          "Changes detected in low-level system components like the Master Boot Record (MBR) or existence of unrecognized drivers/DLLs.": {
            "Data": "Windows Event ID 7045; Windows Event Log (System)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Log (System) for driver loading events and failures. Monitor Windows Event ID 7045 for service installations, specifically looking for services configured to run at system startup (boot/system start). Look for services/drivers with unusual names or paths, or those not matching known baseline configurations. Use correlation analysis to link driver/service installs to preceding suspicious activity (e.g., execution from temp folders)."
          },
          "Installation of services or execution of processes from unusual or system-critical locations with suspicious configurations.": {
            "Data": "Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7045 for service installations and Windows Event ID 4688 for process creations. Identify events where the executable path is located in temporary directories, user profile directories (that shouldn't host services/system processes), or system directories with non-standard filenames. Analyze service configurations (start type, user account) from 7045 and command line arguments from 4688 for suspicious parameters (e.g., related to hiding or system modification). Use frequency analysis and correlation with authorized software lists to identify outliers."
          },
          "Detection of unexplained persistent or anomalous network communication patterns from internal hosts.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for persistent connections (long duration, recurring sessions) or unusual traffic volumes/patterns from internal hosts to external IPs. Establish baseline network communication patterns (e.g., using time series analysis for connection volume or frequency distribution of destination ports/IPs). Flag communication deviating significantly from the baseline, especially if involving non-standard ports or protocols, or connecting to IPs not associated with known services/destinations. Use correlation analysis with threat intelligence feeds for external IPs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]