[
  {
    "Is the adversary attempting to discover open application windows? (TA0007 - Discovery)": {
      "Indicators": {
        "T1010 - Application Window Discovery": {
          "Execution of commands or scripts associated with listing open windows (e.g., specific PowerShell or command prompt commands).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and Windows Event ID 4104 (PowerShell Script Block Logging) for command lines or script blocks containing keywords or patterns indicative of window enumeration commands (e.g., Get-Process, tasklist, query user). Identify frequency and correlation of these commands across hosts."
          },
          "Suspicious process activity making calls associated with enumerating windows, potentially from unexpected locations or in conjunction with other suspicious behavior.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Analyze process execution paths and parent-child relationships. Identify processes running from unusual locations or with suspicious names (e.g., using frequency analysis to find rare processes). Correlate identified processes with network connections logged in Zeek conn.log to detect potential C2 communication or data exfiltration attempts."
          },
          "Execution of script interpreters or uncommon processes with command line arguments or contexts suggesting interaction with user interface elements or window listings.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and Windows Event ID 4104 (PowerShell Script Block) for execution of script interpreters (`powershell.exe`, `cscript.exe`, `wscript.exe`) or other suspicious processes. Analyze command line arguments (4688) and script blocks (4104) for parameters or patterns commonly used in conjunction with window discovery functions or known malicious scripts performing such tasks. Use frequency analysis to baseline normal execution contexts for these processes and flag outliers."
          },
          "Suspicious network connections or data staging activities occurring shortly after processes associated with application window discovery are observed.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104; Zeek conn.log; Zeek fileinfo.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts and processes exhibiting activity related to application window discovery (e.g., execution of commands like `tasklist` or scripts matching patterns from existing detection). Correlate these host-based events (Windows Event ID 4688, 4104) with subsequent suspicious network connections (Zeek conn.log, e.g., connections to unusual ports or external IPs, analyzing bytes transferred) or file manipulation events (Zeek fileinfo.log, e.g., creation of large compressed archives) on the same host within a short time window. Use time series correlation or sequence analysis to detect this pattern."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]