[
  {
    "Is the adversary attempting to discover network configuration information? (TA0007 - Discovery)": {
      "Indicators": {
        "T1016 - System Network Configuration Discovery": {
          "Execution of network configuration discovery commands (ipconfig, route, arp, nbtstat) via command line or script on host systems.": {
            "Data": "Windows Event ID 4688; Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing common network discovery commands (ipconfig, route, arp, nbtstat) and their variations in the command line. Identify executions from unusual user accounts, directories, or in suspicious sequences. Use frequency analysis or statistical process control to detect sudden spikes in these command executions across multiple hosts compared to baseline."
          },
          "Attempts to gather network configuration via WMI, PowerShell, or network device CLIs from unusual sources or targeting critical infrastructure.": {
            "Data": "Windows Event ID 4104; Zeek dce_rpc.log; Zeek ssh.log; Zeek telnet.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 for PowerShell scripts containing WMI calls or commands to query network configuration. Monitor Zeek dce_rpc.log for remote procedure calls potentially linked to WMI/RPC network discovery queries. Monitor Zeek ssh.log/telnet.log for unexpected or unauthorized CLI command execution patterns on network devices (e.g., 'show ip route', 'show ip interface') from unusual source IPs or accounts. Correlate network device access logs or Zeek logs with host event logs to identify discovery activity originating from suspicious sources or accounts using correlation analysis."
          },
          "Rapid execution of multiple network configuration discovery commands or their execution in suspicious sequences from a single host.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of network discovery commands (`ipconfig`, `route`, `arp`, `nbtstat`, etc.). Group events by host and timestamp. Identify instances where multiple distinct discovery commands are executed within a short time window (e.g., < 60 seconds). Analyze sequences of commands for known adversary playbooks. Use time series analysis on the frequency of these events per host to identify sudden spikes or deviations from a calculated baseline."
          },
          "Execution of network configuration discovery commands by non-standard processes or from suspicious parent processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations of network discovery commands (`ipconfig`, `route`, `arp`, `nbtstat`, etc.). Identify the parent process (`ParentProcessName`) for these events. Maintain a baseline of legitimate parent processes for these commands. Flag executions where the parent process is unusual (e.g., non-standard applications) or if the process runs from a suspicious directory. Use frequency analysis to identify prevalence of unusual parent processes executing these commands."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]