[
  {
    "Is the adversary exfiltrating data over Bluetooth? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1011.001 - Exfiltration Over Bluetooth": {
          "Presence of unusual or unexpected processes initiating network connections that are not typical for those processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Cross-reference process names and paths against a baseline of known/allowed processes. Identify processes that have no prior history of network activity based on other available logs (e.g., Windows Event ID 5156, Zeek conn.log if applicable to the process type). Use correlation analysis to identify periods when unusual processes are created and network activity occurs."
          },
          "Changes to host Bluetooth adapter settings or detection of new/unauthorized Bluetooth interfaces via system logs.": {
            "Data": "Windows Event IDs related to device/driver changes",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows System or Setup logs for Event IDs related to device/driver changes (e.g., Plug and Play events like Event ID 20001, driver installations). Look for events indicating the installation, connection, or modification of Bluetooth adapters or related drivers. Use time series analysis to identify spikes or anomalous patterns in adapter-related events across multiple hosts."
          },
          "Creation of suspicious file types (e.g., large archives, encrypted files) in user profile or temporary directories, potentially indicating data staging for exfiltration.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of archiving or encryption processes (e.g., winrar.exe, 7z.exe, gpg.exe) within user sessions or on servers. If Windows object access auditing is configured, correlate with Windows Event ID 4663 showing write operations creating large or unusual file types (.zip, .7z, .rar, .tar.gz, .gpg, etc.) in user directories (e.g., Desktop, Documents, Temp) or common staging areas. Use descriptive statistics on file sizes (if available or inferable) and types created in these directories to establish baselines and identify outliers."
          },
          "System logs indicating Bluetooth radio or service activation/start on hosts where it was previously disabled or inactive, correlated with suspicious data activity.": {
            "Data": "Windows Event ID 7036; Windows Event ID 7035; Windows Event IDs related to device/driver changes",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows System logs for Service Control Manager events (Event ID 7036 Service Control Manager) indicating the 'Bluetooth Support Service' changing to the running state, or 'Stopped' (Event ID 7035), particularly on machines where it is normally disabled or stopped. Correlate these events with suspicious file creation/modification (Windows Event ID 4663, 4688) or unusual process activity identified in other detections. Identify endpoints showing both suspicious data activity precursors and Bluetooth service activation around the same time using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]