[
  {
    "Is the adversary performing remote system discovery? (TA0007 - Discovery)": {
      "Indicators": {
        "T1018 - Remote System Discovery": {
          "Execution of system discovery commands (e.g., ping, net view, esxcli network diag ping) on endpoints or servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events containing command-line arguments associated with remote system discovery tools (e.g., 'ping ', 'net view', 'esxcli network diag ping', 'tracert '). Identify processes executing these commands in quick succession or from unusual user accounts. Calculate frequency and timing of such commands per host/user, flagging outliers using descriptive statistics (e.g., IQR)."
          },
          "Suspicious network traffic patterns indicative of scanning or analysis of host files/ARP caches.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for patterns indicative of network scanning (e.g., connections to multiple destination IPs/ports from a single source in a short period, failed connection attempts across a range of IPs). Analyze Zeek dns.log for unusual volumes of DNS lookups from a single source. Monitor Windows Event ID 4663 for access attempts to host files (C:\\Windows\\System32\\Drivers\\etc\\hosts, /etc/hosts) from unexpected processes or users. Use correlation analysis to link discovery traffic/events to other suspicious activities."
          },
          "Abnormally high rate or wide scan pattern of network connections or lookups (DNS, NetBIOS, ARP) originating from a single host or user account.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for source IPs exhibiting a high number of unique destination IPs or hostnames within a short time window. Look for connections on common discovery ports (e.g., 137, 139, 445, range scans) in conn.log. Monitor Windows Event ID 4688 for process creation of `arp`, `nbtstat`, or PowerShell/WMI commands used for local/remote query. Use statistical methods like standard deviation or IQR to flag sources with connection/lookup volumes significantly deviating from the established baseline. Correlate with user session data if available."
          },
          "Execution of specific WMI or PowerShell commands targeting remote systems for information gathering.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `powershell.exe` or `wmic.exe` process creations containing command-line arguments often used for remote discovery, such as `Get-CimInstance`, `Get-WmiObject`, or `wmic computersystem`. Filter for commands specifying remote `-ComputerName` arguments or targeting common host/user/network configuration classes. Flag execution by unusual users or from unexpected source systems. Use frequency analysis to identify systems or users running these commands more often than typical administrative activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]