```json
[
  {
    "Is the adversary using junk code insertion to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.016 - Junk Code Insertion": {
          "Execution of a process whose file hash matches a known malicious file identified to use junk code insertion techniques.": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract file hashes of executables transferred over the network (from Zeek file.log) or from process creation events (Windows Event ID 4688). Correlate these hashes against a continuously updated threat intelligence feed of known malware, specifically seeking hashes tagged with 'T1027.016', 'Junk Code', or associated obfuscators. Alert on any matches."
          },
          "A process is executed with command-line arguments or from a parent process associated with known obfuscation or packing tools that are known to employ junk code insertion.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor command lines from Windows Event ID 4688 for strings, flags, or parameters characteristic of common obfuscators or packers (e.g., UPX, MPRESS, Themida). Maintain and use a list of regular expressions to detect these patterns. Use correlation analysis to link processes executed with these parameters to subsequent suspicious network or host activity. Flag any execution patterns that match this tooling."
          },
          "A process, executed from an unusual path, spawns a legitimate system utility (e.g., svchost.exe, rundll32.exe) which then initiates suspicious network connections, suggesting code injection.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for sequences where a non-system process (from Windows Event ID 4688) launches a legitimate Windows process (e.g., svchost.exe) from an unexpected parent. Correlate this child process with immediate outbound network connections (Windows Event ID 5156, Zeek conn.log) to non-standard ports, suspicious IP addresses, or domains with low reputation. Use time-based correlation analysis to link the parent process creation, the child process creation, and the network connection within a very short timeframe (e.g., less than 5 seconds)."
          },
          "Execution of a process from a non-standard or user-writable directory, especially when the filename masquerades as a legitimate system binary.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the 'New Process Name' (full path) field in Windows Event ID 4688. Maintain a baseline of standard execution paths for common system binaries (e.g., 'C:\\Windows\\System32\\svchost.exe'). Alert on executions of processes with legitimate-sounding names from atypical directories (e.g., 'C:\\Users\\Public\\', 'C:\\ProgramData\\', user AppData folders). Use frequency analysis on parent processes and execution directories across the enterprise to identify statistically rare execution contexts. High entropy in path names can also be an indicator."
          },
          "A process, shortly after execution, initiates network behavior that is anomalous or characteristic of malware, such as C2-like beaconing or unusual connection patterns.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate new processes (Windows Event ID 4688) with their subsequent network activity (Zeek conn.log) using the host IP and timestamps. For each new process, analyze its network behavior: apply time series analysis to detect periodic, fixed-interval connections (beaconing); use descriptive statistics to flag an abnormally high count of unique destination IPs (fan-out); and use frequency analysis to detect non-standard protocols on standard ports (e.g., non-HTTP traffic on port 80/443). Flag processes that deviate significantly from established baselines of normal application network behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```