[
  {
    "Is the adversary exfiltrating data using traffic duplication? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1020.001 - Traffic Duplication": {
          "Detection of unusual or new high-volume network traffic streams being sent to external destinations not typically involved in data transfer, potentially with fixed-size data packets.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for external connections. Identify destination IPs and ports. Use frequency analysis to detect rare or previously unseen external destination IPs receiving significant traffic volume. Calculate packet size distribution and inter-packet arrival times (time series analysis) for connections to identified suspicious destinations to detect fixed-size/interval patterns."
          },
          "Network traffic packets exhibiting content or protocol behavior inconsistent with the expected application/port, potentially indicative of mirrored traffic or disguised data exfiltration.": {
            "Data": "Zeek conn.log; Zeek weird.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek weird.log for protocol compliance issues on common data transfer ports (e.g., 80, 443). Analyze Zeek logs (conn.log, http.log, etc.) for connections exhibiting anomalous payload sizes or patterns inconsistent with the declared application/protocol (e.g., high entropy payload on a port usually carrying structured text). Use entropy measures on packet payloads where possible to identify potentially encrypted or compressed data streams disguised as normal traffic."
          },
          "Suspicious login attempts or command execution patterns on network management devices or cloud control plane interfaces that correlate with the initiation of unusual network traffic flows.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 4688; Zeek conn.log; Zeek ssh.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624/4625 for logins and 4688 for process creation on critical network management servers or cloud control plane hosts. Filter Zeek logs (e.g., ssh.log, conn.log) for connections to network devices or cloud management endpoints. Use time series analysis and correlation to identify unusual login attempts, successful logins from suspicious sources, or command execution (analyzing command line in Event ID 4688) that immediately precede the detection of new, high-volume, or unusual network flows."
          },
          "Detection of high-volume, previously unseen internal-to-external network traffic flows originating from devices or network segments not typically permitted to initiate such connections.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal internal-to-external network communication patterns based on source IP/segment, destination IP, port, and volume using frequency analysis and descriptive statistics. Monitor Zeek conn.log for deviations from this baseline, specifically focusing on high-volume flows originating from unexpected internal sources or destined for previously unseen external IPs/ports. Use correlation analysis to link these flows to specific internal hosts or network segments."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]