[
  {
    "Is the adversary attempting to evade defenses by modifying tools? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.005 - Indicator Removal from Tools": {
          "Initial security alert (e.g., AV detection, network IDS alert) followed by continued suspicious activity on the same host or originating source.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek file.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Investigate hosts/sources generating initial security alerts (e.g., AV alerts captured in Windows Events). Analyze Zeek conn.log, Zeek file.log, and Windows Event ID 4688 for subsequent process execution, file modifications, or network connections from the alerted host within a short time window. Use time series analysis on activity logs to identify unusual patterns following the initial alert."
          },
          "Reappearance of activity similar to a previously quarantined or blocked tool, but with modified characteristics (e.g., different file hash, slightly different network behavior) that bypass initial detection.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek file.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track file hashes associated with security alerts using Zeek file.log. Monitor for subsequent appearances of files with similar names or in similar locations but different hashes. Compare network connection patterns (Zeek conn.log) or process execution arguments (Windows Event ID 4688) of the 'new' activity against the original. Use correlation analysis to link the 'new' activity back to the original alert source/timeframe."
          },
          "File modification events on a file that was recently subject to a security alert (e.g., AV detection, quarantine).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4658; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor host logs (Windows Event IDs 4656, 4663, 4658 - filtered for file objects) for access or modification attempts on files recently involved in security alerts (e.g., AV quarantines, EDR detections). Correlate file path and timestamp of these modification events with the original security alert timestamp. Flag instances where an alerted file is quickly accessed, modified, or deleted. Use descriptive statistics (e.g., frequency count of modifications per file) to identify unusual file activity patterns."
          },
          "Process execution or network connections initiated by the same user account or originating from the same host that previously triggered a security alert for a tool, where the new activity uses a file with a different hash or exhibits slightly different network behavior.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek conn.log; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify user accounts and hostnames associated with initial security alerts (e.g., from AV/EDR logs, Windows Event ID 4624/4625). Monitor subsequent activity from these users/hosts using Windows Event ID 4688 (process creation) and Zeek conn.log (network connections). Correlate new process executions with Zeek file.log to check file hashes. Compare network traffic patterns (Zeek conn.log) from the flagged hosts/users to previous patterns or baseline activity using correlation analysis or statistical comparisons (e.g., data volume, destination ports). Flag new activity that seems similar to the original alert but differs in hash or minor network characteristics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]