[
  {
    "Is the adversary evading defenses using command obfuscation? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027.010 - Command Obfuscation": {
          "Execution of commands containing excessive or unusual escape characters, special symbols, or base64/URL encoding.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 command line arguments and Zeek http.log for commands containing unusual character frequencies, escape sequences, or recognizable encoding patterns (e.g., base64, URL encoding). Calculate the entropy of command strings to identify highly obfuscated ones and flag commands with high complexity/entropy or matching suspicious patterns for review."
          },
          "Execution of commands containing unusual string concatenation, variable use, or excessive/malformed directory traversal paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 command line arguments. Identify commands using string concatenation ('+'), variable expansion ('%'), or excessive/non-standard directory traversal sequences ('..'). Analyze the frequency and context of such patterns using descriptive statistics to identify rare or suspicious occurrences, particularly when associated with unusual process relationships or targeting sensitive system paths."
          },
          "Process creation by a standard interpreter with an unusual child process or obfuscated command line.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events. Filter for processes created by common command/scripting interpreters (ParentProcessName: cmd.exe, powershell.exe, bash, etc.). Examine the command line (CommandLine) and process name (NewProcessName) of the child process for indicators of obfuscation (high entropy, specific obfuscation tool keywords, unusual character sets) or execution of unusual binaries from standard interpreter parents. Use entropy measures on child process command lines and compare to a baseline."
          },
          "Command line arguments exhibiting unusual character casing, reversed strings, glob patterns, or suspicious use of environment variables/input redirection.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 command line arguments. Use regular expressions to match patterns indicative of unusual character casing, reversed strings ('rev' command followed by input), glob patterns ('*', '?', '[]') in unexpected locations, or suspicious input/output redirection ('<', '>') within the command line. Flag events matching these patterns for investigation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]