[
    {
        "information_requirement": "Is the adversary moving laterally through the network using remote services?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1021",
                "name": "Remote Services",
                "evidence": [
                    {
                        "description": "Use of remote services for lateral movement originating from a host known to be compromised or associated with a prior high-fidelity security alert.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain an active watchlist of internal host IP addresses/hostnames that are confirmed compromised or have generated high-fidelity alerts. Inner join this list with the source host field from remote service logs (Zeek conn.log for RDP/SSH/WinRM connections; 'Source Network Address' from Windows Event ID 4624 for Logon Type 10/3). Alert on any successful remote connection originating from a host on this watchlist, as it may indicate an adversary leveraging a foothold for lateral movement."
                    },
                    {
                        "description": "Execution of known lateral movement tools (e.g., PsExec, wmic) or suspicious command-line arguments (e.g., encoded PowerShell) immediately following a remote service login.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a successful remote login (Windows Event ID 4624, Logon Type 10) with subsequent process creation events (Windows Event ID 4688) on the destination host within a short time window (e.g., 5 minutes). Scan the 'CommandLine' and 'ProcessName' fields in Event ID 4688 for patterns matching known lateral movement tools (psexec.exe, wmic.exe, etc.) or suspicious command argument structures (e.g., `powershell -enc`, `-nop -w hidden`, `net use`). Maintain and apply a library of these regex patterns to detect tool-based lateral movement."
                    },
                    {
                        "description": "Anomalous remote service login between internal hosts that deviates from established baselines of user-to-host or host-to-host access patterns.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Model normal lateral movement traffic by creating a graph of source-destination host pairs and user-host pairs from historical remote service logs (Windows Event ID 4624 Logon Type 10, Zeek conn.log on ports 22, 3389, 5985, etc.). Use descriptive statistics and frequency analysis to identify common, high-frequency edges in the graph, representing normal administrative paths. Alert on new, low-frequency connections (e.g., a user from Marketing RDPs to a developer server for the first time). Use time series analysis to detect sudden changes in the volume of connections between specific host groups (e.g., workstations to workstations)."
                    },
                    {
                        "description": "A single host, after receiving an inbound remote connection, initiating multiple outbound remote connections to other internal systems in a short time frame ('fan-out' behavior).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify hosts that are destinations of a successful remote connection (via Zeek conn.log or Windows Event ID 4624). Subsequently, monitor these hosts as sources of new outbound remote connections (e.g., to ports 3389, 22, 5985). Count the number of unique destination hosts connected to by the initial host within a sliding time window (e.g., 60 minutes). Use percentile analysis or a fixed threshold (e.g., >5 unique hosts for a non-admin server) to flag potential fan-out activity indicative of automated or scripted lateral movement."
                    },
                    {
                        "description": "Use of less common remote administration protocols (e.g., WinRM, Apple Remote Desktop) or standard protocols on non-standard ports for host-to-host connections within the internal network.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for internal-to-internal traffic on ports associated with less common remote services (e.g., WinRM on 5985/5986, ARD on 3283/5900) that are not part of a documented administrative baseline. Also, scan for traffic that has a known remote service signature (e.g., RDP, SSH) on a non-standard port. Use frequency analysis and entropy measures on the `(src_ip, dst_ip, dst_port, proto)` tuple to identify rare combinations that represent anomalous lateral movement attempts and warrant investigation."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
