[
  {
    "Is the adversary using stripped payloads to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.008 - Stripped Payloads": {
          "Discovery of executable or script files with significantly reduced symbols or string information compared to typical binaries of the same type.": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) to log full file paths and hashes of executed binaries. Use Zeek file.log to capture file info and hashes for downloaded or transferred files. Perform entropy analysis on captured files (if data source allows enrichment) or use hash lookups against threat intelligence or internal analysis platforms to check for the presence/absence of symbols and strings based on known stripped file indicators. Flag files with unusually low symbol counts or known stripped patterns."
          },
          "Observation of a newly executed process exhibiting unusual or 'low-level' API calls or lacking expected module dependencies often present in standard binaries.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creations, logging the command line and parent process. Analyze subsequent Zeek conn.log entries originating from the new process ID or involving the host where the process was created. Look for patterns of connections or process activity that are inconsistent with standard software, potentially identifying direct low-level communication or unusual execution flows indicative of manually crafted or stripped code. Use correlation analysis to link process creation events to subsequent network activity or unusual child processes."
          },
          "Discovery of executable or script files with suspicious metadata characteristics (e.g., lack of version info, low file size relative to typical functionality, unusual section entropy).": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for file creation/modification events and Windows Event ID 4688 for executed files, logging hashes where available. For identified executable or script files, attempt to extract metadata (e.g., from Zeek file.log's pe.log or using external tools via hash). Check for absence or anomalies in standard metadata fields (version info, company name, product name). Use tools or hash lookups to analyze file structure, section headers, and calculate section entropy. Compare observed metadata absence and entropy values against baselines for known good software using descriptive statistics and flag significant deviations or known patterns associated with stripping."
          },
          "Execution of a binary with indicators of stripping (low symbols/strings) from a temporary user directory or directly after download via a non-standard channel.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations, logging the full path and command line. Correlate execution events of files located in temporary user directories (`%TEMP%`, `%APPDATA%\Local\Temp`, etc.) or other common malware drop locations with Zeek http.log or file.log events indicating recent downloads to that host. For files executed from these locations, check file characteristics (e.g., via hash lookup against threat intelligence or external analysis platforms) for low symbol/string counts or other signs of stripping. Prioritize investigation of stripped files executed from suspicious locations or linked to recent downloads via correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]