[
  {
    "Is the adversary evading defenses by encrypting or encoding files? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.013 - Encrypted-Encoded File": {
          "Presence of unusual or suspicious file types known to be used for embedding encrypted/encoded payloads (e.g., password-protected documents, SFX archives) on endpoints.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation/modification events on endpoints. Identify files with suspicious extensions or properties (e.g., '.doc', '.docx', '.xls', '.xlsx' with embedded macros, '.sfx' archives) in unusual locations or with potentially high entropy/low compressibility (potentially indicating encryption/encoding). Use entropy measures or compression analysis on file contents if available, comparing against known benign file types using descriptive statistics."
          },
          "Execution of processes or commands associated with decoding/deobfuscation (e.g., base64 decoding, self-extracting archive execution) followed by suspicious activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation, specifically looking for command-line arguments containing known encoding/decoding utilities (e.g., `certutil -decode`, `powershell -command [System.Convert]::FromBase64String`, `tar -xf`, `unzip`) or execution of self-extracting archives (.exe). Correlate execution of these processes with subsequent suspicious file modifications or network connections (Zeek conn.log). Use correlation analysis between process execution and follow-on activity."
          },
          "Detection of unusually large or frequent encoded strings (e.g., Base64) in process command lines or network traffic not typical for the protocol/process.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 command lines for the presence of long strings potentially encoded (e.g., using regex for Base64 patterns). Analyze Zeek http.log, dns.log, and ssl.log for large encoded strings in relevant fields (e.g., HTTP POST data, DNS TXT records, SSL certificate details, SNI). Use frequency analysis or length thresholding to identify unusually long/frequent encoded strings compared to baseline for specific processes/protocols."
          },
          "Creation or modification of files with suspiciously high entropy, particularly in unexpected locations or with suspicious names/extensions.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation and modification events on endpoints and servers. For flagged events (e.g., unusual location, suspicious extension), trigger an automated analysis of the file's content entropy. Calculate file entropy using statistical methods. Flag files exceeding a high entropy threshold (e.g., Shannon entropy > 7.0) for further investigation, especially when found in user directories or temporary folders. Use descriptive statistics to establish baseline entropy ranges for common file types and locations and flag significant deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]