```json
[
  {
    "Is the adversary evading defenses using software packing? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.002 - Software Packing": {
          "Execution of a file containing specific signatures of known software packers or with a hash matching a known packed malware sample.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Windows Event ID 4688 for new process creation. For each new executable path, trigger a static analysis process to compute its hash and scan its content. Cross-reference the hash against a CTI feed of known malicious file hashes. Simultaneously, use a YARA rule set to scan the file for byte sequences or strings that are specific signatures of known software packers (e.g., UPX, MPRESS, Themida, VMProtect). Alert on any hash or signature matches."
          },
          "Execution of an executable file exhibiting characteristics common to packing, such as high entropy or an unusual PE section layout.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each new process identified via Windows Event ID 4688, trigger a static analysis of the associated executable file. Calculate the entropy for the entire file and for each PE section. Use descriptive statistics to establish a baseline entropy for legitimate software on the network and flag executables with entropy levels significantly higher than the baseline (e.g., >7.5 out of 8.0, or in the top 99th percentile). Also, inspect the PE header for an unusually small number of sections or section names that match common packer patterns (e.g., '.UPX0', '.UPX1', or scrambled names), and flag these anomalies."
          },
          "A process exhibiting a mismatch between its static characteristics (e.g., few imported functions) and its dynamic runtime behavior (e.g., extensive network activity or creation of suspicious child processes).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For new processes (Windows Event ID 4688), perform lightweight static analysis to identify executables with very few imported functions, a common pattern for packed software. Correlate these 'low-import' processes with subsequent runtime activity within a short time window (e.g., 1-2 minutes), such as making network connections (Zeek conn.log) to non-standard ports or CTI-flagged IPs, or creating child processes (e.g., 'cmd.exe', 'powershell.exe') with suspicious command lines. A correlation analysis can identify processes whose runtime behavior is unexpectedly complex given their simple static structure."
          },
          "A legitimate system process (e.g., svchost.exe, explorer.exe) spawning unusual child processes or initiating network connections inconsistent with its established baseline behavior, suggesting code injection from an unpacked payload.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal process behavior for common, legitimate system processes (e.g., 'svchost.exe', 'explorer.exe', 'lsass.exe'). Using historical Windows Event ID 4688 data, profile their typical parent processes, command-line arguments, and child processes via frequency analysis. Monitor for anomalies such as a process starting with an unexpected parent or a legitimate process spawning suspicious children (e.g., 'explorer.exe' launching 'powershell.exe' with an encoded command). Correlate these process anomalies with unexpected network connections (Zeek conn.log) originating from these same legitimate processes. Use correlation analysis to flag rare parent-child-network activity chains."
          },
          "Execution of a process from a non-standard or user-writable directory (e.g., %APPDATA%, %TEMP%, C:\\Users\\Public\\), followed by suspicious network or file system activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for all process creation events. Maintain an allow-list of standard execution paths (e.g., 'C:\\Program Files\\', 'C:\\Windows\\System32\\'). Flag and scrutinize any processes executed from user-writable or temporary locations. Correlate the execution of these processes with subsequent network beaconing activity (identified in Zeek conn.log via time series analysis of connection intervals and data volume) or the creation of additional suspicious files or processes. Use descriptive statistics to identify file paths that have a low frequency of execution across the enterprise, as these are often abused by malware."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```