[
  {
    "Is the adversary attempting to evade defenses using fileless storage? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027.011 - Fileless Storage": {
          "Unusual modifications to Windows Registry keys often used for persistence or storing malicious data.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to sensitive or commonly abused Registry keys (e.g., Run keys, BITS jobs). Analyze changes for signs of obfuscated or encoded data. Use frequency analysis on modified keys to identify outliers."
          },
          "Suspicious activity involving the WMI repository, such as new WMI event subscriptions or provider registrations.": {
            "Data": "Windows Event ID 5861",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5861 for new WMI provider registrations. Investigate the associated executable and command line. Correlate WMI activity with unusual process creation events (e.g., Windows Event ID 4688) or network connections (Zeek conn.log) that occur shortly after the WMI event. Use time series analysis to detect unusual spikes in WMI activity."
          },
          "Execution of PowerShell or command-line utilities to write unusual or large amounts of data to Windows Event Logs, or to create new event logs for data storage.": {
            "Data": "Windows Event ID 4688; Windows PowerShell Event ID 4103; Windows PowerShell Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for `powershell.exe`, `cmd.exe`, or `wevtutil.exe` with command-line arguments indicative of writing to event logs (e.g., `Write-EventLog`, `wevtutil cl /it:<custom_payload>`) or creating new event logs (`wevtutil cl <logname> /is:true`). If PowerShell script block logging (Event IDs 4103, 4104) is enabled, analyze scripts for event log writing activities. Use descriptive statistics to baseline normal event log write volumes or frequencies by process and flag significant deviations or writes from non-standard processes."
          },
          "Direct access attempts or modifications to physical backing files of Registry hives or WMI repository by non-standard processes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Windows Event ID 4663 for access attempts (especially write access) to Registry hive files (e.g., SAM, SECURITY, SYSTEM, SOFTWARE, NTUSER.DAT) or the WMI repository directory (`%SystemRoot%\\\\System32\\\\Wbem\\\\Repository`). Correlate access events with the responsible process (from Event ID 4663 or by linking to Event ID 4688 via Process ID). Baseline normal processes accessing these files (e.g., system processes, backup software) and investigate access by unusual or user-land processes. Apply correlation analysis to link these access events with subsequent network connections (Zeek conn.log) made by the same process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]