[
  {
    "Is the adversary attempting to evade defenses using polymorphic code? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027.014 - Polymorphic Code": {
          "Multiple executions of files or processes with varying hash values but similar execution behavior or command-line arguments.": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) and Zeek file.log. Group processes by parent/child relationships and command-line structure. Correlate process creations with file hashes from Zeek. Identify instances where the same process name or command line is observed multiple times but associated file hashes change. Use correlation analysis to identify widespread occurrences or linkages."
          },
          "Network connections exhibiting irregular payload structures or changing communication patterns over time, indicative of polymorphic C2 or data exfiltration.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections to external IPs. Examine payload sizes, request patterns, and frequency for suspicious destinations. Use time series analysis and entropy measures on connection data or payload characteristics to identify changing or unpredictable network traffic patterns."
          },
          "Multiple child processes created by a single parent, where the child processes have varying file hashes or names but exhibit similar command line structures or target the same resources.": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 and Zeek file.log. Group 4688 events by ParentProcessID and identify patterns in CommandLine or NewProcessName. Correlate NewProcessName/path with Zeek file.log entries to obtain hashes. Identify ParentProcessIDs spawning multiple child processes where child processes have similar command lines or target paths but different hashes. Use frequency analysis or entropy measures on child process hashes/names spawned by specific parents to flag high variability."
          },
          "Recurring network connections from the same host to a potentially suspicious external destination, where the connection metadata (e.g., TLS Ja3/Ja4 hash, HTTP header patterns, payload size characteristics) exhibits variability over time.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Zeek conn.log, http.log, and ssl.log. Group connections by source host and destination IP. For recurring connections to the same destination, analyze the variability of connection attributes over time (e.g., using time series analysis). Calculate entropy or standard deviation for fields like payload size (conn.log), HTTP User-Agent (http.log), or TLS JA3/JA4 hash (ssl.log). Flag connections exhibiting high variability in these attributes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]