[
  {
    "Is the adversary exfiltrating data using scheduled transfers? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1029 - Scheduled Transfer": {
          "Unrecognized processes or scripts exhibiting file system traversal followed by network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Event ID 4688). Correlate new or unknown processes with file access events (Event ID 4663) indicating traversal of sensitive directories. Correlate process activity and file access with network connections (Zeek conn.log) and file transfer details (Zeek file.log). Analyze network traffic patterns associated with file transfers initiated by these processes using descriptive statistics on bytes transferred."
          },
          "Recurring network connections from internal hosts to external destinations occurring at the same time daily or at regular intervals.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log data. Group network connections by source IP, destination IP, destination port, and time of day. Identify connection groups where connections occur at statistically similar times over multiple days or weeks using time series analysis or correlation analysis on connection timestamps. Investigate connections with high correlation to specific times of day or regular intervals."
          },
          "Large volume data transfers using uncommon or unexpected protocols/ports occurring during a specific, recurring time window.": {
            "Data": "Zeek conn.log; Zeek dce_rpc.log; Zeek dns.log; Zeek ftp.log; Zeek http.log; Zeek smtp.log; Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn.log, protocol-specific logs like http.log, ssl.log, etc.) for large data transfers (e.g., bytes_orig > threshold or bytes_resp > threshold). Filter for connections using uncommon destination ports or application protocols not typical for the organization or user. Group these large transfers by source IP and time of day. Identify source IPs that show large transfers using uncommon methods repeatedly within a specific time window (e.g., ±15 mins) over multiple days. Use descriptive statistics (e.g., sum, mean of bytes transferred) to establish baseline transfer volumes and identify outliers. Correlate with protocol analysis to flag unusual application layer behavior."
          },
          "Creation of scheduled tasks or jobs followed by outbound network connections at the scheduled time.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4698 (task creation) and 4702 (task updated). Extract task details, including trigger times and the command/program to be executed. Monitor Windows Event ID 4688 for process creation of 'schtasks.exe' or 'at.exe' with suspicious command-line arguments indicating outbound connections or data handling (e.g., using 'bitsadmin', 'curl', scripting languages). Correlate the execution time of the scheduled task/process creation with subsequent outbound network connections captured in Zeek conn.log that match the target/protocol hinted at in the task command. Use time series analysis to identify connections occurring consistently after a scheduled task trigger."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]