```json
[
  {
    "Is the adversary using HTML Smuggling to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.006 - HTML Smuggling": {
          "An HTML file is downloaded from a domain/IP known for malicious hosting, or the file hash matches a known HTML smuggling payload.": {
            "Data": "Zeek conn.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IPs and domains from Zeek conn.log against a CTI feed of known malicious hosts. Concurrently, use Zeek's file extraction capabilities to calculate the hash (e.g., SHA256) of all downloaded HTML, JS, or archive files (ZIP, ISO) and compare them against a threat intelligence database of known malicious file hashes. Alert on any match."
          },
          "HTML or JavaScript files contain a co-occurrence of functions used to construct a file in the browser (e.g., 'Blob', 'atob') and programmatically trigger a download (e.g., 'msSaveOrOpenBlob', 'download' attribute, '.click()'), particularly when obfuscated.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan the content of files with MIME types 'text/html' and 'application/javascript' extracted from Zeek http.log and files.log. Use regular expressions to detect the presence of both file-creation logic (e.g., `new Blob([...])`, `atob(...)`) and download-triggering logic (e.g., `a.download=`, `.click()`, `msSaveOrOpenBlob`) within the same script block. Calculate the entropy of script blocks containing these keywords to identify potential obfuscation; high entropy combined with these patterns is a strong indicator. Correlate detections to build a risk score."
          },
          "A downloaded HTML document exhibits anomalous characteristics such as an unusually large file size, high-entropy content, and a high ratio of embedded data (e.g., Base64 strings) to overall content, while making few subsequent external network requests.": {
            "Data": "Zeek http.log; Zeek files.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile normal web page characteristics across the network. For each downloaded HTML file, calculate metrics: 1. File size (from Zeek http.log). 2. Entropy of script sections. 3. Size and count of Base64-encoded strings. 4. Number of subsequent HTTP requests originating from the same source IP shortly after the download. Use statistical analysis (e.g., Inter-Quartile Range, box-plots, Z-score) to flag pages that are outliers—specifically, those that are large, have high entropy, are data-heavy, but 'quiet' on the network. A time series analysis can detect sudden increases in such anomalous downloads."
          },
          "A browser process spawns a child process that executes an unsigned script or binary from a common user-writable directory (e.g., Downloads, AppData\\Local\\Temp) shortly after an HTML, ZIP, or ISO file was downloaded.": {
            "Data": "Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network and endpoint data. Use Zeek files.log to identify when a user downloads a file (e.g., .html, .zip, .iso, .js). On the corresponding endpoint, monitor for a process creation event (Windows Event ID 4688) within a short time window (e.g., 60 seconds) where the parent process is a browser (chrome.exe, firefox.exe, etc.) and the new process is executing from the user's Downloads or Temp directories. Prioritize alerts for new processes that are unsigned, have suspicious names (e.g., random characters), or are script interpreters (powershell.exe, wscript.exe). Use linear regression to test the correlation between suspicious download events and subsequent process executions."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```