[
    {
        "information_requirement": "Is the adversary collecting data from removable media?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1025",
                "name": "Data from Removable Media",
                "evidence": [
                    {
                        "description": "Execution of a process from a file whose hash or name matches known malicious tools designed for data collection from removable media.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) on systems where removable media is used. Extract the file hash of the new process image and correlate it against a continuously updated threat intelligence feed of known malware hashes, especially those tagged with 'USB' or 'data theft' capabilities. Maintain and search for a list of suspicious process names (e.g., 'usbstealer.exe', 'infostealer.exe') associated with such tools. Alert on any confirmed matches."
                    },
                    {
                        "description": "Execution of built-in command-line utilities or scripting engines with arguments explicitly targeting removable media for file enumeration or copying.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process command lines (Windows Event ID 4688) for the execution of utilities like `copy`, `xcopy`, `robocopy`, `findstr`, or `powershell.exe`. Filter for instances where arguments include a drive letter commonly assigned to removable media (e.g., D:, E:, F:) and syntax indicative of file searching or copying. For PowerShell, also inspect script block logs (Windows Event ID 4104) for cmdlets like `Get-ChildItem` or `Copy-Item` targeting removable media paths. Flag rare or unauthorized usage of these commands against removable drives, especially from non-interactive sessions."
                    },
                    {
                        "description": "Anomalous bulk file access patterns targeting removable media, such as recursive copying of entire directories or scripted searches for files with sensitive extensions.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze command lines (Windows Event ID 4688) and PowerShell scripts (Windows Event ID 4104) for patterns indicating large-scale collection. Specifically look for recursive flags (e.g., `/s`, `/e`, `-Recurse`), wildcards targeting all files (`*.*`), or scripted loops iterating through multiple sensitive file types (e.g., `*.doc*`, `*.xls*`, `*.ppt*`, `*.pdf`, `*.pst`). Establish a baseline of normal user file copy/search behavior and use frequency analysis and descriptive statistics to identify significant outliers in the volume or scope of files being accessed on removable media."
                    },
                    {
                        "description": "A sequence of events where file collection from removable media is shortly followed by suspicious network activity or data staging.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate host-based events indicating removable media access (identified via command lines in Windows Event ID 4688) with subsequent events on the same host within a short time window (e.g., 1-15 minutes). Look for data staging, such as the creation of a compressed archive (`.zip`, `.rar`, `.7z`) via tools like `7z.exe` or `tar`, or subsequent outbound network connections (Zeek conn.log). Use correlation analysis to link these events by host and time. Flag sequences where data is sent to rare external IP addresses, destinations with low reputation, or over non-standard ports. Use time series analysis on network logs to detect spikes in outbound traffic following removable media access events."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
