[
  {
    "Is the adversary using Windows Remote Management for lateral movement? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.006 - Windows Remote Management": {
          "Unusual execution of the WinRM service or `winrm` command on endpoints or servers where it is not typically used.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `winrm.exe` process creation and Service Control Manager events (e.g., Event ID 7036) for WinRM service state changes. Identify systems where this activity is rare or unexpected based on historical frequency analysis or percentile analysis. Correlate WinRM process activity with subsequent child processes (Event ID 4688) to identify actions taken remotely."
          },
          "Network connections on WinRM ports (5985/5986) originating from unusual sources or targeting unexpected destinations within the network.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections using destination ports 5985 or 5986. Identify source and destination IPs. Calculate connection frequency per source/destination pair. Use correlation analysis to identify WinRM connections occurring in close temporal proximity to other suspicious activities (e.g., successful logins from unusual locations, execution of known malicious processes). Identify rare source-destination pairs using frequency counts."
          },
          "Suspicious processes executed on a remote system via WinRM (e.g., command shells, scripting interpreters, data transfer tools).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creation events where the ParentProcessName is `winrm.exe`. Analyze the NewProcessName and CommandLine for processes commonly used for malicious activity or code execution (e.g., `cmd.exe`, `powershell.exe`, `pwsh.exe`, `cscript.exe`, `wscript.exe`, `bitsadmin.exe`, `certutil.exe`). Calculate the frequency of these processes being spawned by WinRM compared to standard activity baselines and flag activity that deviates significantly using descriptive statistics."
          },
          "WinRM network connections originating from or targeting sensitive systems or unexpected hosts within the internal network.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections on destination ports 5985 or 5986 within the internal network (internal source IP to internal destination IP). Maintain a list of sensitive assets (e.g., Domain Controllers, critical servers). Identify WinRM connections where either the source or destination IP is a sensitive asset, especially if the other IP is from a non-standard source (e.g., a user workstation). Use frequency analysis or correlation to identify unusual lateral movement paths involving sensitive systems."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]