[
  {
    "Is the adversary employing defense evasion techniques, specifically code obfuscation? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027.016 - Junk Code Insertion": {
          "Unusual process execution patterns or behavior (e.g., abnormal thread activity, unexpected parent-child relationships) associated with a program.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Analyze process command lines, parent-child relationships, and execution paths. Identify deviations from baseline behavior or known legitimate patterns. Use correlation analysis (e.g., time-based correlation) between suspicious processes and other host/network events."
          },
          "Suspicious properties of executable files (e.g., high entropy indicative of packing/obfuscation) or associated suspicious network connections.": {
            "Data": "Zeek file.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek file.log for executable file properties, specifically calculating entropy of file contents. Flag files with unusually high entropy values (e.g., > 0.9). Cross-reference flagged files with process creation events (Event ID 4688) and associated network connections (Zeek conn.log). Use descriptive statistics and box-plots on entropy values to identify outliers."
          },
          "Initial outbound network connections from a newly created process to rare or unusual destination ports/protocols.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creations. Correlate with Windows Event ID 5156 and Zeek conn.log for initial outbound connections within a short time window after process start. Use frequency analysis on destination ports and protocols observed from newly created processes across the environment. Flag processes initiating connections to statistically rare or unusual ports/protocols by comparing against historical distributions."
          },
          "Execution of a process from an unusual or suspicious file path (e.g., temporary directories, Recycle Bin, non-standard user folders).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Analyze the 'New Process Name' and 'Command Line' fields for execution paths. Use frequency analysis or entropy measures on file paths and parent-process names to identify statistically unusual execution contexts and flag processes executing from paths typically associated with transient or user-writable locations not intended for program execution (e.g., temp folders, user downloads, recycle bin)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]