[
  {
    "Is the adversary attempting to evade defenses using obfuscation? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027 - Obfuscated Files or Information": {
          "Suspicious command line arguments containing obfuscated strings or escape characters.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation with command line arguments. Use regex or string matching to identify known obfuscation patterns (e.g., environment variables used in unconventional ways, presence of multiple escape characters like '^', '\"'). Analyze entropy of command strings to identify potential encoding or packing."
          },
          "Network traffic containing compressed, encrypted, or otherwise obfuscated files/payloads.": {
            "Data": "Zeek file.log; Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek file.log for files transferred that are identified as compressed or encrypted, especially unexpected types or sizes. Inspect Zeek conn.log for high-entropy TLS connections to suspicious destinations or unusual ports. Use correlation analysis between Zeek logs (conn, http, file) to identify sessions delivering potentially obfuscated content."
          },
          "Execution of known deobfuscation tools or scripts immediately following the creation or modification of a suspicious file.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of processes with names or command-line arguments matching known deobfuscation tools (e.g., PowerShell with flags for encoded commands, certutil -decode, common packer/deobfuscator names). Correlate these process executions with recent file creation or modification events identified via Zeek file.log. Use time-series analysis to look for suspicious sequences of events (file landing -> deobfuscation tool execution) within a short time window."
          },
          "Delivery of encrypted or password-protected compressed files via network protocols (e.g., HTTP, SMTP).": {
            "Data": "Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek file.log for files transferred that are identified with common compression types (e.g., application/zip, application/x-rar-compressed) or marked as encrypted. Filter for files transferred over common web (HTTP/S) or email (SMTP) ports by linking back to conn.log or http.log/smtp.log using the file UID. Flag transfers of encrypted archives or password-protected files (if metadata is available). Use frequency analysis or statistical outliers to identify unusual volumes or types of compressed/encrypted files transferred to specific hosts or users."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]