[
    {
        "information_requirement": "Has the adversary moved laterally within the network using Remote Desktop Protocol?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1021.001",
                "name": "Remote Desktop Protocol",
                "evidence": [
                    {
                        "description": "RDP connection initiated from a source host or with a user account previously flagged as compromised or associated with other high-fidelity malicious activity.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek rdp.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain an active list of compromised host IPs and user accounts derived from other high-confidence security alerts (e.g., malware execution, C2 beaconing). Continuously correlate this list with the source IP ('Network Address' field in Event ID 4624) and user account for all successful RDP login events (Event ID 4624 with Logon Type 10). Inner join this list with Zeek rdp.log 'id.orig_h'. Immediately flag and investigate any RDP sessions originating from a known-bad source within the network."
                    },
                    {
                        "description": "Modification of RDP-related registry keys on a host, such as enabling the service or disabling security warnings, followed by outbound RDP connections from that same host.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4688",
                            "Zeek rdp.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for registry modifications (Windows Event ID 4657) to keys like `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnections` (enabling RDP) or `HKCU\\Software\\Microsoft\\Terminal Server Client\\Servers` (storing connection info). Correlate these modifications with a subsequent process creation of `mstsc.exe` (Event ID 4688) and outbound network connections on port 3389 (Zeek rdp.log) originating from the same host. A time-based correlation (e.g., within 30 minutes) of this specific sequence of events strongly indicates preparation for lateral movement."
                    },
                    {
                        "description": "A single source host or user account initiating RDP connections to an anomalously high number of distinct destination systems within a short timeframe, indicative of lateral movement spraying.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek rdp.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Using Windows Event ID 4624 and Zeek rdp.log, aggregate successful RDP connections by source host ('id.orig_h' in Zeek, Network Address in 4624) over sliding time windows (e.g., 10, 30, 60 minutes). Count the number of unique destination hosts per source. Use descriptive statistics (mean, median, 95th percentile) on historical data to establish a baseline for normal RDP fan-out. Flag any source host exceeding this baseline (e.g., connecting to more unique hosts than 99% of other sources in a given window). A box-plot of unique destinations per source can visually identify outliers."
                    },
                    {
                        "description": "An RDP connection between two hosts that violates established network segmentation policies or represents a statistically rare communication pathway.",
                        "data_sources": [
                            "Zeek rdp.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Model the network graph based on historical RDP connections (Zeek rdp.log, Event ID 4624), establishing common communication pathways (e.g., admin workstations -> servers). Define network zones based on function (e.g., Development, Finance, DMZ). Alert on new RDP connections that create an edge between zones that do not typically communicate or have a very low frequency of occurrence in the historical data. This can be implemented with graph analytics or a simple correlation matrix of source/destination subnet communications."
                    },
                    {
                        "description": "Execution of suspicious processes or establishment of anomalous network connections on a destination host immediately following a successful RDP login.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4688",
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On a destination host, correlate a successful RDP login event (Windows Event ID 4624, Logon Type 10) with subsequent events occurring under the same Logon ID. Monitor for process creation (Event ID 4688) of tools associated with credential dumping (e.g., mimikatz.exe), discovery (e.g., 'net user /domain'), or living-off-the-land binaries (LOLBAS). Analyze command-line arguments for suspicious patterns. Simultaneously monitor for new network connections (Event ID 5156, Zeek conn.log) to unusual internal or external destinations initiated by processes spawned during the RDP session. Use a time-series correlation to link the RDP login to subsequent suspicious activity within a 5-10 minute window."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
