```json
[
  {
    "Is the adversary moving laterally through cloud virtual machines via direct connections? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.008 - Direct Cloud VM Connections": {
          "Outbound network connections from a cloud VM to IP addresses or domains known to be associated with malicious command and control (C2) infrastructure following a direct interactive login.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful interactive logon events (Windows Event ID 4624, filtering for Logon Type 2 or 10) on a cloud VM with subsequent outbound network activity from that same VM. Inner join destination IPs, domains, and URLs from network logs (Zeek conn.log, dns.log, http.log) against a high-confidence, continuously updated threat intelligence feed of known malicious C2 infrastructure. Alert on any confirmed matches and investigate the associated session."
          },
          "Execution of specific command-line utilities, scripts, or processes on a cloud VM that match known patterns of tools used for post-exploitation, discovery, and lateral movement.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Following a successful interactive logon (Windows Event ID 4624, Type 2 or 10), monitor process creation events (Windows Event ID 4688) on the cloud VM, ensuring full command-line logging is enabled. Maintain and apply a list of regular expression patterns to search command-line arguments for known malicious tools (e.g., mimikatz, procdump), credential access scripts (e.g., PowerSploit), or suspicious uses of living-off-the-land binaries (e.g., `nltest.exe`, `net.exe`, `wmic.exe` used for remote discovery or execution). Correlate these pattern-matched process creations with the preceding logon event to identify the responsible session."
          },
          "Anomalous interactive logon activity on a cloud VM, such as logins with local or unusual service accounts, or logins that deviate from the established user and host baselines for time and frequency.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal interactive logon activity (Windows Event ID 4624, Logon Type 2 or 10) for each cloud VM and associated user accounts, considering typical logon times, frequency, and source hostnames/IPs. Monitor for deviations, such as a user logging into a VM they've never accessed, use of a local account where domain accounts are standard, or a sudden spike in failed logins (Event ID 4625) followed by a success from the same source. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores on logon times and frequency distributions to identify and alert on significant outliers."
          },
          "Anomalous outbound network traffic patterns from a cloud VM following a direct interactive login, such as connections to rare external destinations, use of unusual protocols, or significant increases in data transfer volume.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 5156; Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful interactive logins (Windows Event ID 4624) with subsequent network activity from the same VM (Zeek conn.log, Windows Event ID 5156). Establish a baseline of normal outbound destinations and data volumes for the VM. Use frequency analysis or entropy measures on destination IPs, ports, and requested DNS names (from Zeek dns.log) to identify rare or anomalous connections not seen in historical data. Apply time series analysis to data transfer volumes (bytes in/out) to detect sudden spikes indicative of data staging, exfiltration, or tool transfer. Investigate sessions that exhibit high deviation from the established network behavior baseline."
          },
          "A sequence of activities on a cloud VM indicative of hands-on-keyboard lateral movement: a direct interactive login, followed by local discovery commands, and then attempts to access other network resources.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 4648; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and search for a multi-stage behavioral pattern on a single cloud VM within a defined time window (e.g., 60 minutes). The sequence consists of: 1. A successful interactive logon (Event ID 4624, Type 2 or 10). 2. Execution of local discovery commands (Event ID 4688 with command lines containing `whoami`, `ipconfig`, `net user`, `net group`, `quser`, `qwinsta`). 3. An explicit credentials logon attempt to another resource (Event ID 4648) or new outbound network connections to other internal cloud resources on common administrative ports (e.g., 3389, 22, 5985) seen in Zeek conn.log. Correlate events using Logon ID and timestamp to trace the suspicious session activity from initial access to attempted lateral movement."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```