[
  {
    "Is the adversary using defense evasion techniques via dynamic API resolution? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.007 - Dynamic API Resolution": {
          "Execution of a suspicious process (e.g., unsigned, unusual location, odd command line) followed by attempts to access sensitive files or establish unusual external network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify all process creations (Windows Event ID 4688). Analyze process name, path, parent process, and command line for anomalies (e.g., processes running from temp directories, unusual parents, obfuscated command lines). Correlate suspicious process creations with subsequent sensitive file access attempts (Windows Event ID 4663 - requires object access auditing) or external network connections (Zeek conn.log). Use statistical analysis on process metadata or network connection patterns to identify outliers."
          },
          "Execution of a process with characteristics indicative of malware (e.g., unsigned, unusual location) initiating unusual child processes or threads, potentially indicative of code injection or execution of dynamically resolved code.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688). Analyze parent-child process relationships to identify unusual or unexpected process spawning (e.g., office applications launching command shells, browsers launching executables from temp paths). Focus on processes launching system binaries or scripting engines from suspicious parent processes. Use correlation analysis to link suspicious parent process characteristics with child process activity."
          },
          "Execution of a new or unusual process followed by immediate, unusual external network connections or resource access not typically associated with that process type.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for new or unusual processes (e.g., based on file path, parent, signature, hash compared to known good). Correlate creation of flagged processes with subsequent external network connections (Zeek conn.log) or access to sensitive files/registry keys (Windows Event ID 4663) within a short time window (e.g., 60 seconds). Use correlation analysis to identify patterns of specific processes immediately initiating these behaviors, comparing to baseline activity using frequency analysis."
          },
          "Execution of a process with low prevalence or suspicious characteristics immediately followed by system interactions typically performed via dynamic API calls (e.g., creation of processes in unusual ways, modification of critical registry keys, raw network socket activity).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for processes with low prevalence in the environment or exhibiting suspicious command-line patterns (e.g., obfuscated strings). Correlate these processes with subsequent critical system events within a short time window (e.g., 60 seconds), such as process creation with suspicious parents/parameters (4688), access/modification of sensitive registry keys or files (4656/4663 - requires auditing), or direct, unassociated external network connections (Zeek conn.log without typical application layer logs). Use correlation analysis and apply frequency analysis to baseline system interactions per process name/path and flag outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]