```json
[
  {
    "Is the adversary using stripped payloads to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.008 - Stripped Payloads": {
          "An executable file matching the hash of a known stripped malware payload is observed on the network or an endpoint.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously compute hashes (e.g., SHA256) for all executable files transferred over the network (from Zeek file.log) or executed on hosts (from Windows Event ID 4688). Compare these hashes against a high-confidence threat intelligence feed of known malicious file hashes, specifically flagging those identified as stripped malware variants. Generate a high-priority alert on any match."
          },
          "An executable file is identified with an anomalously low count of exported symbols, strings, or missing standard PE metadata sections compared to legitimate software.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For executables identified via Zeek file.log or Windows Event ID 4688, perform static file analysis (either via integrated platform capabilities on file data/hashes or an external sandbox). Calculate metrics such as string count, symbol count, and verify the presence of standard PE metadata (e.g., VersionInfo, CompanyName). Establish baselines for common legitimate software in the environment. Use descriptive statistics (mean, standard deviation) to flag files that are significant outliers (e.g., a symbol count >2 standard deviations below the mean for its purported type) or are missing critical metadata sections expected in legitimate binaries."
          },
          "An executable file exhibits unusual section entropy, such as uniformly high entropy suggesting packing, or the absence of expected low-entropy sections (e.g., .rdata), indicating stripping of resources.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For identified executable files, calculate the Shannon entropy for each PE section. Compare the file's overall entropy and section-specific entropy distribution against baselines for known good executables of a similar type. Use entropy measures to flag files with characteristics of packing (high entropy across most sections) or stripping (e.g., an absent or empty resource section which typically has low entropy). Utilize Inter-Quartile Range (IQR) analysis or box-plots on section entropy values across the environment to identify files with outlier characteristics."
          },
          "A process, spawned from an executable with characteristics of being stripped, executes from an uncommon or temporary user directory and initiates suspicious network connections or child processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) with file analysis results (from other detections) indicating stripping. Prioritize alerts for stripped executables running from atypical paths (e.g., '%APPDATA%', '%TEMP%', 'C:\\Users\\Public\\'). Further correlate these process events with subsequent network activity (Zeek conn.log), looking for connections to non-FQDN IP addresses, unusual ports, or periodic traffic indicative of C2 beaconing. Use time series analysis to model the connection patterns from the new process. Investigate any such process that also spawns common command-line tools (e.g., cmd.exe, powershell.exe)."
          },
          "A process masquerading as a legitimate system binary (e.g., svchost.exe) is launched from an executable file on disk whose properties (e.g., hash, metadata) do not match the known-good system binary and the file exhibits signs of being stripped.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for common, legitimate Windows process names (e.g., svchost.exe, lsass.exe, explorer.exe). For each such event, compare the hash of the executable file on disk with a known-good baseline hash for that binary on the given OS version. Flag any mismatch for investigation. As a secondary check, analyze the static properties of the mismatched binary (via hash lookup or direct analysis) for signs of stripping, such as missing metadata or low symbol counts. Generate a critical alert for any process masquerading as a system binary where the underlying file is an unknown, stripped executable."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```