[
  {
    "Is the adversary collecting data from removable media? (TA0009 - Collection)": {
      "Indicators": {
        "T1025 - Data from Removable Media": {
          "Command execution patterns indicative of searching or copying files from removable drives (e.g., usage of dir or copy commands targeting removable drive letters).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Identify process command lines containing drive letters typically assigned to removable media (e.g., \"D:\\\", \"E:\\\") combined with commands like `dir`, `copy`, `xcopy`, `move`, `findstr`, `powershell -command Get-ChildItem`, etc. Use frequency analysis or rare event analysis to flag command patterns targeting removable media that deviate from normal user activity."
          },
          "Process execution indicating data collection tools or scripts interacting with removable media.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Identify process creations where the parent process or command line suggests suspicious activity (e.g., unexpected scripts, known malicious tools, abnormal arguments) combined with command line arguments or behavioral patterns indicative of accessing removable media. Analyze correlations between process execution and device connection events (if available, though not explicitly requested log types) or subsequent network activity."
          },
          "Usage of system management tools (WMI, PowerShell) to access or list files on removable media.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104; Windows Event ID 104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creations related to PowerShell (`powershell.exe`) or WMI (`wmiprvse.exe`) with command-line arguments targeting removable drive paths. Analyze PowerShell script block logs (Event ID 4104) and WMI activity logs (Event ID 104) for queries (e.g., `Get-ChildItem`, WMI `CIM_DataFile`) explicitly listing or accessing files on removable media paths. Use frequency analysis or clustering to baseline normal system management tool usage patterns and flag deviations involving removable media access."
          },
          "Suspicious outbound network connections from a system shortly after access to removable media is detected.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate events indicating access to removable media (e.g., specific command lines in Windows Event ID 4688, system management tool activity from related logs) with subsequent outbound network connections detected in Zeek conn.log or Windows Event ID 5156. Filter connections occurring within a short time window (e.g., 1-5 minutes) after removable media access. Analyze connection properties (destination IP/port, data volume) and flag connections to unusual destinations, non-standard ports, or involving known exfiltration tools. Use correlation analysis between removable media access events and network connection events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]