[
  {
    "Is the adversary evading defenses using compression? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.015 - Compression": {
          "Transfer or handling of unusual compressed file formats (e.g., self-extracting archives, concatenated ZIPs) or compressed files with suspicious names/extensions.": {
            "Data": "Zeek http.log; Zeek file.log; Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and file.log for file transfers containing common compressed extensions (zip, rar, 7z, gz, sfx) or identified as archives. Analyze Windows Event ID 4688 and 4663 for process creation or file access involving these extensions, especially in unusual locations or with suspicious command line arguments. Use frequency analysis on file extensions and names to identify rare or anomalous archives compared to baseline."
          },
          "Presence of compressed or heavily encoded data within process memory, command lines, or configuration settings (e.g., Windows Registry values) that deviates from normal behavior.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes with unusually long or heavily encoded command lines, potentially containing compressed or encoded payloads. Monitor Windows Event ID 4657 for modifications to common registry keys used for fileless storage. Use entropy analysis on command line arguments or registry values to identify potentially compressed or encoded data segments exceeding typical entropy thresholds."
          },
          "Network transfer of compressed files to unusual destinations or ports, or in conjunction with other suspicious network activity patterns.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and file.log for transfers of files identified as compressed archives (via MIME type, extension, or file analysis). Filter for connections using non-standard application ports or communicating with endpoints outside of typical business partners. Analyze the volume and frequency of compressed file transfers per source/destination pair using descriptive statistics (mean, sum) and identify outliers or sudden spikes using IQR or percentile analysis."
          },
          "Execution of processes directly from common temporary directories, especially when preceded by network transfer of compressed files or creation of new files in temp directories.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the executable path is within a common temporary directory (%TEMP%, %AppData%\\Local\\Temp, C:\\Windows\\Temp, etc.). Correlate these process executions with recent Windows Event ID 4663 (File Access) events showing files being written to those same temporary directories, or with Zeek file.log entries showing compressed archives being downloaded to the endpoint. Use correlation analysis to link file transfer/creation events with subsequent execution from temp locations within a short time window."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]