[
  {
    "Has the adversary moved laterally through the network using SSH? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.004 - SSH": {
          "SSH logins by user accounts to systems they do not normally access or at unusual times.": {
            "Data": "Linux auth.log; Linux secure log; Zeek ssh.log; Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze SSH authentication logs (Linux auth.log/secure, Zeek ssh.log, Windows Event ID 4624 - Logon Type 3 for network logins potentially via SSH) to identify successful logins. Compare logged-in users and destination systems against established baselines of normal access patterns using descriptive statistics (frequency analysis of user-system pairs). Flag logins involving users accessing systems outside their usual roles or typical work hours (e.g., using IQR or percentile analysis on login times)."
          },
          "A single user account making SSH connections to an unusually high number of distinct systems within a short timeframe, or SSH connections originating from unexpected internal source IPs.": {
            "Data": "Linux auth.log; Linux secure log; Zeek ssh.log; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate SSH connection data (Linux auth.log/secure, Zeek ssh.log, Zeek conn.log) by source user or IP over specific time windows (e.g., 1 hour). Calculate the number of distinct destination IPs/hostnames contacted by each source. Use outlier detection methods (e.g., IQR, Z-score) to identify users or IPs connecting to a statistically unusual number of systems. Investigate connections from internal IP ranges not typically associated with administrative tasks requiring SSH."
          },
          "Execution of reconnaissance or data collection commands shortly after a successful SSH login to a system.": {
            "Data": "Linux auditd logs; Linux auth.log; Linux secure log; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful SSH logins (Linux auth.log/secure, Windows Event ID 4624 Logon Type 3) with subsequent process execution events (Linux auditd logs - look for syscall=execve/execveat; Windows Event ID 4688) on the target system. Filter for commands commonly used for reconnaissance (e.g., `whoami`, `id`, `pwd`, `ls`, `find`, `ip`, `netstat`) or data collection shortly after login (e.g., within 5-10 minutes). Analyze the frequency and sequence of executed commands after a login using descriptive statistics."
          },
          "SSH logins using authorized_keys from source IPs or times not associated with normal authorized_keys usage.": {
            "Data": "Linux auth.log; Linux secure log; Zeek ssh.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze SSH authentication logs (Linux auth.log/secure, Zeek ssh.log) to identify logins authenticated via public key (rather than password). Correlate key-authenticated logins with source IP addresses and login times. Establish baselines for which IPs/times are typically associated with key-based authentication using frequency analysis. Flag key-authenticated logins from unusual source IPs, outside normal key-usage hours, or by accounts that rarely/never use key authentication."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]