[
  {
    "Has the adversary moved laterally within the network using VNC? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.005 - VNC": {
          "Unusual VNC connection attempts or successful sessions between internal hosts, especially involving systems or users not typically requiring VNC access.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections on standard VNC ports (5900-5906, 5800-5806) between internal hosts. Identify source and destination IP/host pairs. Establish baseline VNC usage patterns (source/destination pairs, time of day). Use frequency analysis or outlier detection (e.g., Box-plots on connection counts by host pair) to identify rare or unusual connections. Investigate connections between high-value targets or from unexpected sources."
          },
          "Suspicious or malicious activity observed on a system immediately following a VNC session (e.g., execution of unexpected commands, access to sensitive data, network scanning).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek dns.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For systems that had active VNC sessions (identified via Zeek or host logs), correlate VNC session times with host activity logs (Windows Event ID 4688 for process creation, Windows Event ID 4663 for object access). Analyze process creation events and file access logs occurring during or immediately after a VNC session. Look for commands or file accesses inconsistent with the user's normal activity profile or the system's role. Correlate with Zeek dns.log and http.log for suspicious network activity initiated from the host during/after the VNC session."
          },
          "High volume of failed VNC connection attempts from an internal source host to one or more destination hosts, potentially indicating brute-force or credential spraying, followed by a successful VNC connection.": {
            "Data": "Zeek conn.log; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for patterns indicative of VNC brute-force: multiple short connections or TCP resets on VNC ports (5900-590X) from a single source IP to one or multiple destination IPs in a short timeframe. If VNC uses system authentication, correlate with bursts of Windows Event ID 4625 on target hosts originating from the source IP. Use time series analysis or thresholding (e.g., >10 attempts in 5 minutes) on connection attempts per source-destination pair. Flag any successful VNC connection (e.g., longer duration, successful handshake in Zeek, or Windows Event ID 4624) from a source IP after observing a series of failures."
          },
          "VNC access to or from critical servers or segments using non-standard VNC client/server applications or unexpected user accounts.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify VNC connections (Zeek conn.log on ports 5900-590X) involving pre-defined critical servers or network segments. On these systems, monitor Windows Event ID 4688 for VNC server/client process names or hashes that deviate from approved VNC software. Examine Windows Event ID 4624 associated with VNC logons for use of unexpected accounts (e.g., service accounts, administrative accounts not authorized for VNC, or default/test accounts). Use correlation analysis to link such VNC sessions with subsequent anomalous host or network activity on those critical assets."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]