[
  {
    "Is the adversary evading defenses using embedded payloads? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.009 - Embedded Payloads": {
          "Execution of files with unusual properties (e.g., unexpected overlays, self-nesting) or suspicious execution behavior.": {
            "Data": "Windows Event ID 4688; Zeek file.log; Zeek pe.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Event ID 4688) and file metadata logs (Zeek file.log, pe.log). Identify files executed with unusual section structures (from pe.log) or atypical file sizes relative to their type. Use statistical analysis on file metadata or byte patterns to flag outliers that might indicate embedded payloads or overlays. Investigate executions of files flagged by this analysis for suspicious parent-child relationships or network connections."
          },
          "Process injection attempts where the source of injected code appears to originate from data loaded or embedded in a seemingly benign process.": {
            "Data": "Windows Event ID 8; Windows Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process injection events (Sysmon Event IDs 8, 10). Analyze the source process, target process, and characteristics of the injected code/memory region. Use correlation analysis to link injection events to prior file operations (creation, modification) or network events, looking for patterns where the injected payload source aligns with data potentially embedded or loaded from an external source."
          },
          "Execution of files with extensions typically associated with non-executable data (e.g., .txt, .dat, .jpg), or files where network-observed MIME type mismatches its extension, followed by suspicious child process creation or network activity.": {
            "Data": "Windows Event ID 4688; Zeek file.log; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for processes launched from files with extensions not typically associated with executables (e.g., .txt, .jpg, .dat). Simultaneously, use Zeek file.log to identify files traversing the network where the observed MIME type (e.g., 'application/x-dosexec') is inconsistent with the file extension (e.g., '.jpg'). Correlate executions of such files with subsequent suspicious child processes (Event ID 4688) or outbound network connections (Windows Event ID 5156, Zeek conn.log). Apply frequency analysis to identify rare execution patterns of specific file extensions or common extension/MIME type mismatches observed."
          },
          "Scripts (e.g., PowerShell, VBScript) or documents with active content de-obfuscating, dropping, and then executing an embedded payload or injecting it into another process.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4103; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze PowerShell script block logs (Windows Event ID 4104) and module logs (Windows Event ID 4103) for indicators of embedded payload execution, such as large encoded strings, de-obfuscation functions, reflection, or dynamic code execution. Correlate with process creation events (Windows Event ID 4688) where a script interpreter (powershell.exe, wscript.exe, cscript.exe) or an Office application (Winword.exe, Excel.exe) spawns an unexpected executable or initiates code injection. Use entropy measures on script blocks from Event ID 4104 to prioritize analysis of highly obfuscated scripts. Track sequences of file write events followed by execution of the written file by the same parent process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]