```json
[
  {
    "Is the adversary attempting to evade defenses using fileless storage? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027.011 - Fileless Storage": {
          "Detection of known malicious signatures, IOCs (e.g., specific script content, encoded commands, malware-specific identifiers) within Windows Registry values, WMI objects, or Event Log entries.": {
            "Data": "Windows Event ID 4657; Windows Event ID 5861; Windows PowerShell Event ID 4103; Windows PowerShell Event ID 4104; Windows Event Logs (various applicable IDs)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan Registry values (from Event ID 4657 changes or periodic auditing), WMI repository objects/subscriptions (from Event ID 5861 or WMI query logs), PowerShell script blocks (Event IDs 4103, 4104), and Event Log entries for known malicious strings, byte sequences (e.g., shellcode fragments), encoded commands (e.g., Base64 strings that decode to known malicious scripts), or specific identifiers/paths associated with malware families known to use fileless storage. Utilize YARA rules or exact string/regex matching against a CTI-informed list of selectors updated regularly."
          },
          "Network traffic patterns matching known C2 channels or IOCs of malware that utilizes Linux shared memory (e.g., /dev/shm, /run/shm) for fileless storage of payloads or configurations.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network connections (Zeek conn.log, http.log, ssl.log) for traffic to/from IP addresses, domains, or involving SSL certificates/JA3 hashes known to be associated with malware campaigns that leverage Linux fileless techniques (e.g., specific botnets that store modules in /dev/shm). Correlate such traffic with activity from Linux hosts if identifiable within the network logs. This serves as an indirect selector for potential fileless storage activity on Linux endpoints."
          },
          "Anomalous PowerShell or command-line execution patterns involving writing large, obfuscated, or executable content to non-standard Windows Registry paths, WMI namespaces/classes, or custom Event Logs.": {
            "Data": "Windows Event ID 4688; Windows PowerShell Event ID 4103; Windows PowerShell Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for `powershell.exe`, `cmd.exe`, `cscript.exe`, `wscript.exe` using command-line arguments that write to Registry (e.g., `reg add`, `Set-ItemProperty`), WMI (e.g., `Set-WmiInstance`, `mofcomp.exe`), or Event Logs (`Write-EventLog`, `wevtutil.exe cl /it:`). Analyze PowerShell script blocks (Event IDs 4103, 4104) for scripts that are heavily obfuscated (e.g., high character frequency variance), unusually long, or contain byte arrays/executable content being written to these fileless locations. Look for patterns like creating new, oddly named or randomly generated Registry keys, WMI classes, or Event Logs for data storage. Use entropy measures on script content or data being written to flag potential obfuscation."
          },
          "Detection of script content fetched over the network intended for execution from Linux shared memory, containing command patterns indicative of writing to or executing from these locations.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze content of files transferred over HTTP/HTTPS (Zeek http.log, files.log, and ssl.log with decryption if available), particularly scripts (shell, Python, Perl), for commands or patterns indicative of writing to or executing from Linux shared memory locations (e.g., `>/dev/shm/`, `wget -O /dev/shm/`, `curl -o /run/shm/`, `chmod +x /dev/shm/filename`, execution of files directly from `/run/shm`). Use regular expression matching for these specific command patterns within downloaded script content that targets Linux systems."
          },
          "Unusually large data volumes, high frequency of writes, or data with high entropy being stored in Windows Registry keys, WMI repository, or Event Logs, especially by non-standard or newly observed processes.": {
            "Data": "Windows Event ID 4657; Windows Event ID 5861; Windows Event Logs (various); Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for typical size, frequency, and entropy of data written to common and sensitive Registry locations, WMI classes, and Event Logs by legitimate processes. Monitor Windows Event ID 4657 (Registry writes), Event ID 5861 (WMI changes), and event log creation/write events. Flag activities that significantly deviate from these baselines (e.g., using Inter-Quartile Range (IQR) or Z-scores on data size/write frequency per process). Investigate processes (identified via Event ID 4688 or embedded in event data) writing large binary blobs or highly entropic data, which may suggest encrypted/packed payloads or staged data. Time series analysis can detect unusual spikes in write activity to these locations."
          },
          "Anomalous WMI activity, such as creation of persistent WMI event consumers or subscriptions by unsigned/unknown providers, or WMI processes executing unusual child processes or network connections.": {
            "Data": "Windows Event ID 5859; Windows Event ID 5860; Windows Event ID 5861; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor WMI operational event logs (Event ID 5859 - Permanent Event Consumer created, 5860 - WMI Event Subscription created, 5861 - WMI Provider Registration). Scrutinize new permanent event consumers for associated scripts/commands and their purpose. Investigate WMI provider registrations (5861) from unknown, unsigned, or suspiciously named executables. Correlate WMI persistence mechanisms with subsequent process creations (Windows Event ID 4688) initiated by the WMI service (wmiprvse.exe) or related processes, and any outbound network connections (Zeek conn.log) from these processes. Use descriptive statistics to identify rare WMI event types or sources."
          },
          "Direct modification or access attempts to the physical backing files of Windows Registry hives or the WMI repository by unexpected user-land processes or those with anomalous behavior.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Windows Event ID 4663 (Object Access attempts) for write access attempts to critical system files including Registry hives (e.g., SAM, SECURITY, SYSTEM, SOFTWARE, NTUSER.DAT) and the WMI repository directory (`%SystemRoot%\\System32\\Wbem\\Repository`). Baseline legitimate processes (e.g., System, svchost.exe instances hosting system services, trusted backup utilities) that access these files. Alert on access by unexpected, unsigned, or user-land processes (identified from Event ID 4663 data or correlated with Event ID 4688). Use correlation analysis to link these file access events with other suspicious activities by the same process, such as subsequent network C2 communications (Zeek conn.log) or further malicious tool deployment."
          },
          "Anomalous network behavior (e.g., C2 communication, data exfiltration attempts) from Linux processes that were initiated by scripts or binaries downloaded to or executed from locations commonly abused for fileless storage (indirectly suggesting use of /dev/shm, /run/shm, etc.).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs for Linux hosts downloading executable files or scripts (Zeek files.log, http.log), especially if the downloaded content contains patterns indicative of shared memory usage (see Linux Pattern detection evidence). Flag subsequent network connections (Zeek conn.log) from the recipient host that are unusual for that host or environment (e.g., connections to new external IPs, use of non-standard ports, exhibiting regular beaconing behavior, or large data uploads). Use time series analysis on network traffic volume and connection counts from hosts that downloaded such suspicious files to detect significant changes in communication patterns post-download. This serves as an indirect behavioral indicator of fileless malware execution on Linux systems."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```