[
  {
    "Is the adversary using LNK icon smuggling for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.012 - LNK Icon Smuggling": {
          "Creation or modification of LNK files with unusual icon location paths (e.g., external URLs, unusual local paths) or suspicious target paths referencing scripting/proxy execution.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for .lnk file creations or modifications. Extract the 'TargetFilename' and 'ObjectName' (for the LNK file). Analyze the contents/properties of newly created/modified LNK files for unusual 'IconEnvironmentDataBlock' or 'Target Path' values (e.g., containing URLs, suspicious commands, encoded data). Use entropy analysis on suspicious LNK content if possible, though LNK structures are specific. Focus on string matching for known bad patterns or suspicious file paths/URLs."
          },
          "Outbound network connections initiated by potentially malicious LNK execution, especially to untrusted external domains or IPs from unexpected processes (e.g., Explorer.exe accessing external resources).": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for outbound connections originating from processes commonly associated with LNK execution (e.g., explorer.exe, cmd.exe if called by LNK). Correlate network events with Windows Event ID 4688 Process Creation logs to identify the parent process. Filter connections based on destination (external IPs/domains, especially untrusted). Use correlation analysis to link suspicious network activity back to LNK file access events (e.g., Windows Event ID 4663)."
          },
          "Download of executable or script files from remote URLs found in the icon location or target path of suspicious LNK files.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests to URLs identified in the 'IconEnvironmentDataBlock' or 'Target Path' of suspicious LNK files (flagged via content analysis). Filter for downloads of common executable/script file types (.exe, .dll, .ps1, .bat, .vbs). Correlate these download events (Zeek logs) with process creation events (Windows Event ID 4688) showing downloader tools or execution of the downloaded file. Use correlation analysis to link network download activity back to LNK file access."
          },
          "Execution of scripting or proxy binaries with suspicious command line arguments originating from LNK file execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for execution of scripting engines (cmd.exe, powershell.exe, wscript.exe, cscript.exe) or proxy binaries (rundll32.exe, mshta.exe) with complex, obfuscated, or external-referencing command lines. Correlate these process executions with recent LNK file access/creation events (Windows Event ID 4663) that have suspicious 'Target Path' values. Use pattern matching or regular expressions to identify suspicious command line arguments. Analyze frequency and distribution of such executions across endpoints using descriptive statistics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]