
[
  {
    "Is the adversary exfiltrating data using scheduled transfers? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1029 - Scheduled Transfer": {
          "Scheduled outbound network connections to IP addresses or domains known to be malicious C2 servers or data collection points.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify regularly scheduled outbound connections using time series analysis on Zeek conn.log data. Correlate the destination IPs of these connections, and the domains resolved in corresponding Zeek dns.log entries, against a high-confidence cyber threat intelligence feed of known malicious infrastructure (updated daily). Alert on any regularly scheduled connection to a destination matching the feed."
          },
          "Creation of scheduled tasks containing suspicious commands or scripts known to be used for data staging and exfiltration.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs for task creation/modification (4698, 4702). Scan the task's command-line arguments or script content for patterns associated with exfiltration. Look for keywords like `curl`, `wget`, `bitsadmin`, `powershell -enc`, invocations of archiving tools (`tar`, `zip`, `7z`) targeting sensitive directories, or execution of known data transfer scripts. Correlate with process creation (Event ID 4688) for `schtasks.exe` or `at.exe` containing these suspicious command-line patterns."
          },
          "Recurring, fixed-interval network connections from internal hosts to external destinations, particularly during non-business hours or with unusual payload characteristics.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for periodicity in connections between source/destination pairs. Use time series analysis (e.g., autocorrelation or Fourier transforms) to detect regularly timed connections with low jitter. Calculate the entropy of inter-arrival times for connection logs; consistently low entropy indicates regularity. Prioritize connections that are both periodic and occur outside of typical working hours or exhibit anomalous data transfer sizes (either very small heartbeats or large data chunks) inconsistent with legitimate traffic."
          },
          "Anomalously large data transfers occurring in a recurring time window, especially over protocols or ports not typically used for bulk transfer.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of data transfer volumes (orig_bytes, resp_bytes) per host and protocol using historical Zeek conn.log data. Monitor for transfers that are statistical outliers (e.g., > 3 standard deviations from the mean, or in the 99th percentile). Correlate these large transfers with their timing. Use correlation analysis to identify if outlier transfers for a given host consistently occur at the same time of day or day of the week. Investigate transfers over non-standard ports or encrypted channels (Zeek ssl.log) that match this recurring, high-volume pattern."
          },
          "An unknown or unsigned process performing data staging (e.g., accessing many files in sensitive directories) followed by a scheduled outbound network connection.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for newly executed or unsigned processes (Windows Event ID 4688). Correlate the process execution with a high volume of file access events (Windows Event ID 4663) in sensitive locations (e.g., user profiles, document stores). Use correlation analysis to link these file access 'bursts' with subsequent regularly scheduled outbound network connections (identified from Zeek conn.log analysis) initiated by the same process or a child process within a defined time window."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
