
[
  {
    "Is the adversary exfiltrating data using traffic duplication? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1020.001 - Traffic Duplication": {
          "Traffic duplication streams are directed to external IP addresses or domains known to be associated with malicious actors or command and control (C2) infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously analyze Zeek conn.log for all outbound connections. Cross-reference destination IP addresses against a high-confidence, frequently updated threat intelligence feed of known malicious C2 or data drop zone IPs. Separately, analyze Zeek dns.log for queries to known malicious domains, then inner join the resolved IPs with active outbound connections in conn.log. Alert on any matches, especially those associated with high-volume or long-duration connections."
          },
          "Execution of specific commands on network management hosts or use of traffic encapsulation protocols (e.g., GRE, ERSPAN) to send mirrored traffic to an unauthorized external destination.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "On Windows-based network management servers, monitor Process Creation events (Event ID 4688) for command lines containing keywords indicative of traffic duplication ('monitor session', 'port-mirroring', 'span', 'create-traffic-mirror'). Additionally, monitor Zeek conn.log for traffic using encapsulation protocols like GRE (IP protocol 47). Establish a baseline of legitimate encapsulated traffic and alert on flows from internal sources to external destinations that are not authorized network partners, especially if the volume is significant."
          },
          "Anomalous high-volume network traffic flows to new or unusual external destinations, originating from internal sources inconsistent with established baselines.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a multivariate baseline of normal outbound network traffic using Zeek conn.log, profiling source IP/subnet, destination IP, destination port, protocol, and data volume over time. Use time series analysis and descriptive statistics (mean, standard deviation, percentiles) to detect significant deviations. Specifically flag new 'heavy-hitter' connections to previously unseen external destinations or from internal segments that do not typically send large amounts of data externally. Use linear regression to identify unexpected trends in data volume to specific destinations."
          },
          "Network traffic streams exhibiting characteristics of disguised data, such as high entropy or protocol-behavior mismatches, especially in high-volume flows to external destinations.": {
            "Data": "Zeek conn.log; Zeek weird.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek weird.log for events indicating protocol anomalies ('data_before_established', 'inappropriate_FIN'). For high-volume outbound connections identified in Zeek conn.log, analyze associated application protocol logs (e.g., http.log). Calculate the entropy of payloads or URIs where possible; consistently high entropy in traffic that should be structured (like HTTP text) can indicate encrypted/compressed data. Use box-plots on entropy scores per destination port to identify outliers. Correlate these findings with connections on non-standard ports or to unusual destinations."
          },
          "Anomalous user activity on network infrastructure or cloud control planes, such as suspicious logins or configuration changes, that temporally correlates with the start of a suspected data exfiltration stream.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate security events on network management hosts (Windows Event IDs 4624/4625 for logins, 4688 for process creation) with network flow data (Zeek conn.log). Create a time-boxed correlation search that triggers when a suspicious login (e.g., from a rare IP, at an odd hour) or the execution of a configuration-related command is followed within a short window (e.g., 5-15 minutes) by the initiation of a high-volume, anomalous outbound traffic flow from the network segment managed by that host. Use correlation analysis to score the likelihood of a causal relationship between the management activity and the network flow."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
