[
  {
    "Has the adversary performed lateral movement using accessible cloud services? (TA0008 - Lateral-Movement)": {
      "Indicators": {
        "T1021.007 - Cloud Services": {
          "Anomalous login activity to cloud service consoles or CLIs from unexpected sources or with unusual frequency/timing.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log for connections to known cloud authentication endpoints (e.g., login.microsoftonline.com, accounts.google.com, etc.). Identify source IPs, user agents (potentially indicating CLI use), and connection timing. Use time series analysis to detect unusual spikes in connection frequency or connections outside typical business hours. Correlate with successful local logins (Windows Event ID 4624) on internal hosts."
          },
          "Use of application access tokens or cloud APIs from suspicious hosts or for unauthorized actions.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log for connections to known cloud API endpoints (e.g., graph.microsoft.com, compute.googleapis.com, etc.). Monitor for connection volume, source IPs, user agents, and requested URLs/paths. Apply correlation analysis to link API activity to suspicious internal hosts or user accounts identified through other alerts."
          },
          "Execution of cloud service CLIs or connections to cloud resource endpoints from unusual hosts or privileged accounts.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of cloud CLI tools (e.g., az.exe, gcloud.cmd, aws.exe). Analyze command line arguments for potentially unauthorized or unusual actions (e.g., accessing storage, managing VMs, listing users). Correlate execution events with Zeek conn.log/http.log for connections to cloud resource endpoints. Use frequency analysis and correlation to identify accounts or hosts running these commands/making connections unusually often or from unexpected sources/machines not typically used by that account."
          },
          "Correlation of cloud service access from an internal host with subsequent anomalous lateral movement activity originating from that same host.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify cloud service access sessions in Zeek conn.log/http.log (e.g., connections to cloud login/API endpoints) originating from internal hosts. Correlate these sessions in time (e.g., within a 15-minute window) with subsequent anomalous internal network connections (Zeek conn.log, Windows Event ID 5156) or process execution (Windows Event ID 4688) originating from the host that accessed the cloud service, especially connections to other internal hosts or execution of tools commonly used for lateral movement (e.g., psexec, rdp, wmic)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]