[
  {
    "Has the adversary exfiltrated sensitive data? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1020 - Automated Exfiltration": {
          "Unusual process activity involving bulk file access followed by outbound network connections to untrusted destinations.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663, Zeek conn.log, Zeek http.log, Zeek dns.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) or 4663 (file access) with subsequent outbound network connections observed in Zeek logs (conn.log, http.log, dns.log). Identify processes accessing a large number of sensitive files within a short time frame, particularly if originating from unusual directories or running under non-standard user accounts. Calculate entropy or frequency distribution of accessed file types and names. Analyze destinations of subsequent network connections; flag connections to destinations not on an approved list or those with low reputation scores. Use correlation analysis to link file access patterns with network traffic."
          },
          "Detection of abnormally large outbound data transfers via common exfiltration protocols or channels (e.g., HTTPS, DNS, FTP).": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek dns.log, Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, dns.log, and ftp.log for outbound connections with exceptionally large byte counts relative to normal traffic patterns. Establish baseline data transfer sizes per protocol and destination using descriptive statistics and IQR/box-plots. Flag connections exceeding statistically significant thresholds (e.g., 3 standard deviations above the mean or outside the 95th percentile) for further investigation. Analyze destinations and protocols used; investigate transfers to non-standard ports or suspicious domains."
          }
        }
      }
    }
  }
]