[
    {
        "information_requirement": "Is the adversary using defense evasion techniques like steganography?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1027.003",
                "name": "Steganography",
                "evidence": [
                    {
                        "description": "Presence of files on endpoints or servers whose hash matches known steganography tools or carrier files from documented threat campaigns.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously scan process creation events (Windows Event ID 4688) and network file transfers (Zeek files.log) to collect file hashes. Correlate these hashes against a cyber threat intelligence (CTI) feed of known steganography tools (e.g., Steghide, OpenStego, F5) and indicators of compromise (IOCs) from threat actor campaigns known to use steganography. Alert on any matches."
                    },
                    {
                        "description": "Execution of processes with command-line arguments characteristic of steganography tool usage, such as embedding or extracting data from media files.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process command-line arguments containing patterns associated with steganography tools. Look for keywords like 'embed', 'extract', '-ef', '-sf', '-p' (password), in conjunction with media file extensions (.png, .jpg, .wav, .bmp). Maintain and apply a list of regular expressions to match command-line structures of common steganography tools and alert on detections."
                    },
                    {
                        "description": "An unusual process chain where a scripting engine (e.g., PowerShell, Python) or other non-standard process reads a media file and subsequently initiates an outbound network connection.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688) to build parent-child process relationships. Flag suspicious chains where a non-standard process (e.g., powershell.exe, python.exe, wscript.exe) reads a media file and is the parent of a process that makes an outbound network connection. Use Zeek conn.log to confirm the network connection and correlate events based on host and a short time delta (e.g., within 5 minutes) between file access and network activity."
                    },
                    {
                        "description": "Identification of media files with statistical properties, such as unusually high entropy or an anomalous file size-to-content ratio, inconsistent with the expected file type.",
                        "data_sources": [
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For media files transferred over the network (identified and extracted via Zeek files.log), perform automated statistical analysis. Calculate the byte entropy of each file; steganographic content often increases entropy above the normal baseline for that file type. Build a regression model to predict file size based on image dimensions or audio length and flag significant outliers. Use Inter-Quartile Range (IQR) or Z-scores on entropy and size-ratio values to identify anomalous files for manual inspection."
                    },
                    {
                        "description": "Anomalous transfer of media files over the network that deviates from established baselines for a user or host, such as transfers to unusual destinations, at atypical times, or in uncommon volumes.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal media file transfer activity for users and hosts, considering destination countries/IPs, frequency, file types, and total data volume using historical Zeek conn.log and http.log data. Use time series analysis to detect unusual spikes in media file transfers. Correlate destination IPs with a list of rare or low-reputation domains. Flag users who suddenly begin sending large volumes of media files, especially outside of business hours or to new, unseen destinations."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
