```json
[
  {
    "Is the adversary attempting to evade defenses using obfuscation? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027 - Obfuscated Files or Information": {
          "Detection of files or network traffic matching signatures of known packers, crypters, or specific obfuscated malware families.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Integrate a process to analyze files transferred over the network (identified via Zeek file.log) or created on disk (identified via file paths in Windows Event ID 4688) with signature-based tools. Scan these files using Yara rules or antivirus signatures that specifically detect packing/encryption stubs (e.g., UPX, MPRESS, Themida) or byte sequences unique to known obfuscated malware families. Alert on any signature match."
          },
          "Use of specific command-line syntax patterns commonly associated with obfuscation, such as excessive escape characters, layered environment variable expansion, or PowerShell encoding flags.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 command lines for patterns indicative of obfuscation. Use regular expressions to match known obfuscation patterns, including: 1) PowerShell execution with '-EncodedCommand', '-e', '-ec', or '-enc' flags. 2) CMD.exe commands with excessive caret ('^') characters, for-loops for string building, or layered environment variable substitution (`%VAR:~start,len%`) to construct commands. Correlate detections of these patterns with other suspicious activity."
          },
          "Execution of known deobfuscation tools or scripts immediately following the creation, download, or modification of another file, forming a suspicious execution chain.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events matching known deobfuscation utilities (e.g., `certutil -decode`, `expand`, or PowerShell scripts invoking `[System.Convert]::FromBase64String`). Correlate these process executions with recent file transfers (from Zeek file.log) or file creation/modification events on the same host. Use time series analysis to flag sequences where a file lands and a deobfuscation process is executed on that file within a short time window (e.g., under 1 minute)."
          },
          "Anomalously high entropy detected in files, network payloads, or process command lines, suggesting encryption, compression, or packing where it is not expected.": {
            "Data": "Zeek file.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously calculate the Shannon entropy for: 1) Files transferred over the network (from Zeek file.log). 2) Process command lines (from Windows Event ID 4688). 3) Select network payloads (from Zeek conn.log). Establish baselines for normal entropy levels for different file types (e.g., scripts vs. executables vs. documents), common processes, and protocols. Use statistical methods like Z-score or the Inter-Quartile Range (IQR) to flag significant positive deviations from the baseline as potentially obfuscated. For example, a script file (.ps1, .vbs) with entropy approaching 8.0 is highly anomalous and warrants investigation."
          },
          "A mismatch between a file's extension or declared MIME type and its actual file type as identified by magic numbers, suggesting an attempt to masquerade a malicious payload.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "From Zeek file.log, correlate the MIME type identified by Zeek's file analysis with the filename extension from the network transfer metadata (e.g., HTTP URI). Alert on significant mismatches, especially when an executable or library MIME type (e.g., `application/x-dosexec`) is associated with a benign extension (e.g., `.jpg`, `.txt`, `.dat`). On endpoints, correlate process executions (Windows Event ID 4688) of files with benign-looking extensions and investigate their true file type to detect masquerading."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```