[
  {
    "Is the adversary using defense evasion techniques like steganography? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.003 - Steganography": {
          "Creation or modification of image/audio/video files containing unusual embedded data or patterns, potentially alongside suspicious process execution (e.g., PowerShell loading image data).": {
            "Data": "Windows Event ID 4688; Zeek fileinfo.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events involving scripting languages (e.g., PowerShell, Python) that interact with media file types (jpg, png, bmp, wav, mp3, mp4). Collect file hashes via Zeek fileinfo.log for recently modified/created media files on suspect systems. Analyze file entropy of suspect media files for anomalies using statistical methods. Investigate processes loading data directly from media files."
          },
          "Outbound network connections transmitting image/audio/video files with known steganography artifacts or unusual file sizes relative to their apparent content.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek fileinfo.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for outbound connections transferring media files (jpg, png, bmp, wav, mp3, mp4). Use Zeek fileinfo.log to capture file sizes and potentially hashes of transferred media. Analyze network traffic patterns for unusual transfers of large media files. Implement correlation analysis to link outbound media file transfers to suspicious internal host activity or known C2 IPs."
          },
          "Execution of processes known to be used for steganography or processes that read/write specific byte patterns within media files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify process names or command line arguments that match known steganography tools or libraries. Look for processes that read large amounts of data from media files and processes executing with command lines that suggest data manipulation involving media files using descriptive statistics on process activity."
          },
          "Network traffic metadata associated with the transfer of media files that deviates statistically from normal file transfers in terms of timing, size, or frequency.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for all file transfers, specifically filtering for media file types (jpg, png, bmp, wav, mp3, mp4). Use descriptive statistics and percentile analysis to baseline normal media file transfer sizes, durations, and frequencies for user/system groups. Flag transfers that fall outside established norms using IQR. Use time series analysis on media file transfer events to identify sudden spikes or changes in patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]