[
  {
    "Has the adversary moved laterally within the network using Remote Desktop Protocol? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.001 - Remote Desktop Protocol": {
          "Successful RDP logins to systems users would not normally access.": {
            "Data": "Windows Event ID 4624; Zeek rdp.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and Zeek rdp.log on critical/sensitive systems for RDP login events. Establish a baseline of normal RDP access patterns per user and system using historical data. Identify logins deviating significantly from the baseline using correlation analysis (user vs. system accessed) or descriptive statistics on historical login activity."
          },
          "RDP logins from a single source system/user to multiple distinct destination systems within a short period.": {
            "Data": "Windows Event ID 4624; Zeek rdp.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 and Zeek rdp.log for successful RDP connections. Group connections by source user and source host within a defined time window (e.g., 30 minutes). Identify instances where a single user/host initiates RDP sessions to a high number of distinct destination hosts within this window using count analysis. Flag connections exceeding a predefined threshold."
          },
          "RDP sessions initiated from unusual source IP addresses or geographical locations for the destination system.": {
            "Data": "Zeek rdp.log; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek rdp.log and Windows Event ID 4624 for successful RDP logins. Extract source IP addresses from logs and, if possible, geolocate them. Compare source IPs and/or geographic locations against a baseline of known or typical RDP sources for specific destination systems or subnets. Flag connections from sources with low frequency of occurrence or high deviation from the established baseline using frequency analysis or percentile calculations."
          },
          "Suspicious process execution or network connections occurring immediately after an RDP session starts on the destination system.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful RDP login events (Windows Event ID 4624) with subsequent process creation (Windows Event ID 4688) and network connection events (Windows Event ID 5156, Zeek conn.log) on the destination host within a short time window (e.g., 5 minutes). Filter for creation of suspicious processes (e.g., hacking tools, uncommon utilities) or network connections to external/malicious destinations originating from the RDP session logon time. Analyze command lines (4688) and connection details (5156, conn.log) for anomalous patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]