[
  {
    "Is the adversary using defense evasion techniques via dynamic API resolution? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.007 - Dynamic API Resolution": {
          "Execution of a suspicious process (e.g., unsigned, unusual location, odd command line) followed by attempts to access sensitive files or establish unusual external network connections.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify all process creations (Windows Event ID 4688). Analyze process name, path, parent process, and command line for anomalies (e.g., processes running from temp directories, unusual parents, obfuscated command lines). Correlate suspicious process creations with subsequent sensitive file access attempts (Windows Event ID 4663 - requires object access auditing) or external network connections (Zeek conn.log). Use statistical analysis on process metadata or network connection patterns to identify outliers."
          },
          "Execution of a process with characteristics indicative of malware (e.g., unsigned, unusual location) initiating unusual child processes or threads, potentially indicative of code injection or execution of dynamically resolved code.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688). Analyze parent-child process relationships to identify unusual or unexpected process spawning (e.g., office applications launching command shells, browsers launching executables from temp paths). Focus on processes launching system binaries or scripting engines from suspicious parent processes. Use correlation analysis to link suspicious parent process characteristics with child process activity."
          }
        }
      }
    }
  }
]