```json
[
  {
    "Is the adversary moving laterally within the network using DCOM? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.003 - Distributed Component Object Model": {
          "DCOM/RPC network traffic (port 135) originating from an internal host previously flagged for suspicious activity or associated with a known compromised account.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a dynamic watchlist of internal IP addresses and user accounts associated with prior security alerts or confirmed compromises. Inner join Zeek conn.log data for TCP port 135 with this watchlist on the source IP. Correlate successful remote authentications (Windows Event ID 4624, Logon Type 3) with the watchlist on the user account. Investigate any DCOM activity originating from these flagged entities as high-priority lateral movement attempts."
          },
          "Anomalous parent-child process relationships where a common DCOM-enabled application (e.g., mmc.exe, excel.exe) spawns a command shell or scripting engine (cmd.exe, powershell.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688). Create a detection rule to alert when a parent process of 'mmc.exe', 'excel.exe', 'winword.exe', or other Office applications spawns a child process of 'cmd.exe', 'powershell.exe', 'wscript.exe', or 'cscript.exe'. Use frequency analysis to baseline normal parent-child relationships and identify rare occurrences, especially on servers or systems where this pattern is highly unusual for the associated user."
          },
          "Execution of any process by a DCOM server process (dllhost.exe) where the child process is not part of a predefined application allowlist, indicating potential abuse of a custom or unexpected DCOM object.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) where the parent process is 'dllhost.exe' and the executing user is not SYSTEM. Establish a baseline or allowlist of legitimate child processes for 'dllhost.exe' in your environment. Use descriptive statistics on the child process names to identify low-frequency, anomalous executions. Investigate any executions that deviate from the established baseline, such as the launch of scripting interpreters or reconnaissance tools."
          },
          "Significant deviation from baseline DCOM/RPC network traffic patterns between internal hosts, such as new connections between workstations, connections to an unusually high number of hosts from a single source, or traffic spikes.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal DCOM/RPC traffic (TCP port 135) between internal host pairs using historical Zeek conn.log data. Model the network as a graph where hosts are nodes and DCOM connections are edges. Use time series analysis to detect volume spikes. Monitor for the creation of new, rare edges (i.e., DCOM connections between hosts that do not normally communicate). Use statistical measures (e.g., z-score, Inter-Quartile Range) to detect hosts with an anomalously high out-degree (connecting to many other hosts) or in-degree (being connected to by many other hosts) over a short time frame. A sudden change in these metrics may indicate a lateral movement spray."
          },
          "A sequence of activities involving a remote network logon followed by the creation of a scheduled task on the target host, originating from a source IP that recently initiated DCOM traffic.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4698; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlated detection rule that triggers on a sequence of events within a short time window (e.g., 5 minutes): 1. DCOM/RPC traffic is observed in Zeek conn.log from a source IP to a target IP. 2. A successful network logon (Windows Event ID 4624, Logon Type 3) occurs on the target host from the source IP. 3. A scheduled task is created on the target host (Windows Event ID 4698). This sequence is highly indicative of DCOM being used to stage a subsequent persistence or execution mechanism."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```