[
  {
    "Is the adversary moving laterally through cloud virtual machines via direct connections? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.008 - Direct Cloud VM Connections": {
          "Unusual interactive login sessions observed on cloud VMs, potentially using local accounts or exhibiting atypical logon types for that host.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 4648",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624, 4625, and 4648 on cloud VMs, specifically filtering for interactive logon types (e.g., Type 2, Type 10). Identify successful interactive logons using local accounts or service accounts that are not typically used for standard remote administration. Analyze logon times using descriptive statistics to flag sessions occurring outside standard working hours for administrators of that VM."
          },
          "Execution of suspicious commands or processes on cloud VMs immediately following an observed unusual interactive logon event.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on cloud VMs. Collect command line details for all process creations. Correlate process creation events with preceding unusual interactive logon events (identified via Event ID 4624, filtered as in Evidence 1's action) occurring on the same VM within a short time window. Flag process creations associated with known malicious tools or unusual system/reconnaissance commands. Use frequency analysis on command arguments to identify rare executions."
          },
          "Failed or successful login attempts to cloud VMs via unexpected accounts or exhibiting deviations from baseline login frequency or time patterns.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 and 4625 on cloud VMs. Analyze login events by user account, source IP (if available/relevant for cloud methods), and time of day. Establish baseline login frequency and time distribution for each account/VM using descriptive statistics (mean, median, standard deviation). Flag logins that significantly deviate from the established baseline or involve accounts not typically used for interactive access. Calculate login success/failure ratios per source IP/account using descriptive statistics to detect brute-force or credential stuffing attempts."
          },
          "Outbound network connections from cloud VMs exhibiting unusual destination patterns, data volume spikes, or known malicious indicators, following a direct interactive logon.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log; Windows Event ID 5156",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate outbound network connection events (Zeek conn.log, Windows Event ID 5156) and DNS queries (Zeek dns.log), and HTTP requests (Zeek http.log) originating from a cloud VM with recent successful interactive logon events (Windows Event ID 4624) on that VM. Identify connections to external IPs/domains, particularly those not on a list of known good destinations. Analyze connection volumes (bytes/connections per unit time) using time series analysis to detect unusual spikes or changes after a login. Cross-reference destination IPs/domains with threat intelligence feeds. Use frequency analysis or entropy measures on destination IPs/domains to identify rare or suspicious communication patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]