[
  {
    "Has the adversary exfiltrated sensitive data? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1020 - Automated Exfiltration": {
          "Unusual process activity involving bulk file access followed by outbound network connections to untrusted destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) or 4663 (file access) with subsequent outbound network connections observed in Zeek logs (conn.log, http.log, dns.log). Identify processes accessing a large number of sensitive files within a short time frame, particularly if originating from unusual directories or running under non-standard user accounts. Calculate entropy or frequency distribution of accessed file types and names. Analyze destinations of subsequent network connections; flag connections to destinations not on an approved list or those with low reputation scores. Use correlation analysis to link file access patterns with network traffic."
          },
          "Detection of abnormally large outbound data transfers via common exfiltration protocols or channels (e.g., HTTPS, DNS, FTP).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, dns.log, and ftp.log for outbound connections with exceptionally large byte counts relative to normal traffic patterns. Establish baseline data transfer sizes per protocol and destination using descriptive statistics and IQR/box-plots. Flag connections exceeding statistically significant thresholds (e.g., 3 standard deviations above the mean or outside the 95th percentile) for further investigation. Analyze destinations and protocols used; investigate transfers to non-standard ports or suspicious domains."
          },
          "Processes known to not typically handle user files or large data performing bulk file read operations on sensitive file types.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 to identify new or unusual process executions. Correlate with Windows Event ID 4663 to detect these processes performing read operations on sensitive file types (e.g., documents, databases) in bulk. Establish a baseline of normal file access patterns per process/user using descriptive statistics and identify outliers by count of files accessed or total data read within a time window (e.g., using IQR analysis to find values outside the 1.5*IQR range from Q1/Q3)."
          },
          "Synchronized bursts of file activity on multiple endpoints followed by aggregated outbound network traffic to a single destination.": {
            "Data": "Windows Event ID 4663; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 across multiple endpoints for concurrent or rapidly sequenced file read events, especially targeting similar file types or locations. Correlate the timing and volume of these file events with spikes in aggregated outbound network traffic (Zeek conn.log, http.log, summing bytes transferred) to a single destination IP/domain. Use time series analysis or correlation analysis to identify statistically significant temporal relationships and volume correlations between distributed file access events and centralized outbound network bursts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]