[
  {
    "Is the adversary using HTML Smuggling to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027.006 - HTML Smuggling": {
          "Presence of specific JavaScript strings ('Blob', 'msSaveOrOpenBlob', 'download') within HTML documents observed in network traffic or on endpoints.": {
            "Data": "Zeek http.log; Zeek file_info.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and Zeek file_info.log for HTML documents. Scan extracted HTML content for specific strings like 'Blob', 'msSaveOrOpenBlob', 'download' using regular expressions or string matching. Calculate the frequency of these strings per source/destination and identify statistically rare occurrences or bursts (time series analysis)."
          },
          "Execution of suspicious files dropped on the endpoint after being downloaded via a web browser.": {
            "Data": "Windows Event ID 4688; Zeek file_info.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Correlate process creations with files recently downloaded via web browsers (identified through Zeek file_info.log or browser download history). Use lineage/correlation analysis to trace the execution of suspicious files originating from web downloads. Identify unusual execution paths or parameters using frequency analysis."
          },
          "Presence of unusually large or numerous Data URLs within HTML documents observed in network traffic.": {
            "Data": "Zeek http.log; Zeek file_info.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for HTTP responses with content type 'text/html' or 'application/javascript'. Extract response bodies and scan for Data URLs (patterns like 'data:<mime_type>;base64,...'). Calculate the length/size of detected Data URL payloads. Flag HTML documents containing Data URLs exceeding a certain size threshold or an unusual number of Data URLs compared to baseline (e.g., using descriptive statistics or percentile analysis on Data URL lengths and counts per document)."
          },
          "Process creation originating from files in unusual user-writable locations (e.g., AppData, Temp folders) immediately following a web download.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek file_info.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) on endpoints with recent web download events identified in Zeek http.log/file_info.log for the same user/host. Filter 4688 events where the 'New Process Name' executable path is located in user-writable directories often used for temporary files or application data (e.g., 'C:\\Users\\*\\AppData\\Local\\Temp\\', 'C:\\Users\\*\\Downloads\\'). Identify process creations in these locations occurring shortly after a web download (e.g., within 60 seconds). Use frequency analysis on parent process names and command line arguments to identify anomalies compared to legitimate software installation/execution patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]