[
  {
    "Is the adversary moving laterally through the network using remote services? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021 - Remote Services": {
          "Successful remote logins (RDP, SSH, VNC, etc.) to systems or by user accounts that are outside their normal access patterns.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and 4625 for remote logins (Logon Type 10). Identify source and destination hosts and user accounts. Establish baseline access patterns for users and hosts using descriptive statistics and correlation analysis (e.g., identifying common user-host pairs, typical login times). Flag logins that significantly deviate from these baselines (e.g., user logging into a server they've never accessed, multiple failed logins followed by success from an unusual source)."
          },
          "Network traffic patterns indicative of remote service usage (RDP, SSH, VNC) between systems that are not part of standard administration workflows, or use of specific ports/protocols associated with suspicious activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections on common remote service ports (e.g., 3389/RDP, 22/SSH, 5900/VNC). Identify connections between systems that lack administrative justification. Analyze the frequency and duration of these connections between non-standard pairs. Use correlation analysis to link these connections to other suspicious activities or times, or to identify bursts of lateral connections."
          },
          "Suspicious sequence of actions or rapid access to multiple systems following a successful remote login by a valid account.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for sequences starting with a successful remote login (Windows Event ID 4624, Logon Type 10). Correlate these login events with subsequent process creation events (Windows Event ID 4688) or network connections (Zeek conn.log) within a short time window from the same source/user/destination host. Analyze command lines (4688) or connection destinations (Zeek) for known lateral movement tools or rapid connections to multiple internal hosts. Use time series analysis to identify bursts of activity originating from the remotely accessed host immediately after login."
          },
          "Network connections using less common remote access protocols (e.g., WinRM, ARD control) or typical remote protocols on non-standard ports between internal hosts.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections using WinRM (TCP 5985; 5986), ARD Control (TCP 3283), or connections on common remote service ports (RDP 3389; SSH 22; VNC 5900-590X) that use a destination port other than the standard default. Flag connections occurring between internal hosts that are not part of defined administrative relationships or on ports other than the defaults. Use frequency analysis to identify rare source/destination port combinations for remote services."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]