[
  {
    "Is the adversary moving laterally through the network using Windows admin shares? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1021.002 - SMB-Windows Admin Shares": {
          "Successful remote logins or session creations on endpoints or servers via SMB, especially using administrator accounts.": {
            "Data": "Windows Event ID 4624; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (Logon Type 3 for network logon) and Zeek smb.log for successful remote network logins via SMB. Correlate these events with source and destination hosts and user accounts. Analyze login frequency and timing for administrator or privileged accounts using time series analysis to identify patterns outside of normal administrative activity. Flag logins from rare source IPs or hosts within the network."
          },
          "File creation, modification, or execution events on administrative shares (C$, ADMIN$) originating from remote SMB sessions.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4688; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5140 for access to administrative shares (C$, ADMIN$). Correlate share access events with file creation/modification/execution events (Windows Event ID 4688, Zeek smb.log file activity events) originating from the same remote SMB session. Use correlation analysis to link remote SMB sessions to subsequent suspicious activity on the target machine. Identify rare file names, suspicious file types, or execution commands seen originating from administrative share access using frequency analysis and baselining."
          },
          "Execution of network utility commands (e.g., net use, dir) via command line or script, followed by SMB activity targeting administrative shares.": {
            "Data": "Windows Event ID 4688; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events containing command-line arguments indicative of remote share interaction (e.g., `net use \\\\*`, `dir \\\\*\\*`, `copy \\\\*\\*`, `xcopy \\\\*`). Correlate these process events with outbound SMB connections (Zeek smb.log) originating from the same host to administrative shares (e.g., \\\\host\\C$, \\\\host\\ADMIN$). Analyze the frequency of such command usage per user or host within a specific time window and flag deviations from established baselines using frequency analysis."
          },
          "Remote code execution attempts or successful execution of binaries originating from files transferred over SMB to administrative shares.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5140; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 5140 (Share Access) and Zeek smb.log (SMB file write/read events) showing file transfers to administrative shares (C$, ADMIN$) with subsequent process creation events (Windows Event ID 4688) on the target host. Specifically, look for processes where the created process's command line or file path corresponds to a file recently written to an administrative share via a remote session. Use correlation analysis to identify direct links between remote file transfer via SMB admin share and local execution. Use descriptive statistics on file sizes or types for transfers to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]