
[
  {
    "Is the adversary evading defenses by encrypting or encoding files? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1027.013 - Encrypted-Encoded File": {
          "Detection of files matching known malicious hashes that are commonly delivered in an encrypted or encoded form, or files identified as known malicious Self-Extracting Archive (SFX) packers.": {
            "Data": "Zeek files.log; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for files transferred over the network and calculate their MD5/SHA256 hashes. For files created/modified on endpoints (Windows Event ID 4663, or inferred from process execution via Windows Event ID 4688), attempt to retrieve file hashes. Compare these hashes against a continuously updated threat intelligence feed of known malicious file hashes specifically associated with encrypted/encoded malware or known malicious SFX packer tools. Alert on any matches and initiate incident response."
          },
          "Execution of commands or scripts employing common utilities and functions for decoding/deobfuscating files or data streams, such as certutil, PowerShell Base64 functions, or specific SFX archive execution patterns.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs for command-line arguments. Identify usage of common decoding utilities (e.g., `certutil -decode`, `certutil -encode -f <input> <output>`, `bitsadmin /transfer`), PowerShell commands involving `[System.Convert]::FromBase64String`, `[Text.Encoding]::UTF8.GetString([System.Convert]::FromBase64String(…))`, or `Invoke-Expression` (IEX) with potentially obfuscated input. Detect execution of self-extracting archives (SFX, often .exe) especially from untrusted directories (e.g., Downloads, Temp) or with unusual command-line switches. Maintain a library of regex patterns for these tool usages. Use correlation analysis to link these executions with preceding file downloads (Zeek files.log) or file writes (Windows Event ID 4663)."
          },
          "Observation of files with characteristics indicative of obfuscation, such as multiple file extensions (e.g., '.docx.exe', '.pdf.js') or text-based files with manipulated Byte Order Marks (BOMs) to conceal malicious script content.": {
            "Data": "Windows Event ID 4663; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (File Create/Modify) and Zeek files.log (File Transfers) for filenames exhibiting multiple extensions where the final extension suggests executable or scriptable content hidden behind a benign one (e.g., `invoice.pdf.exe`, `document.txt.vbs`). For text-based files (e.g., .txt, .ps1, .js, .hta), inspect for unusual BOM sequences (e.g., UTF-7 BOM `+ADs-` which can be abused) or content that appears to be script code despite an innocuous initial extension. Use regular expressions to identify suspicious filename patterns. Perform frequency analysis on the occurrence of such patterns across the environment."
          },
          "Creation or transfer of files exhibiting unusually high entropy for their apparent file type, or files identified as password-protected archives, particularly when appearing in atypical user directories, temporary folders, or arriving via suspicious network channels.": {
            "Data": "Windows Event ID 4663; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (file creation/modification) and Zeek files.log (file transfers). For newly observed files, especially archives (.zip, .rar, .7z, .sfx), office documents, or executables, calculate their Shannon entropy. Compare entropy values against established baselines for benign files of the same type and size range. Flag files with significantly high entropy (e.g., Shannon entropy > 7.0 for non-natively compressed types or unexpectedly high for typically compressible types). Correlate high entropy with file location (e.g., `%TEMP%`, user download folders), file source (external download from untrusted site), or if analysis indicates they are password-protected archives. Use descriptive statistics (mean, standard deviation of entropy per file type) and inter-quartile range (IQR) to identify significant outliers."
          },
          "Anomalously large or frequent encoded strings (e.g., Base64, hexadecimal) detected in process command lines, script content, or network communications (e.g., HTTP bodies, DNS queries) that deviate from established baselines for typical process or protocol behavior.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 command lines, script content (if captured in logs or from file monitoring), Zeek http.log (POST request bodies, URLs, custom headers), and Zeek dns.log (TXT records, unusually long subdomains) for the presence and length of encoded string patterns (e.g., using regular expressions for Base64 `(?:[A-Za-z0-9+/]{4})*(?:[A-Za-z0-9+/]{2}==|[A-Za-z0-9+/]{3}=)?` or hex patterns). Establish baselines for encoded string length and frequency per specific process or network protocol. Use statistical methods like percentile analysis (e.g., flag strings longer than the 99th percentile for a given context) or time series analysis to detect sudden increases in encoded data volume. Investigate deviations as potential obfuscated payloads or commands."
          },
          "A sequence of events where a process accesses or creates a high-entropy or encoded file, followed by the same or a child process executing the decoded content, creating new executable files, or initiating suspicious network or system interactions.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Implement sequence analysis: Monitor for a process (identified by Windows Event ID 4688) accessing a high-entropy file (identified via Windows Event ID 4663 and entropy analysis) or executing a known decoding command. Track this process and its children. Within a short time window (e.g., 1-5 minutes), look for subsequent activities such as: 1. Creation of new files with executable permissions. 2. Execution of newly created files. 3. Outbound network connections to unusual IP addresses, ports, or exhibiting C2-like beaconing (Zeek conn.log). 4. Execution of commands indicative of lateral movement or privilege escalation. Use correlation analysis based on Process ID, Parent Process ID, and timestamps to link these chained events."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
