[
  {
    "Is the adversary using binary padding to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1027.001 - Binary Padding": {
          "Execution of files from unusual or temporary directories that may be padded executables.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Analyze \"New Process Name\" and \"Current Directory\" fields. Identify and calculate the frequency distribution of executables run from unusual or temporary directories (e.g., AppData, Temp). Investigate low-frequency occurrences or outliers using descriptive statistics (e.g., counts, percentiles)."
          },
          "Suspicious network connections initiated by processes created from unusual or temporary directories.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) with Zeek conn.log. Filter Zeek connections based on source IP/hostname, destination IP/port/domain, and timestamp, linking them to process creation events originating from unusual directories. Identify connections to suspicious destinations (e.g., non-RFC1918 IPs, known malicious infrastructure). Use correlation analysis and frequency analysis to link execution context to anomalous network traffic."
          },
          "Execution of system discovery commands or scripting interpreters with suspicious arguments by processes originating from temporary or user-writable directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Filter events for processes created with 'Current Directory' or 'New Process Name' pointing to temporary or user-writable locations. Analyze the 'Command Line' field using keyword matching for common discovery commands (e.g., `whoami`, `ipconfig`, `systeminfo`, `net group`, `net user`, `tasklist`) or scripting interpreters (`powershell.exe`, `cmd.exe`, `cscript.exe`, `wscript.exe`) with unusual, obfuscated, or encoded arguments. Use frequency analysis of command execution from these directories to identify rare occurrences or outliers."
          },
          "Network connections to multiple internal hosts or external C2 infrastructure initiated by processes originating from temporary or user-writable directories.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log with Windows Event ID 4688. Identify processes (from 4688) originating from temporary or user-writable directories. For these processes, filter Zeek conn.log entries based on source IP and process start time. Use descriptive statistics (count of unique internal destination IPs connected to within a time window) to identify processes potentially attempting lateral movement. Compare external destination IPs/domains against threat intelligence feeds or known C2 infrastructure. Use frequency analysis or time series analysis to identify anomalous connection patterns (e.g., bursts of connections, persistent connections) from these processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]