[
  {
    "Is the adversary maintaining persistence using RC scripts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.004 - RC Scripts": {
          "Windows process execution events indicating modification of remote files in paths consistent with RC scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes (e.g., 'notepad.exe', 'cmd.exe', 'powershell.exe') writing to paths that map to known RC script locations (e.g., '/etc/' equivalents via mounted network shares or remote access tools) on potentially accessed remote systems. Filter by user context and file operation arguments. Use frequency analysis to identify rare target paths or programs used for modification."
          },
          "Windows process creation events where the parent process or command line suggests execution triggered by a remote startup script.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes spawned during system startup with unusual parent processes (not typical Windows services) or command lines containing paths or commands consistent with those potentially written into RC scripts on remote systems and triggered via remote execution. Use correlation analysis to link suspicious processes to remote startup events."
          },
          "Network traffic (Zeek conn.log) originating from Windows hosts targeting common ports used for remote access (like SSH/SCP) to Unix-like systems, potentially related to file modification attempts in RC script locations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections from Windows hosts to ports 22 (SSH/SCP) or other file transfer/remote management ports targeting known Unix/Linux systems. Look for data transfer volumes or connection patterns indicative of file uploads/modifications. Correlate these network events with potential Windows Event ID 4688 on the source Windows host showing execution of remote file interaction tools (`scp`, `sftp`, `winscp`, etc.). Use correlation analysis to link specific process executions with network connections."
          },
          "Network traffic (Zeek conn.log) originating from Unix-like systems exhibiting unusual outbound connections to Windows hosts, potentially acting as C2 channels initiated by a persistent mechanism like an RC script.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections originating from known Unix/Linux/ESXi systems to internal or external Windows hosts (especially non-standard server/endpoint ports or protocols). Use frequency analysis and time series analysis to identify rare, persistent, or unusual connections patterns from these Unix systems. Compare destination IPs/domains against threat intelligence feeds. Flag connections from Unix systems to Windows systems that deviate significantly from baseline behavior using outlier detection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary elevating privileges using RC scripts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1037.004 - RC Scripts": {
          "Windows process creation events showing unexpected processes running with SYSTEM or Administrator privileges initiated during system startup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes with 'New Process Privileges' indicating SYSTEM or Administrator context that are launched during system startup. Identify outliers based on process name, command line, and typical startup behavior using descriptive statistics."
          },
          "Attempts via Windows processes to modify files related to ESXi persistence mechanisms.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process execution attempting to interact with files or services on known ESXi hosts, specifically targeting paths like '/etc/rc.local.d/local.sh' using remote file access commands or tools. Filter by source user and process. Use frequency analysis to identify rare user accounts or processes attempting these actions."
          },
          "Windows process execution events (Windows Event ID 4688) involving remote execution tools targeting Unix-like systems with privileged credentials, potentially used to modify RC scripts or execute commands with elevated rights.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments of remote execution tools (`psexec`, `powershell.exe` with `-remoting`, SSH clients, etc.) indicating target systems that are Unix-like and/or include command arguments related to file modification in `/etc/` directories or executing commands with `sudo`/`root` context. Use correlation analysis to link these attempts with successful/failed authentication events on the target systems (if available)."
          },
          "Unusual network connection patterns (Zeek conn.log) involving data transfer from a Windows host or other internal sources to a Unix-like system on ports or with characteristics suggesting the upload of a payload that could be executed by a privileged process.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections from Windows hosts or unexpected internal sources to Unix-like systems on ports often used for file transfer or remote execution related services (e.g., SSH/SCP, WinRM if applicable in a hybrid env, uncommon ports for custom transfer tools). Use time series analysis and frequency analysis to detect sudden spikes in data transfer volume or unusual connection patterns to these systems. Calculate statistics on bytes transferred per session or host pair; flag outliers using descriptive statistics as potential payload transfers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]