[
  {
    "Is the adversary attempting to evade detection by modifying process trees? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1036.009 - Break Process Trees": {
          "Process creation events where the parent process ID is PID 1 for a process that is not a standard service or system process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs. Filter for events where 'ParentProcessId' is '1'. Identify the 'NewProcessName' and 'CommandLine' for these events. Compare against a baseline of expected processes legitimately parented by PID 1. Flag unexpected processes for investigation using descriptive statistics of parent processes over time to identify outliers."
          },
          "Process creation events where the parent process ID is zero or does not correspond to a currently running process.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs, recording 'ProcessId' and 'ParentProcessId'. Collect Windows Event ID 4689 logs (Process Termination), recording 'ProcessId'. Correlate termination events with process creation events to identify active processes whose reported parent process (from 4688) has terminated (identified in 4689). Alternatively, filter 4688 logs for 'ParentProcessId' values that are zero or do not exist in the set of currently active ProcessIds. Use correlation analysis to link process creation and termination events and identify potential orphaned processes."
          },
          "A process terminates unusually quickly after creating a child process, especially if the child process is suspicious.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) and 4689 (Process Termination) logs. Correlate 4688 events by 'ProcessId' (the child) and 'ParentProcessId' (the parent) with 4689 events by 'ProcessId' (the parent). Calculate the time difference between the 4688 event (child creation) and the subsequent 4689 event (parent termination) for the 'ParentProcessId'. Flag cases where this time difference is below a threshold (e.g., < 5 seconds), using statistical analysis of typical parent-child lifespan distributions to set the threshold."
          },
          "Network connections originating from a process with an anomalous parent, especially to suspicious or external destinations.": {
            "Data": "Windows Event ID 5156; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 5156 (Windows Filtering Platform Connection) and Zeek conn.log. Correlate 5156 events using 'ProcessId' and 'Application' fields with Windows Event ID 4688 events using 'ProcessId' to identify the parent process ('ParentProcessId') and command line ('CommandLine') of the connecting process. Identify connections originating from processes with anomalous parent IDs (PID 1, zero, or potentially short-lived parents identified via 4689 correlation). Analyze destination IPs/ports from 5156 and Zeek conn.log for these connections against threat intelligence feeds or unusual patterns using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]