
[
  {
    "Is the adversary attempting to evade defenses by masquerading account names? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.010 - Masquerade Account Name": {
          "Creation of a local or domain account with a username known to be used by specific threat actors, malware families, or penetration testing tools.": {
            "Data": "Windows Event ID 4720",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 (A user account was created) on domain controllers and other critical servers/endpoints. Compare the 'New Account Name' field against a curated and regularly updated list of account names known to be associated with specific threat actors or common pentesting tools (e.g., 'hacker', 'test', 'sysadmin', default tool accounts). Alert on any exact matches and investigate the source of creation."
          },
          "Creation of new accounts with names that match common patterns for legitimate service or administrative accounts, created outside of standard IT procedures.": {
            "Data": "Windows Event ID 4720",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 on domain controllers. Apply regular expressions to the 'New Account Name' field to detect common administrative and service account naming conventions (e.g., '^(svc|sql|backup|adm|sys|net|hlp|help|dsk|desk).+', '.*admin(istrator)?$', '.*backup$'). Correlate creation events with change management records; investigate any matches created outside of scheduled or approved IT operations."
          },
          "Creation of an account with a name that uses homoglyphs or mixed character sets to visually impersonate a legitimate account name.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4781",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 (Account Created) and 4781 (Account Renamed). For each new or renamed account name, analyze the username for characters outside the standard ASCII range or for a mix of character sets (e.g., Latin and Cyrillic). Normalize the new name and compare it against a list of existing high-value accounts (e.g., domain admins) using a homoglyph mapping library. Flag any high-similarity matches that use non-standard characters for review."
          },
          "Creation or renaming of an account with a name that is algorithmically similar (typosquatting) to an existing high-privilege or sensitive account.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4781",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 and 4781. Extract all new and renamed account names. Compare these names against a baseline list of all existing accounts, particularly those in privileged groups. Use string similarity algorithms (e.g., Levenshtein distance, Jaro-Winkler) to calculate a similarity score for each new name against the privileged list. Use descriptive statistics (mean, median, IQR) on the similarity scores to flag any new names that are outliers (e.g., score > 0.85) for investigation."
          },
          "Anomalous activity originating from a recently created or renamed account, especially if the account name is flagged as potentially masqueraded.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4781; Windows Event ID 4624; Windows Event ID 4732; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate account creation/rename events (4720, 4781) with subsequent activity from that account. Prioritize alerts for new accounts that immediately perform sensitive actions, such as: a successful interactive or remote login (4624), being added to a privileged group (4732), or initiating unusual network connections (Zeek conn.log). Use time series analysis to detect unusual bursts of login or network activity from accounts created within the last 7 days. This creates a behavior profile for new accounts to spot deviations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
