[
  {
    "Has the adversary collected data from network shared drives? (TA0009 - Collection)": {
      "Indicators": {
        "T1039 - Data from Network Shared Drive": {
          "Unusual volume or type of file access/copying activity originating from specific hosts/users towards network shares.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4663; Zeek smb.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5140 (share access), 4663 (file access), and Zeek smb.log for network share access. Analyze file access volumes and types by user, source host, and share. Identify deviations from baseline activity using statistical methods (e.g., calculating the standard deviation or using percentile analysis on bytes transferred or file count) to detect unusual spikes in data collection from shares. Flag access to predefined sensitive file extensions or file paths/names containing sensitive keywords."
          },
          "Execution of commands or scripts (e.g., PowerShell, cmd) interacting with network shared drives in a suspicious manner.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (process creation) and Windows Event ID 4104 (PowerShell logging). Search for command-line arguments that indicate interaction with network shares (e.g., 'copy \\\\share\\path', 'xcopy \\\\share\\path', PowerShell cmdlets like Get-ChildItem or Copy-Item targeting \\\\share\\path'). Use correlation analysis to link suspicious command execution with file access events (Event 4663, Zeek smb.log) or network traffic detected in Zeek logs."
          },
          "Accessing highly sensitive or unusual file types from network shares, especially from systems not typically needing access, or accessing large numbers of files rapidly.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4663; Zeek smb.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5140, 4663, and Zeek smb.log. Identify access to predefined sensitive file extensions (e.g., .docx, .xlsx, .csv, .sql, .key, .cer) or file paths/names containing sensitive keywords. Analyze access patterns by user, source host, destination share, and file type. Use descriptive statistics (e.g., count unique file extensions accessed per user/host) or time series analysis (e.g., identify rapid bursts of access to different files) to detect unusual activity or access from hosts/users that don't normally interact with specific shares or file types."
          },
          "Execution of PowerShell or WMI commands/scripts specifically targeting network shares for data collection, or network connections indicative of remote tools accessing shares.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104; Zeek conn.log; Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and 4104 for PowerShell or command execution with parameters indicating network share access (e.g., `-Command *\\\\share\\path*`, `Get-ChildItem \\\\share\\path`, `Invoke-Command -ComputerName *\\\\share\\path*`). Monitor Zeek conn.log for connections to known remote access tool ports or unusual connections concurrent with internal network share activity. Monitor Zeek dce_rpc.log for WMI activity targeting remote shares. Correlate script/command execution with file access logs (Event 4663, Zeek smb.log) or network traffic (Zeek conn.log) to confirm data collection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]