```json
[
  {
    "Is the adversary attempting to evade detection by modifying process trees? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.009 - Break Process Trees": {
          "Execution of processes with file hashes or names known to be associated with tools that implement process tree breaking techniques.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation events (Windows Event ID 4688). Compare the 'ProcessName' and calculated file hash of the 'NewProcessName' against a threat intelligence feed or an internal, curated list of known malicious tools that are specifically designed to break process trees (e.g., certain Cobalt Strike components, custom loaders). Alert on any confirmed matches."
          },
          "Execution of a legitimate system utility (e.g., rundll32.exe, PowerShell) with command-line parameters or process characteristics matching known patterns for launching orphaned or hollowed processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688). Scan command lines for patterns associated with process tree breaking, such as `rundll32.exe` calling a DLL without an export function, or PowerShell scripts utilizing specific API calls or techniques to start a new process and detach it. Maintain and apply a list of regular expressions for known malicious `rundll32.exe`, `regsvr32.exe`, or PowerShell invocation patterns used to break process trees. Correlate these patterns with the subsequent creation of suspicious child processes."
          },
          "A process is created with a non-existent, terminated, or an unexpected system process (e.g., svchost.exe, lsass.exe) as its parent, indicating orphaning or reparenting.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) and 4689 (Process Termination). For each 4688 event, validate the `ParentProcessId`. Use correlation analysis to flag processes where the parent PID does not exist in the host's active process table or has a termination event (4689) logged before the child process was created. Additionally, create baselines of normal parent-child relationships. Use descriptive statistics and frequency analysis to flag processes spawned by parents that do not typically create children (e.g., `lsass.exe`, `smss.exe`) or processes reparented to system-level processes in an unusual context."
          },
          "A parent process terminates immediately after creating a child process, indicating a 'fork and run' evasion pattern to break the process chain.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and correlate Windows Event ID 4688 (Process Creation) and 4689 (Process Termination) logs. For each child process creation (4688), find the corresponding termination event (4689) for its parent process. Calculate the time difference between the child's creation time and its parent's termination time. Use statistical methods like Inter-Quartile Range (IQR) or percentile analysis on this time delta across the environment to identify and alert on parent processes that terminate anomalously quickly (e.g., < 1-5 seconds) after spawning a child, especially if the child process is unsigned or runs from an unusual location."
          },
          "A process with an anomalous ancestry (e.g., orphaned, reparented, or from a short-lived parent) initiates outbound network connections or performs other suspicious follow-on activities.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 4689; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes with anomalous ancestry using previously described methods (non-existent parent, quick-terminating parent). Correlate the Process ID of these anomalous processes with network connection events from Windows Event ID 5156 (WFP Connection) or Zeek conn.log (by correlating host IP and time). Analyze the destination IPs/ports of these connections. Use linear regression or correlation analysis to determine if the appearance of anomalously-parented processes is correlated with increases in suspicious network traffic. Prioritize alerts for anomalous processes that connect to external IPs, non-standard ports, or IPs found on threat intelligence feeds."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```