```json
[
  {
    "Is the adversary attempting to evade defenses by renaming legitimate utilities? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.003 - Rename Legitimate Utilities": {
          "Execution of a process where the filename on disk is different from a known legitimate utility name, but its file hash matches the hash of that legitimate utility.": {
            "Data": "Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a curated list of legitimate system utility filenames and their corresponding file hashes (e.g., powershell.exe, cmd.exe, certutil.exe, rundll32.exe). Monitor process creation events (Sysmon Event ID 1) that include file hashes. Join process creation events with the curated list on the file hash. Alert on any instance where the process's file hash matches a legitimate utility's hash, but the process's filename does not match the expected filename for that hash. This directly identifies a renamed utility via a high-fidelity selector."
          },
          "Execution of a process where the filename on disk mismatches the 'OriginalFilename' or 'InternalName' fields within the binary's PE header.": {
            "Data": "Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Sysmon Event ID 1) and enrich them with PE header information, specifically the 'OriginalFilename' field. Create a rule to flag any process execution where the process's filename (e.g., 'update.exe') does not match the embedded 'OriginalFilename' (e.g., 'psexec.exe'). Prioritize alerts for mismatches involving commonly abused system utilities. Use correlation analysis to group mismatches by host or user to identify broader campaigns."
          },
          "Execution of a process with an unexpected or generic name that uses command-line arguments highly characteristic of a specific legitimate utility.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of command-line argument patterns distinctive to commonly abused legitimate utilities (e.g., 'certutil -urlcache -split -f', 'rundll32.exe javascript:', 'powershell -enc'). Monitor process creation events (Windows Event ID 4688 or Sysmon Event ID 1) for these argument patterns. Alert when such a pattern is observed but the process name is not the expected utility associated with it (e.g., 'svchost.exe -enc ...'). Use frequency analysis to establish a baseline of normal process names for specific command lines and detect rare or anomalous process names as outliers."
          },
          "A legitimate system utility name is used for a file created in a non-standard file path (e.g., a user's temporary directory), which is then subsequently executed.": {
            "Data": "Windows Event ID 11 (Sysmon); Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define standard, legitimate paths for critical system utilities (e.g., 'C:\\Windows\\System32'). Monitor file creation events (Sysmon Event ID 11) for executables with names matching these utilities but being created in non-standard directories (e.g., 'C:\\Users\\*', 'C:\\Temp\\', 'C:\\ProgramData\\', 'C:\\Windows\\Tasks\\'). Correlate these file creation events with subsequent process creation events (Sysmon Event ID 1) from the same path within a short time window (e.g., 5 minutes). Use descriptive statistics to track the frequency of utility execution from various paths and flag executions from statistically rare or unauthorized locations."
          },
          "A process identified as a renamed utility (via hash or PE metadata) initiates suspicious child processes or makes outbound network connections.": {
            "Data": "Windows Event ID 1 (Sysmon); Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify a process as a renamed utility using hash or PE metadata matching as a primary indicator. Trace its subsequent behavior by monitoring its child processes (Sysmon Event ID 1, linked by ParentProcessGUID) and network connections (Sysmon Event ID 3, or by correlating the process ID with Zeek conn.log data). Create a high-severity alert if the renamed utility spawns suspicious child processes (e.g., cmd.exe, powershell.exe) or initiates network connections to external IPs or internal hosts on administrative ports (e.g., RDP, WinRM, SMB). This sequence of 'rename -> execute -> connect/spawn' provides a strong behavioral narrative of malicious intent."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```