[
  {
    "Is the adversary using boot or logon initialization scripts for persistence? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037 - Boot or Logon Initialization Scripts": {
          "Unusual access to or modification of boot or logon script files by non-standard users or accounts outside of normal IT operations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 and 4656 for access or modification events on known boot/logon script file paths (e.g., C:\\Windows\\System32\\GroupPolicy\\User\\Scripts\\Logon\\*, C:\\Windows\\System32\\GroupPolicy\\Machine\\Scripts\\Startup\\*, user Startup folders). Baseline normal access patterns by user/account and time. Identify deviations using descriptive statistics and flag access from unusual accounts or during off-hours."
          },
          "Detection of unusual or malicious processes being launched by boot or logon scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) where the parent process is associated with script execution (e.g., powershell.exe, cmd.exe, wscript.exe, cscript.exe executing a script file). Correlate child process creation events with a list of known legitimate processes launched by scripts. Flag creation of unknown or suspicious processes (e.g., by name, path, or command line arguments) launched by scripts."
          },
          "Creation of new script files in common boot or logon initialization paths by unexpected accounts or outside of typical change windows.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation operations (e.g., by filtering for specific write access masks if detailed SACL logging is enabled) in standard boot/logon script directories (e.g., Startup folders, Group Policy script paths). Correlate the event with the user account (SubjectUserName) and process (ProcessName) performing the action. Flag creations by non-standard administrative accounts or processes not associated with software deployment or system configuration. Use time series analysis of script creation events to detect activity outside of established change management windows."
          },
          "Boot or logon initialization scripts initiating outbound network connections to unusual, high entropy, or known malicious destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 to identify processes launched by boot/logon scripts by correlating ParentProcessName or ParentProcessID with known script hosts. Correlate these processes with network connection events (Windows Event ID 5156 or Zeek conn.log) initiated by them. Investigate connections to external IP addresses. Apply correlation analysis by joining observed destination IPs with threat intelligence feeds. Calculate entropy of destination ports or IPs for traffic originating from script-launched processes; low entropy over time might indicate beaconing to a C2, while unusually high entropy might suggest scanning or other broad activities."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using boot or logon initialization scripts for privilege escalation? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1037 - Boot or Logon Initialization Scripts": {
          "Boot or logon scripts executing with higher privileges than expected for the associated user or system.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Windows Event ID 4624 (Logon) and 4688 (Process Creation) in conjunction. Identify processes launched by logon scripts. Determine the privilege level (integrity level, token elevation type) of the script execution process and its child processes using information from these events. Flag instances where scripts or child processes are running with unexpectedly high integrity levels (e.g., System, High) for a standard user login script."
          },
          "Unauthorized or unexpected changes to boot or logon scripts configured to run with administrative privileges.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 and 4656 for modifications specifically on boot/logon script paths that are typically executed with administrative privileges (e.g., machine startup scripts, scripts referenced by HKLM Run keys). Baseline accessors and modification times. Use statistical analysis (e.g., frequency analysis, deviation from baseline) to identify modification attempts by unauthorized accounts or during suspicious timeframes."
          },
          "Modification of registry keys or file system scripts associated with system-level boot/logon processes by unauthorized users or atypical processes.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to registry keys controlling system-wide boot/logon script execution (e.g., HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run, RunOnce, HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit). Monitor Windows Event ID 4663 for modifications to system startup script files (e.g., in Group Policy Machine Startup paths). Baseline typical modifying accounts (e.g., SYSTEM, specific admin groups) and processes (e.g., trusted installer, GPO update client). Flag modifications by unexpected users or processes using frequency analysis on account names and process names involved in modifications. Compare modification times against known maintenance schedules."
          },
          "Processes launched by high-privilege boot/logon scripts attempting to access sensitive system resources like LSASS or load unauthorized modules.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Using Windows Event ID 4688, identify processes launched by scripts known to run with high privileges (e.g., system startup scripts, scheduled tasks running as SYSTEM). Monitor these child processes for attempts to access critical system processes like LSASS (filter Windows Event ID 4656 for ObjectName containing 'lsass.exe' and relevant AccessMasks like PROCESS_VM_READ or PROCESS_ALL_ACCESS initiated by these child processes). Analyze command lines of these child processes (from Event ID 4688) for indicators of loading modules (e.g., rundll32 calls to suspicious DLLs, PowerShell commands loading modules) or execution of privilege escalation utilities. Establish a baseline of normal child process behavior for high-privilege scripts and use descriptive statistics (e.g., frequency of certain child processes, common command line patterns) to detect anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]