[
  {
    "Is the adversary using defense evasion techniques, such as invalid code signatures? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.001 - Invalid Code Signature": {
          "Presence of executable files or scripts with invalid digital signatures.": {
            "Data": "Windows Event ID 8002; Windows Event ID 8003; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 8002 (CodeIntegrity: An unsigned/bad-signed file has been loaded) and 8003 (CodeIntegrity: Code integrity determined that a process..) or similar events indicating signature validation failures. Collect Event ID 4688 (Process Creation) logs and identify executable paths. Correlate execution events with signature validation logs. Identify executables/scripts with invalid signatures by filtering for validation failures."
          },
          "Detection of software with certificate metadata or characteristics that are unusual or deviate from expected norms (e.g., self-signed certificates, expired certificates on new software, certificates from unexpected issuers).": {
            "Data": "Windows Event ID 8002; Windows Event ID 8003; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract certificate details (issuer, expiration, subject, self-signed status) from Windows Event Logs associated with code integrity checks (Event ID 8002, 8003) or process execution (Event ID 4688, if signature info is logged and includes it). Use descriptive statistics and frequency analysis on certificate issuers and properties observed across the environment. Flag certificates that are outliers (e.g., rare issuers, expired dates on recently introduced software) for investigation."
          },
          "Attempted execution of a file whose computed hash does not match the hash embedded in its (invalid) digital signature block.": {
            "Data": "Windows Event ID 4688; Windows Event ID 8002; Windows Event ID 8003",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation, extracting the file path and computing its hash (e.g., SHA256). Correlate these execution events with Windows Event IDs 8002/8003 showing signature validation failures for the same file path. For flagged files, attempt to parse the digital signature block (if present) and extract the hash claimed by the signature. Compare the computed hash with the actual file's hash; flag files where the hashes mismatch and validation failed. Use correlation analysis between execution events and validation failures."
          },
          "Identification of executable files with invalid signatures originating from untrusted network sources (e.g., suspicious IPs, unapproved domains).": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 8002; Windows Event ID 8003; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 8002/8003 for signature validation failures and Event ID 4688 for process creation paths. Correlate execution events of files with invalid signatures with Zeek logs (http.log for downloads, conn.log for connections) around the time the file was introduced. Identify the source IP or domain the file originated from. Cross-reference source IPs/domains against threat intelligence feeds and internal reputation lists. Flag files with invalid signatures originating from suspicious network sources using correlation analysis between network events and host execution/validation events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]