[
  {
    "Is the adversary maintaining persistence via network logon scripts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.003 - Network Logon Script": {
          "Modification of network logon script files by unusual accounts or at unusual times.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for write/modify events on network logon script paths. Identify events initiated by service accounts or user accounts not part of the standard IT/Admin group. Analyze timestamp data for deviations from normal administration schedules using time series analysis or descriptive statistics on modification times."
          },
          "Execution of network logon scripts initiating abnormal processes or network connections upon user logon.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes spawned directly by logon scripts (e.g., logon.bat, logon.vbs, logon.ps1). Correlate with Zeek conn.log for outbound connections from these processes to unusual or external destinations. Use correlation analysis between process creation events and network connections."
          }
        }
      }
    }
  },
  {
    "Is the adversary using network logon scripts for privilege escalation? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1037.003 - Network Logon Script": {
          "Network logon scripts executing processes with elevated privileges (e.g., SYSTEM, Administrator) beyond the standard user context.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes spawned by logon scripts. Examine the SubjectUserSid and NewProcessId fields. Identify instances where a script executed under a user context spawns a process running with SYSTEM or Administrator privileges, which is highly unusual."
          },
          "Execution of network logon scripts triggering suspicious network connections or host activity not typical for legitimate logon scripts.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments of processes spawned by logon scripts, looking for suspicious patterns (e.g., encoded commands, remote file downloads, direct interaction with security tools). Monitor Zeek conn.log for C2-like traffic patterns (e.g., beacons, large uploads/downloads) originating from processes tied to logon script execution using statistical methods like frequency analysis or entropy on connection timing/size."
          }
        }
      }
    }
  }
]