[
  {
    "Is the adversary attempting to evade defenses by masquerading file types? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1036.008 - Masquerade File Type": {
          "Identification of files where the file extension does not match the actual file signature (magic bytes) or detected type.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for files transferred over network protocols where the file's reported MIME type does not align with the file's extension. Analyze Windows Event ID 4688 logs for process creation where the command line argument includes a file path with a benign extension but the process is a common interpreter or loader. Use correlation analysis between filename extension and detected file type/execution behavior to identify mismatches."
          },
          "Detection of potentially executable files (based on signature or content analysis) being transferred or executed with non-executable extensions (.jpg, .txt, .gif, etc.).": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inspect Zeek file.log for files identified as executable (by MIME type or content heuristics) that are named with non-executable extensions (.jpg, .txt, .gif, etc.) during file transfers. Monitor Windows Event ID 4688 logs for attempts to execute files with such non-executable extensions via unusual parent processes or command line parameters. Calculate frequency distributions of file extensions being executed by common system binaries to identify statistical anomalies."
          },
          "Execution of a file with a benign extension (e.g., .jpg, .txt) followed by suspicious process creation or network activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events where the Parent Process Name is a common interpreter or loader (like cmd.exe, powershell.exe, wscript.exe) executing a file with a benign extension (.jpg, .txt, .gif, .pdf, etc.) with subsequent process creation (4688) or network connections (5156, Zeek conn.log) originating from the child process. Flag instances where the child process or network connection is anomalous based on known good behavior or matches threat intelligence feeds. Use correlation analysis to link the execution event to the follow-on activity within a short time window."
          },
          "Creation or modification of files with benign extensions in suspicious directories or by unusual processes.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (Handle Requested) and 4663 (Attempted Access - Write) for file write/creation events targeting sensitive directories (e.g., Startup folders, system directories) or user profile directories where such file types are unusual, particularly if the file has a benign extension (.jpg, .txt, etc.) and the creating process is suspicious. Correlate with Windows Event ID 4688 if the newly written file is subsequently executed. Use frequency analysis to identify processes rarely seen writing to these locations or the frequency of benign-looking files appearing in these locations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]