[
  {
    "Is the adversary attempting to discover system owner or user information? (TA0007 - Discovery)": {
      "Indicators": {
        "T1033 - System Owner-User Discovery": {
          "Execution of discovery commands/utilities (`whoami`, `who`, `w`, `dscl`, environment variable access) on endpoints or servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command-line arguments containing known discovery utilities such as 'whoami', 'who', 'w', 'dscl', or environment variable access like '%USERNAME%' or '$USER'. Analyze the frequency and context of these command executions. Use descriptive statistics to identify users or processes exhibiting anomalous usage patterns of these commands."
          },
          "Suspicious network traffic patterns or host logs indicating attempted user discovery via network protocols or APIs.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to or from network devices on administrative ports or services potentially used for remote command execution or API interaction associated with user discovery. Look for unusual connection volumes or source/destination pairs. Analyze Windows Event ID 4688 on hosts for process creation events related to remote management tools or API client execution targeting remote systems for user discovery."
          },
          "Use of WMI or PowerShell commands/scripts to query user account information, logged-on users, or session details locally or remotely.": {
            "Data": "Windows Event ID 4688; Windows PowerShell Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `powershell.exe` or `wmic.exe` with command-line arguments like `Get-WmiObject Win32_UserAccount`, `Get-LoggedOnUser`, `query user`, `wmic useraccount get name`. Analyze PowerShell Script Block Logs (Event ID 4104) for cmdlets like `Get-LocalUser`, `Get-ADUser`, `Get-CimInstance Win32_LoggedOnUser`, or WMI queries for user data. Correlate execution with unusual parent processes or subsequent suspicious activity. Use frequency analysis to baseline legitimate administrative script usage and detect anomalies."
          },
          "Anomalous enumeration of domain user accounts or group memberships (e.g., via `net.exe` commands or LDAP queries) from non-administrative systems or by unusual processes.": {
            "Data": "Windows Event ID 4688; Windows Security Event ID 4769; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of `net.exe` (e.g., `net user /domain`, `net group \"Domain Admins\" /domain`) or PowerShell (`Get-ADUser`, `Get-ADGroupMember`) querying domain information, especially from non-admin workstations. Analyze Zeek conn.log for unusual LDAP query patterns (e.g., large number of queries, specific filter abuse) to Domain Controllers from unexpected sources. Examine Windows Security Event ID 4769 on Domain Controllers for high volumes of Kerberos TGS requests that might indicate user enumeration attempts (e.g., many requests for common service principal names from a single client). Use descriptive statistics to baseline normal LDAP/Kerberos activity from legitimate systems and identify outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]