[
  {
    "Is the adversary maintaining persistence using login/logout hooks? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.002 - Login Hook": {
          "Unauthorized modification of system login/startup scripts or configuration files (analogous to login hooks).": {
            "Data": "Windows Event ID 4657, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4657 (Registry Value Set) and 4663 (File Access) for modifications to known autostart locations (e.g., Run/RunOnce registry keys, Startup folder paths, Group Policy script directories). Identify modifications performed by user accounts outside standard administrative groups. Calculate the frequency of modifications per user account and location, flagging outliers using percentile analysis."
          },
          "Execution of unusual or unauthorized scripts/executables initiated at user logon or system startup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Filter for processes spawned from common logon/startup parent processes (e.g., explorer.exe, services.exe) or within a short time window after system boot. Analyze process command lines for uncommon executables or script interpreter usage. Use entropy measures on command line arguments or file names to identify potentially obfuscated payloads."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary elevated privileges using login/logout hooks? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1037.002 - Login Hook": {
          "Scripts or executables launched via logon/startup mechanisms are running with unexpected elevated privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) for processes originating from logon/startup. Examine the TokenElevationType field (if auditing is configured) to determine the privilege level. Identify unexpected instances where processes launched at logon/startup run with Full or Limited elevated privileges by non-system accounts and correlate with process name and command line."
          },
          "Modifications to system autostart locations performed by low-privilege or non-standard accounts attempting to setup privileged execution.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event IDs 4657 and 4663 targeting autostart locations. Identify events where the SubjectUserName is a standard user or an unusual account. Correlate these modification events with subsequent privileged process creation events (from Action for Privilege Escalation) to establish a potential privilege escalation chain. Calculate correlation metrics between modification events by specific users and subsequent privileged executions."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]