
[
  {
    "Is the adversary attempting to discover system owner or user information? (TA0007 - Discovery)": {
      "Indicators": {
        "T1033 - System Owner-User Discovery": {
          "Execution of processes or scripts whose hash matches known malicious implants or discovery tools that perform system owner/user identification.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "From Windows Event ID 4688 (Process Creation) logs, extract process image file hashes (e.g., SHA256). Correlate these hashes against a continuously updated threat intelligence feed of known malicious file hashes specifically associated with tools or malware that perform T1033 System Owner/User Discovery. Alert on any exact matches and initiate incident response procedures."
          },
          "Execution of common built-in commands (e.g., `whoami`, `quser`, `query user`, `logonsessions`, `qwinsta`, `klist sessions`, `id`, `w`, `who`, `users`, `last`, `finger`) or specific WMI/PowerShell queries/cmdlets (e.g., `Get-WmiObject Win32_UserAccount`, `Get-LoggedOnUser`, `Get-LocalUser`, `Get-CimInstance Win32_LoggedOnUser`) used for system owner/user discovery.": {
            "Data": "Windows Event ID 4688; Windows PowerShell Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command-line execution of known discovery utilities (e.g., `whoami.exe`, `query.exe user`, `qwinsta.exe`, `klist.exe sessions`) and their specific parameters. Analyze Windows PowerShell Event ID 4104 (Script Block Logging) for execution of PowerShell cmdlets (e.g., `Get-LocalUser`, `Get-ADUser`, `Get-CimInstance Win32_LoggedOnUser`, `whoami /all`) or WMI queries (e.g., `SELECT * FROM Win32_UserAccount`) related to user discovery. Flag executions by non-standard users, from unusual parent processes (e.g., Office applications, web browsers), or as part of a suspicious sequence of commands. Use frequency analysis (e.g., commands per user/host per hour) to identify commands rarely used in the environment or by specific users/hosts, establishing baselines and alerting on deviations using percentile thresholds."
          },
          "Anomalous frequency, timing, or combination of system owner/user discovery command executions, particularly when correlated with other suspicious activities like network scanning or credential access attempts.": {
            "Data": "Windows Event ID 4688; Windows PowerShell Event ID 4104; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for the usage frequency and context (e.g., parent process, user account, source host) of discovery commands and PowerShell/WMI queries identified in Pattern detection. Use statistical methods (e.g., Inter-Quartile Range (IQR), Z-scores on command counts per hour/day per host/user) to detect significant deviations from normal activity. Correlate bursts of discovery activity (e.g., multiple distinct discovery commands like `whoami`, `query user`, `net user` executed by the same process or user within a short timeframe, such as 5 minutes) with prior or subsequent network connections to unusual internal or external destinations (Zeek conn.log), or other ATT&CK technique indicators (e.g., T1057 Process Discovery, T1003 OS Credential Dumping). Use time-series analysis to spot unusual spikes in overall discovery activity across the environment."
          },
          "Anomalous connection patterns to network device management interfaces (e.g., SSH, Telnet, HTTPS) from unexpected internal systems, followed by interactive sessions or data transfers suggestive of discovery command output (e.g., `show users`).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to network device management ports (e.g., TCP/22 for SSH, TCP/23 for Telnet, TCP/443 for HTTPS if identified as a management interface via service fingerprinting or known device IPs). Baseline normal administrative access patterns (legitimate source hosts/subnets, typical times of day, session durations, protocols). Flag connections originating from non-administrative workstations or servers, or occurring at atypical times. Analyze session characteristics using descriptive statistics: very short interactive sessions or small, repeated data transfers (e.g., <1KB packets at regular intervals) after connection establishment might indicate interactive command output like 'show users' or 'show ssh'. Use entropy measures on destination ports from a single source to detect scanning for management interfaces prior to connection. Correlate suspicious connections with known vulnerable device types if possible."
          },
          "Large-scale or unusual enumeration of domain user accounts or group memberships using LDAP queries or `net.exe` commands, originating from unexpected hosts/processes, or targeting an excessive number of objects.": {
            "Data": "Windows Event ID 4688; Windows Security Event ID 4662; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of `net.exe` commands (e.g., `net user /domain`, `net group \"Domain Admins\" /domain`) or PowerShell equivalents (`Get-ADUser -Filter *`, `Get-ADGroupMember -Identity \"Domain Admins\" -Recursive`) querying domain information, especially when executed from non-domain controllers or non-administrative workstations. Analyze Zeek conn.log for unusual LDAP query patterns (e.g., high volume of distinct queries, overly broad filters like `(objectClass=user)`, queries for all attributes `*`) to Domain Controllers (ports 389, 636) from unexpected client sources. On Domain Controllers, monitor Windows Security Event ID 4662 (An operation was performed on an object) for excessive LDAP read operations (ObjectType: user or group) by a single user or source IP. Use descriptive statistics and volume-based thresholds (e.g., X queries in Y minutes from a single source, or >Z objects queried by one account) to detect abnormal enumeration behavior. Utilize correlation analysis to link multiple enumeration methods from the same source within a defined time window."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
