[
  {
    "Is the adversary attempting to evade defenses by masquerading account names? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.010 - Masquerade Account Name": {
          "Creation or renaming of accounts with names similar to existing legitimate accounts.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4781",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 and 4781 on domain controllers and critical servers. Extract new/renamed account names. Compare newly created/renamed account names against a list of existing accounts and common legitimate service account names. Identify accounts with high Levenshtein distance or other similarity metrics to existing accounts or known malicious account names. Use frequency analysis to identify unusually frequent account creation events."
          },
          "Creation of new accounts with names resembling legitimate service accounts (e.g., backup, svc-*, sqlsvc) or generic administrative names (e.g., admin, helpdesk, root).": {
            "Data": "Windows Event ID 4720",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 on domain controllers and critical servers. Extract new account names. Apply regex or string matching against patterns for common service accounts (e.g., svc-*, backup*, *admin*, root, helpdesk). Investigate all matches, especially those created outside normal IT operations."
          },
          "Successful login attempts or network authentications using a newly created or recently renamed account with a potentially masqueraded name.": {
            "Data": "Windows Event ID 4624; Zeek kerberos.log; Zeek smb_mapping.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate newly created/renamed accounts (identified via Windows Event ID 4720/4781) with successful login events (Windows Event ID 4624 - logon type 2, 3, 10) or network authentication events (Zeek kerberos.log, smb_mapping.log) using that account name. Filter for logons/authentications occurring shortly after the account was created/renamed. Investigate the frequency and patterns of these logons, especially if they originate from unusual source systems or involve privileged access, potentially using time series analysis to detect spikes."
          },
          "Deletion of an existing account immediately followed by the creation of a new account with the exact same name.": {
            "Data": "Windows Event ID 4726; Windows Event ID 4720",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4726 (Account Deleted) and Windows Event ID 4720 (Account Created) on domain controllers or systems where accounts are managed. Correlate these events based on Account Name. Identify instances where an account deletion (4726) is followed within a very short time frame (e.g., 60 seconds) by the creation of an account (4720) with the identical name. Flag such delete-then-create sequences for investigation, as this can indicate an attempt to reset or clean an account before reuse."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]