```json
[
  {
    "Is the adversary maintaining persistence using startup items? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.005 - Startup Items": {
          "Execution of a process from a startup location with a file hash matching a known malicious indicator.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for all processes launched from known startup locations (e.g., Startup folders, Run keys). Calculate or retrieve the hash of each executable. Inner join the list of hashes with a threat intelligence feed of known malicious file hashes (updated daily). Alert on any matches."
          },
          "A process executing from a startup location with a command line, file name, or path that matches patterns associated with known persistence tools or malware.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines launched from startup locations. Use regular expressions to search for patterns used by known malware or tools to establish persistence (e.g., `reg.exe add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run`, specific encoded PowerShell commands, `schtasks.exe /create /sc onlogon`). Also, flag executions of legitimate system binaries (e.g., `svchost.exe`, `rundll32.exe`, `powershell.exe`) from atypical paths like user startup folders or temporary directories."
          },
          "Creation or modification of an executable or script in a common Windows startup location by an unusual process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines indicating file creation or modification (`copy`, `move`, `xcopy`, `powershell -Command New-Item`, `cmd /c echo >`) targeting known Windows startup locations (e.g., `C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup`, `C:\\Users\\<user>\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup`). Establish a baseline of normal processes that write to these locations (e.g., legitimate installers). Use correlation analysis to flag modifications made by non-standard processes like `word.exe` or `explorer.exe`."
          },
          "Execution of a process from a startup location with suspicious or anomalous file properties (e.g., unsigned, unusual metadata, low-entropy name or path).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes launched during system startup. For each executable, verify its digital signature status and signer information. Establish a baseline of typical startup processes. Flag processes that are unsigned, have invalid/revoked signatures, or possess unusual metadata (e.g., generic names like `update.exe`, no company info). Use entropy measures on file paths and names to identify randomized or obfuscated locations. Use descriptive statistics on the count of unsigned startup processes per host to find anomalous systems."
          },
          "A process launched from a startup location initiates suspicious outbound network connections shortly after system boot.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) occurring during a defined startup window (e.g., first 10 minutes after boot) with network connection logs (Zeek conn.log) originating from the same host within a short timeframe. Flag startup processes that connect to known malicious IPs/domains by joining with CTI feeds. Use time series analysis and frequency analysis to detect connections to rare or new external destinations not previously contacted by legitimate startup processes across the enterprise."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary achieved privilege escalation via startup items? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1037.005 - Startup Items": {
          "A file with a hash matching a known privilege escalation tool is executed from a startup location with elevated privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "During system startup, monitor all process executions (Windows Event ID 4688). Calculate the hash of any executable launched from a known startup location. Correlate the hash against a CTI database of known privilege escalation tool hashes (e.g., Juicy Potato, PrintSpoofer, etc.). Alert on any match, prioritizing those where the process is running with elevated privileges (High Integrity Level or as SYSTEM user)."
          },
          "A legitimate system binary is launched from a startup location with command-line arguments matching known patterns for DLL hijacking or other abuse for privilege escalation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for system binaries (e.g., `rundll32.exe`, `msiexec.exe`, `mmc.exe`) launched from startup locations. Use regular expressions to match command-line arguments against known patterns for loading malicious DLLs or abusing system features (e.g., `rundll32.exe \\\\.\\pipe\\..\\some.dll,EntryPoint`). Flag any such processes running with SYSTEM or high integrity level privileges, as this is a strong indicator of a privilege escalation attempt via startup item abuse."
          },
          "A process is launched with SYSTEM privileges from a startup location that is writeable by non-administrative users.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for processes executing as the SYSTEM user or with a high integrity level during the system startup window. For each, inspect the executable's full path. Flag any process where the path is within a user-writeable directory (e.g., `C:\\Users\\<User>\\`, `C:\\ProgramData\\`, `C:\\Windows\\Temp\\`). Maintain a list of legitimate system processes expected to run from such locations and alert on all deviations. This correlation of a high-privilege process with a low-privilege location is a key behavioral indicator of privilege escalation."
          },
          "A process launched from a startup location with high privileges performs suspicious follow-on actions indicative of solidifying access.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes launched during startup with high privileges (Event ID 4688). Use correlation analysis to track subsequent activities by that specific process (using its Process ID/GUID). Flag sequences where the startup process creates a new service (Event ID 4697), modifies sensitive registry keys to establish further persistence (Event ID 4657 on Run keys, service keys), or launches other suspicious child processes (Event ID 4688). Detecting this sequence of behaviors confirms the malicious intent of the startup item."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```