```json
[
  {
    "Is the adversary using defense evasion techniques, such as invalid code signatures? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.001 - Invalid Code Signature": {
          "Execution of files matching known malicious hashes or signed by certificates with known malicious thumbprints or serial numbers.": {
            "Data": "Windows Event ID 4688; Windows Event ID 8003",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Windows Event ID 4688) and code integrity events (Windows Event ID 8003). Extract file hashes and certificate thumbprints/serial numbers for all executed files. Inner join this data with a high-confidence blocklist of known malicious hashes and certificate identifiers from CTI feeds and internal incident response data. Generate a high-priority alert for any match."
          },
          "Execution of executable files or scripts that fail signature validation checks by the operating system, indicating a broken or untrusted signature.": {
            "Data": "Windows Event ID 8002; Windows Event ID 8003; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for Windows CodeIntegrity events indicating a signature validation failure (Event ID 8002: Unsigned/bad-signed file loaded; Event ID 8003: Process determined to be unsigned/invalid). Correlate these failure events by file path and process ID with corresponding process creation events (Event ID 4688). Flag all instances where a process executes despite a failed signature check for investigation, as this is a fundamental pattern of this technique."
          },
          "Execution of a file whose computed hash does not match the hash embedded within its own digital signature block, indicating direct file tampering.": {
            "Data": "Windows Event ID 4688; Windows Event ID 8003",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For processes flagged by code integrity events (Event ID 8003), or as part of a scheduled hunting query, programmatically parse the digital signature block of the executable file to extract the embedded hash value. Independently compute the hash (e.g., SHA256) of the file's binary content. Alert on any instance where the computed hash does not match the hash within the signature, as this is a strong pattern of tampering."
          },
          "Anomalous prevalence of files with specific certificate characteristics, such as being self-signed, having rare issuers, or unusual subject names, when compared to an established environmental baseline.": {
            "Data": "Windows Event ID 8003; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "From code integrity and process creation logs that include signature data (e.g., Event ID 8003), aggregate certificate metadata (Issuer, Subject, IsSelfSigned) across the entire environment over time to establish a baseline of common signers and certificate properties. Use descriptive statistics and frequency analysis (e.g., percentile rankings) to identify outliers. Flag files signed by rarely seen issuers, files with unusual subject naming conventions, or a sudden spike in self-signed executables being introduced and run. Use entropy measures on certificate issuer names to detect increased randomness or diversity."
          },
          "A file with an invalid signature is downloaded from an untrusted network source and subsequently executed on an endpoint.": {
            "Data": "Zeek http.log; Zeek files.log; Windows Event ID 8002; Windows Event ID 8003; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network data with host events. Identify file downloads via Zeek http.log or file transfers via Zeek files.log, noting the source IP/domain and the file's hash/name. Monitor endpoints for code integrity validation failures (Event ID 8002/8003) or process creation (Event ID 4688) involving the same file. Create a correlated alert when a file downloaded from a low-reputation source or any external source is executed and fails a signature validation check within a short time window. Use time series analysis to detect unusual spikes in invalid-signature executions following network download activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```