[
  {
    "Is the adversary maintaining persistence using startup items? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.005 - Startup Items": {
          "Execution of unsigned or unusual processes with elevated privileges during system startup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes started with high integrity levels (for potential execution via startup items). Filter for processes executed during system boot time. Compare observed processes against a whitelist of known legitimate startup processes. Flag unsigned executables or processes with low entropy names/paths for further investigation using descriptive statistics on file names/paths."
          },
          "Network connections initiated by processes running shortly after system startup from suspicious locations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) during startup with Zeek conn.log entries within a short time window of the process start. Identify network connections initiated by processes launched during boot. Use correlation analysis to link process execution with external connections and check against threat intelligence feeds or internal baselines for unusual destinations using frequency analysis of destinations per process."
          },
          "Creation or modification of unexpected executable files or scripts in common Windows startup locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines that indicate file creation, copying, or moving (`copy`, `move`, `xcopy`, `powershell -command New-Item`, `cmd /c echo >`) targeting known Windows startup locations (e.g., `C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup`, user Startup folders, relevant registry Run keys via reg.exe or PowerShell). Use frequency analysis or correlation with user activity to flag anomalous file modifications during startup time windows."
          },
          "Execution of processes with mismatching digital signatures or suspicious metadata properties from startup locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 from processes launched during system startup from known startup paths. Extract file metadata (digital signature status, signer, company name, product name, description). Flag processes that are unsigned, have invalid or revoked signatures, or possess unusual metadata (e.g., generic names, no company info) compared to a baseline or whitelist. Use statistical analysis (e.g., counts of unsigned processes per host during boot) to highlight anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary achieved privilege escalation via startup items? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1037.005 - Startup Items": {
          "Execution of newly created processes under the SYSTEM or root account during system boot.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for processes running with the SYSTEM user or high integrity level during system startup. Identify processes that are not part of the standard operating system boot sequence or installed applications. Use correlation analysis to link the launch of these processes with other system events preceding boot or identify processes with low frequency/high rarity across the environment during startup."
          },
          "Discovery of unexpected executable files or scripts located in system startup directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) on endpoints/servers and identify processes whose execution path originates from typical Windows startup item locations (e.g., Startup folders, Run keys). Use frequency analysis or clustering to find rare or anomalous process execution paths during system boot that are not part of the standard baseline."
          },
          "Processes launched from user-writeable startup locations executing with SYSTEM privileges during boot.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for processes executing with SYSTEM integrity level or user name during system boot. Correlate these processes with their full executable path. Flag processes originating from user-specific startup folders (e.g., `C:\\Users\\<User>\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup`) or other potentially user-writeable locations, as these should typically not execute with SYSTEM privileges. Use correlation analysis to link process path and user context at execution time."
          },
          "Execution of processes from startup locations that exhibit behavior typical of persistence or privilege escalation tools immediately after launch.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697; Windows Event ID 4657; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes launched during startup via Event ID 4688 originating from startup paths. Monitor subsequent events generated by these specific processes within a short time window after launch, including service creation (4697), sensitive registry modifications (4657 on Run keys, Service keys, etc.), or outbound network connections (Zeek conn.log) to suspicious destinations. Use correlation analysis to link the startup process execution with these post-launch activities indicative of persistence or privilege escalation tactics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]