```json
[
  {
    "Is the adversary attempting to evade defenses by masquerading as legitimate resources? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.005 - Match Legitimate Resource Name or Location": {
          "Execution of a file whose hash is known to be associated with malware but whose name matches a legitimate system file (e.g., svchost.exe, lsass.exe).": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For every process creation event (Sysmon Event ID 1, Windows Event ID 4688), extract the file hash of the executable. Inner join the observed hashes against a high-confidence, continuously updated threat intelligence feed of known malicious file hashes. Alert on any match, prioritizing those where the reported filename is a common system utility, indicating a masquerade attempt."
          },
          "Execution of a process with a name of a common system utility (e.g., svchost.exe, lsass.exe, conhost.exe) from an unauthorized or atypical file path.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline whitelist of legitimate file paths for critical system processes (e.g., svchost.exe in %SystemRoot%\\System32, lsass.exe in %SystemRoot%\\System32). Monitor process creation events (Sysmon Event ID 1, Windows Event ID 4688) and alert on any instance where these process names execute from a location not on the whitelist, such as user profiles (%APPDATA%), temporary directories (%TEMP%), or world-writable locations (C:\\ProgramData, C:\\Users\\Public)."
          },
          "An executable file with a legitimate name possessing PE metadata (e.g., OriginalFilename, InternalName, CompanyName) that is inconsistent with the expected values for that file.": {
            "Data": "Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On process creation (Sysmon Event ID 1), capture the PE metadata (OriginalFilename, InternalName, CompanyName, Description) for executables with names of common system utilities. Compare this metadata against a known-good baseline for these files. Flag discrepancies, such as a file named svchost.exe having a CompanyName other than 'Microsoft Corporation', a missing signature, or a suspicious OriginalFilename."
          },
          "A process with a legitimate name spawned by an anomalous parent process (e.g., svchost.exe spawned by winword.exe).": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Generate a baseline of normal parent-child process relationships for common system utilities. Monitor process creation events (Sysmon Event ID 1, Windows Event ID 4688) and identify instances where a process like svchost.exe, lsass.exe, or rundll32.exe is spawned by an unexpected parent, such as an Office application (winword.exe), a browser (chrome.exe), or a script interpreter (powershell.exe) in a user context. Use frequency analysis and correlation on parent-child pairs to identify rare and suspicious relationships."
          },
          "A process with a legitimate name executing with unusually complex or high-entropy command-line arguments, or making anomalous outbound network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon); Windows Event ID 3 (Sysmon); Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For processes with legitimate names, analyze command-line arguments (Sysmon Event ID 1) for indicators of suspicious activity. Calculate the entropy or length of command lines to find outliers; high entropy can suggest obfuscation. Correlate process execution with subsequent network connections (Sysmon Event ID 3, Zeek conn.log). Establish a baseline of normal network behavior (destinations, ports, data volume) for each legitimate process using descriptive statistics. Alert on significant deviations, such as svchost.exe connecting to a non-Microsoft IP address over a non-standard port or any legitimate process connecting to a destination flagged by threat intelligence."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```