```json
[
  {
    "Is the adversary maintaining persistence via network logon scripts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.003 - Network Logon Script": {
          "Logon script execution containing command-line arguments, filenames, or dropping files with hashes matching known malicious indicators.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan the command-line field (`NewProcessCommandLine`) in Windows Event ID 4688 for processes spawned by logon script interpreters (`cmd.exe`, `powershell.exe`, `cscript.exe`, `wscript.exe`). Match against a list of known malicious filenames, arguments, or C2 framework signatures. If endpoint tools provide file hashes for newly created files, correlate file creation events triggered by logon scripts with a threat intelligence feed of malicious file hashes."
          },
          "Execution of network logon scripts using common malicious patterns such as obfuscated commands, suspicious invocation flags, or living-off-the-land binaries for persistence.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the command-line field in Windows Event ID 4688 for processes launched by logon scripts. Use regular expression matching to detect common malicious patterns like PowerShell's `-enc`, `-e`, `IEX (Invoke-Expression)`, `DownloadString`, or VBScript obfuscation keywords (e.g., `Chr`, `Asc`). Flag scripts that invoke LOLBins (e.g., `certutil.exe`, `bitsadmin.exe`) to download or execute remote payloads. Use frequency analysis to identify rare and suspicious command-line patterns."
          },
          "Unauthorized modification or creation of network logon script files in sensitive locations (e.g., Netlogon share) by non-administrator accounts or at anomalous times.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor file system auditing on network logon script directories (e.g., C:\\Windows\\SYSVOL\\sysvol\\<domain>\\scripts). Alert on write or create events (Windows Event ID 4656, 4663) initiated by user accounts not belonging to authorized administrator groups. Establish a baseline of normal modification times and use time series analysis or descriptive statistics (e.g., IQR on timestamps) to detect modifications occurring outside of standard maintenance windows."
          },
          "A network logon script spawning processes that exhibit suspicious behavior, such as making external network connections, executing from temporary directories, or launching multiple unexpected child processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) originating from logon scripts with subsequent network activity (Zeek conn.log). Baseline normal script behavior. Flag scripts that initiate outbound connections to non-standard or external IP addresses, especially those with beaconing characteristics (identified via time series analysis of connection intervals). Alert on logon scripts launching executables from unusual paths like `%TEMP%`, `%APPDATA%`, or user download folders. Use correlation analysis to link the initial logon script execution to all downstream suspicious activities."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary using network logon scripts for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1037.003 - Network Logon Script": {
          "Logon script execution containing command-line arguments or invoking executables with filenames matching known local privilege escalation (LPE) exploits or tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of selectors for known LPE exploits (e.g., PrintNightmare DLL names, specific vulnerable driver names, named pipes used by exploits like Juicy Potato). Use regular expressions to search `NewProcessCommandLine` in Windows Event ID 4688 for processes spawned by logon scripts. Alert on any matches, as this indicates a direct attempt to exploit a known vulnerability for privilege escalation."
          },
          "A network logon script invoking system utilities (`net.exe`, `sc.exe`, `schtasks.exe`, `reg.exe`) with command-line structures explicitly intended for privilege escalation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command lines in Windows Event ID 4688 for processes spawned by logon scripts. Create high-fidelity alerts for specific command patterns associated with privilege escalation, such as `net localgroup Administrators [username] /add`, `sc create [service] binPath=... type= own start= auto`, or `schtasks /create ... /ru SYSTEM`. Use pattern matching to identify these specific sequences and arguments, which are strong indicators of malicious intent."
          },
          "Modification of a network logon script followed by that script's execution under a privileged account context (e.g., Domain Admin) upon their next logon, leading to unauthorized actions.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file modification events (Windows Event ID 4656, 4663) on network logon scripts with subsequent process execution events (Windows Event ID 4688) from that script. Specifically, look for a sequence where a script is modified by one user, and then on the next logon by a privileged user (e.g., Domain Admin), the script executes commands that are anomalous for that privileged user's normal logon process. This chained analysis can detect piggybacking on privileged accounts."
          },
          "A process spawned by a network logon script executing under a standard user's context is subsequently observed running with elevated integrity or a different, more privileged user SID (e.g., SYSTEM).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched by logon scripts. Compare the `SubjectLogonId` or `SubjectUserSid` (the user context of the script) with the token elevation type (`TokenElevationTypeDefault` vs. `TokenElevationTypeFull`) or the user context of child processes. An alert should trigger when a script running under a standard user context (`TokenElevationTypeDefault`) successfully spawns a child process with a full elevated token (`TokenElevationTypeFull`) or running as NT AUTHORITY\\SYSTEM, which is a direct indicator of successful privilege escalation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```