[
  {
    "Is the adversary attempting to evade defenses by masquerading as legitimate resources? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1036.005 - Match Legitimate Resource Name or Location": {
          "Executable files with legitimate names found in unusual or unexpected directory locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon); Windows Event ID 11 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Event ID 4688, Sysmon Event ID 1) and file creation (Sysmon Event ID 11) events. Establish a baseline of legitimate executable paths and names. Identify instances where a process is started from an unexpected path or a file with a known legitimate name is created in an unusual directory. Use correlation analysis between parent/child processes and file paths to identify suspicious execution chains."
          },
          "Executable files with hashes or PE metadata (InternalName, OriginalFilename, ProductName) that do not match expected values for their reported name or location.": {
            "Data": "Windows Event ID 1 (Sysmon); Windows Event ID 11 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect file hashes (Sysmon Event ID 1, 11) and PE metadata (if available in logs, e.g., Sysmon Event ID 1/11) for newly created or executed files, especially those with legitimate-sounding names. Compare collected hashes and metadata against known legitimate values or a trusted source database. Flag instances where hashes do not match or metadata is inconsistent with the file's apparent identity."
          },
          "Suspicious command-line arguments used with legitimate-sounding process names.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Event ID 4688, Sysmon Event ID 1). Filter processes with legitimate-sounding names (e.g., svchost.exe, explorer.exe) and analyze command lines for suspicious arguments (e.g., encoding, external URLs, unusual script flags, connections specified in command line). Use frequency analysis or signature matching on command lines to identify outliers or known malicious patterns."
          },
          "Outbound network connections from processes using legitimate-sounding names or locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon); Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation (Event ID 4688, Sysmon Event ID 1) with network connection events (Event ID 5156, Zeek conn.log). Identify connections originating from processes matching legitimate names/locations but potentially exhibiting suspicious command lines or paths. Analyze connection details (destination IP/port, protocol) in Zeek logs. Flag connections to threat intelligence sources or unusual destinations for that process type using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]