[
  {
    "Is the adversary maintaining persistence using RC scripts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.004 - RC Scripts": {
          "Windows process execution events indicating modification of remote files in paths consistent with RC scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes (e.g., 'notepad.exe', 'cmd.exe', 'powershell.exe') writing to paths that map to known RC script locations on potentially mounted network shares or accessed remote systems. Filter by user context and file operation arguments."
          },
          "Windows process creation events where the parent process or command line suggests execution triggered by a remote startup script.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes spawned during system startup with unusual parent processes (not typical Windows services) or command lines containing paths or commands consistent with those potentially written into RC scripts. Use correlation analysis to link suspicious processes to startup events."
          }
        }
      }
    }
  },
  {
    "Is the adversary elevating privileges using RC scripts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1037.004 - RC Scripts": {
          "Windows process creation events showing unexpected processes running with SYSTEM or Administrator privileges initiated during system startup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes with 'New Process Privileges' indicating SYSTEM or Administrator context that are launched during system startup. Identify outliers based on process name, command line, and typical startup behavior using descriptive statistics."
          },
          "Attempts via Windows processes to modify files related to ESXi persistence mechanisms.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process execution attempting to interact with files or services on known ESXi hosts, specifically targeting paths like '/etc/rc.local.d/local.sh' using remote file access commands or tools. Filter by source user and process."
          }
        }
      }
    }
  }
]