```json
[
  {
    "Is the adversary attempting to evade defenses using filename manipulation? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.002 - Right-to-Left Override": {
          "Presence of the Right-to-Left Override (RTLO) character (U+202E) in file names, process command lines, or registry keys.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657; Zeek file.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Implement a high-severity alert to trigger upon detection of the Unicode character `U+202E` (or its URL-encoded form `%E2%80%AE`) in any of these critical data sources: process command lines (Windows Event ID 4688), registry key/value modifications (Windows Event ID 4657), and filenames observed in network traffic (Zeek file.log, http.log). Since this character has virtually no legitimate use in these contexts, any detection should be considered highly suspicious and investigated immediately for malicious activity."
          },
          "A file name is observed containing the RTLO character (U+202E) strategically placed to spoof a benign file extension (e.g., '.jpg', '.pdf', '.txt') while masking an executable extension (e.g., '.exe', '.scr', '.vbs').": {
            "Data": "Windows Event ID 4688; Zeek file.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use regular expressions to parse filenames from process creation events (Windows Event ID 4688) and network file transfers (Zeek file.log, http.log). The pattern should specifically detect filenames that contain an executable extension before the RTLO character and a benign extension after it (e.g., `name.exe[U+202E]gpj`). Correlate findings to identify the true file type versus the displayed one. Use descriptive statistics on the true executable extension types found using this pattern to identify campaigns."
          },
          "A process associated with a common document or image viewer spawns an unexpected child process, such as a command shell or scripting engine, after a user file-open action.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for anomalous parent-child process relationships that suggest a user was tricked into running a disguised executable. Establish a baseline of normal process chains. Hunt for and alert on sequences such as `explorer.exe` creating a process that appears benign (e.g., `invoice.pdf`) but which in turn spawns `cmd.exe`, `powershell.exe`, or `wscript.exe`. Use correlation analysis to link these process chains with prior file downloads from email or web browsing."
          },
          "A file is written to disk via a user application (e.g., web browser, email client), and shortly thereafter, a process is created with the same base name, where the true process name is executable but was likely disguised with a spoofed extension.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file creation events (Windows Event ID 4663 for object access, or inferred from Zeek file.log for network downloads) with subsequent process creation events (Windows Event ID 4688) on the same host within a short time window (e.g., less than 60 seconds). Specifically hunt for cases where a file like `report.pdf` is downloaded/written, and then a process with a similar name is executed, but the process creation log reveals the true process name contains an executable extension (e.g., `report[RTLO]fdp.exe`). Use time series analysis to detect spikes in this specific file-write-then-execute behavior across the enterprise, which may indicate a phishing campaign."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```