[
  {
    "Is the adversary maintaining persistence using Windows logon scripts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.001 - Logon Script (Windows)": {
          "Modification or creation of the HKCU\\Environment\\UserInitMprLogonScript Registry key.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Value Set) and 4663 (Object Access) for activity modifying or accessing the 'HKCU\\\\Environment\\\\UserInitMprLogonScript' key path. Identify the SubjectUserName (user performing the action) and ProcessId. Flag any successful modifications for investigation. Use frequency analysis to detect unusual spikes in registry modification events related to this key."
          },
          "Execution of unusual processes originating from a path specified in a user's logon script during logon.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for processes launched shortly after user logon. Correlate these events with known logon event IDs (4624, 4625). Examine the ParentProcessName (often explorer.exe) and CommandLine fields for executables launched from suspicious or non-standard paths commonly used by logon scripts (e.g., within user profile directories, temporary folders, or network shares). Analyze process entropy or uncommon command line arguments compared to a baseline."
          },
          "Network connections initiated by a process launched from a logon script path shortly after user logon.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events for processes launched shortly after user logon with corresponding Windows Event ID 5156 (Network Connection) and Zeek conn.log entries showing outbound network connections initiated by these processes. Filter for connections to external or unusual destinations (e.g., non-corporate IP ranges, known C2 infrastructure). Use frequency analysis on destination IPs and ports to identify rare or unexpected connections initiated by these logon-script-related processes."
          },
          "File creation or modification events by processes launched from a logon script path.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access), filtered for file write/create operations, for events where the generating process's ParentProcessName or path (correlated via Event ID 4688 at logon time) suggests it was launched from a logon script location. Investigate modification of system files, executable files in unusual locations, or creation of new files in temporary/system directories by these processes. Use descriptive statistics (e.g., count of file modifications) to identify unusually active logon-script-launched processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation using Windows logon scripts? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1037.001 - Logon Script (Windows)": {
          "Modification or creation of the HKCU\\Environment\\UserInitMprLogonScript Registry key by a user account with elevated privileges (e.g., Administrator).": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4657 and 4663 related to 'HKCU\\\\Environment\\\\UserInitMprLogonScript' for events where the SubjectUserName (the user performing the action) possesses administrative privileges or belongs to privileged groups. Compare the SubjectUserName with the TargetUserName (the user whose hive is being modified). Investigate any modifications where the SubjectUserName is different from TargetUserName and has higher privileges, as this may indicate an attempt to set a script for privilege escalation upon the target user's next logon."
          },
          "Suspicious process execution exhibiting elevated privileges originating from a path specified in a user's logon script during logon.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched at logon (correlated with event 4624/4625) with a ParentProcessName suggesting a logon script origin (e.g., explorer.exe) that exhibit elevated privileges (e.g., 'TokenElevationType' in Sysmon-enhanced 4688 output indicating elevation or high integrity level). Investigate processes launched from potential script locations that are running with SYSTEM, Administrator, or other privileged tokens."
          },
          "Logon script Registry key (HKCU\\Environment\\UserInitMprLogonScript) modification by a user account other than the logged-in user, especially if the modifying user is an administrator or has higher privileges than the target user.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Value Set) and 4663 (Object Access) on 'HKCU\\\\Environment\\\\UserInitMprLogonScript'. Identify events where SubjectUserName is different from TargetUserName (the hive owner). Flag and investigate modifications where SubjectUserName has higher privileges or belongs to a privileged group compared to TargetUserName. Use correlation analysis to link these registry changes to the next logon event (4624) of the TargetUserName."
          },
          "Process creation initiated by explorer.exe shortly after logon, which then attempts to manipulate security-sensitive objects or processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created with ParentProcessName 'explorer.exe' shortly after user logon. Correlate these processes with Event ID 4656 (Handle Requested) and 4663 (Object Access) events indicating attempts to gain access to or modify critical system objects (e.g., services via SCM database, registry keys under HKLM, processes with system privileges) or inject into other processes. Filter for processes running with elevated integrity levels. Use correlation analysis to link the process creation to subsequent object access events and investigate suspicious object types or permissions requested."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]