[
  {
    "Is the adversary attempting to evade defenses by masquerading tasks or services? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.004 - Masquerade Task or Service": {
          "Creation or modification of scheduled tasks or Windows services with suspicious names, descriptions, or associated executables.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4698 (Scheduled Task Created), 4702 (Scheduled Task Updated), 7045 (Service Installed), and 4688 (Process Creation). Analyze created/modified task/service names, descriptions, and associated executables. Compare against a baseline of legitimate tasks/services. Identify task/service names similar to legitimate ones using string matching or similarity algorithms (e.g., Levenshtein distance). Flag creations/modifications occurring outside scheduled maintenance windows using time series analysis or simple outlier detection on timestamps."
          },
          "Execution of rare or previously unseen processes originating from scheduled task or service startup events.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the parent is a known task/service host process (e.g., svchost.exe, taskhost.exe, taskeng.exe) or a direct service executable path. Identify rare process names or command-line arguments originating from these parent processes by comparing against historical process execution frequency (descriptive statistics, frequency distribution) or identifying outliers using percentile analysis."
          },
          "Creation or modification of scheduled tasks or Windows services with unusual or generic descriptions, or suspicious parameters (e.g., hidden windows, specific user contexts).": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4698 (Scheduled Task Created), 4702 (Scheduled Task Updated), and 7045 (Service Installed) for new scheduled tasks or services. Analyze the 'Description' field and configuration parameters (e.g., 'run with hidden window', 'user context', 'trigger type'). Use string analysis to identify empty, generic, or unusual descriptions. Compare parameters against common configurations for legitimate tasks/services. Use frequency analysis on parameter combinations to identify rare or suspicious configurations."
          },
          "Outlier process execution originating from a scheduled task or service that subsequently initiates network connections to suspicious or untracked destinations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events identified as outlier processes (from previous analysis/baselines) where the parent is a task/service host process, with Zeek conn.log and Windows Event ID 5156 (Windows Filtering Platform Connection) events occurring shortly after, where the process name or PID matches. Identify connections to external IPs not typically associated with the host or service, or connections on unusual ports. Use correlation analysis to link the timing of process execution to the start of network connections. Cross-reference destination IPs against threat intelligence feeds."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]