[
  {
    "Is the adversary attempting to evade defenses using file masquerading techniques? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.007 - Double File Extension": {
          "Detection of files created or modified on systems with multiple file extensions, especially where the final extension is executable (e.g., .exe, .scr, .hta).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creation events where the command line or file path includes parameters indicating file saving or creation, specifically looking for filenames matching patterns like '*.txt.exe', '*.doc.scr', etc. Analyze frequency distribution of suspicious filenames. Use descriptive statistics on parent process names creating such files to identify anomalies."
          },
          "Attempted execution of files exhibiting double file extensions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for process creation events. Extract the full command line and target file path. Identify instances where the executable path or command line arguments contain filenames with double extensions, particularly ending in executable extensions (.exe, .scr, .hta, .lnk). Correlate execution attempts with the source process (e.g., email client, browser) to identify potential phishing vectors."
          },
          "Network traffic indicating transfer of files with suspicious double extensions, potentially via email or web downloads.": {
            "Data": "Zeek http.log; Zeek smtp.log; Zeek fileinfo.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and smtp.log for file transfers. Extract filenames from traffic (e.g., using fileinfo.log correlated with http/smtp logs). Use pattern matching (regex) to identify filenames containing double extensions (e.g., `.*\\.\\w+\\.(exe|scr|hta|lnk)$`). Calculate frequency distribution of observed suspicious filenames and source/destination IPs. Prioritize investigation based on file hash reputation (if available in fileinfo.log) or transfer volume using descriptive statistics."
          },
          "Execution of files with double extensions originating from common download or temporary directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for process creation events. Filter events where `New Process Name` or `CommandLine` contains a path pointing to user download folders (`%USERPROFILE%\\Downloads`, `%APPDATA%\\Microsoft\\Windows\\INetCache`, etc.) or temporary folders (`%TEMP%`, `%TMP%`). Within these filtered events, apply pattern matching (regex) to identify filenames with double extensions ending in executable types (`.*\\.\\w+\\.(exe|scr|hta|lnk)$`). Use frequency analysis to identify common source directories or filenames. Correlate with parent process name to understand how the execution was initiated (e.g., explorer.exe, email client, browser) and identify anomalies using descriptive statistics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]