[
    {
        "information_requirement": "Is the adversary maintaining persistence using Windows logon scripts?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1037.001",
                "name": "Logon Script (Windows)",
                "evidence": [
                    {
                        "description": "A logon script file (e.g., .bat, .vbs, .ps1) matching a known malicious hash is created, modified, or executed.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for file creation/modification events (Event ID 4663) in common script locations (e.g., user profiles, SYSVOL shares). Hash the newly created or modified files and correlate the hash against a CTI feed of known malicious script hashes. Additionally, upon execution of script interpreters (powershell.exe, cscript.exe) at logon (correlated with Event ID 4688), hash the script file from the command line argument and compare it against the CTI feed. Alert on any matches."
                    },
                    {
                        "description": "Unauthorized or anomalous modification of known logon script configuration points, including the UserInitMprLogonScript registry key or GPO script files.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for modifications to the 'HKCU\\Environment\\UserInitMprLogonScript' registry key using Windows Event ID 4657 (Value Set). Additionally, monitor for file modification events (Windows Event ID 4663) targeting 'scripts.ini' and associated script files within SYSVOL shares on Domain Controllers, which indicate changes to GPO-based logon scripts. Establish a baseline of authorized administrative changes and alert on any modifications that deviate from this pattern or are performed by non-administrative users."
                    },
                    {
                        "description": "Anomalous child processes, file modifications, or network connections originating from a legitimate script interpreter (powershell.exe, cscript.exe, etc.) launched at user logon.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "At user logon (correlated with logon event IDs like 4624), monitor for process creation events (Event ID 4688) where a script host (powershell.exe, cscript.exe, wscript.exe, cmd.exe) is executed with a script argument. Profile the normal child processes, file system interactions (Event ID 4663), and network connections (Zeek conn.log) for these legitimate logon scripts. Use correlation analysis and descriptive statistics to flag anomalies, such as the creation of executable files in temporary directories, modification of system configuration keys/files, or network connections to rare external IPs or domains. Use entropy measures on command-line arguments and time series analysis on network traffic volume to spot deviations from baseline."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary attempting privilege escalation using Windows logon scripts?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1037.001",
                "name": "Logon Script (Windows)",
                "evidence": [
                    {
                        "description": "A logon script path is modified by a privileged user to point to a script file whose hash is known to be associated with privilege escalation tools or malware.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for modifications to logon script configurations (e.g., 'UserInitMprLogonScript' registry key via Event ID 4657, or GPO files in SYSVOL via Event ID 4663). When a modification is detected, extract the path to the script file. Hash the script file and compare against a CTI database of malicious file hashes, focusing on signatures related to privilege escalation frameworks or tools. Alert on any match, especially if the modification was performed by a privileged account on another user's configuration."
                    },
                    {
                        "description": "A privileged account modifies a logon script configuration (e.g., Registry key, GPO setting) for a different, less-privileged user account.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for modifications to the 'HKCU\\Environment\\UserInitMprLogonScript' key (Event ID 4657). Identify cases where the SubjectUserName (the actor) is different from the user associated with the HKCU hive path. Cross-reference account privileges to flag any instance where a high-privilege account modifies a lower-privilege user's logon script. Similarly, monitor GPO file modifications (Event ID 4663) and correlate the modifying user with the users targeted by the GPO to detect cross-user manipulation."
                    },
                    {
                        "description": "A user's logon script executes from a file path with insecure permissions, allowing it to be modified by lower-privileged users.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "File/Folder ACLs"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Upon execution of a logon script (identified via Event ID 4688 at logon), programmatically or manually check the Access Control Lists (ACLs) of the script file and its parent directory. Alert if any user or group with lower privileges than the executing user (e.g., 'Everyone', 'Authenticated Users', a specific low-privilege group) has write permissions. This identifies a critical misconfiguration that can be abused for privilege escalation by replacing the script content. Correlate findings with recent file modification events to the script."
                    },
                    {
                        "description": "A process launched via logon script attempts to perform actions indicative of privilege escalation, such as creating a new service, loading a vulnerable driver, or accessing credentials from memory.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 7045",
                            "Windows Event ID 4656"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate processes launched at logon from a script (Event ID 4688) with subsequent high-risk activities within a short time window. Monitor for: creation of new services (Event ID 7045), which is a common privilege escalation vector; process handle requests (Event ID 4656) targeting lsass.exe, indicating credential access attempts; or other anomalous system interactions. Use linear regression or correlation analysis to determine if the execution of certain logon scripts statistically predicts an increase in these high-risk events."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
