[
  {
    "Is the adversary using defense evasion techniques to hide malicious files? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1036.006 - Space after Filename": {
          "Creation or modification of files with filenames ending in a space character.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation/modification events (Windows Event ID 4656, 4663) on endpoints and servers. Filter events for filenames containing a trailing space character before the extension or at the end of the filename. Count occurrences by user/host and alert on anomalous frequency or occurrence on critical systems. Use frequency analysis or percentile thresholds to identify rare occurrences."
          },
          "Execution of processes originating from files with filenames containing non-standard extensions or trailing spaces.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) on endpoints and servers. Analyze the CommandLine or New Process Name field. Identify processes executed from file paths that contain trailing spaces in the filename or filenames with extensions that do not match the expected file type of the process (e.g., '.txt ' executing a binary). Use frequency analysis on unusual command lines/filenames. Correlate with parent process information to identify suspicious execution chains."
          },
          "Network transfer of files with filenames containing trailing spaces.": {
            "Data": "Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for filenames ('files.filename') that contain trailing space characters using regular expressions or string analysis. Count occurrences and identify source/destination IPs and associated protocols. Investigate hosts receiving such files, particularly if the transfer uses protocols often associated with user interaction (e.g., SMB, HTTP). Use descriptive statistics on file transfer frequency for such filenames."
          },
          "Network connections initiated by processes whose originating file path contained trailing spaces.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes launched from file paths containing trailing spaces using Windows Event ID 4688 (CommandLine). Correlate the Process ID (4688 NewProcessId) with subsequent network connection events (Windows Event ID 5156, Zeek conn.log). Flag processes launched from files with trailing spaces that make suspicious outbound connections (e.g., to known malicious IPs, unusual ports, or immediately after launch). Use correlation analysis to link process execution events to network activity and identify anomalous connection patterns based on destination or volume (Zeek bytes transferred)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]