[
  {
    "Is the adversary attempting to evade defenses using filename manipulation? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1036.002 - Right-to-Left Override": {
          "Existence of files or paths containing the RTLO character (U+202E) in the file system or received via network traffic/email attachments.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (access), 4656 (handle request), and Zeek file.log for filenames or paths containing the Unicode character \\u202E or its representations (%E2%80%AE). Use string matching and regular expressions to identify these patterns. Use descriptive statistics on the frequency of file events containing this character to identify unusual occurrences on specific systems or network segments."
          },
          "RTLO character found within registry key names or specifically within known malicious file types (.scr, .js, etc.) during analysis.": {
            "Data": "Windows Event ID 4657; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (registry value write) for registry key or value names containing the RTLO character. Analyze Zeek file.log for common malicious file extensions (e.g., .exe, .scr, .js) transmitted over the network and inspect corresponding filenames for the RTLO character. Correlate findings with observed process creation events if available to understand the outcome."
          },
          "Process execution events where the executable path or command line arguments contain the RTLO character.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for events where the 'New Process Name' or 'Command Line' fields contain the Unicode character \\u202E or its representations. Use string matching and regular expressions to identify the character and analyze the potential filename manipulation. Use frequency analysis on these events to identify rare or unusual process executions."
          },
          "Detection of file transfers over the network where the original filename in protocol metadata contains the RTLO character combined with a misleading file extension.": {
            "Data": "Zeek http.log; Zeek smb_files.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (http.log, smb_files.log, file.log) for file transfers where the filename field contains the \\u202E Unicode character. Identify instances where the actual filename contains an executable extension (e.g., .exe, .scr) but the sequence of characters around the RTLO would cause it to display with a benign extension (e.g., .jpg, .pdf). Use descriptive statistics (counts, source/destination) on such transfers to identify suspicious patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]