```json
[
  {
    "Has the adversary collected data from network shared drives? (TA0009 - Collection)": {
      "Indicators": {
        "T1039 - Data from Network Shared Drive": {
          "Execution of known malicious scripts or tools on an endpoint that perform data collection from network shares, identified by file hash or name.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688, ideally enriched with file hash information from sources like Sysmon). Correlate process hashes and names against a threat intelligence feed of known malicious tools and scripts used for data collection. If a match is found, immediately correlate the activity (by Process ID and host) with concurrent network share access logs (Windows Event ID 5140, 4663; Zeek smb.log) to confirm collection activity."
          },
          "Execution of commands, scripts (PowerShell, WMI), or common utilities (`xcopy`, `robocopy`) using syntax patterns strongly indicative of bulk data collection from network shared drives.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and apply regular expressions to process command lines (Windows Event ID 4688) and PowerShell script blocks (Windows Event ID 4104) to detect patterns such as: recursive copying from UNC paths (`xcopy \\\\server\\share /s /e`), use of wildcards to gather specific file types from shares (`*.docx`, `*.pdf`), or PowerShell cmdlets like `Get-ChildItem -Recurse -Path \\\\server\\share | Copy-Item`. Alert on command patterns that are uncommon for legitimate administrative activity or originate from non-administrative users."
          },
          "Anomalous volume or frequency of file access from a single user or host to one or more network shares, deviating significantly from established baselines.": {
            "Data": "Windows Event ID 4663; Zeek smb.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each user and host, establish a baseline of data access volume (bytes transferred) and file access frequency (files read per hour) for network shares using historical Zeek smb.log and Windows Event ID 4663 data. Use statistical methods like Z-scores or Inter-Quartile Range (IQR) to detect significant spikes in activity that fall outside the normal range (e.g., > 3 standard deviations from the mean). A box-plot of daily access volume per user can help visualize and identify outlier days for investigation."
          },
          "A user or host accessing an unusually high number of distinct network shares or sensitive file types that are inconsistent with their normal role-based activity.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4663; Zeek smb.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile normal user and host activity to create a baseline of which shares and file types they typically access. Monitor for access to new shares or a sudden increase in the breadth of shares accessed by a single entity. Calculate the entropy of share names or file extensions accessed by a user within a time window; a sharp increase in entropy indicates anomalous discovery and collection behavior. Correlate access events (Windows Event ID 4663, Zeek smb.log) with a data classification map to flag any access to sensitive shares or files by non-authorized users."
          },
          "Observation of a 'fan-in' data transfer pattern, where a single host reads files from multiple disparate network shares and writes them to a single local directory or another centralized network location.": {
            "Data": "Windows Event ID 4663; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file read events from network shares (identified in Zeek smb.log or from Windows Event ID 4663 where Object Name contains a UNC path) with file write events (identified in Windows Event ID 4663 where 'Accesses' contains 'WriteData') on a single host. Use correlation analysis based on the source host and a short time window (e.g., 1 hour) to identify hosts that read from many unique UNC paths and write to a single local path. This pattern is a strong behavioral indicator of data staging for subsequent exfiltration."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```