[
  {
    "Is the adversary exfiltrating sensitive data? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1030 - Data Transfer Size Limits": {
          "Detection of outbound network traffic flows consisting of consistently fixed-size data packets or chunks below typical file sizes.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound sessions (client to external IP). Calculate statistical properties (e.g., mode, standard deviation, IQR) of outbound packet/chunk sizes for each flow. Flag sessions with low variance or consistent packet sizes below a defined threshold. Use descriptive statistics on byte counts per flow to compare against known baselines."
          },
          "Identification of uncommon data flows (e.g., high client-to-server data ratio) or processes making periodic, fixed-size outbound connections not typical for their function.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify flows with significantly higher bytes_sent than bytes_received ratio (client sending more than receiving). Correlate network connections with process creation events (Windows Event ID 4688) or process network activity logs. Analyze flagged flows using time series analysis or correlation analysis to identify periodic connections sending fixed data volumes, especially from processes not typically associated with high outbound data transfer."
          },
          "Outbound network connections originating from processes not typically expected to have network activity or from newly observed processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline network-aware processes on endpoints and servers using Windows Event ID 4688 correlated with network activity (Event ID 5156 or Zeek conn.log). Identify outbound connections initiated by processes not in the baseline or newly observed processes. Use frequency analysis to establish normal process network behavior per host/user and flag significant deviations."
          },
          "Outbound network traffic on standard ports exhibiting unexpected protocol behavior or inconsistent data transfer sizes for the declared protocol.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn.log, http.log, ssl.log, etc.) for outbound connections on common ports (e.g., 80, 443, 22, 21). Examine protocol-specific fields and data transfer sizes (bytes_orig, bytes_resp) in conn.log. Correlate with http.log (unusual User-Agents, method/path patterns), ssl.log (non-standard TLS), or files.log (unexpected file transfers). Use descriptive statistics (e.g., mean, variance, percentiles) on bytes transferred within protocol sessions to find outliers or patterns inconsistent with the protocol specification."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]