[
  {
    "Is the adversary using boot or logon initialization scripts for persistence? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037 - Boot or Logon Initialization Scripts": {
          "Unusual access to or modification of boot or logon script files by non-standard users or accounts outside of normal IT operations.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 and 4656 for access or modification events on known boot/logon script file paths (e.g., C:\\Windows\\System32\\GroupPolicy\\User\\Scripts\\Logon\\*, C:\\Windows\\System32\\GroupPolicy\\Machine\\Scripts\\Startup\\*). Baseline normal access patterns by user/account and time. Identify deviations using descriptive statistics and flag access from unusual accounts or during off-hours."
          },
          "Detection of unusual or malicious processes being launched by boot or logon scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) where the parent process is associated with script execution (e.g., powershell.exe, cmd.exe executing a script file). Correlate child process creation events with a list of known legitimate processes launched by scripts. Flag creation of unknown or suspicious processes launched by scripts."
          }
        }
      }
    }
  },
  {
    "Is the adversary using boot or logon initialization scripts for privilege escalation? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1037 - Boot or Logon Initialization Scripts": {
          "Boot or logon scripts executing with higher privileges than expected for the associated user or system.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Windows Event ID 4624 (Logon) and 4688 (Process Creation) in conjunction. Identify processes launched by logon scripts. Determine the privilege level (integrity level) of the script execution process and its child processes. Flag instances where scripts or child processes are running with unexpectedly high integrity levels (e.g., System, High) for a standard user login script."
          },
          "Unauthorized or unexpected changes to boot or logon scripts configured to run with administrative privileges.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 and 4656 for modifications specifically on boot/logon script paths that are typically executed with administrative privileges (e.g., machine startup scripts). Baseline accessors and modification times. Use statistical analysis (e.g., frequency analysis, deviation from baseline) to identify modification attempts by unauthorized accounts or during suspicious timeframes."
          }
        }
      }
    }
  }
]