[
  {
    "Is the adversary maintaining persistence using Windows logon scripts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.001 - Logon Script (Windows)": {
          "Modification or creation of the HKCU\\Environment\\UserInitMprLogonScript Registry key.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 and 4663 for activity modifying or accessing the 'HKCU\\\\Environment\\\\UserInitMprLogonScript' key. Identify the user account and process responsible. Flag any successful modifications for investigation. Use frequency analysis to detect unusual spikes in registry modification events."
          },
          "Execution of unusual processes originating from a path specified in a user's logon script during logon.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Correlate these events with user logon times and examine the ParentProcessName and CommandLine fields for executables launched from paths commonly used by logon scripts (e.g., within user profile directories, network shares) or directly referenced by the 'UserInitMprLogonScript' value if known. Analyze process entropy or uncommon command line arguments."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation using Windows logon scripts? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1037.001 - Logon Script (Windows)": {
          "Modification or creation of the HKCU\\Environment\\UserInitMprLogonScript Registry key by a user account with elevated privileges (e.g., Administrator).": {
            "Data": "Windows Event ID 4657, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4657 and 4663 related to 'HKCU\\\\Environment\\\\UserInitMprLogonScript' for events where the modifying user account possesses administrative privileges or belongs to privileged groups. Investigate any such modifications, especially if correlated with suspicious login activity."
          },
          "Suspicious process execution exhibiting elevated privileges originating from a path specified in a user's logon script during logon.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and look for processes launched at logon (correlated with event 4624/4625) that exhibit elevated privileges (e.g., 'TokenElevationType' in Sysmon 4688 output indicating elevation). Investigate processes launched from potential script locations that have high integrity levels."
          }
        }
      }
    }
  }
]