[
  {
    "Is the adversary maintaining persistence using startup items? (TA0003 - Persistence)": {
      "Indicators": {
        "T1037.005 - Startup Items": {
          "Execution of unsigned or unusual processes with elevated privileges during system startup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes started with high integrity levels (for potential execution via startup items). Filter for processes executed during system boot time. Compare observed processes against a whitelist of known legitimate startup processes. Flag unsigned executables or processes with low entropy names/paths for further investigation."
          },
          "Network connections initiated by processes running shortly after system startup from suspicious locations.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) during startup with Zeek conn.log entries. Identify network connections initiated by processes launched during boot. Use correlation analysis to link process execution with external connections and check against threat intelligence feeds or internal baselines for unusual destinations."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary achieved privilege escalation via startup items? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1037.005 - Startup Items": {
          "Execution of newly created processes under the SYSTEM or root account during system boot.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for processes running with the SYSTEM user during system startup. Identify processes that are not part of the standard operating system boot sequence or installed applications. Use correlation analysis to link the launch of these processes with other system events preceding boot."
          },
          "Discovery of unexpected executable files or scripts located in system startup directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) on endpoints/servers and identify processes whose execution path originates from typical startup item locations (even if the technique describes a different OS path, map to relevant system startup paths if applicable to target OS). Use frequency analysis or clustering to find rare or anomalous startup processes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]