[
  {
    "Has the adversary exfiltrated data from the network? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1048.002 - Exfiltration Over Asymmetric Encrypted Non-C2 Protocol": {
          "Uncommon data flow patterns detected over encrypted non-C2 protocols (e.g., significantly higher outbound data than inbound on typical client connections).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and ssl.log for connections using encrypted protocols (HTTPS, SMTPS, etc.) to non-standard external destinations. Calculate the ratio of bytes_sent to bytes_received for these connections. Flag connections with a significantly high bytes_sent to bytes_received ratio compared to baselines for that protocol and destination type (e.g., using Z-score or percentile analysis)."
          },
          "Network connections over encrypted non-C2 protocols initiated by processes that do not typically access the network or are newly observed.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and collect process information. Correlate process creation events with Zeek conn.log entries showing outbound connections over encrypted non-C2 protocols. Identify processes initiating such connections that are rare, have never been observed before, or have command lines indicative of suspicious activity. Use frequency analysis or clustering to identify outlier processes."
          },
          "Large volume of data transferred outbound over an encrypted, non-C2 protocol (like HTTPS) to an external destination not typically associated with large transfers (e.g., personal cloud storage, unknown/suspicious domain).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek logs (conn.log, http.log, ssl.log) for outbound connections over encrypted protocols (port 443, etc.) to external destinations. Exclude known corporate services (e.g., Office 365, sanctioned cloud storage) based on Zeek dns.log or flow metadata. Measure total bytes_sent per connection or host pair over a period. Identify connections/hosts exhibiting unusually high outbound data volumes compared to their historical behavior or peer groups using statistical methods (e.g., IQR, percentile, or Z-score)."
          },
          "Encrypted connections exhibiting atypical TLS certificate details (e.g., self-signed, expired, uncommon issuer, domain mismatch) associated with significant outbound data transfer.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for outbound encrypted connections. Identify connections with suspicious TLS certificate characteristics (e.g., `self_signed` is true, `validation_status` is invalid, uncommon `issuer`, `subject` not matching destination IP/domain). Correlate these findings with Zeek conn.log to measure the `bytes_sent` for these specific connections. Flag connections with both suspicious certificate details and significant outbound data volume."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]