[
  {
    "Has the adversary exfiltrated sensitive data over a C2 channel? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1041 - Exfiltration Over C2 Channel": {
          "Unusual network traffic patterns indicating high volume outbound data from endpoints/servers over known C2 channels.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log data to identify connections with high outbound data volume relative to inbound volume (bytes_sent >> bytes_received). Focus on connections to known or suspected C2 IP/domains. Use statistical analysis (e.g., percentiles, IQR, or simple ratios) on byte counts to identify outliers in data flow direction and volume."
          },
          "Network connections to suspected C2 infrastructure originating from processes not typically involved in network communication, or exhibiting unusual protocol behavior.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 to monitor process creation and network activity correlation on endpoints. Correlate process execution data with Zeek logs (conn.log, http.log, dns.log) to identify network connections originating from unexpected processes or processes with no prior network history. Analyze Zeek protocol logs (e.g., weird.log) or use protocol validation where possible to identify non-standard protocol behavior for the port/service to suspected C2 destinations."
          },
          "Detection of abnormally large data transfers masquerading as standard protocol traffic (e.g., large DNS responses, large HTTP POSTs) to suspected C2 destinations.": {
            "Data": "Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for unusually large DNS response sizes (e.g., exceeding typical TXT record sizes or the 512-byte UDP limit) destined for suspected C2 IPs/domains. Analyze Zeek http.log for large HTTP POST requests or unusually large data in HTTP GET headers/parameters to suspected C2s. Use descriptive statistics (e.g., mean, max, percentiles) on data sizes per connection/query to identify outliers."
          },
          "Connections to suspected C2 destinations utilizing standard ports (e.g., 53, 80, 443) but exhibiting non-standard or malformed protocol behavior.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek weird.log for anomalies on connections originating from internal systems and destined for suspected C2 IPs or domains, or on common service ports (53, 80, 443). Filter Zeek conn.log for connections on these common ports to suspected C2s and examine associated Zeek protocol logs (e.g., http.log, dns.log) for specific error messages or flags indicating malformed packets or unusual session states. Flag connections exhibiting these anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]