[
  {
    "Is the adversary attempting to capture credentials via network sniffing? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1040 - Network Sniffing": {
          "Presence of tools or configurations indicative of network sniffing (e.g., promiscuous mode enabled, suspicious packet capture files).": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of known network sniffing tools (e.g., Wireshark, tcpdump, kismet). Analyze Zeek conn.log for unusual outbound connections from hosts running these processes. Use correlation analysis to link process creation events with network traffic patterns."
          },
          "Detection of ARP spoofing or gratuitous ARP broadcasts on the network.": {
            "Data": "Zeek arp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek arp.log for gratuitous ARP broadcasts or conflicting ARP entries. Detect multiple ARP responses for the same IP address from different MAC addresses within a short time window. Use time series analysis to identify bursts of unusual ARP activity."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary gathering network information via network sniffing? (TA0007 - Discovery)": {
      "Indicators": {
        "T1040 - Network Sniffing": {
          "Suspicious network traffic patterns suggesting data exfiltration related to captured network configuration details.": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for unusual outbound data volume or connections to suspicious external destinations from hosts that might have captured data. Use descriptive statistics (e.g., byte volume per flow, frequency of connections to external IPs) and compare against historical baseline to identify anomalies."
          },
          "Anomalous access attempts or activity on network device management interfaces, potentially preceding sniffing configuration changes.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections on network device management ports (e.g., 22, 23, 443, 80) targeting network infrastructure IPs. Identify connections from unusual source IPs, times, or authentication failures (if visible in Zeek ssl.log or other relevant logs). Use frequency analysis and behavioral profiling based on historical data to flag anomalous management access attempts."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]