[
  {
    "Is the adversary exfiltrating sensitive data using alternative protocols? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1048 - Exfiltration Over Alternative Protocol": {
          "Client systems sending large amounts of data outbound over common ports (HTTP/S, FTP, SMB) relative to inbound traffic.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ftp.log; Zeek smb.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, ftp.log, smb.log. For connections from internal clients to external destinations on common ports (80, 443, 21, 22, 445), calculate the ratio of bytes_sent to bytes_recv. Identify connections with unusually high bytes_sent/bytes_recv ratios using percentile analysis or outlier detection techniques (e.g., Z-score or IQR)."
          },
          "Network traffic from processes or protocols not typically associated with a host, or protocol traffic inconsistent with the destination port (e.g., SMB traffic on port 80).": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dpd.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious process executions initiating network connections. Analyze Zeek conn.log for connections where the 'service' field is inconsistent with the destination port (e.g., 'smb' on port 80). Correlate Zeek dpd.log (dynamic protocol detection) alerts with conn.log entries to identify connections where the detected protocol differs from the expected protocol for the port. Use frequency analysis to baseline typical process-to-port/protocol mappings per host or group."
          },
          "Unusual patterns in DNS queries, including abnormally large query/response sizes, high frequency, or queries for suspicious/unusual domains from internal hosts.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log. Identify DNS queries from internal hosts with unusually large QNAMEs or RDATA sizes (exceeding typical lengths, using percentile analysis or outlier detection). Detect hosts making an unusually high volume of DNS queries over a short period (time series analysis or rate limiting). Cross-reference queried domain names against threat intelligence feeds and analyze domains with low reputation or lack of prior history in organizational logs (frequency analysis)."
          },
          "Execution of common OS utilities (like curl, ftp, certutil, PowerShell with web requests) making outbound network connections on unusual ports or using alternative protocols.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of processes like 'curl.exe', 'ftp.exe', 'certutil.exe', or PowerShell scripts with outbound network command-line arguments. Correlate these process creation events with Windows Event ID 5156 (Network Connection) and Zeek conn.log to identify the destination IPs and ports. Flag connections to external destinations on ports not commonly used for legitimate traffic by these processes, or connections using protocols inconsistent with typical usage (e.g., FTP on port 80/443). Establish baseline process-to-port/protocol mappings per host/group using frequency analysis and identify deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]