```json
[
  {
    "Is the adversary executing commands or payloads using WMI? (TA0002 - Execution)": {
      "Indicators": {
        "T1047 - Windows Management Instrumentation": {
          "Execution of WMI commands, PowerShell WMI cmdlets, or WMI scripts containing highly specific malicious indicators (e.g., hardcoded C2 domains, unique strings from known malware, exact malicious command sequences).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan command-line arguments in Windows Event ID 4688 (for `wmic.exe`, `powershell.exe`, `cscript.exe`, `wscript.exe`) and PowerShell script block logs (Windows Event ID 4104) for exact match strings, regular expressions, or YARA rules corresponding to known malicious WMI usage. This includes specific commands uniquely used by malware, hardcoded C2 information within WMI event consumers (e.g., embedded in VBScript for ActiveScriptEventConsumer), or encoded payloads known to be deployed via WMI by specific threat actors. Maintain and regularly update a list of these atomic selectors from threat intelligence feeds and malware analysis."
          },
          "Use of WMI for known malicious patterns such as creating processes (Win32_Process Create), deleting shadow copies (Win32_ShadowCopy Delete), WMI-based persistence mechanisms (__EventFilter, ActiveScriptEventConsumer), or specific reconnaissance queries (AntiVirusProduct, Domain controller lookup) commonly leveraged by attackers.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for `wmic.exe` and PowerShell script block logs (Windows Event ID 4104) for WMI cmdlets (`Get-WmiObject`, `Invoke-WmiMethod`, `Register-WmiEvent`, `Set-WmiInstance`, etc.). Specifically look for patterns indicative of: 1. Calls to `Win32_Process Create` or `Invoke-WmiMethod -Class Win32_Process -Name Create` to launch executables, especially from non-standard paths or with suspicious arguments. 2. Commands targeting `Win32_ShadowCopy` class with the `Delete` method. 3. Queries to identify security products (e.g., `SELECT * FROM AntiVirusProduct` in `root\\SecurityCenter2`) or discover domain information. 4. Creation/modification of WMI event filters (`__EventFilter`), consumers (especially `ActiveScriptEventConsumer`), and filter-to-consumer bindings (`__FilterToConsumerBinding`). Use frequency analysis of WMI class/method usage per user/host to spot rare or first-seen malicious patterns."
          },
          "Anomalous WMI-related network traffic (DCOM port 135, WinRM ports 5985/5986) observed in unusual network segments, between systems not typically using WMI, or exhibiting sudden spikes in volume or frequency.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections on WMI-associated ports (TCP/135 for DCOM, TCP/5985 for HTTP WinRM, TCP/5986 for HTTPS WinRM). Establish baselines for normal WMI traffic, including typical source/destination pairs, network segments, and traffic volume. Use correlation analysis to identify new or unusual WMI communication paths (e.g., workstation-to-workstation WMI, external to internal WMI not via jump server). Employ time series analysis (e.g., moving averages, seasonal decomposition) to detect significant spikes or deviations in WMI traffic volume or connection counts, potentially indicating widespread WMI-based attacks or reconnaissance."
          },
          "Remote WMI execution (identified via network traffic and host logs) originating from unexpected internal/external source systems, targeting non-standard or high-value destination systems, or occurring at anomalous times compared to established operational baselines.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for traffic on WMI ports originating from or destined to unexpected internal systems or external IPs. Correlate this network activity with successful network logons (Windows Event ID 4624, Logon Type 3) on target servers. Establish a baseline of legitimate remote WMI usage (source/destination pairs, user accounts, frequency, time of day) using descriptive statistics (mean, median, mode). Flag new or infrequent remote WMI connections, logins from unusual geolocations for remote WMI, or activity outside typical user/system operational hours using percentile analysis or IQR. Analyze processes created via remote WMI (Windows Event ID 4688, 4104 on target) for malicious indicators."
          },
          "WMI execution (via wmic.exe, PowerShell, or other scripting hosts) initiated by atypical parent processes (e.g., user applications like browsers, Office documents) or leading to the creation of suspicious child processes or outbound network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 to identify parent processes of `wmic.exe`, `powershell.exe` (when using WMI cmdlets detected via Event ID 4104 or command line), or other WMI-capable script hosts (e.g., `cscript.exe`, `mshta.exe`). Flag WMI execution instances where the parent process is a non-administrative tool or a common user application (e.g., `OUTLOOK.EXE`, `WINWORD.EXE`, `CHROME.EXE`), which is highly anomalous. Analyze child processes spawned via WMI for suspicious names, execution from temporary or unusual paths, or subsequent outbound network connections (Zeek conn.log) to unknown or suspicious destinations. Use descriptive statistics to baseline normal parent-child process relationships involving WMI activity and apply correlation analysis to link WMI execution to subsequent suspicious network behaviors."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```