
[
  {
    "Is the adversary attempting to capture credentials via network sniffing? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1040 - Network Sniffing": {
          "Execution of a file with a hash matching a known malicious packet sniffer or credential harvesting tool.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Windows Event ID 4688) and their associated file hashes (if available via endpoint security tools). Correlate these hashes against a CTI feed of known malicious sniffing and credential harvesting tools (e.g., Cain & Abel, specific versions of Mimikatz). Generate a high-priority alert on any match and isolate the host for investigation."
          },
          "Execution of legitimate network sniffing tools with command-line arguments indicative of capturing credentials or saving traffic to a file for later analysis.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688), ensuring full command-line logging is enabled. Create a watchlist of legitimate sniffing tools (`tcpdump.exe`, `tshark.exe`, `windump.exe`). Use regular expressions to alert on their execution when combined with suspicious arguments such as `-w <file>` (writing to a capture file), `-i any` (sniffing all interfaces), or filter expressions targeting cleartext credential protocols (e.g., `'port 21'`, `'port 23'`, `'port 110'`, `'port 143'`). Correlate alerts with user accounts that have no authorization for network diagnostics."
          },
          "An endpoint unexpectedly generating traffic patterns indicative of ARP poisoning or LLMNR/NBT-NS poisoning to perform a man-in-the-middle attack.": {
            "Data": "Zeek arp.log; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek arp.log for a single host (MAC address) claiming to own multiple, active IP addresses, or for a high rate of gratuitous ARP packets that change an existing IP-to-MAC mapping. Monitor Zeek dns.log and conn.log (on UDP port 5355 for LLMNR, UDP 137 for NBT-NS) for a host responding to many different name queries for which it is not an authoritative source, especially for names that do not exist. Correlate these events to identify a single source IP performing this poisoning behavior. Use frequency analysis and state-tracking to identify hosts exhibiting this behavior."
          },
          "Detection of a network interface entering promiscuous mode on a host that is not an authorized network monitoring appliance or administrative workstation.": {
            "Data": "Windows System Event Log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows System Event Logs for specific Event IDs indicating a network adapter has entered promiscuous mode (e.g., from network drivers or virtualization platforms like Hyper-V). Maintain a whitelist of authorized hosts where this behavior is expected (e.g., network sensor appliances). Alert on any host enabling promiscuous mode that is not on the whitelist. Correlate this event with process creation logs to identify the responsible process."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary gathering network information via network sniffing? (TA0007 - Discovery)": {
      "Indicators": {
        "T1040 - Network Sniffing": {
          "A network signature match for traffic patterns generated by a known passive network discovery or fingerprinting tool.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Deploy and monitor network-based IDS signatures specific to passive discovery tools (e.g., p0f, Xprobe2) within a signature-matching engine like Zeek's or a dedicated IDS. Correlate signature hits with the source host to identify the device performing passive discovery. Prioritize alerts originating from standard user subnets."
          },
          "Execution of network reconnaissance tools or system utilities configured to capture and analyze network discovery protocols (e.g., tcpdump capturing CDP/LLDP traffic).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) with command lines for the execution of known passive discovery tools (`netdiscover`, `p0f`). Alert on the use of `tcpdump` or `tshark` with BPF filters for discovery protocols like `'ether proto 0x2000'` (CDP), `'ether proto 0x88cc'` (LLDP), or routing protocols, especially on hosts that are not network devices or authorized administrative workstations."
          },
          "An endpoint, which is not a network device, receiving a high volume and variety of network infrastructure and broadcast traffic (e.g., CDP, LLDP, OSPF/EIGRP updates, STP BPDUs).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile normal traffic received by endpoints to baseline typical broadcast/multicast traffic. Monitor for non-network-device hosts (e.g., standard user workstations, application servers) receiving traffic typically destined only for routers/switches, such as routing protocol updates (OSPF, EIGRP), HSRP/VRRP heartbeats, or link-layer discovery (CDP, LLDP). Zeek conn.log can show connections to the well-known multicast addresses used by these protocols. Use frequency analysis and maintain a whitelist of authorized hosts (e.g., network monitoring systems) allowed to receive this traffic; alert on all others."
          },
          "Anomalous configuration of cloud network infrastructure, such as creating a traffic mirror session, followed by data transfer to an unknown external location.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the execution of cloud CLI tools (`aws`, `az`, `gcloud`) with commands related to traffic mirroring or flow logging (e.g., `ec2 create-traffic-mirror-session`) via Windows Event ID 4688 command-line logging. Correlate these command executions with subsequent network connections (Zeek conn.log) and file transfers (Zeek files.log) from the same host to untrusted external storage (e.g., unknown S3 buckets, non-corporate IP addresses). Use descriptive statistics to flag unusually large data transfers that follow these configuration changes, and use correlation analysis to link the configuration event to the data transfer."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
