[
  {
    "Is the adversary attempting to discover network connections from compromised systems? (TA0007 - Discovery)": {
      "Indicators": {
        "T1049 - System Network Connections Discovery": {
          "Execution of network connection discovery commands (e.g., netstat, net use, lsof) on endpoints or servers.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify instances where command-line arguments contain network discovery utilities (netstat, net, lsof, who, w). Use descriptive statistics to baseline normal usage of these commands per user/host and flag infrequent or unusual executions, especially by non-standard users or locations."
          },
          "Suspicious activity (API calls, WMI, PowerShell) indicative of network connection discovery.": {
            "Data": "Windows Event ID 4104; Zeek conn.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event logs for PowerShell/WMI activity (e.g., Event ID 4104) potentially querying network information (Get-NetTCPConnection, Get-WmiObject Win32_NetworkConnection). Monitor Zeek conn.log for traffic to/from potential discovery targets. Analyze correlation between suspicious host activity (like WMI/PS calls) and outbound network connections seen in Zeek logs using correlation analysis."
          },
          "Unusual internal network traffic patterns to network devices or infrastructure components potentially indicative of automated discovery.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusual connection patterns originating from compromised hosts targeting network infrastructure IPs (routers, switches, firewalls). Look for connections to common management ports (e.g., SSH 22, Telnet 23, SNMP 161/162, HTTPS 443 for web interfaces) that deviate from baselined administrative traffic (e.g., increased frequency, connections from unusual source hosts/users). Use frequency analysis or time series analysis to identify bursts of connections or consistent connections from non-administrative sources."
          },
          "Execution of commands or tools to enumerate active user sessions or network shares on remote systems.": {
            "Data": "Windows Event ID 4688; Zeek smb_files.log; Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events containing commands like `net session`, `who`, `w`, `net use`. Correlate executions of `net use` with Zeek smb_files.log to see file/share access attempts. Correlate `net session` or similar command executions with Zeek dce_rpc.log for corresponding RPC activity. Use frequency analysis to detect unusual execution frequency or execution by accounts/hosts that do not typically perform such enumeration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]