
[
  {
    "Is the adversary attempting to discover network connections from compromised systems? (TA0007 - Discovery)": {
      "Indicators": {
        "T1049 - System Network Connections Discovery": {
          "Execution of a network discovery tool where the process hash matches a known malicious binary or a dual-use tool frequently used by threat actors.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events, ensuring process hash logging is enabled. Correlate the logged process hashes against a threat intelligence feed of file hashes for known malicious network discovery tools (e.g., specific builds of nmap, custom actor tools) or suspicious dual-use utilities. Alert on any match and investigate the parent process and subsequent activity."
          },
          "Execution of built-in operating system commands to discover local or remote network connections, sessions, configurations, or shares (e.g., `netstat`, `net view`, `net use`, `net session`, `arp -a`, `ipconfig /all`, `lsof`).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Use regular expressions to identify command-line arguments matching a maintained list of common network discovery commands. Establish a baseline of normal execution frequency for these commands by host type (e.g., workstation, server) and user role. Use descriptive statistics and box-plots of command frequency per host to identify outliers and flag executions that are rare for a specific host or user."
          },
          "Use of scripting languages or advanced system interfaces (e.g., PowerShell, WMI) to enumerate network information without running common executables.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 for PowerShell script block content containing cmdlets like `Get-NetTCPConnection`, `Get-NetIPConfiguration`, `Test-NetConnection`, or WMI-based queries using `Get-CimInstance` or `Get-WmiObject` for classes like `Win32_NetworkAdapterConfiguration` or `Win32_NetworkConnection`. Correlate this activity with the parent process (e.g., powershell.exe, wmiprvse.exe) from Event ID 4688 to identify the trigger and context of the discovery."
          },
          "Anomalous patterns of network traffic originating from a single host, such as rapid connections to multiple internal hosts on specific ports (port scanning) or connections to network infrastructure management interfaces from non-administrative sources.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to model baseline traffic patterns. Identify hosts initiating connections to an unusually high number of distinct destination IPs or ports within a short time window, which is indicative of scanning. Use correlation analysis to flag connections from general user workstations to sensitive network device management ports (e.g., SSH, Telnet, SNMP, HTTPS). Apply time series analysis to detect sudden bursts of connection attempts from a host that deviate significantly from its normal behavior."
          },
          "Execution of network discovery commands by an unusual parent process (e.g., a web server, Office application) or as part of a suspicious sequence of commands indicative of post-exploitation activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs to track process lineage. Create a model of normal parent-child process relationships. Flag any instance where a common network discovery command (e.g., `netstat.exe`, `ipconfig.exe`) is spawned by a process that does not typically perform such actions, such as an Office application, web browser, or server daemon. Scrutinize discovery commands that immediately follow other suspicious activities on the same host, such as a file download from an external source or the execution of a script from an unusual directory."
          },
          "A user or system account performing network discovery from multiple different hosts in a short period, or a single host performing discovery using multiple different user accounts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network discovery commands (from Event ID 4688) with user login information (from Event ID 4624). Aggregate discovery activity by user account and by hostname over time. Use frequency analysis to identify a single user account performing discovery from an abnormally high number of distinct hosts. Conversely, identify hosts where discovery commands are being executed under several different user contexts. Such patterns may indicate credential theft and lateral movement for reconnaissance. Use linear regression to test the correlation between a user's lateral movement events and the breadth of their discovery activities."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
