[
  {
    "Is the adversary attempting to discover network services? (TA0007 - Discovery)": {
      "Indicators": {
        "T1046 - Network Service Discovery": {
          "High volume of connections or packets attempting to reach multiple ports/hosts across the network from a single source IP or host.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for source IPs initiating connections to a large number of unique destination IPs and/or unique destination ports within a short time window. Calculate connection frequency and entropy of destination IPs/ports per source IP. Flag sources with high connection volume, low destination IP entropy (connecting to few hosts repeatedly on different ports), or high destination port entropy (connecting to many ports on one/few hosts). Investigate sources flagged by IDS/IPS for port scanning signatures."
          },
          "Execution of network scanning tools or discovery commands or anomalous network traffic patterns generated by processes not typically involved in discovery.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of known network scanning tools (e.g., nmap.exe, masscan.exe, angryip.exe) or command-line utilities used for network enumeration (e.g., 'net view', 'arp -a'). Analyze Zeek dns.log for unusual mDNS queries or other network discovery protocol traffic (e.g., SMB, LLMNR). Analyze Zeek conn.log and Windows Event ID 5156/5157 for connections originating from processes with unusual network behavior profiles using statistical profiling against a baseline."
          },
          "Identification of known vulnerable services or unusual service banners observed during internal network scans.": {
            "Data": "Zeek conn.log; Zeek x509.log; Zeek http.log; Zeek ftp.log; Zeek ssh.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze relevant Zeek logs (conn, x509, http, ftp, ssh, ssl) for connections to common service ports (e.g., SMB 445, RDP 3389, SSH 22, SQL 1433/1434, common web ports). Extract service banners or certificate details where available. Correlate observed services/banners with known vulnerabilities or out-of-date versions. Use frequency analysis to identify services being scanned for disproportionately often compared to their expected presence in the environment. Flag connections targeting known vulnerable service versions."
          },
          "Anomalous or widespread use of discovery protocols (like mDNS/Bonjour) from hosts not typically involved in service advertising or discovery.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for mDNS queries (e.g., QTYPE=ANY, SERVICE=*) and responses, especially those originating from servers or non-standard endpoints. Analyze the volume and pattern of mDNS traffic per host using time series analysis to identify sudden spikes or changes in activity level. Correlate with Zeek conn.log to see the full session context (source/destination IPs, bytes transferred) of mDNS activity. Establish a baseline of normal mDNS behavior per host/network segment and flag deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]