
[
  {
    "Has the adversary exfiltrated data from the network? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1048.002 - Exfiltration Over Asymmetric Encrypted Non-C2 Protocol": {
          "Outbound encrypted connections to external destinations (IPs, domains, or URLs) known to be associated with data exfiltration or malicious activity.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate destination IP addresses (from Zeek conn.log), DNS query responses (from Zeek dns.log), and Server Name Indication (SNI) fields (from Zeek ssl.log) from all outbound encrypted connections against a high-confidence, frequently updated threat intelligence feed of known malicious hosts, data exfiltration endpoints, or anonymization services. Alert on any matches, prioritizing those with significant outbound data volume (`orig_bytes` in Zeek conn.log)."
          },
          "Outbound encrypted connections with TLS certificate attributes commonly used by malicious tools (e.g., self-signed certs, generic subjects, unusual issuers, short validity periods) that are also associated with significant data transfer.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for outbound connections and flag those with suspicious certificate attributes: `self_signed` field is true, `validation_status` is invalid, generic `subject` fields (e.g., 'localhost', 'example.com'), or `issuer` from an unknown or low-reputation certificate authority. Correlate these flagged connections (by connection UID) with Zeek conn.log to identify any that also exhibit high outbound data volumes (`orig_bytes`). Use frequency analysis on issuer and subject fields across the enterprise to identify rare or outlier certificates that warrant investigation."
          },
          "Anomalously large volume of data transferred outbound over an encrypted, non-C2 protocol (like HTTPS) to a single external destination, especially if the destination is new, rare, or has a low reputation.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each internal host, establish a baseline of typical outbound data volume per protocol and destination category (e.g., sanctioned cloud services versus other web categories). Monitor Zeek conn.log for sessions exceeding this baseline by a significant margin (e.g., >3 standard deviations or above the 95th percentile). Use Zeek dns.log and ssl.log to enrich destination context (domain age, reputation, category). Employ time series analysis on aggregate outbound data per host to spot unusual spikes in exfiltration activity, and use linear regression to detect anomalous trends over time."
          },
          "Highly asymmetric data flow in an encrypted connection, where outbound data volume significantly exceeds inbound, contrary to typical client-server browsing or API interaction patterns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for all outbound encrypted connections. For each connection, calculate the ratio of originator bytes (`orig_bytes`) to responder bytes (`resp_bytes`). Establish a baseline ratio for common traffic types (e.g., web browsing, API calls). Flag connections where the ratio is a significant outlier, suggesting one-way data dumping rather than interactive communication. Use descriptive statistics (mean, median, Inter-Quartile Range) on the ratio for peer groups of hosts to identify anomalous systems."
          },
          "An outbound encrypted connection initiated by a process that does not typically perform network activity, is not a standard browser or client, or is executing from an unusual file path.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate outbound network connections from Zeek conn.log with process creation events (Windows Event ID 4688) on the source endpoint by joining on source IP and timestamp. Create a baseline of processes that normally initiate outbound encrypted traffic (e.g., chrome.exe, outlook.exe, teams.exe). Alert on connections originating from unexpected processes (e.g., powershell.exe, regsvr32.exe, or any process running from C:\\Windows\\Temp\\ or C:\\Users\\*\\AppData\\Local\\Temp\\). Use correlation analysis to link the process command line with the destination IP and data volume of the connection."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
