
[
  {
    "Is the adversary exfiltrating data from the network over unencrypted non-C2 protocols? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1048.003 - Exfiltration Over Unencrypted Non-C2 Protocol": {
          "Outbound connections on unencrypted protocols (e.g., FTP, HTTP) to external IP addresses or domains known to be used as data exfiltration drop zones by threat actors.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate destination IP addresses from Zeek conn.log (on ports like 21, 80) and domain names from Zeek dns.log and Zeek http.log (Host header) against a high-confidence, frequently updated threat intelligence feed of known exfiltration drop zones or malicious hosting providers. Generate a high-priority alert for any matches and investigate the source host and data transferred."
          },
          "Execution of command-line utilities or scripts with syntax patterns known to be used by threat actors for data exfiltration via unencrypted protocols.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments that match specific, known malicious patterns for data transfer. Use regular expressions to detect tool usage such as `bitsadmin /transfer <job> http://<...>`,`certutil -urlcache -f http://...`, or `powershell ... (New-Object System.Net.WebClient).UploadFile(...)`. Maintain a library of these patterns based on threat intelligence. Correlate positive detections with network logs to confirm exfiltration."
          },
          "Anomalously large outbound data transfers over unencrypted protocols (e.g., HTTP, FTP) from an internal host, deviating significantly from its established baseline.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each internal host, establish a baseline of outbound data volume (e.g., total bytes, average bytes/connection) for common unencrypted protocols like HTTP and FTP. Use historical Zeek conn.log data, segmenting baselines by protocol, destination, and time-of-day. Use time series analysis and statistical methods like the Inter-Quartile Range (IQR) to detect significant positive deviations from the baseline. Create a box-plot of daily outbound traffic per host to visually identify outliers."
          },
          "Presence of high-entropy data or unusual content types within unencrypted protocol traffic, suggesting the transmission of encoded or compressed data not native to the protocol.": {
            "Data": "Zeek http.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan the content of unencrypted traffic from Zeek logs (e.g., HTTP POST bodies, FTP file transfers). Calculate the Shannon entropy of the data in transit; flag sessions with unusually high entropy that may indicate encrypted or compressed archive files (like .zip, .rar, .7z) being sent as plain text. Look for large, contiguous blocks of base64-encoded text or other character set anomalies in fields not expected to contain them. Use linear regression to see if entropy correlates with connection size, looking for deviations."
          },
          "A sequence of events showing internal file staging followed by network connections from an unexpected process to an external destination over an unencrypted protocol.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for a sequence of activities on a host. First, look for file archival activity using Windows Event ID 4688 (e.g., `rar.exe a ...`, `7z.exe a ...`). Second, correlate this with a subsequent network connection (Windows Event ID 5156, Zeek conn.log) from the same host to an external destination over an unencrypted port. Third, prioritize alerts where the connecting process is not a standard browser or mail client (e.g., `powershell.exe`, `svchost.exe`, or a custom binary). Use correlation analysis on host, timestamp, and process IDs to link these discrete events into a single high-fidelity alert."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
