[
  {
    "Has the adversary elevated privileges using VDSO hijacking? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.014 - VDSO Hijacking": {
          "Detection of unusual or suspicious process activity involving low-level system calls like ptrace or mmap that can facilitate code injection and redirection.": {
            "Data": "Linux Auditd Logs, Process Monitoring Data",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure Linux Auditd to log specific syscalls (e.g., ptrace, mmap). Monitor logs for these syscalls being invoked by processes not typically associated with such activity. Analyze event volume over time using time series analysis to detect unusual spikes or patterns."
          },
          "Legitimate processes exhibiting behavior indicative of privilege escalation (e.g., accessing restricted files, executing commands with higher privileges) after potential VDSO hijacking.": {
            "Data": "Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Linux Auditd logs for legitimate processes (e.g., system daemons, common user applications) attempting to access sensitive files, modify system configuration, or execute commands typically associated with elevated privileges. Establish baseline process behavior using descriptive statistics and correlation analysis on syscall sequences and resource access patterns to identify deviations."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using VDSO hijacking? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.014 - VDSO Hijacking": {
          "Detection of low-level system calls (ptrace, mmap) used by processes in a manner consistent with attempting to hook libraries or redirect execution for evasion.": {
            "Data": "Linux Auditd Logs, Process Monitoring Data",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Linux Auditd logs for patterns of syscalls (ptrace, mmap) that might indicate library hooking or code injection attempts in processes often targeted for defense evasion (e.g., security agents, critical system processes). Use frequency analysis or entropy measures on syscall sequences to spot anomalies."
          },
          "Legitimate processes making unexpected outbound network connections or modifying critical system files, potentially to facilitate C2 or hide activity after VDSO hijacking.": {
            "Data": "Zeek conn.log, Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Linux Auditd logs for legitimate processes initiating unexpected outbound network connections, especially to rare destination IPs or ports, or modifying system files unrelated to their normal function. Correlate network activity with process ID and analyze connection timing and volume using time series analysis or correlation with threat intelligence feeds."
          }
        }
      }
    }
  }
]