[
  {
    "Has the adversary executed commands using the Windows command shell? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.003 - Windows Command Shell": {
          "Detection of cmd.exe executing with unusual parent processes or suspicious command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for instances of `cmd.exe`. Analyze the parent process ID and command-line arguments. Identify instances where `cmd.exe` is spawned by non-standard parent processes (e.g., office applications, web browsers) or contains suspicious keywords/patterns indicative of malicious activity. Use correlation analysis to link `cmd.exe` execution to preceding events (e.g., remote access, file drops)."
          },
          "Execution of unusual batch files (.bat, .cmd) or creation of new, suspicious batch files on systems where scripting is uncommon.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of `.bat` or `.cmd` files, especially from unusual locations or by uncommon users. Track file creation events (Event ID 4656/4663) for `.bat`/`.cmd` files in suspicious directories (e.g., user temp directories, startup folders). Use descriptive statistics to baseline typical script execution on systems and flag outliers based on location, user, or frequency."
          },
          "Network connections initiated by cmd.exe processes, especially to external or unusual destinations.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 for outbound connections originating from `cmd.exe` on endpoints/servers. Correlate these events with Zeek conn.log to confirm the connections and analyze destination IPs and ports. Filter for connections to external IP addresses or non-standard ports. Cross-reference destination IPs with threat intelligence feeds. Use frequency analysis or percentile analysis to identify rare destinations or connection patterns for `cmd.exe` relative to typical system behavior."
          },
          "Specific command-line arguments used with cmd.exe that are indicative of reconnaissance, data staging, or malicious utility execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command-line arguments captured in Windows Event ID 4688 for `cmd.exe`. Develop and apply signatures, regex patterns, or rule sets to identify suspicious commands frequently used in post-exploitation, such as `whoami`, `ipconfig`, `net`, `tasklist`, commands involving data exfiltration (e.g., `copy`, `xcopy`, `bitsadmin`), or execution of encoded/obfuscated scripts. Use descriptive statistics to identify commands with abnormally high frequency or appearing on systems where they are not typically used."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]