
[
  {
    "Is the adversary executing malicious code using scheduled tasks or jobs? (TA0002 - Execution)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "A process launched by the Task Scheduler service makes a network connection to a known malicious IP address, domain, or URL.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate processes launched by the Task Scheduler (parent process `taskeng.exe` or `svchost.exe` with netsvcs group, identified from Windows Event ID 4688) with their subsequent network connections identified in Zeek conn.log. Inner join the destination IPs/domains of these connections with a high-confidence, continuously updated threat intelligence feed. Alert on any matches and investigate the associated task."
          },
          "A scheduled task is created using command-line arguments or XML content containing patterns known to be associated with specific malware, offensive security tools, or living-off-the-land techniques.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for `schtasks.exe` and `at.exe`. Analyze command lines for suspicious argument patterns (e.g., `/create /sc onlogon /tr \"C:\\Users\\Public\\...\"`, use of `/V1` for bypasses). Monitor task creation events (Windows Event ID 4698) and use regular expression matching to scan the task's XML content for known malicious patterns, such as commands that download and execute scripts from remote locations using `powershell -enc`, `mshta.exe`, or `rundll32.exe`."
          },
          "A newly created scheduled task executes a binary from a non-standard, user-writable location (e.g., %APPDATA%, %TEMP%, C:\\Users\\Public) or a process that is statistically rare for the Task Scheduler to launch.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor task creation (Windows Event ID 4698) and execution (Windows Event ID 4688). Establish a baseline of common executable paths and process names launched by the Task Scheduler across the environment. Flag any task that executes a binary from a user-writable directory (e.g., `\\Users\\`, `\\AppData\\`, `\\Temp\\`, `\\ProgramData\\`) or a process name that is a low-frequency outlier compared to the historical baseline. Use frequency analysis and descriptive statistics on process paths to detect these anomalies."
          },
          "A scheduled task is created and executed within a very short timeframe and is subsequently deleted, indicating a 'one-shot' execution pattern often used to evade detection.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate task creation events (Windows Event ID 4698) with task deletion events (Windows Event ID 4702) for the same task name on the same host. Calculate the time delta between creation and deletion. Flag tasks that exist for an unusually short duration (e.g., less than 5 minutes), as this is a common pattern for adversaries using tasks for immediate execution rather than persistence. Use descriptive statistics (mean, median, standard deviation) on task lifetimes to identify significant outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary maintaining persistence using scheduled tasks or jobs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "A persistent scheduled task is configured to execute a command containing a file path, domain, or IP address that matches a known malicious indicator.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor task creation/modification events (Windows Event ID 4698). Extract the command/action from the task's XML data. Use regular expressions to parse file paths, domains, and IP addresses from the command string. Compare these extracted artifacts against CTI feeds of known malicious file paths, C2 domains/IPs, and executables. Alert on any matches found in tasks with persistence triggers (e.g., recurring, logon, startup)."
          },
          "A scheduled task is created with a common persistence trigger (e.g., At Logon, At Startup, hourly/daily recurrence) that uses a known living-off-the-land binary (LOLBin) to execute a script or download a payload.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor task creation events (Windows Event ID 4698). Filter for tasks with persistence-related triggers (`<LogonTrigger>`, `<BootTrigger>`, or frequent `<TimeTrigger>`). Within this set, search the task's command for known LOLBins (e.g., `powershell.exe`, `mshta.exe`, `cscript.exe`, `rundll32.exe`, `certutil.exe`) followed by arguments indicating script execution or remote file download. Maintain and apply a pattern library of common malicious LOLBin usage for persistence."
          },
          "A new persistent scheduled task is created that is an outlier compared to the established baseline of legitimate tasks on the endpoint or across the enterprise based on its name, path, or trigger.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Develop a baseline of legitimate scheduled tasks (names, executable paths, triggers, actions) for different host roles. Monitor for the creation of new persistent tasks (Windows Event ID 4698) and compare their properties against this baseline. Flag tasks with names, executable paths, or trigger combinations that are statistically rare or have high string entropy (indicating randomization/obfuscation). Use frequency analysis, Inter-Quartile Range, and clustering to identify anomalous tasks that deviate from normal administrative and software-related activities."
          },
          "A scheduled task is modified to hide its presence, such as by removing its security descriptor or being renamed to masquerade as a legitimate system task.": {
            "Data": "Windows Event ID 4701; Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for task modification events (Windows Event ID 4701 - Task Updated). Look for a pattern where a task is disabled (Event ID 4699), its security descriptor in the XML is set to null or `D:(A;;FA;;;BA)`, and then it is re-enabled. Correlate these events by task name and investigate tasks that become unreadable by standard tools after modification. Also, use pattern matching to look for task names that closely mimic legitimate Windows tasks but have a different path or action, a common masquerading behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary escalating privileges using scheduled tasks or jobs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "A scheduled task is configured to run with high privileges and executes a file whose hash is associated with a known privilege escalation exploit tool or malware.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for tasks created (Windows Event ID 4698) or executed (Windows Event ID 4688) with high privileges (e.g., RunAs `SYSTEM`). Extract the file path of the executable from the task action or process command line. If possible via endpoint agent, hash the file and compare it against a threat intelligence database of known malicious tool hashes, specifically those related to privilege escalation. Alert on any matches."
          },
          "A scheduled task is created or modified to run with the highest available privileges and executes a command pattern known to be used for UAC bypass.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation of `schtasks.exe` (Windows Event ID 4688) for the command-line pattern `/create ... /RL HIGHEST`. Also monitor task creation events (Windows Event ID 4698) for XML containing `<HighestAvailable>true</HighestAvailable>`. Correlate this with a task action that calls a known UAC bypass vector (e.g., hijacking `fodhelper.exe`, `eventvwr.exe`, or other auto-elevating processes). Maintain a list of these UAC bypass command patterns for matching."
          },
          "A user account with standard privileges creates or modifies a scheduled task to run with the credentials of a higher-privileged account (e.g., SYSTEM, Administrator).": {
            "Data": "Windows Event ID 4698; Windows Event ID 4701",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor scheduled task creation (Windows Event ID 4698) and update (Windows Event ID 4701) events. For each event, compare the creating user (`SubjectUserName`) with the user context the task is configured to run as (`Task-Xml-Principals-UserId`). Alert immediately when a non-administrative user creates a task that will run as `SYSTEM`, `NT AUTHORITY\\SYSTEM`, `Administrator`, or another privileged account. This is a high-fidelity indicator of a privilege escalation attempt."
          },
          "A temporary scheduled task is created with high privileges to execute a single, immediate command and is then deleted, often following the compromise of a user-level process.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate a sequence of events: 1) A suspicious process creation (Windows Event ID 4688) running under a standard user account. 2) A task creation (Windows Event ID 4698) initiated by that user's logon session, but configured to run as SYSTEM. 3) The immediate deletion of that task (Windows Event ID 4702). Use correlation analysis on `SubjectLogonId` and timestamps to link the initial process to the task creation. A short time delta between task creation and deletion (< 1 minute) is a strong behavioral indicator of this technique."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
