[
  {
    "Has the adversary escalated privileges using PE injection? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.002 - Portable Executable Injection": {
          "Unusual process creation or modification activity associated with high-privilege processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creation or modification by/of high-privilege processes (e.g., SYSTEM user). Use correlation analysis to identify sequences of events that might indicate injection setup (e.g., permissions changes followed by process creation). Profile typical process activity for these high-privilege processes using descriptive statistics on child processes and command lines, flagging deviations."
          },
          "A high-privilege process initiating network connections uncharacteristic of its normal function.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections where the originating process (identified via correlation with Windows Event ID 4688 based on timestamp/host) is a high-privilege process. Use time series analysis or statistical profiling to identify network activity patterns for these processes that deviate from baselines. Investigate connections to unusual ports or external destinations."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary using PE injection to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.002 - Portable Executable Injection": {
          "Unusual process creation or modification activity targeting a common, typically non-interactive process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for unusual parent-child relationships where a process is creating or modifying a typically benign, non-interactive process (e.g., svchost.exe, explorer.exe). Use frequency analysis to identify rare or unexpected parent processes for these common target processes. Investigate processes attempting to launch threads or modify memory in these target processes based on event details."
          },
          "A typically benign process initiating network connections to suspicious destinations or creating suspicious child processes.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 4688. Correlate network connections with the process name/path. Identify connections originating from typically benign processes (e.g., explorer.exe, svchost.exe) connecting to known malicious IPs (from threat intel). Identify suspicious child processes created by typically benign processes (via 4688) that have low prevalence or suspicious command lines. Use correlation analysis to link process creation events with subsequent network activity."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]