
[
  {
    "Has the adversary achieved privilege escalation using process memory injection? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.009 - Proc Memory": {
          "A process targeted by a suspicious remote thread or memory access event makes network connections to known malicious C2 infrastructure.": {
            "Data": "Sysmon Event ID 8; Sysmon Event ID 10; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify potential process injection events via Sysmon Event ID 8 (CreateRemoteThread) or Sysmon Event ID 10 (ProcessAccess) targeting high-privilege processes. Correlate the timestamp and host of these events with network connection logs (Zeek conn.log). Inner join destination IP addresses from these connections with a high-confidence threat intelligence feed of known C2 servers. Alert on any matches."
          },
          "A non-system process creates a remote thread in a high-privilege system process (e.g., lsass.exe, services.exe), following a known injection pattern.": {
            "Data": "Sysmon Event ID 8; Sysmon Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for a sequence of Sysmon events: Event ID 10 (ProcessAccess) from a source process to a high-privilege target process (e.g., lsass.exe, services.exe, winlogon.exe), followed closely in time by Event ID 8 (CreateRemoteThread) between the same source and target. Maintain a list of known benign process pairs and alert on any sequence not on this list, especially when the source is a non-system binary or script interpreter."
          },
          "An unusual process (e.g., an Office application, browser, or non-system binary) is observed creating a remote thread in another process, especially a high-privilege system process.": {
            "Data": "Sysmon Event ID 8",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 8 (CreateRemoteThread). Establish a baseline of normal remote thread creation relationships (source process -> target process) across the environment. Use frequency analysis to identify statistically rare or anomalous pairings. Calculate the entropy of source processes creating threads in critical system targets; a sudden increase in entropy may indicate diverse injection techniques. Prioritize alerts where the source process is from a user-writable path or is an application not expected to perform this action (e.g., WINWORD.EXE creating a thread in services.exe)."
          },
          "A process running with high privileges, potentially after being compromised via injection, spawns suspicious child processes or initiates anomalous network activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4672; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify processes running with high privileges using Windows Event ID 4672 (Special privileges assigned to new logon) or by name (e.g., lsass.exe). Monitor their child processes using Windows Event ID 4688. Flag the spawning of unexpected children (e.g., cmd.exe, powershell.exe, whoami.exe). Correlate the host with Zeek conn.log to detect network connections to rare destinations or using unusual ports/protocols for that system process. Use correlation analysis to link the suspicious process creation and network events."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using process memory injection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.009 - Proc Memory": {
          "A common, trusted Windows process (e.g., explorer.exe, svchost.exe), after being targeted by a remote thread, makes outbound connections to known malicious C2 IPs or domains.": {
            "Data": "Sysmon Event ID 8; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify instances of remote thread creation (Sysmon Event ID 8) where the target process is a common, trusted binary (e.g., svchost.exe, explorer.exe, notepad.exe, chrome.exe). Correlate these events by host and timestamp with subsequent outbound network connections in Zeek conn.log and DNS requests in Zeek dns.log. Inner join the destination IPs and queried domains with a CTI feed of known malicious infrastructure. Alert on matches."
          },
          "A process creates a remote thread into a legitimate, network-capable process, where the source-target relationship is not typical or whitelisted, indicating a code injection attempt for masquerading.": {
            "Data": "Sysmon Event ID 8; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 8 (CreateRemoteThread) events. Maintain a baseline or explicit allow-list of legitimate source->target process pairs for remote thread creation. Alert on any observed pairs not on the list, particularly when the target is a browser or common utility and the source is a non-standard application or script host (e.g., a process running from a temp directory creating a thread in chrome.exe). Use parent-child process analysis (Event ID 4688) to provide context for the source process's origin."
          },
          "A legitimate process, after being the target of a suspicious process access or remote thread creation event, initiates network traffic inconsistent with its established baseline.": {
            "Data": "Sysmon Event ID 8; Sysmon Event ID 10; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify potential injection triggers using Sysmon Event ID 8 (CreateRemoteThread) or 10 (ProcessAccess) targeting legitimate applications. For the hosts where these events occur, analyze the subsequent network behavior of the host using Zeek conn.log. Compare this traffic against a pre-computed baseline of that host's normal network behavior (e.g., protocols, data volumes, connection frequency). Use time series analysis and statistical methods like IQR or Z-scores to detect significant anomalies in data volume, connection frequency, or destination rarity that occur shortly after a potential injection event."
          },
          "A legitimate process spawns an unusual child process (e.g., cmd.exe, powershell.exe) which is uncharacteristic for the parent, especially following a potential injection event.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 8",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Sysmon Event ID 8 (CreateRemoteThread) events with subsequent Windows Event ID 4688 (Process Creation) events on the same host. Focus on cases where the process that was the target of the remote thread then becomes a parent process. Establish a baseline of normal parent-child relationships and alert when the potentially compromised parent spawns an anomalous child (e.g., explorer.exe spawning powershell.exe). Use frequency analysis and correlation on parent-child pairs to identify rare occurrences."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
