[
  {
    "Is the adversary executing commands and scripts on target systems? (TA0002 - Execution)": {
      "Indicators": {
        "T1059 - Command and Scripting Interpreter": {
          "Execution of command/script interpreters with unusual or suspicious command-line arguments or parent-child relationships.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs. Filter for executions of known command/script interpreters (cmd.exe, powershell.exe, python.exe, cscript.exe, wscript.exe). Analyze command-line arguments for suspicious keywords, encoded commands, or long/obfuscated strings. Identify unusual parent-child process relationships (e.g., Office applications spawning cmd/powershell). Use frequency analysis to identify rare or never-before-seen command lines for these interpreters."
          },
          "Creation or modification of script files in unusual locations followed by their execution.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 for file writes/modifications of script file extensions (.ps1, .bat, .cmd, .py, .vbs, .js) in unusual directories (e.g., %TEMP%, user profile directories). Correlate these write events with subsequent Windows Event ID 4688 showing execution of the created script file. Use time series analysis or correlation to detect clustered file write and execution events within short periods."
          },
          "Execution of command/script interpreters originating from remote access sessions or indicated by suspicious network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 showing command/script interpreter execution with Windows Event ID 4624 indicating a remote logon (Type 3 - Network, or Type 10 - RemoteInteractive) from the same source and time. Analyze Zeek conn.log for connections from remote IPs to standard management ports (e.g., RDP 3389, WinRM 5985/5986, SSH 22) followed by process execution (Event ID 4688) on the target host originating from the remote session. Use correlation analysis to identify process executions linked to remote network sessions."
          },
          "Suspicious outgoing network connections initiated by command/script interpreter processes or command-line arguments.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of command/script interpreters with command-line arguments that contain network utility commands (e.g., `net use`, `curl`, `wget`, `Invoke-WebRequest`, `nslookup`, `ipconfig /all`). Correlate these events with outgoing network connections logged via Windows Event ID 5156 or Zeek conn.log originating from the process specified in Event ID 4688. Use descriptive statistics (e.g., frequency of destination IPs, ports) to identify rare or unusual network connections initiated by these processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]