[
  {
    "Has the adversary escalated privileges using ptrace system calls? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.008 - Ptrace System Calls": {
          "Detection of a process exhibiting unusual behavior (e.g., unexpected process creation, file modification) that could indicate injection, originating from a potentially compromised user or parent process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes creating child processes using Windows Event ID 4688. Analyze parent-child process relationships. Use frequency analysis or statistical scoring to identify rare or anomalous parent-child process combinations that could indicate injection."
          },
          "A process exhibiting behavior inconsistent with its normal function after potential injection, specifically accessing files or creating processes that it typically does not.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for specific processes known to be targeted by injection. Analyze command-line arguments or spawned processes initiated by these targeted processes for deviations from their normal behavior using behavioral baselines and statistical scoring."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using ptrace system calls? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.008 - Ptrace System Calls": {
          "Detection of a process commonly targeted by injection techniques (e.g., system processes, security agents) exhibiting unusual behavior or crashes.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4689 (Process Termination) for unexpected termination of critical system or security processes. Correlate terminations with preceding unusual activity captured by Windows Event ID 4688 from those processes."
          },
          "A process initiating suspicious network connections or accessing sensitive files, where this activity is outside its baseline behavior and potentially indicates code injection.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections initiated by processes identified as potentially injected via analysis of Windows Event IDs. Use correlation analysis to link unusual network activity to specific process IDs or user sessions observed in host logs. Use time series analysis to detect spikes or deviations in network traffic volume or destination ports from these processes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]