[
  {
    "Has the adversary escalated privileges using process injection via APCs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.004 - Asynchronous Procedure Call": {
          "Process access events indicating attempts to open or modify threads in unexpected processes.": {
            "Data": "Windows Event ID 4690; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4690 (Handle Closed), 4656 (Object Open), 4663 (Object Access) for process access attempts. Filter events where the source process is unexpected or the target process/thread is commonly injected (e.g., svchost.exe, explorer.exe). Identify access rights indicating thread or process modification (e.g., THREAD_SUSPEND_RESUME, PROCESS_VM_WRITE). Calculate frequency of such events per source process/user and flag statistically rare occurrences using frequency analysis or outlier detection."
          },
          "Unusual child process creation or execution originating from a process known to be a common injection target (e.g., svchost.exe, explorer.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Filter for common target processes (e.g., svchost.exe, explorer.exe) spawning unusual child processes (e.g., cmd.exe, powershell.exe, executable from temp directory). Use descriptive statistics to baseline child process activity for these parent processes and identify deviations or outlier child processes based on name, path, or command line arguments."
          },
          "Unusual read/write access to sensitive files or registry keys by a process known to be a common injection target (e.g., svchost.exe, explorer.exe).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) for read or write access attempts to sensitive files (e.g., credential stores, configuration files) or registry keys by processes like svchost.exe or explorer.exe that do not typically perform such actions as part of their standard function. Define 'sensitive' based on asset context. Use frequency analysis or anomaly detection on access patterns (file paths, registry keys, access types, frequency) for these processes to identify deviations from their normal behavior."
          },
          "Initiation of process-to-process communication or handles opened by a process known to be a common injection target (e.g., svchost.exe, explorer.exe) to other processes or resources, inconsistent with its normal function.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (Object Open) and 4663 (Object Access) for attempts by common injection target processes (svchost.exe, explorer.exe) to open handles to other process objects (type 'Process', 'Thread') or other system resources. Filter for access rights indicating interaction or modification capabilities (e.g., PROCESS_CREATE_THREAD, PROCESS_VM_WRITE, DUPLICATE_HANDLE). Use baseline analysis (descriptive statistics) to identify access patterns that are statistically rare for specific instances of these processes, potentially using correlation analysis on access types and target objects."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using process injection via APCs? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.004 - Asynchronous Procedure Call": {
          "Attempts to access or modify memory/threads in running processes from unusual sources.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for object access events targeting process objects (type 'Process') with modification/write access permissions (e.g., PROCESS_VM_WRITE). Filter for access originating from processes not typically involved in debugging or process management (e.g., not standard system tools). Calculate the frequency of such events and use outlier detection methods to spot suspicious activity from unusual source processes."
          },
          "Outbound network connections initiated by a process that normally should not make network connections, or connections to suspicious remote endpoints.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation, including command line and PID) with Zeek conn.log (using PID/timestamp correlation where possible). Identify network connections initiated by processes (via PID/timestamp correlation) that are known injection targets (svchost.exe, explorer.exe) or are not expected to make outbound network connections based on their normal function. Analyze destination IPs/ports against threat intelligence feeds or identify statistically unusual destinations/traffic volumes using frequency analysis or entropy measures on destination IPs."
          },
          "Access attempts by processes running from temporary directories, unsigned binaries, or unusual file paths to open handles with modification rights to common injection target processes.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (Object Open) and 4663 (Object Access) for process access attempts with modification rights targeting processes like svchost.exe or explorer.exe. Correlate the accessing Process ID with Windows Event ID 4688 logs to determine the source process's path, command line, and signing status. Flag access attempts originating from temporary directories, unsigned executables, or paths known to host malware. Calculate frequency of access attempts by source path/signature status and identify rare or unusual sources using frequency analysis."
          },
          "Unusual command line patterns, loaded modules (if available), or resource access from a process known to be a common injection target (e.g., svchost.exe, explorer.exe).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for command line arguments of processes like svchost.exe or explorer.exe that deviate significantly from known baselines. Monitor Windows Event ID 4663 for unusual file or registry access patterns from these processes. Use baseline analysis (descriptive statistics) on command lines and accessed objects to identify statistically rare patterns or outliers indicative of injected code execution."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]