[
  {
    "Has the adversary executed code using scheduled tasks? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.005 - Scheduled Task": {
          "Suspicious process execution originating from scheduled task processes (svchost.exe or taskeng.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 where the ParentProcessName is 'svchost.exe' or 'taskeng.exe'. Identify child processes that are unusual or malicious (e.g., cmd.exe, powershell.exe, specific malware names) and are not correlated with legitimate scheduled task executions. Use correlation analysis to link parent/child processes and identify outliers."
          },
          "Scheduled task creation or modification events that do not correlate with known system activity or legitimate software.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4702, Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698, 4702, 4699. Establish a baseline of legitimate scheduled task activity (creation, update, deletion) based on known software installations, patch cycles, and administrative actions. Use statistical methods (e.g., frequency analysis, anomaly detection) to flag tasks created/modified/deleted outside of these baselines, especially those with suspicious names or parameters."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary maintaining persistence using scheduled tasks? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.005 - Scheduled Task": {
          "Rapid creation and subsequent deletion of scheduled tasks.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of Windows Event ID 4698 (created) followed quickly by Event ID 4699 (deleted) for the same task name. Flag instances where the time difference is unusually short, suggesting temporary execution rather than persistent scheduling."
          },
          "Scheduled task creation initiated via WMI or PowerShell cmdlets from unusual sources.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for powershell.exe or wmic.exe as ProcessName. Look for command lines that include 'New-ScheduledTask', 'Register-ScheduledTask', 'Invoke-CimMethod' targeting scheduled tasks, or 'wmic ... ScheduledJobs'. Correlate with Windows Event ID 4104 (PowerShell Script Block) for detailed command analysis. Identify suspicious source processes or users initiating these commands."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary elevated privileges using scheduled tasks? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053.005 - Scheduled Task": {
          "Scheduled tasks configured to run under elevated privileges (e.g., SYSTEM) executing suspicious commands.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698. Identify tasks created with the 'run as' user set to SYSTEM or other high-privilege accounts. Correlate these task creation events with subsequent process execution events (Windows Event ID 4688) where the process is launched by svchost.exe/taskeng.exe under the SYSTEM context and the command line is suspicious."
          },
          "Anomalous process execution or file modifications occurring at scheduled intervals without corresponding scheduled task creation/execution events in standard logs.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4698, Windows Event ID 4702, Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes executing at periodic intervals that cannot be attributed to known scheduled tasks visible in Event ID 4698 or standard task enumerations. Use time series analysis or periodicity detection to identify the recurrence pattern and investigate the source and command line of the executing process."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]