[
  {
    "Is the adversary executing malicious code using scheduled tasks or jobs? (TA0002 - Execution)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "Scheduled task executing an unusual or outlier process.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched by the Task Scheduler service (taskeng.exe, svchost.exe w/ /k netsvcs). Identify outlier process names or command-line arguments using frequency analysis or comparing against a baseline of historical process executions. Correlate with Windows Event ID 4698 to identify the originating task."
          },
          "Scheduled task executed remotely on an endpoint.": {
            "Data": "Windows Event ID 4688; Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations on endpoints initiated by remote Task Scheduler commands. Analyze Zeek dce_rpc.log for suspicious remote scheduled task creation/execution activity, filtering for task-related UUIDs (e.g., schtasks UUID). Correlate remote RPC activity with process creation events on the target host using correlation analysis based on timestamps, involved hosts, and user accounts."
          },
          "Command-line invocation of scheduling utilities (e.g., schtasks.exe) with suspicious parameters (e.g., hidden window, specific runas user, unusual path).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `schtasks.exe` process creations. Analyze command-line parameters for the presence of suspicious arguments like `/create`, `/run`, `/ru SYSTEM`, `/tn`, `/tr`, `/sc ONCE`, `/RL HIGHEST`, `/V1`, `/XML`, unusual paths for the program (`/tr` argument), or hidden window flags. Use pattern matching and frequency analysis to identify unusual command-line structures or values."
          },
          "Network connections to unusual or malicious destinations originating from a process launched by the Task Scheduler service.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events where `ParentProcessName` is `taskeng.exe` or `svchost.exe` (with task scheduler context) with subsequent Windows Event ID 5156 or Zeek conn.log events showing new network connections originating from the child process. Compare destination IPs/domains against threat intelligence feeds using inner join. Use correlation analysis based on process ID, timestamp, and network activity details."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using scheduled tasks or jobs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "Creation or modification of a scheduled task that does not correlate with known system/software activity.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4701; Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698, 4701, 4702 for scheduled task creation, modification, and enablement events. Compare task names, actions, and triggers against a whitelist or expected patterns derived from historical data using baseline analysis. Flag tasks that do not correlate with recent software installations, patches, or documented system administration using correlation analysis with change management logs (if available)."
          },
          "Scheduled task configured to run at system startup or on a frequent, recurring basis with a suspicious command.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Windows Event ID 4698 events for scheduled tasks configured with triggers for system startup, logon, or frequent time intervals. Analyze the 'Command' field within these events for suspicious executables or scripts using entropy measures to detect obfuscation or unusual strings. Use frequency analysis on task triggers to identify tasks scheduled with unusually high frequency."
          },
          "Scheduled tasks configured to run at user logon or targeting specific user profiles, especially if associated with a high-privilege account or executing a suspicious payload.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 for task creation/modification events. Analyze the 'Trigger' field for 'At logon' or 'By user' triggers. Examine the 'RunAs User' field in conjunction with the 'Command' field for suspicious combinations (e.g., SYSTEM user running unusual command at standard user logon, or suspicious command detected via entropy). Use frequency analysis to identify users who suddenly have new, unusual logon-triggered tasks."
          },
          "Scheduled tasks created or modified with event-based triggers that do not align with standard administrative tasks.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4701; Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698, 4701, 4702. Analyze the 'Trigger' field for event-based triggers (e.g., specific event IDs, custom XML filters). Compare event triggers against a baseline of expected or known legitimate event-based tasks using pattern matching. Flag tasks with unusual or new event triggers, especially if the associated action or command is suspicious (detected via entropy measures on the command string)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using scheduled tasks or jobs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "Scheduled task configured to run under a high-privilege account context (e.g., SYSTEM, Administrator) with a suspicious command.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4698 events. Examine the 'RunAs User' field to identify tasks configured to run under high-privilege accounts (SYSTEM, Administrator). Analyze the 'Command' field for suspicious activity when a high-privilege user is specified, using entropy measures to detect potentially obfuscated commands or pattern matching for known suspicious commands."
          },
          "Scheduled task created remotely on a target system by a non-administrative account or from an unexpected source.": {
            "Data": "Windows Event ID 4698; Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 events indicating remote task creation ('Source Computer' field). Correlate with Zeek dce_rpc.log to identify the source of the remote call and the originating user account. Investigate remote task creation attempts originating from non-administrative accounts or unexpected source IPs using correlation analysis and frequency analysis of remote task creators."
          },
          "Scheduled task created by a low-privilege account but configured to execute under a high-privilege account (e.g., SYSTEM or Administrator).": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698. Compare the 'Creating User' (SubjectUserName/SubjectDomainName) field with the 'RunAs User' field. Flag events where a task is created by a standard user but configured to run as SYSTEM, Administrator, or another high-privilege account. Use correlation analysis to link creator identity to the execution identity and investigate such privilege setting changes."
          },
          "Scheduled task running with high privileges (SYSTEM, Administrator) executing commands associated with privilege escalation techniques or fetching remote content.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 for tasks running as SYSTEM or Administrator. Analyze the 'Command' field using pattern matching or entropy measures for known privilege escalation tools/commands or commands that fetch remote content (e.g., PowerShell with download/exec flags, certutil, bitsadmin). Correlate with subsequent Windows Event ID 4688 (Process Creation) and Windows Event ID 5156/Zeek conn.log (Network Connection) to confirm execution and network activity. Use correlation analysis to link task execution to suspicious follow-on activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]