[
  {
    "Is the adversary executing malicious code using scheduled tasks or jobs? (TA0002 - Execution)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "Scheduled task executing an unusual or outlier process.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched by the Task Scheduler service (taskeng.exe, svchost.exe w/ /k netsvcs). Identify outlier process names or command-line arguments using frequency analysis or comparing against a baseline of historical process executions. Correlate with Windows Event ID 4698 to identify the originating task."
          },
          "Scheduled task executed remotely on an endpoint.": {
            "Data": "Windows Event ID 4688, Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations on endpoints initiated by remote Task Scheduler commands. Analyze Zeek dce_rpc.log for suspicious remote scheduled task creation/execution activity, filtering for task-related UUIDs. Correlate remote RPC activity with process creation events on the target host using correlation analysis based on timestamps and involved hosts."
          }
        }
      }
    }
  },
  {
    "Is the adversary maintaining persistence using scheduled tasks or jobs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "Creation or modification of a scheduled task that does not correlate with known system/software activity.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4701, Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698, 4701, 4702 for scheduled task creation, modification, and enablement events. Compare task names, actions, and triggers against a whitelist or expected patterns derived from historical data. Flag tasks that do not correlate with recent software installations, patches, or documented system administration using correlation analysis with change management logs."
          },
          "Scheduled task configured to run at system startup or on a frequent, recurring basis with a suspicious command.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Windows Event ID 4698 events for scheduled tasks configured with triggers for system startup, logon, or frequent time intervals. Analyze the 'Command' field within these events for suspicious executables or scripts using entropy measures to detect obfuscation. Use frequency analysis on task triggers to identify tasks scheduled with unusually high frequency."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges using scheduled tasks or jobs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053 - Scheduled Task-Job": {
          "Scheduled task configured to run under a high-privilege account context (e.g., SYSTEM, Administrator) with a suspicious command.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4698 events. Examine the 'RunAs User' field to identify tasks configured to run under high-privilege accounts (SYSTEM, Administrator). Analyze the 'Command' field for suspicious activity when a high-privilege user is specified, using entropy measures to detect potentially obfuscated commands."
          },
          "Scheduled task created remotely on a target system by a non-administrative account or from an unexpected source.": {
            "Data": "Windows Event ID 4698, Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 events indicating remote task creation ('Source Computer' field). Correlate with Zeek dce_rpc.log to identify the source of the remote call. Investigate remote task creation attempts originating from non-administrative accounts or unexpected source IPs using correlation analysis and frequency analysis of remote task creators."
          }
        }
      }
    }
  }
]