[
  {
    "Is the adversary elevating privileges via process injection? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055 - Process Injection": {
          "Detection of suspicious Windows API calls commonly used for process injection.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Windows Event ID 7 (Sysmon), Windows Event ID 8 (Sysmon), Windows Event ID 10 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to process access (4656, 4663, Sysmon 7, 8, 10) on sensitive processes (e.g., svchost.exe, services.exe). Identify sequences of API calls (e.g., VirtualAllocEx, WriteProcessMemory, CreateRemoteThread) that constitute injection patterns. Use correlation analysis between events to link related actions across process IDs and timestamps."
          },
          "Loading of unexpected DLLs into legitimate system processes.": {
            "Data": "Windows Event ID 7 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7 (Sysmon) for ImageLoad events. Identify DLL loads into common system processes (svchost.exe, services.exe, explorer.exe) where the DLL path is not standard or the DLL name is suspicious. Use frequency analysis or set-based comparisons against known good DLL lists per process to identify outliers."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses via process injection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055 - Process Injection": {
          "Creation or connection to named pipes by processes not typically using IPC.": {
            "Data": "Windows Event ID 17 (Sysmon), Windows Event ID 18 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 17 and 18 (Sysmon) for named pipe creation and connection events. Look for named pipe activity by processes that do not typically utilize IPC. Use entropy analysis on named pipe names to detect algorithmically generated or obfuscated names. Correlate named pipe activity with other suspicious events on the host."
          },
          "Anomalous process behavior (e.g., network connections) by a process after suspected injection.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log filtered by source IP addresses of potentially compromised endpoints. Correlate Zeek network events with Windows Event ID 4688 (Process Creation) to identify the process initiating suspicious network connections. Use descriptive statistics to profile normal network connections for common system processes and flag deviations as anomalous behavior indicative of injection or post-compromise activity."
          }
        }
      }
    }
  }
]