[
  {
    "Has the adversary executed commands via the hypervisor CLI? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.012 - Hypervisor CLI": {
          "Execution of hypervisor management command-line tools (e.g., esxcli, vim-cmd) on designated management systems.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs on designated hypervisor management servers/endpoints for execution of known hypervisor CLI tools (e.g., 'esxcli.exe', 'vim-cmd.exe'). Analyze execution frequency (time series analysis) and user context (descriptive statistics) to identify deviations from normal behavior or execution by unauthorized accounts."
          },
          "Execution of unusual or potentially malicious commands using hypervisor CLI tools, indicative of impacting VMs or data.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command line arguments from Windows Event ID 4688 logs for executions of hypervisor CLI tools. Look for arguments related to stopping/starting VMs, modifying storage, or initiating file transfers. Use correlation analysis to identify unusual argument patterns or combinations, and descriptive statistics to flag rare or never-before-seen arguments."
          },
          "Unusual network connections originating from hypervisor management infrastructure.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for network traffic originating from IPs/ports associated with hypervisor management consoles or hypervisor hosts themselves. Identify connections to unusual or external destinations, high volume traffic, or activity outside of scheduled maintenance windows using time series analysis and descriptive statistics. Baseline normal network communication patterns from these sources and flag deviations."
          },
          "Unauthorized or anomalous access to sensitive hypervisor configuration files or credentials on management systems.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Ensure auditing is enabled for read/write/delete access (SACLs) on key hypervisor configuration files, log files, and credential storage locations on designated hypervisor management servers. Monitor Windows Event ID 4663 for access attempts by suspicious accounts or processes. Correlate access events on sensitive files with recent execution of hypervisor CLI tools (Windows Event ID 4688) by the same process or user using correlation analysis within a short time window."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]