[
  {
    "Is the adversary performing process discovery on systems or network devices? (TA0007 - Discovery)": {
      "Indicators": {
        "T1057 - Process Discovery": {
          "Execution of suspicious commands or scripts (tasklist, Get-Process) or unusual API calls related to process enumeration on endpoints/servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creations containing suspicious command-line arguments associated with process enumeration utilities (tasklist, powershell Get-Process, ps) or known adversary tools. Use frequency analysis or clustering to identify rare or unusual command-line patterns executed on multiple systems."
          },
          "Unusual network activity originating from a host, potentially indicative of remote process discovery or interaction with network devices via CLI.": {
            "Data": "Zeek conn.log; Zeek ssh.log",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to or from systems/users where process discovery is suspected. Look for connections to common network device management ports (e.g., SSH, Telnet) followed by unusual data transfer volumes or specific command patterns if logged (e.g., in Zeek ssh.log). Use correlation analysis to link specific host activity with network connections at the same time."
          },
          "High frequency or rapid execution of process listing commands (tasklist, Get-Process, ps) on systems by a single user or process.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command lines for `tasklist`, `Get-Process`, `ps`, `esxcli system process list`, or similar. Group events by host and user. Use time series analysis to identify bursts or unusually high frequency of these commands from a single host or user within a defined period (e.g., 5 minutes). Flag hosts or users exceeding a statistical threshold (e.g., 3 standard deviations above the mean frequency or a fixed count) for investigation."
          },
          "Execution of process enumeration commands on network devices via CLI from unusual source IPs or user accounts.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek ssh.log and telnet.log for commands containing keywords like `show processes`, `ps`, `top`, `esxcli`. Correlate with Zeek conn.log to identify the source IP and user account. Establish a baseline of normal administrative IPs and user accounts that typically perform such commands on network devices. Flag commands executed from unauthorized source IPs or by unauthorized user accounts. Use frequency analysis to identify rapid execution of these commands on multiple devices."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]