[
  {
    "Has the adversary gained access to credentials? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1056.001 - Keylogging": {
          "Suspicious Windows Registry modifications or driver installations commonly associated with keyloggers.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4697, Windows Event ID 7045, Sysmon Event ID 6",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to common keylogger registry locations (e.g., Run keys, AppInit_DLLs). Monitor Windows Event ID 4697 and 7045 for service installations, especially those involving unsigned drivers (Sysmon Event ID 6). Correlate these events with process creation (Windows Event ID 4688) and file creation (Sysmon Event ID 11)."
          },
          "Processes making frequent calls to keylogging-related Windows API functions combined with the creation of new executable files or scripts.": {
            "Data": "Windows Event ID 4688, Sysmon Event ID 11",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) and file creation events (Sysmon Event ID 11) for processes with suspicious names or locations that coincide with the creation of executable files or scripts. Use entropy analysis on new executable files to identify packed or suspicious code, which keyloggers often use, correlating with process activity."
          }
        }
      }
    }
  },
  {
    "Is the adversary collecting sensitive information? (TA0009 - Collection)": {
      "Indicators": {
        "T1056.001 - Keylogging": {
          "Detection of known keylogging software artifacts (files, registry keys, services) or the installation of unsigned/suspicious drivers on endpoints.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4697, Windows Event ID 7045, Sysmon Event ID 1, Sysmon Event ID 6, Sysmon Event ID 11, Sysmon Event ID 12, Sysmon Event ID 13",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Perform scheduled scans for known keylogging file names, registry keys, or mutexes on endpoints. Identify signed/unsigned drivers loaded (Sysmon Event ID 6) and services created (Windows Event ID 4697, 7045). Use correlation analysis across endpoints to identify repeated attempts to install services or modify registry keys associated with keyloggers."
          },
          "Correlation of process activity involving input capture APIs with network connections to external IPs, indicating potential exfiltration of collected keystrokes.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) involving potentially suspicious processes or those identified in other alerts with network connection logs (Zeek conn.log). Identify processes making connections to unusual or external IP addresses, particularly those observed after suspicious process/file creation. Use statistical analysis on connection frequency and volume to identify anomalous network activity from suspect processes."
          }
        }
      }
    }
  }
]