
[
  {
    "Is the adversary attempting to gain credentials using GUI input capture? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1056.002 - GUI Input Capture": {
          "Execution of a process with a file hash matching known credential theft tools that employ GUI mimicry.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for all process creation events. Continuously compare the file hashes of executed processes against a threat intelligence feed or internal repository of known malicious hashes associated with GUI-based credential theft tools (e.g., modules from PowerSploit, Empire, or standalone phishers). Alert on any hash matches."
          },
          "Execution of a scripting interpreter with command-line arguments containing specific keywords or module names used for creating GUI elements for credential prompts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command-line arguments from Windows Event ID 4688 for scripting interpreters (e.g., powershell.exe, cscript.exe, wscript.exe). Use regular expression matching to search for specific, case-insensitive patterns indicative of GUI creation, such as 'System.Windows.Forms', 'Add-Type', 'Show-Dialog', 'Out-GridView -PassThru', or known credential theft function names. Flag command lines containing these patterns, especially when launched by non-interactive processes or unusual parent processes (e.g., WINWORD.EXE)."
          },
          "An unusual parent-child process relationship where a common application (e.g., WINWORD.EXE, OUTLOOK.EXE, AcroRd32.exe) spawns a scripting interpreter.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process lineage using Windows Event ID 4688. Establish a baseline of normal parent-child relationships for common user applications. Flag anomalous chains, such as an Office application, PDF reader, or browser spawning powershell.exe, cmd.exe, or cscript.exe. Use frequency analysis to identify rare parent-child pairs in the environment, as this is a common behavior for macro-based or exploit-based payloads that launch credential phishers."
          },
          "A scripting process execution with a highly obfuscated or unusually long command line, indicative of an attempt to hide malicious code that may create a credential prompt.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For every scripting interpreter process captured in Windows Event ID 4688, calculate the length and character entropy of the command-line arguments. Establish a baseline for normal script execution within the environment. Use statistical methods (e.g., Inter-Quartile Range, Z-score on length) to identify significant outliers. High entropy can indicate encrypted or compressed commands, while extreme length can indicate an embedded script. Prioritize investigation of these outliers as they frequently represent malicious scripts, including those for GUI mimicry."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary collecting sensitive data (credentials) using GUI input capture? (TA0009 - Collection)": {
      "Indicators": {
        "T1056.002 - GUI Input Capture": {
          "Outbound network connection from a host to an IP address, domain, or URI known to be associated with credential exfiltration C2 infrastructure, occurring shortly after a suspected GUI mimicry event.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the timestamp of a suspicious process creation (identified via Windows Event ID 4688 per Credential Access IR detections) with subsequent outbound network connections from the same host. Compare destination IPs (Zeek conn.log), domains (Zeek dns.log), and URIs (Zeek http.log) against a CTI feed of known credential harvesting sites and C2 infrastructure. Alert on any matches occurring within a 5-minute window of the suspicious process execution."
          },
          "An outbound HTTP POST request containing common credential field names in the request body, originating from an unusual process not associated with normal authentication.": {
            "Data": "Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the `request_body` of HTTP POST requests captured in Zeek http.log. Search for key-value pairs that match common credential field names (e.g., 'user', 'pass', 'username', 'password', 'login', 'credential'). Correlate the source IP of these requests back to host process logs (Windows Event ID 4688) to verify if the request originated from an unexpected process (e.g., powershell.exe, rundll32.exe, or a randomly named executable) rather than a legitimate browser or application. Flag any such correlations as likely credential collection."
          },
          "A small, anomalous outbound data transfer over a covert channel (e.g., DNS, ICMP) or an unusual TCP/UDP port, immediately following a suspected GUI mimicry event on a host.": {
            "Data": "Zeek dns.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of typical data transfer sizes and protocols for hosts. After detecting a potential GUI mimicry process (from Windows Event ID 4688), monitor the host's network traffic for anomalous behavior. Use correlation analysis to link the timing of the suspicious process to anomalous network traffic. Use descriptive statistics and IQR to flag small outbound data transfers (<1KB) over non-standard ports (low frequency ports in Zeek conn.log) or via DNS (unusually long query names in Zeek dns.log), as these are common TTPs for exfiltrating small amounts of data like credentials."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
