[
  {
    "Has the adversary elevated privileges using thread execution hijacking? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.003 - Thread Execution Hijacking": {
          "Specific sequences of Windows API calls (e.g., OpenThread, SuspendThread, VirtualAllocEx, WriteProcessMemory, SetThreadContext, ResumeThread) observed in processes not typically associated with such activity.": {
            "Data": "Sysmon Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 10 (ProcessAccess) for TargetImage/SourceImage pairs where a suspicious source process opens a handle with specific access masks (e.g., THREAD_SUSPEND_RESUME, THREAD_SET_CONTEXT, PROCESS_VM_OPERATION, PROCESS_VM_WRITE) on a target process. Analyze sequences of these events occurring within a short time window involving the same source/target process pair. Use statistical analysis (e.g., frequency) to identify rare source/target pairs or access mask combinations."
          },
          "Legitimate processes (e.g., svchost.exe, explorer.exe) exhibiting unusual behavior such as attempting to access sensitive files, establish network connections to external hosts, or modify system configurations after being targeted by suspicious API calls.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event IDs (4688, 4663) and Zeek conn.log originating from processes (e.g., svchost.exe, explorer.exe) that were previously targets of suspicious process access events (Sysmon Event ID 10). Identify network connections or file accesses by these processes that deviate significantly from their historical baseline behavior using descriptive statistics and time series analysis."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using thread execution hijacking? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.003 - Thread Execution Hijacking": {
          "Repeated or rapid use of thread/process manipulation API calls (e.g., CreateRemoteThread, SuspendThread) followed by memory modification calls (e.g., WriteProcessMemory, VirtualAllocEx) by processes often used for injection.": {
            "Data": "Sysmon Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Sysmon Event ID 10 (ProcessAccess) events for common injecting processes or sequences of access masks often used for injection (e.g., WriteProcessMemory followed by ResumeThread). Use frequency analysis to identify source processes that disproportionately perform these actions or combinations of actions."
          },
          "Detection of network traffic or file modifications originating from a seemingly legitimate process where the traffic/modification is inconsistent with the process's normal function or user activity.": {
            "Data": "Zeek conn.log, Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 4663/4688 (if applicable) for activity attributed to known legitimate processes (TargetImage from Sysmon Event ID 10) that matches indicators of malicious activity (e.g., connections to known C2 IPs, access to sensitive data stores). Use correlation analysis to link the unusual activity back to the preceding process access events (Sysmon Event ID 10) on that specific target process."
          }
        }
      }
    }
  }
]