[
  {
    "Has the adversary achieved privilege escalation using process memory injection? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1055.009 - Proc Memory": {
          "A process exhibiting unusual behavior shows a sudden increase in privilege level.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4672",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (Logon Type 5) and 4672 for logons associated with processes or services indicating elevated privileges. Analyze login frequency and patterns, especially for service accounts or SYSTEM, using time series analysis to detect deviations from baseline and identify sudden privilege increases."
          },
          "A new high-privilege process starts from an unexpected parent or location.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify processes running with high privileges (e.g., SYSTEM, Administrator) by correlating with logon events (4624/4672). Use parent-child process correlation analysis to flag high-privilege processes spawned by unexpected parent processes or from unusual directories. Calculate entropy or frequency of parent process names to identify rare spawning events."
          },
          "Elevated user sessions (Logon Type 5) are associated with outbound network connections to suspicious external destinations.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful logons with Logon Type 5 (interactive or service) using Windows Event ID 4624 on servers. Correlate these elevated user sessions with Zeek conn.log entries occurring shortly after logon based on user/host/time context. Cross-reference destination IPs/domains against threat intelligence feeds for known malicious infrastructure. Use correlation analysis to identify statistically unusual pairings of elevated user sessions and suspicious external connections."
          },
          "A process running with unexpectedly high privileges spawns child processes that are rare or suspicious for its typical behavior.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4672",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify processes running with high privileges (e.g., SYSTEM, Administrator) by correlating with logon events (4624/4672). Use parent-child process correlation analysis to identify child processes spawned by these privileged processes. Use frequency analysis or baselining to flag child processes that are statistically rare or never seen before originating from this specific privileged parent process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using process memory injection? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1055.009 - Proc Memory": {
          "Unusual network connections originating from processes not typically expected to make external connections.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, dns.log, and http.log for connections initiated by systems/users likely running the target process (requires correlating host and network logs). Correlate external connections with internal user context if possible. Use correlation analysis to identify processes making connections to suspicious domains/IPs based on threat intelligence feeds. Flag connections to rare or new external destinations using frequency analysis and baselining."
          },
          "A legitimate process spawns unusual or unexpected child processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Analyze parent-child process relationships. Use frequency analysis or baselining to identify legitimate processes spawning child processes that are statistically rare or associated with known malicious activity based on command line arguments or process names."
          },
          "Network traffic originating from a legitimate process exhibits unusual characteristics (e.g., uncommon protocols, high volume to a single destination, unusual timing/duration) compared to its baseline behavior.": {
            "Data": "Zeek conn.log; Zeek protocols (e.g., http.log, dns.log)",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for network traffic originating from IPs/ports associated with internal processes (requires host correlation). Establish baselines for network traffic characteristics (protocol usage, data volume, connection duration, destination frequency) for different internal processes/systems over time using historical data. Use statistical analysis (e.g., IQR, percentile, time series) to identify significant deviations from baseline behavior (e.g., sudden increase in data transfer, use of unexpected ports/protocols) by processes not typically exhibiting such patterns."
          },
          "A legitimate process exhibits a sudden, statistically significant increase in network activity volume or frequency that deviates from its historical baseline.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for network traffic originating from IPs/ports associated with internal processes. Establish baselines for network activity volume (bytes sent/received) and connection frequency for key legitimate processes/systems over time using historical data. Use time series analysis or statistical process control methods (e.g., cumulative sum) to detect sudden, statistically significant increases in network volume or connection frequency that deviate from the established baseline for a given process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]