[
  {
    "Is the adversary executing malicious code using scheduled tasks? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.003 - Cron": {
          "Network connections to suspicious destinations occurring at scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to suspicious destinations. Correlate connection timestamps with known standard Cron schedules and look for connections occurring consistently at non-standard fixed times. Flag source/destination pairs exhibiting recurring connections at specific times."
          },
          "Anomalous network activity patterns (e.g., unusual protocols, bytes sent/received) occurring at scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections occurring at specific times. Calculate descriptive statistics (e.g., bytes sent/received, duration, protocol distribution) for these connections. Compare these statistics against baseline behavior for the source host using time series analysis or IQR to detect anomalies."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary maintaining persistence using scheduled tasks? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.003 - Cron": {
          "Repeated network connections from compromised systems at fixed scheduled intervals.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify compromised hosts. Analyze Zeek conn.log for recurring connections originating from these hosts to any destination at fixed time intervals (e.g., every hour, daily at 3 AM). Use time series analysis or correlation analysis to identify the scheduled pattern."
          },
          "Repeated network connections to C2 infrastructure or internal systems occurring at fixed scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to known C2 IPs or unusual internal destinations. Identify source hosts exhibiting connections to these destinations. Analyze the timestamps of these connections to detect recurring patterns at fixed scheduled times."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges using scheduled tasks? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1053.003 - Cron": {
          "Unusual network activity originating from critical servers exhibiting scheduled patterns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify critical servers. Analyze Zeek conn.log for all outbound connections from these servers. Use time series analysis to identify any connections or patterns of activity occurring consistently at fixed scheduled times that deviate from normal server behavior."
          },
          "Network connections from critical servers to unusual or external destinations at scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify critical servers. Analyze Zeek conn.log for connections originating from these servers to external IPs or unusual internal IPs/ports. Filter for connections occurring at scheduled times. Cross-reference external IPs with threat intelligence feeds."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]