[
  {
    "Is the adversary executing code or scripts on endpoints? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.002 - AppleScript": {
          "Creation of suspicious processes or command-line arguments potentially initiated by scripting activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command-line arguments indicative of scripting languages calling other utilities or executing encoded commands. Identify unusual parent-child process relationships (e.g., common system processes launching interpreters or network tools). Use descriptive statistics and time series analysis to identify abnormal frequency or timing of process creations by specific users or on critical systems."
          },
          "Unusual network connections or data access patterns potentially resulting from script execution.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to unusual or unknown external IP addresses/domains, especially from internal endpoints or servers. Correlate Zeek sessions with Windows Event ID 4688 entries based on timestamp and source IP/host to link network activity to suspicious process creation. Use frequency analysis and entropy measures on destination IPs/ports/domains to identify rare connections potentially used for C2 or exfiltration."
          },
          "Execution of script interpreters (e.g., python.exe, powershell.exe) followed by immediate outbound network connections, especially to unusual destinations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of common script interpreters (e.g., powershell.exe, python.exe, cscript.exe, wscript.exe). Correlate interpreter process creation events with immediate outbound network connections in Zeek conn.log from the same host. Analyze destination IPs/ports for rare occurrences, C2 patterns, or connections to non-standard services. Use correlation analysis to identify frequent pairings of interpreter execution and suspicious outbound connections."
          },
          "Unusual or automated SSH connections initiated from internal hosts to other internal or external systems, potentially involving command execution or data transfer patterns inconsistent with normal user activity.": {
            "Data": "Zeek ssh.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log for connections originating from internal hosts. Filter for connections with unusual command execution within the SSH session (if logged by Zeek/SSH server or client args captured by 4688), connections to uncommon destinations, or connections occurring outside normal business hours. Correlate with Windows Event ID 4688 on the source host if the SSH client was launched via command line. Use descriptive statistics on connection duration and bytes transferred to identify outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]