[
  {
    "Is the adversary executing commands or scripts via Lua? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.011 - Lua": {
          "Execution of the stand-alone Lua interpreter (lua.exe) with suspicious command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Event ID 4688) where the process name is 'lua.exe' or similar Lua interpreter executables. Analyze command-line arguments for suspicious patterns (e.g., long strings, encoded data, connections to external IPs, execution of downloaded files). Use frequency analysis on unique command lines seen over time to identify rare or anomalous usage."
          },
          "Files with a .lua extension being created or executed in unusual directories, or network traffic associated with known Lua-based malware C2.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Event ID 4688) executing '.lua' files, especially in unusual locations (e.g., AppData, Temp). Analyze Zeek conn.log for connections originating from processes identified as Lua interpreters or associated with suspicious Lua scripts, comparing against known malicious C2 IPs using correlation analysis."
          },
          "Lua interpreter process (lua.exe) spawned by an unusual or non-standard parent process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Event ID 4688) for instances where 'lua.exe' is created. Analyze the 'ParentProcessName' field. Establish a baseline of common parent processes for 'lua.exe' in the environment. Flag process creations where the parent process is rare or outside the established baseline using frequency analysis or statistical deviation."
          },
          "Suspicious child processes spawned or outbound network connections initiated by a Lua interpreter process (lua.exe).": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Event ID 4688) where 'ParentProcessName' is 'lua.exe' with subsequent child processes (analyze ChildProcessName and CommandLine for suspicious activity). Correlate 'lua.exe' process execution with outbound network connections (Event ID 5156 or Zeek conn.log from the same host/time) to unusual ports or destinations. Use correlation analysis to link Lua process activity to malicious follow-on actions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]