[
  {
    "Is the adversary attempting to gain access to credentials using API hooking? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1056.004 - Credential API Hooking": {
          "Detection of suspicious API calls associated with installing hooks (e.g., SetWindowsHookEx, SetWinEventHook), indirectly observed through process execution logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Identify processes with executable paths, parent-child relationships, or command lines associated with known hooking tools or techniques. Analyze frequency and timing of such process executions on endpoints/servers using descriptive statistics and time series analysis to detect anomalies."
          },
          "Detection of process memory integrity violations or unusual modifications to the Import Address Table (IAT), indirectly observed through process execution logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Identify processes with executable paths or command lines associated with memory analysis, integrity checking bypass, or code injection tools. Use frequency analysis and correlation analysis (e.g., correlating executions across multiple hosts or with other events) to identify widespread or coordinated attempts."
          },
          "Execution of processes known to perform code injection or memory modification, immediately followed by suspicious network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command lines or executable names matching known code injection or memory modification tools (e.g., rundll32.exe with unusual parameters, specific hacking tools). Correlate these events with Zeek conn.log entries showing new outbound connections from the initiating host occurring within a short time window (e.g., 60 seconds) after the process creation. Use correlation analysis to identify hosts exhibiting this pattern frequently and identify rare destination IPs/ports."
          },
          "Execution of processes from unusual directories or with unusual parent processes, especially if running under high privileges, associated with potential hooking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Identify processes executed from directories not commonly used for legitimate applications (e.g., AppData, temporary folders, Recycle Bin) or with unusual parent processes (e.g., scripting engines launching executables from unusual paths). Establish a baseline of normal process locations and parent-child relationships using frequency analysis and flag significant deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary collecting sensitive data via API hooking? (TA0009 - Collection)": {
      "Indicators": {
        "T1056.004 - Credential API Hooking": {
          "Suspicious API calls (like SetWindowsHookEx) originating from processes not typically involved in system monitoring or legitimate hooking activities on systems handling sensitive data, indirectly observed.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation on systems handling sensitive data. Identify processes with executable paths or command lines associated with data collection, archival, or credential dumping tools, potentially used in conjunction with hooking. Analyze the frequency of such processes and use correlation analysis to link their execution to user activity or system events on these sensitive systems."
          },
          "Process memory integrity violations or IAT modifications detected in processes known to handle sensitive data or authentication, indirectly observed.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation on endpoints/servers handling sensitive data (e.g., domain controllers, database servers). Identify processes with executable paths or command lines associated with tools that modify process memory or libraries. Use time series analysis to detect unusual spikes in these process executions and correlate with Zeek conn.log for potential outbound connections (exfiltration) following execution, flagging rare or anomalous connections."
          },
          "Outbound network connections to uncommon or suspicious destinations from processes known or suspected to be performing hooking or collection.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 5156 (Network Connection - if enabled) and Zeek conn.log entries. Identify network connections initiated by processes flagged as suspicious (e.g., based on execution location, parent process, or correlation with prior hooking detection). Flag connections to rare destination IPs/ports (low frequency), destinations not in allowed lists, or IPs known from threat intelligence feeds (using correlation/inner join)."
          },
          "Execution of processes accessing sensitive files or directories shortly after a potential hooking event is detected.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations executing commands that interact with known sensitive files or directories (e.g., using copy, type, file archive commands like tar/zip/rar with suspicious paths) or accessing common credential storage locations. Correlate these events with hosts or times where potential hooking activities were previously detected (e.g., from other evidence items for T1056.004). Use correlation analysis to link the potential credential collection attempt with subsequent access to sensitive data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]