[
    {
        "information_requirement": "Is the adversary exfiltrating data via a physical medium?",
        "tactic_id": "TA0010",
        "tactic_name": "Exfiltration",
        "indicators": [
            {
                "technique_id": "T1052",
                "name": "Exfiltration Over Physical Medium",
                "evidence": [
                    {
                        "description": "File write operations to removable media where the source file hash matches a known malicious tool or the data is written by a process with a known malicious hash.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "When a file write to removable media is detected (via Windows Event ID 4663), identify the source file path and the process responsible (Process ID). Correlate with process creation logs (Windows Event ID 4688) to get the full process executable path. Hash both the source file being copied and the process executable performing the write. Cross-reference these hashes against a continuously updated threat intelligence feed of known malicious file hashes. Alert on any matches."
                    },
                    {
                        "description": "Use of command-line utilities or scripting languages with syntax specifically structured to copy numerous files, sensitive file types, or data from specific directories to a removable media device.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation with Command Line Auditing enabled) for suspicious command lines. Use regular expressions to detect patterns indicative of bulk data copying to removable media. Examples include `robocopy <source> <removable_drive> /S /E`, `xcopy <source> <removable_drive> /S /I /Y`, or PowerShell commands like `Copy-Item -Path 'C:\\Users\\...' -Destination 'E:\\' -Recurse -Force`. Flag commands that copy from sensitive user or system directories (e.g., 'Users', 'ProgramData', 'Windows') to drive letters corresponding to removable media, especially when run non-interactively or by an unusual parent process (e.g., wmiprvse.exe, svchost.exe)."
                    },
                    {
                        "description": "Creation of large archive files (e.g., .zip, .rar, .7z) followed by the immediate transfer of that archive to a removable storage device, especially if the archive has a high-entropy or generic name.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate events within a short time window (e.g., 5 minutes). First, monitor for process creations (Windows Event ID 4688) of archiving utilities (e.g., 7z.exe, WinRAR.exe, tar.exe, PowerShell Compress-Archive) creating large files in temporary or user directories. Second, monitor for file write events (Windows Event ID 4663) where the newly created archive's object name is written to a removable drive path. Use correlation analysis to link these two events by process ID and time. Calculate the entropy of the archive filename; flag sequences involving high-entropy or generic names (e.g., backup.zip, archive.rar) as potential staged exfiltration."
                    },
                    {
                        "description": "Anomalous volume, frequency, or type of data written to a removable storage device, deviating significantly from established baselines for the user or endpoint.",
                        "data_sources": [
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a statistical baseline of typical removable media write activity for each user and endpoint, capturing metrics such as total data volume, number of files, and file extension distribution per day or week using historical Windows Event ID 4663 data. Continuously monitor write operations to removable media, aggregating metrics per session. Use time series analysis or percentile analysis (e.g., flagging activity greater than the 95th percentile) to detect significant deviations. An unusually large volume of data written or a sudden shift in file types (e.g., high count of .pst, .bak, .sql, .docx files) is a strong behavioral indicator of exfiltration."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
