[
  {
    "Is the adversary executing malicious code using systemd timers? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.006 - Systemd Timers": {
          "Execution of 'systemd-run' utility with parameters creating/modifying timer units.": {
            "Data": "Windows Event ID 4688, Zeek ssh.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of utilities like 'systemctl' or 'systemd-run' with parameters related to timer management. Monitor Zeek ssh.log for remote execution of these commands. Analyze command lines for suspicious arguments like '--install', '--set-property', 'enable', 'start'."
          },
          "Processes spawned with parent process ID 1 and suspicious command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created with parent process ID 1. Analyze command-line arguments for suspicious patterns (e.g., shell scripts, obfuscation, execution from temporary directories). Use entropy analysis on command lines and calculate frequency of process paths to identify anomalies."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary maintaining persistence using systemd timers? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.006 - Systemd Timers": {
          "Creation or modification of .timer or .service files in systemd user or system directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for creation or modification of files ending in '.timer' or '.service' in systemd user or system directories (conceptual mapping for Windows Event IDs). Compare file paths and names against baselines to identify new or unexpected unit files."
          },
          "Modification of existing legitimate .timer or .service files or reference to unknown executables.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for modifications to existing, known legitimate systemd unit files (conceptual mapping). Correlate file modifications with access attempts from unusual users or processes. Use change analysis (conceptual mapping) to identify introduction of suspicious commands or reference to new malicious executables."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to elevate privileges using systemd timers? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053.006 - Systemd Timers": {
          "Creation or modification of .timer or .service files in privileged systemd directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for creation or modification of files in privileged systemd directories. Alert on file changes originating from non-privileged user contexts (conceptual mapping for Windows Event IDs)."
          },
          "Highly suspicious processes with parent process ID 1 executing from privileged paths or with privileged characteristics.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created with parent process ID 1. Filter for processes executing from privileged paths. Analyze user context and command lines for indications of privilege escalation attempts or root-level persistence execution. Use linear regression to identify deviations from normal user/process behavior."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]