[
  {
    "Is the adversary attempting to elevate privileges using process hollowing? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1055.012 - Process Hollowing": {
          "Creation of a child process followed by the parent process terminating abnormally soon after.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (4688, 4689) for parent processes creating child processes followed by the parent process terminating within a short timeframe (e.g., less than 5 seconds). Use time series analysis to identify parent processes with unusually short lifespans immediately after child creation compared to their historical behavior or process type averages."
          },
          "Unusual parent-child process relationships observed during process creation (potentially indicative of a benign process being spawned for hollowing).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs. Identify common parent-child relationships by counting occurrences over time. Flag process creations with rare parent-child pairs, especially where the child process is a commonly hollowed target (e.g., svchost.exe, explorer.exe, runtimebroker.exe), using frequency analysis or clustering to detect deviations from baseline."
          },
          "Creation of a legitimate process (e.g., svchost.exe) with an empty or unusual command line, followed by unexpected child process creation or network activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of common 'hollowed' processes (svchost.exe, explorer.exe, etc.). Filter for instances where the 'Command Line' field is empty or doesn't match expected patterns for its parent process based on historical data. Correlate these events with subsequent child process creations (Event 4688) or network connections (Zeek conn.log) originating from this potentially hollowed process within a short time window (e.g., 60 seconds). Use baseline analysis of normal command lines and network activity for these processes to identify outliers."
          },
          "Unusually long delay between a process's creation time and its first observed network connection or child process creation.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with subsequent Zeek conn.log entries where the process PID and host match the newly created process, or subsequent Windows Event ID 4688 entries where the parent PID and host match. Calculate the time difference between the process creation event and the first correlated network or child process event. Use statistical analysis (e.g., mean, standard deviation, IQR via box plots) to establish a baseline for this time difference for various common processes and flag outliers significantly exceeding the norm."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to evade defenses using process hollowing? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1055.012 - Process Hollowing": {
          "Legitimate Windows process (e.g., svchost.exe, explorer.exe) initiating unusual outbound network connections shortly after creation.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log/dns.log events. Identify instances where legitimate processes (based on name, path, digital signature if available) initiate network connections to unusual destinations or ports shortly after creation (e.g., within 60 seconds). Use correlation analysis to link process creation events to subsequent network activity. Use frequency analysis or threat intelligence lookups on destinations to flag outliers or known malicious infrastructure."
          },
          "Analysis of process creation events showing unusual timing or sequence relative to parent process activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs. For child processes, examine the time difference between the child process creation event and its parent process's last recorded activity (e.g., creation time from Event 4688 or termination time from Event 4689). Look for statistically unusual time differences, potentially indicating manipulation during creation. Use descriptive statistics (mean, median) or box plots to identify outliers in creation timing relationships compared to baselines for specific parent-child pairs."
          },
          "A process exhibiting suspicious behavior (e.g., unusual network activity, spawning many children) immediately before creating a child process that later exhibits signs of hollowing.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for potential child hollowing signs (e.g., child process created with unusual command line, unusual delay before child activity - leveraging analyses from other evidence). For such potential hollowing events, examine the parent process's activity (via Event 4688/Zeek logs) in the minutes preceding the child's creation. Look for unusual network connections (using frequency or threat intel), creation of multiple processes (high child process count in Event 4688), or execution of suspicious commands by the parent process using correlation analysis and baseline comparison."
          },
          "A commonly hollowed process (e.g., svchost.exe) showing an unusual delay between creation and first network activity, followed by connections to unusual or rare destinations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of target processes like svchost.exe, explorer.exe, etc. Correlate creation events with the first associated Zeek conn.log event (matching process PID and host if available, or based on timing/host). Calculate the time delta. Use statistical methods (e.g., mean, standard deviation, IQR) to find outliers in this time delta for specific process names compared to historical norms. For processes flagged with an unusual delay, analyze the destination IPs/domains in the subsequent Zeek logs using frequency analysis or threat intelligence lookups to identify rare or malicious destinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]