[
  {
    "Has the adversary elevated privileges using VDSO hijacking? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.014 - VDSO Hijacking": {
          "Detection of unusual or suspicious process activity involving low-level system calls like ptrace or mmap that can facilitate code injection and redirection.": {
            "Data": "Linux Auditd Logs; Process Monitoring Data",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure Linux Auditd to log specific syscalls (e.g., ptrace, mmap). Monitor logs for these syscalls being invoked by processes not typically associated with such activity. Analyze event volume over time using time series analysis to detect unusual spikes or patterns."
          },
          "Legitimate processes exhibiting behavior indicative of privilege escalation (e.g., accessing restricted files, executing commands with higher privileges) after potential VDSO hijacking.": {
            "Data": "Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Linux Auditd logs for legitimate processes (e.g., system daemons, common user applications) attempting to access sensitive files, modify system configuration, or execute commands typically associated with elevated privileges. Establish baseline process behavior using descriptive statistics and correlation analysis on syscall sequences and resource access patterns to identify deviations."
          },
          "Legitimate processes making unexpected attempts to read or modify sensitive files or directories typically restricted to higher privileges, potentially after syscall usage indicative of injection.": {
            "Data": "Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Linux Auditd logs for processes (especially those typically running with lower privileges) attempting to access or modify sensitive system files or directories (`/etc/shadow`, `/root`, `/var/log`, etc.). Correlate these file access events with recent occurrences of suspicious syscalls (ptrace, mmap) from the same process using time-based correlation. Use correlation analysis to link syscall sequences to subsequent privileged actions."
          },
          "Legitimate processes launching child processes or executing commands typically associated with elevated privileges or system administration, not part of their normal execution flow.": {
            "Data": "Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Linux Auditd logs for `execve` syscalls. Identify processes launching child processes or commands that are unusual for the parent process's normal behavior (e.g., a web server spawning a shell, a user process executing `sudo` or `su` unexpectedly). Establish baseline parent-child process relationships using descriptive statistics and frequency analysis to flag deviations. Investigate processes flagged by syscall monitoring (ptrace/mmap) for subsequent unexpected command execution."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using VDSO hijacking? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.014 - VDSO Hijacking": {
          "Detection of low-level system calls (ptrace, mmap) used by processes in a manner consistent with attempting to hook libraries or redirect execution for evasion.": {
            "Data": "Linux Auditd Logs; Process Monitoring Data",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Linux Auditd logs for patterns of syscalls (ptrace, mmap) that might indicate library hooking or code injection attempts in processes often targeted for defense evasion (e.g., security agents, critical system processes). Use frequency analysis or entropy measures on syscall sequences to spot anomalies."
          },
          "Legitimate processes making unexpected outbound network connections or modifying critical system files, potentially to facilitate C2 or hide activity after VDSO hijacking.": {
            "Data": "Zeek conn.log; Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Linux Auditd logs for legitimate processes initiating unexpected outbound network connections, especially to rare destination IPs or ports, or modifying system files unrelated to their normal function. Correlate network activity (Zeek) with process ID and user (Auditd) and analyze connection timing and volume using time series analysis or correlation with threat intelligence feeds."
          },
          "Detection of syscalls (ptrace, mmap) used by processes commonly targeted for injection (e.g., security agents) or immediately preceding attempts to disable or tamper with security software.": {
            "Data": "Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Linux Auditd logs for ptrace or mmap syscalls invoked by processes known to be security agents or critical system processes. Correlate these syscalls with subsequent attempts by the same process (within a short time window) to modify or execute files belonging to security software or system monitoring tools using time-based correlation. Use frequency analysis on events targeting security software paths to spot anomalies."
          },
          "Legitimate processes exhibiting anomalous network traffic characteristics (e.g., high volume, unusual protocols/ports, connections to suspicious destinations) potentially masked by VDSO hijacking.": {
            "Data": "Zeek conn.log; Linux Auditd Logs",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for processes initiating large data transfers or using unusual ports/protocols for their type (e.g., a text editor connecting on port 4444, a browser uploading gigabytes). Correlate Zeek data (process ID, user, destination IP/port) with Linux Auditd logs to identify the initiating process and account, and check for preceding suspicious syscalls (ptrace, mmap). Use descriptive statistics and comparison to baseline network behavior for that specific process to flag anomalies. Cross-reference destination IPs with threat intelligence feeds using correlation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]