[
  {
    "Has the adversary executed commands using cloud APIs? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.009 - Cloud API": {
          "Execution of sensitive or unusual cloud API calls detected via host or network activity proxy.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of processes associated with cloud CLIs (e.g., aws.exe, az.exe, gcloud.exe) or scripting engines launching cloud SDKs. Analyze Zeek conn.log for connections to known cloud API endpoints on ports 443/80. Identify rare processes or connection destinations by analyzing frequency distribution or using outlier detection methods."
          },
          "Anomalous volume or timing of cloud API calls originating from a specific account or IP address detected via host or network activity proxy.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connection volume and timing to cloud API endpoints originating from specific internal hosts or external IPs. Use time series analysis or statistical process control (SPC) to detect sudden spikes or changes in normal connection volume or timing patterns. Correlate spikes with process creation events (Event ID 4688) on involved hosts."
          },
          "Execution of cloud command-line interface (CLI) or SDK tools by users or processes that do not typically use them, or from unusual locations on the filesystem.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for the creation of processes corresponding to known cloud CLIs (e.g., aws.exe, az.exe, gcloud.exe) or scripting interpreters (`powershell.exe`, `python.exe`) when associated with command lines invoking cloud SDKs. Analyze the process execution path, parent process, and user account associated with these events. Establish baselines of authorized users/processes and file paths for cloud tool execution. Flag executions deviating from this baseline using frequency analysis or anomaly detection (e.g., IQR). Focus analysis on servers and endpoints where cloud tools should NOT be present or used by service accounts."
          },
          "Network connections to cloud API endpoints originating from processes or hosts not expected to make such connections.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing connections to known cloud API endpoint IP ranges or hostnames with Windows Event ID 5156 on the source host (Endpoints/Servers) to identify the initiating process. Establish a baseline of processes/hosts that legitimately connect to cloud APIs using descriptive statistics (frequency counts). Flag connections originating from unexpected processes (e.g., `cmd.exe`, `powershell.exe` not running a known script) or hosts using frequency analysis or by comparing against an authorized list."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]