[
    {
        "information_requirement": "Is the adversary executing commands or payloads via Unix shells?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1059.004",
                "name": "Unix Shell",
                "evidence": [
                    {
                        "description": "Network connections from a Unix host to known malicious C2 IPs, domains, or URLs immediately following a suspicious interactive login session.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssh.log",
                            "Zeek http.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate an interactive login to a Unix host (identified via Zeek ssh.log) with subsequent network traffic from that host's IP address. Inner join destination IPs, HTTP host headers, and DNS queries from the post-login traffic against a high-confidence threat intelligence feed (updated daily) of known malicious C2 infrastructure. Alert on any matches and investigate the entire session."
                    },
                    {
                        "description": "Execution of Unix shell commands via Windows Subsystem for Linux (WSL) with suspicious argument patterns, such as downloading and executing remote scripts.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows process creation events (Event ID 4688) where the process name is a known Unix shell on Windows (e.g., wsl.exe, bash.exe, sh.exe). Analyze the associated command-line arguments using regular expressions to detect common malicious patterns, such as 'curl ... | bash', 'wget ... -O - | sh', base64 encoded commands passed via '-c', or execution of scripts from unusual locations like user profile temporary directories. Maintain and update a list of these suspicious patterns."
                    },
                    {
                        "description": "Anomalous parent-child process relationships involving Unix shell processes on Windows, such as a shell being spawned by an Office application, web browser, or other non-standard parent.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze process creation events (Event ID 4688) to track parent-child relationships for Unix shell processes (e.g., wsl.exe, bash.exe). Establish a baseline of legitimate parent processes (e.g., explorer.exe, cmd.exe, powershell.exe, Windows Terminal). Use frequency analysis to identify and alert on rare or unexpected parent-child process combinations, such as a shell spawned by WINWORD.EXE, OUTLOOK.EXE, or chrome.exe, which is highly indicative of code execution from a malicious document or exploit."
                    },
                    {
                        "description": "A Unix host initiating anomalous network patterns (e.g., connections to multiple new IPs, unusual protocols, data beaconing) immediately following an interactive SSH session from an unusual source or at an atypical time.",
                        "data_sources": [
                            "Zeek ssh.log",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate interactive logins (from Zeek ssh.log, flagging sessions from external IPs or internal IPs not on an approved list) with subsequent network traffic from the logged-in host's IP. Establish a baseline for the host's typical network behavior (destination IPs, ports, protocols, data volume). Use time series analysis to detect sudden spikes in connections or data volume post-login. Analyze the entropy of destination IPs or DNS queries; a sudden increase may indicate discovery/scanning activity. Flag connections using non-standard ports or protocols for that host, indicating potential tunneling or reverse shells."
                    },
                    {
                        "description": "Network traffic patterns consistent with the download and immediate execution of a remote script (e.g., 'curl | bash'), such as a small HTTP file download followed by new outbound C2-like connections.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek http.log for downloads of file types commonly used for scripts (e.g., .sh) or files with no extension from low-reputation domains, non-standard web servers, or direct-to-IP addresses. Correlate this download event (by client IP) with any immediate, new outbound network connections (from Zeek conn.log) from the same IP. Use correlation analysis based on IP and a short time window (e.g., < 1 minute) to link the download to the subsequent suspicious activity, such as connections to known C2 IPs or beaconing behavior."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
