[
  {
    "Is the adversary attempting to gain access to credentials using API hooking? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1056.004 - Credential API Hooking": {
          "Detection of suspicious API calls associated with installing hooks (e.g., SetWindowsHookEx, SetWinEventHook), indirectly observed through process execution logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Identify processes with executable paths, parent-child relationships, or command lines associated with known hooking tools or techniques. Analyze frequency and timing of such process executions on endpoints/servers using descriptive statistics and time series analysis to detect anomalies."
          },
          "Detection of process memory integrity violations or unusual modifications to the Import Address Table (IAT), indirectly observed through process execution logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Identify processes with executable paths or command lines associated with memory analysis, integrity checking bypass, or code injection tools. Use frequency analysis and correlation analysis (e.g., correlating executions across multiple hosts or with other events) to identify widespread or coordinated attempts."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary collecting sensitive data via API hooking? (TA0009 - Collection)": {
      "Indicators": {
        "T1056.004 - Credential API Hooking": {
          "Suspicious API calls (like SetWindowsHookEx) originating from processes not typically involved in system monitoring or legitimate hooking activities on systems handling sensitive data, indirectly observed.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation on systems handling sensitive data. Identify processes with executable paths or command lines associated with data collection, archival, or credential dumping tools, potentially used in conjunction with hooking. Analyze the frequency of such processes and use correlation analysis to link their execution to user activity or system events."
          },
          "Process memory integrity violations or IAT modifications detected in processes known to handle sensitive data or authentication, indirectly observed.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation on endpoints/servers handling sensitive data. Identify processes with executable paths or command lines associated with tools that modify process memory or libraries. Use time series analysis to detect unusual spikes in these process executions and correlate with Zeek conn.log for potential outbound connections following execution."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]