[
  {
    "Is the adversary executing malicious code using systemd timers? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.006 - Systemd Timers": {
          "Execution of 'systemd-run' utility with parameters creating/modifying timer units.": {
            "Data": "Windows Event ID 4688; Zeek ssh.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of utilities like 'systemctl' or 'systemd-run' with parameters related to timer management. Monitor Zeek ssh.log for remote execution of these commands. Analyze command lines for suspicious arguments like '--install', '--set-property', 'enable', 'start'."
          },
          "Processes spawned with parent process ID 1 and suspicious command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created with parent process ID 1 (conceptual mapping for systemd-initiated processes). Analyze command-line arguments for suspicious patterns (e.g., shell scripts, obfuscation, execution from temporary directories). Use entropy analysis on command lines and calculate frequency of process paths to identify anomalies."
          },
          "Network connections initiated by processes spawned from systemd timer service units (PID 1), particularly to external or unusual destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 for processes with parent PID 1 (conceptual) with subsequent network connection events (Windows Event ID 5156, Zeek conn.log). Identify connections to suspicious external IPs or domains using threat intelligence feeds or based on connection frequency/volume analysis (e.g., identify rare destinations or high data transfer volumes to unusual IPs)."
          },
          "Scheduled process execution occurring at highly unusual or specific recurring intervals that match known malicious patterns.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze timestamps of process creation events (Windows Event ID 4688) where the parent process ID is 1 (conceptual systemd initiation). Identify potential scheduled patterns using time series analysis (e.g., execution every X minutes/hours, or at specific times). Compare identified patterns against known malicious timer schedules or establish a baseline of normal scheduled tasks to detect deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using systemd timers? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.006 - Systemd Timers": {
          "Creation or modification of .timer or .service files in systemd user or system directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for creation or modification of files ending in '.timer' or '.service' in systemd user or system directories (conceptual mapping for Windows Event IDs). Compare file paths and names against baselines using frequency analysis to identify new or unexpected unit files."
          },
          "Modification of existing legitimate .timer or .service files or reference to unknown executables.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for modifications to existing, known legitimate conceptual systemd unit files. Correlate file modifications with access attempts from unusual users or processes. Use change analysis (conceptual mapping) to identify introduction of suspicious commands or reference to new malicious executables within the file content (conceptual analysis based on file change event)."
          },
          "Creation or modification of systemd timer/service unit files in user-level directories (~/.config/systemd/user/) under unusual circumstances or user accounts.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4624",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for file creation/modification/deletion targeting conceptual user-level systemd directories. Correlate these events with user logon activity (Windows Event ID 4624) or other process activity (Windows Event ID 4688) to identify suspicious user accounts or processes creating persistence mechanisms in their home directories. Use frequency analysis to identify accounts exhibiting unusual activity in these directories."
          },
          "Systemd timer service unit files (.service) containing references to executables in unusual or temporary directories, or referencing scripts/binaries with high entropy or obfuscation.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for modifications to conceptual systemd .service files. Identify modification events originating from suspicious processes or users. Analyze the full path of the modified file. Flag files that reference executables located in temporary directories, user profile directories, or other non-standard system binary locations based on file path patterns. Correlate with Windows Event ID 4688 for execution of suspicious binaries referenced by timer services."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to elevate privileges using systemd timers? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053.006 - Systemd Timers": {
          "Creation or modification of .timer or .service files in privileged systemd directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for creation or modification of files in privileged systemd directories (conceptual mapping). Alert on file changes originating from non-privileged user contexts (conceptual mapping for Windows Event IDs)."
          },
          "Highly suspicious processes with parent process ID 1 executing from privileged paths or with privileged characteristics.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created with parent process ID 1 (conceptual systemd initiation). Filter for processes executing from privileged paths. Analyze user context and command lines for indications of privilege escalation attempts or root-level persistence execution. Use linear regression to identify deviations from normal user/process behavior patterns."
          },
          "Creation or modification of systemd timer/service unit files in privileged directories (/etc/systemd/system/, /usr/lib/systemd/system/) by non-privileged user accounts.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4624",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for file creation/modification targeting conceptual privileged systemd directories. Correlate these events with the user account context (Windows Event ID 4624 logon sessions) associated with the process (Windows Event ID 4688 if available) performing the file operation. Alert on file changes in privileged directories initiated by processes running under standard or non-administrator user contexts. Use correlation analysis to link the file modification event with the user session."
          },
          "Systemd timer service unit files (.service) configured to execute binaries or scripts associated with known privilege escalation techniques or tools.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (requires SACL setup) for modifications to conceptual systemd .service files in privileged paths. Analyze file content changes (conceptual) for command lines or executable paths that match known privilege escalation tools or techniques. Use correlation analysis to link these file modifications to subsequent process creation events (Windows Event ID 4688) where the parent is PID 1 (conceptual) and the executable path matches a known list of suspicious or privilege escalation tools."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]