[
  {
    "Is the adversary executing commands on network devices? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.008 - Network Device CLI": {
          "Evidence of unauthorized or suspicious commands found in network device CLI command history.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to network device management ports (e.g., SSH/Telnet). Review network device logging/command history (if available and collected) for sessions originating from suspicious IPs or accounts. Analyze command history for unauthorized commands (e.g., config changes, disabling logging, manipulating traffic) using keyword searches and correlation with known administrative windows. Use time series analysis on login times and duration to detect anomalous activity."
          },
          "Network device configuration changes detected that do not align with authorized administrative activities.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to network device management ports. Implement configuration baseline monitoring on network devices (requires device-specific tools/scripts). Periodically pull running/startup configurations and compare against known-good baselines using diff tools. Analyze syslog events (if collected by Zeek) indicating configuration changes. Investigate unexpected changes using correlation analysis with change management records."
          },
          "Anomalous connection attempts or successful sessions to network device management interfaces (SSH/Telnet) from unusual source IPs or times.": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, ssh.log, telnet.log) for connections to network device management ports (e.g., 22, 23). Identify unusual source IPs, users (if available in ssh/telnet logs), or connection timestamps. Use frequency analysis or time series analysis to detect deviations from normal baseline activity for these ports/devices, especially concerning source IPs and login times. Flag connections from IPs not on an authorized list or occurring outside typical administrative windows."
          },
          "Unusual outbound network connections initiated by network devices to external or unexpected internal destinations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections where the source IP belongs to a network device. Establish a baseline of normal outbound connections (e.g., NTP, DNS, Syslog, monitoring). Use frequency analysis on destination IPs/ports or statistical outlier detection (e.g., IQR or percentile) on data transfer volumes to flag unusual outbound sessions initiated by network devices. Investigate connections to destinations outside the expected baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]