[
  {
    "Has the adversary escalated privileges using process injection via APCs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.004 - Asynchronous Procedure Call": {
          "Process access events indicating attempts to open or modify threads in unexpected processes.": {
            "Data": "Windows Event ID 4690, Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4690, 4656, 4663 for process access attempts. Filter events where the source process is unexpected or the target process/thread is commonly injected. Identify frequency of such events per source process/user and flag statistically rare occurrences."
          },
          "Unusual child process creation or execution originating from a process known to be a common injection target (e.g., svchost.exe, explorer.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Filter for common target processes (e.g., svchost.exe, explorer.exe) spawning unusual child processes. Use descriptive statistics to baseline child process activity for these parent processes and identify deviations or outlier child processes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using process injection via APCs? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.004 - Asynchronous Procedure Call": {
          "Attempts to access or modify memory/threads in running processes from unusual sources.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for object access events targeting process objects with modification/write access permissions. Filter for access originating from processes not typically involved in debugging or process management. Calculate the frequency of such events and use outlier detection methods to spot suspicious activity."
          },
          "Outbound network connections initiated by a process that normally should not make network connections, or connections to suspicious remote endpoints.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log. Identify network connections initiated by processes (via PID/timestamp correlation) that are known injection targets or are not expected to make network connections. Analyze destination IPs/ports against threat intelligence feeds or identify statistically unusual destinations/traffic volumes using frequency analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]