[
  {
    "Is the adversary attempting to escalate privileges using process injection? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1055.001 - Dynamic-link Library Injection": {
          "Process accessing the memory of another process in a non-standard way.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for Object Handle Requested/Closed events where the Object Type is 'Process'. Filter for source processes known to perform legitimate inter-process communication (IPC). Investigate events where an unusual source process requests a handle to a critical or privileged target process. Use frequency analysis to identify rare source/target process pairs and flag anomalies."
          },
          "Unexpected code execution or child process creation originating from a privileged system process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs. Identify processes spawned by critical system processes (e.g., svchost.exe, services.exe) or trusted user processes that are not part of the expected parent/child relationships. Use correlation analysis to link unusual child process creation with potential prior suspicious events indicating injection."
          },
          "API calls associated with remote process memory manipulation (e.g., WriteProcessMemory, CreateRemoteThread) by a low-integrity or non-privileged process targeting a higher-integrity or privileged process.": {
            "Data": "Windows Event ID 8; Windows Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID (Sysmon Event ID 10 - ProcessAccess) for WriteProcessMemory or similar API calls, and Windows Event ID (Sysmon Event ID 8 - CreateRemoteThread) for new thread creation in remote processes. Correlate these events with the integrity level or privilege of the source process and the target process. Flag instances where a low-integrity/low-privilege process targets a high-integrity/privileged process. Use frequency analysis or baselining to identify rare source/target process pairs or unusual API call sequences."
          },
          "Loading of an unsigned or unusual DLL into a privileged process.": {
            "Data": "Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID (Sysmon Event ID 7 - ImageLoad) events. Filter for DLL loads occurring within high-integrity or privileged processes. Cross-reference the loaded DLL paths and filenames against known legitimate DLLs for that process and operating system version. Flag loads of unsigned DLLs, DLLs from unusual locations (e.g., user directories instead of system directories), or DLLs not typically loaded by the target process. Use frequency analysis to identify rare DLL loads per target process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to evade defenses using process injection? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1055.001 - Dynamic-link Library Injection": {
          "Trusted application process accessing the memory of another process.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for Object Handle Requested/Closed events where the Object Type is 'Process'. Focus on source processes identified as trusted applications (e.g., web browsers, office applications). Investigate instances where these trusted processes request handles to other processes, particularly system processes or other application processes in ways not typical for their normal operation. Use baseline analysis to identify deviations from normal process behavior."
          },
          "Processes exhibiting unusual network connections or file activity after potential injection.": {
            "Data": "Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and Windows Event ID 4663 (if file access auditing is enabled and relevant) with potential injection indicators (from memory access or unusual process creation). Identify processes (via PID from Event ID 4688 or similar) that initiate unusual network connections (using Zeek logs and network flow analysis) or access sensitive files (using Event ID 4663) immediately after a suspicious process or memory access event is logged. Use correlation analysis to link suspicious host events with subsequent network or file activity."
          },
          "Loading of a DLL into a process from an unusual or temporary location (e.g., AppData, Temp folders).": {
            "Data": "Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID (Sysmon Event ID 7 - ImageLoad) events. Filter for DLL loads where the Image (process path) is a commonly targeted legitimate process and the LoadedImage (DLL path) is from a known suspicious or temporary location (e.g., C:\\Users\\*\\AppData, C:\\Windows\\Temp). Use frequency analysis to identify rare DLL loads from these locations into common processes."
          },
          "Trusted process initiating outbound network connections or creating suspicious child processes, inconsistent with its normal behavior.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of expected outbound network connections (Zeek conn.log) and child process creation (Windows Event ID 4688) for common legitimate processes (e.g., explorer.exe, svchost.exe variants, common application executables). Use statistical methods like frequency distribution or correlation analysis to identify deviations from this baseline, specifically when a trusted process exhibits network activity to unusual destinations (e.g., non-corporate IPs, known C2) or spawns unexpected child processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]