[
  {
    "Is the adversary executing commands or payloads via Unix shells? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.004 - Unix Shell": {
          "Detection of unusual shell script execution, particularly in unexpected locations or outside normal administrative cycles.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections originating from servers or endpoints running shell scripts. Analyze connection destinations and protocols. Use statistical analysis (e.g., frequency analysis, entropy) on destination IPs, ports, or data volume to identify anomalous script-initiated network activity, particularly connections to rare or known malicious external endpoints."
          },
          "Execution of uncommon or suspicious commands via interactive shell sessions (e.g., commands related to discovery, collection, or data exfiltration).": {
            "Data": "Zeek conn.log; Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and ssh.log for interactive SSH sessions to Unix systems, especially from unusual source IPs or accounts. Examine Zeek logs for patterns indicative of data transfer (e.g., large outgoing connections following login). Use time series analysis on login times and session durations to identify access outside normal working hours or unusually long/short interactive sessions."
          },
          "Network session establishment (e.g., SSH) or host-based connection attempts (from Windows hosts) to Unix systems, correlated with potential shell activity.": {
            "Data": "Zeek ssh.log; Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ssh.log for interactive SSH sessions and Zeek conn.log for traffic on common shell ports (e.g., 22) originating from unusual sources (external IPs, IPs not typically connecting to these systems). Correlate these network events with Windows Event ID 4624 (Logon Type 10 - RemoteInteractive) on the target server if applicable, or with Windows Event ID 4688 (Process Creation) and Event ID 5156 (Network Connection) on Windows endpoints/servers initiating outbound SSH/remote connections. Use correlation analysis to link suspicious network sessions to potential source host activities."
          },
          "Network activity patterns (DNS, HTTP, general connections) indicative of post-execution behavior immediately following interactive shell sessions.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for new or anomalous network connections, HTTP requests, or DNS queries originating from systems hosting interactive shell sessions (identified via Zeek ssh.log). Look for activity occurring shortly after the start of a shell session. Analyze destinations, protocols, and data volumes. Use statistical measures (e.g., frequency distribution of destinations, IQR for data volume) to identify deviations from baseline network behavior on that host, particularly connections to suspicious destinations or unexpected data transfer sizes that could indicate discovery, collection, or exfiltration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]