
[
  {
    "Is the adversary executing commands or scripts via Lua? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.011 - Lua": {
          "Network traffic from a host that recently executed a Lua script to an IP address or domain on a threat intelligence feed.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process execution events involving Lua interpreters (e.g., lua.exe) or scripts ending in .lua (Windows Event ID 4688) with network connection logs (Zeek conn.log) from the same host occurring within a short time window. Inner join the destination IP addresses and domains from these connections with a continuously updated CTI feed of known malicious C2 infrastructure. Alert on any matches."
          },
          "Execution of a Lua interpreter with command-line arguments containing known malicious patterns, such as obfuscated inline scripts or download and execute commands.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688) for Lua interpreters (e.g., lua.exe, luac.exe). Scan the command-line field using regular expressions for patterns indicative of malicious scripting, such as the '-e' flag for inline execution combined with long or base64-encoded strings, or function calls like 'os.execute', 'io.popen', or strings associated with downloading remote payloads. Use frequency analysis to identify rare and potentially malicious command-line patterns."
          },
          "A Lua interpreter process (e.g., lua.exe) or an application known to host Lua (e.g., nmap.exe, wireshark.exe) is spawned by an unusual parent process, such as a Microsoft Office application, web browser, or script interpreter.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688). For processes like 'lua.exe' or other applications that can host Lua, analyze the 'ParentProcessName' field. Establish a baseline of normal parent-child relationships for these processes in your environment using descriptive statistics. Flag instances where the parent is unexpected (e.g., 'winword.exe', 'powershell.exe', 'outlook.exe', 'wscript.exe'), as this pattern is a strong indicator of execution from a malicious document, email, or initial access script."
          },
          "Creation of a Lua script file (.lua) in a temporary or user-writable directory, immediately followed by its execution by an interpreter or host application.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688) where a command line includes a path to a '.lua' script file. Analyze the path of the script. Flag executions from unusual or high-risk directories (e.g., %TEMP%, %APPDATA%, C:\\Users\\Public\\). Use correlation analysis to identify a sequence where a parent process (like a browser or email client) writes a file that is then immediately executed by a Lua interpreter, indicating a downloaded payload execution."
          },
          "A process hosting a Lua script initiates suspicious downstream activity, such as spawning command shells, running discovery commands, or making outbound network connections to new or non-standard destinations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track the process ID (PID) of any executed Lua interpreter or application known to host Lua. Monitor for child processes (Event ID 4688) spawned by this PID, particularly 'cmd.exe', 'powershell.exe', 'whoami.exe', 'net.exe', or 'wmic.exe'. Correlate the parent process execution time with outbound network connections (Zeek conn.log) from the same host, using time series analysis or frequency analysis to detect connections to new IPs/domains or on ports not typically associated with the application."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
