[
  {
    "Has the adversary achieved privilege escalation using process memory injection? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1055.009 - Proc Memory": {
          "A process exhibiting unusual behavior shows a sudden increase in privilege level.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4672",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (Logon Type 5) and 4672 for logons associated with processes or services. Analyze login frequency and patterns, especially for service accounts or SYSTEM, using time series analysis to detect deviations from baseline."
          },
          "A new high-privilege process starts from an unexpected parent or location.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify processes running with high privileges (e.g., SYSTEM, Administrator). Use parent-child process correlation analysis to flag high-privilege processes spawned by unexpected parent processes or from unusual directories, calculating entropy or frequency of parent process names."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using process memory injection? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1055.009 - Proc Memory": {
          "Unusual network connections originating from processes not typically expected to make external connections.": {
            "Data": "Zeek conn.log, Zeek dns.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, dns.log, and http.log for connections initiated by processes (requires correlating host and network logs). Correlate external connections with internal process names if possible. Use correlation analysis to identify processes making connections to suspicious domains/IPs based on threat intelligence feeds. Flag connections to rare or new external destinations using frequency analysis."
          },
          "A legitimate process spawns unusual or unexpected child processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Analyze parent-child process relationships. Use frequency analysis or baselining to identify legitimate processes spawning child processes that are statistically rare or associated with known malicious activity."
          }
        }
      }
    }
  }
]