[
  {
    "Is the adversary executing malicious code using container orchestration jobs? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.007 - Container Orchestration Job": {
          "Network traffic or host process creation consistent with the execution of code from a potentially malicious container job.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify new processes (Win Event ID 4688) or network connections (Zeek conn.log) on worker nodes that deviate significantly from the historical baseline for that node or container type. Use anomaly detection techniques (e.g., clustering or time series analysis on event frequency/type) to flag unusual activity coinciding with potential job execution times."
          },
          "Zeek conn.log showing connections from IP addresses associated with scheduled jobs to external or unusual destinations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections originating from pod IP ranges on worker nodes. Identify connections to external IP addresses not in an approved list or to internal segments that pods associated with scheduled jobs should not reach. Use frequency analysis to identify rare or unusual destinations."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary maintaining persistence using container orchestration jobs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.007 - Container Orchestration Job": {
          "Temporal patterns in Zeek conn.log or Windows Event IDs on nodes indicating recurring outbound connections or process creation at scheduled intervals.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and Windows Event ID 4688 timestamps on worker nodes. Look for recurring activity patterns (e.g., process creation, specific outbound connections) at fixed time intervals using time series analysis or periodicity detection methods."
          },
          "Detection of recurring network communication patterns (Zeek) or host process activity (Win Events) originating from nodes running scheduled jobs, consistent with attempts to maintain a specific malicious state.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 4688 for the repeated appearance of specific network connection patterns or process hashes originating from scheduled jobs over time. Use frequency analysis and correlation to identify attempts to maintain a persistent state or presence."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges using container orchestration jobs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053.007 - Container Orchestration Job": {
          "Zeek conn.log showing connections from IP addresses associated with scheduled job pods to internal network segments or services they should not normally access.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections originating from pod IP ranges to internal network resources. Calculate the entropy of destination ports and hosts accessed by pods from scheduled jobs; high entropy may indicate exploratory or malicious scanning/access attempts against internal infrastructure."
          },
          "Windows Event IDs on worker nodes indicating process creation or file access originating from container processes that interact with sensitive host resources.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 on worker nodes. Look for process creation events initiated by container processes that attempt to execute commands or access paths outside the container's intended scope (e.g., host filesystem paths). Correlate with other host events indicating filesystem modification or sensitive resource access."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]