
[
  {
    "Is the adversary executing code using scheduled tasks via the at utility? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.002 - At": {
          "A scheduled task is created that executes a command containing known malicious indicators such as file hashes of malware, C2 domains, or C2 IP addresses.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse command line arguments from newly created scheduled tasks (Event ID 4698) and the resulting process execution events (Event ID 4688). Extract any file paths, domains, or IP addresses. Correlate file hashes and network indicators against continuously updated threat intelligence feeds. Additionally, correlate process execution with network connection logs (Zeek conn.log) to check for connections to known malicious destinations. Alert on any confirmed matches."
          },
          "Use of the deprecated 'at.exe' utility or direct WMI calls to the 'Win32_ScheduledJob' class to create a scheduled task, especially one executing a suspicious script interpreter like PowerShell or cmd.exe.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation of 'at.exe' (Event ID 4688) as its use is highly anomalous on modern systems. Monitor for task creation events (Event ID 4698) where the client process is not 'taskschd.dll' or a known admin tool, which can indicate WMI-based creation. Flag any instance of 'at.exe' usage or a task created via 'at'/'Win32_ScheduledJob' that calls PowerShell, cmd, cscript, or wscript, as this is a common pattern for malicious execution."
          },
          "Anomalous child process execution from the Task Scheduler engine (taskeng.exe, svchost.exe) that deviates from an established baseline of normal scheduled activity in terms of process name, path, or command line structure.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate child processes (including process name, file path, command line arguments, and parent-child relationships) spawned by 'taskeng.exe' and 'svchost.exe'. Continuously monitor process creation events (Event ID 4688) and flag executions that are statistically rare or deviate from the baseline. Use frequency analysis on process names/paths and entropy measures on command line strings to identify outliers. A significant deviation may indicate malicious code execution via a scheduled task."
          },
          "A scheduled task is created that executes from a non-standard or user-writable directory, such as a user's profile, temporary folder, or public directory.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For every new scheduled task creation (Event ID 4698) and execution (Event ID 4688), parse the command line to extract the executable's file path. Compare this path against a baseline of legitimate locations for scheduled tasks (e.g., C:\\Windows\\System32, C:\\Program Files). Flag any task configured to run an executable from an unusual location like C:\\Users\\, C:\\Temp\\, C:\\ProgramData\\, or C:\\Perflogs, using frequency analysis to identify rare paths."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary using scheduled tasks via the at utility for persistence? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.002 - At": {
          "A persistent scheduled task is configured to execute a command or script that contains or connects to known malicious C2 domains or IP addresses.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Periodically audit all active scheduled tasks and their command lines. Correlate any domains and IP addresses within a task's command line (from Event ID 4698) against CTI feeds. Monitor network connections (Zeek conn.log) originating from processes spawned by scheduled tasks (correlated via Event ID 4688) and match destination IPs/domains against the same feeds. Alert on matches indicating persistent C2 communication."
          },
          "A scheduled task created via 'at' or WMI is configured with common persistence triggers, such as running at system startup, user logon, or on a high-frequency recurring schedule.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Task Scheduler logs (Event IDs 4698, 4702) for new tasks. Analyze the task's trigger configuration within the event data. Flag any newly created tasks set to run at 'System Startup', 'User Logon', or on a high-frequency recurring schedule (e.g., every hour) that are not associated with legitimate software installations. This pattern is a classic indicator of a persistence mechanism."
          },
          "A scheduled task is created and persists over time that is not correlated with any legitimate administrative activity, such as software installation or patching, and whose executed command is anomalous.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of legitimate scheduled tasks associated with enterprise software and administrative scripts. Monitor task creation (Event ID 4698) and deletion (Event ID 4699) events. Investigate any persistent task that cannot be attributed to a known application, patch, or administrative function. Use time series analysis on task execution logs to identify tasks that run with an unusual frequency or at odd hours, indicating a potential persistence mechanism."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary escalating privileges using scheduled tasks via the at utility? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1053.002 - At": {
          "A scheduled task is created to execute a script or binary with a file hash matching a known privilege escalation tool or exploit.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract file paths from the command line of newly created scheduled tasks (Event ID 4698) and their resulting processes (Event ID 4688). If possible, retrieve the hash of the file being executed. Correlate this hash against a threat intelligence database of known hacking tools, exploits (e.g., Potato family), and privilege escalation scripts. Alert on any confirmed matches."
          },
          "A scheduled task is created that modifies files or registry keys in protected system locations or executes privileged commands (e.g., net user, sc.exe) while running as NT AUTHORITY\\SYSTEM.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify tasks configured to run as SYSTEM (from Event ID 4698). Monitor the child processes of these tasks (Event ID 4688) and their command lines. Flag the execution of privileged utilities like 'net.exe', 'sc.exe', or 'reg.exe' that are used to add users, modify services, or alter the registry. This pattern suggests the task is being used as a vector to perform privileged system modifications."
          },
          "A scheduled task is created by a low-privilege user account but is configured to execute with the credentials of a high-privilege account, such as NT AUTHORITY\\SYSTEM or an administrator.": {
            "Data": "Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor scheduled task creation events (Event ID 4698). For each event, correlate the 'Subject User Name' (the identity of the creator) with the 'Author' or 'User' specified in the task's configuration data (the context it will run as). Alert on any instance where a non-administrative user creates a task scheduled to run as 'NT AUTHORITY\\SYSTEM', a member of the 'Builtin\\Administrators' group, or another privileged account. This discrepancy is a strong behavioral indicator of a privilege escalation attempt."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
