
[
  {
    "Is the adversary attempting to gain access to credentials using API hooking? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1056.004 - Credential API Hooking": {
          "Execution of a process whose file hash is known to be associated with credential API hooking tools or malware.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events, ensuring process hash information is logged. Correlate the file hash (e.g., SHA256) of every created process against a continuously updated cyber threat intelligence (CTI) feed of known malicious hashes specifically associated with API hooking malware, keyloggers, or credential dumping tools. An exact match is a high-confidence indicator requiring immediate investigation."
          },
          "Execution of a process with command-line arguments or parent-child relationships characteristic of API hooking frameworks or in-memory injection techniques.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Analyze command-line arguments using regular expressions to detect patterns associated with tools that use hooking (e.g., `rundll32.exe` loading an unknown or suspicious DLL, PowerShell commands invoking reflection, injection, or `SetWindowsHookEx`). Profile and alert on anomalous parent-child process relationships (e.g., `winlogon.exe` or `lsass.exe` spawning unexpected children like `cmd.exe`), as this can be an artifact of injection used to establish hooks."
          },
          "A legitimate process that typically handles credentials (e.g., browser, RDP client, password manager) spawns unusual child processes or initiates anomalous network connections, suggesting it has been hooked.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal child processes and network behavior for common applications that handle credentials (e.g., `chrome.exe`, `mstsc.exe`, `winlogon.exe`). Monitor for deviations, such as these processes spawning shell interpreters (e.g., `cmd.exe`, `powershell.exe`) or initiating direct network connections to rare external IP addresses. Use frequency analysis and parent-child process graphing to identify outliers. Correlate the anomalous process behavior (Event ID 4688) with the resulting network traffic (Zeek conn.log, Event ID 5156) to identify potential credential exfiltration channels."
          },
          "Anomalous network download of an executable or script followed by its execution and subsequent network callbacks, representing a potential staging and execution of a credential hooking tool.": {
            "Data": "Zeek files.log; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek `files.log` events indicating a file download (e.g., EXE, DLL, PS1 from an untrusted source) with a subsequent process creation (Event ID 4688) of that file on the same host within a short time window (e.g., < 5 minutes). Further correlate this with new outbound network connections (Zeek conn.log) from that process. Use time-series correlation to identify this download-execute-connect chain, prioritizing alerts where the executed file is new to the environment or has a low prevalence across the enterprise."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary collecting sensitive data via API hooking? (TA0009 - Collection)": {
      "Indicators": {
        "T1056.004 - Credential API Hooking": {
          "Network traffic to known malicious C2 or data exfiltration endpoints originating from a process or host suspected of credential API hooking activity.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Event ID 4688) that have been flagged as potentially involving hooking with subsequent network connections (Zeek conn.log, Event ID 5156) from the same host. Perform an inner join on the destination IP addresses from this traffic against a CTI feed of known C2 or data drop-zone infrastructures. Alert on any matches as high-confidence evidence of data collection and exfiltration."
          },
          "Creation of archive files (e.g., .zip, .rar) containing data from sensitive user directories or temporary locations where hooked credentials might be staged, especially if initiated by an unusual process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for the execution of common archiving utilities (e.g., `7z.exe`, `rar.exe`, `tar.exe`, `zip.exe`) or built-in tools (PowerShell `Compress-Archive`). Analyze command-line arguments to identify if source files originate from sensitive locations like user profiles, browser data folders, or temporary directories where keylogger outputs are often stored. Use descriptive statistics to find rare archival tool executions and correlate them with unusual parent processes or prior suspicious activity on the host."
          },
          "A critical process that handles sensitive information (e.g., lsass.exe, winlogon.exe) spawns an unexpected child process that subsequently performs file I/O or network communication.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish and enforce a strict baseline of legitimate child processes for critical credential-handling applications (e.g., `lsass.exe` should never spawn children). Monitor Windows Event ID 4688 for any deviation. If an anomalous child process is spawned, immediately correlate its activity with subsequent network connections (Zeek conn.log, Event ID 5156) or further process creations (Event ID 4688) that suggest staging or exfiltration of collected data. Use correlation analysis on hostname and time to link these events into a single high-priority incident."
          },
          "A sudden and anomalous increase in network traffic volume from a specific host to a new or rare destination, following the execution of processes potentially associated with API hooking.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the timing of suspicious process executions (from Event ID 4688) with network flow data (Zeek conn.log). For each host, establish a baseline of data transfer volume per destination using historical data. Employ time series analysis or statistical methods (e.g., Z-score, IQR on bytes transferred) to detect significant spikes in outbound traffic shortly after a suspicious process is executed. Use linear regression to model expected traffic and flag significant positive residuals. Prioritize alerts where the destination IP is rare for the host or has a low prevalence across the entire organization."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
