[
    {
        "information_requirement": "Has the adversary accessed credentials via web portal capture?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1056.003",
                "name": "Web Portal Capture",
                "evidence": [
                    {
                        "description": "Web portal login page files containing references (e.g., script sources, form action URLs) to domains or IP addresses known to be malicious.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously scan the content of web portal login pages for embedded URLs or script sources using file integrity monitoring. Correlate these discovered domains/IPs against a CTI feed of known malicious infrastructure updated daily. Additionally, monitor Zeek http.log for requests from clients to the web portal that result in content containing these malicious selectors. Alert on any matches."
                    },
                    {
                        "description": "Outbound network traffic from the web server containing credential data patterns (e.g., 'user=', 'pass=', 'token=') sent to an unusual external destination.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek http.log for outbound HTTP POST requests originating from the web portal server's IP address. Use regular expressions to inspect request bodies and URIs for common credential-related keywords (e.g., 'username', 'password', 'pwd', 'token') and their typical structures (e.g., key-value pairs). Correlate findings with Zeek conn.log to identify destinations that are not part of an established baseline of legitimate outbound connections. Use frequency analysis to flag rare destinations."
                    },
                    {
                        "description": "An unauthorized or anomalous process modifies a web portal's login page file, followed by new, unexpected outbound network connections from the web server.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of legitimate processes (e.g., deployment scripts, administrator actions) that modify web portal files. Monitor for file modification events (Event ID 4663) on login pages (e.g., login.aspx, index.html) by anomalous processes (identified via Event ID 4688). Correlate these file modification events within a short time window (e.g., 5 minutes) with the appearance of new, low-frequency outbound connections from the web server in Zeek conn.log. A time-series correlation between these two event streams can indicate compromise and exfiltration."
                    },
                    {
                        "description": "A sudden change in the outbound connection profile of a web portal server, characterized by connections to new geolocations or autonomous systems (ASNs), or a significant increase in small, periodic data transfers.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Model the baseline network behavior of the web portal server using Zeek conn.log, focusing on destination IPs, ports, geolocations, and ASNs. Use time series analysis and statistical methods (e.g., Z-score, IQR) to detect significant deviations from this baseline. Specifically look for new, persistent connections to rare destinations or a change in traffic profile (e.g., shift from serving large web assets to sending small, regular packets), which may indicate credential exfiltration as they are captured."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary collecting data via web portal capture?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1056.003",
                "name": "Web Portal Capture",
                "evidence": [
                    {
                        "description": "Creation of files on the web server with names or containing content matching signatures of known credential dumping or collection scripts/tools.",
                        "data_sources": [
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor file creation events (Event ID 4663) on the web portal server. Scan newly created files using hash-based or signature-based detection against a list of known malicious credential collection scripts (e.g., common web shells with capture functions, known JS keyloggers). Correlate with alerts from Antivirus or EDR solutions that detect these known malicious files by hash, name, or content signature."
                    },
                    {
                        "description": "A web server process (e.g., w3wp.exe) spawns a command-line interpreter or scripting engine to write captured data into a temporary file.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Event ID 4688), specifically looking for web server processes (e.g., w3wp.exe, httpd.exe) as parent processes. Flag any instances where they spawn child processes like cmd.exe, powershell.exe, cscript.exe, or bash. Scrutinize the command line arguments of these child processes for patterns involving redirection operators ('>', '>>') and file paths in temporary or unusual directories (e.g., C:\\Windows\\Temp\\, C:\\inetpub\\wwwroot\\img\\)."
                    },
                    {
                        "description": "Anomalous file write activity in unusual server directories or hidden files, where the file size grows incrementally in a pattern consistent with logging captured credentials.",
                        "data_sources": [
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal file write locations and patterns on the web server. Monitor Windows Event ID 4663 for write events to unexpected locations (e.g., image folders, temporary directories) or to files with attributes set to 'hidden'. For suspicious files, track their size over time. Use time series analysis to identify files that grow in small, discrete increments, which could correspond to individual credentials being appended to a log file. Correlate write events with peaks in web server login traffic."
                    },
                    {
                        "description": "The web server process reads from sensitive configuration files or memory and subsequently writes to a temporary log file, indicating collection of more than just user-submitted data.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4656"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate handle requests (Event ID 4656) and read access events (Event ID 4663) by the web server process to sensitive files (e.g., web.config, .env files containing database connection strings) with subsequent write events (Event ID 4663) to temporary or unusual files. Use correlation analysis to link these read-then-write sequences by the same process within a short time frame, suggesting that collected data is being staged locally before exfiltration."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
