[
  {
    "Has the adversary elevated privileges using thread execution hijacking? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.003 - Thread Execution Hijacking": {
          "Specific sequences of Windows API calls (e.g., OpenThread, SuspendThread, VirtualAllocEx, WriteProcessMemory, SetThreadContext, ResumeThread) observed in processes not typically associated with such activity.": {
            "Data": "Sysmon Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 10 (ProcessAccess) for TargetImage/SourceImage pairs where a suspicious source process opens a handle with specific access masks (e.g., THREAD_SUSPEND_RESUME, THREAD_SET_CONTEXT, PROCESS_VM_OPERATION, PROCESS_VM_WRITE) on a target process. Analyze sequences of these events occurring within a short time window involving the same source/target process pair. Use statistical analysis (e.g., frequency) to identify rare source/target pairs or access mask combinations."
          },
          "Legitimate processes (e.g., svchost.exe, explorer.exe) exhibiting unusual behavior such as attempting to access sensitive files, establish network connections to external hosts, or modify system configurations after being targeted by suspicious API calls.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event IDs (4688, 4663) and Zeek conn.log originating from processes (e.g., svchost.exe, explorer.exe) that were previously targets of suspicious process access events (Sysmon Event ID 10). Identify network connections or file accesses by these processes that deviate significantly from their historical baseline behavior using descriptive statistics and time series analysis."
          },
          "A process running with lower privileges performs actions (e.g., accesses sensitive files, modifies protected registry keys, creates system services) typically only allowed for higher-privilege processes, following process injection activity.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657; Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event IDs (4663 for sensitive file access, 4657 for protected registry modification, 4697 for service creation) attributed to processes that were recently targets in suspicious Sysmon Event ID 10 events. Establish baselines of file/registry access patterns for common low-privilege processes and flag significant deviations or access to sensitive resources by processes with unexpected Integrity Levels using descriptive statistics."
          },
          "Network connections initiated by a legitimate process (targeted by injection) to internal resources that the original process context or user would not typically access, potentially indicating lateral movement or internal reconnaissance.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from IPs/ports associated with processes previously targeted by injection (Sysmon Event ID 10). Correlate Zeek sessions with Windows Event ID 4624 (Logon Type 3 - Network) on destination systems. Identify connections to internal systems or services that the target process/user context does not normally interact with using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using thread execution hijacking? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.003 - Thread Execution Hijacking": {
          "Repeated or rapid use of thread/process manipulation API calls (e.g., CreateRemoteThread, SuspendThread) followed by memory modification calls (e.g., WriteProcessMemory, VirtualAllocEx) by processes often used for injection.": {
            "Data": "Sysmon Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Sysmon Event ID 10 (ProcessAccess) events for common injecting processes or sequences of access masks often used for injection (e.g., WriteProcessMemory followed by ResumeThread). Use frequency analysis to identify source processes that disproportionately perform these actions or combinations of actions."
          },
          "Detection of network traffic or file modifications originating from a seemingly legitimate process where the traffic/modification is inconsistent with the process's normal function or user activity.": {
            "Data": "Zeek conn.log; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 4663/4688 (if applicable) for activity attributed to known legitimate processes (TargetImage from Sysmon Event ID 10) that matches indicators of malicious activity (e.g., connections to known C2 IPs, access to sensitive data stores). Use correlation analysis to link the unusual activity back to the preceding process access events (Sysmon Event ID 10) on that specific target process."
          },
          "A legitimate process (targeted by injection) establishes network connections to known malicious infrastructure (C2 servers).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections from internal IPs to known malicious C2 server IPs or domains from threat intelligence feeds. Correlate these connections with the process name/PID on the source host if possible via host-based logs (Sysmon Event ID 3 or similar, though not mandated here). If the source process is a commonly legitimate one (e.g., svchost.exe, explorer.exe) and the connection is to a known C2, flag as suspicious using correlation analysis."
          },
          "A legitimate process (targeted by injection) spawns child processes with unusual command lines or in suspicious locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) events. Establish baselines for child processes spawned by common legitimate parent processes (e.g., what does explorer.exe typically spawn?) using frequency analysis. Flag instances where a legitimate parent process (potentially targeted by injection per Sysmon Event ID 10) spawns an unusual child process (rare name, suspicious path, encoded/obfuscated command line arguments). Use string analysis techniques (e.g., entropy) on command lines to detect obfuscation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]