[
  {
    "Has the adversary captured user input to obtain credentials? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1056 - Input Capture": {
          "Monitoring for specific Windows API calls associated with input capture (e.g., SetWindowsHook, GetKeyState, GetAsyncKeyState).": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon); Windows Event ID 11 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688, Sysmon Event ID 1) for processes known or suspected to perform API hooking or related low-level input capture. Use correlation analysis to identify processes that create files (Sysmon Event ID 11) or modify handles (if available) in ways inconsistent with normal application behavior, particularly when combined with suspicious command-line arguments. Use frequency analysis on process names and execution paths to identify statistically unusual instances associated with potential hooking activity."
          },
          "Execution of command or scripting interpreter processes with unusual parameters or from unexpected locations, potentially associated with input capture scripts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon); Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation events (Event ID 4688, Sysmon Event ID 1). Filter for common scripting/command interpreters (cmd.exe, powershell.exe, wscript.exe, cscript.exe, etc.). Analyze command-line arguments for suspicious patterns (e.g., long obfuscated strings, references to input-related functions/modules, hidden window flags). Use frequency analysis and percentile calculations on process execution paths and arguments to identify rare or unusual instances. Correlate these processes with outbound network connections in Zeek conn.log, especially to external or suspicious destinations."
          },
          "Network connections to newly observed or suspicious external websites immediately following user interaction with potentially deceptive login prompts.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for connections to newly registered domains (check registration date via WHOIS lookups) or domains with low reputation scores. Correlate with Zeek conn.log and dns.log. Analyze HTTP request patterns, user agent strings, and referer headers for signs of redirection from legitimate sites. Use time series analysis on Zeek logs to identify unusual spikes in connections to external sites following user login events or typical system startup times."
          },
          "Suspicious processes or services registering hooks for keyboard or mouse input events or running from unusual directories.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7045; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Event ID 4688, Sysmon Event ID 1) for processes executing from unusual directories (e.g., temp, user profiles, Recycle Bin) or with suspicious file names. Monitor service installation (Event ID 7045). Use frequency analysis on process paths, filenames, and service names to identify rare occurrences. Flag processes with command lines indicating code injection, hook registration, or unusual access permissions. Correlate newly created/installed processes/services with subsequent suspicious activity or unusual network connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary captured user input to collect information? (TA0009 - Collection)": {
      "Indicators": {
        "T1056 - Input Capture": {
          "Presence of unauthorized or unusual drivers or kernel modules on endpoints or servers.": {
            "Data": "Windows Event ID 7045; Windows Event ID 4697; Windows Event ID 5136",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor service installation events (Event ID 7045, 4697) and directory service changes related to services (Event ID 5136). Cross-reference installed service/driver names against known legitimate lists or threat intelligence feeds. Use time series analysis to identify spikes in service installations or installations occurring outside scheduled maintenance windows. Use frequency analysis to identify services/drivers appearing on a low number of systems."
          },
          "Network traffic patterns consistent with exfiltration of captured input data from endpoints or servers.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze network connection logs (Zeek conn.log, http.log, dns.log) from endpoints/servers. Identify connections to external destinations, particularly those with unusual data transfer sizes or patterns inconsistent with normal activity (e.g., large uploads following user logon). Use correlation analysis to link suspicious network traffic to process execution events (Event ID 4688/Sysmon 1) on the originating host. Use entropy measures on data streams or filenames (if available) to identify potentially encoded or encrypted exfiltration."
          },
          "Execution of scripting interpreter processes (PowerShell, VBScript, JScript) that read from or write to common temporary or collection file locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Event ID 4688, Sysmon Event ID 1) for scripting interpreters (powershell.exe, wscript.exe, cscript.exe, etc.). Analyze command-line arguments for references to file operations (`Get-Content`, `Out-File`, `fsutil`, etc.) involving common temporary directories (`C:\\Windows\\Temp`, user `AppData\\Local\\Temp`) or suspicious file extensions (`.log`, `.txt`, `.dat`). Use regex or pattern matching on command lines. Use frequency analysis on command argument patterns to identify statistically rare instances across the environment."
          },
          "Execution of processes that read from temporary or user profile directories followed by external network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Event ID 4688, Sysmon Event ID 1) for processes whose command line arguments or behavior indicate reading from temporary (`C:\\Windows\\Temp`, user `AppData\\Local\\Temp`) or user profile directories. Correlate these process executions with subsequent outbound network connections logged in Zeek conn.log, especially to suspicious or unusual external destinations within a short time window. Analyze data transfer volumes in Zeek conn.log for these correlated sessions using descriptive statistics to identify outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]