[
  {
    "Has the adversary executed code using scheduled tasks? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.005 - Scheduled Task": {
          "Suspicious process execution originating from scheduled task processes (svchost.exe or taskeng.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 where the ParentProcessName is 'svchost.exe' or 'taskeng.exe'. Identify child processes that are unusual or malicious (e.g., cmd.exe, powershell.exe, specific malware names) and are not correlated with legitimate scheduled task executions. Use correlation analysis to link parent/child processes and identify outliers."
          },
          "Scheduled task creation or modification events that do not correlate with known system activity or legitimate software.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698, 4702, 4699. Establish a baseline of legitimate scheduled task activity (creation, update, deletion) based on known software installations, patch cycles, and administrative actions. Use statistical methods (e.g., frequency analysis, anomaly detection based on historical trends) to flag tasks created/modified/deleted outside of these baselines, especially those with suspicious names or parameters."
          },
          "Use of `schtasks.exe` command-line utility with suspicious parameters or from unusual source processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `schtasks.exe` process executions. Analyze command line arguments for suspicious patterns (e.g., `/create`, `/run`, `/tn` with unusual names, `/tr` pointing to suspicious executables or scripts, `/sc` with unusual schedules). Identify executions initiated by processes other than standard administrative tools or user shells (e.g., explorer.exe, cmd.exe, powershell.exe). Use frequency analysis on command line parameters and source processes to identify rare or unique usage."
          },
          "Detection of a suspicious process starting exactly at the scheduled time of a potentially malicious task.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Filter for processes where the parent process is the Windows Task Scheduler executable (`taskeng.exe` or `svchost.exe`). Analyze the command line and process name of these child processes for suspicious indicators. Correlate the execution time with scheduled times of tasks recorded in Event ID 4698/4702. Use frequency analysis on child process names and command lines to identify outliers originating from the task scheduler that don't match known legitimate tasks."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using scheduled tasks? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.005 - Scheduled Task": {
          "Rapid creation and subsequent deletion of scheduled tasks.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of Windows Event ID 4698 (created) followed quickly by Event ID 4699 (deleted) for the same task name. Flag instances where the time difference is unusually short (< e.g., 60 seconds), suggesting temporary execution rather than persistent scheduling. Use correlation analysis to link creation and deletion events by TaskName."
          },
          "Scheduled task creation initiated via WMI or PowerShell cmdlets from unusual sources.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for powershell.exe or wmic.exe as ProcessName. Look for command lines that include 'New-ScheduledTask', 'Register-ScheduledTask', 'Invoke-CimMethod' targeting scheduled tasks, or 'wmic ... ScheduledJobs'. Correlate with Windows Event ID 4104 (PowerShell Script Block) for detailed command analysis. Identify suspicious source processes or user accounts initiating these commands using frequency or entropy analysis on source process names/paths."
          },
          "Scheduled tasks configured to run at logon or system startup with suspicious names or pointing to non-standard executable locations.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 (Task Created) and 4702 (Task Updated). Filter for tasks configured with startup triggers (e.g., 'At logon', 'At startup'). Examine the 'Task Name' and 'Action' (executable path and arguments) fields within the event data. Use frequency analysis to identify tasks with unusual or generic names (e.g., 'Update', 'Cleaner') or those pointing to executables in temporary directories, user profile locations, or network shares not typically used for legitimate software."
          },
          "Registry modifications related to scheduled tasks (e.g., Index, SD values) potentially indicative of hidden tasks.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure system access control lists (SACLs) on scheduled task registry keys (`HKLM:\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tasks\*` and subkeys) to log value modifications (Event ID 4657). Specifically look for modifications to the 'Index' value or the 'SD' (Security Descriptor) value which can be used to hide tasks. Identify suspicious modifications to these values, especially when not correlated with standard task updates or deletions logged via Event ID 4702."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary elevated privileges using scheduled tasks? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1053.005 - Scheduled Task": {
          "Scheduled tasks configured to run under elevated privileges (e.g., SYSTEM) executing suspicious commands.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 (Task Created) and 4702 (Task Updated). Identify tasks configured with the 'Run Level' set to 'Highest' or 'User' set to SYSTEM or other high-privilege accounts. Correlate these task creation/update events with subsequent process execution events (Windows Event ID 4688) where the process is launched by svchost.exe/taskeng.exe under the SYSTEM/Administrator context and the command line/process name is suspicious. Use frequency analysis on suspicious command lines and process names launched by elevated tasks."
          },
          "Anomalous process execution or file modifications occurring at scheduled intervals without corresponding scheduled task creation/execution events in standard logs.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes executing at periodic intervals that cannot be attributed to known scheduled tasks visible in Event ID 4698 or standard task enumerations. Use time series analysis or periodicity detection on process creation timestamps. Investigate the source process, command line, and user context of these periodically executing processes to identify potentially hidden or manually triggered scheduled tasks used for persistence or privilege escalation."
          },
          "Scheduled task creation events where a lower privilege user creates a task configured to run with higher privileges.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 (Task Created) and 4702 (Task Updated). Compare the 'Author' field (the user account that registered or updated the task) with the 'Run Level' or 'User' field specifying the account under which the task will execute. Flag instances where a standard user account creates or modifies a task configured to run with Administrator or SYSTEM privileges. Establish baselines of legitimate high-privilege task creation by authorized administrators using frequency analysis on the Author field for elevated tasks."
          },
          "Suspicious network connections or file modifications originating from processes launched by the Task Scheduler running with elevated privileges.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints; Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) where the parent is the Task Scheduler process (`svchost.exe`/`taskeng.exe`) and the 'SubjectUserSid' indicates an elevated account (SYSTEM, Administrator) with subsequent network connection events (Windows Event ID 5156, Zeek conn.log) or file modification events originating from that specific process instance. Identify connections to unusual external IPs (via threat intelligence lookup/frequency analysis) or modifications to sensitive system files."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]