
[
  {
    "Is the adversary attempting to elevate privileges or execute code using process hollowing? (TA0004 - Privilege Escalation, TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.012 - Process Hollowing": {
          "A process exhibiting behavioral indicators of hollowing initiates network connections to known malicious C2 IP addresses or domains.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes flagged by other pattern or behavioral detections (e.g., unusual parent, mismatched command line). Correlate the Process ID and host from these flagged events (Windows Event ID 4688) with subsequent network connections (Zeek conn.log, dns.log). Cross-reference all destination IPs and domains against a high-confidence, continuously updated threat intelligence feed. A match provides a high-fidelity indicator of malicious hollowing activity."
          },
          "A legitimate system process (e.g., svchost.exe, explorer.exe) is created by an anomalous parent process (e.g., an Office application, script interpreter, or a process from a temporary/user-writable location).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of normal parent-child process relationships from Windows Event ID 4688 data. Create a model or explicit whitelist of expected parent processes for common system binaries (e.g., 'services.exe' is a valid parent for 'svchost.exe'). Alert on any instance where these system binaries are created by a parent that is not on the established whitelist. Use frequency analysis to score the rarity of observed parent-child pairs and investigate the least frequent combinations."
          },
          "Creation of a legitimate process with a null or mismatched command line relative to its parent, followed by network activity inconsistent with the hollowed process's normal function.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Event ID 4688 for process creation events, specifically inspecting the 'CommandLine' field. Flag instances where common target processes (e.g., svchost.exe, runtimebroker.exe) are created with an empty command line or arguments that do not match established patterns for their known parent processes. Correlate these flagged process instances with subsequent network activity (Zeek conn.log). Baseline the typical network behavior (ports, destinations, protocols) of the legitimate process and use correlation analysis to alert on significant deviations, such as an explorer.exe process making non-HTTP/S connections to a rare external IP."
          },
          "A process is created and exhibits an unusually long delay between its creation time and its first network connection or child process activity, suggesting it was held in a suspended state for manipulation.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation time from Windows Event ID 4688 with the timestamp of its first outbound network connection (from Zeek conn.log) or first child process creation (from another Event ID 4688). Establish a baseline for this 'time-to-first-action' delay for common processes. Use statistical analysis (e.g., calculating the Inter-Quartile Range (IQR) and flagging delays > 1.5x IQR from the upper quartile via box-plots) to identify outliers where this delay is abnormally long, suggesting the process was held suspended for memory manipulation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting to evade defenses using process hollowing? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.012 - Process Hollowing": {
          "A legitimate Windows process communicates with network infrastructure (IPs/domains) matching known adversary C2 indicators, after being created by an unusual parent process.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify legitimate processes (e.g., svchost.exe, notepad.exe) spawned by an unusual parent (leveraging parent-child pattern detection). Capture all destination IPs and domains from the child process's subsequent network activity (Zeek conn.log, dns.log). Inner join these destinations against a CTI feed of known malicious infrastructure. An alert on a match provides high-confidence evidence of a compromised process being used for defense evasion."
          },
          "A process is created with command-line arguments or by a creator process name that matches signatures of known process hollowing tools or malware families.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan the 'Creator Process Name' and 'Command Line' fields in Windows Event ID 4688 logs for signatures of known process hollowing tools or malware families (e.g., command-line flags like '--inject', '--hollow', or specific argument patterns used to specify a target executable and payload file). Maintain and regularly update a list of these regular expression patterns based on public threat reporting on malware using T1055.012."
          },
          "A typically non-network-facing process (e.g., notepad.exe, calculator.exe) or a system process with predictable network behavior (e.g., svchost.exe) initiates outbound network connections to rare domains or over non-standard ports.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal network activity for common processes, including whether they connect to the network at all and their typical destination ports/protocols. Monitor Event ID 4688 and Zeek logs. Flag processes that initiate network connections when they normally shouldn't (e.g., calculator.exe). For processes that do connect (e.g., svchost.exe), use frequency analysis (e.g., identify statistically rare domains or destination ports based on historical data) and correlation analysis to identify connections to unusual destinations or over atypical ports, suggesting the process's normal execution flow has been replaced."
          },
          "A parent process creates a child process and terminates immediately or abnormally, consistent with a 'hollow and run' or 'hollow and terminate' pattern.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation (Event ID 4688) with process termination (Event ID 4689) logs by Process ID. Identify parent-child pairs where the parent process terminates within an extremely short timeframe (e.g., <1 second) after creating the child process. Use descriptive statistics to establish a baseline lifespan for parent processes after spawning specific children and flag significant negative outliers. Investigate these events as potential indicators of a loader that hollows a target and then immediately terminates to evade detection."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
