[
  {
    "Is the adversary executing malicious code on the network using PowerShell? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.001 - PowerShell": {
          "Suspicious PowerShell script block or command execution logs detected on endpoints or servers.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4103; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4104 (PowerShell Script Block Logging) and 4103 (Module Logging) from endpoints/servers. Analyze script block content and commands for known malicious patterns, obfuscation techniques, or suspicious cmdlets (e.g., 'Invoke-Expression', 'Invoke-Command', 'DownloadFile'). Use frequency analysis to identify rarely seen command-line arguments or script block hashes."
          },
          "Detection of System.Management.Automation.dll loading into unusual or non-standard processes.": {
            "Data": "Windows Event ID 7; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7 (Sysmon ImageLoad) for 'Image Loaded' being 'System.Management.Automation.dll'. Correlate these events with Process Creation events (Windows Event ID 4688). Use statistical analysis (e.g., frequency distribution, rare value analysis) to identify processes or parent processes that rarely or never load this DLL under normal circumstances, flagging them as potentially suspicious."
          },
          "Detection of PowerShell execution policy changes or invocation of powershell.exe in environments where it is typically not used.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4105",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where 'New Process Name' contains 'powershell.exe' or 'pwsh.exe'. Filter command line arguments for parameters related to execution policy changes (e.g., '-ExecutionPolicy', 'Set-ExecutionPolicy'). Flag execution events in environments with low baseline PowerShell usage (frequency zero/near zero). Also, monitor Windows Event ID 4105 for 'ExecutionPolicy' changes, flagging unauthorized or unusual policy settings compared to baseline."
          },
          "PowerShell session start (Event ID 400) from unusual hosts (remote/local) or with unexpected EngineVersion, or execution of suspicious cmdlets like Invoke-Command.": {
            "Data": "Windows Event ID 400; Windows Event ID 403; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 400 (Engine startup) and 403 (Engine shutdown) to track PowerShell session activity. Analyze 'HostName' in Event ID 400 to identify unusual local or remote sessions (e.g., remote sessions to systems not typically managed remotely). Analyze 'EngineVersion' in 400 for unexpected versions (potential downgrade attack). Correlate session start/end times from 400/403 with command execution logs (Event ID 4104) to analyze commands run during suspicious sessions, specifically looking for high-risk cmdlets like 'Invoke-Command' or 'Invoke-Expression'. Use frequency analysis on EngineVersion and HostName combinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]