[
  {
    "Is the adversary attempting to gain credentials using GUI input capture? (TA0006 - Credential Access)": {
      "Indicators": {
        "Execution of processes known to be used for GUI prompt mimicry or associated scripting interpreters (like PowerShell, cmd) with unusual command lines.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for creation of processes like powershell.exe, cmd.exe, or other scripting/executable names known for credential harvesting. Filter for suspicious parent-child relationships (e.g., Office document spawning PowerShell). Use frequency analysis on process names and command lines to identify rare executions or parameters associated with GUI manipulation or credential requests. Compare against a baseline of approved software."
        },
        "Identification of suspicious strings or parameters in command-line arguments used with scripting interpreters.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze command-line arguments captured in Windows Event ID 4688 for scripting processes (PowerShell, cmd). Search for specific strings related to GUI creation ('System.Windows.Forms', 'Add-Type', 'Show-Dialog', 'SendKeys', credential-related keywords like 'password', 'credential', 'login'). Use entropy measures on command strings to identify highly obfuscated or unusual sequences indicative of malicious scripting attempting prompt mimicry."
        },
        "Creation of unexpected or suspicious GUI windows or dialog boxes originating from unusual processes or contexts.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for process creation associated with potential GUI prompt mimicry (e.g., scripting interpreters, unusual executables). Correlate these processes with known techniques for creating GUI elements. While direct logging of window creation is limited in standard events, analysts should prioritize investigation of suspicious processes known to launch GUI elements, especially if they originate from unexpected locations or have unusual parent processes. Monitor network activity (Zeek conn.log/http.log) for immediate outbound beacons from these processes."
        },
        "Suspicious process execution (related to GUI mimicry) occurring immediately after user interaction events (e.g., opening documents, browsing specific sites).": {
          "Data": "Windows Event ID 4688; Zeek http.log",
          "Data Platform": "Endpoints, Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Windows Event ID 4688 logs for processes identified as potential GUI prompt mimicry agents (e.g., scripting interpreters, suspicious executables). Correlate the timestamps of these process creations with recent user activity inferred from logs, such as execution of common user applications (Office suite) or browser activity observed in Zeek http.log. Use correlation analysis to identify instances where suspicious processes launch within a short time window (e.g., 10-30 seconds) after user-initiated events, suggesting a potential payload delivery or phishing attempt."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary collecting sensitive data (credentials) using GUI input capture? (TA0009 - Collection)": {
      "Indicators": {
        "Outbound network connections immediately following potential GUI prompt mimicry events.": {
          "Data": "Zeek conn.log; Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Identify timestamps of potential GUI prompt mimicry events (from host logs like Windows Event ID 4688 analysis). Within a short time window (e.g., 60 seconds) after these events, check Zeek conn.log for outbound connections from the same host. Filter for connections to unusual ports, high-entropy domains, or IPs matching threat intelligence feeds. Use time series analysis to track the pattern of outbound connections from a host relative to detected scripting/process activity, looking for spikes or changes indicative of exfiltration or C2."
        },
        "Correlation between host discovery activities and subsequent suspicious process/script execution.": {
          "Data": "Windows Event ID 4688; Zeek conn.log",
          "Data Platform": "Endpoints, Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Identify events related to host/application discovery (e.g., execution of 'query user', 'tasklist', 'netstat' commands in Windows Event ID 4688; network scans or queries in Zeek conn.log). Identify potential GUI prompt mimicry events (from other evidence points). Use correlation analysis on the timestamps and hostnames/IPs of these two event types to find instances where discovery is immediately followed by suspicious process/script activity on the same host, suggesting targeted credential collection or lateral movement preparation."
        },
        "Unusual file modifications or access events on credential-related files or system components immediately following potential GUI prompt mimicry.": {
          "Data": "Windows Event ID 4663; Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4663 (Object Access) on endpoints and servers, specifically filtering for access attempts (read, write, delete) to sensitive files or registry keys commonly associated with credential storage (e.g., browser credential files, LSA secrets). Correlate these file access events with the timestamps and source process IDs of potential GUI prompt mimicry events (from analysis of Windows Event ID 4688). Flag instances where file access to sensitive locations occurs shortly after suspicious process activity on the same host."
        },
        "Outbound network connections containing unusual data patterns or connections to data staging/exfiltration services immediately following potential credential collection.": {
          "Data": "Zeek conn.log; Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Filter Zeek conn.log and http.log for outbound connections from hosts suspected of credential collection, occurring within a short timeframe (e.g., 5 minutes) after the suspicious event. Analyze the size of data transferred (`orig_bytes`, `resp_bytes`, `request_body_len`, `response_body_len`) for anomalies using descriptive statistics (e.g., unusually large transfers). Look for connections to domains or IPs associated with data-sharing sites (pastebin, cloud storage) or known C2 infrastructure. If packet data is available, calculate and analyze entropy of transferred data for patterns indicative of encrypted or obfuscated exfiltration."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]