[
  {
    "Is the adversary executing code using scheduled tasks via the at utility? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.002 - At": {
          "Creation or modification of scheduled tasks using the 'at' command or WMI class 'Win32_ScheduledJob' on systems.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Task Scheduler Operational logs (Event IDs 4698, 4702, and older Windows Event IDs 106, 140). Identify events where the source indicates use of the 'at' command or related WMI activity ('Win32_ScheduledJob'). Compare creation details (task name, command, user, time) against known baseline of legitimate scheduled tasks. Flag tasks created with unusual names, commands, or timing using frequency analysis."
          },
          "Anomalous process execution originating from taskeng.exe or svchost.exe that doesn't match known legitimate scheduled programs.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Process Creation logs (Event ID 4688) where the Parent Process Name is taskeng.exe (or svchost.exe on older Windows). Identify child processes that are statistically rare based on process name, command line arguments, or execution location using frequency analysis or entropy measures on command strings. Investigate associated network connections (Zeek conn.log) made by the executed process."
          }
        }
      }
    }
  },
  {
    "Is the adversary using scheduled tasks via the at utility for persistence? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.002 - At": {
          "Scheduled tasks defined with 'at' that persist over time and run unusual commands or scripts.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Task Scheduler Operational logs (Event IDs 4698, 4702) over a prolonged period. Identify tasks created or modified via 'at.exe' or WMI. Track the continued existence (lack of deletion Event ID 4699) and repeated execution (via process execution logs or task history if enabled) of these tasks. Analyze their defined actions/commands for suspicious activity. Use time series analysis on task execution frequency to detect unusual scheduling patterns."
          },
          "Scheduled task files in %systemroot%\\System32\\Tasks or /var/spool/cron/atjobs/ that don't correlate with installed applications or patches.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4699, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Task Scheduler Operational logs for creation and deletion events (Event IDs 4698, 4699). Correlate the creation/modification of tasks via 'at' or WMI with known software installations or patch cycles. Flag tasks that lack correlation with legitimate system events. Investigate any network connections (Zeek conn.log) made by the commands associated with these uncorrelated tasks."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges using scheduled tasks via the at utility? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1053.002 - At": {
          "Scheduled tasks created or modified by non-administrator or non-SYSTEM accounts using 'at' or WMI.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Task Scheduler Operational logs (Event IDs 4698, 4702) to identify events where the 'User' field indicates a non-administrator or non-SYSTEM account is creating or modifying a task via 'at' or WMI ('Win32_ScheduledJob'). Analyze the task configuration to determine if it's set to run with elevated privileges."
          },
          "Scheduled tasks configured to run as high-privilege accounts (like SYSTEM) created outside of standard administrative procedures.": {
            "Data": "Windows Event ID 4698, Windows Event ID 4702, Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Task Scheduler Operational logs (Event IDs 4698, 4702) for tasks configured to run using a high-privilege account (e.g., SYSTEM, Administrator, Service accounts). Investigate tasks created via 'at' or WMI that are set to run with high privileges but are not associated with standard system functions or administrative deployments. Correlate with Security Event ID 4624 (Logon Type 4 - Scheduled Task) to confirm the user context under which the task attempted execution."
          }
        }
      }
    }
  }
]