[
  {
    "Has the adversary accessed credentials via web portal capture? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1056.003 - Web Portal Capture": {
          "Unauthorized changes to files on the external-facing web portal server, particularly login page files.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (access attempts), 4656 (handle requested), 4657 (registry value creation/modification/deletion) on web portal servers for modifications or read access to critical login page files (e.g., index.html, login.asp/php, javascript files) or related registry keys. Baseline normal file/registry access patterns by trusted processes/users and use correlation analysis to identify unauthorized or anomalous access events."
          },
          "Outbound network connections from the web portal server to unusual or external destinations, potentially containing captured credential data.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log originating from the web portal server. Identify connections to non-standard ports or external IPs that do not belong to known legitimate services. Use frequency analysis and time series analysis to identify unusual connection destinations or sudden changes in connection volume to new destinations."
          },
          "Unusual outbound connections (HTTP/S POST or other protocols) originating from the web portal server containing patterns indicative of credential transmission.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for outbound POST requests originating from the web portal server to external or unusual destinations. Analyze request parameters and body content for strings or encoding patterns associated with leaked credentials (e.g., 'user=', 'pass=', base64 strings). Correlate with Zeek conn.log for connection details and Zeek ssl.log for suspicious certificate information. Use frequency analysis on destination IPs/ports to flag rare occurrences."
          },
          "Attempts by non-standard processes on the web portal server to write data to unexpected file paths or registry keys immediately following user login attempts.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (write access) and 4688 (process creation) on the web portal server. Correlate these events with user login timestamps (if available) or web server access logs showing login attempts. Look for write events to unusual locations or registry modifications by processes not typically associated with the web server software, especially occurring concurrently with login requests. Use correlation analysis to link process activity with login attempts and file writes, identifying deviations from baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary collecting data via web portal capture? (TA0009 - Collection)": {
      "Indicators": {
        "T1056.003 - Web Portal Capture": {
          "Creation or modification of files on the web portal server potentially used to store captured credentials.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (write access) on web portal servers for the creation or modification of files with unusual names or in unexpected directories, particularly those that could store credentials. Use descriptive statistics to identify file types or locations with high rates of anomalous changes."
          },
          "Anomalous outbound data transfer volume or patterns from the web portal server that could indicate exfiltration of collected credentials.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound byte counts from the web portal server. Calculate descriptive statistics (mean, median, quartiles) and use box plots or IQR analysis to identify sessions with unusually large outbound data transfers compared to historical data. Use time series analysis to detect spikes in outbound data volume that deviate significantly from the baseline."
          },
          "Creation or modification of hidden files or files in unusual directories on the web portal server containing sensitive data patterns.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (write access) for file creation/modification and Event ID 4657 (registry value set) on the web portal server. Specifically look for writes to hidden files, temporary directories, or unusual registry paths. Analyze file content or registry values (if possible and authorized) for patterns indicative of encoded credentials or collected data (e.g., base64, key=value pairs). Use descriptive statistics to identify file paths or registry keys with anomalous write activity."
          },
          "Execution of suspicious command-line tools or scripts by the web server process or related user accounts on the web portal server.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on the web portal server for process creations initiated by the web server process (e.g., w3wp.exe, httpd) or associated service accounts. Look for executions of command interpreters (cmd.exe, powershell.exe), scripting engines (cscript.exe, wscript.exe, python.exe), or data manipulation tools with suspicious command-line arguments (e.g., encoding/decoding, file operations on unusual paths, network connections). Use frequency analysis to baseline normal process execution by these accounts/processes and flag outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]