[
  {
    "Has the adversary gained access to credentials? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1056.001 - Keylogging": {
          "Suspicious Windows Registry modifications or driver installations commonly associated with keyloggers.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4697, Windows Event ID 7045, Sysmon Event ID 6",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to common keylogger registry locations (e.g., Run keys, AppInit_DLLs). Monitor Windows Event ID 4697 and 7045 for service installations, especially those involving unsigned drivers (Sysmon Event ID 6). Correlate these events with process creation (Windows Event ID 4688) and file creation (Sysmon Event ID 11)."
          },
          "Processes making frequent calls to keylogging-related Windows API functions combined with the creation of new executable files or scripts.": {
            "Data": "Windows Event ID 4688, Sysmon Event ID 11",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) and file creation events (Sysmon Event ID 11) for processes with suspicious names or locations that coincide with the creation of executable files or scripts. Use entropy analysis on new executable files to identify packed or suspicious code, which keyloggers often use, correlating with process activity."
          },
          "An unknown or suspicious process creating files with patterns indicative of keystroke logging (e.g., frequent small writes, hidden files) especially after potential browser cookie deletion.": {
            "Data": "Windows Event ID 4688, Sysmon Event ID 1, Sysmon Event ID 11, Sysmon Event ID 23",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for newly created processes (Windows Event ID 4688, Sysmon Event ID 1) from untrusted paths or with suspicious names that subsequently create files (Sysmon Event ID 11) in unusual locations or with hidden attributes. Analyze file I/O patterns for these processes (e.g., frequent small appends). Correlate with recent file deletion events (Sysmon Event ID 23) targeting browser cookie stores by non-browser processes, which could indicate an attempt to force re-authentication and capture fresh credentials."
          },
          "Anomalous deletion of browser cookies or cache data by an unexpected process, not attributable to legitimate browser activity or user action.": {
            "Data": "Sysmon Event ID 23, Windows Event ID 4688, Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 23 for file deletion events targeting common browser cookie/cache paths. Identify the responsible process (Windows Event ID 4688 or Sysmon Event ID 1 for process context). Flag deletions by non-browser processes, scripts, or tools not part of standard system maintenance. Use frequency analysis to detect unusual spikes in cookie deletion activity or deletions occurring outside user interactive sessions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary collecting sensitive information? (TA0009 - Collection)": {
      "Indicators": {
        "T1056.001 - Keylogging": {
          "Detection of known keylogging software artifacts (files, registry keys, services) or the installation of unsigned/suspicious drivers on endpoints.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4697, Windows Event ID 7045, Sysmon Event ID 1, Sysmon Event ID 6, Sysmon Event ID 11, Sysmon Event ID 12, Sysmon Event ID 13",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Perform scheduled scans for known keylogging file names, registry keys, or mutexes on endpoints. Identify signed/unsigned drivers loaded (Sysmon Event ID 6) and services created (Windows Event ID 4697, 7045). Use correlation analysis across endpoints to identify repeated attempts to install services or modify registry keys associated with keyloggers."
          },
          "Correlation of process activity involving input capture APIs with network connections to external IPs, indicating potential exfiltration of collected keystrokes.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) involving potentially suspicious processes or those identified in other alerts with network connection logs (Zeek conn.log). Identify processes making connections to unusual or external IP addresses, particularly those observed after suspicious process/file creation. Use statistical analysis on connection frequency and volume to identify anomalous network activity from suspect processes."
          },
          "Installation or loading of unsigned or suspicious kernel-mode drivers or services, potentially linked to processes not associated with legitimate system input or management.": {
            "Data": "Sysmon Event ID 6, Windows Event ID 7045, Windows Event ID 4697, Windows Event ID 4688, Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for loading of unsigned or newly compiled drivers (Sysmon Event ID 6) and new service installations (Windows Event ID 7045, 4697) with suspicious names, descriptions, or binary paths. Correlate these events with the parent process (Windows Event ID 4688 or Sysmon Event ID 1) that initiated them. Maintain a baseline of legitimate drivers/services and their properties (e.g., signer, path); investigate deviations, particularly those involving processes not typically responsible for driver/service management."
          },
          "Periodic, small network connections to external destinations from a process that lacks a legitimate reason for such communication, consistent with batched keystroke exfiltration.": {
            "Data": "Zeek conn.log, Windows Event ID 4688, Sysmon Event ID 1, Sysmon Event ID 3",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes (Windows Event ID 4688, Sysmon Event ID 1) that are not browsers or known communication tools, exhibiting periodic outbound network connections (Sysmon Event ID 3, Zeek conn.log). Analyze connection characteristics (destination IP/port, frequency, data volume using Zeek conn.log's `orig_bytes` and `resp_bytes`). Use time series analysis to detect regular, small data transfers (e.g., <1KB) to untrusted external destinations. Correlate destination IPs with threat intelligence feeds for known C2 servers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]