[
  {
    "Has the adversary attempted to elevate privileges using ListPlanting? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.015 - ListPlanting": {
          "Suspicious sequence of Windows API calls (e.g., FindWindow, VirtualAllocEx, WriteProcessMemory) originating from an unexpected process.": {
            "Data": "Windows Event ID 10, Windows Event ID 8, advanced host telemetry",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 10 (ProcessAccess) and advanced host telemetry for sequences of API calls (e.g., FindWindow/Ex, EnumWindows/ChildWindows targeting SysListView32 parent processes followed by memory manipulation like VirtualAllocEx, WriteProcessMemory, CreateRemoteThread). Calculate the frequency and sequence correlation of these calls within specific processes. Investigate processes exhibiting unusual sequences or high correlation scores with known malicious patterns."
          },
          "Excessive use of LVM_SETITEMPOSITION and/or LVM_GETITEMPOSITION messages via SendMessage/PostMessage by a process.": {
            "Data": "Windows Event ID 10, advanced host telemetry",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze advanced host telemetry for calls to SendMessage/PostMessage. Filter for messages targeting SysListView32 controls (via window handles obtained from prior FindWindow/EnumWindows calls) using LVM_SETITEMPOSITION and LVM_GETITEMPOSITION arguments. Quantify the volume/rate of these messages per process and flag outliers using IQR or standard deviation from the baseline."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary using ListPlanting to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.015 - ListPlanting": {
          "Unusual patterns or high frequency of Window enumeration/modification API calls (FindWindow, EnumWindows) preceding unusual memory operations.": {
            "Data": "Windows Event ID 10, Windows Event ID 8, advanced host telemetry",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of typical API call sequences and frequencies per process using historical advanced host telemetry. Use correlation analysis to identify deviations from normal patterns, specifically looking for clustering of window enumeration/access calls (FindWindow/Ex, EnumWindows/ChildWindows, Event ID 10 on relevant processes) immediately preceding memory modification API calls (Event ID 8, advanced telemetry for VirtualAllocEx, WriteProcessMemory). Flag processes with high correlation scores for these anomalous sequences."
          },
          "A process exhibiting ListPlanting-related API calls subsequently making unusual network connections or accessing sensitive files.": {
            "Data": "Windows Event ID 1, Windows Event ID 3, Windows Event ID 11, Zeek conn.log, Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate processes flagged for ListPlanting-related API activity (from above actions) with subsequent process activity logs (Windows Event ID 1, 4688), network connections (Windows Event ID 3, Zeek conn.log, http.log), and file access events (Windows Event ID 11). Identify anomalous post-injection behaviors such as connections to uncommon ports/IPs, access to sensitive file paths, or creation of new executable files using correlation analysis and outlier detection on network/file access patterns."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]