
[
  {
    "Has the adversary executed code or commands using Visual Basic? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.005 - Visual Basic": {
          "A script host process (wscript.exe, cscript.exe) making network connections to IP addresses or domains known to be malicious C2 infrastructure.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) for wscript.exe/cscript.exe with network connection events (Windows Event ID 5156 or Zeek conn.log by source IP and timestamp). Extract destination IP addresses and domains from Zeek logs. Inner join the destination indicators against a high-confidence threat intelligence feed of malicious C2 servers, sinkholes, or known adversary infrastructure updated within the last 24 hours. Alert on any confirmed matches."
          },
          "Execution of a script host (wscript.exe, cscript.exe) with command-line arguments matching known malicious VBS tools, encoders, or common obfuscation patterns.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 command lines for wscript.exe/cscript.exe execution. Use regular expression matching to search for patterns indicative of specific VBS-based tools (e.g., Koadic, CactusTorch), suspicious keywords (CreateObject, WScript.Shell, ADODB.Stream), common droppers (//B //E:VBScript), or obfuscation techniques like concatenated Chr() functions. Maintain and update a library of these malicious patterns. Use entropy measures on command-line arguments to flag highly randomized or encoded strings that may indicate custom obfuscation."
          },
          "An Office application (e.g., winword.exe, excel.exe) spawning a script host process (wscript.exe, cscript.exe), indicating potential macro-based execution of a VBScript.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Flag any instance where ParentProcessName is an Office application (winword.exe, excel.exe, powerpnt.exe, outlook.exe) and NewProcessName is wscript.exe or cscript.exe. Establish a baseline of normal parent-child process relationships and use frequency analysis (e.g., identifying combinations seen for the first time or on a small percentage of hosts) to identify rare and suspicious activity, reducing false positives from legitimate administrative scripts."
          },
          "Creation of a Visual Basic Script file (.vbs, .vbe) in a common user-writable or temporary directory followed closely by its execution.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file creation events (Windows Event ID 4663 with 'Accesses: WriteData' or 'WriteAttributes') for files with .vbs or .vbe extensions in temporary or user-profile locations (e.g., %TEMP%, %APPDATA%, C:\\Users\\Public\\) with subsequent process execution events (Windows Event ID 4688) of wscript.exe or cscript.exe referencing that exact file path. Use a short time window (e.g., under 60 seconds) for correlation analysis. Profile typical locations for script creation and execution and alert on deviations from this baseline."
          },
          "A non-standard process loading the Visual Basic Scripting Engine library (vbscript.dll), suggesting an attempt to execute VBScript code outside of its normal hosts.": {
            "Data": "Sysmon Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (Image Loaded) for 'vbscript.dll'. Establish and maintain a baseline of legitimate processes that are expected to load this library (e.g., wscript.exe, cscript.exe, mshta.exe, iexplore.exe, specific third-party applications). Alert when 'vbscript.dll' is loaded by any process not on the established baseline allow-list, such as svchost.exe, rundll32.exe, or other unexpected binaries, as this is a strong indicator of process injection or abuse."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
