[
  {
    "Has the adversary executed commands using AutoHotKey or AutoIT scripts? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.010 - AutoHotKey & AutoIT": {
          "Suspicious process execution involving AutoHotKey or AutoIT interpreter with script file arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line or process path includes 'AutoIt3.exe' or 'AutoHotkey.exe' and the arguments include file paths ending in '.au3' or '.ahk'. Use frequency analysis on the script file names or paths being executed to identify rare occurrences or deviations from expected behavior compared to a baseline."
          },
          "Execution of unknown or newly created executable files exhibiting characteristics of compiled automation scripts.": {
            "Data": "Windows Event ID 4688; Zeek pe.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of new or unknown '.exe' files. Analyze Zeek pe.log for characteristics of compiled AutoIt/AutoHotKey executables (e.g., sections, imports) if possible. Use correlation analysis to link file creation events (if available and relevant) and execution timelines. Use descriptive statistics or anomaly detection on file properties (size, entropy) compared to known good executables."
          },
          "Outbound network connections initiated by AutoIt3.exe or AutoHotkey.exe processes or suspicious compiled script executables.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 for outbound connections originating from processes named 'AutoIt3.exe', 'AutoHotkey.exe', or suspicious compiled script executables. Correlate with Zeek conn.log entries. Use frequency analysis to identify rare destination IPs/ports or connections outside of normal business hours. Use correlation analysis to link process execution with subsequent network connections."
          },
          "Execution of scripting interpreters or system utilities with suspicious arguments originating from AutoIt/AutoHotKey parent processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify process creation events where the parent process name is 'AutoIt3.exe', 'AutoHotkey.exe', or a suspicious compiled script executable. Analyze the command line arguments of the new child process for execution of common interpreters (e.g., cmd.exe, powershell.exe) or utilities with unusual or potentially malicious arguments. Use correlation analysis to trace parent-child process relationships and identify command line patterns using string matching or entropy analysis for obfuscated commands."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]