
[
  {
    "Is the adversary performing process discovery on systems or network devices? (TA0007 - Discovery)": {
      "Indicators": {
        "T1057 - Process Discovery": {
          "Execution of a process whose file hash matches a known malicious tool or script used for system discovery.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Windows Event ID 4688 for new process creation events. Extract the process hash (requires appropriate audit policy configuration to be logged) and inner join it with a cyber threat intelligence (CTI) feed of file hashes for known malicious discovery tools and scripts (e.g., Seatbelt, BloodHound, SharpHound, adversary-specific binaries). Alert on any confirmed matches and isolate the host for further investigation."
          },
          "Execution of built-in process discovery commands with specific parameter patterns commonly associated with detailed reconnaissance tools or manual adversary activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments of processes like `tasklist.exe`, `powershell.exe`, and `wmic.exe`. Use regular expression matching to flag specific, verbose parameter patterns such as `tasklist /v`, `tasklist /m`, `wmic process list full`, or PowerShell's `Get-Process | select-object *`, which are more indicative of detailed reconnaissance than typical administrative use. Maintain and update a list of these suspicious patterns to reduce false positives from legitimate scripts."
          },
          "Process discovery commands (`tasklist`, `Get-Process`, etc.) are spawned by a parent process that does not typically perform system administration or discovery tasks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) to track parent-child relationships. Create a baseline model of normal parent-child pairings for discovery commands (e.g., parent `explorer.exe` -> child `cmd.exe` -> grandchild `tasklist.exe`). Use statistical analysis or a graph-based model to flag executions where the parent process is anomalous (e.g., `winword.exe`, `excel.exe`, `outlook.exe`, a web server process like `w3wp.exe`). Calculate the rarity of each observed pairing using frequency analysis; alert on pairings in the lowest frequency percentile (e.g., <1%)."
          },
          "An unusually high frequency of process discovery commands executed by a single user, host, or parent process within a short time frame.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate process creation events (Windows Event ID 4688) for discovery commands (`tasklist`, `Get-Process`, `ps`, `wmic process list`) by user, hostname, and parent process over rolling time windows (e.g., 5, 15, and 60 minutes). Use time series analysis to detect bursts of activity that deviate significantly from the established baseline for each entity. Alert when the execution count for any user/host/parent exceeds a statistically derived threshold, such as three standard deviations above the mean or the 99th percentile of normal activity."
          },
          "Anomalous execution of process enumeration commands on network devices via command-line interfaces, originating from non-administrative sources or exhibiting unusual timing or frequency.": {
            "Data": "Zeek conn.log; Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for SSH/Telnet connections to network devices. If session logging is enabled (e.g., in Zeek ssh.log), filter for command keywords like `show process`, `ps`, `top`. Correlate the source IP and user (if available) with a baseline of authorized administrative users and jump boxes. Use correlation analysis to flag commands executed from unusual IP geolocations or by non-administrative accounts. Apply time series analysis to detect an abnormal frequency of these commands across multiple devices from a single source IP, which could indicate scripted discovery."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
