[
  {
    "Is the adversary elevating privileges via process injection? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055 - Process Injection": {
          "Detection of suspicious Windows API calls commonly used for process injection.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 7 (Sysmon); Windows Event ID 8 (Sysmon); Windows Event ID 10 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to process access (4656, 4663, Sysmon 7, 8, 10) on sensitive processes (e.g., svchost.exe, services.exe). Identify sequences of API calls (e.g., VirtualAllocEx, WriteProcessMemory, CreateRemoteThread) that constitute injection patterns. Use correlation analysis between events to link related actions across process IDs and timestamps."
          },
          "Loading of unexpected DLLs into legitimate system processes.": {
            "Data": "Windows Event ID 7 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7 (Sysmon) for ImageLoad events. Identify DLL loads into common system processes (svchost.exe, services.exe, explorer.exe) where the DLL path is not standard or the DLL name is suspicious. Use frequency analysis or set-based comparisons against known good DLL lists per process to identify outliers."
          },
          "Attempted modification of memory in a privileged process by a lower-privileged process, followed by thread creation.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 8 (Sysmon); Windows Event ID 10 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (Handle was Requested), 4663 (An object operation was performed), and Sysmon Event IDs 8 (CreateRemoteThread) and 10 (ProcessAccess) on endpoints. Filter for source processes with low integrity/privilege levels attempting to access or create threads in target processes with high integrity/privilege levels (e.g., SYSTEM). Use correlation analysis to link sequence of memory modification calls (e.g., ProcessAccess with write permissions) and subsequent CreateRemoteThread events from the same source process targeting the same privileged process."
          },
          "Privileged system processes initiating unusual network connections or spawning unexpected child processes.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for privileged system processes (e.g., services.exe, lsass.exe) spawning child processes that are not typical for their function. Analyze Zeek conn.log to identify network connections initiated by these privileged processes. Establish a baseline of typical network connections and child processes for these system processes using frequency analysis and flag deviations as anomalous behavior indicative of injection or post-compromise activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses via process injection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055 - Process Injection": {
          "Creation or connection to named pipes by processes not typically using IPC.": {
            "Data": "Windows Event ID 17 (Sysmon); Windows Event ID 18 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 17 and 18 (Sysmon) for named pipe creation and connection events. Look for named pipe activity by processes that do not typically utilize IPC. Use entropy analysis on named pipe names to detect algorithmically generated or obfuscated names. Correlate named pipe activity with other suspicious events on the host."
          },
          "Anomalous process behavior (e.g., network connections) by a process after suspected injection.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log filtered by source IP addresses of potentially compromised endpoints. Correlate Zeek network events with Windows Event ID 4688 (Process Creation) to identify the process initiating suspicious network connections. Use descriptive statistics to profile normal network connections for common system processes and flag deviations as anomalous behavior indicative of injection or post-compromise activity."
          },
          "Loading of DLLs from non-standard or temporary directories into legitimate processes.": {
            "Data": "Windows Event ID 7 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7 (Sysmon) for ImageLoad events. Filter for target processes that are typically targets of injection (e.g., explorer.exe, svchost.exe). Analyze the `Image` field (DLL path) for loads originating from temporary directories (e.g., `C:\\Windows\\Temp`, user temporary directories) or other unusual locations. Use frequency analysis of load paths per process and set-based comparison against known safe locations to identify outliers."
          },
          "Repeated or unusual named pipe communication patterns between multiple instances of legitimate processes.": {
            "Data": "Windows Event ID 17 (Sysmon); Windows Event ID 18 (Sysmon)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 17 (Create Named Pipe) and 18 (Connect Named Pipe). Group events by `PipeName` and the processes involved. Use time series analysis to identify unusual frequency, duration, or volume of communication over a named pipe between processes (especially multiple instances of the same process type like svchost.exe) compared to baseline behavior. Calculate entropy of data size transferred over pipes or frequency of connections to detect obfuscation or unusual communication patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]