[
  {
    "Is the adversary attempting to escalate privileges using process injection techniques? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.013 - Process Doppelgänging": {
          "Rarely used Windows Transactional NTFS (TxF) API calls (e.g., CreateTransaction, CreateFileTransacted, RollbackTransaction) observed in process monitoring logs.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for suspicious file modifications within a transaction, particularly focusing on executable files. Correlate with recent process creation events (Event ID 4688). Search for patterns involving transactional file operations followed by process creation from the modified file path that is then rolled back, though direct TxF API call detection relies on specific monitoring tools."
          },
          "Suspicious sequence or combination of low-level process creation/modification API calls (e.g., NtCreateProcessEx, NtCreateThreadEx, WriteProcessMemory) not typical for the process.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4656, Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of Windows Event ID 4688 for unusual parent-child process relationships involving standard Windows executables being launched in atypical ways. Look for patterns potentially indicative of low-level process manipulation, correlating with Object Access events (Event ID 4656/4657) targeting processes or threads, although direct API call sequence detection is challenging with standard logs."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting to evade defenses using process injection techniques? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.013 - Process Doppelgänging": {
          "Rarely used Windows Transactional NTFS (TxF) API calls (e.g., CreateTransaction, CreateFileTransacted, RollbackTransaction) potentially indicating code execution hidden within legitimate processes.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for suspicious file modifications within a transaction, particularly focusing on executable files. Correlate with recent process creation events (Event ID 4688). Search for patterns involving transactional file operations followed by process creation from the modified file path that is then rolled back, though direct TxF API call detection relies on specific monitoring tools."
          },
          "Established processes (e.g., svchost.exe, explorer.exe) exhibiting unusual network connections, file access, or other post-compromise behaviors not typical for their normal function.": {
            "Data": "Windows Event ID 4688, Windows Event ID 5156, Windows Event ID 5157, Windows Event ID 4663, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile typical network connections (Zeek conn.log, Event ID 5156/5157) and file access patterns (Event ID 4663) for common Windows processes (e.g., svchost.exe, explorer.exe) on different system types (servers/endpoints). Use statistical analysis (e.g., frequency analysis, clustering) to identify significant deviations from normal behavior (e.g., svchost.exe initiating outbound connections to rare IPs/ports, accessing unusual files) that could indicate process injection."
          }
        }
      }
    }
  }
]