[
  {
    "Is the adversary exfiltrating data via a physical medium? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1052 - Exfiltration Over Physical Medium": {
          "Detection of suspicious file copy or move operations targeting removable media.": {
            "Data": "Windows Event ID 4663; Sysmon Event ID 1; Sysmon Event ID 11",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access - WriteData or AppendData) or Sysmon logs (Event ID 1 for process command line, Event ID 11 for file creation) for file operations explicitly targeting removable drive paths (e.g., D:\\*, E:\\*, \\??\\Volume{GUID}\\*). Correlate file creation/modification events on removable media paths with the processes responsible (via Event ID 4663 SubjectProcessId or Sysmon Event ID 1 PID). Use descriptive statistics to baseline typical file sizes, types, or volumes copied to removable media per user/endpoint and flag outliers using IQR or percentile analysis."
          },
          "Execution of unauthorized or suspicious processes triggered by removable media connection.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Correlate process creation events with host system events potentially indicating removable media device connection (e.g., first file access Event ID 4663 on a new volume path, or Logon Type 2/7 Event ID 4624 indicating user presence). Filter for processes with unusual names, paths, or command line arguments executed shortly after removable media is detected/mounted. Calculate entropy measures on command line strings or file names created on the removable media to identify suspicious patterns."
          },
          "Detection of a removable storage device connection followed by file access/creation events on that device for unusual file types or large volumes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (WriteData or AppendData operations) targeting removable drive paths (`\??\Volume{GUID}\*`, `D:\*`, etc.). Correlate sequences of 4663 events on a new volume path with process creation (Windows Event ID 4688) occurring around the same time. Use descriptive statistics to analyze the total volume/size of data written, the number of files, and the types of files written to removable media per user/endpoint over time. Flag significant deviations from baseline using IQR or percentile analysis on data volume or file counts."
          },
          "Writing of unusual file names, extensions, or file types to removable media, potentially indicating obfuscation or sensitive data types.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (WriteData or AppendData) and Windows Event ID 4688 for file operations targeting removable media. Catalog file extensions and names written to removable media paths. Calculate entropy of file names or analyze file extension distributions per user/endpoint. Flag the writing of unusual file types (e.g., archives like .zip, .rar; encrypted files; databases) or files with high-entropy names, especially when associated with suspicious processes or occurring outside normal activity patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]