[
  {
    "Is the adversary attempting to gain credentials using GUI input capture? (TA0006 - Credential Access)": {
      "Indicators": {
        "Execution of processes known to be used for GUI prompt mimicry or associated scripting interpreters (like PowerShell, cmd) with unusual command lines.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for creation of processes like powershell.exe, cmd.exe, or other scripting/executable names known for credential harvesting. Filter for suspicious parent-child relationships (e.g., Office document spawning PowerShell). Use frequency analysis on process names and command lines to identify rare executions or parameters associated with GUI manipulation or credential requests. Compare against a baseline of approved software."
        },
        "Identification of suspicious strings or parameters in command-line arguments used with scripting interpreters.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze command-line arguments captured in Windows Event ID 4688 for scripting processes (PowerShell, cmd). Search for specific strings related to GUI creation ('System.Windows.Forms', 'Add-Type', 'Show-Dialog', 'SendKeys', credential-related keywords like 'password', 'credential', 'login'). Use entropy measures on command strings to identify highly obfuscated or unusual sequences indicative of malicious scripting attempting prompt mimicry."
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary collecting sensitive data (credentials) using GUI input capture? (TA0009 - Collection)": {
      "Indicators": {
        "Outbound network connections immediately following potential GUI prompt mimicry events.": {
          "Data": "Zeek conn.log, Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Identify timestamps of potential GUI prompt mimicry events (from host logs like Windows Event ID 4688 analysis). Within a short time window (e.g., 60 seconds) after these events, check Zeek conn.log for outbound connections from the same host. Filter for connections to unusual ports, high-entropy domains, or IPs matching threat intelligence feeds. Use time series analysis to track the pattern of outbound connections from a host relative to detected scripting/process activity."
        },
        "Correlation between host discovery activities and subsequent suspicious process/script execution.": {
          "Data": "Windows Event ID 4688, Zeek conn.log",
          "Data Platform": "Endpoints, Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Identify events related to host/application discovery (e.g., execution of 'query user', 'tasklist', 'netstat' commands in Windows Event ID 4688; network scans or queries in Zeek conn.log). Identify potential GUI prompt mimicry events. Use correlation analysis on the timestamps and hostnames/IPs of these two event types to find instances where discovery is immediately followed by suspicious process/script activity, suggesting targeted credential collection."
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]