[
  {
    "Is the adversary executing malicious code using scheduled tasks? (TA0002 - Execution)": {
      "Indicators": {
        "T1053.003 - Cron": {
          "Network connections to suspicious destinations occurring at scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to suspicious destinations. Correlate connection timestamps with known standard Cron schedules and look for connections occurring consistently at non-standard fixed times. Flag source/destination pairs exhibiting recurring connections at specific times using time series analysis."
          },
          "Anomalous network activity patterns (e.g., unusual protocols, bytes sent/received) occurring at scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections occurring at specific times. Calculate descriptive statistics (e.g., mean, median, IQR for bytes sent/received, duration, protocol distribution) for these connections. Compare these statistics against baseline behavior for the source host using time series analysis or statistical process control techniques to detect anomalies occurring at scheduled intervals."
          },
          "Execution of unusual processes or scripts that appear to be triggered at scheduled times.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs (Process Creation) on relevant systems where Cron-triggered activity might manifest. Look for processes with unusual names, command-line arguments, or execution paths. Correlate process creation timestamps with potential scheduled times (e.g., hourly, daily at specific times). Use frequency analysis to identify low-occurrence processes executing at recurring intervals."
          },
          "Download of suspicious files via network connections occurring at scheduled times.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and http.log for connections involving file downloads (e.g., PUT/POST requests, unusual GET requests for uncommon file types like executables). Correlate timestamps with potential scheduled times. Analyze HTTP User-Agents, requested file names/types, and destination IPs (potentially cross-referencing with threat intelligence). Use time series analysis to identify recurring download activity from specific sources or to specific destinations at fixed intervals."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using scheduled tasks? (TA0003 - Persistence)": {
      "Indicators": {
        "T1053.003 - Cron": {
          "Repeated network connections from compromised systems at fixed scheduled intervals.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify potentially compromised hosts. Analyze Zeek conn.log for recurring connections originating from these hosts to any destination at fixed time intervals (e.g., every hour, daily at 3 AM). Use time series analysis or correlation analysis to identify the scheduled pattern of connections, focusing on consistency and duration over time."
          },
          "Repeated network connections to C2 infrastructure or internal systems occurring at fixed scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to known C2 IPs or unusual internal destinations/ports. Identify source hosts exhibiting connections to these destinations. Analyze the timestamps of these connections over time to detect recurring patterns at fixed scheduled times indicative of a persistent beaconing or communication channel."
          },
          "Recurring execution of specific processes or scripts from unusual locations at scheduled times on Unix/Linux/ESXi systems.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for recurring process creation events on systems where Cron might be configured or interact. Look for the same process name, command-line, or parent process executing repeatedly at fixed time intervals. Identify executions from unusual or temporary directories. Use time series analysis or frequency analysis to spot persistent, repetitive scheduled executions."
          },
          "Recurring network logon events from a specific source host/user occurring at scheduled times, associated with services often used by Cron jobs accessing network resources.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4624 (Successful Logon) and 4625 (Failed Logon) logs with Zeek conn.log entries based on source IP and time. Filter for network logon events (e.g., Type 3, 8) occurring at fixed, recurring intervals from specific source hosts running Cron. Analyze destinations and user accounts involved. Use time series analysis to identify the scheduled network logon pattern indicative of persistent access to network resources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using scheduled tasks? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1053.003 - Cron": {
          "Unusual network activity originating from critical servers exhibiting scheduled patterns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify critical servers. Analyze Zeek conn.log for all outbound connections from these servers. Use time series analysis to identify any connections or patterns of activity occurring consistently at fixed scheduled times that deviate significantly from normal server behavior using baselining and anomaly detection techniques."
          },
          "Network connections from critical servers to unusual or external destinations at scheduled times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify critical servers. Analyze Zeek conn.log for connections originating from these servers to external IPs or unusual internal IPs/ports. Filter for connections occurring at scheduled times. Cross-reference external IPs with threat intelligence feeds. Use time series analysis to identify recurring scheduled connections to these sensitive/unusual destinations."
          },
          "Execution of processes or scripts with unusual elevated privileges (e.g., as root) at scheduled times on systems that can run Cron.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs on critical servers (or systems logging Cron-related activity) for process creation events. Identify processes executing with elevated user accounts (e.g., Administrator, SYSTEM, or potentially mapped Unix root accounts if logging is configured to capture this). Correlate execution times with potential scheduled intervals. Look for processes executing with high privileges that are not part of standard system operations or known scheduled tasks."
          },
          "Scheduled network connections from critical servers to sensitive internal systems or services (e.g., domain controllers, backup servers, internal databases) at scheduled times, potentially indicating access using elevated privileges.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for traffic originating from critical servers to known sensitive internal IPs/ports. Correlate these connections with timestamps to identify scheduled patterns. Identify associated user accounts using Windows Event ID 4624 (Logon Type 3) if available, noting elevated accounts. Use time series analysis to detect recurring scheduled access to sensitive resources and compare user accounts involved against normal access patterns using descriptive statistics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]