[
  {
    "Has the adversary executed code or commands using Visual Basic? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.005 - Visual Basic": {
          "Execution of script host processes (wscript.exe, cscript.exe) or Office applications spawning unexpected processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where ParentProcessName is an Office application (winword.exe, excel.exe, powerpnt.exe, outlook.exe) and NewProcessName is a script host (wscript.exe, cscript.exe, powershell.exe) or other suspicious executables. Analyze command-line arguments (CommandLine in 4688) for suspicious script execution patterns. Identify rare or unusual parent-child process combinations using frequency analysis."
          },
          "Creation or modification of Visual Basic script files (.vbs, .hta with vbscript) or loading of vbscript.dll in unusual processes.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Sysmon Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 for file write/create operations targeting locations typically used for temporary or user files with '.vbs' or '.hta' extensions. Monitor Sysmon Event ID 7 for 'vbscript.dll' loading in processes other than expected browsers or system processes. Use correlation analysis to link file creation events to subsequent process execution."
          },
          "Suspicious command line arguments used with script hosts (wscript.exe, cscript.exe) or other common Windows executables indicating VB execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `wscript.exe` or `cscript.exe` execution with obfuscated or suspicious command line arguments (e.g., base64 encoded strings, long sequences of random characters, references to unusual file paths). Additionally, monitor `mshta.exe` for execution of .hta files. Use frequency analysis or string matching on command lines to identify rare or blacklisted patterns. Correlate with parent process and user information to identify execution context."
          },
          "Network connections originating from script host processes (wscript.exe, cscript.exe) or Office applications to unusual or malicious external destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 5156 (WFP Connection) where the InitiatingProcessName is `wscript.exe`, `cscript.exe`, or an Office application, with Zeek conn.log entries using timestamp and source IP/port. Identify destination IPs/domains from Zeek logs. Compare destinations against threat intelligence feeds and known internal/allowed destinations. Use frequency analysis on destination addresses/ports to identify rare connections. Flag connections to destinations seen infrequently or associated with C2 activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]