[
  {
    "Is the adversary attempting to exfiltrate data? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1052.001 - Exfiltration over USB": {
          "Process activity indicative of bulk file operations potentially targeting removable media.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify patterns of process execution (e.g., cmd.exe, PowerShell.exe, or other utilities) with command-line arguments suggesting file copy or movement operations involving paths potentially corresponding to removable drives (like drive letters D:, E:, F:, G:). Analyze the frequency and volume of such operations using descriptive statistics and look for outliers using methods like IQR on file counts or sizes implied by command line arguments."
          },
          "Execution of unusual processes or scripts potentially triggered by removable media insertion.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Analyze process command lines for suspicious patterns or scripts. Correlate process creation times with user logon events (Event ID 4624) as a proxy for potential user presence during which a USB device might be inserted. Use entropy or frequency analysis on process names and command lines observed shortly after logon/unlock events to identify low-prevalence or suspicious executions running from paths like D:\\ or E:\\."
          },
          "File read/write/copy operations targeting paths associated with removable media.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACL on endpoints to log file system access events (Event ID 4663) for common removable drive letters (e.g., D:, E:, F:, G:) and sensitive file types. Filter logs for file copy (ACCESS_MASK 0x00000001 | 0x00000002), write (ACCESS_MASK 0x00000002 | 0x00000004), or read (ACCESS_MASK 0x00000001 | 0x00000008) operations occurring in bulk or involving sensitive file types on these paths. Use correlation analysis to link these file access events with user session activity or suspicious process execution (Event ID 4688). Calculate the total volume of data accessed/transferred to removable media paths over time for users and use time series analysis to detect anomalous spikes."
          },
          "Detection of a new removable storage device connected to an endpoint, correlated with user activity or suspicious process execution targeting the device.": {
            "Data": "Windows Event ID 10000 (Microsoft-Windows-Kernel-PnP); Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 10000 (Microsoft-Windows-Kernel-PnP, if enabled) for 'USBSTOR' device type connections on endpoints. Correlate device connection events with user logon events (Event ID 4624) or screen unlock times. Investigate instances where a new removable device is connected and immediately followed by suspicious process activity (Event ID 4688) accessing the newly assigned drive letter. Use correlation analysis to link the device connection timestamp, user session, and subsequent file/process activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]