[
  {
    "Is the adversary attempting to escalate privileges using process injection? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1055.001 - Dynamic-link Library Injection": {
          "Process accessing the memory of another process in a non-standard way.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for Object Handle Requested/Closed events where the Object Type is 'Process'. Filter for source processes known to perform legitimate inter-process communication (IPC). Investigate events where an unusual source process requests a handle to a critical or privileged target process. Use frequency analysis to identify rare source/target process pairs and flag anomalies."
          },
          "Unexpected code execution or child process creation originating from a privileged system process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs. Identify processes spawned by critical system processes (e.g., svchost.exe, services.exe) or trusted user processes that are not part of the expected parent/child relationships. Use correlation analysis to link unusual child process creation with potential prior suspicious events indicating injection."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to evade defenses using process injection? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1055.001 - Dynamic-link Library Injection": {
          "Trusted application process accessing the memory of another process.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for Object Handle Requested/Closed events where the Object Type is 'Process'. Focus on source processes identified as trusted applications (e.g., web browsers, office applications). Investigate instances where these trusted processes request handles to other processes, particularly system processes or other application processes in ways not typical for their normal operation. Use baseline analysis to identify deviations from normal process behavior."
          },
          "Processes exhibiting unusual network connections or file activity after potential injection.": {
            "Data": "Zeek conn.log, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and Windows Event ID 4663 (if file access auditing is enabled and relevant) with potential injection indicators (from memory access or unusual process creation). Identify processes (via PID from Event ID 4688 or similar) that initiate unusual network connections (using Zeek logs and network flow analysis) or access sensitive files (using Event ID 4663) immediately after a suspicious process or memory access event is logged. Use correlation analysis to link suspicious host events with subsequent network or file activity."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]