[
  {
    "Is the adversary attempting privilege escalation using thread local storage callbacks? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.005 - Thread Local Storage": {
          "Suspicious sequence of API calls associated with process injection targeting privileged processes (e.g., lsass.exe, services.exe).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event logs (4656, 4663 - if configured for object access) for access attempts to sensitive processes (lsass.exe, services.exe) using suspicious access masks or from unusual source processes. Look for sequences of events indicating opening a handle, allocating memory, writing memory, and creating a thread. Use correlation analysis to link events across time and processes."
          },
          "Unusual network connections or file access originating from a privileged process (e.g., lsass.exe, services.exe) that typically does not perform such actions.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Windows Event ID 5157; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation), Windows Event ID 5156/5157 (Network connection attempts), and Zeek conn.log for child processes spawned by or network connections originating from typically non-network-aware privileged processes (lsass.exe, services.exe). Establish a baseline of normal child processes/connections for these processes using descriptive statistics and flag deviations using frequency analysis or statistical outliers."
          },
          "Attempted process access with suspicious rights (e.g., PROCESS_VM_WRITE, PROCESS_CREATE_THREAD) targeting privileged processes (e.g., lsass.exe, services.exe).": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 where the object type is 'Process' and the Target Process Name is lsass.exe or services.exe. Filter events for suspicious Desired Access masks (e.g., containing 0x0010, 0x0002, 0x0008, 0x0400). Analyze calling processes (Source Process Name) for unusual characteristics (e.g., unsigned, temporary location, unusual parent process). Calculate the frequency of such attempts by source process and flag statistical outliers."
          },
          "Network connections initiated by privileged processes (e.g., lsass.exe, services.exe) unusually quickly after process creation.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) for lsass.exe and services.exe with subsequent Windows Event ID 5156 (Network connection attempt) or Zeek conn.log entries from the same process instance (using Process ID/Handle if possible, or correlating by time and host). Measure the time delta between process creation and the first outbound network connection. Identify instances where this delta is significantly shorter than normal (e.g., < 5 seconds). Baseline typical startup network connection timing for these processes using time series analysis or descriptive statistics and flag anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting defense evasion using thread local storage callbacks? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.005 - Thread Local Storage": {
          "Suspicious sequence of API calls associated with process injection targeting common, non-privileged processes (e.g., explorer.exe, svchost.exe) often used for evasion.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event logs (4656, 4663 - if configured for object access) for access attempts to common processes (explorer.exe, svchost.exe) from unusual or temporary processes. Look for sequences of events indicating opening a handle, allocating memory, writing memory, and creating a thread targeting these processes. Use correlation analysis to link events across time and processes."
          },
          "Unusual execution of child processes or network connections initiated by a process that has been targeted by suspected injection.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) for unusual child processes spawned by processes targeted by suspected injection. Monitor Zeek conn.log for new or unusual network connections originating from these processes. Use descriptive statistics to characterize normal child processes/connections and identify outliers. Correlate unusual network activity with process lineage."
          },
          "Attempted process access with suspicious rights (e.g., PROCESS_VM_WRITE, PROCESS_CREATE_THREAD) targeting common processes often used for evasion (e.g., explorer.exe, svchost.exe).": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 where the object type is 'Process' and the Target Process Name matches common targets like explorer.exe or svchost.exe. Filter events for suspicious Desired Access masks (e.g., containing 0x0010, 0x0002, 0x0008, 0x0400). Analyze calling processes (Source Process Name) for unusual characteristics (e.g., unsigned, temporary location, unusual parent process). Calculate the frequency of such attempts by source process and flag statistical outliers."
          },
          "Network connections initiated by common processes often used for evasion (e.g., explorer.exe, svchost.exe) unusually quickly after process creation.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) for common processes like explorer.exe or svchost.exe with subsequent Windows Event ID 5156 (Network connection attempt) or Zeek conn.log entries from the same process instance. Measure the time delta between process creation and the first outbound network connection. Identify instances where this delta is significantly shorter than normal (e.g., < 5 seconds). Baseline typical startup network connection timing for these processes using time series analysis or descriptive statistics and flag anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]