[
  {
    "Has the adversary escalated privileges using ptrace system calls? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.008 - Ptrace System Calls": {
          "Detection of a process exhibiting unusual behavior (e.g., unexpected process creation, file modification) that could indicate injection, originating from a potentially compromised user or parent process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes creating child processes using Windows Event ID 4688. Analyze parent-child process relationships. Use frequency analysis or statistical scoring to identify rare or anomalous parent-child process combinations that could indicate injection."
          },
          "A process exhibiting behavior inconsistent with its normal function after potential injection, specifically accessing files or creating processes that it typically does not.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for specific processes known to be targeted by injection. Analyze command-line arguments or spawned processes initiated by these targeted processes for deviations from their normal behavior using behavioral baselines and statistical scoring."
          },
          "A standard process (e.g., explorer.exe, svchost.exe) creating a child process with elevated privileges or making system calls/network connections unusual for its context, potentially indicating injection for privilege escalation.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for known standard processes (e.g., svchost.exe, explorer.exe) creating child processes with high integrity levels (check token information in logon events). Correlate process creation events with successful logon events (Event ID 4624) to identify the logon session/privilege level. Also, analyze Zeek conn.log for network connections initiated by these specific standard processes that are unusual compared to their historical baseline using correlation analysis."
          },
          "A process making network connections to internal or external resources immediately after another process appears to have modified its memory or state (proxy for injection).": {
            "Data": "Windows Event ID 5156; Zeek conn.log; Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 (WFP Connection), Zeek conn.log, and Windows Event ID 4688/4689 for unusual network connections originating from a specific process or user session. Use time series analysis and correlation analysis to identify sudden, anomalous network activity spikes linked to processes that recently exhibited suspicious behavior in Windows Event ID 4688 (e.g., unusual parent/child relationships) or process crashes (Event ID 4689), which could be proxies for injection attempts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using ptrace system calls? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.008 - Ptrace System Calls": {
          "Detection of a process commonly targeted by injection techniques (e.g., system processes, security agents) exhibiting unusual behavior or crashes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4689 (Process Termination) for unexpected termination of critical system or security processes. Use time series analysis to detect unusual frequency or timing of these terminations. Correlate terminations with preceding unusual activity captured by Windows Event ID 4688 from those processes or unusual parent/child relationships."
          },
          "A process initiating suspicious network connections or accessing sensitive files, where this activity is outside its baseline behavior and potentially indicates code injection.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections initiated by processes identified as potentially injected via analysis of Windows Event IDs (e.g., unusual process behavior, parent/child relationships from 4688). Use correlation analysis to link unusual network activity (via Zeek) to specific processes or user sessions (via host logs). Use time series analysis to detect spikes or deviations in network traffic volume or destination ports from these processes compared to their baseline."
          },
          "Security software processes (e.g., AV, EDR) unexpectedly terminating or failing to create expected child processes, potentially due to being targeted by injection or manipulation attempts.": {
            "Data": "Windows Event ID 4689; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4689 for the termination of security software processes (identify by image name). Use time series analysis to detect unexpected frequency or timing of these terminations. Correlate with Windows Event ID 4688 to identify if the security process failed to launch expected child processes or if another process terminated it (check 'TerminatingProcessId' in 4689 if available, or infer from preceding 4688 events)."
          },
          "Outbound network connections from a process to known malicious infrastructure or unusual external destinations, where the process's normal function does not include such connections.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for outbound connections from specific processes (identified via correlation with Windows Event ID 4688 process names/IDs) or from hosts showing other signs of compromise/injection. Compare observed external destinations against Threat Intelligence feeds for known C2/malicious IPs. Use correlation analysis to link connection details (timestamp, size, protocol) to specific processes identified as suspicious by other host-based evidence. Analyze connection volume and duration using descriptive statistics to identify anomalous data transfers consistent with exfiltration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]