[
  {
    "Has the adversary leveraged Extra Window Memory Injection for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1055.011 - Extra Window Memory Injection": {
          "Execution of code within the memory space of a high-privilege process (e.g., explorer.exe, svchost.exe) after unusual window memory modification API calls.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for high-privilege processes (e.g., explorer.exe, svchost.exe). Look for unusual parent processes or command-line arguments initiating these processes. Identify instances where child processes of these high-privilege processes exhibit anomalous behavior (e.g., unexpected network connections captured in Zeek conn.log). Use correlation analysis to link source processes (if visible via Event 4688 parent process ID) with high-privilege target processes."
          },
          "Sequence of API calls related to Extra Window Memory (SetWindowLong, GetWindowLong) followed by execution in a process with higher privileges than the originating process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4688 logs for process creation events involving processes known to register window classes. While direct API call detection is limited with these logs, identify sequences where a less privileged process creates or interacts with a process that subsequently gains higher privileges or performs actions indicative of privilege escalation. Analyze frequency distribution of processes targeted by potential injection activities."
          },
          "A potentially targeted high-privilege process (e.g., svchost.exe, explorer.exe) initiating anomalous network connections or creating unexpected child processes after recent interaction with a lower-privileged process.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 to identify parent-child process relationships involving high-privilege processes. Use Windows Event ID 5156 and Zeek conn.log to monitor network connections initiated by these target processes. Establish baseline network communication patterns and child process creation for these high-privilege processes using descriptive statistics and frequency analysis. Flag instances where a high-privilege process, potentially interacted with by a lower-privileged parent (Event 4688), initiates network connections to unusual or unauthorized destinations or spawns unexpected child processes."
          },
          "A lower-privileged process creating or interacting with a high-privileged process, immediately followed by the high-privileged process performing actions only possible with elevated privileges (e.g., modifying system files, creating services) as indicated by Windows Events.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious parent-child process relationships involving high-privilege processes. Correlate these with Windows Event ID 4697 indicating service installation by an unexpected process or user context, or relevant Event ID 4656 audits on sensitive system objects (auditing required). Use sequence analysis to identify the temporal ordering of these events where a lower-privileged process activity precedes high-privilege actions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using Extra Window Memory Injection to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1055.011 - Extra Window Memory Injection": {
          "Modification of Extra Window Memory (via SetWindowLong) and subsequent code execution within the memory of a common user-facing process (e.g., browser, office application) without typical process injection indicators.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes like browsers or office applications exhibiting unusual child processes, command lines, or network connections (via Zeek conn.log) that deviate significantly from baseline behavior. Establish baseline network connection patterns for common processes using descriptive statistics and time series analysis, flagging outliers that connect to unusual destinations."
          },
          "Observed sequence of API calls including SetWindowLong and SendNotifyMessage targeting a process, deviating from its normal behavior.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of process creation (Event ID 4688). While direct API calls are not logged, look for instances where a process is created, immediately followed by another process exhibiting suspicious behavior or initiating unusual network connections (Zeek conn.log), potentially indicative of code execution within the second process. Use sequence analysis (basic correlation) to identify common but suspicious patterns."
          },
          "A common user process (e.g., browser, office application) initiating outbound network connections to suspicious or unusual destinations or exhibiting other atypical behavior not correlated with user interaction, potentially indicating hidden code execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for common user processes. Use Windows Event ID 5156, Zeek conn.log, http.log, and dns.log to establish baseline network behavior (destinations, protocols, volume, domains) for these processes using descriptive statistics and correlation analysis (e.g., process hash vs. destination IP/domain). Flag instances where these processes connect to known malicious IPs/domains (threat intel lookup), use unusual ports/protocols, or exhibit sudden spikes in network activity (time series analysis) not correlated with user interaction or updates."
          },
          "Suspicious child process creation (Event ID 4688) where the parent process is a common graphical application (browser, office suite, etc.) and the child is atypical or exhibits malicious network activity, potentially indicating code execution within the parent process's context for defense evasion.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for child processes spawned by common graphical applications (e.g., chrome.exe, firefox.exe, winword.exe) that are not typical or expected children. Correlate these child processes with network connections (Zeek conn.log, Windows Event ID 5156) they initiate. Use frequency analysis to identify rare parent-child process relationships involving graphical parents and correlation analysis to link child process hash/name with suspicious network activity or destinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]