[
  {
    "Is the adversary attempting to elevate privileges using process hollowing? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1055.012 - Process Hollowing": {
          "Creation of a child process followed by the parent process terminating abnormally soon after.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (4688, 4689) for parent processes creating child processes followed by the parent process terminating within a short timeframe. Use time series analysis to identify parent processes with unusually short lifespans immediately after child creation."
          },
          "Unusual parent-child process relationships observed during process creation (potentially indicative of a benign process being spawned for hollowing).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs. Identify common parent-child relationships. Flag process creations with rare parent-child pairs for commonly hollowed processes (e.g., svchost.exe, explorer.exe) using frequency analysis or clustering."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to evade defenses using process hollowing? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1055.012 - Process Hollowing": {
          "Legitimate Windows process (e.g., svchost.exe, explorer.exe) initiating unusual outbound network connections shortly after creation.": {
            "Data": "Zeek conn.log, Zeek dns.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log/dns.log events. Identify instances where legitimate processes (based on name, path, digital signature if available) initiate network connections to unusual destinations or ports shortly after creation. Use correlation analysis to link process creation events to subsequent network activity and flag outliers."
          },
          "Analysis of process creation events showing unusual timing or sequence relative to parent process activity.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs. For child processes, examine the time difference between the child process creation event and its parent process's last recorded activity (e.g., creation or termination - Event 4689). Look for statistically unusual time differences, potentially indicating manipulation during creation. Use descriptive statistics or box plots to identify outliers in creation timing relationships."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]