
[
  {
    "Has the adversary captured user input to obtain credentials? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1056 - Input Capture": {
          "Detection of files or running processes matching known hashes, or network connections to C2 infrastructure associated with known keylogger malware.": {
            "Data": "Windows Event ID 1 (Sysmon); Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously scan file creation events and process hashes (from Sysmon Event ID 1) against a cyber threat intelligence (CTI) feed of known keylogger malware hashes. Simultaneously, correlate network connection logs (Zeek conn.log) against a CTI feed of known keylogger C2 domains and IP addresses. Alert on any confirmed match."
          },
          "Creation of specific registry keys, named pipes, or mutexes known to be used by common keylogging tools or credential theft scripts.": {
            "Data": "Windows Event ID 12 (Sysmon); Windows Event ID 13 (Sysmon); Windows Event ID 14 (Sysmon); Windows Event ID 17 (Sysmon); Windows Event ID 18 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for registry key/value creation/modification (Sysmon Event IDs 12, 13, 14) and named pipe events (Sysmon Event IDs 17, 18). Correlate these events against a maintained list of patterns and specific names known to be used by keylogging tools (e.g., registry keys in HKCU\\Software for persistence, specific named pipe formats). Use regular expressions to find variations on common keylogger artifact names and investigate the creating process."
          },
          "A process unexpectedly loads user input or UI-related DLLs (e.g., user32.dll), especially if the process is unsigned, runs from an unusual location, or has no graphical user interface.": {
            "Data": "Windows Event ID 7 (Sysmon); Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for image load events (Sysmon Event ID 7). Profile normal DLL loads for common processes and establish a baseline. Flag non-GUI processes (e.g., system services, command-line tools) that load `user32.dll` or other UI-related libraries. Correlate this with process creation events (Sysmon Event ID 1) to check for unsigned executables or those running from atypical paths (e.g., %APPDATA%, C:\\Windows\\Temp). Use frequency analysis on process-and-DLL-load combinations to identify rare occurrences."
          },
          "Execution of a scripting interpreter (e.g., PowerShell) with obfuscated commands or parameters designed to hook keyboard events or capture clipboard data.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1 (Sysmon); Windows Event ID 4104 (PowerShell Script Block Logging)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor PowerShell Script Block Logging (Event ID 4104). Analyze script block content for keywords related to input capture such as `Set-WindowsHook`, `GetAsyncKeyState`, `Get-Clipboard`, or .NET methods like `[System.Windows.Forms.Clipboard]::GetText()`. For all interpreters (Event ID 4688, Sysmon 1), analyze command lines for high entropy, base64 encoding, or unusual character ratios suggesting obfuscation. Use correlation analysis to link suspicious script execution with subsequent file writes or network connections."
          },
          "Outbound network connections to newly registered or low-reputation domains, especially if the traffic contains POST requests with form data consistent with credentials.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor DNS queries (Zeek dns.log) for domains with recent registration dates by correlating with WHOIS data or a reputation service. Analyze HTTP traffic (Zeek http.log) to these or other low-reputation domains. Inspect HTTP POST requests for parameters commonly used for credentials (e.g., 'username', 'password', 'login', 'pass', 'token'). Use time series analysis to correlate spikes in this type of traffic with internal phishing campaigns. Use linear regression to model normal POST data sizes per destination and flag significant outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary captured user input to collect information? (TA0009 - Collection)": {
      "Indicators": {
        "T1056 - Input Capture": {
          "Creation of files with names or stored in directories known to be used by specific keylogger tools for logging captured keystrokes or screenshots.": {
            "Data": "Windows Event ID 11 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation events (Sysmon Event ID 11). Compare the `TargetFilename` against a maintained list of known keylogger output file names and paths (e.g., `C:\\Users\\Public\\log.dat`, `%APPDATA%\\logs\\key.log`). Use regular expressions to detect variations. Alert on any matches and investigate the creating process and parent process."
          },
          "A process writes to a file in a temporary or user-profile directory, and that file is subsequently read by the same or another process which then initiates an external network connection.": {
            "Data": "Windows Event ID 11 (Sysmon); Windows Event ID 1 (Sysmon); Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection rule that correlates events in the sequence: 1. Process A creates/writes to a file (Sysmon Event ID 11) in a temporary or hidden directory. 2. Process B (can be the same as A) initiates an outbound network connection (Sysmon Event ID 3 or Zeek conn.log) within a short time window (e.g., 1-10 minutes). This pattern is indicative of staging collected data for exfiltration. Use correlation analysis across host and network logs, keyed by hostname and timestamp, to link these stages."
          },
          "Anomalous disk write activity, such as frequent, small writes to a single file, consistent with keystroke logging, especially from a process not typically associated with user interaction.": {
            "Data": "Windows Event ID 11 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate file write events (Sysmon Event ID 11) by process and target file. Analyze the frequency and size of write operations over time. Use time series analysis to identify processes performing regular, small writes to a file over an extended period. Profile normal file I/O behavior for common processes and alert on significant deviations. Use descriptive statistics (mean, median, standard deviation of write sizes and inter-arrival times) to build baselines and identify outliers using methods like IQR or Z-scores."
          },
          "Anomalous network traffic patterns consistent with the exfiltration of collected input, such as periodic small data transfers, DNS tunneling, or connections to unusual ports or destinations.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for periodic outbound connections ('beaconing') with small, often fixed-size payloads, characteristic of keystroke batch exfiltration. Monitor Zeek dns.log for unusually long or high-entropy DNS queries indicative of data exfiltration via DNS tunneling. Use frequency analysis on destination ports to identify communication over non-standard ports. Establish a baseline of normal network egress traffic volume and patterns per host and use statistical methods (e.g., IQR, time series decomposition) to detect outliers that could represent exfiltration of collected data."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
