[
  {
    "Has the adversary executed code using JavaScript? (TA0002 - Execution)": {
      "Indicators": {
        "T1059.007 - JavaScript": {
          "Process creation events showing wscript.exe or cscript.exe executing .js or .jse files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where Parent Process Name or Process Name is 'wscript.exe' or 'cscript.exe' and Command Line contains '.js' or '.jse'. Analyze frequency of execution per user/host; flag statistically rare occurrences or executions outside baselined activity using descriptive statistics or frequency analysis."
          },
          "Observation of obfuscated JavaScript files downloaded or executed, potentially via browser or network activity.": {
            "Data": "Zeek http.log; Zeek file.log; Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for file downloads with '.js' extensions, especially those from unusual sources. Analyze Zeek file.log for creation of '.js' or '.jse' files on systems. Monitor Windows Event ID 4688 where the command line involves executing script files from unusual directories (e.g., temp folders, user profile downloads). If file capture is available, apply entropy measures to identify potentially obfuscated script content."
          },
          "Execution of JavaScript or JScript via command line by processes other than standard script hosts (wscript/cscript) or from non-standard locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line contains patterns indicative of script execution (e.g., calls to scripting engines, direct script code) AND the process name is NOT 'wscript.exe' or 'cscript.exe'. Look for execution from temporary directories, user profile directories, or by unusual parent processes (e.g., Office applications, web browsers). Analyze command lines for suspicious flags or arguments. Use frequency analysis or percentile analysis to identify rare process/command line combinations executing scripts."
          },
          "Network connections to malicious or unusual domains/IPs immediately following the execution of a JavaScript/JScript file.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 showing execution of script files (.js, .jse) with subsequent Zeek conn.log or Windows Event ID 5156 (Network Connection created) events originating from the same host within a short time window (e.g., < 60 seconds). Filter destination IPs/domains against threat intelligence feeds for known malicious infrastructure. Analyze connection patterns (e.g., ports, protocols) for anomalies relative to baseline traffic from the host. Use time series analysis or correlation analysis to identify statistically significant increases in connection activity or connections to rare destinations following script execution."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]