
[
  {
    "Is the adversary performing host discovery to identify local groups and permissions? (TA0007 - Discovery)": {
      "Indicators": {
        "T1069.001 - Local Groups": {
          "Execution of a file (e.g., binary, script) with a known malicious hash that is part of a toolset used for local group enumeration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) which should include the file hash of the executed process. Correlate these hashes against a continuously updated threat intelligence feed of known malicious binaries and discovery scripts (e.g., from tools like BloodHound, PowerSploit, etc.). Generate a high-priority alert upon any hash match, indicating a known malicious tool is active on the endpoint."
          },
          "Execution of built-in command-line utilities (e.g., `net.exe`, `whoami.exe`) with specific arguments used for enumerating local group membership.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for command-line arguments containing patterns such as `net localgroup`, `net group *`, and `whoami /groups`. While these are legitimate commands, flag executions by non-interactive sessions, non-standard user accounts (e.g., service accounts), or processes spawned by unusual parents (e.g., Office applications, web servers). Use regular expressions for robust pattern matching and descriptive statistics to identify hosts with an abnormally high frequency of these commands."
          },
          "Use of scripting frameworks like PowerShell to query local group information via specific cmdlets or direct API calls.": {
            "Data": "Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze PowerShell script block logs (Windows Event ID 4104) for the execution of cmdlets such as `Get-LocalGroup`, `Get-LocalGroupMember`, or direct calls to the `[adsi]` type accelerator to query group memberships. Establish a baseline of legitimate administrative scripts and alert on ad-hoc execution of these commands, especially if obfuscated or part of a larger, suspicious script block. Use entropy measures on script blocks to detect potential obfuscation."
          },
          "A single user account or process performing local group enumeration across an unusually large number of distinct hosts within a short timeframe.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4798",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate local group enumeration events (Windows Event ID 4798 'A user's local group membership was enumerated' or command-line events from 4688) across the environment, keyed by the user account performing the action. For each user, count the number of distinct hosts on which they perform this enumeration within a sliding time window (e.g., 1 hour). Use descriptive statistics (mean, standard deviation, percentiles) to establish a baseline for normal administrative behavior and alert on users who enumerate groups on a number of hosts that is a statistical outlier, indicating widespread, automated discovery."
          },
          "A sequence of discovery activities where local group enumeration on a host is temporally correlated with other discovery techniques originating from the same host.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4798; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a composite alert by correlating local group discovery events (Windows Event ID 4798 or 4688 for `net localgroup`) with other discovery events originating from the same host within a short time window (e.g., 30 minutes). Correlate with network service scanning (a high number of connections to diverse ports/hosts from one source in Zeek conn.log), remote system discovery (e.g., `net view` commands in Event ID 4688), or domain account discovery. Use correlation analysis to score hosts based on the variety and frequency of co-occurring discovery behaviors, as this combination is a strong indicator of an adversary's reconnaissance phase."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
