[
  {
    "Is the adversary attempting to discover domain groups and permissions? (TA0007 - Discovery)": {
      "Indicators": {
        "T1069.002 - Domain Groups": {
          "Execution of discovery commands like 'net group /domain' on domain-joined systems.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs for commands and arguments associated with domain group enumeration (e.g., 'net group /domain', 'ldapsearch', 'dscacheutil -q group'). Identify unusual execution frequency or source hosts. Use frequency analysis to identify hosts executing these commands more often than expected baselines."
          },
          "Use of PowerShell commands or WMI calls to enumerate domain groups or users within those groups.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 (PowerShell Script Block) and Windows Event ID 4688 logs for PowerShell or WMI calls related to domain group enumeration (e.g., 'Get-ADGroup', 'Get-ADGroupMember', WMI queries against 'Win32_Group'). Look for scripts or commands executed by unusual users or on unusual hosts. Use correlation analysis to link discovery activity with subsequent suspicious actions."
          },
          "Network traffic patterns indicative of LDAP queries used for extensive domain group enumeration.": {
            "Data": "Zeek ldap.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ldap.log for bind requests followed by search requests targeting large numbers of group objects (objectClass=group) or searching for memberships (memberOf, member attributes). Use frequency analysis on the number of LDAP search queries per source IP or user within a time window. Flag sources performing a significantly higher volume of group enumeration queries than baseline determined by descriptive statistics."
          },
          "Windows security events indicating access or queries targeting sensitive domain group objects or their memberships (e.g., Domain Admins).": {
            "Data": "Windows Event ID 4662",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on sensitive Active Directory group objects (e.g., Domain Admins, Enterprise Admins) to log access (Windows Event ID 4662). Monitor logs for read access attempts on member or memberOf properties by users/hosts not in the allowed list. Use frequency analysis to identify hosts or users querying these properties excessively compared to normal administrative activities."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]