[
  {
    "Has the adversary attempted to discover cloud groups and permissions? (TA0007 - Discovery)": {
      "Indicators": {
        "T1069.003 - Cloud Groups": {
          "Execution of cloud provider specific command-line tools or API calls used for enumerating users, groups, roles, or permissions.": {
            "Data": "Cloud Provider Audit Logs; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Provider Audit Logs for specific API calls or command executions associated with user/group/role/policy enumeration (e.g., ListUsers, Get-MsolRole, az ad user get-member-groups, GetBucketAcl). Monitor Windows Event ID 4688 on endpoints/servers for execution of cloud CLI tools (aws, az, gcloud) with suspicious arguments. Identify frequency of such commands per user/principal; flag deviations from baseline using descriptive statistics."
          },
          "Unusual access attempts or patterns immediately following enumeration activity targeting specific objects or accounts identified during group/permission discovery.": {
            "Data": "Cloud Provider Audit Logs; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate enumeration activity identified in Cloud Provider Audit Logs with subsequent access attempts or modifications to cloud resources or user accounts within a short timeframe. Monitor Zeek conn.log for connections from potential adversary-controlled IPs to cloud provider API endpoints. Use time series analysis or correlation analysis to link discovery activities with follow-on actions."
          },
          "Cloud API calls or cloud CLI tool executions originating from unusual hosts (e.g., standard user endpoints, non-server systems) or unexpected processes.": {
            "Data": "Cloud Provider Audit Logs; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints and servers for execution of cloud CLI tools (aws, az, gcloud, PowerShell with cloud modules) or suspicious parent processes. Correlate these events with Cloud Provider Audit Logs for the same user/principal and timestamp. Identify executions originating from hosts/processes that typically do not perform cloud administration tasks. Use frequency analysis to establish a baseline of cloud CLI tool usage per host/process and flag statistically significant deviations."
          },
          "High volume or programmatic-like external network traffic from internal hosts to cloud provider API endpoints associated with enumeration activities.": {
            "Data": "Zeek conn.log; Cloud Provider Audit Logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections from internal hosts to known cloud provider API endpoints (e.g., *.amazonaws.com, *.azure.com, *.googleapis.com). Correlate bursts of connections or unusually high session counts originating from a single internal host/IP towards cloud APIs with corresponding enumeration events in Cloud Provider Audit Logs. Use statistical methods like time series analysis, session count per time window, or connection frequency analysis to identify programmatic or automated enumeration activity patterns from internal sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]