
[
  {
    "Has the adversary attempted to discover cloud groups and permissions? (TA0007 - Discovery)": {
      "Indicators": {
        "T1069.003 - Cloud Groups": {
          "Execution of specific, high-fidelity cloud API calls or CLI command variations almost exclusively used in malicious reconnaissance or by specific threat actor tools for cloud group discovery.": {
            "Data": "Cloud Provider Audit Logs (e.g., AWS CloudTrail, Azure Monitor Audit Logs, GCP Cloud Audit Logs); Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and monitor for a curated list of exact API calls (e.g., AWS `iam:ListAccountAliases` if unexpected, Azure `Microsoft.Authorization/roleAssignments/read` with overly broad scope, GCP `cloudresourcemanager.projects.getIamPolicy` on many projects) or specific CLI command syntaxes (e.g., `aws iam list-policies --scope Local --output text | findstr /C:\"*Admin*\"` on Windows, `Get-MsolRole -RoleName '*Admin*'` if not typical for legitimate administrators) that are strongly correlated with adversarial discovery and have very low legitimate use. Alert immediately on exact matches of these selectors."
          },
          "Use of cloud enumeration commands or API calls with parameters and patterns indicative of automated scripting or specific reconnaissance tools (e.g., unusual User-Agent strings for API calls, rapid sequences of enumeration commands, or overly broad queries).": {
            "Data": "Cloud Provider Audit Logs; Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Provider Audit Logs and Windows Event ID 4688 for patterns such as: a rapid succession of enumeration commands (e.g., `ListGroups`, `ListRoles`, `ListPolicies`, or their equivalents like `Get-MsolRole`, `az ad group list`, `gcloud iam roles list`) by the same principal within seconds. Look for the use of wildcard characters in queries that attempt to retrieve excessive data (e.g., `Get-MsolUser -All | Get-MsolUserRole`). Analyze User-Agent strings in API logs (if available) for matches to known recon tools (e.g., PowerZure, ScoutSuite, CloudMapper default scan patterns). Correlate with Zeek http.log for unusual User-Agents if API calls are plaintext or TLS interception is in place."
          },
          "Anomalous frequency, scope, or type of cloud group and permission enumeration activity by a user principal or from an endpoint, deviating from established operational baselines.": {
            "Data": "Cloud Provider Audit Logs; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for normal cloud enumeration activity (specific API calls like ListUsers, Get-MsolRole, az ad user get-member-groups, GetBucketAcl, ListRolePolicies; and CLI tool executions like `aws`, `az`, `gcloud` from Windows Event ID 4688) per user, role, and source IP/endpoint. Monitor for statistically significant increases in the volume (count of calls), breadth (e.g., number of different services or resource types queried), or types of enumeration commands. Use descriptive statistics (mean, median, standard deviation), percentile analysis, or Inter-Quartile Range (IQR) calculations to flag deviations. For example, an administrator typically queries 2-3 specific group details per day; querying details for 50 groups or listing all policies in the account is anomalous."
          },
          "Cloud group and permission enumeration API calls or CLI tool executions originating from unexpected geographic locations, IP addresses, non-standard User Agents, or non-administrative endpoints/processes.": {
            "Data": "Cloud Provider Audit Logs; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile typical sources (IP addresses, geolocations, registered hostnames, parent processes from Windows Event ID 4688) and User-Agents (from Cloud Provider Audit Logs) for cloud enumeration activities. Alert on enumeration tasks originating from untrusted or unusual geolocations/IPs (cross-reference with threat intelligence feeds or known TOR exit nodes), from standard user workstations instead of designated administrative systems, or initiated by unexpected parent processes (e.g., `outlook.exe` spawning `powershell.exe -c Get-MsolRole`). Use frequency analysis of source attributes and rule-based alerting for known unusual or high-risk sources."
          },
          "Cloud group or permission discovery activity immediately followed by unauthorized access attempts, privilege escalation attempts, or lateral movement involving the enumerated cloud entities.": {
            "Data": "Cloud Provider Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate cloud enumeration events (identified through other detection methods) with subsequent high-risk activities performed by the same user principal, or targeting the discovered resources/identities, within a defined short time window (e.g., 5 minutes to 1 hour). Such activities include: attempts to access sensitive data stores (e.g., S3 buckets, Azure Blobs), assign new permissions (e.g., AttachRolePolicy, Add-RoleGroupMember), create new users/roles, or utilize newly discovered credentials/roles (e.g., AssumeRole with a just-discovered role). Utilize correlation analysis and define sequences of interest (e.g., `ListRolePolicies` by UserA on RoleX -> `AssumeRole` by UserA as RoleX -> Risky action by RoleX)."
          },
          "Anomalous network traffic patterns to cloud provider API endpoints, such as a high volume of requests or connections from an internal host, consistent with automated enumeration scripting, especially when correlated with Cloud Audit Log enumeration events.": {
            "Data": "Zeek conn.log; Cloud Provider Audit Logs",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusual connection volumes (e.g., hundreds of connections in minutes), frequencies, or byte counts from internal IP addresses to known cloud provider API FQDNs (e.g., `iam.amazonaws.com`, `graph.windows.net`, `cloudresourcemanager.googleapis.com`, `management.azure.com`). When such network anomalies are detected, correlate the source IP and timestamp with Cloud Provider Audit Logs to confirm if the activity corresponds to enumeration API calls (e.g., `List*`, `Get*`, `Describe*` families of calls). Use time series analysis on connection counts or data volume per source IP to cloud APIs, and apply entropy measures on requested API FQDNs/paths from a single source over a short window to detect programmatic behavior or sweeping enumeration attempts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
