[
  {
    "Has the adversary attempted to discover permission groups or settings within the network? (TA0007 - Discovery)": {
      "Indicators": {
        "T1069 - Permission Groups Discovery": {
          "Execution of commands or scripts to enumerate local or domain permission groups or user memberships.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4798; Windows Event ID 4799",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving `net.exe`, `powershell.exe`, or other scripting engines executing commands like `group`, `user`, `membership`, `ADGroup`, `LocalGroup`, `whoami /groups`. Identify execution volume over time per host. Use time series analysis to detect sudden spikes in permission enumeration commands. Correlate with other discovery activities."
          },
          "Enumeration events targeting privileged groups or performed by unusual accounts.": {
            "Data": "Windows Event ID 4798; Windows Event ID 4799",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4798 and 4799 for enumeration events. Identify the target account/group and the source user/system performing the enumeration. Look for enumeration activity targeting highly privileged groups (e.g., Domain Admins, Enterprise Admins) or performed by accounts not typically involved in administration. Use frequency analysis to identify accounts performing an unusually high number of enumeration events."
          },
          "Execution of PowerShell or WMI commands specifically used for enumerating users, groups, or permissions.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104; Windows Event ID 103; Windows Event ID 104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688, 4104, and relevant WMI events (103, 104) for command lines or script blocks containing cmdlets or WMI queries related to users, groups, or permissions (e.g., `Get-ADGroup`, `Get-LocalGroup`, `Get-ADUser`, `Get-LocalUser`, `Get-ACL`, WMI queries for user accounts or group memberships). Use frequency analysis (count per user/host per time period) to identify users/systems performing an unusual number of such queries or executing suspicious combinations of commands. Correlate with network logs if remote execution is suspected."
          },
          "Execution of container orchestration commands related to checking permissions or enumerating access controls within a container environment on Windows hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving `kubectl.exe` or `docker.exe` with command-line arguments related to permission enumeration or access checks (e.g., `kubectl auth can-i`, `kubectl get roles`, `kubectl get clusterroles`, `docker inspect`). Use frequency analysis (count per user/host per time period) to identify users or systems executing these commands excessively or unexpectedly. Correlate execution times and source IPs with other potential discovery activities."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]