[
  {
    "Is the adversary attempting to evade defenses by modifying file timestamps? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.006 - Timestomp": {
          "File modification events where the modification time appears inconsistent with other system activity or logs.": {
            "Data": "Windows Event ID 4663; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (object access/write) and Zeek file.log for file modification events and associated timestamps (`mtime`). Analyze the distribution and sequence of modification times (`mtime`). Identify files exhibiting modification times that are significantly out of sequence with file system traversal logs or appear to predate other related events (e.g., user login, process execution) using time series analysis or outlier detection on timestamps."
          },
          "File creation or modification timestamps that do not align with associated process creation times.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4663 (file modify) and Zeek file.log (`mtime`, `ctime`) along with Windows Event ID 4688 (process creation). Correlate file modification/creation events with the process that performed the action (if available in logs). Calculate the difference between the file's modification/creation timestamp and the timestamp of the process that created/modified it. Use descriptive statistics (mean, median, variance) and outlier detection (e.g., Z-score, IQR) to identify files where this time difference is unusually large (e.g., file timestamp is much older than the creating process). Investigate files with significant discrepancies."
          },
          "Unusual file access or modification times that significantly predate recent creation or download events for the file.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 (handle request) and 4663 (object access/write) and Zeek file.log (`atime`, `mtime`, `ctime`). Collect events related to file creation or modification. For each such event, record the time the event occurred and the file's recorded timestamps (`atime`, `mtime`, `ctime`) at that moment. Compare the recorded file timestamps to the event timestamp. Flag files where the `mtime` or `ctime` significantly predates the event time, especially if the event is the first time the file was seen or accessed recently (based on historical logs). Use correlation analysis between event timestamps and file timestamps to identify significant negative time differences."
          },
          "Process execution of command-line tools known to modify file timestamps (e.g., 'touch', custom tools) occurring near suspicious file modifications.": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command lines containing keywords or patterns associated with timestomping tools (e.g., `touch`, specific parameters for system utilities that can change times). Correlate these process executions with file modification events captured by Windows Event ID 4663 or Zeek file.log occurring around the same time. Analyze the target file path in the process command line and compare timestamps in Zeek file.log or 4663 before and after the command execution. Flag instances where a known timestomping command is executed shortly before or after suspicious file timestamp changes are observed using time proximity analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]