[
  {
    "Has the adversary gained initial access using default accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Login attempts (failed or successful) targeting default operating system accounts (e.g., Administrator, Guest).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (success) and 4625 (failure) for logins using known default account names (e.g., Administrator, Guest, root). Analyze login attempt volume over time using time series analysis to detect spikes or anomalies. Calculate success/failure rates for default accounts using descriptive statistics."
          },
          "Authentication attempts to appliances, network devices, or applications using known default credential pairs or common default usernames/passwords.": {
            "Data": "Zeek conn.log; Application/Appliance Authentication Logs",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Ingest authentication logs from network devices, appliances, and applications. Search for successful logins using known default username/password combinations. Correlate authentication events with Zeek conn.log to identify source IPs and destinations. Use frequency analysis to identify repeated attempts against multiple devices/applications."
          },
          "First-time successful login of a known default account on a specific host or service.": {
            "Data": "Windows Event ID 4624; Application/Appliance Authentication Logs",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a history of successful logins for known default accounts (e.g., Administrator, Guest, default service accounts) per host/service based on Windows Event ID 4624 or application logs. Identify and alert on the first successful login of a default account that has not logged in before on that specific host/service using historical data analysis. Use time series analysis to identify deviations from zero baseline logins."
          },
          "Network connections originating from external sources targeting services using default ports (e.g., SSH, Telnet, RDP, HTTP/S for web interfaces) where authentication logs are unavailable or show default credential use.": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek rdp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to standard remote access ports (e.g., 22, 23, 3389, 80, 443) from external source IPs. If available, correlate with Zeek protocol-specific logs (ssh.log, rdp.log, http.log) for successful authentication events. If authentication logs are not available or difficult to parse, analyze connection volume, duration, and data transfer size using descriptive statistics and outlier detection to find unusual external connections to these services."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using default accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Repeated successful logins to default accounts or accounts known to use default/weak credentials, especially if previously unused.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Application/Appliance Authentication Logs",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track successful logins (Event ID 4624, appliance logs) by known default/weak accounts. Calculate baseline login frequency and time-of-day patterns using descriptive statistics. Flag logins deviating significantly from the baseline or occurring at unusual times/frequencies over a prolonged period using time series analysis."
          },
          "Activity originating from a default account (e.g., process creation, network connections) inconsistent with its intended purpose or typical baseline.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes spawned by default accounts. Analyze Zeek conn.log for network connections initiated by hosts logged in as default accounts (correlate using Logon ID from Event ID 4624 if available). Compare activity patterns (process types, connection destinations, data volume) to expected behavior for default accounts, identifying outliers or entropy increases in activity."
          },
          "Scheduled tasks or services created/modified by a default account that execute persistently or at unusual times.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4698 (creation) and 4702 (modification) for scheduled tasks attributed to known default accounts. Examine the task configuration (command, schedule). Correlate with subsequent Windows Event ID 4688 events showing task execution to confirm persistence. Use frequency analysis to identify tasks executing at suspicious intervals or times."
          },
          "Consistent, low-volume network communication from an internal host logged in as a default account to an external IP, potentially indicating C2.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections originating from internal hosts logged in as default accounts (correlate using Logon ID from Event ID 4624 if possible). Identify external destination IPs. Use time series analysis to find connections that occur with suspicious regularity or persist over a long period. Use descriptive statistics (mean/median of byte counts, connection duration) and entropy measures on destination IPs/ports to identify consistent, low-entropy communication patterns indicative of C2."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary escalated privileges using default accounts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Successful actions indicative of privilege escalation (e.g., service installation, user creation, configuration changes) attributed to a default account.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4672; Windows Event ID 4720; Windows Event ID 4732; Windows Event ID 4756",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (login type indicating privilege), 4672 (Admin Logon), 4720 (User Creation), 4732 (Add Member to Local Group), 4756 (Add Member to Universal Group) for actions performed by default accounts. Specifically search for these accounts being added to highly privileged groups or performing actions like creating users/services immediately after login. Correlate these events with preceding login events to identify privilege escalation attempts."
          },
          "Creation/activation of default accounts followed by privileged actions.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 for the creation or activation of default accounts. Immediately follow up by monitoring subsequent login events (Event ID 4624) and process creation (Event ID 4688) from the activated default account to detect suspicious privileged actions. Use time series analysis to identify activity occurring shortly after account creation/activation."
          },
          "Modification of security group memberships or user account permissions performed by a default account.": {
            "Data": "Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to security group modifications (4728, 4732, 4756, etc.) where the account performing the modification is a known default account. Flag instances where the target account/group is highly privileged (e.g., Administrators, Domain Admins). Correlate these events with the default account's login history (Event ID 4624). Use frequency analysis to identify rare or suspicious group modifications."
          },
          "Execution of processes with elevated privileges or capabilities by a default account.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created by known default accounts. Analyze the ParentProcessName, CommandLine, and potentially other fields indicating elevated privileges or capabilities (e.g., SYSTEM integrity level). Correlate with the login event (Event ID 4624, especially Logon Type) of the default account to understand the context. Use frequency analysis to identify rare or never-seen-before processes executed by default accounts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using default accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Access logs showing a default account accessing resources or systems that normal user accounts cannot access.": {
            "Data": "Windows Event ID 4624; Application/Appliance Authentication Logs",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Audit access logs (Windows Event ID 4624, application logs) for attempts by default accounts to access sensitive resources or configuration settings. Correlate access attempts with access control lists (ACLs) or policy logs to identify instances where default accounts are inappropriately granted access. Use correlation analysis between login events and resource access events."
          },
          "Network traffic or host logs showing activity from a default account that bypasses standard logging or monitoring configurations.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Application/Appliance logs",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and Windows Event ID 4688 for network connections and process executions originating from default accounts. Look for signs of activity that might bypass standard monitoring, such as connections to unusual ports or execution of scripts that modify logging configurations. Use outlier detection on connection patterns or process names."
          },
          "Modification or deletion of security-related configurations, logs, or services performed by a default account.": {
            "Data": "Windows Event ID 1102; Windows Event ID 4719; Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to security logging and policy changes (1102 - log clear, 4719 - audit policy change, 4656/4657 - object access depending on SACL) where the account performing the action is a default account. Analyze command lines in Event ID 4688 for execution of tools (e.g., `wevtutil cl`, `auditpol /set`) by default accounts that could disable or clear logs. Use frequency analysis or outlier detection to identify rare configuration changes performed by these accounts."
          },
          "Network connections initiated by a default account that bypass expected outbound proxy or firewall rules, or use encrypted/tunneled protocols unusually.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek x509.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections originating from internal hosts logged in as default accounts. Analyze destination IPs/ports and compare against known network policies/baselines (e.g., proxy logs). Look for direct connections to external IPs skipping the proxy, or use of unusual ports/protocols. Use Zeek ssl.log and x509.log to identify self-signed certificates or non-standard SSL usage. Use correlation analysis to identify connections that do not appear in proxy logs when they should."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]