[
  {
    "Is the adversary collecting and staging data on local systems? (TA0009 - Collection)": {
      "Indicators": {
        "T1074.001 - Local Data Staging": {
          "Process creation events showing command lines indicating file copying or movement from multiple source directories to a single destination directory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Analyze command line arguments for patterns indicative of copying/moving files from multiple source paths to a single destination path (e.g., using 'xcopy', 'copy' with wildcards or multiple sources). Use frequency analysis on destination paths and source/destination path entropy (measures diversity of source paths feeding into a destination) to identify unusual staging activity."
          },
          "Process creation events showing command lines related to archive creation or writing to common staging locations (e.g., temp directories, Recycle Bin) or suspicious modifications to the Windows Registry by unusual processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing archiving tool names (e.g., '7z', 'winrar', 'zip') or common staging directory paths (e.g., 'temp', 'Recycle.Bin'). Monitor Windows Event ID 4657 for suspicious registry modifications by processes without known benign behaviors. Use correlation analysis between process names/paths and suspicious command line arguments or registry modifications."
          },
          "Creation or modification of compressed or encrypted files in common staging directories or publicly writeable locations by unusual processes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure Windows Event ID 4663 auditing on common staging directories (e.g., C:\\Windows\\Temp, user profile temp folders, Recycle Bin equivalents) and publicly writeable shares. Monitor for file creation or modification events (Access Mask 0x2 for creation, others for modification). Correlate events with file extensions (`.zip`, `.rar`, `.7z`, `.gz`, `.tar`, `.aes`, `.enc`, etc.) and the process (via Event ID 4688) initiating the action. Flag events where unusual processes create/modify suspicious file types in staging locations. Use frequency analysis to identify processes or locations with unusually high rates of such events."
          },
          "Execution of WMI or PowerShell commands/scripts that read data from sensitive locations and write it to a local staging location.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and collect PowerShell Script Block Logging (Event ID 4104). Monitor for scripts or commands containing cmdlets/classes associated with data access (`Get-Content`, `Select-String`, `Invoke-WmiMethod`, `Get-CimInstance`) followed by cmdlets/commands associated with writing files (`Out-File`, `Add-Content`, redirection operators `>`) to potential staging locations within the same script block or process execution. Monitor Windows Event ID 4688 for `powershell.exe` or `wmic.exe` command lines exhibiting similar patterns. Use correlation analysis to link data reading actions with subsequent writing actions within the same process or short time window. Analyze the entropy of source files/directories read by WMI/PowerShell before writing to a common destination to identify diverse data sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]