```json
[
  {
    "Is the adversary attempting to evade detection by clearing network history? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.007 - Clear Network Connection History and Configurations": {
          "Execution of a known history-clearing or file-wiping utility identified by its file hash.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) and calculate the hash of the executable file for each new process. Compare this hash against a threat intelligence feed or internal list of known malicious file-wiping or history-clearing tools (e.g., components of SDelete, BleachBit, PrivaZer). Alert on any hash matches and investigate the parent process and user context."
          },
          "Execution of built-in commands or scripts specifically constructed to clear network connection history, logs, or related registry configurations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for command-line arguments containing specific patterns used to clear artifacts. This includes `wevtutil cl`, `Clear-EventLog`, `reg delete` or `Remove-ItemProperty` targeting `HKCU\\Software\\Microsoft\\Terminal Server Client`, and `del` or `Remove-Item` targeting paths like `*.rdp` or `...\\Terminal Server Client\\Cache\\*`. Use regular expressions for robust matching and correlate with the parent process (e.g., `powershell.exe`, `cmd.exe`) to identify suspicious script execution."
          },
          "Anomalous volume or pattern of file or registry object access events related to network connection history, deviating from established baselines.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor object access auditing on sensitive RDP history files (e.g., `Default.rdp`) and registry keys (`HKCU\\Software\\Microsoft\\Terminal Server Client\\Servers`). Establish a baseline for the normal rate of modification/deletion of these objects. Use time series analysis or descriptive statistics (e.g., standard deviation, IQR) to detect anomalous spikes in these audited events across the environment or for a specific host/user. A sudden burst of these events could indicate automated or scripted clearing activity."
          },
          "Clearing of RDP connection history occurring in close temporal proximity to a remote logon session.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate RDP logon events (Windows Event ID 4624 with Logon Type 10) with subsequent history-clearing activity on the same host within a short time window (e.g., 5-30 minutes). History-clearing can be identified by file deletions (Event ID 4663 on `*.rdp` files) or specific process executions (Event ID 4688 for `reg delete`, etc.). Use correlation analysis based on Hostname and Timestamp to link the logon to the clearing action. Prioritize alerts for standard user accounts or sessions originating from untrusted sources."
          },
          "Unauthorized or anomalous changes to network configurations, such as firewall rules, particularly when not associated with known administrative activity or change management processes.": {
            "Data": "Windows Event ID 4719; Windows Event ID 5025; Windows Event ID 5031; Zeek notice.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for changes to the Windows Firewall state or ruleset (Event IDs 5025, 5031) and System Audit Policy (Event ID 4719). Establish a baseline of normal administrative changes. Flag any modifications that occur outside of maintenance windows, are performed by non-administrative accounts, or are not logged in a change management system. Use descriptive statistics to find hosts with an unusually high frequency of firewall changes. Correlate host-based firewall changes with network-level policy violation alerts in Zeek notice.log."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```