[
    {
        "information_requirement": "Has the adversary gained initial access using compromised local accounts?",
        "tactic_id": "TA0001",
        "tactic_name": "Initial Access",
        "indicators": [
            {
                "technique_id": "T1078.003",
                "name": "Local Accounts",
                "evidence": [
                    {
                        "description": "Successful login by a local account from an external source IP address listed on a high-confidence threat intelligence feed for malicious activity.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate the source IP address from successful remote logins (Windows Event ID 4624, Logon Type 3 or 10) associated with local accounts against a CTI feed of known malicious IPs or TOR exit nodes, updated daily. Inner join this data with Zeek conn.log to confirm the external nature of the connection. Alert on any matches."
                    },
                    {
                        "description": "Use of common, default, or previously breached local account names and passwords in successful or high-volume failed login attempts from external sources.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event IDs 4624 and 4625 for login attempts targeting local accounts. Maintain a list of common default account names (e.g., 'admin', 'guest', 'support', 'test'). Use pattern matching to flag high-volume failed attempts against these accounts from external IPs. Correlate with lists of breached credentials to identify potential credential stuffing attacks targeting local accounts."
                    },
                    {
                        "description": "A local account exhibiting 'impossible travel' or a login from a geolocation with no prior history for that account or the organization.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of historical login geolocations for all remote-access-enabled local accounts. For each new successful remote login (Windows Event ID 4624, Logon Type 3/10), geolocate the source IP. Use correlation analysis to compare the new login's timestamp and location against the previous login to detect physically impossible travel. Use frequency analysis to flag logins from countries or regions with a historically zero or near-zero login rate for the organization."
                    },
                    {
                        "description": "A sudden spike in failed login attempts (password spraying) across multiple local accounts from a single or small set of source IPs.",
                        "data_sources": [
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate Windows Event ID 4625 (failed login) events, grouping by source IP and unique target local account name over short time windows (e.g., 10 minutes). Detect password spraying by identifying source IPs with a high ratio of unique target accounts to total failed logins. Use descriptive statistics and set a threshold (e.g., >10 unique local accounts targeted by one IP in 10 minutes) to trigger alerts. Use box-plots to visualize failed login counts per source IP to identify outliers."
                    },
                    {
                        "description": "Creation of a new local account immediately followed by a remote login using that new account from an external source.",
                        "data_sources": [
                            "Windows Event ID 4720",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a new local account creation event (Windows Event ID 4720) with a subsequent successful remote login event (Windows Event ID 4624 with Logon Type 3 or 10) for that same account within a short timeframe (e.g., < 1 hour). Prioritize alerts where the login originates from an external or non-standard IP address. Time series analysis can help identify unusual bursts of these correlated event pairs."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary maintaining persistence using compromised local accounts?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1078.003",
                "name": "Local Accounts",
                "evidence": [
                    {
                        "description": "A process running under a local account context that has a known malicious file hash or communicates with a known C2 domain/IP.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688) under local account contexts with CTI feeds of malicious file hashes. For network activity, join process information with network connection logs (Zeek conn.log) and DNS queries (Zeek dns.log) to identify connections from local account processes to known malicious C2 IPs or domains. Alert on any matches."
                    },
                    {
                        "description": "A local account creating or modifying a persistence mechanism, such as a scheduled task or service, with a command line characteristic of malicious activity.",
                        "data_sources": [
                            "Windows Event ID 4698",
                            "Windows Event ID 4702",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for scheduled task creation (Event ID 4698) and service creation (Event ID 4702) by local accounts. Analyze the associated command line (from the event data or correlated Event ID 4688) for patterns like invocation of LOLBins (`powershell.exe -enc`, `mshta.exe`, `rundll32.exe`) with suspicious arguments, execution from non-standard paths (e.g., `%TEMP%`), or calls to remote scripts. Use regular expression matching for these known malicious patterns."
                    },
                    {
                        "description": "A previously dormant or rarely used local account suddenly exhibiting regular, periodic remote login activity.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of login frequency for all local accounts over a long period (e.g., 90 days). Identify accounts with zero or very low login frequency (dormant accounts). Monitor for any new successful logins (Windows Event ID 4624) from these accounts. Use time series analysis to detect the emergence of regular, periodic login patterns (e.g., daily at the same time) from a previously dormant account, which may indicate automated persistent access."
                    },
                    {
                        "description": "A local account is added to a high-privilege or remote-access group outside of a documented change management process.",
                        "data_sources": [
                            "Windows Event ID 4732",
                            "Windows Event ID 4756",
                            "Windows Event ID 4728"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for local accounts being added to sensitive local or domain groups (Event IDs 4732, 4756, 4728), such as 'Administrators', 'Remote Desktop Users', or 'Distributed COM Users'. Correlate the 'Member SID' with a list of local account SIDs. Flag any such additions that do not correlate with a valid IT change ticket or are performed by an unauthorized user account. Use frequency analysis to detect unusual rates of group modification activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary escalating privileges using compromised local accounts?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1078.003",
                "name": "Local Accounts",
                "evidence": [
                    {
                        "description": "Execution of a file by a local account where the file hash matches a known privilege escalation exploit tool.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For every process creation event (Windows Event ID 4688) initiated by a local account, calculate or retrieve the file hash of the executable. Cross-reference this hash against a CTI feed of known privilege escalation tools, exploits for specific CVEs, and other malicious binaries. Alert on any match."
                    },
                    {
                        "description": "A local account executing a command sequence characteristic of known UAC bypass techniques.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for parent-child relationships and command-line arguments indicative of UAC bypass patterns. This includes a non-elevated process spawning a process that modifies a specific registry key (e.g., `hkcu:\\software\\classes\\ms-settings`) and then executes a system binary (e.g., `fodhelper.exe`, `computerdefaults.exe`) that auto-elevates and hijacks the execution flow. Maintain and use regular expression rules to detect these multi-step patterns."
                    },
                    {
                        "description": "A non-administrative local account executing a rapid sequence of discovery commands followed by an attempt to run a privilege escalation tool or access a sensitive system resource.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each interactive or remote session involving a non-administrative local account, build a timeline of executed commands (from Event ID 4688). Use correlation analysis to detect a behavioral sequence where discovery commands (e.g., `whoami /groups`, `net user`, `query user`) are followed within minutes by the execution of a suspicious unsigned binary, a script, or an attempt to access a protected resource like the SAM file (monitored by Event ID 4663). Alert on the entire correlated sequence of events."
                    },
                    {
                        "description": "A local account successfully adds itself or another account to a privileged local group, such as 'Administrators'.",
                        "data_sources": [
                            "Windows Event ID 4732"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4732 ('A member was added to a security-enabled local group'). Alert immediately if the 'Group Name' is 'Administrators' (or equivalent) and the 'Subject\\Account Name' (the user performing the action) is a local account that is not already an administrator, or if the 'Member Name' being added is a local account. This is a high-fidelity indicator of successful privilege escalation."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary evading defenses using compromised local accounts?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1078.003",
                "name": "Local Accounts",
                "evidence": [
                    {
                        "description": "Execution of a file by a local account where the file hash is known to belong to a defense evasion tool like a log wiper or security software disabler.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For every process creation event (Windows Event ID 4688) initiated by a local account, retrieve the file hash of the executable. Cross-reference this hash against a CTI feed of known defense evasion tools (e.g., Mimikatz, PCHunter, GMER) and malware with components designed to disable security products or clear logs. Alert on any match."
                    },
                    {
                        "description": "A local account executing commands to stop or delete security services, modify firewall rules, or clear event logs.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 1102",
                            "Windows Event ID 7034"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for process creation events (Event ID 4688) initiated by local accounts with command lines containing patterns like 'sc stop', 'sc delete', 'netsh advfirewall', or 'wevtutil cl'. Alert on execution of these commands targeting known security services (e.g., 'windefend', 'sysmon') or critical event logs. Directly monitor for log clearing (Event ID 1102) or service crashes/stops (Event ID 7034) and correlate the responsible user with a local account."
                    },
                    {
                        "description": "A local account executing a common system utility (LOLBin) from an unusual file path or with anomalous command-line arguments indicative of defense evasion.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline for the normal execution path and command-line argument structure for common LOLBins (`powershell.exe`, `certutil.exe`, `rundll32.exe`, etc.). Monitor process creation events (Event ID 4688) initiated by local accounts. Flag executions of these utilities from non-standard directories (e.g., `%APPDATA%`, `C:\\Users\\Public\\`) or with arguments rarely seen in legitimate use (e.g., `certutil -urlcache -split -f`, `rundll32.exe javascript`). Use entropy measures on command lines to spot obfuscation."
                    },
                    {
                        "description": "A local account making suspicious network connections to external destinations, potentially for C2 or exfiltration, bypassing typical user-based network controls.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network connections in Zeek conn.log with the responsible process on the endpoint (from Event ID 4688), filtering for processes running as a local account. Analyze the destination IP, port, and protocol. Use linear regression or time series analysis to detect unusual data transfer volumes or connection durations compared to baseline. Flag connections to non-standard ports, direct-to-IP connections bypassing DNS, or connections to domains with suspicious characteristics (e.g., high entropy, recently registered)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
