[
  {
    "Is the adversary attempting to evade defenses using file deletion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.004 - File Deletion": {
          "Execution of command-line utilities or scripts used for file deletion (e.g., 'del', 'rm', 'sdelete').": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing command-line arguments indicative of file deletion ('del', 'rm', 'sdelete', etc.). Identify rare command strings or unusual execution paths/users performing these actions by analyzing the frequency distribution of command lines and users using descriptive statistics and outlier detection."
          },
          "Deletion events targeting recently created or downloaded files with suspicious characteristics or known malicious hashes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4658",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663, 4656, 4658 for file deletion events. Correlate deletion events with recent file creation (e.g., Event ID 4688 showing suspicious process creation or file writes) or network activity (Zeek http.log, fileinfo.log if available). Prioritize investigation of deletions involving files with low entropy names (potential temporary files) or files created/accessed by processes/sources identified as suspicious via correlation analysis."
          },
          "Deletion of temporary files, downloaded executable files, or scripting files immediately after execution or network transfer.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek http.log; Zeek fileinfo.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file deletion events (Windows Event ID 4663) with recent file creation/modification events (e.g., Windows Event ID 4688 showing command line execution that might drop a file, or other relevant file system events), or network file transfers (Zeek http.log). Focus on deletions occurring shortly after a file appears (e.g., within 60 seconds) using time series analysis. Use correlation analysis to link temporary files (often with low entropy names), executables, or scripts downloaded or created by suspicious processes/sources with subsequent deletion events."
          },
          "Execution of known secure deletion utilities (e.g., sdelete, shred) or deletion functions used in an unusual context or location.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line or image path indicates the execution of known secure deletion tools (e.g., 'sdelete.exe', 'shred'). Identify execution from unusual directories (e.g., 'C:\\Windows\\Temp', user profile Downloads folder) or by system accounts that don't typically perform such actions. Use frequency analysis to identify the prevalence of these tools in the environment and flag any anomalous usage patterns, source paths, or users using descriptive statistics and outlier detection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]