
[
  {
    "Is the adversary using publish-subscribe protocols for command and control? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1071.005 - Publish-Subscribe Protocols": {
          "Pub/sub protocol communication (MQTT, XMPP, AMQP) with external brokers whose IP addresses or domain names are present on threat intelligence feeds as known C2 infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek mqtt.log; Zeek xmpp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract destination IP addresses and associated domain names (from Zeek dns.log queries) for all external pub/sub traffic identified in Zeek protocol logs. Inner join this data with a high-confidence, continuously updated CTI feed of known malicious C2 servers, brokers, and sinkholes. Generate a high-priority alert for any matches and investigate the source host."
          },
          "Use of specific, known malicious artifacts within pub/sub communications, such as hardcoded topic names, Client IDs, or username/password combinations used by known malware families.": {
            "Data": "Zeek mqtt.log; Zeek xmpp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Using protocol-specific logs (e.g., Zeek mqtt.log), inspect fields like `topic`, `client_id`, `username`, and `password`. Maintain and use a list of regular expressions or exact-match strings for values known to be used by specific malware families. Alert on any communication matching these known malicious patterns and analyze the associated session for further C2 activity."
          },
          "Anomalous network traffic characteristics for pub/sub protocols, such as unusual data volume, connection frequency, or non-standard port usage, deviating from established baselines for a host or network segment.": {
            "Data": "Zeek conn.log; Zeek mqtt.log; Zeek xmpp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal pub/sub traffic (data volume, connection duration, frequency) for critical hosts and network segments. Use time series analysis on Zeek conn.log data to detect significant spikes or dips in traffic that deviate from this baseline. Monitor for protocol detections (e.g., from `seen.protocols` in conn.log) on non-standard ports. Use correlation analysis to identify persistent, low-and-slow traffic patterns indicative of C2 heartbeat activity."
          },
          "An internal host establishes a pub/sub connection to a new, previously unseen external broker, especially if the broker's domain is newly registered or has a low reputation score.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a historical baseline of legitimate external pub/sub brokers that internal systems connect to. Monitor Zeek conn.log and dns.log to identify connections to new, previously unseen external broker IPs or domains. Enrich findings with external data such as domain age and reputation scores. Use descriptive statistics to flag connections to brokers that are new to the organization, have been registered within the last 30-60 days, or have poor reputation scores. Use linear regression to track the growth of new broker connections over time and flag unusual increases."
          },
          "A host begins publishing or subscribing to new, high-entropy, or suspicious pub/sub topics not consistent with its established functional baseline or organizational norms.": {
            "Data": "Zeek mqtt.log; Zeek xmpp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each host using pub/sub protocols, build and maintain a profile of normally used topics. Monitor Zeek protocol logs (mqtt.log, xmpp.log) for hosts communicating on new or rare topics. Calculate the Shannon entropy of topic names used by a host over time; a sudden increase in entropy may indicate randomized topic names used for C2. Use frequency analysis (low frequency of occurrence) or percentile rankings to flag anomalous topic usage per host."
          },
          "Pub/sub communication events immediately preceding or following suspicious host-level activity, such as the execution of a new process from a temporary directory or writing a malicious file.": {
            "Data": "Zeek conn.log; Zeek mqtt.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate pub/sub communication events (from Zeek mqtt.log, conn.log) with process creation events (Windows Event ID 4688) on the same host within a tight time window (e.g., +/- 30 seconds). Investigate sequences where a pub/sub message is received, followed immediately by the execution of a suspicious process (e.g., powershell.exe, rundll32.exe, or a binary in a temporary/user directory). Use correlation analysis to link the network C2 event with the subsequent host action, providing a high-fidelity indicator of malicious instruction execution."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
