```json
[
  {
    "Has the adversary executed commands using software deployment tools? (TA0002 - Execution)": {
      "Indicators": {
        "T1072 - Software Deployment Tools": {
          "Deployment of a software package whose file hash or name matches a known malicious tool or hacking utility.": {
            "Data": "Software deployment tool logs; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract file names and hashes of all packages deployed via software deployment tools from the tool's native logs. On endpoints, monitor process creation events (Windows Event ID 4688) for processes spawned by the deployment client. Inner join these file hashes and names against a comprehensive and continuously updated CTI database of known malicious files. Alert on any match and investigate the scope of the deployment."
          },
          "Deployment jobs executing commands or scripts containing patterns commonly associated with malicious activity, such as obfuscated PowerShell, remote file downloads, or credential dumping syntax.": {
            "Data": "Software deployment tool logs; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the command-line arguments (from Windows Event ID 4688) and script contents (from deployment tool logs, if available) of jobs executed by software deployment tools. Use regular expression matching to search for patterns indicative of malicious behavior, such as 'powershell -enc', 'IEX(New-Object Net.WebClient).DownloadString', 'reg save HKLM\\SAM', or other Living-off-the-Land-Binaries-and-Scripts (LOLBAS) or credential dumping techniques. Maintain and update a library of these malicious patterns for alerting."
          },
          "Anomalous software deployment activity based on deviations from established baselines, such as jobs initiated by non-administrative accounts, at unusual times, or targeting an atypical scope of systems.": {
            "Data": "Software deployment tool logs; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal software deployment activity, including typical source accounts, initiation times/days, and the size/composition of target groups using historical deployment tool logs. Continuously monitor for jobs that deviate significantly. Use time series analysis to detect activity outside of normal business or maintenance hours. Use descriptive statistics and frequency analysis to flag jobs initiated by rare accounts or targeting an unusual number or type of endpoints (e.g., a single high-value server). Correlate with login events (Windows Event ID 4624) on the management server to verify the initiating identity."
          },
          "A sequence of events where a software deployment job is followed by suspicious post-execution activity on target endpoints, such as creating new services or establishing external network connections.": {
            "Data": "Software deployment tool logs; Windows Event ID 4688; Windows Event ID 4697; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate events across multiple data sources within a defined time window (e.g., 5 minutes) following a deployment job. Define and monitor for a high-risk sequence: 1) A deployment job is created in the deployment tool logs. 2) A new process is created on a target system by the deployment agent (Windows Event ID 4688). 3) This new process then creates a new service (Windows Event ID 4697) or establishes a network connection to an external, non-corporate IP address (Zeek conn.log). Use correlation analysis based on hostname, timestamp, and process IDs to link these events and alert on the full chain of behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary moved laterally using software deployment tools? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1072 - Software Deployment Tools": {
          "Lateral movement attempt via deployment of a software package whose file hash matches a known malicious tool, such as a remote access trojan (RAT) or credential harvester.": {
            "Data": "Software deployment tool logs; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "From software deployment logs, extract the file hashes of all packages being pushed to new systems. Correlate these hashes against a CTI feed of known malware and hacking tools. Prioritize alerts for deployments targeting multiple systems or critical servers, as this indicates a lateral spread of a known malicious payload. Use Windows Event ID 4688 on target hosts to confirm execution and capture process details."
          },
          "Use of software deployment tools to execute commands or deploy scripts with syntax characteristic of direct lateral movement, such as invoking PsExec, WinRM, WMI, or creating remote scheduled tasks.": {
            "Data": "Software deployment tool logs; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan the command lines (from Windows Event ID 4688) and script content of deployment jobs for patterns specific to lateral movement techniques. Use regular expressions to search for commands like 'psexec.exe \\\\<target>', 'winrs.exe -r:<target>', 'wmic /node:<target> process call create', or 'schtasks /create /s <target>'. Flagging these patterns within a legitimate deployment system is a strong indicator of misuse for lateral movement."
          },
          "A software deployment job initiated from a recently compromised user workstation or non-standard server, rather than an authorized administrative console, to push software to other systems.": {
            "Data": "Software deployment tool logs; Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze software deployment tool logs to identify the source IP address or hostname that initiated a deployment job. Correlate this source with security alerts or internal lists of known/suspected compromised systems. Establish and maintain a baseline of authorized administrative workstations and alert on any deployment jobs initiated from outside this set. Use correlation analysis to link a suspicious login (Windows Event ID 4624) to a management server with a subsequent lateral movement deployment."
          },
          "Software deployment jobs targeting a sequence of systems or a small number of disparate, high-value systems in a pattern inconsistent with standard enterprise-wide patching or software distribution.": {
            "Data": "Software deployment tool logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the target lists of all software deployment jobs. Use graph analysis or correlation to identify 'island hopping' patterns where a job targets one system, and a subsequent job is initiated from or targets a system in close network proximity to the first. Flag deployments with a small number of targets (<5) that are not part of a standard test group, especially if they include critical assets like domain controllers, database servers, or developer workstations. Cross-reference targeting data with Zeek conn.log to see if the deployment source first connected to the targets using non-standard protocols before the deployment."
          },
          "A user or service account with software deployment privileges exhibiting activity that deviates from its established behavioral baseline, such as deploying software for the first time or targeting systems outside its normal administrative scope.": {
            "Data": "Software deployment tool logs; Active Directory logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each account with deployment privileges, build a profile of its typical activity: types of packages deployed, systems/groups targeted, and time of day. Use descriptive statistics and frequency analysis to establish this baseline. Monitor for significant deviations, such as an account that normally only patches servers suddenly deploying a new executable to workstations, or vice versa. Use Active Directory group membership data to understand the account's expected scope and flag any out-of-scope deployment activity as potential lateral movement."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```