[
  {
    "Is the adversary using file transfer protocols for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1071.002 - File Transfer Protocols": {
          "Network traffic exhibiting uncommon data flows (e.g., large outbound data transfers via SMB/FTP) associated with internal systems.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek smb.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ftp.log, and smb.log. For internal source IPs, calculate the ratio of bytes_sent to bytes_received. Flag internal hosts with significantly high send/receive ratios (e.g., using IQR or percentile analysis on the ratio distribution) for SMB/FTP traffic compared to their historical baseline or peer groups. Correlate flagged network traffic with Windows Event ID 4688 to identify the initiating process."
          },
          "Network connections using file transfer protocols originating from processes not typically expected to use these protocols or showing protocol non-compliance.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek smb.log; Zeek dce_rpc.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, ftp.log, smb.log, dce_rpc.log) for connections using file transfer ports (20, 21, 139, 445) or protocols. Cross-reference network connections with Windows Event ID 4688 (Process Creation) based on time and source/destination IP/Port to identify processes involved. Flag network activity by processes not typically associated with file transfers based on a maintained baseline. Analyze Zeek logs for protocol anomalies or unusual field usage by analyzing command names, status codes, and RPC calls for low frequency occurrences."
          },
          "File transfers containing unusual or suspicious content or characteristics (e.g., high entropy, executable files in uncommon locations/names) via file transfer protocols.": {
            "Data": "Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek file.log for files transferred via SMB, FTP, FTPS, TFTP. Calculate Shannon entropy for transferred file content (if logged) and flag files with significantly high entropy values (e.g., using percentile analysis on entropy distribution). Flag transfers of executable file types (.exe, .dll, .ps1, etc.) or archive types (.zip, .rar, .7z) in unexpected contexts (e.g., transferred between standard users). Use descriptive statistics on file sizes, types, or entropy over time to identify outliers."
          },
          "Persistent or recurring file transfer protocol connections from internal systems to external, potentially unfamiliar destinations, especially outside normal business hours.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek smb.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log, ftp.log, and smb.log for connections originating from internal systems to external IP addresses using file transfer ports. Use time series analysis to identify recurring connections or persistent sessions to the same external destinations over an extended period, particularly if occurring outside of normal business hours for the originating system/user. Calculate the frequency of connections to external IPs using these protocols and flag low-frequency or newly observed destinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]