[
  {
    "Is the adversary using mail protocols for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1071.003 - Mail Protocols": {
          "Unusual data volume or flow direction observed in SMTP/POP3/IMAP traffic, such as a client sending excessive data.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Zeek pop3.log; Zeek imap.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log, pop3.log, imap.log for sessions where the client sends significantly more data than the server receives (e.g., using descriptive statistics or ratios on 'orig_bytes' and 'resp_bytes' fields). Flag sessions exceeding a defined threshold or percentile."
          },
          "Network traffic using mail protocols originating from processes not typically associated with email clients, or mail protocol traffic violating standard RFC formats.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Zeek pop3.log; Zeek imap.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network sessions using mail protocols (Zeek conn.log, smtp.log, pop3.log, imap.log) with host process creation logs (Windows Event ID 4688) to identify processes initiating mail protocol connections that are not standard mail clients. Analyze packet contents (if available in logs, or require deeper inspection) for anomalies or non-standard formatting that indicates data concealment, potentially using entropy measures to identify high-entropy data within expected cleartext fields."
          },
          "Connections from internal hosts to external mail servers not part of the standard organization's email infrastructure or to servers known for malicious activity.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Zeek pop3.log; Zeek imap.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of approved or commonly used external mail server IP addresses and domains connected to by internal hosts. Monitor Zeek conn.log, smtp.log, pop3.log, imap.log for connections to external IPs/domains not in the baseline. Cross-reference these external IPs/domains with threat intelligence feeds. Flag and investigate connections to suspicious or unknown external mail infrastructure."
          },
          "Mail protocol connections occurring at unusual intervals or times, or from accounts that do not typically send/receive email, suggesting automated C2 traffic.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Zeek pop3.log; Zeek imap.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze timestamps of Zeek mail protocol logs (conn.log filtered by port, smtp.log, pop3.log, imap.log). Use time series analysis or statistical measures (e.g., standard deviation of inter-arrival times) to identify connections that occur with suspicious regularity (e.g., every 60 seconds) or outside of normal business hours for the associated user/system. Correlate with Windows Event ID 4624 to identify the user account involved if possible. Flag connections from accounts or systems that historically have no or very low mail traffic using frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]