[
  {
    "Has the adversary gained initial access using default accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Login attempts (failed or successful) targeting default operating system accounts (e.g., Administrator, Guest).": {
            "Data": "Windows Event ID 4624, Windows Event ID 4625",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (success) and 4625 (failure) for logins using known default account names (e.g., Administrator, Guest, root). Analyze login attempt volume over time using time series analysis to detect spikes or anomalies. Calculate success/failure rates for default accounts using descriptive statistics."
          },
          "Authentication attempts to appliances, network devices, or applications using known default credential pairs or common default usernames/passwords.": {
            "Data": "Zeek conn.log, Application/Appliance Authentication Logs",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Ingest authentication logs from network devices, appliances, and applications. Search for successful logins using known default username/password combinations. Correlate authentication events with Zeek conn.log to identify source IPs and destinations. Use frequency analysis to identify repeated attempts against multiple devices/applications."
          }
        }
      }
    }
  },
  {
    "Is the adversary maintaining persistence using default accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Repeated successful logins to default accounts or accounts known to use default/weak credentials, especially if previously unused.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4625, Application/Appliance Authentication Logs",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track successful logins (Event ID 4624, appliance logs) by known default/weak accounts. Calculate baseline login frequency and time-of-day patterns using descriptive statistics. Flag logins deviating significantly from the baseline or occurring at unusual times/frequencies over a prolonged period."
          },
          "Activity originating from a default account (e.g., process creation, network connections) inconsistent with its intended purpose or typical baseline.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes spawned by default accounts. Analyze Zeek conn.log for network connections initiated by hosts logged in as default accounts. Compare activity patterns (process types, connection destinations, data volume) to expected behavior for default accounts, identifying outliers or entropy increases in activity."
          }
        }
      }
    }
  },
  {
    "Has the adversary escalated privileges using default accounts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Successful actions indicative of privilege escalation (e.g., service installation, user creation, configuration changes) attributed to a default account.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4672, Windows Event ID 4720, Windows Event ID 4732, Windows Event ID 4756",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624, 4672, 4720, 4732, 4756 for actions performed by default accounts. Specifically search for these accounts being added to privileged groups or performing actions like creating users/services immediately after login. Correlate these events with preceding login events to identify privilege escalation attempts."
          },
          "Creation/activation of default accounts followed by privileged actions.": {
            "Data": "Windows Event ID 4720, Windows Event ID 4624, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 for the creation or activation of default accounts. Immediately follow up by monitoring subsequent login events (Event ID 4624) and process creation (Event ID 4688) from the activated default account to detect suspicious privileged actions."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using default accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Access logs showing a default account accessing resources or systems that normal user accounts cannot access.": {
            "Data": "Windows Event ID 4624, Application/Appliance Authentication Logs",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Audit access logs (Windows Event ID 4624, application logs) for attempts by default accounts to access sensitive resources or configuration settings. Correlate access attempts with ACLs or policy logs to identify instances where default accounts are inappropriately granted access. Use correlation analysis between login events and resource access events."
          },
          "Network traffic or host logs showing activity from a default account that bypasses standard logging or monitoring configurations.": {
            "Data": "Zeek conn.log, Windows Event ID 4688, Application/Appliance logs",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and Windows Event ID 4688 for network connections and process executions originating from default accounts. Look for signs of activity that might bypass standard monitoring, such as connections to unusual ports or execution of scripts that modify logging configurations. Use outlier detection on connection patterns or process names."
          }
        }
      }
    }
  }
]