[
  {
    "Is the adversary using publish-subscribe protocols for command and control? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1071.005 - Publish-Subscribe Protocols": {
          "Unusual volume or pattern of network traffic using known pub/sub ports or protocols (MQTT, XMPP, AMQP, STOMP).": {
            "Data": "Zeek conn.log; Zeek mqtt.log; Zeek xmpp.log; Zeek amqp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections using known pub/sub ports (e.g., MQTT default 1883/8883, XMPP default 5222/5223) or identified via Zeek protocol detection modules (mqtt.log, xmpp.log, amqp.log). Use time series analysis to baseline normal traffic volume and frequency for these protocols per internal host/network segment and flag significant deviations (e.g., sudden spikes or persistent low-volume, high-frequency traffic)."
          },
          "Communication to/from internal systems to external, untrusted servers acting as potential pub/sub brokers using these protocols.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek mqtt.log; Zeek xmpp.log; Zeek amqp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify internal systems communicating with external IPs using pub/sub protocols (via Zeek conn.log, mqtt.log, xmpp.log, amqp.log). Correlate destination IPs with DNS logs (Zeek dns.log) to identify domain names. Use threat intelligence feeds to check if destination IPs/domains are known malicious or suspicious brokers. Investigate communication patterns (e.g., correlation analysis of internal source IPs with external destinations, connection duration, bytes transferred)."
          },
          "Internal systems subscribing to or publishing on unusual or unauthorized topics via pub/sub protocols.": {
            "Data": "Zeek mqtt.log; Zeek xmpp.log; Zeek amqp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek protocol-specific logs (mqtt.log, xmpp.log, amqp.log) for details on topics being published to or subscribed from internal systems. Identify topics that are unusual for the system's role or depart from a baseline of known/authorized topics for that host. Flag communication involving suspicious topics. Calculate topic frequency distribution per internal host and identify low-frequency or previously unseen topics as potential indicators of C2."
          },
          "Correlation of pub/sub communication events with suspicious host activity (e.g., process execution, file modification) on internal systems.": {
            "Data": "Zeek conn.log; Zeek mqtt.log; Zeek xmpp.log; Zeek amqp.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify instances of pub/sub protocol communication from internal systems (Zeek logs). Correlate these communication events (by timestamp and host) with process creation events (Windows Event ID 4688) or network connection events (Windows Event ID 5156) on the same internal host within a short time window (e.g., +/- 60 seconds). Investigate host activity that immediately precedes or follows pub/sub C2 communication, looking for suspicious processes, commands, or connections not part of normal operations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]