[
  {
    "Is the adversary attempting to remove indicators of compromise? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1070 - Indicator Removal": {
          "Detection of Windows Security Event ID 1102 (audit log cleared) or unusual log file size/modification time changes.": {
            "Data": "Windows Event ID 1102; Windows Event ID 1104; Windows Event ID 104",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security logs for Event ID 1102 (Security log cleared) and 1104 (log full). Monitor System and Application logs for Event ID 104 (log cleared). Alert immediately on detection. Additionally, use time series analysis on log file sizes/modification times to detect unusual changes or resets."
          },
          "Detection of deletion or modification of known log files, temporary files, or artifacts left by tools via file system monitoring.": {
            "Data": "Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for execution of commands or scripts associated with file deletion ('del', 'erase', 'rm', PowerShell 'Remove-Item'). Correlate with known locations for temporary files or potential adversary artifacts. Analyze Zeek files.log for unusual file deletion events occurring across multiple systems or outside normal operational contexts. Use statistical analysis (e.g., entropy) on frequently modified directories to spot abnormal changes."
          },
          "Changes to system logging or auditing configurations (e.g., via registry, service, or policy modification).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 7035; Windows Event ID 7036; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor relevant Windows Event IDs (4656, 4657, 4663 on specific logging/auditing registry keys; 7035/7036 for services like 'EventLog'; 4688 for `auditpol.exe`, `wevtutil.exe`, `reg.exe` modifying logging settings). Establish baseline configurations and alert on any changes to logging settings. Use correlation analysis to link configuration changes to specific user accounts or processes."
          },
          "Deletion of scheduled tasks outside of normal administrative procedures.": {
            "Data": "Windows Event ID 106 (Microsoft-Windows-TaskScheduler/Operational)",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Task Scheduler Operational logs (Event ID 106 - 'Task Deleted'). Establish a baseline of legitimate task deletion activity (e.g., software uninstalls, patch management cleanup). Flag deletions of tasks created recently or exhibiting patterns inconsistent with baseline using frequency analysis. Correlate deletion events with recent system activity (process creation, user logons) to identify potential adversary cleanup."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]