[
  {
    "Is the adversary attempting to evade defenses by clearing logs? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.001 - Clear Windows Event Logs": {
          "Windows Security Event ID 1102 indicating the audit log was cleared.": {
            "Data": "Windows Event ID 1102",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Alert and investigate immediately upon detection of Windows Event ID 1102 on any host. Correlate timestamp with other host activity logs (e.g., process creation, logins) to identify potential preceding adversary actions using time-based correlation."
          },
          "Detection of command-line execution of `wevtutil cl` or `Remove-EventLog` or deletion of .evtx log files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events containing command-line arguments like `wevtutil cl`, `Remove-EventLog`, or paths to .evtx files in deletion commands. Use correlation analysis to link these process executions to specific users, parent processes, or unusual execution paths."
          },
          "Deletion of Windows event log files (.evtx) from C:\\Windows\\System32\\winevt\\logs\\.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure System Access Control Lists (SACLs) on `C:\\Windows\\System32\\winevt\\logs\\` to audit deletion attempts (Event ID 4663). Monitor Event ID 4663 specifically for deletions targeting files with the `.evtx` extension in this directory. Alert on such deletions, especially if not associated with known system maintenance tasks. Use correlation analysis with Event ID 4688 (Process Creation) to identify the source process."
          },
          "Sudden and significant decrease or cessation of security event logging from an endpoint or server.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the rate of incoming Windows Security Event IDs (e.g., 4624, 4625, 4688) from each endpoint and server over time in the log aggregation system. Establish a baseline for normal log volume per host using time series analysis (e.g., moving average, standard deviation). Alert on statistically significant drops (e.g., rate falling below a threshold or multiple standard deviations below baseline) or complete cessation of logs from a host, especially if not accompanied by a host shutdown event."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]