```json
[
  {
    "Is the adversary using file transfer protocols for command and control? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1071.002 - File Transfer Protocols": {
          "File transfer protocol (FTP, SMB) connections to or from external IP addresses or domains known to be associated with command and control infrastructure.": {
            "Data": "Zeek conn.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously inner join source and destination IP addresses from Zeek conn.log and ftp.log (for ports 20, 21, 139, 445) with a high-confidence threat intelligence feed of known malicious C2 IPs and domains (updated within at least 24 hours). Alert on any matches and investigate the associated host and data transferred for signs of C2 activity."
          },
          "Use of specific FTP commands, SMB file naming conventions, or other protocol artifacts known to be associated with particular malware C2 frameworks.": {
            "Data": "Zeek ftp.log; Zeek smb_files.log; Zeek smb_mapping.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ftp.log for unusual command sequences (e.g., PUT immediately followed by DELE) or commands with arguments matching known C2 patterns. Analyze Zeek smb_files.log and smb_mapping.log for file creation or access with names matching regular expressions used by known malware for C2 communications (e.g., `[a-f0-9]{16}.dat`). Maintain and regularly update a list of these tool-specific patterns and signatures. Use correlation analysis to link suspicious commands or filenames to specific hosts."
          },
          "Anomalous data transfer volumes or directionality (upload vs. download) over file transfer protocols, deviating from established baselines for a host or user group.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek smb_files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal data transfer volumes, file counts, and upload/download ratios for FTP and SMB traffic per host and user group. Analyze Zeek conn.log, ftp.log, and smb_files.log to monitor for significant deviations from this baseline. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores on transfer sizes or ratios to identify outliers, which could indicate data exfiltration or C2 payload delivery. Use linear regression to detect anomalous trends in data transfer over time."
          },
          "Repetitive, periodic (beacon-like) connections using file transfer protocols from an internal host to a specific external destination, especially to low-prevalence or newly seen IPs.": {
            "Data": "Zeek conn.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for FTP and SMB connections from internal hosts to external destinations. For each unique source-destination pair, calculate the inter-arrival time between connections over a given window. Use time series analysis and descriptive statistics (e.g., mean, standard deviation of inter-arrival times) to identify highly periodic traffic characteristic of C2 beaconing. Correlate findings with destination IP reputation and use frequency analysis to prioritize alerting on connections to newly seen or rare external destinations."
          },
          "File transfer protocol connections initiated by unexpected processes or exhibiting protocol anomalies inconsistent with standard client/server behavior.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek smb.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connections on file transfer ports (20, 21, 139, 445) from Zeek logs with process creation events (Windows Event ID 4688) on the source host based on timestamp and connection tuples. Maintain a baseline of legitimate processes that use these protocols (e.g., explorer.exe, ftp.exe) and flag connections from unusual parent/child processes (e.g., svchost.exe spawning a connection). Analyze Zeek ftp.log or smb.log for protocol anomalies, such as the use of non-standard commands or malformed requests, by identifying low-frequency occurrences."
          },
          "Transfer of files with characteristics indicative of C2 payloads or staged data, such as high entropy, encrypted archives, or executable content, over FTP or SMB channels.": {
            "Data": "Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek files.log for all files transferred via SMB and FTP. Automatically calculate Shannon entropy for transferred files and flag those with entropy values significantly higher than the baseline for their file type (indicating encryption or packing). Create alerts for transfers of executable files (.exe, .dll, .ps1), script files, or common archive types (.zip, .rar, .7z) to or from external destinations, especially when the context is unusual (e.g., not part of a legitimate software update). Use box-plots on file entropy or size distributions to visually identify outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```