[
  {
    "Has the adversary gained initial access to the network via compromised cloud accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Successful or failed login attempts to cloud accounts from unusual geographic locations or IP addresses, or outside of normal business hours.": {
            "Data": "Cloud Access/Audit Logs, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud access logs for login events. Geolocate source IPs. Compare source IPs and geographic locations against allowed lists, corporate VPNs, or known user activity patterns. Identify statistically rare locations/IPs or logins occurring outside of established business hours using descriptive statistics or time series analysis."
          },
          "Initial access to cloud resources or services via a compromised cloud account that are not typically accessed by that user/service principal.": {
            "Data": "Cloud Access/Audit Logs, Cloud Resource Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud resource access logs. Identify resource types and services accessed by compromised accounts. Use correlation analysis to compare accessed resources against baseline activity for the account/user. Flag access to sensitive or unusual resources based on deviation from established baselines."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary maintaining persistence using compromised cloud accounts or credentials? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Creation of new, long-lasting cloud credentials (API keys, access keys, tokens) associated with a compromised cloud account.": {
            "Data": "Cloud Access/Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for events indicating the creation or modification of access keys, API keys, or secret keys. Correlate these events with prior suspicious activity on the account. Alert on new credentials, especially those set with long expiration times or without expiration."
          },
          "Repeated access to cloud resources or services over extended periods using a compromised account, exhibiting consistent access patterns inconsistent with normal behavior.": {
            "Data": "Cloud Access/Audit Logs, Cloud Resource Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud access logs for login frequency and duration for potentially compromised accounts over time. Identify consistent access patterns at unusual times or from unusual locations using time series analysis. Correlate with resource access patterns to identify persistent data exfiltration or configuration changes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary escalated privileges using compromised cloud accounts or misconfigurations? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Attempts or successful assumption of elevated cloud roles (e.g., IAM roles, Azure AD roles) by a compromised cloud account.": {
            "Data": "Cloud Access/Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for events related to identity and access management, specifically role assumption, role assignments, and policy modifications. Identify compromised accounts attempting or succeeding in assuming roles with elevated privileges using correlation analysis against account login anomalies."
          },
          "Usage of stolen application access tokens or managed identity credentials by a compromised resource or account to access other cloud resources.": {
            "Data": "Cloud Access/Audit Logs, Cloud Resource Logs, Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for token usage events. Analyze Zeek conn.log and Windows Event ID 4624 (Logon Type 9) on hybrid endpoints for activity originating from compromised accounts using non-standard authentication methods (e.g., access tokens). Correlate token usage with resource access to detect lateral movement."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using compromised cloud accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Successful authentication using compromised cloud account credentials without MFA when MFA is normally required (e.g., using stolen session cookies, revoked credentials).": {
            "Data": "Cloud Access/Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud authentication logs to identify successful logins where MFA status is indicated as bypassed or not enforced. Correlate these events with login source (IP, geo-location) and time to identify potential MFA bypass attempts using stolen credentials or session artifacts."
          },
          "Execution of commands or actions on hybrid-joined endpoints using compromised cloud accounts via SaaS deployment tools, bypassing endpoint defenses.": {
            "Data": "Cloud Access/Audit Logs, Windows Event ID 4688, Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on hybrid-joined endpoints for processes launched by compromised cloud accounts via deployment tools. Analyze command lines for suspicious activity. Use correlation analysis to link endpoint process creation events with cloud audit logs indicating deployment tool usage."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]