[
  {
    "Has the adversary gained initial access using compromised local accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Successful login attempts by local accounts originating from unusual source IPs or exhibiting anomalous behavior.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs for successful local account logins. Identify source IP addresses. Use Zeek conn.log to gather more network context for these connections. Use descriptive statistics (mean, median, mode) and outlier detection (e.g., Z-score, box plots) on source IP location, login time, and login frequency per account to flag anomalies."
          },
          "Creation of new local user accounts that do not align with standard provisioning processes.": {
            "Data": "Windows Event ID 4720",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 for local account creation. Compare new account names and properties against known good baselines or approved account lists. Flag any creation event that lacks proper change management documentation or follows suspicious naming conventions using string matching or rule-based analysis. Baseline the frequency of account creation events and alert on significant deviations (e.g., multiple accounts created in a short period)."
          },
          "Suspicious failed login attempts targeting local accounts from external or unusual source IPs.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4625 logs for failed local account logins. Group events by source IP and target local account. Use statistical methods (e.g., count per minute/hour, Z-score) to identify source IPs or accounts with an unusually high rate of failed attempts within a short period. Correlate with Zeek conn.log to check if source IPs are external or known suspicious and prioritize based on frequency and duration of failed attempts."
          },
          "First-time use of a local account for network access (Logon Type 3) or connections from unusual remote source IPs.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal logon types (4624.Logon Type) and source IPs for local accounts over time using descriptive statistics. Use correlation to identify local accounts performing network logons (Type 3) from remote IPs for the first time, or from IPs historically associated only with remote management services (e.g., RDP, WinRM) and now used for general network access."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using compromised local accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Repeated successful logins by the same local account at unusual times or from different/suspicious locations over time.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track successful local account logins (Windows Event ID 4624) over time. Analyze login frequency, time of day, and source location for specific accounts. Use time series analysis or correlation to identify persistent patterns inconsistent with normal user behavior, especially for accounts that previously had minimal activity or show logins consistently outside established business hours (using IQR or percentile analysis on login times)."
          },
          "Local accounts executing services or scheduled tasks with unusual parameters or from non-standard locations.": {
            "Data": "Windows Event ID 4697; Windows Event ID 4702; Windows Event ID 4698; Windows Event ID 4699; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697, 4702 (Service), 4698, 4699 (Scheduled Task), and 4688 (Process creation) events associated with local accounts. Analyze the created/started service/task name, command line, and path. Use rule-based detection or correlation with threat intelligence to identify malicious or unusual service/task execution by a local account. Baseline common tasks/services initiated by local accounts and flag deviations."
          },
          "Modification of existing local account properties indicative of persistence (e.g., password settings, group membership changes).": {
            "Data": "Windows Event ID 4723; Windows Event ID 4724; Windows Event ID 4738; Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4723, 4724, 4738, 4728, 4732, and 4756. Filter for changes affecting local accounts. Identify the account making the change. Flag changes to 'Password Not Required', 'Account Enabled/Disabled' (if unexpectedly enabled), 'User Cannot Change Password', or addition to remote access/privileged groups. Correlate changes with administrative change logs or baseline normal administrative activity frequency using statistical counts."
          },
          "Creation or modification of startup items, registry run keys, or WMI persistence mechanisms under a local account's context.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process creation with command line) and 4657 (Registry value modification) filtering for events under the context of a local account. Use pattern matching on command lines or registry keys associated with common persistence locations (`Run` keys, Startup folders, WMI event subscriptions). Baseline typical processes/registry changes initiated by local accounts and use frequency analysis to spot anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using compromised local accounts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Local account attempting or succeeding in privilege escalation actions (e.g., modifying group memberships, executing privileged commands).": {
            "Data": "Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4728, 4732, 4756 (Group membership changes) and 4688 (Process creation with command line, integrity level). Filter events for local accounts attempting to add themselves or others to high-privilege groups (e.g., Administrators) or executing known privilege escalation tools/commands. Use correlation analysis to link successful privilege changes to preceding account activity or process execution by the local account."
          },
          "Local account executing commands or processes indicative of credential dumping.": {
            "Data": "Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process creation) for command lines or process names associated with credential dumping tools (e.g., mimikatz, procdump, taskmgr creating dumps, specific PowerShell commands like 'Out-Minidump'). Correlate with Zeek files.log if dumped files are written to network shares or exfiltrated. Use pattern matching or behavioral analysis based on common dumping techniques and baseline typical process execution by local accounts."
          },
          "Execution of processes with elevated privileges by a low-privilege local account (e.g., via UAC bypass).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Filter for processes created under the context of local accounts that are not members of administrator groups. Analyze the 'TokenElevationType' field (indicating privilege level) or look for command lines associated with known UAC bypass techniques. Use correlation to link potentially elevated processes to the local account's activity history."
          },
          "Accessing or modifying sensitive system security objects or files (e.g., SAM, SECURITY hives) by a local account.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable SACLs for sensitive objects (e.g., registry hives like `HKLM\SAM`, `HKLM\SECURITY`, or system files like `%SystemRoot%\System32\config\SAM`). Monitor Windows Event ID 4656 and 4663 for access attempts by local accounts to these objects, specifically looking for write or delete permissions. Baseline normal access patterns by necessary system processes and flag unusual access by interactive or network-logged-on local accounts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using compromised local accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Local account associated with process execution or command line activity typically blocked or alerted for standard users.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process creation) and relevant object access events (e.g., 4656, 4663) associated with local accounts. Look for execution of programs or access to files/registry keys that are typically restricted or monitored for standard users. Use rule-based detection and correlation with endpoint security alerts or threat intelligence feeds. Baseline common processes run by local accounts and flag rare or previously unseen processes."
          },
          "Network connections initiated by processes running under the context of a local account to suspicious external or internal destinations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify network connections originating from hosts. Correlate network connections with process execution events (Event ID 4688) on the host to identify connections made under the context of a local account. Use correlation analysis and threat intelligence lookup to link outbound connections to suspicious destinations (e.g., known C2, unusual ports/protocols). Identify connections to IPs/domains with low entropy or high suspiciousness scores."
          },
          "Modification or deletion of security event logs by a local account.": {
            "Data": "Windows Event ID 1102",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 1102 (The audit log was cleared) and filter for events where the Subject Account is a local account. While this event shows *who* cleared the log, it doesn't show *how* they got the privilege. Correlate log clearing events by local accounts with preceding suspicious activity by that account (e.g., successful privilege escalation attempts) to establish context."
          },
          "Execution of signed but malicious code or living-off-the-land binaries (LOLBins) under the context of a local account.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Filter for processes created under local account context. Analyze command lines, process names, and parent-child relationships for suspicious usage of common Windows utilities (LOLBins like `powershell.exe`, `cmd.exe`, `wmic.exe`, `certutil.exe`, `bitsadmin.exe`, `regsvr32.exe`, etc.). Use pattern matching and anomaly detection based on baseline command line arguments and execution paths for these utilities under local accounts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]