[
  {
    "Is the adversary communicating with external infrastructure using DNS tunneling? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1071.004 - DNS": {
          "Client sending significantly more data than it receives via DNS queries.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log. For each client IP, compare the byte counts of DNS queries sent (client->server) vs. responses received (server->client). Identify clients with a high ratio of bytes sent to bytes received using descriptive statistics (mean, median, IQR) and flag outliers."
          },
          "DNS queries to known-bad or suspicious domains or with anomalous content/syntax.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log. Compare queried domain names against internal lists of known-bad domains (threat intelligence) using inner joins. Analyze query content (e.g., QNAME) for unusually long or complex structures, high entropy, or suspicious characters using entropy measures or correlation analysis with known bad patterns."
          },
          "DNS queries originating from unusual or non-standard processes on host systems.": {
            "Data": "Windows Event ID 4688; Zeek dns.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek dns.log entries (source IP/hostname) with process creation events (Windows Event ID 4688, including command line and parent process) on relevant hosts. Identify processes observed making DNS queries, especially those with command line arguments or parent processes that are unusual or not typically associated with network communication. Establish baselines of processes making DNS requests and flag outliers or newly observed processes using frequency analysis or time series charting."
          },
          "DNS queries utilizing uncommon or suspicious DNS record types or structures for data exfiltration or command and control.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log to identify DNS queries requesting or using unusual Resource Record (RR) types (e.g., TXT, NULL, SRV, NAPTR used in unexpected ways). Filter logs for queries/responses with anomalously large data sections or unusual encoding patterns within RR data. Use descriptive statistics to identify rare RR types or data sizes and flag sessions for investigation using percentile analysis or IQR."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]