[
  {
    "Is the adversary attempting to evade defenses by clearing logs? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.002 - Clear Linux or Mac System Logs": {
          "Modification or deletion of critical system log files (e.g., /var/log/secure, /var/log/auth.log, /var/log/messages).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) on Linux/Mac endpoints (via agent). Filter events targeting known critical log file paths (/var/log/*). Analyze event types for deletion or modification. Use time series analysis to identify unusual spikes in file modification events in log directories."
          },
          "Suspicious processes accessing or writing to system log files (e.g., non-standard utilities or malware interacting with log directories).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and 4663 (Object Access) on Linux/Mac endpoints (via agent). Identify processes spawned in suspicious locations or with suspicious names/arguments. Correlate process creation events with Event ID 4663 events showing access or modification of log files by these processes. Use correlation analysis to link specific processes to log file changes."
          },
          "Execution of command-line utilities or scripts commonly used to clear or tamper with log files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing suspicious keywords or patterns associated with log clearing (e.g., `rm /var/log/*`, `echo > /var/log/syslog`, `cat /dev/null > /var/log/messages`, `shred /var/log/*`). Use keyword matching and regular expressions to identify potentially malicious commands executed by processes on Linux/Mac endpoints."
          },
          "High volume of file write or delete operations targeting critical system log files within a short time frame.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 events where the Object Name matches critical log file paths (`/var/log/*`) and the Accesses field indicates 'WriteData' or 'Delete'. Aggregate these events by hostname and log file path. Identify instances where the rate of these events significantly exceeds the historical baseline (e.g., using time series analysis or statistical process control) or where multiple delete operations target log files within a short interval (e.g., calculate event frequency per file path per time unit)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]