```json
[
  {
    "Is the adversary attempting to evade defenses by clearing logs? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1070.002 - Clear Linux or Mac System Logs": {
          "Execution of a process or script whose file hash is known to correspond to a malicious log-clearing utility or malware component.": {
            "Data": "Sysmon for Linux Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Sysmon for Linux Event ID 1) across Linux and Mac endpoints. Compare the file hashes (e.g., SHA256, MD5) of all executed processes against a high-confidence threat intelligence feed of known malicious tools and malware with log-clearing capabilities. Trigger a high-severity alert on any match and investigate the host for further compromise."
          },
          "Execution of shell commands, utilities, or script arguments specifically designed to truncate, delete, or overwrite standard Linux/Mac log files.": {
            "Data": "Auditd logs (syscall type=execve); Sysmon for Linux Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Sysmon for Linux Event ID 1) and execve syscalls (from auditd) for command lines containing patterns commonly used for log clearing. Use regular expressions to detect commands such as `> /var/log/`, `cat /dev/null >`, `shred /var/log/*`, `rm /var/log/`, `truncate -s 0`, or scripts manipulating log files. Correlate detections with user context (e.g., execution by a web server process versus an administrator) to reduce false positives."
          },
          "Execution of commands intended to tamper with, disable, or delete shell command history.": {
            "Data": "Auditd logs (syscall type=execve); Sysmon for Linux Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Sysmon for Linux Event ID 1) and execve syscalls (auditd) for command lines indicative of history tampering. Use keyword and regular expression matching for commands like `unset HISTFILE`, `export HISTFILE=/dev/null`, `history -c`, `ln -s /dev/null .*_history`, `echo '' > .*_history`, or `rm .*_history`. Correlate this activity with other suspicious commands executed within the same session or by the same parent process."
          },
          "Anomalous file modification or deletion activity targeting critical log directories, characterized by unusual processes, high frequency, or occurring immediately after other suspicious behavior.": {
            "Data": "Auditd logs (syscall type=unlink, unlinkat, truncate, rename); Sysmon for Linux Event ID 11; Sysmon for Linux Event ID 23; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file system events in critical log locations (e.g., /var/log, /var/run/utmp, user home directories for .*_history). Establish a baseline of normal log rotation and modification activity using descriptive statistics. Use time series analysis to detect anomalous spikes in file deletion or truncation events (Sysmon Event ID 23/11, auditd `unlink`/`truncate`). Use correlation analysis to link log modification events to preceding suspicious activity, such as a reverse shell connection (identified from Zeek conn.log) or malware execution (Sysmon Event ID 1), within a short time window (e.g., 5 minutes)."
          },
          "Anomalous stoppage, disabling, or reconfiguration of critical logging services (e.g., auditd, rsyslogd) not associated with planned system maintenance.": {
            "Data": "Sysmon for Linux Event ID 1; Auditd logs (syscall type=execve, kill)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for commands used to stop, disable, or kill logging daemons, such as `systemctl stop auditd`, `service rsyslog stop`, `launchctl unload /System/Library/LaunchDaemons/com.apple.syslogd.plist`, or `kill` commands targeting the PID of a logging process. Correlate these actions with system change request logs or maintenance schedules to filter out legitimate activity. Use descriptive statistics to identify hosts where logging services are stopped with unusually high frequency compared to baseline, suggesting repeated tampering."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```