[
  {
    "Has the adversary gained initial access using compromised local accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Successful login attempts by local accounts originating from unusual source IPs or exhibiting anomalous behavior.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs for successful local account logins. Identify source IP addresses. Use Zeek conn.log to gather more network context for these connections. Use descriptive statistics and outlier detection (e.g., Z-score, box plots) on source IP location, login time, and login frequency to flag anomalies."
          },
          "Creation of new local user accounts that do not align with standard provisioning processes.": {
            "Data": "Windows Event ID 4720",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 for local account creation. Compare new account names and properties against known good baselines or approved account lists. Flag any creation event that lacks proper change management documentation or follows suspicious naming conventions using string matching or rule-based analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary maintaining persistence using compromised local accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Repeated successful logins by the same local account at unusual times or from different/suspicious locations over time.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track successful local account logins (Windows Event ID 4624) over time. Analyze login frequency, time of day, and source location for specific accounts. Use time series analysis or correlation to identify persistent patterns inconsistent with normal user behavior, especially for accounts that previously had minimal activity."
          },
          "Local accounts executing services or scheduled tasks with unusual parameters or from non-standard locations.": {
            "Data": "Windows Event ID 4697, Windows Event ID 4702, Windows Event ID 4698, Windows Event ID 4699",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697, 4702 (Service), 4698, 4699 (Scheduled Task) events associated with local accounts. Analyze the created/started service/task name, command line, and path. Use rule-based detection or correlation with threat intelligence to identify malicious or unusual service/task execution by a local account."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges using compromised local accounts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Local account attempting or succeeding in privilege escalation actions (e.g., modifying group memberships, executing privileged commands).": {
            "Data": "Windows Event ID 4728, Windows Event ID 4732, Windows Event ID 4756, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4728, 4732, 4756 (Group membership changes) and 4688 (Process creation with command line). Filter events for local accounts attempting to add themselves or others to high-privilege groups (e.g., Administrators) or executing known privilege escalation tools/commands. Use correlation analysis to link successful privilege changes to preceding account activity."
          },
          "Local account executing commands or processes indicative of credential dumping.": {
            "Data": "Windows Event ID 4688, Zeek files.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process creation) for command lines or process names associated with credential dumping tools (e.g., mimikatz, procdump, taskmgr creating dumps, specific PowerShell commands like 'Out-Minidump'). Correlate with Zeek files.log if dumped files are written to network shares or exfiltrated. Use pattern matching or behavioral analysis based on common dumping techniques."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using compromised local accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.003 - Local Accounts": {
          "Local account associated with process execution or command line activity typically blocked or alerted for standard users.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process creation) and relevant object access events (e.g., 4656, 4663) associated with local accounts. Look for execution of programs or access to files/registry keys that are typically restricted or monitored for standard users. Use rule-based detection and correlation with endpoint security alerts."
          },
          "Network connections initiated by processes running under the context of a local account to suspicious external or internal destinations.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify network connections originating from hosts using specific local accounts (requires correlating host logs with network logs or enriching Zeek logs). Use correlation analysis to link outbound connections to suspicious destinations (e.g., known C2, unusual ports/protocols) with process execution events (Event ID 4688) under the local account's context on the host."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]