[
  {
    "Is the adversary attempting to evade defenses by clearing persistence artifacts? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.009 - Clear Persistence": {
          "Deletion or modification of system files, service configurations, or registry keys associated with known or suspicious persistence mechanisms.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4660; Windows Event ID 4688; Windows Event ID 4657; Zeek file.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663, 4660, 4688, 4657, Zeek file.log for deletion or modification events targeting common persistence locations (e.g., startup folders, system32, registry run keys, service paths). Correlate deletion/modification events with recent process activity. Use statistical analysis (e.g., frequency or time series) on these events to identify anomalous cleanup activity."
          },
          "Deletion of user accounts, particularly those recently created or modified.": {
            "Data": "Windows Event ID 4726; Windows Event ID 4720; Windows Event ID 4738",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4726 (Account Deletion). Correlate deletion events with recent account creation (4720) or modification (4738) events. Use time series analysis or frequency analysis to identify atypical timing or volume of account deletions."
          },
          "Deletion or modification of scheduled tasks or cron jobs associated with potential persistence.": {
            "Data": "Windows Event ID 4700; Windows Event ID 4701; Windows Event ID 4702; Windows Event ID 4698; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4700 (Task Deleted), 4701 (Task Modified), 4702 (Task Enabled/Disabled), and 4698 (Task Created) for events targeting suspicious scheduled task names, task actions (e.g., running suspicious executables), or tasks recently created. Correlate with process creation (4688) involving task management tools. Identify patterns of rapid creation and deletion/modification or unusual spikes using frequency analysis."
          },
          "Deletion of executable files recently created or modified in known persistence locations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4660; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (Object Accessed/Deleted) and 4660 (Object Deleted) for deletion events targeting executable files (.exe, .dll, .ps1, etc.) in common persistence directories (e.g., user Startup folders, C:\\Windows\\System32, paths referenced by Run keys or services). Correlate file deletion events with recent file creation/modification events (e.g., Sysmon Event ID 11 if available, or other file system activity logs) or process creation (4688) related to deletion tools. Use time series analysis to detect rapid deletion activity following recent file creation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]