[
  {
    "Is the adversary collecting and staging data for exfiltration? (TA0009 - Collection)": {
      "Indicators": {
        "T1074.002 - Remote Data Staging": {
          "Presence of unusual files (e.g., archives, encrypted files) in common staging directories (Temp, Recycle Bin, publicly writeable directories) on servers or endpoints.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation/modification events (Windows Event ID 4663) in common staging locations (e.g., %TEMP%, Recycle Bin, C:\\Public). Identify newly created archive or encrypted files (.zip, .rar, .7z, .gz, .aes, .enc). Use descriptive statistics on file sizes or entropy measures on file content to identify anomalous files in these locations."
          },
          "Process execution or command line arguments indicating collection/copying of data from disparate locations to a central directory, potentially involving compression/archiving utilities or scripting tools (PowerShell, cmd).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) and PowerShell logs. Look for command lines involving copying utilities (copy, xcopy, robocopy), compression/archiving tools (tar, gzip, 7z, WinRAR), or scripting (PowerShell, cmd) that access files from multiple directories and write to a single destination directory. Use correlation analysis to link file access events with the processes creating/modifying them."
          },
          "Unusual internal network connections to a host immediately preceding file creation/modification of large archives/encrypted files in common staging directories on that host.": {
            "Data": "Zeek conn.log; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing significant data transfer (e.g., large 'orig_bytes' or 'resp_bytes') from multiple internal source IPs to a specific host with subsequent file creation/modification events (Windows Event ID 4663) or process creation events (Windows Event ID 4688) related to archiving/compression tools on that host within a short time window (e.g., 1-5 minutes). Use correlation analysis to link these events and identify hosts acting as potential staging points receiving data from other internal sources. Use statistical measures like sum or mean on bytes transferred for correlation."
          },
          "Command line execution patterns using scripting/native utilities demonstrating collection from multiple distinct source paths to a single destination path in temporary or public directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command line arguments from Windows Event ID 4688 on endpoints and servers. Use pattern matching or regex to identify commands from 'cmd.exe', 'powershell.exe', 'pwsh.exe', 'copy', 'xcopy', 'robocopy', etc., that include source paths from multiple distinct directories or drive letters and a single destination path. Prioritize destinations that are common staging locations (%TEMP%, %PUBLIC%, Recycle Bin, user profile directories like Desktop/Downloads). Use frequency analysis to flag commands with unusual source/destination path combinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]