[
  {
    "Is the adversary communicating with external infrastructure using web protocols for command and control? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1071.001 - Web Protocols": {
          "Network traffic exhibiting unusual client-server data flow ratios over web protocols (e.g., client sending more data than receiving).": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log to calculate byte ratios (orig_bytes / resp_bytes). Identify outlier sessions where the client sends significantly more data than it receives (e.g., using IQR, percentile analysis, or simple thresholds). Investigate processes associated with this traffic on endpoints/servers by correlating session details with host logs like Windows Event ID 4688 for process creation and network connections (Event ID 5156)."
          },
          "Network traffic to/from known malicious domains or non-standard web protocol syntax detected.": {
            "Data": "Zeek http.log; Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Cross-reference domains/IPs in Zeek http.log and conn.log against Threat Intelligence feeds for known malicious or suspicious indicators. Perform passive DNS lookups on suspicious destinations. Analyze HTTP request/response syntax and headers in Zeek http.log for deviations from standard protocol, unexpected user agents, or embedded data (e.g., using entropy measures on specific header fields or request bodies) using descriptive statistics and string matching."
          },
          "Network connections over web protocols made by unusual or unexpected processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation and Windows Event ID 5156 for network connections. Correlate process names and paths with network sessions in Zeek conn.log and http.log using correlation analysis. Maintain a baseline of processes typically making external web connections using frequency analysis. Flag connections originating from processes rarely or never seen making such connections, or from unusual process paths."
          },
          "Presence of suspicious parameters, unusually long fields, or encoded data patterns within web protocol requests or responses.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze specific fields in Zeek http.log (URLs, headers, bodies) for unusually long values using descriptive statistics (length analysis), suspicious parameter names/values via string matching, or patterns indicative of encoding (e.g., base64). Calculate entropy of specific fields or request/response bodies to identify potential encoded data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]