[
  {
    "Has the adversary gained initial access using compromised domain accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.002 - Domain Accounts": {
          "Same domain account logged into multiple systems simultaneously.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs across all systems. Group events by Account Name. Identify instances where the same Account Name has successful logins (Logon Type 2 or 10) originating from different Source Workstation/IP Addresses within a short time frame (e.g., using time series analysis or correlation)."
          },
          "Domain account login from an unusual geographic location or outside normal business hours.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs for logins. Extract Account Name, Source IP, and Timestamp. Geolocate Source IPs. Calculate frequency and distribution of login times per account. Flag logins from rare/never-seen source locations or occurring outside established business hours (e.g., using descriptive statistics, IQR for login times)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary maintaining persistence using compromised domain accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.002 - Domain Accounts": {
          "Creation of a new domain account with administrative privileges or unusual naming convention.": {
            "Data": "Windows Event ID 4720, Windows Event ID 4728",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4720, 4728, 4732, 4756, 4764. Alert on the creation of new user accounts, especially those added to high-privilege groups. Use entropy measures on new account names to detect potentially algorithmically generated names."
          },
          "Consistent use of a domain account to log in or execute processes at unusual times or from unusual locations over an extended period.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify accounts exhibiting repeated successful logins (Event ID 4624) or process execution (Event ID 4688) during unusual hours or from unusual source IPs over multiple days/weeks (e.g., using time series analysis or correlation analysis of login patterns). Flag accounts showing consistent deviations from their established baseline behavior."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary elevated privileges using compromised domain accounts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.002 - Domain Accounts": {
          "A domain account accessing resources or performing actions outside its typical user/role scope.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for attempts to access sensitive objects/files. Filter these events by Account Name. Compare the resources accessed with the typical access patterns for that account's role/group using historical data (e.g., statistical comparison or anomaly detection based on access patterns)."
          },
          "Activity observed from highly privileged domain accounts (e.g., Domain Admins, Enterprise Admins) that is not part of scheduled maintenance or expected administrative tasks.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 (Logon Type 2, 10), 4688, and other relevant audit logs for activity by well-known high-privilege accounts (e.g., Administrator, service accounts, custom admin groups). Correlate activity timestamps with known maintenance windows or administrator schedules. Investigate activity outside these expected periods."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using compromised domain accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.002 - Domain Accounts": {
          "Domain account login or activity occurring while the user is not physically present at a corporate location and is not connected via authorized remote access (VPN, VDI, etc.).": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4624 (Logon Type 2, 10) and Zeek conn.log data for remote logins with physical access logs or authorized remote access logs (VPN, VDI). Flag logins where an account is active remotely or interactively on the network without a corresponding physical presence or authorized remote connection."
          },
          "Execution of unusual processes or use of unusual logon types under a standard user domain account.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) and Event ID 4624 (Logon Type) events. Filter by Account Name. Identify instances where standard user accounts are used for unusual logon types (e.g., Service logon - Type 5) or execute processes/commands not typically associated with their role using correlation analysis or frequency analysis of process execution per account."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]