[
  {
    "Has the adversary executed commands using software deployment tools? (TA0002 - Execution)": {
      "Indicators": {
        "T1072 - Software Deployment Tools": {
          "Unauthorized or unusual software deployment jobs detected on management tools (SCCM, Intune, etc.).": {
            "Data": "Software deployment tool logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor software deployment tool logs for new or unusual deployment jobs. Compare job initiation times, source accounts, and target systems against baseline deployment activity using time series analysis or descriptive statistics. Flag jobs initiated outside scheduled maintenance windows or by non-standard accounts."
          },
          "Execution of suspicious commands or scripts deployed via management tools.": {
            "Data": "Windows Event ID 4688, Zeek conn.log, Software deployment tool logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation logs (Event ID 4688, Sysmon ID 1) and analyze scripts or binaries executed on target systems via deployment tools. Look for suspicious command-line arguments or script content (e.g., base64 encoding, remote downloads). Correlate process execution with specific deployment jobs identified in deployment tool logs."
          }
        }
      }
    }
  },
  {
    "Has the adversary moved laterally using software deployment tools? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1072 - Software Deployment Tools": {
          "Network connections initiated by a software deployment tool to unexpected or unauthorized endpoints.": {
            "Data": "Zeek conn.log, Software deployment tool logs",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and software deployment tool logs. Identify network connections originating from systems targeted by recent deployments, especially if the destination is an unexpected internal host or an external IP. Map connections to deployment job targets and analyze using correlation analysis to identify unusual lateral movement patterns."
          },
          "Suspicious or unauthorized account logins to software deployment tool consoles or APIs.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4625, Software deployment tool logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect authentication logs for software deployment tools (Event ID 4624, 4625, tool audit logs). Monitor for login attempts using unauthorized accounts, logins from unusual source IPs or locations, or logins occurring outside typical administrator working hours. Use correlation analysis to link suspicious logins to subsequent deployment activity."
          }
        }
      }
    }
  }
]