```json
[
  {
    "Is the adversary attempting to evade defenses by removing network share connections? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.005 - Network Share Connection Removal": {
          "Execution of a process or script whose file hash matches a known malicious indicator associated with tools that perform network share connection removal.": {
            "Data": "Windows Event ID 1 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (e.g., Sysmon Event ID 1) for all executed processes. Compare the file hash (e.g., SHA256) of each process against a continuously updated CTI feed of known malicious file hashes. Prioritize alerts for any match, and specifically investigate if the matched process is a script or binary known to contain defense evasion or cleanup capabilities."
          },
          "Execution of built-in commands or PowerShell cmdlets explicitly designed to remove network share connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104 (PowerShell Script Block Logging)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for command-line execution (Windows Event ID 4688) of 'net.exe' or 'net1.exe' with arguments containing 'use' and '/delete'. Separately, monitor PowerShell script block logs (Windows Event ID 4104) for cmdlets like 'Remove-SmbMapping' or 'Remove-PSDrive'. Correlate these events with the parent process and user context; execution by non-standard users (e.g., web server accounts) or from non-interactive parent processes (e.g., wmiprvse.exe) is highly suspicious. Use frequency analysis to identify rare or anomalous executions."
          },
          "A correlated sequence of events where a network share is accessed, files are manipulated, and the share connection is removed within a short time frame.": {
            "Data": "Windows Event ID 5145; Windows Event ID 4688; Windows Event ID 4104; Zeek smb_files.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and monitor for a logical sequence of events occurring within a short time window (e.g., under 15 minutes) for a specific user/host: 1) Access to files/folders on a network share (Windows Event ID 5145 or Zeek smb_files.log), followed by 2) Execution of a share removal command (e.g., 'net use /delete' via Event ID 4688 or 'Remove-SmbMapping' via Event ID 4104). Use correlation analysis on user, source host, and timestamps to link these events. This sequence is a strong indicator of an adversary covering their tracks after performing an action."
          },
          "Anomalous and sudden cessation of SMB traffic from a client, or an abnormally short network share session, deviating significantly from established baselines and coinciding with other suspicious host activity.": {
            "Data": "Zeek conn.log; Zeek smb.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal SMB traffic patterns (e.g., data volume, connection duration, bytes in/out) for user-to-share connections using Zeek conn.log and smb.log. Use time series analysis or statistical process control to detect sudden, statistically significant drops in traffic that deviate from the baseline. Separately, analyze Windows Event ID 4624 (Logon Type 3) to calculate share session durations and use descriptive statistics (IQR, percentiles) to flag abnormally short sessions. Correlate these network or session anomalies with alerts from the source host (e.g., malware detection, suspicious process creation) to increase confidence that the termination is part of a malicious cleanup operation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```