[
  {
    "Is the adversary staging data prior to exfiltration? (TA0009 - Collection)": {
      "Indicators": {
        "T1074 - Data Staged": {
          "Appearance of unusual files (especially compressed/encrypted) in commonly used staging directories (temp, recycle bin) or publicly writeable locations.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving file archive utilities (7z, rar, zip) writing to common staging directories (e.g., C:\\Windows\\Temp, Recycle Bin). Use file system auditing (Windows Event ID 4663) to identify write operations of compressed/encrypted file types (e.g., .zip, .rar, .7z, .gz, .aes) to public/temp directories. Use frequency analysis on target directories to identify unusual write destinations."
          },
          "Processes executing commands or making API calls indicative of reading from multiple locations and writing to a central one, or using tools like 7zip/RAR/ZIP or system tools (PowerShell, WMI) for data handling.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs for command lines executing data copy/move operations (e.g., using 'copy', 'xcopy', 'robocopy', 'move', 'tar', 'gzip') that read from multiple source paths and write to a single destination path. Look for PowerShell/WMI commands ('Get-Content', 'Out-File', 'Copy-Item', 'Invoke-WmiMethod') involved in data manipulation or collection. Correlate process activity with file access logs (Windows Event ID 4663) to identify processes reading a high volume of data from sensitive locations and writing to a single less sensitive location. Use correlation analysis between process activity and file write events in staging directories."
          }
        }
      }
    }
  }
]