
[
  {
    "Is the adversary attempting to remove indicators of compromise? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1070 - Indicator Removal": {
          "Execution of known indicator removal tools identified by file hash or specific malicious command-line signatures.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and use a list of file hashes for known indicator removal utilities (e.g., SDelete, BCWipe, malware-specific wipers). Monitor Windows Event ID 4688 (Process Creation with Command Line Logging enabled) for processes matching these hashes. Additionally, use regular expressions to search command lines for highly specific argument patterns known to be used maliciously (e.g., `wevtutil cl Security`, `sdelete -accepteula -p 3 C:\\Users\\*`) and alert on any matches."
          },
          "Clearing of high-value Windows Event Logs (e.g., Security, System) detected via dedicated, high-fidelity event IDs.": {
            "Data": "Windows Event ID 1102; Windows Event ID 104",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a high-priority alert to trigger immediately upon the generation of Windows Event ID 1102 ('The audit log was cleared') in the Security log, or Event ID 104 ('The <log name> log file was cleared') in the System, Application, or other critical logs. These events are rare in legitimate administration and represent a strong pattern of defense evasion. Correlate the event with the user account and source host that performed the action."
          },
          "Use of built-in utilities with specific command parameters to delete forensic artifacts, such as Volume Shadow Copies or the USN Journal.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for the execution of `fsutil.exe` with parameters to delete the USN Journal (e.g., `fsutil usn deletejournal`) and `vssadmin.exe` with parameters to delete shadow copies (e.g., `vssadmin delete shadows /all`). These command patterns are highly indicative of an adversary attempting to erase traces of file system and file modification activity. Correlate their execution with administrative accounts, especially those recently created or associated with other suspicious behaviors."
          },
          "Anomalous file deletion activity, such as wiping entire directories or mass deletion of specific file types, deviating from baseline user or system behavior.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for high-frequency file deletion events (Windows Event ID 4663 - 'An attempt was made to access an object' with DELETE access) or process creation events (Windows Event ID 4688) for commands like `del /F /S /Q`, `cipher /w:`, or PowerShell's `Remove-Item -Recurse -Force`. Establish a baseline for normal file I/O operations in critical directories (e.g., system32, user profiles). Use time series analysis to detect unusual spikes in file deletion counts per host or user. Flag processes that delete an anomalously high number of files using descriptive statistics (e.g., counts exceeding 3 standard deviations from the mean)."
          },
          "Disabling or maliciously reconfiguring system audit policies or event logging services to suppress future event generation.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4719",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for changes to the system audit policy (Windows Event ID 4719 - 'System audit policy was changed'). Establish a baseline of the organization's required audit policy and alert on any change that reduces the level of auditing. Additionally, monitor process creation (Windows Event ID 4688) for the use of `auditpol.exe` or `wevtutil.exe` with parameters that modify logging configurations (e.g., `wevtutil sl <logname> /enabled:false`). Correlate these changes with the preceding user and process activity to identify the source of the evasion attempt."
          },
          "Modification of file timestamps (timestomping) to disguise the creation or modification time of malicious files and blend them with legitimate system files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "While direct detection of timestamp modification is difficult with default logging, monitor for the execution of tools or PowerShell commands that can perform this function (e.g., `(Get-Item <file>).CreationTime=`, `(Get-Item <file>).LastWriteTime=`, or execution of `touch.exe`). Correlate the execution of such commands with newly created executables or files associated with other suspicious activity. On a larger scale, use linear regression or correlation analysis to compare file creation/modification times within a directory; timestomped files may appear as significant outliers with timestamps inconsistent with surrounding files."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
