[
  {
    "Is the adversary attempting to evade defenses by clearing mailbox data? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.008 - Clear Mailbox Data": {
          "Execution of commands or APIs to delete email messages or mailbox contents.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving mail-related commands (e.g., 'mail', 'powershell * Remove-MailboxItem'). Identify processes executing commands associated with mail deletion. Calculate the frequency of these events per user and hostname. Identify users/hosts with statistically significant high frequencies compared to their historical baseline or peer groups (e.g., using standard deviation or z-score)."
          },
          "Execution of commands or APIs to remove mailbox export requests or manipulate mail application logs/metadata.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving commands related to mailbox export removal or log manipulation (e.g., 'powershell * Remove-MailboxExportRequest'). Analyze the frequency and timing of these commands. Use time series analysis to detect anomalous spikes in execution frequency or execution during unusual hours."
          },
          "Deletion of mail application data files (e.g., PST, OST files) or associated log files.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 events with 'Access Mask' indicating 'DELETE' (0x10000). Filter for target file paths matching known locations or extensions for mail data files (.pst, .ost, EDB files) or associated application log files. Identify users/processes responsible for these deletions. Use frequency analysis to identify anomalous deletion activity for specific users or file types compared to baseline."
          },
          "Anomalous mail protocol network traffic (SMTP, IMAP, POP3) from systems or users recently observed clearing mailbox data.": {
            "Data": "Zeek smtp.log; Zeek imap.log; Zeek pop3.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify systems/users where mailbox clearing commands (based on analysis of Windows Event ID 4688) were recently executed. Monitor Zeek smtp.log, imap.log, and pop3.log for network connections originating from these systems or attributed to these users shortly after the observed command execution. Analyze traffic patterns (e.g., destination IPs, volume of data transferred, number of emails sent) for anomalies (e.g., large volume of outbound mail from a server, connections to unusual external mail servers). Use correlation analysis to link process execution events with subsequent network connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]