```json
[
  {
    "Is the adversary attempting to evade defenses using file deletion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.004 - File Deletion": {
          "Deletion of a file whose hash matches a known malicious indicator from a threat intelligence feed or prior incident.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Requires object access auditing for file deletions (Windows Event ID 4663) and a system that can correlate deleted file paths with file hashes captured at creation/modification time (e.g., from EDR or advanced logging). Inner join the hash of the deleted file with a CTI feed of known malicious file hashes (updated daily). Alert on any match, as this indicates an adversary cleaning up known malicious tools or implants."
          },
          "Execution of built-in utilities or specific command-line patterns used to delete files, overwrite data, or clear logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for execution of deletion tools and commands. Create detection patterns for: 1) Secure deletion utilities like 'sdelete.exe'. 2) Data overwriting with 'cipher.exe /w:'. 3) Event log clearing with 'wevtutil.exe cl'. 4) Common file deletion commands like 'del' or 'rm' targeting sensitive directories (e.g., 'C:\\Windows\\Prefetch', user profile history) or file types ('*.log', '*.evtx'). Use correlation analysis to flag execution by anomalous parent processes (e.g., an Office application spawning 'cipher.exe')."
          },
          "A file is created, executed by a process, and then deleted within a very short time window, indicating the cleanup of a transient malicious payload.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) with subsequent file deletion events (Windows Event ID 4663, with appropriate object access auditing). Define a short time window for the sequence (e.g., < 5 minutes). Generate an alert when the executable path from a process creation event matches the object name in a near-simultaneous deletion event. Use linear regression to model normal process lifespan and flag outliers. Prioritize alerts where the parent process is suspicious (e.g., wscript.exe, powershell.exe, an Office application)."
          },
          "An anomalously high volume of file deletion events originating from a single process or user account, or the targeted deletion of forensic evidence.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a statistical baseline for normal file deletion activity per user and per host using Windows Event ID 4663. Monitor for significant spikes in deletion counts within a defined time window (e.g., 10 minutes). Use statistical methods like Inter-Quartile Range (IQR) or Z-scores on the volume of deletions to detect outliers. Analyze the file extensions of deleted files using frequency analysis; a sudden burst of deletions targeting '*.log', '*.evtx', '*.bak', or shell history files is highly suspicious and indicative of anti-forensic activity. Box-plots of deletion counts per user can visualize anomalies."
          },
          "Deletion of executable files that were recently downloaded from the internet or created by a process with established network connections.": {
            "Data": "Zeek http.log; Zeek files.log; Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network and host data. Identify files downloaded from the internet using Zeek http.log and files.log, noting the destination host and file path. On the host, correlate this information with file deletion events (Windows Event ID 4663). Also, monitor for processes with network connections (correlating Event ID 4688 with Zeek conn.log) that create files which are then quickly deleted. Use time series analysis to identify a short delay between file download/creation and deletion. Prioritize alerts for executable files downloaded from low-reputation domains/IPs that are subsequently deleted."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```