[
    {
        "information_requirement": "Has the adversary gained initial access using valid accounts?",
        "tactic_id": "TA0001",
        "tactic_name": "Initial Access",
        "indicators": [
            {
                "technique_id": "T1078",
                "name": "Valid Accounts",
                "evidence": [
                    {
                        "description": "Successful login attempt matching a known breached credential from a public or private data leak.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate usernames from successful and failed login events (Windows Event IDs 4624, 4625) against a curated list of known breached credentials relevant to the organization. If password hashes are logged (e.g., for NTLM), they can also be matched. A successful login (4624) using a known breached credential is a high-confidence indicator of compromise and requires immediate investigation of the session activity."
                    },
                    {
                        "description": "Password spraying pattern detected, characterized by a high volume of failed logins for multiple accounts with a limited set of passwords from a single or few source IPs.",
                        "data_sources": [
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for a high rate of failed logins (Windows Event ID 4625) originating from one or a few source IPs targeting many different user accounts within a short time window. Use correlation analysis to identify a one-to-many or few-to-many relationship between source IPs and distinct target accounts. A high ratio of distinct failed accounts to source IPs is a strong indicator of password spraying."
                    },
                    {
                        "description": "A valid account login exhibits multiple anomalous characteristics simultaneously, such as originating from a rare geographic location, using an unfamiliar device, and occurring outside of normal working hours.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each successful login (Windows Event ID 4624), enrich with geolocation data from the source IP (Zeek conn.log). Establish a multi-faceted baseline for each user account including typical login times, source countries/ISPs, and devices used. Use a scoring system where deviations from the baseline (e.g., rare country, login at 3 AM, new device) add to a risk score. A high cumulative risk score, identified using statistical models or descriptive statistics (e.g., multiple metrics exceeding 2 standard deviations from the norm), indicates a likely compromised account."
                    },
                    {
                        "description": "A valid account logs into a critical asset or a system it has never accessed before, especially if the access is inconsistent with the user's role.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a historical baseline of system access for each user account. For each new successful login (Windows Event ID 4624), perform a lookup to check if the user-system pair is novel. Analyze the novelty against the user's role and the criticality of the asset. Use frequency analysis and graph analytics to model user-to-asset access patterns and flag significant deviations, such as a user from marketing logging into a developer's server for the first time."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary maintaining persistence using valid accounts?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1078",
                "name": "Valid Accounts",
                "evidence": [
                    {
                        "description": "A successful login by a valid account originates from a source IP address known to be a malicious C2 server or part of an adversary's infrastructure.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join the source IP addresses from all successful remote login events (Windows Event ID 4624, Zeek conn.log) against a high-fidelity, continuously updated Cyber Threat Intelligence (CTI) feed of adversary infrastructure IPs. An alert on any match indicates a high probability of persistent access by a known threat."
                    },
                    {
                        "description": "A scheduled task or service is created or modified to run under a valid user account's context, containing a suspicious command line or connecting to an unusual external address.",
                        "data_sources": [
                            "Windows Event ID 4698",
                            "Windows Event ID 7045"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for scheduled task creation (Windows Event ID 4698) and service installation (Windows Event ID 7045) running under user accounts. Analyze the associated command-line arguments or binary paths for patterns indicative of malicious activity, such as encoded PowerShell commands, invocation of Living-off-the-Land Binaries (LoLBins) with suspicious parameters, or scripts that initiate network connections. Use regular expression matching against a library of known persistence patterns."
                    },
                    {
                        "description": "A valid account, especially a dormant or service account, exhibits a new, consistent pattern of login activity at regular intervals or unusual hours over an extended period.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify dormant accounts (e.g., no logins for >90 days) and monitor for any new successful logins (Windows Event ID 4624). For all accounts, use time-series analysis to model login frequency and timing. Flag accounts that develop a new, highly periodic login pattern (e.g., every 4 hours, every night at 2:05 AM), which is indicative of automated persistent access rather than human behavior. Analyze the entropy of inter-arrival times for logins; low entropy may suggest automation."
                    },
                    {
                        "description": "A valid account is used for repeated lateral movement, consistently originating from a non-administrative host to access multiple other systems.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4648"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Track remote logins (Windows Event ID 4624, Logon Type 3 or 10) and explicit credential use (Windows Event ID 4648) across the network. Build a graph of user login pathways. Identify user accounts that consistently initiate remote connections from the same non-standard source host (e.g., a user's workstation instead of a jump server) to multiple other destinations. A persistent 'hub-and-spoke' pattern from an unusual source is a strong indicator of a compromised account being used as a persistent pivot point."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Has the adversary achieved privilege escalation using valid accounts?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1078",
                "name": "Valid Accounts",
                "evidence": [
                    {
                        "description": "A known default, high-privilege service or application account is used for an interactive or remote login for the first time or from an unusual source.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a selector list of known default administrative accounts for hardware and software in the environment (e.g., vendor-specific defaults). Monitor for any interactive (Logon Type 2) or remote (Logon Type 3, 10) successful logins (Windows Event ID 4624) using these accounts. Alert on any such login, as these accounts should typically not be used for interactive sessions."
                    },
                    {
                        "description": "A valid non-administrative account is added to a privileged security group, followed by that account being used to log in.",
                        "data_sources": [
                            "Windows Event ID 4728",
                            "Windows Event ID 4732",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for member addition events to privileged groups (e.g., Domain Admins, Administrators) via Windows Event IDs 4728 (global group) and 4732 (local group). This is a known pattern of privilege escalation. Correlate this event with a subsequent successful login (Windows Event ID 4624) by the newly privileged account within a short timeframe (e.g., 1 hour). This sequence is a high-confidence alert."
                    },
                    {
                        "description": "A standard user account successfully logs into a series of systems or uses explicit credentials for services it does not typically access, following activity indicative of credential theft on its source machine.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4648",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a behavioral baseline of normal resource access for each user. Monitor for alerts related to credential dumping (e.g., access to LSASS process) on a user's machine. Following such an alert, track the associated user account for anomalous remote logins (Windows Event ID 4624) or explicit credential use (Windows Event ID 4648) to new systems or services. Use correlation analysis to link the potential credential theft event with the subsequent anomalous access, indicating the stolen credentials are being used to escalate privileges."
                    },
                    {
                        "description": "An unusual number of distinct user accounts log into a single non-standard host, such as a user endpoint, in a short period.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate successful login events (Windows Event ID 4624) by destination host. Profile the normal number of distinct users logging into different types of systems (e.g., servers vs. endpoints). Use descriptive statistics and outlier detection (e.g., IQR, Z-score) to flag any host, particularly a standard user workstation, that receives successful logins from an anomalously high number of distinct accounts in a short time. This may indicate the host is compromised and being used to harvest credentials from multiple users."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary evading defenses using valid accounts?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1078",
                "name": "Valid Accounts",
                "evidence": [
                    {
                        "description": "A process is executed under a valid user account context, and the process hash matches a known malicious file.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For every process creation event (Windows Event ID 4688), extract the process hash and the user account context under which it was executed. Join this data with a CTI feed of known malicious file hashes. An alert on a match indicates a valid account is being used to run a known malicious tool, a key defense evasion technique."
                    },
                    {
                        "description": "A valid account is used to execute a native OS binary (LoLBin) with command-line parameters or in a sequence matching known malicious usage patterns.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for execution of common LoLBins (e.g., `certutil.exe`, `bitsadmin.exe`, `rundll32.exe`, `mshta.exe`). Use a library of regular expressions to match the full command line against known malicious patterns (e.g., `certutil -urlcache -f`, `rundll32.exe javascript:...`, `mshta.exe http://...`). Flagging these specific patterns allows detection of malicious activity disguised as legitimate system administration."
                    },
                    {
                        "description": "Network traffic from a process running under a valid account exhibits statistical properties of C2 communication, such as high entropy or fixed beaconing intervals.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network sessions (Zeek conn.log) with the processes that initiated them (Windows Event ID 4688). For traffic associated with valid user accounts, perform behavioral analysis. Use time-series analysis on connection logs to detect periodic, fixed-interval connections (beaconing). Analyze the data volume per connection; small, regular transfers are suspicious. Calculate the entropy of payload data for suspicious flows; high entropy may indicate encrypted or packed C2 data disguised in common protocols."
                    },
                    {
                        "description": "A valid user account, especially a service account, is used for interactive login, bypassing its intended non-interactive use.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Categorize user accounts by type (e.g., user, admin, service). Monitor successful login events (Windows Event ID 4624) and specifically look for accounts designated as 'service accounts' performing an interactive login (Logon Type 2) or remote interactive login (Logon Type 10). This behavior is highly anomalous and indicates an adversary is using a typically non-interactive, often high-privilege account to evade detection and operate directly on a system."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
