[
  {
    "Is the adversary attempting to evade detection by clearing network history? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1070.007 - Clear Network Connection History and Configurations": {
          "Deletion or modification of network connection history files or registry keys (e.g., RDP client history, specific log files).": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657; Zeek fileinfo.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for deletion events targeting known RDP history files (.rdp, cache files) or common log file locations (`/var/log/` or `/Library/Logs` on Unix/Linux/macOS if available via endpoint agent logs). Monitor Windows Event ID 4657 for modifications to RDP registry keys (HKCU\\Software\\Microsoft\\Terminal Server Client). Analyze Zeek fileinfo.log for deletion events on relevant paths if logs are being transferred and monitored by Zeek. Look for patterns or frequency anomalies in deletion/modification events."
          },
          "Unexpected changes to network configurations (e.g., firewall rules, proxy settings).": {
            "Data": "Windows Event ID 4719; Windows Event ID 5025; Windows Event ID 5027; Windows Event ID 5031; Zeek notice.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4719 for changes to system audit policy (which could mask subsequent clearing). Monitor Windows Event ID 5025, 5027, 5031 for changes to Windows Firewall rules or service state. Correlate configuration changes with unexpected network behavior observed in Zeek logs (notice.log for policy violations, proxy events if available). Identify changes not associated with standard administrative activity. Use time series analysis to spot unexpected spikes or deviations from the baseline in configuration change events."
          },
          "Execution of suspicious commands or processes known to clear logs, delete history files, or modify relevant registry keys.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing specific command-line arguments or program names associated with clearing logs (`wevtutil cl`, `Clear-EventLog`), deleting files (`del /f /q`, `Remove-Item -Path -Force`) on known history/log paths (`C:\\Users\\*\\Documents\\*.rdp`, `C:\\Users\\*\\AppData\\Local\\Microsoft\\Terminal Server Client\\Cache\\*`), or modifying registry (`reg delete`, `Remove-Item Property`) related to RDP history (`HKCU\\Software\\Microsoft\\Terminal Server Client`). Use frequency analysis to identify accounts or hosts with anomalous occurrences of these commands. Create watchlists for specific sensitive file paths and registry keys mentioned in the technique description and alert on processes attempting to modify or delete them via command line utilities."
          },
          "Audited deletion or modification events targeting network connection history files or registry keys from suspicious sources or in suspicious patterns.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for deletion events targeting files in paths like `C:\\Users\\*\\Documents\\*.rdp` or `C:\\Users\\*\\AppData\\Local\\Microsoft\\Terminal Server Client\\Cache\\*`. Monitor Windows Event ID 4657 for registry modifications to `HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Default` and `HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Servers`. Correlate these events with the user account and process (if available in event data or via correlated 4688 events) performing the action. Use correlation analysis to identify sequences of events (e.g., deletion shortly after RDP logon/activity identified by Windows Event ID 4624 Logon Type 10). Use frequency analysis to identify accounts or hosts performing these actions unusually often or outside of approved maintenance windows."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]