[
  {
    "Has the adversary gained initial access to the network via compromised cloud accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Successful or failed login attempts to cloud accounts from unusual geographic locations or IP addresses, or outside of normal business hours.": {
            "Data": "Cloud Access/Audit Logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud access logs for login events. Geolocate source IPs. Compare source IPs and geographic locations against allowed lists, corporate VPNs, or known user activity patterns. Identify statistically rare locations/IPs or logins occurring outside of established business hours using descriptive statistics or time series analysis."
          },
          "Initial access to cloud resources or services via a compromised cloud account that are not typically accessed by that user/service principal.": {
            "Data": "Cloud Access/Audit Logs; Cloud Resource Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud resource access logs. Identify resource types and services accessed by compromised accounts. Use correlation analysis to compare accessed resources against baseline activity for the account/user. Flag access to sensitive or unusual resources based on deviation from established baselines."
          },
          "Successful logons to on-premises resources (e.g., servers via RDP/SMB, endpoints via WinRM) using credentials associated with a compromised cloud account.": {
            "Data": "Windows Event ID 4624; Zeek conn.log; Cloud Access/Audit Logs",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (successful logon) on on-premises systems. Correlate logon events with known compromised cloud accounts based on recent cloud audit logs. Analyze logon type (e.g., Type 3 for network, Type 10 for RDP) and source IP/hostname. Use correlation analysis to link logins from compromised cloud accounts to unusual on-premises activity, potentially using statistical analysis on logon frequencies or timings."
          },
          "Network connections originating from internal endpoints or servers to cloud service endpoints using protocols or patterns associated with cloud access (e.g., HTTPS to Azure/AWS/GCP API endpoints) by potentially compromised accounts.": {
            "Data": "Zeek conn.log; Cloud Access/Audit Logs",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections from internal IPs to known cloud service provider IPs or domains on standard cloud API ports (e.g., 443). Correlate these connections with activity in cloud access logs for specific accounts. Use frequency analysis and anomaly detection (e.g., z-score or percentile analysis) on connection volume, destination endpoints, and timing per internal host/user to identify initial unexpected connections to cloud infrastructure."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using compromised cloud accounts or credentials? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Creation of new, long-lasting cloud credentials (API keys, access keys, tokens) associated with a compromised cloud account.": {
            "Data": "Cloud Access/Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for events indicating the creation or modification of access keys, API keys, or secret keys. Correlate these events with prior suspicious activity on the account. Alert on new credentials, especially those set with long expiration times or without expiration."
          },
          "Repeated access to cloud resources or services over extended periods using a compromised account, exhibiting consistent access patterns inconsistent with normal behavior.": {
            "Data": "Cloud Access/Audit Logs; Cloud Resource Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud access logs for login frequency and duration for potentially compromised accounts over time. Identify consistent access patterns at unusual times or from unusual locations using time series analysis. Correlate with resource access patterns to identify persistent data exfiltration or configuration changes."
          },
          "Recurring successful logons to on-premises resources using credentials associated with a compromised cloud account, especially at unusual times or from unexpected source systems.": {
            "Data": "Windows Event ID 4624; Zeek conn.log; Cloud Access/Audit Logs",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor and baseline recurring Windows Event ID 4624 logons on on-premises systems by user/account, source IP, and time. Identify patterns of recurring logons using credentials associated with compromised cloud accounts (from cloud logs), particularly if they occur outside of normal working hours or from unusual internal/external source systems. Use time series analysis or frequency analysis over time to detect consistent, persistent access patterns."
          },
          "Persistent, non-interactive access or command execution within cloud resources (e.g., VMs, containers) attributed to a compromised account or its associated identity (like Managed Identity).": {
            "Data": "Cloud Resource Logs; Cloud Access/Audit Logs; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud resource logs (e.g., logs from VMs using Managed Identities or service principals) for continuous or recurring command execution, process creation, or access attempts that indicate non-interactive activity. Correlate with cloud audit logs to attribute activity to specific compromised accounts or identities. If hybrid, monitor Windows Event ID 4688 on cloud VMs for processes launched by potentially compromised identities/accounts. Use time series analysis to identify persistent background activity patterns inconsistent with normal operations or baseline behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary escalated privileges using compromised cloud accounts or misconfigurations? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Attempts or successful assumption of elevated cloud roles (e.g., IAM roles, Azure AD roles) by a compromised cloud account.": {
            "Data": "Cloud Access/Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for events related to identity and access management, specifically role assumption, role assignments, and policy modifications. Identify compromised accounts attempting or succeeding in assuming roles with elevated privileges using correlation analysis against account login anomalies. Baseline normal role assumption behavior and flag deviations."
          },
          "Usage of stolen application access tokens or managed identity credentials by a compromised resource or account to access other cloud resources.": {
            "Data": "Cloud Access/Audit Logs; Cloud Resource Logs; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for token usage events. Analyze Zeek conn.log and Windows Event ID 4624 (Logon Type 9 - NewCredentials logon) on hybrid endpoints for activity originating from compromised accounts using non-standard authentication methods (e.g., access tokens). Correlate token usage with resource access patterns to detect lateral movement or privilege use."
          },
          "Events on on-premises systems indicating account creation, credential modification, or policy changes initiated remotely by a compromised cloud account with elevated privileges.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4724; Windows Event ID 4738; Windows Event ID 4732; Windows Event ID 4733; Windows Event ID 4756; Windows Event ID 4757; Cloud Access/Audit Logs",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to user/group management (4720, 4724, 4738, 4732, 4733, 4756, 4757) and policy changes on on-premises systems. Correlate these events with activity from compromised cloud accounts identified in cloud audit logs that have potentially gained elevated privileges. Identify instances where an account with elevated cloud privileges initiates changes on-premises that are inconsistent with normal administrative procedures using baseline analysis."
          },
          "Access attempts or successful access by a compromised cloud account to sensitive cloud services (e.g., Key Vaults, Secrets Managers, credential stores) or sensitive data storage locations the account wouldn't normally access.": {
            "Data": "Cloud Access/Audit Logs; Cloud Resource Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for access attempts to sensitive services like Azure Key Vault, AWS Secrets Manager, GCP Secret Manager, etc. Identify access events initiated by compromised cloud accounts. Use correlation analysis to determine if these access attempts occurred after the account gained elevated privileges or attempted to assume a new role. Baseline normal access patterns to these sensitive services by account/role and flag access from unusual accounts or patterns using deviation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using compromised cloud accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.004 - Cloud Accounts": {
          "Successful authentication using compromised cloud account credentials without MFA when MFA is normally required (e.g., using stolen session cookies, revoked credentials).": {
            "Data": "Cloud Access/Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud authentication logs to identify successful logins where MFA status is indicated as bypassed or not enforced. Correlate these events with login source (IP, geo-location) and time to identify potential MFA bypass attempts using stolen credentials or session artifacts."
          },
          "Execution of commands or actions on hybrid-joined endpoints using compromised cloud accounts via SaaS deployment tools, bypassing endpoint defenses.": {
            "Data": "Cloud Access/Audit Logs; Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on hybrid-joined endpoints for processes launched by compromised cloud accounts via deployment tools. Analyze command lines for suspicious activity. Use correlation analysis to link endpoint process creation events with cloud audit logs indicating deployment tool usage. Also, monitor Windows Event ID 4624 (Logon Type 9) associated with these tools/accounts."
          },
          "Modification or deletion of cloud security configurations, network security groups, firewall rules, logging settings, or monitoring agents using a compromised cloud account.": {
            "Data": "Cloud Access/Audit Logs; Cloud Resource Logs",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for events related to security configuration changes (e.g., modifying NSGs, security groups, firewall rules, changing logging destinations, disabling security services/agents). Identify changes initiated by compromised cloud accounts. Baseline authorized changes and flag unauthorized or suspicious modifications using change analysis over time."
          },
          "Execution of commands or processes on hybrid-joined systems via a compromised cloud account that are designed to disable or modify endpoint security software (e.g., EDR agents, AV).": {
            "Data": "Cloud Access/Audit Logs; Windows Event ID 4688; Windows Event ID 1102; Windows Event ID 5136",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for usage of cloud deployment tools or remote execution features by compromised cloud accounts. Correlate these events with Windows Event ID 4688 on target endpoints/servers, looking for suspicious command-line arguments related to security software manipulation (stopping services, deleting files, registry changes). Also look for Event ID 1102 (security log cleared) or GPO modification events (5136) potentially triggered by cloud-initiated actions from a compromised account using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]