```json
[
  {
    "Has the adversary gained initial access using default accounts? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "Successful authentication to an external-facing service using a known default username/password pair from a published list.": {
            "Data": "Windows Event ID 4624; Zeek conn.log; Application/Appliance Authentication Logs",
            "Data Platform": "Servers, Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of known default credential pairs for operating systems, network devices, and applications. Ingest and scan all available authentication logs (e.g., Windows Event ID 4624, appliance logs, application logs) for successful logins matching this list. Correlate with Zeek conn.log to identify the external source IP and investigate all associated activity for signs of compromise."
          },
          "Use of User-Agent strings, HTTP request patterns, or other network artifacts associated with automated tools scanning for or exploiting default credentials.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for User-Agent strings associated with common vulnerability scanners or brute-force tools (e.g., Nmap NSE, Metasploit modules, Hydra). Create rules to detect patterns of rapid, sequential login attempts to web authentication portals from a single source IP. Analyze Zeek conn.log for connections to multiple hosts on the same service port (e.g., 22, 23, 3389) from a single external IP in a short timeframe, which is indicative of scanning for default credentials."
          },
          "A built-in default account (e.g., Administrator, Guest, root) logs in successfully for the first time on a given system, especially from an external source IP address.": {
            "Data": "Windows Event ID 4624; Application/Appliance Authentication Logs",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of all accounts that have successfully logged into each system. Monitor Windows Event ID 4624 and other authentication logs for successful logins by known default account names. Use historical analysis to identify and alert on any login from a default account that has never been seen on that specific host or service before. Prioritize alerts where the login source is external or from a non-standard internal subnet."
          },
          "A high volume of failed login attempts from one or more external sources targeting a small set of default account names across many systems, indicative of password spraying.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4625 (logon failure) events across the enterprise. Correlate these events by target username. Use descriptive statistics to identify default account names (e.g., 'admin', 'administrator', 'guest') that have a high count of failed logins from numerous distinct source IPs and hostnames within a short time window (e.g., 30 minutes). Use correlation analysis with Zeek conn.log to trace the source of the network attempts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary maintaining persistence using default accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "A process run by a default account establishes a network connection to a destination IP or domain present on a CTI feed of known Command and Control (C2) servers.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate processes run by default accounts (Windows Event ID 4688 linked to a login session from Event ID 4624) with their subsequent network connections (Zeek conn.log). Inner join the destination IP addresses from these connections with a high-confidence threat intelligence feed of known C2 servers, updated daily. Alert on any matches as high-fidelity indicators of compromise."
          },
          "A default account creates or modifies a scheduled task, service, or registry run key to execute a program on a recurring basis or at system startup.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 7045",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the creation or modification of persistence mechanisms, focusing on events where the subject/creator is a known default account. Specifically track Windows Event ID 4698 (Scheduled Task Created), 4702 (Scheduled Task Updated), and 7045 (Service Installed). Analyze the associated command line or executable path for suspicious scripts or binaries. Use frequency analysis to identify tasks or services created by default accounts, as this should be a rare event in a managed environment."
          },
          "A default account, especially a service or application account, initiates interactive processes (e.g., powershell.exe, cmd.exe) or makes outbound network connections inconsistent with its established baseline activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile the typical process activity (Windows Event ID 4688) and network behavior (Zeek conn.log) for critical default and service accounts. Establish a baseline of normal parent/child process relationships and typical network destinations. Alert on deviations, such as a default web service account spawning 'powershell.exe' or connecting to an unknown external IP. Use entropy measures on process names or destination ports over time to detect an increase in abnormal activity for a given account."
          },
          "Repeated, successful logins by a previously dormant or disabled default account, particularly outside of normal business hours or from unusual source IP addresses.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4722; Windows Event ID 4725",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for events indicating a default account was enabled (Event ID 4722) or taken out of a disabled state (Event ID 4725). Correlate these events with subsequent successful logins (Event ID 4624) by that account. Use time series analysis on the login history of all default accounts to identify accounts that were dormant for an extended period (e.g., >90 days) and suddenly become active. Prioritize alerts for such activity, especially if logins occur at anomalous times or from new geolocations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary escalated privileges using default accounts? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "A default account executes a command containing specific strings or arguments known to be associated with a particular privilege escalation exploit or credential theft tool.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan the command line field within Windows Event ID 4688 for process creations attributed to default accounts. Match the command line against a list of high-confidence strings and arguments associated with credential dumping (e.g., 'sekurlsa::logonpasswords', 'lsadump::sam') or specific privilege escalation exploits. These matches serve as high-fidelity selector-based alerts."
          },
          "A default account adds itself or another user to a high-privilege local or domain group such as Administrators, Domain Admins, or Enterprise Admins.": {
            "Data": "Windows Event ID 4732; Windows Event ID 4728; Windows Event ID 4756",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows security event logs for group membership changes, specifically Event IDs 4732 (member added to local group), 4728 (member added to global group), and 4756 (member added to universal group). Alert on any instance where the 'Subject' (the account performing the action) is a default account and the target group is a privileged group. This activity should be extremely rare and is a strong pattern of privilege escalation."
          },
          "A default account, which has no history of administrative activity, performs a privileged action for the first time, such as creating a new user or installing a service.": {
            "Data": "Windows Event ID 4720; Windows Event ID 7045",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a historical baseline of all administrative actions (e.g., user creation via Event ID 4720, service installation via Event ID 7045) performed by each default account. Use historical analysis to identify the first time a specific default account performs a privileged action. Alert on this 'first-time' behavior, as it represents a significant deviation from the account's established role and indicates a potential misuse for privilege escalation."
          },
          "A user authenticates with a low-privilege account and then shortly after, a process is spawned under the context of a high-privilege default account on the same host.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate login events (Event ID 4624) with process creation events (Event ID 4688) on a per-host basis. Search for a behavioral sequence where a non-privileged user logon is followed within a short time window (e.g., < 5 minutes) by a process executing as a high-privilege default account (e.g., SYSTEM, local Administrator). This pattern may indicate the use of an exploit to escalate from the user's session to a privileged default account."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using default accounts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1078.001 - Default Accounts": {
          "A default account executes a command containing a specific signature for disabling security services, modifying audit policies, or clearing audit logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create high-fidelity alerts by scanning the command line field in Windows Event ID 4688 for processes created by default accounts. Match against a list of known defense evasion commands, such as 'wevtutil.exe cl', 'auditpol /clear', 'Set-MpPreference -DisableRealtimeMonitoring $true', or commands that stop security services ('net stop windefend'). These selectors provide direct evidence of defense evasion attempts."
          },
          "A default account modifies system audit policies, firewall rules, or security software configurations via known processes and command-line patterns.": {
            "Data": "Windows Event ID 4719; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for Windows Event ID 4719 (System audit policy was changed) where the subject is a default account. Additionally, monitor process creations (Event ID 4688) by default accounts for known policy-modification tools like 'auditpol.exe', 'netsh.exe advfirewall', or PowerShell cmdlets that alter security configurations. This pattern of a default account reconfiguring security controls is highly suspicious."
          },
          "A default account is used to access, modify, or exfiltrate security logs or security tool configuration files from disk.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable object access auditing on critical log directories (e.g., C:\\Windows\\System32\\winevt\\Logs) and security tool configuration files. Monitor for Windows Event ID 4663 (An attempt was made to access an object) where the subject is a default account and the object is a sensitive log or configuration file. Correlate with process execution (Event ID 4688) to identify processes like 'tar.exe', '7z.exe', or 'xcopy.exe' used by default accounts to stage or exfiltrate these files."
          },
          "Network traffic from a default account session bypasses established network security controls, such as connecting directly to the internet instead of through a required web proxy.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network traffic from hosts where default accounts are logged in (identified via endpoint logs) with proxy logs. Identify any direct-to-internet connections in Zeek conn.log from these hosts that do not have a corresponding entry in the proxy logs for the same timeframe and destination. Use correlation analysis to find these bypassed connections. This behavioral analysis is effective for detecting policy violations that could be used to evade network monitoring."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```