
[
  {
    "Is the adversary attempting to evade defenses by clearing mailbox data? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1070.008 - Clear Mailbox Data": {
          "Execution of a command-line exactly matching a signature from a known malicious tool or script used for mailbox clearing.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of highly specific, full command-line strings known to be used by malicious actors or tools for clearing mailbox data (e.g., specific combinations of switches and parameters found in threat intelligence reporting). Use exact string matching against the command-line field in Windows Event ID 4688 process creation events. Alert on any exact match, as this represents a high-confidence indicator of malicious activity requiring immediate investigation."
          },
          "Execution of PowerShell cmdlets or other command-line utilities used for deleting mailbox items, removing export requests, or manipulating mail rules.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the command line includes suspicious patterns like 'Remove-MailboxItem', 'Remove-MailboxExportRequest', 'Search-Mailbox -DeleteContent', or manipulation of mail rules via cmdlets like 'Set-InboxRule -Delete'. Use regular expression matching to identify variations. Correlate these actions with the executing user account and source host, flagging executions by non-administrative users or on non-mail-server systems."
          },
          "Deletion of mail application data files or associated log files identified by path and extension.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (An attempt was made to access an object) events where the 'Accesses' field includes 'DELETE' (0x10000). Filter for events where the 'Object Name' (file path) matches known locations or extensions for mail data files (e.g., *.pst, *.ost, *.edb) or associated application log files. Flag any such deletion events, especially when performed by unexpected processes or user accounts."
          },
          "A high frequency of mail deletion command executions or file access deletions by a single user or process within a short time frame, suggesting large-scale data clearing.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate mail clearing events (identified by PowerShell cmdlets in Event ID 4688 or file deletions in Event ID 4663) by user and hostname. Establish a baseline for the normal frequency of such events per user. Use time series analysis or simple thresholding (e.g., >N deletion commands in M minutes) to detect a statistically significant spike in activity. A box-plot of daily deletion events per user can visually identify outlier days with anomalous activity."
          },
          "Mailbox clearing activity observed in close temporal proximity to other indicators of compromise, such as data exfiltration, credential access, or execution of other defense evasion techniques.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the timestamp of mailbox clearing events (identified via Event ID 4688 or 4663) with other security alerts or suspicious logs within a defined time window (e.g., +/- 1 hour). Specifically look for correlations with: large data transfers to external IPs (Zeek conn.log), alerts for credential dumping, or execution of other indicator removal tools (e.g., clearing event logs). Use correlation analysis to assign a higher risk score to mailbox clearing that is part of a larger chain of suspicious behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
