[
  {
    "Is the adversary staging data prior to exfiltration? (TA0009 - Collection)": {
      "Indicators": {
        "T1074 - Data Staged": {
          "Appearance of unusual files (especially compressed/encrypted) in commonly used staging directories (temp, recycle bin) or publicly writeable locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving file archive utilities (7z, rar, zip, tar, gzip) writing to common staging directories (e.g., C:\\Windows\\Temp, Recycle Bin). Use file system auditing (Windows Event ID 4663, Object Type: File, Access Mask includes FILE_WRITE_DATA) to identify write operations of compressed/encrypted file types (e.g., .zip, .rar, .7z, .gz, .aes) to public/temp directories. Use frequency analysis on target directories to identify unusual write destinations or high volume of suspicious file types."
          },
          "Processes executing commands or making API calls indicative of reading from multiple locations and writing to a central one, or using tools like 7zip/RAR/ZIP or system tools (PowerShell, WMI) for data handling.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs for command lines executing data copy/move operations (e.g., using 'copy', 'xcopy', 'robocopy', 'move') that read from multiple source paths and write to a single destination path. Look for PowerShell/WMI commands ('Get-Content', 'Out-File', 'Copy-Item', 'Invoke-WmiMethod') involved in data manipulation or collection. Correlate process activity from 4688 (using Process ID) with file access logs (Windows Event ID 4663) to identify processes reading a high volume of data (use count of read events from multiple locations) from sensitive locations and writing to a single less sensitive location. Use correlation analysis between process activity and aggregated file write events in staging directories."
          },
          "Large internal data transfers from potential victim hosts to other internal systems or cloud instances, potentially preceding external connections from the destination.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for internal connections (src_ip=internal, dst_ip=internal/cloud IP range) with large total bytes transferred (e.g., sum(orig_bytes + resp_bytes) > threshold per session or aggregate over short time). Identify source hosts exhibiting high data transfer volume to a specific internal destination IP. Correlate source/destination IP pairs involved in large internal transfers with subsequent external connections (dst_ip=external) originating from the destination IP within a defined time window. Use descriptive statistics (total bytes transferred per flow, total per host) and correlation analysis."
          },
          "Spike in file write activity in temporary or unusual directories on a host, correlated with a specific process.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Type: File, Access Mask includes FILE_WRITE_DATA) for write operations within common staging directories (e.g., %TEMP%, Recycle Bin) or identify write operations to newly created subdirectories on hosts. Analyze the rate of write events per process and directory using time series analysis or rate-limiting thresholds (e.g., count writes in 1-minute intervals) to detect sudden spikes significantly above the baseline. Correlate spikes in file write activity with the associated process identified in Event 4663 (SubjectProcessId/Image). Analyze command line (Event ID 4688) of the writing process for suspicious indicators."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]