[
  {
    "Is the adversary using application layer protocols for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1071 - Application Layer Protocol": {
          "Network connections exhibiting highly asymmetric data flow (e.g., large client-to-server data volume for protocols typically receiving data).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log. For common application protocols (HTTP, DNS, SMB), calculate the ratio of orig_bytes to resp_bytes. Identify connections with extreme ratios deviating significantly from the norm (e.g., using IQR or percentile analysis on the byte ratio distribution per protocol) to flag unusual data flows."
          },
          "Network traffic using standard application protocols (HTTP, DNS, SMB, etc.) but with unusual structure or content, or connections to ports/services typically not used by specific processes.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log; Zeek smb.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, http.log, dns.log, smb.log, etc.). For connections using common application layer ports, investigate traffic exhibiting anomalous protocol behavior (e.g., non-standard HTTP methods, unusual DNS query types/sizes, SMB traffic from unexpected processes). Correlate Zeek connections with Windows Event ID 4688 (Process Creation) to identify processes initiating suspicious network connections that normally wouldn't communicate over the network or use that specific protocol."
          },
          "Network connections to external or unusual destinations initiated by processes not typically expected to make network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) from endpoints/servers, and Zeek conn.log from network devices. Correlate process names (from 4688) with network connections (from 5156 and conn.log). Maintain a baseline of processes that typically make network connections. Flag connections originating from processes with no prior network activity or processes known not to typically connect to the network, especially if connecting to external or unusual internal destinations. Use frequency analysis on process names and destinations to identify rare occurrences."
          },
          "Application layer log anomalies (e.g., unusual HTTP user agents, excessive DNS queries for suspicious domains, non-standard SMB commands) within network traffic using standard protocols.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek smb.log; Zeek notice.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek protocol-specific logs (http.log, dns.log, smb.log, etc.) for anomalies. For HTTP, identify unusual or frequently changing User-Agent strings, uncommon request methods for common paths, or excessive requests from a single client. For DNS, detect high volumes of queries for domains with high domain generation algorithm (DGA) characteristics or newly registered domains using statistical entropy analysis on domain names. For SMB, look for unusual commands or activity patterns. Monitor Zeek notice.log for built-in protocol violations or suspicious activity alerts. Use frequency analysis or behavioral baselining to identify outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]