
[
  {
    "Is the adversary attempting to discover valid accounts? (TA0007 - Discovery)": {
      "Indicators": {
        "T1087 - Account Discovery": {
          "Execution of processes matching file hashes or names of known account discovery tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate process hashes from Windows Event ID 4688 (Process Creation) against a threat intelligence feed or internal list of known malicious file hashes for account discovery tools (e.g., AdFind, BloodHound ingestors, SharpHound, PowerSploit modules). Alert on any hash matches. Additionally, monitor for process names (e.g., `BloodHound.exe`, `AdFind.exe`) while acknowledging that names are easily changed."
          },
          "Execution of specific command-line patterns associated with built-in utilities (net.exe, dsquery.exe, PowerShell) used for local or domain account enumeration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Using regular expressions, monitor the `CommandLine` field in Windows Event ID 4688 for patterns indicative of account enumeration. Examples include `net user`, `net group /domain`, `net localgroup`, `dsquery user`, and PowerShell cmdlets such as `Get-ADUser`, `Get-ADGroupMember`, `Get-LocalUser`. Raise alert severity when these commands are executed by non-administrative users or spawned from unexpected parent processes (e.g., web servers, Office applications)."
          },
          "An anomalous process chain where a non-administrative or unexpected parent process (e.g., a web server process, Office application) spawns command-line interpreters or tools to perform account discovery.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) to construct and baseline normal process parent-child relationships for key servers and endpoint groups. Use correlation analysis to detect and alert on anomalous chains, such as `w3wp.exe` -> `cmd.exe` -> `net.exe` or `OUTLOOK.EXE` -> `powershell.exe`. Identify these chains when the child process command line contains enumeration patterns, providing high-fidelity evidence of behavior-based discovery."
          },
          "An unusual volume or pattern of network queries from a single source to directory services (e.g., LDAP, Active Directory Kerberos) inconsistent with the source's normal role or function.": {
            "Data": "Zeek conn.log; Zeek ldap.log; Zeek kerberos.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs for traffic to directory service ports (e.g., LDAP 389/636, Kerberos 88). For each source host, establish a baseline of normal query volume and types. Use statistical methods (e.g., Z-score, Inter-Quartile Range) to detect hosts generating an anomalous number of queries in a given time window. Analyze `Zeek ldap.log` for a high diversity of search filters or a large number of returned entries from a single source, which indicates bulk enumeration. Use time series analysis to detect sudden changes in query behavior from any given host."
          },
          "An unusual process or user account attempting to access multiple sensitive files or directories that may contain account information, or any access to canary files (honey files).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor object access auditing (Windows Event ID 4663) on sensitive file shares and directories known to contain user lists, configuration details, or scripts. Deploy canary files (e.g., `All_User_Passwords.xlsx`) and alert on any access attempt. For legitimate files, baseline normal access patterns (who, what process, when). Use frequency analysis to flag any single user or process accessing an abnormally high number of these sensitive files in a short period, especially if the access attempts are from an unexpected process (e.g., `svchost.exe`, `rundll32.exe`)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
