[
  {
    "Is the adversary attempting to discover valid accounts? (TA0007 - Discovery)": {
      "Indicators": {
        "T1087 - Account Discovery": {
          "Execution of common command-line tools for account enumeration (e.g., `net user`, `net localgroup`).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Filter for `CommandLine` field containing `net user`, `net localgroup`, etc. Flag executions of these commands, particularly from non-standard user accounts or in unusual contexts. Use descriptive statistics to identify users/processes with abnormally high frequencies of these commands."
          },
          "Rapid execution of multiple account discovery commands or use of less common methods like PowerShell/WMI for enumeration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Identify sequences of account enumeration commands (e.g., multiple `net user` calls or a mix of commands) occurring within a short time frame using time series analysis or simple delta calculations between timestamps. Look for command lines indicating PowerShell or WMI calls attempting account enumeration."
          },
          "Accessing or searching sensitive files containing potential account lists or email addresses (e.g., spreadsheets, configuration files).": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 and 4656 on endpoints and servers for access attempts on files with names or paths suggestive of storing user account lists, credentials, or sensitive contact information (e.g., files containing 'users', 'accounts', 'passwords', '.csv', '.xlsx' in potentially sensitive directories). Flag access attempts by unusual processes or user accounts. Use frequency analysis or deviation from baseline to identify anomalous access patterns by user or host."
          },
          "Network connections or API calls targeting internal services or cloud provider APIs commonly used for account enumeration, especially from suspicious hosts.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and http.log for connections originating from potentially compromised internal hosts (e.g., hosts with other security alerts) targeting internal services (e.g., LDAP/Active Directory ports 389/636, SMB port 445) or known cloud provider API endpoints used for listing users (e.g., AWS IAM API, Azure AD Graph API, Google Cloud IAM API). Identify connections involving HTTP requests with paths or parameters indicative of user enumeration API calls. Use correlation analysis to link these connections to other internal reconnaissance activities."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]