[
    {
        "information_requirement": "Has the adversary moved laterally by tainting shared content?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1080",
                "name": "Taint Shared Content",
                "evidence": [
                    {
                        "description": "Detection of files on network shares with file hashes or names matching known malware or malicious tools used for lateral movement.",
                        "data_sources": [
                            "Zeek file.log",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Upon file write events to network shares (monitored via Windows Event ID 4663 or Zeek file.log), automatically calculate file hashes (e.g., SHA256). Inner join these hashes against a high-confidence, continuously updated threat intelligence feed of known malicious file hashes. Additionally, scan filenames against a curated list of known malicious tool names (e.g., names of known webshells, droppers, or implants). Alert on any matches and quarantine the file pending investigation."
                    },
                    {
                        "description": "Creation or modification of files on network shares that match known malicious patterns, such as LNK files with embedded commands, files with double extensions, or scripts with obfuscated payloads.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Zeek file.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor file write events (Windows Event ID 4663, Zeek file.log) on network shares. Parse LNK files for embedded command-line arguments or unusual target paths (e.g., pointing to `cmd.exe`, `powershell.exe`, or a location on C$). Use regular expressions to detect files with double extensions (e.g., `invoice.pdf.exe`). Analyze script files (.ps1, .vbs) for high entropy scores indicative of obfuscation. Correlate the creation of these patterned files with the source process (Windows Event ID 4688) and user for further context."
                    },
                    {
                        "description": "Anomalous file modification activity on network shares, characterized by unusual source processes, a high volume of writes, or modifications that significantly alter file entropy or size.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688",
                            "Windows Event ID 5140"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal file write activity (processes, users, hosts, volume, file types) for critical network shares using historical logs. Monitor file write events (Windows Event ID 4663) and the responsible processes (Windows Event ID 4688). Use statistical methods like Z-scores or Inter-Quartile Range (IQR) analysis on write volumes per user/host to detect outliers. For common document types, monitor for significant increases in file entropy or size changes that suggest embedded content. Correlate with share access logs (Windows Event ID 5140) to identify the source host of the anomalous activity."
                    },
                    {
                        "description": "Execution of a process from a network share, especially if the process is not typically run from a remote location or is initiated by a different user shortly after the file was modified.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663",
                            "Windows Event ID 5140"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for process creation events (Windows Event ID 4688) where the executable path is a UNC path (e.g., `\\\\server\\share\\...`). Correlate the execution event with recent file write events (Windows Event ID 4663) to the same file path. Prioritize alerts where a file is written by UserA/HostA and executed by UserB/HostB within a short time window (e.g., < 1 hour). Use frequency analysis on process names to identify executables that are rarely run from network shares. Investigate the parent process, command-line arguments, and subsequent network activity for all such executions."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
