[
    {
        "information_requirement": "Is the adversary attempting to discover local accounts on a system?",
        "tactic_id": "TA0007",
        "tactic_name": "Discovery",
        "indicators": [
            {
                "technique_id": "T1087.001",
                "name": "Local Account",
                "evidence": [
                    {
                        "description": "Execution of a process whose file hash is a known indicator for a malicious local account discovery tool or script.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor Windows Event ID 4688 for process creation events. Extract the file hash (e.g., SHA256) of the executed process image. Correlate this hash against a threat intelligence feed of known malicious file hashes associated with discovery tools (e.g., BloodHound, PowerSploit modules, custom adversary scripts). Alert on any match."
                    },
                    {
                        "description": "Execution of specific command-line patterns or API calls known to be used for local account discovery, such as `net user`, `Get-LocalUser`, or `wmic useraccount list`.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) for command-line arguments. Use regular expressions to detect common discovery commands such as `net user`, `net localgroup administrators`, `Get-LocalUser`, `Get-LocalGroupMember`, `wmic useraccount get name`, `dsquery user`, `query user`, `whoami /groups`. Flag executions originating from unusual parent processes (e.g., Office applications, web servers) or on high-value systems. Use frequency analysis to identify rare command usage in the environment."
                    },
                    {
                        "description": "An anomalous sequence or high frequency of local account discovery commands executed on one or more systems, indicating automated or interactive reconnaissance.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate discovery command executions (identified via command-line pattern matching) by host and user over time. Establish a baseline for normal administrative activity using historical data. Use time series analysis or statistical process control (e.g., CUSUM charts) to detect significant spikes in discovery command frequency. Correlate activity across multiple hosts originating from a single source host or user to identify widespread reconnaissance. Calculate the entropy of discovery commands used by a single source; a sudden increase may indicate an adversary trying various methods."
                    },
                    {
                        "description": "An observed sequence of local account discovery followed by login attempts using the enumerated accounts, especially those that are infrequently used or dormant.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4624",
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlated detection that triggers when a local account discovery event (from EID 4688) on a host is followed within a short time window (e.g., 5-60 minutes) by a logon attempt (EID 4624 for success, 4625 for failure) using a non-default local account on the same or a different host. Prioritize alerts where the discovered account has a low historical login frequency. Use descriptive statistics on account login history to determine rarity and flag attempts on accounts in the bottom percentile of activity."
                    },
                    {
                        "description": "Anomalous access to or network transfer of sensitive system files containing local account information, such as the Security Account Manager (SAM) hive.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek files.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for process creation (Windows Event ID 4688) related to `reg.exe` or `vssadmin.exe` with command-line arguments targeting the SAM hive (e.g., `reg save hklm\\sam`). Correlate this host-based activity with subsequent network transfers of files named `sam`, `sam.save`, or files of a similar size from the source host, detected via Zeek files.log or by analyzing data transfer volumes in Zeek conn.log. A strong correlation between these events is a high-fidelity indicator of credential database theft for offline discovery."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
