[
  {
    "Has the adversary moved laterally by tainting shared content? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1080 - Taint Shared Content": {
          "High volume of write/overwrite events to network shared directories from unusual processes or hosts.": {
            "Data": "Windows Event ID 4663; Windows Event ID 5140; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event IDs 4663 (write), 5140 (share access), and 4688 (process creation). Analyze write event volume per process/user/source host to shared directories. Identify processes or hosts with write volumes significantly higher than their historical baseline or the median/average using statistical methods (e.g., z-score, IQR). Flag write events occurring outside normal business hours or from unusual processes for investigation."
          },
          "Detection of processes executing from network shared drives exhibiting suspicious behavior.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5140; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing from network shared drives. Analyze process command lines and parent processes. Correlate with file access/share access logs (Event ID 5140) to understand context. Identify processes executed from shares that exhibit suspicious child processes, network connections (Zeek conn.log), or unusual behavior using correlation analysis. Look for patterns indicative of unexpected execution from shared locations."
          },
          "Creation or modification of suspicious files in shared directories, including hidden files, .LNK files pointing to hidden locations, or files with suspicious extensions.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 5140",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (object create), 4657 (object modify), and 4663 (object write) targeting shared directories for creation or modification of files with specific characteristics: hidden attribute set, '.lnk' extension pointing to hidden files or non-standard locations, or suspicious executable/script extensions (.exe, .dll, .scr, .bat, .vbs) in directories not typically containing these types. Use frequency analysis on file types and attributes created or modified in specific shares to identify outliers."
          },
          "Access or execution attempts on shared content files that have been recently modified in a suspicious manner (e.g., significant size change or entropy increase).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 4688; Zeek file.log; Windows Event ID 5140",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file modification events (Windows Event ID 4656/4657/4663) on shared directories, tracking changes to file size and potentially calculating entropy if feasible from logs or captured files (Zeek file.log). Correlate suspicious modifications (e.g., significant size deviation, high entropy for typical file types) with subsequent file access (4663) or execution attempts (4688) from systems accessing the share (Windows Event ID 5140). Prioritize investigation for executables/scripts using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]