[
  {
    "Has the adversary attempted to enumerate cloud accounts? (TA0007 - Discovery)": {
      "Indicators": {
        "T1087.004 - Cloud Account": {
          "Execution of command-line tools (PowerShell, AZ CLI, AWS CLI, gcloud) or scripts attempting to list cloud accounts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation containing command-line arguments related to cloud account enumeration (e.g., 'Get-MsolRoleMember', 'az ad user list', 'aws iam list-users', 'gcloud iam service-accounts list'). Identify infrequent or unusual command arguments using frequency analysis."
          },
          "Network traffic patterns indicating bulk queries or unusual access to cloud provider API endpoints associated with account listing.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections to known cloud provider API endpoints related to identity and access management (IAM) or directory services. Use time series analysis or statistical process control to detect unusual spikes or deviations in connection volume, frequency, or source IPs to these endpoints."
          },
          "Execution of cloud CLI/SDK processes immediately followed by network connections to cloud provider API endpoints associated with account enumeration from the same host.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events containing command lines indicative of cloud CLI/SDK usage (e.g., 'az.exe', 'aws.exe', 'gcloud.exe', 'powershell.exe' with cloud modules) with Zeek conn.log entries showing connections originating from the same host to cloud provider API endpoints within a short time window (e.g., < 60 seconds). Analyze these connections for destinations and patterns indicative of enumeration activity. Use time-based correlation analysis to link process execution and network activity."
          },
          "Unusual volume or specific patterns in API requests (e.g., listing users/roles) to cloud provider endpoints observed in network traffic from specific internal hosts.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for requests made to cloud provider API domains (e.g., '*.amazonaws.com/iam', 'graph.microsoft.com/v1.0/users', '*.googleapis.com/iam'). Identify requests containing parameters or paths related to listing accounts (e.g., '/users', '/roles', 'list-users'). Use frequency analysis or statistical process control (e.g., CUSUM charts) on the count of such requests per source IP over time to identify hosts performing unusually high volumes of enumeration requests compared to a calculated baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]