[
  {
    "Is the adversary attempting to discover email accounts or global address lists? (TA0007 - Discovery)": {
      "Indicators": {
        "T1087.003 - Email Account": {
          "Execution of PowerShell cmdlets related to Exchange/email address list enumeration (e.g., Get-GlobalAddressList).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and 4104 for execution of powershell.exe with command line arguments containing 'Get-GlobalAddressList' or similar Exchange/email discovery cmdlets. Baseline normal PowerShell usage per user or host using frequency analysis and identify outlier scripts or command lines based on low frequency of occurrence or high entropy of command line strings."
          },
          "Unusual network connections or successful authentications from compromised accounts attempting to query or enumerate email account information.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to Exchange/Mail server ports (e.g., 25, 110, 143, 443, 993, 995, MAPI ports) originating from internal IPs associated with suspicious activity or compromised accounts. Monitor Windows Event ID 4624 for successful authentication events to email-related services from unusual source IPs or accounts exhibiting anomalous login patterns (e.g., using time series analysis on login times or correlation analysis with other security events)."
          },
          "High volume of LDAP or MAPI queries originating from a single source host or user, specifically targeting Exchange/Directory servers.": {
            "Data": "Zeek conn.log; Zeek dce_rpc.log; Zeek ldap.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn.log for connections, dce_rpc.log for MAPI details, ldap.log for LDAP queries) for traffic to domain controllers or Exchange servers on relevant ports (e.g., 389/636 for LDAP, MAPI ports). Identify source hosts/users generating a significantly higher volume of queries compared to their historical baseline or peer groups using statistical methods like IQR or Z-score analysis on query counts per host/user within a given time window."
          },
          "Execution of uncommon scripts or tools (non-standard PowerShell, custom binaries) making network connections to Exchange/Directory servers, indicative of enumeration activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation, specifically looking for executions of script interpreters (like cscript, wscript, python) or unusual binaries with command lines potentially interacting with directory services or making network connections. Correlate these flagged process executions with Zeek conn.log entries showing connections initiated by those processes to Exchange/Directory server ports. Use entropy analysis on command lines to help identify obfuscated or uncommon commands associated with these processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]