[
  {
    "Is the adversary attempting to discover domain accounts? (TA0007 - Discovery)": {
      "Indicators": {
        "T1087.002 - Domain Account": {
          "Execution of command-line utilities (e.g., net user /domain, net group /domain) to enumerate domain accounts or groups.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints and servers for process creations containing command-line arguments like 'net user /domain', 'net group /domain', 'ldapsearch', 'dscacheutil -q group'. Identify execution by non-standard users or from unusual process trees. Use frequency analysis on command execution per host/user to detect anomalous spikes."
          },
          "Execution of PowerShell cmdlets (e.g., Get-ADUser, Get-ADGroupMember) or direct API calls for domain account/group enumeration.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4662",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 for PowerShell script blocks containing 'Get-ADUser', 'Get-ADGroupMember', or similar AD-related cmdlets. Monitor Windows Event ID 4662 for directory service access events targeting user or group objects (requires appropriate SACL configuration). Correlate these events with process execution (Event ID 4688) and network connections (Zeek logs) to identify the source and potential exfiltration or subsequent use of enumerated data."
          },
          "Network connections targeting Active Directory services (LDAP, Kerberos) from unusual sources or exhibiting high query volume/rate.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to destination ports 389, 636, 88 targeting Domain Controllers. Identify source IPs not typically expected to perform widespread AD queries (e.g., user endpoints vs. authorized management servers). Calculate the rate and volume of connections/bytes transferred per source IP to these ports within a fixed time window. Use percentile analysis or standard deviation to flag sources with significantly higher rates or volumes than their established baseline."
          },
          "Rapid requests for Kerberos tickets or credential validation attempts for multiple distinct domain accounts from a single source on Domain Controllers.": {
            "Data": "Windows Event ID 4768; Windows Event ID 4769; Windows Event ID 4776",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4768 (TGT requested), 4769 (ST requested), and 4776 (Credential Validation) on Domain Controllers. Group events by client IP address or requesting account. Within a sliding time window (e.g., 1-5 minutes), count the number of distinct target accounts/service principals requested or validated by each source. Flag sources exceeding a threshold for distinct principals or showing a rapid increase using statistical methods like moving averages and standard deviation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]