```json
[
  {
    "Is the adversary attempting to discover domain accounts? (TA0007 - Discovery)": {
      "Indicators": {
        "T1087.002 - Domain Account": {
          "Execution of processes with names or command-line arguments matching known malicious Active Directory enumeration tools or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of known malicious AD enumeration tool process names (e.g., 'sharphound.exe', 'adrecon.exe') and unique command-line strings or arguments associated with them. Monitor Windows Event ID 4688 for process creations that match this list of selectors. Alert on any exact matches and investigate the parent process and user context for further indicators of compromise."
          },
          "Execution of built-in Windows utilities (e.g., 'net', 'dsquery', 'nltest') with command-line arguments configured to enumerate domain-level users, groups, or trusts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations of 'net.exe', 'dsquery.exe', 'nltest.exe'. Specifically look for command-line patterns indicating domain enumeration, such as 'net user /domain', 'net group \"Domain Admins\" /domain', or 'dsquery user'. Correlate execution of these commands with the parent process; execution by non-interactive shells, web servers (e.g., 'w3wp.exe'), or other unexpected processes is highly suspicious. Use frequency analysis to find hosts or users executing these commands at an anomalous rate."
          },
          "Use of PowerShell script blocks or modules containing cmdlets and functions known to be used for Active Directory enumeration (e.g., 'Get-ADUser', 'Get-ADGroupMember', 'Get-NetUser').": {
            "Data": "Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor PowerShell Script Block Logging (Windows Event ID 4104). Scan script block content for the presence of common AD enumeration cmdlets like 'Get-ADUser', 'Get-ADGroup', 'Get-ADGroupMember', or functions from popular offensive PowerShell frameworks like PowerView ('Get-NetUser', 'Get-NetGroup', 'Find-LocalAdminAccess'). Use regular expressions to find patterns of enumeration, such as looping through users or querying all properties. Apply entropy measures to obfuscated script blocks to identify suspicious execution."
          },
          "Anomalous LDAP or SAMR query behavior from a single source, characterized by an unusually high volume of queries, a large number of objects returned, or queries targeting an abnormally broad set of user/group attributes.": {
            "Data": "Zeek conn.log; Windows Event ID 4662",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal LDAP (ports 389, 636) and SAMR (port 445) traffic for all network segments using Zeek conn.log. Monitor for sources exhibiting a statistically significant increase in connection count, query rate, or total data transferred to Domain Controllers. Use time series analysis or percentile-based thresholds to detect spikes. On Domain Controllers, monitor Directory Service Access events (Windows Event ID 4662, requires SACL on AD objects) to identify clients requesting an anomalously high number of distinct objects or attributes within a short time window. Use correlation analysis to link network anomalies with specific source accounts."
          },
          "A single host requesting an unusually high number of Kerberos service tickets (TGS) for different services or users, which is a key behavior of Kerberoasting.": {
            "Data": "Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On Domain Controllers, monitor Kerberos Service Ticket (TGS) requests (Windows Event ID 4769). Aggregate events by the client address (source host) over a sliding time window (e.g., 10 minutes). Calculate the number of distinct Service Names (SPNs) requested by each client. Establish a baseline for normal activity and use statistical methods like Inter-Quartile Range (IQR) or standard deviation on the counts of distinct SPNs to flag clients exhibiting outlier behavior indicative of Kerberoasting enumeration."
          },
          "A logical sequence of discovery activities originating from a single host or user, such as enumerating privileged groups and then enumerating the members of those groups.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a stateful detection rule that correlates multiple discovery events from a single source host or user within a defined time period (e.g., 1 hour). For example, flag a behavioral sequence where a command to list privileged groups (e.g., 'net group \"Domain Admins\" /domain') is followed by commands to list the members of those specific groups. This requires correlating multiple Windows Event ID 4688 or 4104 events by source host, user, and timestamp to identify the logical progression of reconnaissance."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```