[
  {
    "Is the adversary gathering system information about the network or hosts? (TA0007 - Discovery)": {
      "Indicators": {
        "T1082 - System Information Discovery": {
          "Execution of system information gathering commands (e.g., systeminfo, df -aH, show version) or API calls to query system details.": {
            "Data": "Windows Event ID 4688; Zeek dce_rpc.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command lines containing system information gathering commands (e.g., 'systeminfo', 'cmd.exe /c systeminfo', 'powershell.exe -command Get-ComputerInfo', 'wmic cs product get name'). Identify and flag executions by suspicious processes or with unusual parameters. Monitor Zeek logs (dce_rpc.log for Windows RPC, http.log for web APIs) for patterns indicative of automated system queries, potentially using correlation analysis between source IPs and frequency of these queries."
          },
          "System information discovery commands or API calls originating from unexpected users, processes, or locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events for system information commands (as in Evidence 1) and correlate them with user accounts (Event ID 4624 - Logon Type) and source IPs (Zeek conn.log). Use descriptive statistics and entropy measures on the frequency and location of these commands across users and endpoints over time to identify outliers or unusual concentrations of activity, focusing on executions outside of normal administration patterns."
          },
          "Execution of PowerShell or WMI commands to query detailed system configuration by unusual processes or users.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 for PowerShell script blocks containing WMI queries (e.g., Get-WmiObject, Get-CimInstance) related to system information (e.g., Win32_OperatingSystem, Win32_ComputerSystem, Win32_Product). Correlate with Event ID 4624 to identify the user context and Event ID 4688 for process lineage (e.g., if powershell.exe was launched by a suspicious parent). Establish baselines of normal PowerShell/WMI system queries per user/system and flag significant deviations in frequency (time series analysis) or content (identifying queries for sensitive information not typically accessed)."
          },
          "Execution of system information discovery commands or accessing system configuration files/APIs at an unusual volume or frequency across multiple hosts from a single source.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for system info commands executed frequently by the same process across multiple hosts. Correlate Zeek conn.log, http.log (for API calls), and file.log (for config file access) to identify a single source IP or internal host performing discovery actions against numerous targets. Use frequency analysis and statistical methods (e.g., correlation analysis, standard deviation) to identify hosts or users exhibiting a significantly higher rate of system info queries or connections to system config endpoints compared to the established baseline across the network segment or organization."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]