[
  {
    "Is the adversary discovering files and directories? (TA0007 - Discovery)": {
      "Indicators": {
        "T1083 - File and Directory Discovery": {
          "Suspicious command execution for file/directory enumeration utilities (dir, ls, find) on endpoints or servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation with command-line arguments containing file/directory enumeration commands (e.g., dir, ls, find) executed by unusual users or in unusual directories. Use frequency analysis or statistical process control to identify abnormal rates of these commands being run."
          },
          "Execution of file/directory discovery commands on network devices or unusual process behavior potentially interacting with file system APIs for enumeration.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network device CLI logs (potentially collected via Zeek logs) for commands like 'dir', 'show flash', 'nvram'. Also monitor Windows Event ID 4688 for unexpected processes potentially interacting with file system APIs for discovery. Analyze the context (user, source, destination) of these commands/processes. Use correlation analysis to link network device commands to suspicious host activity."
          },
          "Command execution or file access attempts targeting restricted directories or sensitive files.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 command lines and Windows Event ID 4663 object access attempts targeting directories and files known to contain sensitive information (e.g., %SYSTEMROOT%\\System32\\config, user profile directories like Documents, Desktops; specific file extensions like .kdbx, .pst). Flag access attempts by unusual processes, users, or from unexpected locations. Use frequency analysis to identify users or processes attempting to access a high count of sensitive files or directories within a short period."
          },
          "High volume or unusual patterns of network file/directory enumeration activity (e.g., SMB/NFS) originating from internal hosts.": {
            "Data": "Zeek smb.log; Zeek fileinfo.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smb.log for commands like 'SMB_COM_NT_TRANSACT_QUERY_DIRECTORY'. Analyze Zeek fileinfo.log for file listing events. Use statistical process control or time series analysis on file/directory listing volume per source host. Flag hosts exhibiting enumeration activity significantly above their baseline or peer group average, or accessing an unusually high number of shares/directories. Correlate with Zeek conn.log to identify the hosts and connections involved."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]