[
  {
    "Is the adversary attempting to discover local accounts on a system? (TA0007 - Discovery)": {
      "Indicators": {
        "T1087.001 - Local Account": {
          "Execution of commands or scripts to list local user accounts (e.g., \"net user\", \"net localgroup\").": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Filter for `cmd.exe`, `powershell.exe`, `net.exe`, `net1.exe` with command-line arguments containing 'user', 'localgroup'. Identify execution on critical servers or multiple endpoints simultaneously."
          },
          "Rapid execution of multiple discovery commands/APIs, including attempts to list local accounts via non-standard methods (e.g., PowerShell, WMI calls).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of Windows Event ID 4688 occurrences on endpoints/servers. Calculate the time difference between executions of known discovery commands (including account enumeration). Identify instances where multiple discovery commands are executed in rapid succession (e.g., using time series analysis or clustering based on execution timestamps and command types). Look for subsequent network connections via Zeek logs after enumeration activity."
          },
          "Transfer of system files potentially containing local account information (e.g., equivalents of /etc/passwd or SAM hive) over the network.": {
            "Data": "Zeek files.log; Zeek http.log; Zeek ftp.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for files with names or paths matching system files containing account info (e.g., 'passwd', 'shadow', 'SAM'). Monitor Zeek http.log, ftp.log, smtp.log for unusual file transfers containing suspicious keywords or excessive size from system directories on targeted systems. Correlate with known command execution events (Windows Event ID 4688) preceding the transfer if possible."
          },
          "Login attempts using newly discovered or infrequently used local account names immediately following local account enumeration activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate local account enumeration events (Windows Event ID 4688 with `net user`, `net localgroup` etc.) with subsequent login attempts (Windows Event ID 4624, 4625) originating from the same source IP or system within a short time window (e.g., 15 minutes). Identify login attempts using local account names that are either newly seen in login logs for that source, or have a low frequency of previous logins (using frequency analysis and descriptive statistics)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]