
[
  {
    "Is the adversary establishing persistent access by registering devices? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.005 - Device Registration": {
          "Device registration attempts originating from IP addresses or involving User-Agents known to be associated with malicious actors or tools.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek DNS and HTTP logs for traffic to known device registration and identity provider endpoints (e.g., enterpriseregistration.windows.net, login.microsoftonline.com, okta.com, duo.com). Correlate the source IP addresses and HTTP User-Agent strings of registration requests against a continuously updated threat intelligence feed of known malicious IPs and tool-specific User-Agents. Alert on any confirmed matches."
          },
          "Device registration using non-standard device names or attributes that match patterns used by known adversary toolkits.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Where traffic is unencrypted or decrypted via SSL inspection, inspect the payload of device registration traffic in Zeek http.log. Look for device names being registered that follow suspicious patterns (e.g., generic names like 'Chrome', names inconsistent with organizational policy, or names with high randomness). Use regular expressions to flag these patterns. Calculate the character entropy of registered device names; high entropy can indicate randomly generated names from malicious scripts."
          },
          "A new device is registered for a user account outside of their established baseline of activity, such as from an unusual geographic location, at an atypical time, or immediately following a series of failed logins.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal device registration activity per user/group (e.g., typical source IP geolocations, time of day/week). Monitor traffic to registration endpoints and correlate with user accounts. Flag registrations that deviate significantly from the baseline using statistical methods (e.g., percentile analysis on time, low-frequency analysis for geolocation). Correlate a device registration event with preceding failed login events (Windows Event ID 4625) for the same user account to detect registration following a potential password spray or brute-force attack."
          },
          "A high frequency of device registration events for a single user account or originating from a single source IP address within a short time frame.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate device registration events identified in Zeek logs by user account (if visible in URLs or payloads) and by source IP address. Calculate the rate of registrations over defined time windows (e.g., 1 hour, 24 hours). Use time series analysis or simple thresholding (e.g., >1 new device registration per user in 24 hours) to detect unusual spikes. A single user registering multiple devices or a single IP registering devices for multiple distinct users is highly suspicious and should be investigated."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary elevating privileges or bypassing policies by registering devices? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098.005 - Device Registration": {
          "A newly registered device making outbound connections to known malicious C2 domains or IP addresses shortly after registration.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify newly registered devices by monitoring registration endpoints (as in TA0003 analytics) and tag the device's internal IP for a set period (e.g., 24-48 hours). Correlate all outbound traffic from this tagged IP (using Zeek conn.log and dns.log) against a CTI feed of known malicious C2 domains and IPs. An immediate connection to known-bad infrastructure post-registration is a strong indicator the device was registered for malicious purposes."
          },
          "A newly registered device immediately and programmatically accessing a series of sensitive applications or resources in a sequence inconsistent with normal human-driven behavior.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Tag the internal IP of a newly registered device. Monitor its subsequent activity. Define a pattern of 'sensitive resource access' (e.g., accessing HR portal, finance app, and developer source code repo). Look for tagged devices that access multiple sensitive resources within a very short timeframe (e.g., seconds between requests), indicating scripted access. Use correlation analysis on connection timestamps and requested resources to detect this automated pattern."
          },
          "A user account successfully accesses sensitive resources from a newly registered device that they were previously denied access to from other, non-registered or non-compliant devices, indicating a policy bypass.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of resource access patterns per user, noting successful and failed access attempts from different device contexts (e.g., compliant vs. non-compliant). After identifying a newly registered device, track the user's access from that device. Flag instances where the user successfully accesses a resource (verified via Zeek conn.log to the resource or Windows Event ID 4624 on the server) that historical data shows was previously blocked for that user from other devices. This change in access capability is a key indicator of privilege escalation via policy bypass."
          },
          "A newly registered device exhibits network behavior inconsistent with its stated role or type, such as a 'user workstation' performing network scanning or attempting to connect to administrative interfaces.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Tag the internal IP of a newly registered device and monitor its network traffic profile using Zeek conn.log and Windows Filtering Platform logs (Event ID 5156). Look for behavior that contradicts its purpose, such as port scanning (connections to many distinct IPs/ports in a short time), attempts to connect to management ports (RDP, SSH, WinRM) on other internal systems, or unusual protocol usage (e.g., SMB traffic to an abnormally large number of hosts). Use frequency analysis and entropy measures on destination IPs/ports to detect scanning behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
