[
  {
    "Is the adversary communicating with command and control infrastructure using domain fronting? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1090.004 - Domain Fronting": {
          "Network traffic where the TLS SNI field does not match the HTTP Host header field.": {
            "Data": "Zeek ssl.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log and http.log. Join records on connection UIDs. Compare the 'server_name' field in ssl.log (SNI) with the 'host' field in http.log. Identify sessions where these fields do not match. Calculate the frequency of non-matching pairs per source IP/destination IP/destination domain. Investigate sessions with a high count or unusual mismatch patterns."
          },
          "Connections to known or suspicious C2 destination IPs or domains observed within traffic exhibiting domain fronting characteristics.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "From the sessions identified as potentially using domain fronting (SNI/Host mismatch), extract the 'host' field from the http.log (actual destination). Compare this against a list of known malicious C2 domains/IPs from threat intelligence feeds. Investigate any matches. Perform correlation analysis on network traffic characteristics (e.g., byte patterns, timing) for these suspicious connections compared to normal traffic."
          },
          "Network traffic with a blank or null TLS SNI field and a non-blank HTTP Host header.": {
            "Data": "Zeek ssl.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log and http.log, joining records on connection UIDs. Filter for sessions where 'server_name' in ssl.log is null or empty, but 'host' in http.log is present and non-empty. Investigate such sessions, especially if the destination IP is not expected or the traffic volume/pattern is unusual. Calculate the frequency of blank SNI connections per source IP and flag those with high occurrences."
          },
          "Connections to destination IP addresses known to belong to CDNs or cloud services (common for domain fronting) where the intended domain (from HTTP Host) is suspicious or not typically accessed by the source.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of IP ranges belonging to common CDNs and cloud providers. Filter Zeek conn.log for connections to these IP ranges. Join with Zeek http.log on UIDs to get the HTTP 'host' field. For connections to CDN IPs, check the 'host' field against a blocklist of known malicious domains or compare against a baseline of domains typically accessed by the source endpoint/user (e.g., using frequency analysis of historical HTTP hosts). Flag connections where the destination IP is a CDN and the HTTP host is suspicious. Use frequency analysis to identify source IPs or internal hosts making many connections to CDN IPs with suspicious hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]