[
  {
    "Is the adversary establishing persistence by adding cloud credentials? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.001 - Additional Cloud Credentials": {
          "Logs showing new credentials (keys/passwords) added to cloud Service Principals or Applications.": {
            "Data": "Zeek conn.log, Windows Event ID 4688, Windows Event ID 3",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud provider API endpoints. Correlate with Windows Event ID 4688 (Process Creation) and 3 (Network Connection) logs on servers/endpoints to identify processes potentially executing cloud CLI commands (`az`, `aws`, `gcloud`) related to credential modification. Identify unusual spikes or patterns in API interaction frequency using descriptive statistics or time series analysis."
          },
          "Logs indicating creation or import of new SSH keys or Access Keys for cloud accounts/instances, especially by unexpected users.": {
            "Data": "Zeek conn.log, Windows Event ID 4688, Windows Event ID 3",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to cloud provider API endpoints (e.g., EC2 API, IAM API). Filter for API calls potentially related to `CreateKeyPair`, `ImportKeyPair`, `CreateAccessKey`, `CreateLoginProfile`. Correlate with Windows Event ID 4688 and 3 logs for suspect process activity originating these connections. Use time series analysis to identify unexpected credential creation events."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges by adding cloud credentials with elevated permissions? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098.001 - Additional Cloud Credentials": {
          "Logging of cloud credential additions performed by potentially compromised user accounts or service principals with elevated privileges (e.g., Application Administrator).": {
            "Data": "Zeek conn.log, Windows Event ID 4624, Windows Event ID 4625",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Zeek conn.log metadata (if enriched) or correlate with Windows Event ID logs (e.g., 4624 successful login, 4625 failed login) on hosts to identify the source host/user initiating cloud API calls related to credential additions. Analyze login timestamps and frequency using descriptive statistics or IQR analysis to detect unusual user activity that indicates a compromised account used to perform cloud actions with elevated privileges."
          },
          "Logs showing usage of newly added cloud credentials accessing resources or performing actions inconsistent with the supposed permissions or typical behavior of the original account/application.": {
            "Data": "Zeek conn.log, Windows Event ID 4624, Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify Zeek conn.log sessions and Windows Event ID logs (e.g., 4624 successful login, 4688 process creation) originating from newly identified credentials. Analyze the frequency, destination, and type of activity (e.g., access to sensitive data sources, unusual commands). Use correlation analysis to link this new, potentially privileged activity back to the credential creation events identified earlier."
          }
        }
      }
    }
  }
]