[
  {
    "Has the adversary gained initial access via replication through removable media? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1091 - Replication Through Removable Media": {
          "Detection of executable files being created or run automatically from newly inserted removable media.": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the parent process is related to removable media auto-run (if enabled) or explorer.exe immediately following a USB device insertion event. Use time series analysis to identify clustered process creations after media insertion. Correlate with Zeek file.log if applicable for detection of files written to network-attached storage used as media."
          },
          "Suspicious file creation or modification events on removable media prior to its use on target systems.": {
            "Data": "Windows Event ID 11; Windows Event ID 2",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 11 (FileCreate) and Sysmon Event ID 2 (FileCreateTime) on systems potentially used to stage removable media. Look for the creation or modification time changes of suspicious executable files or files with double extensions on removable media drive letters. Use frequency analysis to spot unusual file types or names appearing on media."
          },
          "Unusual file access patterns (read/write) on removable media volumes, especially targeting system or hidden files, followed by execution.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 filtered for removable media drive letters. Look for sequences of read/write events targeting potentially malicious or system files (.exe, .dll, .lnk, hidden files) on removable media, immediately followed by process creation events (Windows Event ID 4688) where the image path is on the removable media. Use time series analysis to detect the proximity of file access and execution events."
          },
          "Creation of shortcut (.lnk) files or modification of Autorun configuration files on removable media.": {
            "Data": "Windows Event ID 11; Windows Event ID 15",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event IDs 11 and 15 for file creation on removable media drive letters. Specifically look for the creation of *.lnk* files or modification/creation of *autorun.inf* or similar configuration files. Analyze the contents (via Event ID 15 hash or direct inspection if possible) or target of the shortcut files to identify malicious executables. Use frequency analysis to identify hosts frequently creating such files on removable media."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary replicating or moving laterally using removable media? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1091 - Replication Through Removable Media": {
          "Processes being spawned on endpoints from executables located on mounted removable media volumes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Query Windows Event ID 4688 logs for process creation events where the 'Image' field path starts with a removable drive letter (e.g., D:\\, E:\\). Filter for common executable extensions (.exe, .dll, .vbs, .ps1, .bat). Use correlation analysis to link the executable name or hash to known malware or suspicious activity."
          },
          "Network connections (especially C2) or system/network discovery activities originating from processes executed from removable media.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) originating from removable media paths with subsequent Zeek conn.log, dns.log, or http.log entries showing outbound network connections. Perform correlation analysis between process name/hash and destination IPs/domains to identify potential C2 or discovery activity. Use network flow analysis (via Zeek conn.log) to identify unusual connection patterns (e.g., high volume, specific ports) originating from the host immediately after execution from removable media."
          },
          "Execution of files from removable media with suspicious names or paths that mimic legitimate system files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the 'Image' path is on a removable drive. Implement a list of suspicious file names (e.g., `svchost.exe`, `explorer.exe`, `cmd.exe` etc., when found on non-system drive letters) or paths (e.g., subfolders of the root drive) to match against the 'Image' path. Use string matching and pattern analysis on the 'Image' path and 'CommandLine' fields. Use frequency analysis to identify rare executables run from removable media."
          },
          "Detection of non-standard USB device types (e.g., mobile phones, specialized USB devices) being mounted as removable storage drives followed by suspicious activity.": {
            "Data": "Windows Event ID 20001; Windows Event ID 20003; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 20001 and 20003 (or similar PnP/USB events if available) for the connection and mounting of non-standard USB device classes (e.g., MTP/PTP devices potentially appearing as drives) as removable media. Correlate these events with subsequent file access, creation, or process execution events (Windows Event ID 4688) on the mounted volume and potentially network connections (Zeek conn.log) originating from processes executed from that volume. Use correlation analysis to link device connection events with subsequent malicious actions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]