[
  {
    "Is the adversary establishing persistent access by registering devices? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.005 - Device Registration": {
          "New device registered to an existing user account in the MFA system without user initiation or during unusual hours.": {
            "Data": "Zeek http.log, Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and dns.log for connections originating from internal IPs/users to known MFA provider domains (e.g., duo.com, okta.com). Identify sessions potentially indicating device registration based on URLs/request methods. Correlate with Windows Event ID 4624/4625 for the user (if available/relevant). Analyze frequency and timing of such events per user; flag events occurring outside typical work hours or locations using descriptive statistics and time series analysis."
          },
          "New device registered to Entra ID (Azure AD) or device management system (Intune) for an account.": {
            "Data": "Windows Event ID 4741, Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4741 for computer account creation events (for hybrid join scenarios). Correlate with Zeek http.log for connections to Microsoft Entra ID endpoints (login.microsoftonline.com, enterpriseregistration.windows.net) around the same time from potentially new devices or unusual sources. Analyze registration sources (IP, user agent) and timestamps. Flag registrations for users not expected to add devices using frequency analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary elevating privileges or bypassing policies by registering devices? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1098.005 - Device Registration": {
          "Access to sensitive resources via a newly registered device bypassing conditional access policies.": {
            "Data": "Zeek conn.log, Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful network logons (Windows Event ID 4624 network logon) or resource access sessions (Zeek conn.log) to sensitive assets originating from newly registered devices (identified via Windows Event ID 4741 or Zeek logs). Correlate with expected conditional access policy behavior (e.g., requiring MFA) to identify potential bypasses based on the connection details."
          },
          "Spike in device registration activity originating from a small number of accounts or source IPs.": {
            "Data": "Windows Event ID 4741, Zeek http.log, Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4741 and Zeek http.log/dns.log events related to device registration activity. Calculate the rate of registration events per user and per source IP. Use statistical methods (e.g., moving average, IQR, entropy measures on source attributes) to identify statistically significant spikes or unusual concentrations in registration volume from a single user or source within a specific time window."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]