```json
[
  {
    "Is the adversary maintaining persistence through account manipulation? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098 - Account Manipulation": {
          "Account manipulation, such as a password reset or property change, performed from a source IP address known to be malicious.": {
            "Data": "Windows Event ID 4738; Windows Event ID 4724; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract the 'Source Network Address' from Windows Event IDs 4738 (account changed) and 4724 (password reset). Inner join these source IPs with a cyber threat intelligence (CTI) feed of known malicious IPs or anonymizing services (e.g., TOR exit nodes), updated daily. Alert on any match and use Zeek conn.log to investigate the full scope of network activity from the malicious source."
          },
          "Specific account attributes modified to values indicative of persistence, such as setting 'Password Never Expires' or adding credentials to a service account.": {
            "Data": "Windows Event ID 4738; Windows Event ID 4739",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse Windows Event ID 4738 for specific attribute changes. Monitor the 'UserAccountControl' attribute for changes that include 'DONT_EXPIRE_PASSWD' or remove 'ACCOUNTDISABLE'. Monitor Windows Event ID 4739 for changes to domain policy on an account (e.g., 'Password Not Required'). Flag these specific, high-risk modifications, especially when performed on high-value, dormant, or service accounts. Correlate with recent logon activity for the subject account that performed the change."
          },
          "Dormant or inactive user accounts suddenly becoming active, having their password reset, or being otherwise modified, indicating resurrection for persistent access.": {
            "Data": "Windows Event ID 4724; Windows Event ID 4738; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of last logon dates for all user accounts. Generate an alert when a dormant account (e.g., no successful logon in >90 days) experiences a password reset (Event ID 4724), an account modification (Event ID 4738), or a successful logon (Event ID 4624). Use time series analysis on logon data to formally identify dormant accounts whose activity deviates from a zero-activity trend and investigate any such change."
          },
          "An account's security properties are modified (e.g., password reset, MFA disabled) at anomalous times or by an unusual administrative account, breaking from established operational patterns.": {
            "Data": "Windows Event ID 4738; Windows Event ID 4724; Windows Event ID 4739",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal activity for administrative accounts, including typical hours of operation and the types of changes they perform. Monitor Windows Event IDs 4738, 4724, and 4739. Use time series analysis or percentile analysis on event timestamps to flag changes occurring outside of normal business hours (e.g., 10 PM - 6 AM, weekends). Use correlation analysis to identify administrative accounts performing changes on user accounts outside their normal scope of responsibility. Flag events where the 'Subject Account' is not a member of a designated administrative or helpdesk group."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary escalated privileges through account manipulation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098 - Account Manipulation": {
          "Addition of a user account to a privileged group originating from a known malicious source IP or performed by a non-standard administrative process.": {
            "Data": "Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "For privileged group membership changes (Event IDs 4728, 4732, 4756), correlate the source workstation IP with CTI feeds. More importantly, correlate the logon session ID with process creation events (Event ID 4688) to identify the process that initiated the change. Alert if the change was performed by a process with a known malicious hash, a suspicious name (e.g., 'audiodg.exe'), or from a suspicious process lineage (e.g., spawned from an Office application)."
          },
          "New user accounts created with suspicious naming conventions (e.g., resembling system accounts, containing typos of real names) and immediately added to a privileged group.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for new account creation (Event ID 4720). Analyze account names using regular expressions to find patterns common to malicious activity, such as ending with '$', using special characters, or having names common to hacking tools. Correlate the new account's SID with a subsequent privileged group addition (Event IDs 4728, 4732, 4756) occurring within a short time window (e.g., <5 minutes). This sequence pattern is a strong indicator of privilege escalation."
          },
          "A non-administrative user account is added to a highly privileged group, especially by another account that is not an authorized administrator.": {
            "Data": "Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor all membership additions to highly privileged security groups (e.g., 'Domain Admins', 'Enterprise Admins', 'Schema Admins', 'Administrators'). For each event, check the existing group memberships of both the 'Member' (account being added) and the 'Subject' (account performing the action). Alert if a non-administrative account is added to a privileged group, or if the 'Subject' is not a member of a designated administrative group. Use frequency analysis to identify subject accounts that have never or rarely performed group modifications before."
          },
          "Modification of permissions on sensitive Active Directory objects, such as AdminSDHolder or default Group Policy Objects, to grant an unprivileged account elevated control.": {
            "Data": "Windows Event ID 5136; Windows Event ID 4670",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for modifications to critical AD objects using Event ID 5136 (directory service object modified). Specifically, filter for changes to the 'nTSecurityDescriptor' attribute of objects like 'AdminSDHolder' (CN=AdminSDHolder,CN=System,DC=...), default GPOs, or the domain object itself. Analyze the event to identify which permissions (e.g., 'Full Control', 'WriteDACL', 'All Extended Rights') were granted to which user or group. Use descriptive statistics to baseline normal modification activity on these objects and alert on any deviation, especially when permissions are granted to standard user accounts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```