[
  {
    "Has the adversary gained initial access via replication through removable media? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1091 - Replication Through Removable Media": {
          "Detection of executable files being created or run automatically from newly inserted removable media.": {
            "Data": "Windows Event ID 4688, Zeek file.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the parent process is related to removable media auto-run (if enabled) or explorer.exe immediately following a USB device insertion event. Use time series analysis to identify clustered process creations after media insertion. Correlate with Zeek file.log if applicable for detection of files written to network-attached storage used as media."
          },
          "Suspicious file creation or modification events on removable media prior to its use on target systems.": {
            "Data": "Windows Event ID 11, Windows Event ID 2",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 11 (FileCreate) and Sysmon Event ID 2 (FileCreateTime) on systems potentially used to stage removable media. Look for the creation or modification time changes of suspicious executable files or files with double extensions on removable media drive letters. Use frequency analysis to spot unusual file types or names appearing on media."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary replicating or moving laterally using removable media? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1091 - Replication Through Removable Media": {
          "Processes being spawned on endpoints from executables located on mounted removable media volumes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Query Windows Event ID 4688 logs for process creation events where the 'Image' field path starts with a removable drive letter (e.g., D:\\, E:\\). Filter for common executable extensions (.exe, .dll, .vbs, .ps1, .bat). Use correlation analysis to link the executable name or hash to known malware or suspicious activity."
          },
          "Network connections (especially C2) or system/network discovery activities originating from processes executed from removable media.": {
            "Data": "Zeek conn.log, Zeek dns.log, Zeek http.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) originating from removable media paths with subsequent Zeek conn.log, dns.log, or http.log entries showing outbound network connections. Perform correlation analysis between process name/hash and destination IPs/domains to identify potential C2 or discovery activity. Use network flow analysis (via Zeek conn.log) to identify unusual connection patterns (e.g., high volume, specific ports) originating from the host immediately after execution from removable media."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]