```json
[
  {
    "Is the adversary maintaining persistence using additional email delegate permissions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.002 - Additional Email Delegate Permissions": {
          "Mailbox permission change events where the actor or target account is on a watchlist of known suspicious or compromised accounts.": {
            "Data": "Windows Event ID 4104",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze PowerShell Script Block Logs (Windows Event ID 4104) for mailbox permission-modifying cmdlets (e.g., `Add-MailboxPermission`, `Add-MailboxFolderPermission`). Cross-reference the user account performing the action and the user account being granted access against an internal watchlist of suspicious or previously compromised accounts. Alert on any matches as this indicates a high-confidence malicious event."
          },
          "Execution of PowerShell cmdlets granting high-risk permissions (e.g., 'FullAccess') or assigning permissions to unusual accounts such as service accounts or newly created users.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 (PowerShell Script Block Logging) and 4688 (Process Creation with command line) for execution of Exchange management cmdlets. Use regular expressions to specifically flag commands that grant `FullAccess` rights, or that assign permissions to newly created accounts, service accounts, or user accounts outside the target's typical collaboration circle. Use frequency analysis to identify users or systems executing these commands anomalously."
          },
          "A sequence of events where a mailbox receives new delegate permissions, followed shortly by mailbox access from a source IP or device never before associated with that mailbox's typical access patterns.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate permission change events (from PowerShell logs, Event ID 4104) with subsequent mailbox access logs (Windows Event ID 4624 on mail server, or Zeek conn.log to mail ports). For a given target mailbox, establish a baseline of historic access source IPs/hostnames for the original mailbox owner. Following a permission change, flag any access by the new delegate from a source IP or device that is a statistical outlier compared to the original owner's established access patterns, indicating potential misuse of the delegated access for persistent monitoring."
          },
          "An account with newly delegated access generates email sending patterns (volume, recipient domains, time-of-day) that are anomalous compared to the original mailbox owner's baseline behavior, suggesting use for spam or internal phishing.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Windows Event ID 4104",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify mailboxes with recent delegate permission changes using Windows Event ID 4104. For these mailboxes, monitor outbound email activity (Zeek smtp.log). Establish a baseline of the original owner's sending behavior (avg. daily volume, typical recipient domains, time-of-day distribution). Compare the delegate's sending activity against this baseline. Use time series analysis and descriptive statistics (mean, standard deviation) to flag significant deviations in volume or unusual recipient patterns. Correlate findings to confirm the activity originates from the delegate and not the original owner."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting privilege escalation using additional email delegate permissions? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098.002 - Additional Email Delegate Permissions": {
          "Mailbox permission changes where the target mailbox belongs to a user in a high-privilege group (e.g., Domain Admins, C-suite) and the permissions are granted by a known suspicious or recently compromised account.": {
            "Data": "Windows Event ID 4104",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze PowerShell Script Block Logs (Windows Event ID 4104) for permission-modifying cmdlets. Maintain a list of high-value mailboxes (e.g., executives, IT administrators, financial controllers). Cross-reference the target mailbox in permission-change events against this high-value list. Simultaneously, cross-reference the account *performing* the change against an internal watchlist of suspicious or compromised accounts. Alert on any event where a suspicious account grants access to a high-value mailbox, as this is a strong indicator of privilege escalation."
          },
          "Execution of PowerShell cmdlets where a user grants their own account 'FullAccess' permissions to another user's mailbox, especially when targeting a higher-privileged user.": {
            "Data": "Windows Event ID 4104",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4104 for `Add-MailboxPermission` or similar cmdlets. Use regular expressions to extract the user performing the action (from the PowerShell session context) and the user being granted rights (from the '-User' parameter). Flag any instance where the performing user and the granted user are the same, but the target mailbox belongs to a different user. Assign a high severity if the target mailbox is on a watchlist of privileged accounts, as this represents a classic self-escalation pattern."
          },
          "A non-administrative user account executing mailbox permission change commands, or an administrative account performing such changes outside of normal business hours or from an unusual source system.": {
            "Data": "Windows Event ID 4104; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of which user accounts (e.g., members of 'Exchange Admins') and systems normally execute Exchange management cmdlets. Profile the typical time-of-day for these administrative actions using descriptive statistics. Monitor PowerShell logs (Event ID 4104, 4688) and flag any execution of permission-modifying cmdlets by accounts not in a legitimate administrative group. For valid admin accounts, flag executions that occur from non-standard management servers or at times that are statistical outliers (e.g., using Inter-Quartile Range or percentile analysis on timestamps)."
          },
          "An account accesses a newly delegated high-value mailbox, followed by anomalous network activity from that same account's source IP, such as authentication attempts to other critical systems or large data transfers.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4104",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify a mailbox privilege escalation event (e.g., from pattern-based detections via Event ID 4104). Then, monitor for the adversary's account accessing the victim's mailbox (via Windows Event ID 4624 on the server or Zeek conn.log). Following this access, track the source IP of the adversary. Flag subsequent RDP, SMB, or WinRM connection attempts (Zeek conn.log) or unusual data transfers from that IP to other high-value systems on the network. Use correlation analysis to link the mailbox access to the potential lateral movement attempt within a short time window (e.g., 1 hour)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```