[
  {
    "Is the adversary communicating with command and control infrastructure via an external proxy? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1090.002 - External Proxy": {
          "Network connections exhibiting asymmetric data flows (upload significantly greater than download) or anomalous protocol behavior to external destinations.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for external connections. Calculate the ratio of bytes_sent to bytes_received for each connection. Identify connections where the ratio is significantly skewed (e.g., using percentile analysis or IQR on the ratio). Analyze Zeek protocol logs (http.log, dns.log, weird.log) for connections on standard ports exhibiting non-standard behavior (e.g., non-HTTP traffic on port 80/443) or malformed protocol fields."
          },
          "Network connections initiated by unusual processes or connecting to external IP addresses identified as potential proxies or suspicious infrastructure.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and correlate with network connection logs (Zeek conn.log). Identify processes making external connections that are not typically expected to do so (e.g., based on frequency analysis or comparison to a baseline of common network-aware processes). Cross-reference destination IP addresses from Zeek conn.log with Threat Intelligence feeds for known proxies or suspicious infrastructure via inner join. Flag connections to IPs with multiple threat intelligence hits or reputation scores below a threshold."
          },
          "Connections to known public proxy/VPN services or cloud hosting providers from internal hosts that bypass standard outbound proxies, especially when exhibiting C2-like traffic patterns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections from internal hosts that do not traverse the standard outbound proxy. Filter destinations by IP ranges or ASNs known to belong to public proxy services, commercial VPN providers, or common cloud hosting providers using threat intelligence or commercial IP/ASN data. Use time series analysis or flow analysis to analyze flagged connections for characteristics of C2 traffic (e.g., periodic beaconing, low volume bidirectional traffic, asymmetric data flows)."
          },
          "Execution of known proxy/port forwarding tools or custom executables exhibiting proxy-like network behavior.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of processes with names matching known proxy/port forwarding tools (e.g., htran.exe). Analyze command-line arguments for configuration details (using descriptive statistics on common arguments). Correlate process execution with Zeek conn.log and Windows Event ID 5156 (Network Connection) to identify associated network connections, particularly those establishing connections to external destinations and potentially listening ports locally. Use behavioral analysis (e.g., analyzing network connections made by unsigned/unusual executables) to identify custom proxy tools."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]