
[
  {
    "Is the adversary communicating with command and control infrastructure via an external proxy? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1090.002 - External Proxy": {
          "Outbound network connections from internal hosts to external IP addresses or domains known to be part of malicious proxy networks or public anonymizing services.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log with a high-confidence, continuously updated CTI feed of known malicious proxy IPs, TOR exit nodes, and public anonymizing VPN services. Alert on any matches and investigate the source host and associated process activity."
          },
          "Execution of processes matching the file names or file hashes of known external proxy or tunneling tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Compare the new process name and its file hash against a maintained list of known proxy/tunneling tools (e.g., htran, ngrok, chisel, plink). Alert on any exact matches. Use frequency analysis on all process names to spot low-prevalence executables that warrant further investigation for proxy-like behavior."
          },
          "Process execution with command-line arguments indicative of configuring or using an external proxy or network tunnel.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command-line arguments from Windows Event ID 4688 events using regular expressions to detect patterns associated with proxy/tunneling tool configuration. Search for flags such as '-listen', '-tran', '-proxy', '-R', '-L', followed by port numbers or IP addresses. Use correlation analysis to link processes with suspicious command-lines to their subsequent network connections observed in Zeek conn.log."
          },
          "Use of SSL/TLS connections with client fingerprints (JA3/JA3S) or Server Name Indication (SNI) values known to be associated with specific proxy tools or C2 frameworks.": {
            "Data": "Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract JA3/JA3S hashes and SNI string values from Zeek ssl.log for all outbound connections. Compare these against a threat intelligence feed or a maintained list of fingerprints known to be used by specific proxy tools (e.g., ngrok, chisel) or common C2 frameworks. Flag connections with matching fingerprints and analyze the source and destination for other signs of compromise."
          },
          "Network connections to external destinations initiated by processes not typically expected to be network-aware (e.g., system utilities, document viewers) or from unusual file paths.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of common network-aware processes and their typical file paths within the environment. Monitor Windows Event ID 4688 for process creation and correlate with network connection data from Zeek conn.log. Use descriptive statistics and frequency analysis to identify rare processes making external network connections, or processes running from non-standard locations (e.g., %TEMP%, C:\\Users\\Public\\). Flag these events for investigation as they may indicate a custom proxy tool."
          },
          "Outbound network connections exhibiting C2-like characteristics such as periodic beaconing, long connection durations with low data volume, asymmetric data flows, or non-standard protocols over common ports.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound connections. Use time series analysis to detect periodic connections (beaconing) by modeling the time delta between connections from a source to a destination. Calculate the ratio of sent vs. received bytes; use IQR or percentile analysis to flag connections with extreme asymmetry (e.g., >10:1 upload to download). Monitor Zeek weird.log or connection logs for traffic on standard web ports (80, 443) that is not identified as HTTP/SSL, indicating protocol tunneling."
          },
          "Direct connections from internal hosts to external IP addresses belonging to public cloud providers, VPN services, or hosting providers, especially when bypassing the designated corporate web proxy.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify the IP address(es) of the corporate web proxy. Filter Zeek conn.log for all external connections on ports 80/443 that do not have the proxy IP as a destination. For the remaining direct connections, enrich the destination IPs with ASN and service provider information. Flag connections to ASNs belonging to major cloud providers (AWS, Azure, GCP), known VPN services, or generic hosting providers. Use frequency analysis to find hosts making many such connections, as this may indicate policy bypass for C2."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
