[
  {
    "Is the adversary maintaining persistence by modifying local or domain groups? (TA0003 - Persistence)": {
      "Indicators": {
        "User accounts added to sensitive local groups like 'Remote Desktop Users' or 'Administrators'.": {
          "Monitoring Windows Event ID 4732 for additions to sensitive local groups": {
            "Data": "Windows Event ID 4732",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4732 (A member was added to a security-enabled local group). Identify events where 'TargetUserName' is added to groups like 'Remote Desktop Users' or 'Administrators'. Analyze 'SubjectUserName' (who made the change) for anomalies, such as changes made by non-privileged accounts or outside normal administrative procedures. Use frequency analysis to identify accounts making excessive group changes or rare group additions."
          },
          "Creation or modification of scheduled tasks or services by accounts recently added to sensitive groups.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 7036; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event IDs indicating scheduled task creation/modification (4698, 4702) or service installation/status change (7045, 7036) with successful logons (4624) or process creation (4688) from accounts recently added to sensitive local or domain groups (identified via Event IDs 4732, 4728, 4756). Use time-series analysis to look for these activities occurring shortly after group membership changes. Use correlation analysis to link specific service/task actions to user accounts."
          },
          "External network connections initiated by accounts recently added to sensitive groups.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify accounts recently added to sensitive groups using Event IDs 4732, 4728, 4756. Monitor Zeek conn.log and Windows Event ID 5156 (Network Connection) for external network connections originating from systems where these accounts are logged in (Windows Event ID 4624). Use correlation analysis to link network activity to specific user accounts and compare against historical network activity for those accounts/systems to identify unusual patterns or destinations (e.g., connections to known C2 IPs using Threat Intelligence)."
          }
        },
        "Machine accounts added to sensitive domain groups.": {
          "Monitoring Windows Event ID 4728 and 4756 for machine account additions to sensitive domain groups": {
            "Data": "Windows Event ID 4728; Windows Event ID 4756",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4728 and 4756 (Member added to domain global/universal group). Identify events where 'TargetUserName' is a machine account (ends with $) and 'TargetGroupName' is a sensitive domain group (e.g., 'Domain Admins', 'Enterprise Admins'). Use time series analysis or frequency analysis to spot unusual occurrences of machine accounts being added to domain groups."
          },
          "Anomalous resource access or lateral movement activity originating from machine accounts recently added to sensitive domain groups.": {
            "Data": "Windows Event ID 4624; Windows Event ID 5140; Windows Event ID 4688; Zeek smb.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify machine accounts added to sensitive domain groups (Event IDs 4728, 4756). Monitor network logons (Event ID 4624 Type 3) and file share access (Event ID 5140, Zeek smb.log) using these machine accounts on multiple hosts. Analyze process creation (Event ID 4688) attributed to these machine accounts. Use correlation analysis to detect lateral movement patterns (e.g., accesses across multiple systems) or unusual resource access originating from these accounts compared to their baseline activity."
          },
          "Authentication or Kerberos activity involving machine accounts with elevated privileges.": {
            "Data": "Windows Event ID 4769; Windows Event ID 4776; Zeek kerberos.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Kerberos Service Ticket Granted (Event ID 4769) and Credential Validation (Event ID 4776) events for machine accounts identified as having been added to sensitive domain groups. Analyze the requested service names (in 4769) and source/target information (in 4776, Zeek kerberos.log) for signs of unusual access or behavior compared to typical machine account activity. Use descriptive statistics or frequency analysis to baseline typical services/hosts accessed by machine accounts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary elevated privileges by modifying local or domain groups? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "User accounts added to the local 'Administrators' group.": {
          "Monitoring Windows Event ID 4732 for additions to local 'Administrators' group": {
            "Data": "Windows Event ID 4732",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4732. Filter for events where 'TargetGroupName' corresponds to the local 'Administrators' group SID. Identify 'TargetUserName' (the account added). Analyze 'SubjectUserName' (the account making the change) for unexpected sources. Use descriptive statistics to profile typical accounts that add users to local Admin and flag deviations from these baselines."
          },
          "Execution of administrative commands or tools by accounts recently added to the local 'Administrators' group.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688, Sysmon Event ID 1) on systems where accounts recently added to the local 'Administrators' group are logged in. Filter for execution of common administrative tools (e.g., PowerShell, cmd.exe, net.exe, wmic.exe) or commands indicative of privilege use (e.g., `net user`, `net group`, `sc`, `taskkill /f /fi`). Use correlation analysis to link process execution to the user account and the timing of their group membership change. Baseline typical administrative activities per system/user and flag deviations."
          },
          "Unusual network activity or connections originating from systems where accounts recently added to the local 'Administrators' group are active.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 (Network Connection) for outbound connections from systems where accounts recently added to the local 'Administrators' group have logged on (Event ID 4624). Analyze connection destinations, ports, and volume. Use frequency analysis or percentile analysis on connection destinations/ports to identify rare or anomalous network behavior compared to the system's baseline or peer systems. Correlate with Threat Intelligence feeds."
          }
        },
        "User accounts added to sensitive domain groups like 'Domain Admins'.": {
          "Monitoring Windows Event ID 4728 and 4756 for user account additions to sensitive domain groups": {
            "Data": "Windows Event ID 4728; Windows Event ID 4756",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4728 and 4756. Identify events where 'TargetGroupName' is a sensitive domain group (e.g., 'Domain Admins', 'Enterprise Admins') and 'TargetUserName' is a user account. Analyze 'SubjectUserName' for unexpected sources. Use correlation analysis to link these events with other potentially malicious activity from the 'TargetUserName' or 'SubjectUserName'."
          },
          "Kerberos ticket granting or service access requests for sensitive services by user accounts recently added to sensitive domain groups.": {
            "Data": "Windows Event ID 4769; Zeek kerberos.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Kerberos Service Ticket Granted (Event ID 4769) events and Zeek kerberos.log for activity involving user accounts recently added to sensitive domain groups (Event IDs 4728, 4756). Analyze the requested service names (e.g., CIFS for file shares, LDAP, WinRM) and target server information. Use correlation analysis to link requests for sensitive services to the user account and the timing of their group membership change. Baseline typical service access patterns for user accounts in these groups (or the lack thereof before the change) and flag deviations."
          },
          "Lateral movement activity (e.g., RDP, PsExec, WMI) initiated by user accounts recently added to sensitive domain groups.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network logons (Event ID 4624 Type 3/10) and process creation (Event ID 4688) on remote systems where user accounts recently added to sensitive domain groups authenticate. Filter for process creation indicative of lateral movement tools (e.g., `psexec.exe`, `wmic.exe`, remote PowerShell commands) or network connections to administrative ports (e.g., RDP 3389, WinRM 5985/5986). Use correlation analysis to trace the sequence of activity across multiple hosts originating from these accounts after their privilege escalation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]