[
  {
    "Is the adversary communicating with command and control infrastructure using proxy techniques? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1090 - Proxy": {
          "Network traffic exhibiting unusual data flow patterns (asymmetrical data transfer) or protocol violations on standard ports.": {
            "Data": "Zeek conn.log; Zeek protocol logs (e.g., http.log, dns.log)",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to calculate data transfer ratios (bytes_orig / bytes_resp) for connections. Identify connections with significantly asymmetrical data flow using statistical methods like outlier detection (e.g., Z-score, IQR) or examining data transfer correlation over time. Examine associated protocol logs (http.log, dns.log) for malformed requests or responses not consistent with the expected protocol behavior."
          },
          "Connections from internal hosts to known proxy/anonymity services or suspicious external IP addresses.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and dns.log for connections to IP addresses or domains associated with known proxy services (Tor exit nodes, commercial VPNs not approved for use), anonymity networks, or addresses listed in current threat intelligence feeds. Inner join connection logs with a list of known suspicious destinations. Investigate connections to flagged destinations, especially if originating from unexpected internal hosts."
          },
          "Network connections originating from processes not typically expected to make external network connections or from newly observed executables.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline network connections initiated by specific processes (Windows Event ID 5156 correlated with 4688 process name/path). Identify connections from processes with no prior network activity or from recently created/modified executables (analyze 4688 creation time/hash). Use frequency analysis on process names initiating external connections from endpoint/server logs. Investigate outliers or new processes."
          },
          "Network traffic on standard ports using non-standard or unexpected protocols (e.g., C2 over DNS, HTTP, or SMB).": {
            "Data": "Zeek conn.log; Zeek protocol logs; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and protocol logs (http.log, dns.log, smb.log, etc.). Filter traffic on common ports (e.g., 53, 80, 443, 445) and examine the actual protocol identified by Zeek's protocol analyzers. Flag connections where the port-protocol mapping is unusual (e.g., TCP/53 traffic identified as HTTP, not DNS). Look for anomalies recorded in Zeek's `weird.log` associated with these connections. Use frequency analysis to identify ports or target hosts with a high rate of unexpected protocol detections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]