[
    {
        "information_requirement": "Is the adversary communicating with command and control infrastructure using non-application layer protocols?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1095",
                "name": "Non-Application Layer Protocol",
                "evidence": [
                    {
                        "description": "Non-application layer protocol traffic (e.g., ICMP, raw UDP/TCP) is observed to or from IP addresses known to be associated with command and control (C2) infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek icmp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join destination and source IP addresses from Zeek conn.log and icmp.log (where the protocol is ICMP or a non-standard TCP/UDP port is used) against a high-confidence, frequently updated cyber threat intelligence (CTI) feed of known malicious C2 servers. Alert on any matches and investigate the associated internal host for compromise."
                    },
                    {
                        "description": "ICMP traffic matching the specific type, code, and payload structure patterns of known C2 tools or malware families (e.g., icmpsh, pwnat, or specific malware implants).",
                        "data_sources": [
                            "Zeek icmp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze the data payload within Zeek icmp.log. Create and apply rules to detect specific patterns used by known ICMP tunneling tools or malware. For example, look for sequences of ICMP echo requests (Type 8) containing specific magic bytes or having consistent, unusual payload lengths, followed by corresponding echo replies (Type 0) containing command output. Maintain and update a library of these tool-specific patterns using regular expressions or byte-sequence matching on the ICMP data payload field."
                    },
                    {
                        "description": "Unusually large or structured data payloads are observed within ICMP echo request/reply packets or other non-application layer protocols, suggesting data tunneling for C2.",
                        "data_sources": [
                            "Zeek icmp.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline for typical payload sizes in common non-application layer protocols (e.g., standard ICMP echo requests are typically small and consistent). Monitor Zeek icmp.log and conn.log for significant deviations. Use descriptive statistics (mean, standard deviation, max) and percentile analysis on payload sizes to flag outliers. Calculate the entropy of the payload data; high entropy can indicate encrypted or compressed data being tunneled, which is anomalous for protocols like ICMP. Correlate high-entropy or large-payload packets over time to identify sustained C2 tunneling."
                    },
                    {
                        "description": "Network connections using non-application layer protocols (e.g., raw TCP/UDP, ICMP) originate from processes not typically associated with external network activity or those lacking a legitimate parent process.",
                        "data_sources": [
                            "Windows Event ID 5156",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network connection filtering events (Windows Event ID 5156, specifically for non-application protocols like ICMP or raw UDP/TCP) with the initiating Application/Process Name and ID. Join this with process creation logs (Windows Event ID 4688) to analyze the process lineage and command line. Establish a baseline of legitimate processes that use these protocols (e.g., 'ping.exe' for ICMP). Alert on connections from unexpected processes (e.g., 'svchost.exe' making ICMP connections with large payloads, 'powershell.exe', or unsigned binaries in temp directories). Use frequency analysis on process names making such connections to find rare and suspicious activity."
                    },
                    {
                        "description": "Sustained, bi-directional communication using protocols or ports not typically associated with interactive or stateful sessions is observed, indicating a covert C2 channel.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek weird.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for long-lived connections or a high volume of packets on non-standard ports or protocols. Calculate the ratio of sent vs. received bytes and packets for a given flow; ratios near 1:1 for protocols that are normally one-way can indicate interactive C2. Use time series analysis to detect periodic, 'heartbeat' traffic patterns on these channels. Monitor Zeek weird.log for notices like 'data_before_established' or 'active_connection_without_SYN' which can indicate non-standard TCP handshakes used by some C2 frameworks to evade detection."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
