[
  {
    "Is the adversary maintaining persistence through account manipulation? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098 - Account Manipulation": {
          "Modification of user account properties (e.g., password reset, disabling MFA, changing description) from unusual sources or times.": {
            "Data": "Windows Event ID 4738; Windows Event ID 4724; Windows Event ID 4739",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4738, 4724, 4739 on Domain Controllers. Analyze event timestamps and source IPs/hostnames for changes occurring at unusual times (e.g., using percentile or IQR analysis on time-of-day) or from unexpected locations/systems based on historical patterns. Identify instances where account properties are modified without a corresponding helpdesk ticket or authorized change request."
          },
          "Multiple password changes occurring in rapid succession or outside typical user behavior for the same account.": {
            "Data": "Windows Event ID 4723; Windows Event ID 4724",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4723 and 4724 for the same account within a short time frame (e.g., minutes). Use time series analysis or simple counting functions to identify accounts with an unusually high frequency of password change/reset events compared to historical patterns or the average user (e.g., using descriptive statistics like count and standard deviation)."
          },
          "Account property changes performed by an account different from the target account, originating from an unusual source IP or system.": {
            "Data": "Windows Event ID 4738; Windows Event ID 4724; Windows Event ID 4739",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4738, 4724, 4739. For each event, compare the 'Subject Account' (who performed the change) and the 'Target Account' (which account was changed). Flag events where Subject Account != Target Account and the 'Source Network Address' or 'Workstation Name' is unusual based on historical patterns or defined allowed administrative systems. Use frequency analysis to identify rare source systems for account changes performed by different subjects."
          },
          "Successful logons using a potentially compromised account to multiple, disparate systems or services within a short period, especially if outside normal working hours.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 for successful logons using known valid accounts, correlating by account name and source IP/Workstation Name. Identify accounts logging into an unusually high number of distinct systems or services within a short time (e.g., using descriptive statistics like count of unique target systems). Correlate with Zeek conn.log originating from the same source IP/systems for connection patterns. Flag such activity occurring outside the account's typical working hours (e.g., using time series analysis or simple time-of-day filtering)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary escalated privileges through account manipulation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098 - Account Manipulation": {
          "Addition of user accounts to privileged groups (e.g., Domain Admins, Enterprise Admins, local Administrators) or modification of user permissions.": {
            "Data": "Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756; Windows Event ID 4670",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4728, 4732, 4756 (group membership changes) and 4670 (permissions changes) on Domain Controllers or relevant servers. Filter for changes involving highly privileged security groups (e.g., 'Domain Admins', 'Enterprise Admins', 'Administrators') or sensitive objects. Correlate changes with user context; flag changes where the subject user performing the change is not a member of an authorized administrative group or when the target account being added is unexpected. Use frequency analysis to identify rare combinations of subject user and target group."
          },
          "Creation of new user accounts with high-level privileges or suspicious naming conventions.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 on Domain Controllers for new account creation. Analyze the properties of newly created accounts (e.g., enabled status, 'password never expires', group membership). Immediately investigate new accounts added to privileged groups (Event IDs 4728, 4732, 4756) within a short time of creation. Use descriptive statistics and correlation to identify suspicious naming conventions or patterns in newly created privileged accounts."
          },
          "Modification of access control lists (ACLs) or permissions on sensitive objects (e.g., GPOs, OUs) granting excessive permissions to standard users or recently modified accounts.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4670 for changes to the SACL/DACL of sensitive objects like Group Policy Objects, Organizational Units, or critical system files/folders. Analyze the permissions granted (as shown in the event data) and the target account/group receiving the permissions. Flag changes that grant excessive permissions (e.g., 'Full Control', 'Write DACL', 'Write Owner') to non-administrative accounts or accounts that have been recently modified (correlate with 4738 events). Use frequency analysis to identify rarely modified objects or users receiving permissions."
          },
          "Successful addition of a user account to a privileged group immediately following an unusual logon by that account or the account that performed the modification.": {
            "Data": "Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4728, 4732, 4756 for successful additions of accounts to privileged groups. Correlate these events temporally (within minutes) with Windows Event ID 4624 (successful logon) from either the 'Subject Account' (who made the change) or the 'Target Account' (who was added to the group). Flag instances where the associated 4624 logon is from an unusual source IP, system, or occurs at an unusual time (e.g., using time series analysis), especially if the 'Subject Account' is not typically authorized for such changes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]