[
  {
    "Is the adversary maintaining persistence using modified SSH authorized_keys? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.004 - SSH Authorized Keys": {
          "Unauthorized changes detected in user's .ssh/authorized_keys file.": {
            "Data": "Windows Event ID 4688; Zeek ssh.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation related to file modification commands (e.g., 'echo', 'tee', 'ssh-keygen -A') targeting paths matching '.ssh/authorized_keys'. Analyze command line arguments for suspicious patterns. Cross-reference with Zeek ssh.log for new keys being used shortly after modification. Use file integrity monitoring logs if available."
          },
          "Suspicious process detected modifying .ssh/authorized_keys or /etc/ssh/sshd_config files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious processes (e.g., unexpected scripts, remote execution tools) executed by unusual users/systems that attempt to modify files in paths like '.ssh/' or '/etc/ssh/'. Use frequency analysis on process names/command lines to identify rare occurrences."
          },
          "New, previously unseen SSH public key used for successful authentication.": {
            "Data": "Zeek ssh.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract public keys used in successful SSH authentication events from Zeek ssh.log. Maintain a baseline of known and authorized public keys per user account. Use frequency analysis to identify keys seen for the first time or keys with very low frequency of use compared to authorized keys. Investigate the first use of any previously unseen public key, especially for privileged accounts."
          },
          "Execution of commands or scripts known to modify SSH authorized_keys file paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for specific command-line patterns associated with adding content to or modifying files named 'authorized_keys' within user home directories (e.g., `echo *>> /home/*/.ssh/authorized_keys`, `cat /path/to/key >> /root/.ssh/authorized_keys`, `sed -i ... authorized_keys`). Use pattern matching and frequency analysis to identify unusual executions of these commands, especially by non-standard users or from unusual parent processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary gained elevated privileges using modified SSH authorized_keys? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1098.004 - SSH Authorized Keys": {
          "Successful SSH login as a high-privileged user (e.g., root) from an unexpected source IP or without typical authentication methods (password/MFA).": {
            "Data": "Zeek ssh.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log for successful login events to privileged accounts (e.g., root, admin) from unexpected source IPs or users not typically using SSH key authentication. Use correlation analysis to link successful logins with previous detection events (e.g., file modification alerts). Analyze login times using time series analysis to detect persistence outside normal hours."
          },
          "Unauthorized changes detected in /etc/ssh/sshd_config file.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation related to file modification commands targeting '/etc/ssh/sshd_config'. Analyze command line arguments for changes enabling `PubkeyAuthentication` or `PermitRootLogin`. Correlate with Zeek ssh.log for subsequent authentication attempts using keys or root login."
          },
          "Changes to OS-level user metadata or configuration via cloud provider APIs or command-line tools that include adding SSH public keys, followed by a privileged SSH login.": {
            "Data": "Windows Event ID 4688; Zeek ssh.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of cloud provider CLI tools (e.g., `gcloud`, `az`) with arguments related to modifying instance metadata or adding SSH keys. Correlate these events with subsequent successful SSH logins (Zeek ssh.log) using newly added keys, particularly for high-privileged accounts. Use time series analysis to identify activity spikes or sequences (CLI execution -> SSH login) that indicate a privilege escalation attempt."
          },
          "Successful SSH logins to network devices using SSH keys, originating from unexpected sources or accounts.": {
            "Data": "Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log for successful SSH logins to network devices. Identify login attempts using public keys. Compare source IPs and user accounts with a baseline of normal network device access. Flag logins from unexpected sources, using unusual accounts, or occurring at unusual times (frequency/time series analysis) via key authentication, as this could indicate a newly added key is being used for access/persistence/escalation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]