[
  {
    "Is the adversary maintaining persistence by adding roles to container accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.006 - Additional Container Cluster Roles": {
          "Creation of new ClusterRoleBindings or RoleBindings associated with unusual or newly created accounts in the container orchestration system.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for POST requests to Kubernetes API endpoints related to 'clusterrolebindings' or 'rolebindings'. Identify source IPs, user agents, and associated users/service accounts within the HTTP payload if available. Cross-reference with lists of known/approved accounts and look for API calls originating from unusual sources or using newly created/unknown accounts. Use frequency analysis on requested URIs or source IPs to spot anomalies."
          },
          "Modification of existing container user or service accounts to include additional high-privilege roles or permissions.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for PUT requests to Kubernetes API endpoints modifying existing 'clusterrolebindings' or 'rolebindings'. Identify the target account being modified and attempt to infer the roles being assigned from the HTTP payload. Use correlation analysis to link these modifications to prior activities involving the account or originating IP. Look for significant changes in inferred permissions granted to existing accounts."
          },
          "Repeated API calls by a single account to manage role bindings over time, especially after initial creation or modification.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for API calls (POST, PUT, DELETE) targeting 'clusterrolebindings' or 'rolebindings' by specific source accounts or IPs over an extended period (e.g., days or weeks). Use time series analysis or frequency analysis to identify accounts or IPs making an unusual number of such API calls or consistently interacting with specific role bindings, indicating management or use of a persistent access method."
          },
          "Assignment of roles granting access to specific namespaces or resources to accounts that typically do not interact with those resources.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for API calls creating or modifying role bindings. Extract the target account, role name, and targeted namespaces/resources from the API payload. Establish baselines of typical account-to-resource access patterns using historical Zeek logs or cluster configuration data. Flag role assignments where the account gains access to namespaces or resource types it has not historically interacted with, particularly sensitive ones, as a potential persistence mechanism."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges by adding roles to container accounts? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1098.006 - Additional Container Cluster Roles": {
          "Assignment of administrative or highly permissive roles (e.g., 'cluster-admin') to non-administrative container accounts.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek http.log for API calls (POST/PUT) creating or modifying role bindings that appear to assign high-privilege roles (e.g., 'cluster-admin', 'edit', 'admin') based on URI patterns or payload content. Identify the associated account from the log. Verify if this assignment is expected or unusual for that account using baselines or correlation with authorized change requests."
          },
          "Binding of container accounts to roles or permissions they have not historically held, especially roles granting access to sensitive data or operations.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for changes in role bindings ('clusterrolebindings', 'rolebindings'). Use historical data from logs to establish a baseline of typical account-to-role binding patterns. Identify bindings that deviate significantly from this baseline based on account and requested API paths. Use correlation to link these unusual bindings to other suspicious activities from the source IP or account."
          },
          "API calls to create or modify role bindings originating from accounts or source IPs that typically have limited privileges or are from unexpected locations.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for API calls (POST/PUT) targeting 'clusterrolebindings' or 'rolebindings'. Identify the source account/IP performing the action. Establish baselines of which accounts/IPs legitimately perform role management activities. Flag role modifications/creations originating from accounts/IPs outside this baseline or those typically associated with low-privilege activities using frequency analysis. Geolocate source IPs and flag those from unusual regions or networks using descriptive statistics on source locations."
          },
          "Assignment of roles granting permissions to create or modify role bindings themselves to an account.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the payload content of Zeek http.log entries for API calls creating or modifying 'clusterrolebindings' or 'rolebindings'. Specifically look for the assignment of permissions related to the 'rbac.authorization.k8s.io' API group, particularly 'create', 'update', 'patch', 'delete' verbs on 'roles', 'clusterroles', 'rolebindings', or 'clusterrolebindings' resources. Flag accounts being granted such permissions, as this indicates a potential step in gaining or escalating control over the RBAC system itself."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]