
[
  {
    "Is the adversary using an internal proxy for Command and Control? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1090.001 - Internal Proxy": {
          "Execution of a process matching the file hash or specific name of a known internal proxy tool, or outbound connections from a suspected proxy to known malicious C2 IP addresses.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Compare the file hash of executed binaries against a threat intelligence feed of known malicious proxy tools (e.g., Stowaway, GOST). Hunt for exact process names like `htran.exe` or `zxproxy.exe`. Concurrently, analyze Zeek conn.log for outbound connections from internal hosts to IP addresses or domains on a high-confidence C2 blocklist. Inner join these two data sources to correlate known tool execution with known C2 communication."
          },
          "Execution of legitimate system utilities or scripting interpreters with command-line arguments characteristic of port forwarding, tunneling, or proxying.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments of common utilities. Use regular expression matching to identify patterns indicative of proxying or relaying, such as `netsh interface portproxy`, `plink.exe -L -R`, `ssh -L -R`, or PowerShell scripts invoking networking libraries to forward traffic. Establish a baseline of normal `netsh` or `ssh` usage via frequency analysis and alert on deviations, especially commands establishing persistent listeners or forwards to or from unusual hosts."
          },
          "Anomalous network traffic patterns, such as protocol mismatches on standard ports or a high degree of entropy in session data, indicative of tunneled or obfuscated C2 traffic.": {
            "Data": "Zeek conn.log; Zeek protocol logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections on well-known ports where the `service` field (dynamically identified protocol) does not match the destination port's standard protocol (e.g., `ssl` identified on port 135/RPC, or `unknown` on port 445/SMB). For suspicious flows, calculate the byte-level entropy of the payload; encrypted or compressed proxy traffic often exhibits high entropy. Use descriptive statistics and box-plots to find outlier connections based on their entropy values compared to normal traffic on that port."
          },
          "An internal host exhibiting network traffic patterns characteristic of a data funnel or pivot point, such as a high ratio of incoming internal connections to outgoing external connections.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to model internal traffic topology. For each host, calculate metrics such as the ratio of unique internal source IPs to unique external destination IPs over a time window. A high ratio (many-to-one) suggests data funneling. Use correlation analysis or graph theory metrics (e.g., 'betweenness centrality') to identify nodes acting as choke points that are not designated servers. Use time series analysis to detect sudden changes in these metrics for any given host, indicating its new role as a proxy."
          },
          "Establishment of new, persistent communication pathways between internal hosts or network segments that do not normally communicate, especially between user workstations or from a low-security to a high-security zone.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Generate a baseline communication matrix or graph of normal internal network traffic flows from Zeek conn.log data over a representative period (e.g., 30 days). Continuously monitor for and alert on the establishment of new, persistent connections between hosts or subnets that have a zero or near-zero historical communication frequency. Prioritize alerts for connections crossing security boundaries (e.g., workstation-to-workstation, user VLAN to server VLAN). Use linear regression to identify if a new connection's duration or data volume is growing over time, suggesting increasingly persistent use."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
