[
  {
    "Is the adversary maintaining persistence via additional cloud roles? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.003 - Additional Cloud Roles": {
          "Creation or assignment of new roles/permissions to cloud accounts, especially administrative roles.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for events related to 'CreatePolicyVersion', 'AttachUserPolicy', 'Add-AzureADGroupMember', 'Add-RoleMember', etc. Identify events where new roles or permissions are assigned. Compare assignment patterns against baseline using frequency analysis to identify unusual assignments."
          },
          "Modification of existing cloud account policies or roles to grant increased or unusual permissions.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for events related to policy or role modifications ('UpdatePolicyVersion', 'Set-AzureADUserLicense', 'Set-RoleAssignment', etc.). Analyze modifications for scope changes, addition of sensitive permissions, or changes to existing high-privilege roles. Use time series analysis to detect bursts of modification activity or modifications occurring outside normal administrative windows."
          },
          "Assignment of high-privilege roles to cloud accounts that have been inactive for an extended period or are newly created.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify cloud audit log events showing role assignments to accounts. For accounts receiving high-privilege roles, check their activity history or creation date using account management logs. Flag assignments to accounts with no recent activity (e.g., inactive for >90 days) or accounts created very recently. Use descriptive statistics to track the total number and frequency of role assignments to inactive/new accounts."
          },
          "Multiple high-privilege role assignments or modifications originating from a single valid account within a short timeframe.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate cloud audit log events for role assignments and modifications by source account within a given time window (e.g., 1 hour). Count the number of such events for each source account. Flag source accounts performing a statistically unusual number of high-privilege role assignments/modifications within the timeframe compared to their historical baseline or peer group (e.g., using IQR or setting a threshold based on typical user behavior baselines)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary escalated privileges by adding additional cloud roles? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098.003 - Additional Cloud Roles": {
          "Assignment of highly privileged administrative roles (e.g., Global Administrator, AWS Admin) to accounts.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Cloud Audit Logs for assignments of known highly privileged roles (Global Administrator, Security Administrator, Owner, Admin, etc.). Alert on any assignment to accounts not on an approved list. Use descriptive statistics to track the total number of accounts with these roles and flag deviations from the established baseline count."
          },
          "Assignment of permissions or roles that allow access to the victim tenant from external cloud accounts not owned by the organization.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for events where permissions or roles are granted to principals or accounts outside the victim tenant's primary domain/organization identifier. Cross-reference external account identifiers against internal authorized lists and threat intelligence feeds. Flag unauthorized external assignments."
          },
          "Assignment of permissions/roles that grant the ability to manage other users' roles or permissions to an account that previously lacked such privileges.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for events that grant permissions related to managing identities or access control ('iam:PutPolicy', 'iam:AttachUserPolicy', 'Microsoft.Authorization/*/write', 'Set-RoleAssignment', etc.) to existing user accounts. Compare the account's prior permissions (if baseline available) with the newly assigned ones using correlation analysis to identify transitions from low/medium privilege to high privilege management capabilities."
          },
          "Repeated access or activity from an external cloud account that was recently granted cross-tenant access via role assignment.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "After detecting a role assignment to an external cloud account (per other evidence items), monitor subsequent Cloud Audit Logs for API calls or activities originating from that external account within the victim tenant. Use correlation analysis to link the access events back to the initial role assignment event. Flag external accounts exhibiting frequent, unusual, or high-privilege activity patterns (e.g., accessing sensitive data, attempting configuration changes) using time series analysis compared to expected activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]