[
  {
    "Is the adversary maintaining persistence using additional email delegate permissions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.002 - Additional Email Delegate Permissions": {
          "Suspicious authentication attempts to email services from systems/users not typically accessing that mailbox after delegate permissions are granted.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4625, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and 4625 on mail servers/systems accessing mail services, and Zeek conn.log for connections to mail ports (e.g., 143, 993, 110, 995, 587, 465). Establish baselines for normal access sources and times per mailbox/user. Flag authentications from rare source IPs/systems or occurring outside typical patterns using statistical methods (e.g., frequency analysis, time series anomaly detection)."
          },
          "Unusually high volume of outbound email activity detected via network logs from an account or system potentially involved in granting/using delegate permissions.": {
            "Data": "Zeek conn.log, Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and smtp.log for outbound connections on mail ports (e.g., 25, 587, 465). Monitor sending volume per internal source IP or identified user account. Use statistical process control or time series analysis to detect significant increases in email sending volume compared to historical norms."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation using additional email delegate permissions? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1098.002 - Additional Email Delegate Permissions": {
          "Network connections (SMTP/IMAP/POP3) originating from unusual internal hosts or external IPs targeting internal mail servers/services, potentially indicating access after permission changes.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to internal mail server ports (e.g., 25, 143, 993, 110, 995, 587, 465). Identify connections originating from unexpected internal subnets, host types, or external IPs. Use correlation analysis to identify patterns between source IPs/ports and targets."
          },
          "Execution of commands or processes on compromised hosts potentially related to mail server interaction, credential use, or administrative cmdlet execution (like PowerShell).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event ID 4688 (Process Creation) on potentially compromised hosts or mail servers. Look for execution of suspicious processes or command lines involving mail client binaries, credential dumping tools, or administrative tools like powershell.exe with arguments related to Exchange cmdlets ('Add-MailboxPermission', etc.). Use string matching and correlation with other host/network alerts."
          }
        }
      }
    }
  }
]