[
    {
        "information_requirement": "Is the adversary using multi-hop proxy chains for command and control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command-And-Control",
        "indicators": [
            {
                "technique_id": "T1090.003",
                "name": "Multi-hop Proxy",
                "evidence": [
                    {
                        "description": "Outbound network traffic connecting to known anonymity network nodes (e.g., Tor), public proxy services, or IP addresses/domains on threat intelligence feeds associated with adversary proxy infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate Zeek conn.log connection records and Zeek dns.log queries against curated, up-to-date lists of Tor exit nodes, public proxies, and cyber threat intelligence (CTI) feeds identifying malicious proxy infrastructure. Inner join network logs with these selector lists and alert on any matches. Investigate the source host for malware or unauthorized software."
                    },
                    {
                        "description": "Use of TLS/SSL communication with characteristics matching known proxy or tunneling tools, such as self-signed certificates with default values or specific JA3/JA3S client/server fingerprints.",
                        "data_sources": [
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek ssl.log records for TLS handshake artifacts. Maintain and use a watchlist of known malicious or suspicious JA3/JA3S hashes associated with proxy tools (e.g., chisel, ligolo-ng, Cobalt Strike). Scan for self-signed certificates with suspicious or default subject/issuer fields (e.g., 'localhost', 'example.com', or random strings). Use correlation analysis to link suspicious TLS sessions with connection logs to identify the source and destination."
                    },
                    {
                        "description": "An internal host acting as a network pivot point, characterized by receiving an external connection and subsequently initiating numerous connections to other internal systems, especially using unusual encrypted traffic patterns.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssl.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log to identify internal hosts with a high 'fan-out' ratio, defined as receiving one or few inbound connections followed by many outbound connections to other internal systems. Use graph analysis to visualize traffic flows and identify central nodes indicative of pivoting. Scrutinize the protocol and port usage for these connections, flagging non-standard encrypted traffic between internal hosts. Correlate network pivot behavior with process creation events (Windows Event ID 4688) on the suspected pivot host to identify the responsible executable."
                    },
                    {
                        "description": "Repetitive, low-entropy outbound connections from an internal host to a small set of external destinations, exhibiting beaconing characteristics such as regular intervals and consistent data packet sizes, often disguised over common ports (e.g., 443).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate Zeek conn.log data by source host and analyze outbound connections over extended time periods (e.g., 24 hours). For each host, calculate the entropy of destination IPs/domains; persistently low entropy is highly suspicious. Apply time series analysis to connection timestamps to detect periodic beaconing behavior (e.g., using Fourier transforms or autocorrelation functions to find a repeating signal). Analyze connection byte counts for low variance, which is characteristic of heartbeat beacons. Use linear regression to model expected traffic and flag significant deviations."
                    },
                    {
                        "description": "Anomalous use of network protocols for tunneling or C2, such as encrypted payloads within ICMP, DNS queries used for data transfer, or traffic to network infrastructure devices that are not designated VPN gateways.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek icmp.log",
                            "Zeek weird.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek icmp.log for abnormally large ICMP packets or high-frequency ICMP traffic from a single source, which may indicate ICMP tunneling. Analyze Zeek dns.log for unusually long or high-entropy DNS queries and responses, or a high volume of TXT/NULL record queries to a single domain, which suggests DNS tunneling. Inspect Zeek weird.log for events like 'possible_split_routing' or protocol violations. Flag any non-management or non-VPN encrypted traffic directed to network infrastructure devices like routers or switches."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
