[
  {
    "Is the adversary maintaining persistence using additional email delegate permissions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.002 - Additional Email Delegate Permissions": {
          "Suspicious authentication attempts to email services from systems/users not typically accessing that mailbox after delegate permissions are granted.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and 4625 on mail servers/systems accessing mail services, and Zeek conn.log for connections to mail ports (e.g., 143, 993, 110, 995, 587, 465). Establish baselines for normal access sources and times per mailbox/user using descriptive statistics. Flag authentications from rare source IPs/systems or occurring outside typical patterns using statistical methods (e.g., frequency analysis, time series anomaly detection)."
          },
          "Unusually high volume of outbound email activity detected via network logs from an account or system potentially involved in granting/using delegate permissions.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and smtp.log for outbound connections on mail ports (e.g., 25, 587, 465). Monitor sending volume per internal source IP or identified user account. Use statistical process control or time series analysis to detect significant increases in email sending volume compared to historical norms."
          },
          "Execution of PowerShell cmdlets related to modifying mailbox permissions (e.g., Add-MailboxPermission, Add-MailboxFolderPermission).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `powershell.exe` execution. Analyze command-line arguments for the presence of Exchange Management Shell cmdlets like `Add-MailboxPermission`, `Set-MailboxPermission`, `Add-MailboxFolderPermission`, etc. Analyze Windows Event ID 4104 (PowerShell Script Block Logging) for explicit cmdlet usage and parameters (like `-AccessRights`, `-User Default`, `-User Anonymous`). Flag instances modifying permissions for sensitive mailboxes or granting broad access rights using keyword matching. Use frequency analysis to detect unusual occurrences of these cmdlets on specific servers or by specific users."
          },
          "Detection of phishing or spam-like content characteristics within outbound emails from an internal account with recently modified permissions.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log for outbound emails originating from accounts identified with modified permissions. Apply basic keyword matching or simple statistical text analysis (e.g., entropy of subject lines) to identify potential phishing or spam content characteristics. Correlate findings with sending volume data from the same source to identify accounts sending a high volume of emails with suspicious characteristics. Use correlation analysis to link suspicious emails to specific source IPs or users identified from other logs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation using additional email delegate permissions? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1098.002 - Additional Email Delegate Permissions": {
          "Network connections (SMTP/IMAP/POP3) originating from unusual internal hosts or external IPs targeting internal mail servers/services, potentially indicating access after permission changes.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to internal mail server ports (e.g., 25, 143, 993, 110, 995, 587, 465). Identify connections originating from unexpected internal subnets, host types, or external IPs. Use correlation analysis to identify patterns between source IPs/ports and targets. Baseline normal connection patterns using frequency analysis."
          },
          "Execution of commands or processes on compromised hosts potentially related to mail server interaction, credential use, or administrative cmdlet execution (like PowerShell).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event ID 4688 (Process Creation) on potentially compromised hosts or mail servers. Look for execution of suspicious processes or command lines involving mail client binaries, credential dumping tools, or administrative tools like powershell.exe with arguments related to Exchange cmdlets ('Add-MailboxPermission', etc.). Use string matching and correlation with other host/network alerts."
          },
          "Network connections to internal mail services from accounts/systems recently granted delegate permissions, followed by command execution or anomalous data transfer.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful login events (Windows Event ID 4624, potentially on mail servers) or network connections to mail services (Zeek conn.log) by accounts/systems recently identified as having modified mailbox permissions. Analyze subsequent process creation events (Windows Event ID 4688) or data transfer volumes (Zeek conn.log) from these sources. Look for execution of commands unrelated to standard email client use (e.g., data staging, credential dumping) or unusually large data transfers indicative of exfiltration after gaining access via permissions. Use correlation analysis to link these events and identify deviations from historical norms using descriptive statistics on data volume."
          },
          "Correlation of internal email sending activity (especially to sensitive targets) with accounts or systems that have recently been granted escalated mail permissions.": {
            "Data": "Zeek smtp.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify accounts or systems that have recently been identified as having modified mailbox permissions (e.g., via monitoring PowerShell cmdlets or other means). Monitor Zeek smtp.log for outbound emails originating from these sources, particularly those sent to internal recipients. Compare the recipients, subject lines, and sending volume for these emails against the account's historical sending patterns using descriptive statistics and time series analysis. Flag emails targeting sensitive individuals or exhibiting unusual patterns based on correlation analysis with permission changes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]