[
  {
    "Is the adversary maintaining persistence via additional cloud roles? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.003 - Additional Cloud Roles": {
          "Creation or assignment of new roles/permissions to cloud accounts, especially administrative roles.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for events related to 'CreatePolicyVersion', 'AttachUserPolicy', 'Add-AzureADGroupMember', 'Add-RoleMember', etc. Identify events where new roles or permissions are assigned. Compare assignment patterns against baseline using frequency analysis."
          },
          "Modification of existing cloud account policies or roles to grant increased or unusual permissions.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for events related to policy or role modifications ('UpdatePolicyVersion', 'Set-AzureADUserLicense', 'Set-RoleAssignment', etc.). Analyze modifications for scope changes, addition of sensitive permissions, or changes to existing high-privilege roles. Use time series analysis to detect bursts of modification activity."
          }
        }
      }
    }
  },
  {
    "Has the adversary escalated privileges by adding additional cloud roles? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098.003 - Additional Cloud Roles": {
          "Assignment of highly privileged administrative roles (e.g., Global Administrator, AWS Admin) to accounts.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Cloud Audit Logs for assignments of known highly privileged roles (Global Administrator, Security Administrator, Owner, Admin, etc.). Alert on any assignment to accounts not on an approved list. Use descriptive statistics to track the total number of accounts with these roles and flag deviations."
          },
          "Assignment of permissions or roles that allow access to the victim tenant from external cloud accounts not owned by the organization.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for events where permissions or roles are granted to principals or accounts outside the victim tenant's primary domain/organization identifier. Cross-reference external account identifiers against threat intelligence feeds."
          }
        }
      }
    }
  }
]