[
  {
    "Is the adversary communicating with command and control infrastructure using non-application layer protocols? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1095 - Non-Application Layer Protocol": {
          "Detection of suspicious network traffic using non-application layer protocols like ICMP, UDP, or SOCKS with unusual characteristics.": {
            "Data": "Zeek conn.log; Zeek icmp.log; Zeek udp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, icmp.log, and udp.log for connections using these protocols to external destinations. Filter for unusual byte counts, payload sizes, or patterns that deviate from normal network behavior. Use frequency analysis on connection parameters (e.g., destination port/IP, byte counts) to identify outliers."
          },
          "Identification of uncommon data flows or unexpected protocol behavior within non-application layer protocols.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek conn.log and weird.log for connections using unexpected non-application layer protocols or exhibiting anomalous data flows (e.g., unexpected sender-receiver data ratios, unusual packet content signatures in weird.log). Use correlation analysis to link these unusual flows with specific source/destination IPs or timeframes."
          },
          "ICMP traffic to external destinations containing non-standard data payloads or unusual frequency/timing.": {
            "Data": "Zeek icmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek icmp.log for connections where the 'data' field is present, has an unusual size/structure, or doesn't correspond to standard ICMP message types. Use frequency analysis on data field sizes, distinct data patterns, or the timing/frequency of ICMP messages seen in external traffic to flag outliers. Investigate external destinations receiving such ICMP traffic and its rate using time series analysis."
          },
          "Network connections using non-application layer protocols originating from processes not typically expected to establish external network connections.": {
            "Data": "Windows Event ID 5156; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection events (Windows Event ID 5156, Zeek conn.log filtered for non-application layer protocols like UDP) with process creation events (Windows Event ID 4688). Identify processes initiating these connections. Establish a baseline of common processes and their network communication patterns using descriptive statistics (frequency of connections, destination ports/protocols). Flag connections made by processes with no historical network activity or those using unexpected protocols, particularly to external IPs. Analyze process parent-child relationships from 4688 to detect suspicious origins."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]