[
  {
    "Is the adversary using removable media for command and control? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1092 - Communication Through Removable Media": {
          "Suspicious file read/write activity on removable media from processes not typically interacting with such media.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on endpoints for file access events on removable drives. Filter events by drive type (removable). Identify processes accessing files on removable media. Establish baseline processes that normally interact with removable media using frequency analysis. Flag file access by rare or unknown processes. Use time series analysis to detect unusual bursts of read/write activity on removable media."
          },
          "Execution of unusual or unknown processes triggered by the insertion or mounting of removable media.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints for process creation events correlated with removable media insertion/mounting times. Use correlation analysis to link the process creation event with a preceding removable device event (if available). Identify process names, command lines, and parent processes. Flag creation of processes with suspicious names, locations (e.g., directly on the removable drive), or those lacking digital signatures. Compare process names against a baseline of commonly executed processes using statistical methods like entropy to identify low-entropy processes."
          },
          "Creation or modification of executable files, scripts, or suspicious document types on removable media.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on endpoints for `WRITE_DATA` or `CREATE_NEW` access types on removable drives. Filter events by file extension (e.g., .exe; .dll; .hta; .js; .vbs; .docm; .xlsm; .pptm) and file path located on the removable drive. Flag creation/modification of executable or script files and macro-enabled documents. Identify the user and process performing these actions. Use frequency analysis to identify users/processes that frequently handle such file types on removable media as a baseline and flag significant deviations."
          },
          "Network connections made by processes that have recently accessed or executed from removable media.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) or file access/modification events on removable media (Windows Event ID 4663) with subsequent network connection events (Windows Event ID 5156 or Zeek conn.log) originating from the same process (using Process ID or matching process path/name). Identify destinations (IPs/domains) and ports of these connections. Flag connections to unusual or external destinations, especially if the process originated from or recently accessed suspicious files on removable media. Use correlation analysis to link specific host-based removable media activity events to outgoing network traffic."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]