[
  {
    "Is the adversary establishing persistence by adding cloud credentials? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.001 - Additional Cloud Credentials": {
          "Logs showing new credentials (keys/passwords) added to cloud Service Principals or Applications.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud provider API endpoints. Correlate with Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) logs on servers/endpoints to identify processes potentially executing cloud CLI commands (`az`, `aws`, `gcloud`) related to credential modification. Identify unusual spikes or patterns in API interaction frequency using descriptive statistics or time series analysis."
          },
          "Logs indicating creation or import of new SSH keys or Access Keys for cloud accounts/instances, especially by unexpected users.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to cloud provider API endpoints (e.g., EC2 API, IAM API). Filter for API calls potentially related to `CreateKeyPair`, `ImportKeyPair`, `CreateAccessKey`, `CreateLoginProfile`. Correlate with Windows Event ID 4688 and 5156 logs for suspect process activity originating these connections. Use time series analysis to identify unexpected credential creation events."
          },
          "Login events using newly created/imported cloud credentials from unusual source IPs or locations, or at times outside normal business hours for the associated account.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud service endpoints originating from external IPs. Correlate with logs indicating successful login attempts (Windows Event ID 4624 if applicable) associated with known or newly added cloud credentials. Geolocate source IPs and analyze login timestamps. Use descriptive statistics and percentile analysis to identify logins from rare locations or outside typical access times for the account, particularly for accounts associated with credential addition events."
          },
          "Execution of cloud CLI tools or access to cloud resources from an endpoint/server using credentials that appear to bypass expected MFA prompts.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints; Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for cloud CLI tools (e.g., `az.exe`, `aws.exe`, `gcloud.exe`) executing on endpoints/servers. Correlate execution events with Zeek conn.log entries showing connections to cloud resource endpoints. Analyze the context (user, source IP, time) of these events. While direct MFA bypass isn't visible in these logs alone, identify usage patterns that are unusual for the user or host, potentially indicating persistent access via a non-MFA method like an app password. Use correlation analysis to link CLI usage to specific users and look for recurring activity outside normal patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges by adding cloud credentials with elevated permissions? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1098.001 - Additional Cloud Credentials": {
          "Logging of cloud credential additions performed by potentially compromised user accounts or service principals with elevated privileges (e.g., Application Administrator).": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Zeek conn.log metadata (if enriched) or correlate with Windows Event ID logs (e.g., 4624 successful login, 4625 failed login) on hosts to identify the source host/user initiating cloud API calls related to credential additions. Analyze login timestamps and frequency using descriptive statistics or IQR analysis to detect unusual user activity that indicates a compromised account used to perform cloud actions with elevated privileges."
          },
          "Logs showing usage of newly added cloud credentials accessing resources or performing actions inconsistent with the supposed permissions or typical behavior of the original account/application.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify Zeek conn.log sessions and Windows Event ID logs (e.g., 4624 successful login, 4688 process creation) originating from newly identified credentials. Analyze the frequency, destination, and type of activity (e.g., access to sensitive data sources, unusual commands). Use correlation analysis to link this new, potentially privileged activity back to the credential creation events identified earlier."
          },
          "Cloud API calls related to credential creation or modification originating from accounts or systems that have permissions allowing them to modify credentials of other accounts with higher privileges than themselves.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud API endpoints indicating credential creation/modification actions (e.g., `CreateKeyPair`, `ImportKeyPair`, `CreateAccessKey`, `CreateLoginProfile`). Correlate with Windows Event ID 4688 on source hosts executing cloud CLI. Analyze the user and source system associated with these events. Compare the permissions of the source account/system to the potential permissions of the target account/principal whose credentials were modified (requires external permission context). Flag instances where a lower-privileged source modifies credentials for a higher-privileged target, indicating potential privilege escalation."
          },
          "Persistent cloud access activity originating from an account using temporary credentials (e.g., via sts:GetFederationToken) exhibiting access patterns inconsistent with the original account's baseline or current permissions.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud STS endpoints, specifically looking for `sts:GetFederationToken` API calls. Correlate with Windows Event ID 4688 on source hosts executing cloud CLI or accessing resources. Identify the source account/system generating the temporary credentials. Track subsequent cloud access activity (Zeek conn.log) originating from the same source host/IP or associated with the same user, using the temporary credentials. Analyze the frequency, destinations, and types of cloud resources accessed by these temporary credentials. Use correlation analysis to link this activity to the originating account and compare access patterns against the original account's typical behavior, flagging deviations that suggest escalated privilege usage."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]