[
  {
    "Is the adversary using multi-hop proxy chains for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1090.003 - Multi-hop Proxy": {
          "Network traffic connecting to known anonymity networks (e.g., Tor nodes) or IP addresses/domains associated with known adversary multi-hop proxy infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and dns.log for connections to known Tor exit nodes, public Tor directory authorities, or IP addresses/domains from threat intelligence feeds associated with multi-hop proxies/adversary infrastructure. Calculate the frequency of connections to such destinations and investigate highly frequent or unusual connections using frequency analysis and anomaly detection."
          },
          "Anomalous encrypted network traffic, particularly using unexpected protocols (like ICMP) or directed towards network devices (like border routers), not matching authorized VPNs.": {
            "Data": "Zeek conn.log; Zeek icmp.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and icmp.log for encrypted traffic patterns. Specifically, look for encrypted sessions using unexpected ports/protocols, especially ICMP. Examine connections terminating on network devices like border routers. Compare detected encrypted connections against approved site-to-site VPN configurations. Flag encrypted ICMP traffic for immediate investigation."
          },
          "Unusual encrypted or tunneled network traffic patterns observed between internal hosts or originating from potentially compromised internal network devices.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek weird.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ssl.log, and weird.log for encrypted traffic or 'weird' events between internal source and destination IPs. Look for unusual nested tunnel indicators in weird.log. Monitor Windows Event ID 5156 on servers/endpoints for unusual encrypted connections between internal systems. Use graph analysis to identify internal hosts acting as central nodes connecting to multiple other internal hosts via unusual traffic types. Flag encrypted traffic using protocols/ports not matching known internal services."
          },
          "Consistent connections from internal hosts to a small, fixed set of external IP addresses/domains not matching known legitimate services, potentially using common ports (80/443), indicative of persistent C2 via multi-hop proxy.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections originating from internal hosts to external IP addresses/domains. Group connections by source IP and destination IP/domain. Identify internal hosts consistently connecting to a small, fixed set of external destinations over time, especially if these destinations are not part of common legitimate services or corporate allowed lists. Use frequency analysis and time series analysis to identify these persistent communication patterns. Calculate the entropy of destination IPs/domains per internal host; a low entropy for external connections could indicate persistent C2."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]