
[
  {
    "Has the adversary gained initial access via replication through removable media? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1091 - Replication Through Removable Media": {
          "Execution of a file from removable media with a file hash matching a known malicious indicator.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon process creation (Windows Event ID 4688) where the image path is on a removable media volume, calculate or retrieve the file hash of the executable. Correlate this hash in real-time against a threat intelligence database of known malicious file hashes. Alert on any match and isolate the host pending investigation."
          },
          "Creation or execution of files commonly used for removable media replication, such as autorun.inf, LNK files pointing to scripts or executables, or files with hidden attributes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 11",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for file creation events (e.g., Sysmon Event ID 11) on removable drives, specifically flagging the creation of `autorun.inf` or `*.lnk` files. For LNK files, parse the target path to identify if it points to an executable or script on the drive. Also, monitor for process execution (Windows Event ID 4688) where the process image has hidden attributes or resides in an unusually named or hidden folder on the removable drive. Maintain and match against a pattern list of suspicious filenames and attributes associated with this technique."
          },
          "A process is launched from a removable media device immediately following its physical insertion into the system.": {
            "Data": "Windows Event ID 4688; Windows Event ID 410",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate USB device insertion events (e.g., from Microsoft-Windows-Kernel-PnP/Configuration logs, Event ID 400 for device connection and 410 for device start) with subsequent process creation events (Windows Event ID 4688) where the process image path is on the newly mounted drive letter. Use a short time window (e.g., < 1 minute) for correlation. Use descriptive statistics to baseline normal process creations post-insertion and alert on deviations or on executions from parent processes other than explorer.exe."
          },
          "A process launched from removable media performs suspicious follow-on actions, such as modifying the registry for persistence, dropping files to system directories, or attempting to contact the network.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For any process executed from a removable drive (identified via Windows Event ID 4688), track its Process ID and any child processes. Correlate this initial execution with subsequent suspicious system activities performed by that process lineage, such as registry modifications for persistence (e.g., Run keys, via Windows Event ID 4657), file creation in sensitive system directories (e.g., System32, Temp), or any outbound network connections (via Zeek conn.log). Use correlation analysis to link the initial USB execution to a chain of subsequent suspicious system events, building a risk score for the session."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary replicating or moving laterally using removable media? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1091 - Replication Through Removable Media": {
          "A file with a known malicious hash is written to a removable media device on an internal network host, staging it for lateral movement.": {
            "Data": "Windows Event ID 11",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for file creation events (e.g., Sysmon Event ID 11) on removable media drives across the environment. Upon file creation, hash the file and check the hash against a CTI database of known malware. An alert on a host writing a known malicious file to a USB drive is a strong indicator of that host being compromised and attempting to propagate."
          },
          "A host writes files to a removable drive using names or types common in self-replicating malware, such as autorun.inf, copies of itself with generic names (e.g., documents.exe), or LNK files pointing to a payload.": {
            "Data": "Windows Event ID 11; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "On internal hosts, monitor for file creation events (e.g., Sysmon Event ID 11) on removable media. Flag the creation of `autorun.inf` or `.lnk` files. Flag executable files that are written with the same hash as a currently running process on the host (self-replication). Use frequency analysis to identify hosts or users that frequently write executables or scripts to removable media, as this is unusual behavior in most environments and could indicate staging for lateral movement."
          },
          "An executable file written to a removable drive by one internal host is subsequently executed on a different internal host.": {
            "Data": "Windows Event ID 11; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Log all file creation events on removable media (e.g., Sysmon Event ID 11), capturing the file hash, source hostname, and timestamp. Separately, log all process execution events from removable media (Windows Event ID 4688), capturing the file hash, executing hostname, and timestamp. Create a high-fidelity behavioral rule that correlates these two events on the file hash. Alert when a hash written by Host_A is executed on Host_B within a plausible timeframe (e.g., 1-72 hours), as this directly observes lateral movement via removable media."
          },
          "A process executed from removable media on an internal host immediately begins network scanning or attempts to authenticate to other internal systems.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Endpoints, Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate a process creation event from a removable drive (Windows Event ID 4688) with subsequent network connection activity (Zeek conn.log) from that host. Specifically hunt for connection attempts to multiple other internal IPs on ports common for lateral movement (e.g., 445/SMB, 3389/RDP, 5985/WinRM). Correlate the Process ID with failed or successful network logons (Windows Event ID 4624, Logon Type 3) to other hosts. Use a box-plot or percentile analysis on the number of distinct internal hosts contacted within 10 minutes of execution to identify anomalous scanning behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
