[
  {
    "Is the adversary maintaining persistence using modified SSH authorized_keys? (TA0003 - Persistence)": {
      "Indicators": {
        "T1098.004 - SSH Authorized Keys": {
          "Unauthorized changes detected in user's .ssh/authorized_keys file.": {
            "Data": "Windows Event ID 4688, Zeek ssh.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation related to file modification commands (e.g., 'echo', 'tee', 'ssh-keygen -A') targeting paths matching '.ssh/authorized_keys'. Analyze command line arguments for suspicious patterns. Cross-reference with Zeek ssh.log for new keys being used shortly after modification. Use file integrity monitoring logs if available."
          },
          "Suspicious process detected modifying .ssh/authorized_keys or /etc/ssh/sshd_config files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious processes (e.g., unexpected scripts, remote execution tools) executed by unusual users/systems that attempt to modify files in paths like '.ssh/' or '/etc/ssh/'. Use frequency analysis on process names/command lines to identify rare occurrences."
          }
        }
      }
    }
  },
  {
    "Has the adversary gained elevated privileges using modified SSH authorized_keys? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1098.004 - SSH Authorized Keys": {
          "Successful SSH login as a high-privileged user (e.g., root) from an unexpected source IP or without typical authentication methods (password/MFA).": {
            "Data": "Zeek ssh.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log for successful login events to privileged accounts (e.g., root, admin) from unexpected source IPs or users not typically using SSH key authentication. Use correlation analysis to link successful logins with previous detection events (e.g., file modification alerts). Analyze login times using time series analysis to detect persistence outside normal hours."
          },
          "Unauthorized changes detected in /etc/ssh/sshd_config file.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation related to file modification commands targeting '/etc/ssh/sshd_config'. Analyze command line arguments for changes enabling `PubkeyAuthentication` or `PermitRootLogin`. Correlate with Zeek ssh.log for subsequent authentication attempts using keys or root login."
          }
        }
      }
    }
  }
]