[
    {
        "information_requirement": "Is the adversary executing malicious code by abusing native Windows APIs?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1106",
                "name": "Native API",
                "evidence": [
                    {
                        "description": "Execution of processes or loading of modules with file hashes known to be associated with malware that abuses native APIs for execution or injection.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Defender Event ID 1116"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Defender Event ID 1116 for malware detections, particularly those categorized as trojans, backdoors, or droppers known to use native API abuse. Correlate these alerts with process creation events (Windows Event ID 4688) occurring around the same time to identify the source process. Cross-reference process hashes from Event ID 4688 against a threat intelligence feed of known malicious file hashes. Alert on any matches."
                    },
                    {
                        "description": "Execution of Living-Off-the-Land Binaries (LOLBAS) with command-line patterns known to facilitate malicious native API execution, such as invoking arbitrary code from scripts or DLLs.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for suspicious usage of LOLBAS like `rundll32.exe`, `regsvr32.exe`, `mshta.exe`, and `powershell.exe`. Use regular expression matching on command lines to detect known malicious patterns, such as `rundll32.exe` invoking `javascript:` or calling unusual DLL entry points, PowerShell executing base64-encoded commands, or `regsvr32.exe` running scripts from URLs. Maintain and regularly update a list of these malicious invocation patterns."
                    },
                    {
                        "description": "A process unexpectedly opens a handle to another process with permissions sufficient for memory writing and remote thread creation, indicating potential process injection.",
                        "data_sources": [
                            "Windows Event ID 4656",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Windows Event ID 4656 (A handle to an object was requested) for `ObjectType: Process`. Analyze events where the requested `AccessList` includes permissions indicative of injection (e.g., `0x1F0FFF` for all access, `0x20` for write, `0x8` for create thread). Create a baseline of normal process interaction (e.g., debuggers, AV) and alert on deviations. Correlate the source process ID with its creation event (Windows Event ID 4688) to investigate its legitimacy. Use frequency analysis on source-target process pairs to identify rare and suspicious interactions, especially when the target is a browser, `explorer.exe`, or `lsass.exe`."
                    },
                    {
                        "description": "Creation of command-line interpreters or system utilities by anomalous parent processes, such as office productivity applications, browsers, or services that do not typically spawn shells.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Build a model of legitimate parent-child process relationships within the environment using historical Windows Event ID 4688 data. Continuously monitor for and alert on process creations that deviate from this established baseline, such as `winword.exe` or `outlook.exe` spawning `powershell.exe` or `cmd.exe`, or `services.exe` spawning a non-system process. Use descriptive statistics and frequency analysis to score the rarity of observed parent-child pairs, prioritizing the most anomalous for investigation."
                    },
                    {
                        "description": "A process, particularly one running from an unusual memory location or path, initiates suspicious network connections or performs sensitive file system activity shortly after creation.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688), especially those with unusual image paths (e.g., temp directories, appdata, or random characters), with subsequent network connections (Zeek conn.log) and file modifications (Windows Event ID 4663) made by that process ID within a short time window. Analyze the process's network behavior for connections to non-standard ports or known malicious IPs. Use time series analysis to detect unusual spikes in network or file activity following the creation of a suspicious process. Calculate the entropy of destination IPs or file paths accessed by the process to identify anomalous patterns."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
