[
  {
    "Is the adversary using external web services for command and control (one-way communication)? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1102.003 - One-Way Communication": {
          "Network connections from internal hosts to legitimate popular websites or social media platforms associated with known C2 activity or exhibiting unusual patterns (e.g., non-browser user-agents, high frequency).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to high-traffic web domains (e.g., social media, popular search engines). Filter for connections from non-browser user-agents in http.log or connections with unusual destination ports/protocols for these domains. Correlate identified connections with threat intelligence feeds for known C2 domains/IPs. Use descriptive statistics to identify users/hosts with abnormally high or unusual connection patterns (frequency, duration) to these sites."
          },
          "Outbound network connections to external web services (especially on common web ports like 80/443) with little to no return traffic volume or unexpected protocol behavior.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log entries, specifically comparing \"orig_bytes\" and \"resp_bytes\" for connections to common web ports (80, 443) with external destinations. Identify sessions where \"orig_bytes\" is significantly larger than \"resp_bytes\" (indicating potential one-way outbound data) or where \"resp_bytes\" is zero or minimal for typical request types (e.g., GET requests in http.log). Calculate byte ratios (orig/resp) and use outlier detection (e.g., box plots or IQR) to flag sessions with extreme imbalances."
          },
          "Anomalous process behavior on an endpoint initiating connections to legitimate external web services known for hosting C2, where the process is not typically associated with web browsing or such communications.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) with subsequent network connections (Windows Event ID 5156 from host, or Zeek conn.log from network) to known legitimate external web services (e.g., pastebin, specific social media domains, public code repositories). Filter for processes that are not typical browsers or known updaters. Analyze command-line arguments from Event ID 4688 for suspicious parameters or encoded content. Use frequency analysis (count of connections per process per hour/day) to identify processes making unusually frequent or regularly timed connections to these services, potentially indicative of beaconing for C2 instructions."
          },
          "Encrypted (SSL/TLS) connections to common web services showing unusual characteristics (e.g., very small request sizes, fixed interval beacons) potentially followed by distinct outbound network activity from the same host to a different destination.": {
            "Data": "Zeek ssl.log; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for connections to popular web services, noting TLS handshake details (e.g., JA3/JA3S hashes, SNI). Monitor Zeek conn.log for connection patterns like fixed interval beacons (using time series analysis on connection timestamps) or very small data packets (descriptive statistics on packet sizes) consistent with simple command retrieval. Correlate these suspicious SSL/TLS sessions (by source IP and time) with subsequent, unrelated outbound connections (Windows Event ID 5156 from host, or Zeek conn.log from network) from the same host to different, potentially less reputable, destinations within a short time window (e.g., 1-5 minutes), which might represent exfiltration or a secondary C2 channel."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]