[
  {
    "Is the adversary transferring tools or files into the network? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1105 - Ingress Tool Transfer": {
          "Creation of executable files or tools on endpoints originating from unusual or network-related processes (e.g., curl, wget, PowerShell Invoke-WebRequest).": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes like `curl`, `wget`, `powershell.exe` executing commands related to downloading files (e.g., `Invoke-WebRequest`, `IEX`). Correlate these events with network connections from these processes recorded in Zeek logs (conn.log, http.log). Identify rare combinations of process, command line, and destination IP using frequency analysis."
          },
          "Detection of uncommon data flows (upload-heavy) or connections to unusual ports/services from internal hosts.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections from internal hosts to external IPs on unusual ports or protocols (e.g., unexpected FTP connections, connections to known C2 ports). Use statistical analysis on Zeek conn.log byte counts (e.g., `orig_bytes`, `resp_bytes`) to identify sessions where the internal host (`id.orig_h`) receives significantly more data than it sends (`resp_bytes` is high relative to `orig_bytes`), particularly from external destinations (`id.resp_h` is external), potentially indicating ingress tool transfer. Use linear regression or correlation analysis to compare `orig_bytes` and `resp_bytes` for baselining and outlier detection."
          },
          "Execution of uncommon package managers (winget, yum) or utilities like finger or certutil with suspicious parameters (download, hash), or use of search-ms protocol by non-standard processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command line arguments containing suspicious keywords like `winget install`, `yum install`, `finger`, `certutil -urlcache`, `certutil -hashfile`, or `search-ms:`. Filter for execution by processes not typically associated with package management or normal user activity. Use frequency analysis to identify rare command line arguments or executables using these utilities."
          },
          "Network connections to file sharing/sync services (Dropbox, OneDrive, etc.) or suspicious SMB/remote file access protocols immediately following user execution events (e.g., opening a document).": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing connections to known cloud storage/sync services (e.g., Dropbox, OneDrive domains/IPs) or suspicious SMB (TCP 445) activity from internal hosts with recent user execution events (Windows Event ID 4688) on those hosts (e.g., opening office documents, clicking links). Use time series analysis to look for unusual connection timing or duration following user activity. Baseline normal network connections from endpoints to these services and flag deviations using frequency analysis or anomaly detection algorithms."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]