```json
[
  {
    "Is the adversary communicating with compromised systems via legitimate web services? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1102.002 - Bidirectional Communication": {
          "Network traffic to/from legitimate web services using domains, URLs, or IP addresses known to be associated with specific C2 frameworks or threat actor campaigns.": {
            "Data": "Zeek dns.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate DNS queries (Zeek dns.log), HTTP host headers and URIs (Zeek http.log), and destination IPs (Zeek conn.log) against a high-confidence cyber threat intelligence (CTI) feed of known malicious domains, URLs, and IPs used for C2 via legitimate web services (e.g., specific Pastebin URLs, public GitHub raw file URLs, known malicious accounts on cloud services). Alert on any matches and investigate the associated internal host."
          },
          "HTTP requests to legitimate web services containing specific User-Agent strings, API call structures, or URL path patterns characteristic of known malware or C2 tools.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan Zeek http.log requests to legitimate services (e.g., GitHub, Dropbox, Telegram, Slack, Pastebin). Use regular expressions to match against a maintained list of known malicious User-Agents, specific API endpoint patterns used by malware (e.g., frequent POSTs to `api.dropbox.com/2/files/upload`), or suspicious URL structures (e.g., `github.com/user/repo/raw/main/payload.ps1`). Maintain and update this list of patterns based on threat intelligence reports on malware families. Use frequency analysis to flag rare User-Agents making requests to these services."
          },
          "Anomalous data transfer patterns to legitimate web services, such as unusually high data upload volumes, high-entropy data, or beaconing-like communication frequency.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each internal host, baseline typical data transfer volume (sent/received bytes) and connection frequency to common web services. Use time series analysis on Zeek conn.log data to detect periodic, 'heartbeat' connections indicative of beaconing. Calculate the entropy of HTTP POST bodies or uploaded files; high entropy can indicate encrypted/packed C2 data. Use Inter-Quartile Range (IQR) analysis on upload/download ratios to flag sessions where an internal host sends significantly more data than it receives, which is atypical for normal web browsing."
          },
          "Network connections to legitimate web services originating from unusual, non-interactive, or unauthorized processes, especially those running with elevated privileges.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log network traffic. Identify processes communicating with legitimate web services (e.g., `powershell.exe`, `cscript.exe`, `rundll32.exe`, or unsigned executables in temporary directories). Flag connections from processes running under system accounts (e.g., NT AUTHORITY\\SYSTEM), running for unusually long durations while communicating with these services, or those not typically associated with user web browsing. Use correlation analysis to link the suspicious process creation event with the corresponding network flow."
          },
          "Hosts, particularly servers, initiating communication with legitimate web services (e.g., social media, personal cloud storage, Pastebin) that are inconsistent with their designated role or established network behavior baseline.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Categorize hosts based on their roles (e.g., Domain Controller, database server, web server, user workstation) and establish baselines of normal external web service destinations for each category. Monitor Zeek dns.log and http.log for connections from hosts in server roles—which typically have restricted and predictable outbound traffic—to domains associated with consumer-grade services like social media, chat applications, or public file sharing sites. Use frequency analysis to identify rare and suspicious host-destination pairs and investigate the purpose of the communication."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```