[
  {
    "Is the adversary communicating with compromised systems via legitimate web services? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1102.002 - Bidirectional Communication": {
          "Unusual data volume patterns in traffic to/from legitimate web services (e.g., client sending significantly more data than receiving).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for traffic to common legitimate web services (e.g., social media, cloud storage). For each session, calculate the ratio of bytes sent vs. bytes received by the client. Identify sessions with unusually high client-to-server data volume ratios using descriptive statistics, percentiles, or outlier detection methods (e.g., IQR)."
          },
          "Network connections from suspicious processes on endpoints to legitimate web services known for C2 channels.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log. Identify network connections originating from newly created or unusual processes (processes not in a known baseline or with low frequency of occurrence across endpoints) communicating with legitimate web services frequently used for C2. Investigate processes exhibiting network activity that deviates significantly from established baselines using correlation analysis."
          },
          "Access to legitimate web services (e.g., cloud storage, social media) by user accounts or endpoints with no previous history or unusual frequency/timing of such access.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate web service access patterns (frequency, time of day, data volume) for user accounts and endpoints using Zeek logs and Windows logon data (4624). Use time series analysis and descriptive statistics to identify deviations, such as access from accounts or endpoints with no prior history, or access at unusual times or frequencies. Correlate with process creation (4688) to identify the application initiating the connection."
          },
          "Suspicious request methods, patterns, or domain/URL paths used in HTTP traffic to legitimate web services commonly used for C2.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for connections to common legitimate web services. Identify and flag unusual HTTP methods (e.g., excessive PUT/POST requests to cloud storage, unexpected GET requests to user profile pages), unusual URL paths or parameters, or rapid sequences of requests. Use frequency analysis to identify rare patterns and correlation analysis to link suspicious HTTP behavior to other anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]