[
  {
    "Is the adversary using dead drop resolvers for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1102.001 - Dead Drop Resolver": {
          "Unusual volume or frequency of connections from internal hosts to legitimate external web services (e.g., social media, cloud storage) inconsistent with normal user behavior.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections to common external web services. Group traffic by source host and destination service. Calculate connection frequency and volume per host per service using descriptive statistics. Identify outliers or significant deviations from established baselines using IQR or time series analysis. Flag hosts with unusual connection patterns."
          },
          "Network connections to legitimate external web services originating from suspicious or unknown processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) on endpoints and correlate with Zeek conn.log. Identify connections to external web services originating from processes with low prevalence across the network (frequency analysis), unsigned binaries, or those located in unusual directories. Investigate suspicious process execution associated with external connections."
          },
          "Connections to legitimate external web services with unusual HTTP URI patterns, query parameters, or data transfer sizes.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for connections to known legitimate web services (social media, cloud storage, etc.). Examine the structure, length, and character entropy of requested URIs and query parameters, especially for services not typically used for large or complex requests. Use descriptive statistics (e.g., mean, standard deviation of URI length) and entropy measures to identify outliers. Correlate with Zeek conn.log to identify unusual data transfer sizes (bytes_orig, bytes_resp) associated with these sessions compared to baseline values."
          },
          "Sequential network connections where an internal host connects to a legitimate external web service followed shortly by a connection to a potentially malicious or unusual external IP address or domain.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify sequences of connections originating from the same internal host within a short time window (e.g., 60 seconds). Specifically look for a connection to a whitelisted legitimate external service (e.g., via domain name or IP) followed by a connection to an unclassified or suspicious external IP/domain (potentially identified via threat intelligence lookup). Use time series correlation or sequence analysis to identify recurring patterns of this connection sequence for internal hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]