[
  {
    "Is the adversary executing code via native API calls? (TA0002 - Execution)": {
      "Indicators": {
        "T1106 - Native API": {
          "Creation of suspicious processes or execution of commands originating from unexpected parent processes or via direct API/syscall invocation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) logs. Analyze process creation events to identify unusual parent-child process relationships (e.g., cmd.exe spawned by a desktop application like Word, powershell.exe spawned by cmd.exe with suspicious arguments). Use correlation analysis to link process creation events to prior activities like document opens or network connections identified in Zeek logs."
          },
          "Execution of processes with characteristics indicative of direct API interaction or malicious API abuse.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) logs. Identify processes with command lines or names that are commonly associated with direct API invocation or syscalls (e.g., processes attempting to execute shellcode or known malicious tools). Analyze the frequency of creation for specific process names or command line patterns. Use descriptive statistics or frequency analysis to find rare or unusual process executions."
          },
          "Suspicious network connections or file modifications originating from processes exhibiting characteristics of direct API interaction or unusual process lineage.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection events (Zeek conn.log, WinEvt 5156) and file modification events (WinEvt 4663) with process creation events (WinEvt 4688). Identify connections/modifications made by processes flagged as suspicious by other evidence (unusual parent, suspicious command line) or processes created without typical logging visibility. Analyze destination IPs/ports (network) or file paths/operations (file) for unusual patterns using frequency analysis or correlation with threat intelligence feeds."
          },
          "Attempts by unusual processes to open handles to critical system processes (e.g., lsass.exe, services.exe).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4656 logs filtering for 'Object Type:\"Process\"' and Access Mask indicating handle access. Monitor for source processes attempting to open handles to sensitive target processes (e.g., 'lsass.exe', 'services.exe', 'winlogon.exe'). Identify source processes that are not standard system utilities or security tools. Use frequency analysis or whitelisting to flag rare or unauthorized handle open attempts. Correlate with process creation events (WinEvt 4688) to understand the context and lineage of the source process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]