[
  {
    "Is the adversary using multi-stage command and control channels? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1104 - Multi-Stage Channels": {
          "Network connections from suspicious processes to rare or unusual external IP addresses or domains, potentially followed by a tool download or update.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify outbound network connections (Zeek conn.log, http.log) originating from suspicious process creations (Windows Event ID 4688). Analyze destination IPs/domains for rarity or association with known malicious infrastructure using threat intelligence feeds. Calculate frequency of connections to external destinations per process/host and flag low-frequency destinations. Check Zeek files.log for file downloads immediately following connections to suspicious destinations."
          },
          "Multiple distinct outbound network connections originating from the same host/process but connecting to different, potentially unrelated external destinations over time.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Group Zeek conn.log entries by source host and process name (correlating with Windows Event ID 4688). Analyze the distribution of distinct external destination IP addresses/domains contacted by each process over a defined time window (e.g., 24 hours). Flag processes exhibiting a high number of distinct external destinations using entropy measures on the destination IP/domain distribution or by calculating the simple count of distinct destinations and flagging outliers using descriptive statistics (e.g., IQR)."
          },
          "Outbound network connections from suspicious processes immediately followed by extensive host or network discovery activity on the local system.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 4663; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing outbound connections from suspicious processes (identified via Windows Event ID 4688 and initial analysis) with subsequent host activity (e.g., file access via 4663, network connection attempts via 5156, or common discovery command execution via 4688 command line analysis - e.g., `whoami`, `ipconfig`, `net group`, `nltest`). Use time-based correlation (e.g., discovery events within X minutes of connection) to identify discovery activities occurring shortly after the initial outbound connection. Use descriptive statistics to measure the volume and variety (entropy) of discovery events post-connection."
          },
          "A change in connection patterns (e.g., destination IP/domain, port, protocol, connection frequency) originating from the same host/process after an initial outbound connection to a potentially suspicious destination.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For processes identified making outbound connections (Windows Event ID 4688, Zeek conn.log), analyze subsequent outbound connections from the same process. Group connections by host, process, and time window. Use time series analysis or change point detection algorithms to identify significant shifts in destination IP/domain, port, protocol (e.g., from common web traffic to raw TCP), or connection frequency for a given process. Flag instances where a new, distinct connection pattern emerges after an initial suspicious connection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]