[
  {
    "Is the adversary using web services for command and control? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1102 - Web Service": {
          "Anomalous network traffic patterns to legitimate web services (e.g., high egress data relative to ingress).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections to common web services (Google, Microsoft, etc.). Calculate the ratio of bytes_sent to bytes_received for each session/connection. Identify connections where the sent/received ratio is significantly higher than the norm for that service using statistical methods (e.g., Z-score or IQR analysis) and prioritize for investigation."
          },
          "Suspicious process communicating with common web services (e.g., svchost.exe or powershell.exe connecting to legitimate cloud services without expected user activity).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log. Identify connections to common web services originating from processes known to be potentially abused (e.g., powershell.exe, cmd.exe, svchost.exe) when not expected by user activity or system function. Use correlation analysis to link process execution time/host with network connection time/host/destination and flag unusual correlations."
          },
          "Persistent or periodic connections to legitimate web services from a host or process that typically does not communicate with these services, or occurring at unusual times.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to legitimate web services. Correlate connections with Windows Event IDs 4624 (Logon/Logoff) and 4688 (Process Creation) on the source host to identify associated user session state and process name. Use time series analysis to identify periodic or persistent connections (e.g., every X minutes/hours) to web services from specific source hosts or processes. Compare connection frequency and timing against established baselines for the host/process/user using statistical methods (e.g., comparing connection times to a historical distribution, flagging low-entropy destination sets from a single source) and investigate deviations."
          },
          "Network connections to specific URLs, subdomains, or certificates of legitimate web services that have been identified as indicators of compromise (IoCs) for C2 activity.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Ingest and update threat intelligence feeds containing IoCs related to web service C2 (e.g., specific subdomains, URL paths, certificate serials used by malware). Inner join Zeek http.log (for URL paths), Zeek dns.log (for hostnames), and Zeek ssl.log (for certificate details) with active IoC lists. Flag any matches for investigation. Prioritize IoCs that are recent or associated with known adversary groups."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]