[
  {
    "Is the adversary collecting sensitive data via screen capture? (TA0009 - Collection)": {
      "Indicators": {
        "T1113 - Screen Capture": {
          "Detection of unusual processes making API calls associated with screen capturing (e.g., CopyFromScreen).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs from endpoints. Analyze process creation events for processes making known suspicious API calls related to screen capture (requires advanced logging/monitoring beyond standard 4688, or correlation with EDR data). Identify child processes spawned by suspicious parent processes. Use frequency analysis or clustering on process names and command lines to identify rare or anomalous execution patterns."
          },
          "Discovery of image files (e.g., .png, .jpg) being written to unusual locations or by unusual processes on endpoints.": {
            "Data": "Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs from endpoints. Monitor command lines for patterns indicative of saving image files (e.g., arguments with '-o' and image file extensions, or redirection to a file). Correlate these with Zeek files.log entries (if image files are written to network shares or immediately exfiltrated) showing image file creation or transfer by unusual processes or to unusual destinations. Use time series analysis to identify sudden spikes in image file creation activity on an endpoint or network segment."
          },
          "Anomalous network traffic patterns, such as exfiltration of common image file types, temporally linked to the execution of known screen capture utilities or suspicious processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek files.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of known screen capture tools (e.g., `psr.exe`, `snippingtool.exe` if used atypically) or processes identified as suspicious. Correlate these process start times (from Event ID 4688) with Zeek conn.log data for new outbound connections from the source host and Zeek files.log for transfers of image files (e.g., MIME types like `image/png`, `image/jpeg`, `image/bmp`). Apply correlation analysis to link suspicious process execution with subsequent network file exfiltration within a short time window (e.g., 1-5 minutes). Use descriptive statistics on file sizes in Zeek files.log and connection duration/byte counts in Zeek conn.log to spot unusually large or numerous image transfers."
          },
          "Execution of built-in screen capture utilities (e.g., `psr.exe`, `snippingtool.exe`) via command line with parameters indicating automation or stealth, or by non-standard parent processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for command-line execution of built-in screen capture utilities like `psr.exe` or `snippingtool.exe`. Look for specific command-line arguments that suggest automated or hidden capture (e.g., `psr.exe /start /output <filepath> /sc 1 /gui 0`, `snippingtool.exe /clip`). Baseline legitimate command-line usage. Use frequency analysis of command lines and parent process names (e.g., `cmd.exe`, `powershell.exe` vs. `explorer.exe`) to identify anomalous invocations. Alert on executions by system accounts, from script interpreters without user interaction, or from unusual parent processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]