[
  {
    "Is the adversary collecting sensitive information via email? (TA0009 - Collection)": {
      "Indicators": {
        "T1114 - Email Collection": {
          "Unusual access patterns, authentication attempts, or the presence of suspicious auto-forwarding rules on email accounts/servers.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze authentication logs (Event ID 4624/4625) and Zeek conn.log targeting mail servers. Identify access attempts from unusual source IPs or users. Calculate historical login frequency and times per user/IP; identify anomalies using descriptive statistics or deviation analysis. Look for unusual email header fields (e.g., 'X-MS-Exchange-Organization-AutoForwarded' in Zeek smtp.log/http.log) and analyze volume using time series analysis."
          },
          "Unusual process activity accessing local email files or network traffic associated with exfiltration of email data.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access to known email file locations (.pst, .ost) by unusual processes (Event ID 4688). Correlate process activity with network connections (Zeek conn.log) exhibiting high outbound data volume (use byte counts from Zeek). Use correlation analysis to link unusual file access with suspicious network flows."
          },
          "Execution of suspicious commands (e.g., PowerShell, WMI) attempting to access or enumerate local email files (.pst, .ost).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes like powershell.exe, wmiprvse.exe, or suspicious remote access tool processes executing commands containing keywords associated with email files or directories (e.g., '.pst', '.ost', 'outlook', 'mapi', 'export-mailbox'). Use correlation analysis to link specific commands with user accounts and timestamps."
          },
          "Connections to internal or external mail servers from unusual host processes, potentially combined with evidence of specific email header manipulation.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Zeek http.log; Windows Event ID 5156; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing connections to mail server ports (e.g., 25, 110, 143, 465, 587, 993, 995) or webmail HTTP/S traffic (Zeek http.log) with process creation (Event ID 4688) or network connection (Event ID 5156) logs on source hosts to identify unusual processes initiating these connections. Investigate connections originating from processes other than standard mail clients. Analyze Zeek smtp.log and http.log for the presence and volume of specific auto-forward headers ('X-MS-Exchange-Organization-AutoForwarded', 'X-MailFwdBy', 'X-Forwarded-To') associated with these unusual connections using frequency or volume anomaly detection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]