[
  {
    "Is the adversary maintaining persistence by modifying the Registry? (TA0003 - Persistence)": {
      "Indicators": {
        "T1112 - Modify Registry": {
          "Registry modifications adding/changing startup programs or service configurations.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 and 4688 on critical servers. Alert on changes to known startup Registry keys (e.g., Run, RunOnce, services) by processes other than known installers or system updates. Correlate with process creation events (4688) involving 'reg.exe', 'powershell.exe', or unusual processes modifying these keys."
          },
          "Attempts to modify Registry keys using methods like prepending null characters (Reghide).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing strings associated with hiding registry keys (e.g., null bytes, specific tools). Review Event ID 4657 (if available) for changes to keys that exhibit unusual naming patterns or lack obvious purpose. Perform periodic scans of critical registry hives using tools like Autoruns or RegDelNull to identify hidden entries not reported by standard events."
          },
          "Creation or modification of Registry values pointing to suspicious or unknown executable paths, especially in startup or service keys, potentially initiated remotely.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications or creations in critical persistence keys (e.g., Run, RunOnce, Shell, Userinit, ServiceImagePath). Extract the new binary path from the event data. Correlate with Windows Event ID 4688 to identify the process making the change and its command line. Check the binary path against known good software lists and scan for suspicious characteristics (unusual location, name, lack of signature). Use frequency analysis to identify uncommon processes modifying these keys."
          },
          "Remote Registry modifications originating from potentially compromised or unusual source systems.": {
            "Data": "Windows Event ID 4657; Windows Event ID 5156; Zeek dce_rpc.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for remote modifications. If source information is present or can be derived (e.g., via related 4624 logon event on target), identify the source system. Correlate with network connection logs (Event ID 5156 or Zeek logs like dce_rpc.log) to verify remote access attempts to the target system's registry service (e.g., via RPC). Identify remote modifications originating from systems outside the administrative subnet, systems with known vulnerabilities, or systems exhibiting other signs of compromise. Use correlation analysis to link remote login events (4624) to subsequent remote registry modifications (4657)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by modifying the Registry? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1112 - Modify Registry": {
          "Registry modifications known to disable or impair security software or logging.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of Registry keys/values known to disable or weaken security controls (e.g., disabling firewall, changing logging levels, disabling specific security features). Alert on Windows Event ID 4657 indicating modification of these specific keys/values. Correlate with process execution (4688) to identify the source."
          },
          "Registry modifications storing obfuscated payloads or configuration data in unusual keys.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to unusual or rarely modified Registry keys, especially if the value data appears encoded, encrypted, or unusually long/complex. Use entropy analysis on Registry value data from suspicious modifications to identify potentially obfuscated content. Cross-reference modified keys with known malware behaviors or C2 storage locations."
          },
          "Modification of Registry keys related to security features, system behavior, or application settings in a way that lowers security posture (e.g., macro settings, credential caching, security logging).": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a watchlist of Registry keys known to control security-relevant settings (e.g., macro security levels, credential manager behavior, audit policy configuration, Windows Defender settings). Monitor Windows Event ID 4657 for modifications to these specific keys. Alert if the new value is set to a less secure configuration. Correlate with Windows Event ID 4688 to identify the modifying process and command line. Use correlation analysis to link suspicious registry changes with subsequent suspicious process activity or network connections."
          },
          "Registry modifications in sensitive keys requiring elevated privileges, made by processes or accounts not typically associated with system administration or software installation.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4672",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications occurring in HKEY_LOCAL_MACHINE keys (requires administrator privileges) or other protected areas. Identify the account (via 4657/4624 correlation) and process (via 4688 correlation) performing the modification. Flag modifications by accounts or processes that typically run with lower privileges or are not standard system/update processes. Analyze the frequency of privileged registry modifications by user account and process to identify outliers using descriptive statistics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]