[
  {
    "Is the adversary attempting to gain access to accounts via password guessing? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1110.001 - Password Guessing": {
          "Numerous sequential failed login attempts for multiple accounts from a single source IP address or across a range of target accounts.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4625 (Failed Logon) and Zeek connection logs (conn.log filtered by authentication ports). Group failed attempts by source IP address and target account. Calculate the rate of failed attempts per source over time. Use thresholding or statistical process control (e.g., tracking the count of failures per source IP using a CUSUM chart) to identify unusually high volumes of failed logins."
          },
          "Failed login attempts targeting common management services (SSH, RDP, SMB) or specific high-value accounts.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4625 logs and Zeek connection logs (conn.log) for connections targeting known ports associated with common services (e.g., 22, 3389, 445). Analyze the distribution of target usernames from failed attempts. Use frequency analysis to identify if specific accounts or services are being repeatedly targeted from external or unexpected internal sources."
          },
          "High rate of failed login attempts targeting cloud-based services (e.g., Office 365, SSO platforms) from specific external IP addresses.": {
            "Data": "Zeek conn.log; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to known IP ranges or domains of cloud services (e.g., login.microsoftonline.com). Correlate with Windows Event ID 4625 from ADFS servers if applicable for federated authentication failures. Calculate the rate of failed login attempts (inferred from repeated connections to login endpoints or specific failure event codes if available) per source IP. Use time series analysis or percentile-based alerting on the failure rate from distinct IPs to detect password guessing against cloud accounts."
          },
          "Increase in account lockout events (e.g., Windows Event ID 4740) potentially preceded by multiple failed login attempts (Windows Event ID 4625) for the affected accounts.": {
            "Data": "Windows Event ID 4740; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for Windows Event ID 4740 (A user account was locked out). For each lockout event, correlate with preceding Windows Event ID 4625 (failed logon) for the same target account and originating workstation/source IP within a defined time window (e.g., 15 minutes). Calculate the frequency of account lockouts over time. Use descriptive statistics (e.g., mean, standard deviation of lockout events per hour/day) and set thresholds based on historical data (e.g., using IQR or 3-sigma rule) to detect unusual spikes in account lockouts. Analyze the source IPs associated with the failed logins leading to lockouts for patterns (e.g., single source IP locking out multiple accounts)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]