[
  {
    "Has the adversary collected sensitive data via local email files? (TA0009 - Collection)": {
      "Indicators": {
        "T1114.001 - Local Email Collection": {
          "Unusual process execution or command-line arguments indicating attempts to access or copy email files (.ost, .pst).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation with command-line arguments containing paths to Outlook data files (.ost, .pst). Identify processes accessing these files that are not typical applications (e.g., outlook.exe, searchindexer.exe). Calculate frequency of processes accessing these files and identify rare or never-before-seen processes using statistical methods (e.g., frequency analysis, outlier detection)."
          },
          "Suspicious access, copying, or modification of local Outlook data files (.ost, .pst) by non-standard processes.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 (Handle Operation - if auditing is configured for email file paths) or other relevant host logs for read/write/copy operations on files ending in .ost or .pst. Correlate file access events with suspicious processes identified in Windows Event ID 4688. Analyze access patterns over time using time series analysis to detect unusual spikes in file activity."
          },
          "Outbound network connections from processes that recently accessed local email files, potentially indicating exfiltration.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) showing processes accessing .ost/.pst files with subsequent Windows Event ID 5156 (network connection) on the same host and Zeek conn.log entries for outbound connections. Identify outbound connections to unusual or external destinations. Use time series analysis on network traffic volume from hosts where email files were accessed to detect spikes indicative of bulk exfiltration."
          },
          "Execution of system management tools (PowerShell, WMI) with command-line arguments or scripts referencing local email file paths (.ost, .pst).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of `powershell.exe`, `pwsh.exe`, or WMI-related processes (e.g., `WmiPrvSE.exe`) with command-line arguments containing paths to .ost or .pst files, or commands like `Copy-Item`, `Get-ChildItem`, `Invoke-WmiMethod` targeting such files/paths. Analyze command-line patterns using frequency analysis to identify uncommon or suspicious usage of these tools by specific users or hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]