[
  {
    "Is the adversary collecting sensitive information via email forwarding rules? (TA0009 - Collection)": {
      "Indicators": {
        "Unusual network connections indicative of outbound email forwarding traffic from internal systems to external mail servers.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek conn.log for connections originating from internal mail server IPs or a large number of internal hosts to external mail server ports (25, 587, 465). Identify destinations not matching known/approved external mail services. Use time series analysis and statistical methods (e.g., z-score, IQR) to detect unusual spikes in outbound email connection volume or destinations."
        },
        "Suspicious process activity on mail servers or user endpoints potentially related to accessing or manipulating email rules.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 (Process Creation) on mail servers and key endpoints. Look for suspicious processes accessing email client configuration files, registry keys related to email rules, or using MAPI-related functions, particularly if executed by unusual accounts or at unusual times. Correlate process activity with login events (4624)."
        },
        "Presence of specific email headers indicating automatic forwarding (e.g., X-MS-Exchange-Organization-AutoForwarded) in mail traffic logs.": {
          "Data": "Zeek smtp.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek smtp.log for records where the 'header_fields' set contains specific auto-forwarding header names such as 'X-MS-Exchange-Organization-AutoForwarded', 'X-MailFwdBy', or 'X-Forwarded-To'. Count the frequency of these headers per sender/recipient. Use frequency analysis to detect sudden increases in occurrences or occurrences for users not expected to have forwarding rules."
        },
        "Anomalous volume of emails containing auto-forwarding headers associated with a mailbox.": {
          "Data": "Zeek smtp.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek smtp.log. Count emails containing auto-forwarding headers per user/mailbox over time. Use time series analysis or statistical tests (e.g., detecting outliers or sudden shifts in mean/variance) to flag mailboxes exhibiting unusually high volumes of auto-forwarded emails compared to a baseline or organizational norms."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]