```json
[
  {
    "Is the adversary collecting clipboard data? (TA0009 - Collection)": {
      "Indicators": {
        "T1115 - Clipboard Data": {
          "Execution of processes with file hashes known to be associated with malware that performs clipboard data collection.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Windows Event ID 4688 for all process creation events. Extract the file hash (e.g., SHA256) of the new process executable. Correlate this hash against a continuously updated threat intelligence feed of known malware hashes, specifically flagging hashes tagged with 'clipboard collection' or 'T1115' capabilities. An alert on a hash match is a high-confidence indicator of compromise."
          },
          "Command-line execution patterns involving the piping or redirection of clipboard data to another utility, especially for file writing or network transmission.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 command lines using regular expressions to detect patterns where clipboard utility output is piped or redirected. Look for command chains like 'Get-Clipboard | Out-File ...', 'clip.exe | nc.exe ...', or similar constructs involving `powershell -c \"Get-Clipboard\"`. Flag any such command chain for review, as this pattern is a common and reliable indicator of clipboard data being staged or exfiltrated."
          },
          "Legitimate clipboard utilities (e.g., clip.exe, Get-Clipboard) executed by an unusual parent process, in an abnormal user context, or as part of a suspicious script.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of 'clip.exe' or 'powershell.exe' containing 'Get-Clipboard'. Profile normal parent processes (e.g., explorer.exe, cmd.exe). Alert when the parent process is unexpected (e.g., services.exe, a web server process like w3wp.exe, wmic.exe). Use descriptive statistics to baseline normal user context and flag executions by SYSTEM/Network Service accounts or outside of interactive sessions (e.g., Logon ID 0x3e7). Analyze the full command line for signs of obfuscation or embedding within a larger malicious script."
          },
          "Anomalous, repeated execution of clipboard access commands by the same process or user, indicating clipboard polling or scraping activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Using Windows Event ID 4688 logs, monitor the execution frequency of clipboard utilities ('clip.exe', 'Get-Clipboard') grouped by user and parent process over a sliding time window. Establish a baseline for normal execution frequency for interactive users. Use time series analysis or statistical thresholds (e.g., >5 executions in 60 seconds) to detect abnormal, repetitive polling behavior. An Inter-Quartile Range (IQR) or box-plot analysis of execution counts per user/process over time can effectively identify outliers indicative of automated scraping."
          },
          "A process known to access the clipboard initiates an outbound network connection shortly after execution, suggesting immediate data exfiltration.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection rule that correlates events in a short time window (e.g., 5-30 seconds). The rule should trigger on a sequence of: 1) A process creation event (Windows Event ID 4688) with a command line indicating clipboard access ('clip.exe', 'Get-Clipboard'). 2) An outbound network connection (Zeek conn.log) originating from the same host. Correlate the destination IP from Zeek logs with threat intelligence feeds. Use correlation analysis to determine the frequency of this combined behavior per host to find anomalies and potential exfiltration channels."
          },
          "Execution of a suspicious process (e.g., unsigned, running from a temporary directory, low prevalence) followed by data being written to a staging file or sent over the network.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify suspicious processes using characteristics from Windows Event ID 4688 (e.g., unsigned, abnormal path like %TEMP% or %APPDATA%, low prevalence across the enterprise). For these flagged processes, hunt for subsequent activity within minutes: 1) File creation/modification events (Windows Event ID 4663, if file auditing is enabled) in common staging directories. 2) Outbound network connections (Zeek conn.log) to non-standard ports or untrusted destinations. Correlating these events provides strong behavioral evidence that a suspicious process is collecting and staging/exfiltrating data, which may include clipboard contents."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```