
[
  {
    "Is the adversary maintaining persistence by modifying the Registry? (TA0003 - Persistence)": {
      "Indicators": {
        "T1112 - Modify Registry": {
          "A known malicious executable path, command-line argument, or CLSID is written to a registry key commonly used for persistence.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to common persistence keys (e.g., Run, RunOnce, Services, Shell, Userinit, COM In-proc server keys). Extract the new value written to the key. Compare this value against a high-fidelity threat intelligence feed of known-bad file paths, command-lines, and CLSIDs specifically associated with malware persistence. Trigger a high-severity alert on any exact match."
          },
          "Command-line execution of a registry utility (`reg.exe`) to add or modify a common persistence key, or use of known techniques to hide registry keys.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line execution of `reg.exe add` or `reg.exe import` targeting known persistence locations (e.g., `HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run`). Correlate these process events with registry modification events (4657) for confirmation. Also, monitor for command-line patterns associated with tools like Reghide that embed null characters to hide keys from standard tools. Use regular expression matching on command lines to detect these specific patterns of abuse."
          },
          "A process not typically associated with software installation or system administration modifies a registry key used for persistence.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of common processes (e.g., `msiexec.exe`, `setup.exe`, `svchost.exe` under specific parent processes) that legitimately modify persistence-related registry keys. Monitor Windows Event ID 4657 and correlate with the modifying process name from Event ID 4688. Flag modifications made by unusual processes (e.g., `powershell.exe`, `rundll32.exe`, `cscript.exe`, or common user-level applications like browsers and document readers). Use frequency analysis on process names modifying these keys to identify rare and suspicious outliers."
          },
          "Remote modification of a persistence-related registry key, especially from a non-administrative workstation or an unusual source IP.": {
            "Data": "Windows Event ID 4657; Windows Event ID 5145; Zeek dce_rpc.log; Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for network connections to the remote registry service (e.g., via the `winreg` named pipe over SMB, detectable in Windows Event ID 5145 or Zeek dce_rpc.log). Correlate these network events with registry modification events (Windows Event ID 4657) on the target server. Investigate any remote modifications originating from IP addresses outside of designated administrative subnets or from workstations instead of dedicated management servers. Use correlation analysis to link a remote logon event (Windows Event ID 4624, Logon Type 3 or 10) to subsequent remote registry modifications made during that session."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses by modifying the Registry? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1112 - Modify Registry": {
          "A specific registry key and value known to be used by a particular malware family to disable a security feature is modified.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications. Maintain and reference a high-confidence list of specific registry key-value pairs associated with known malware or APT TTPs for disabling defenses (e.g., `HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\DisableAntiSpyware` set to `0x1`, or a specific value used by Emotet to tamper with security services). Trigger a high-severity alert on an exact match of the key, value name, and data."
          },
          "Modification of any registry key associated with security tools (AV, EDR, firewall), logging services (Sysmon, Event Tracing), or common security policies to a less-secure state.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a broader watchlist of registry keys known to control security tool configurations, logging levels, or system security policies (e.g., `HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender`, `HKLM\\System\\CurrentControlSet\\Control\\Lsa\\`, `HKLM\\SYSTEM\\CurrentControlSet\\Services\\EventLog\\`). Monitor Windows Event ID 4657 for any modification to these keys. For each key, define the 'insecure' value(s) or states. Alert when a modification results in one of these insecure configurations. Correlate with the modifying process (Event ID 4688) to provide context."
          },
          "A large binary payload or script is written to an arbitrary registry key, especially if the data exhibits high entropy, suggesting obfuscation or encryption.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for 'Set Value' operations where the new value's data size is unusually large (e.g., > 1024 bytes). For these events, calculate the Shannon entropy of the written data. Flag modifications that have both a large size and high entropy (e.g., > 6.0 for ASCII, > 7.0 for binary), as this indicates non-textual, potentially encrypted or compressed data being stored for later execution. Use descriptive statistics to baseline normal registry value sizes and entropy levels per key path to reduce false positives."
          },
          "A rapid sequence of registry modifications occurs, targeting multiple different security features, followed by suspicious process or network activity.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate multiple security-related registry modification events (Windows Event ID 4657 on keys from the security watchlist) occurring on the same host from the same process within a short time window (e.g., < 60 seconds). Create a composite alert for this 'defense disabling swarm' behavior. Further correlate this activity with subsequent suspicious process creation (e.g., Event ID 4688 showing `powershell.exe` with a Base64-encoded command) or new external network connections (Zeek conn.log) from the host, which may indicate the start of the adversary's primary objective after evading defenses."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
