[
  {
    "Is the adversary collecting sensitive information from email services? (TA0009 - Collection)": {
      "Indicators": {
        "T1114.002 - Remote Email Collection": {
          "Unusual login activity to email services (Exchange, O365, G-Suite) from abnormal locations or IP addresses not previously associated with the user.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (Successful Login) and 4625 (Failed Login) on servers hosting email services or authentication points. Correlate logins with Zeek conn.log for external access. Geolocate source IPs. Compare login locations/times to historical data for each user/account using descriptive statistics to identify deviations (e.g., new locations, times outside normal work hours). Calculate frequency of logins from unusual locations and flag low-frequency events."
          },
          "Access patterns to email services indicating bulk collection or targeting specific sensitive mailboxes (e.g., large number of emails accessed rapidly, searches for sensitive keywords).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to known email service ports/protocols (e.g., IMAP, POP3, EWS, MAPI, HTTPS to O365/G-Suite domains). Measure connection volume (bytes transferred, number of sessions) per source IP/user over time. Use time series analysis or anomaly detection (e.g., Z-score) to identify bursts of activity or unusually high data transfer volumes potentially indicative of bulk collection. Correlate with login events if possible."
          },
          "Successful logins by privileged or high-value accounts from statistically unusual locations or times.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful logins (Windows Event ID 4624, Zeek conn.log for external email protocols) for privileged or high-value accounts. Compare source IPs and timestamps to historical data for those accounts. Flag logins from locations or times statistically outside the norm (e.g., >2 standard deviations from mean login time or occurring during low-frequency periods). Investigate subsequent connection patterns (bytes/sessions in Zeek conn.log) for signs of rapid data transfer or access to multiple email accounts following flagged logins."
          },
          "Network traffic patterns consistent with automated email search or targeted mailbox access.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to email services targeting high-value mailboxes. Measure connection frequency, duration, and bytes transferred per session/user over time. Use statistical analysis (e.g., correlation analysis between connection frequency/duration and target mailboxes, time series analysis of connection volume) to detect patterns indicative of automated tools (e.g., rapid, sequential access to multiple mailboxes, high session count without high data transfer) or targeted searches."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]