[
    {
        "information_requirement": "Is the adversary collecting sensitive information via email?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1114",
                "name": "Email Collection",
                "evidence": [
                    {
                        "description": "Detection of email auto-forwarding to known malicious external domains/email addresses or using specific suspicious header values indicative of unauthorized forwarding.",
                        "data_sources": [
                            "Zeek smtp.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek smtp.log for email headers commonly associated with auto-forwarding (e.g., `X-MS-Exchange-Organization-AutoForwarded:true`, `X-Forwarded-To`, `X-MailFwdBy`, `Resent-To`). Extract recipient addresses from these forwarded emails. Cross-reference these recipient domains/addresses against a threat intelligence feed of known malicious entities. Alert on emails forwarded to suspicious destinations. For webmail, monitor Zeek http.log for POST requests indicative of mail rule creation/modification where parameters (like forwarding address) are visible and match known malicious patterns or destinations."
                    },
                    {
                        "description": "Execution of specific command-line utilities or scripts (e.g., PowerShell cmdlets like Search-Mailbox, New-MailboxExportRequest) known to be used for programmatic email access, collection, or export.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) logs for command-line arguments of processes such as `powershell.exe`. Specifically look for execution of PowerShell cmdlets like `Search-Mailbox`, `New-MailboxExportRequest`, `Get-MailboxFolderStatistics`, or scripts invoking MAPI interfaces or accessing email-related keywords ('.pst', '.ost', 'outlook', 'Exchange Web Services'). Maintain a library of suspicious command patterns associated with email collection. Use correlation analysis to link command execution with user context, parent process, and time of day; employ frequency analysis to identify rare or anomalous command usage patterns."
                    },
                    {
                        "description": "Use of known email collection tools or scripts, or the creation/staging of email archive files (.pst, .zip, .eml collections) with common attacker naming conventions or in unusual locations.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for execution of processes matching names, hashes, or characteristic behaviors of known email collection tools (e.g., MailSniper, Mimikatz for credential theft leading to email access). Monitor Windows Event ID 4663 (Object Access) for processes creating or accessing files with extensions like .pst, .ost, .zip, .rar, .eml in atypical user directories, temp folders, or staging locations, especially if created by non-standard email clients or scripts. Analyze Zeek files.log for network transfer of such archive files. Maintain and use a watchlist of suspicious tool names/hashes and common attacker-used archive naming conventions (e.g., 'emails_backup.zip', 'archive.pst')."
                    },
                    {
                        "description": "Anomalous login patterns to email services or unusual modifications to mailbox rules, such as new auto-forwarding rules to external addresses detected through volume or configuration changes.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4625",
                            "Zeek conn.log",
                            "Zeek smtp.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze mail server authentication logs (e.g., Windows Event ID 4624 for success, 4625 for failure on Exchange servers) and network traffic to mail services (Zeek conn.log for TCP/IP sessions, Zeek smtp.log for SMTP commands, Zeek http.log for webmail). Establish baselines for user login behavior (source IP, geolocation, time-of-day, frequency, user-agent/client type). Use statistical methods (IQR, Z-score, percentile analysis) to detect anomalous login attempts or successful logins. Monitor mail server audit logs or email headers (e.g., `X-MS-Exchange-Organization-AutoForwarded:true`) for newly created or modified auto-forwarding rules, especially those forwarding to external domains or impacting a large volume of mail. Use time series analysis to detect sudden spikes in the volume of auto-forwarded emails per user or unusual rule creation activity."
                    },
                    {
                        "description": "Unusual process activity involving access to local email data stores (.pst, .ost files) correlated with subsequent anomalous outbound network traffic, suggesting exfiltration.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4663 (Object Access) for attempts to read local email data stores (e.g., .pst, .ost files, specific mail client database directories) by processes not typically associated with legitimate email clients or backup software (identified via Windows Event ID 4688 process creation events). Correlate these file access events (timestamp, process ID, user) with subsequent outbound network connections from the same host/process using Zeek conn.log (for connection details) and Zeek files.log (for file transfer specifics). Profile normal outbound data transfer patterns for users/hosts; use descriptive statistics (e.g., mean, median, standard deviation of data volume per connection/time window) and regression analysis to identify unusually large data transfers or transfers to new/suspicious destinations that coincide with suspicious email file access."
                    },
                    {
                        "description": "Anomalous network connections to mail servers initiated by non-standard email client processes, from unexpected internal systems, or exhibiting unusual communication protocols/patterns.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek smtp.log",
                            "Windows Event ID 5156",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 5156 (Network Connection) and Zeek conn.log for network connections to internal or external mail server IP addresses and associated ports (e.g., SMTP 25/587, IMAP 143/993, POP3 110/995, MAPI, HTTPS for webmail). Correlate these connections with the initiating process identified via Windows Event ID 4688 or the process name in Event ID 5156. Maintain a baseline of legitimate processes that interact with mail servers (e.g., outlook.exe, thunderbird.exe, legitimate mobile sync clients). Alert on mail server connections from processes not on this baseline, or from servers/endpoints that do not typically initiate such connections. Analyze Zeek smtp.log for unusual command sequences or deviations from standard SMTP protocol usage originating from these anomalous processes. Use entropy measures on the diversity of processes connecting to mail servers from a given host to spot anomalies."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
