
[
  {
    "Is the adversary collecting sensitive information via email forwarding rules? (TA0009 - Collection)": {
      "Indicators": {
        "T1114.003 - Email Forwarding Rule": {
          "Outbound email traffic forwarded to recipient domains or IP addresses known to be malicious or not on an approved list of external partners.": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "From Zeek smtp.log, extract all recipient domains and addresses from emails containing forwarding headers (e.g., 'X-Forwarded-To'). From Zeek conn.log, extract destination IPs for all outbound SMTP traffic (ports 25, 465, 587). Inner join these domains and IPs against a high-confidence threat intelligence feed of known malicious infrastructure. Also, compare against an allow-list of approved business partner domains. Alert on any matches."
          },
          "Execution of commands or scripts on mail servers or endpoints known to create or modify email forwarding rules, especially with suspicious parameters targeting external addresses.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor PowerShell script block logs (Event ID 4104) and process creation logs (Event ID 4688) for the execution of mail-related PowerShell cmdlets like 'Set-InboxRule' and 'New-InboxRule'. Scrutinize command-line arguments for parameters such as '-ForwardTo', '-ForwardAsAttachmentTo', or '-RedirectTo' that specify external email addresses. Use correlation analysis to flag executions performed by unusual user accounts, at odd hours, or immediately following a suspicious login event."
          },
          "Anomalous creation of a new email forwarding rule or a significant deviation in the volume or destination of forwarded emails from a user's established baseline.": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal email forwarding activity for each user and the organization, considering volume, frequency, and typical external destinations. Analyze Zeek smtp.log for forwarding headers and Zeek conn.log for SMTP connections. Use time series analysis to detect sudden spikes in the volume of forwarded emails from a specific user. Use frequency analysis and descriptive statistics to identify new or rare external forwarding destinations not present in the historical baseline. Alert on users who suddenly enable forwarding for the first time or whose forwarding volume deviates significantly (e.g., >3 standard deviations using a Z-score) from their norm."
          },
          "Suspicious process activity on endpoints related to direct, non-standard manipulation of email client files or registry keys associated with email rules.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) where non-standard processes (e.g., cmd.exe, cscript.exe, rundll32.exe) access Outlook Profile files (.PST, .OST), MAPI files, or registry keys under 'HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\<version>\\Outlook\\Profiles'. Such behavior is anomalous as rules are typically managed by outlook.exe or PowerShell. Correlate this activity with network connections to external hosts, which could indicate a malicious script or tool setting a forwarding rule."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
