[
  {
    "Is the adversary collecting clipboard data? (TA0009 - Collection)": {
      "Indicators": {
        "T1115 - Clipboard Data": {
          "Execution of legitimate clipboard access commands (e.g., clip.exe, Get-Clipboard, pbpaste) by unusual processes or users.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Filter for command lines containing 'clip.exe', 'Get-Clipboard', or 'pbpaste'. Analyze the parent process, user account, and execution path. Identify executions by system processes or users that do not typically run these commands, or executions occurring in unusual directories. Use descriptive statistics to profile normal command execution times and users."
          },
          "Suspicious process accessing the clipboard API directly, particularly non-standard or unsigned executables.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creations. Identify processes with suspicious characteristics (e.g., unsigned executables, processes running from temporary directories or unusual paths, processes with low prevalence). Correlate these processes with any potential indicators of direct clipboard access (via other logs if available) or simply flag the suspicious process for deeper inspection based on its characteristics (e.g., using prevalence analysis)."
          },
          "Outbound network connections immediately following the execution of a process known or suspected of accessing clipboard data.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) logs for processes suspected of clipboard access (based on name, path, or previous alerts) with Windows Event ID 5156 (network connection) events from the same process occurring within a short time window (e.g., 30 seconds). Filter Zeek conn.log for outbound connections originating from the host where the suspect process ran, matching the connection details from 5156. Analyze destination IPs and ports for unusual patterns or connections to known C2 infrastructure using correlation analysis with threat intelligence feeds."
          },
          "Repeated execution of clipboard access commands (clip.exe, Get-Clipboard, pbpaste) by the same process or user within a short timeframe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Filter for command lines containing 'clip.exe', 'Get-Clipboard', or 'pbpaste'. Use time series analysis or simple frequency counting to identify instances where the same command is executed multiple times by the same process/user within an unusual time window (e.g., >5 times in 60 seconds). Establish a baseline frequency for these commands by user/process and flag deviations using statistical measures like standard deviation or IQR."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]