```json
[
  {
    "Has the adversary obtained valid credentials through password cracking? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1110.002 - Password Cracking": {
          "Presence of known password cracking utilities or their associated files on network systems, identified by file hashes or specific filenames.": {
            "Data": "Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the transfer of executables or archives over the network (Zeek files.log) or the execution of new processes (Windows Event ID 4688) with filenames or file hashes that match a curated list of known password cracking tools (e.g., Hashcat, John the Ripper, L0phtCrack) and their associated libraries. Maintain and regularly update this list of selectors. Alert on any matches."
          },
          "Command-line execution patterns consistent with the use of credential dumping tools used to acquire password hashes for offline cracking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor command-line process auditing (Windows Event ID 4688). Use regular expressions to search for command-line arguments specific to credential dumping tools, such as Mimikatz commands (`sekurlsa::logonpasswords`, `lsadump::sam`), or `ntdsutil.exe` commands used to create copies of the NTDS.dit database (e.g., `ntdsutil 'ac i ntds' 'ifm' 'create full C:\\temp' q q`). Correlate these events with subsequent unusual network activity from the host."
          },
          "Suspicious process access to the Local Security Authority Subsystem Service (LSASS) memory or direct access to files known to store password hashes (e.g., SAM, NTDS.dit).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for object access events. Specifically, look for Windows Event ID 4656 or 4663 indicating a process (e.g., `rundll32.exe`, `powershell.exe`, or any non-system process) accessing the LSASS process, especially with access masks indicating read permissions (e.g., `0x1010`, `0x1410`, `0x1F0FFF`). Also, monitor for access (Event ID 4663) to sensitive files like `C:\\Windows\\System32\\config\\SAM` or `C:\\Windows\\NTDS\\ntds.dit`. Use frequency analysis to establish a baseline of normal access and identify rare process-object access pairs."
          },
          "Anomalous first-time successful login for an account from a new source, without any preceding failed login attempts, suggesting a previously unknown password was used.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze successful login events (Windows Event ID 4624), especially for administrative or high-value accounts. For each account, maintain a baseline of typical source hosts and geolocations. Flag a successful login as highly suspicious if it originates from a source IP/hostname never before seen for that user AND there are zero preceding failed login attempts (Windows Event ID 4625) from that source for that user in a recent time window (e.g., 24 hours). This pattern suggests the adversary already possessed the correct password, a likely outcome of successful offline cracking. Use descriptive statistics and frequency analysis to define 'rare' or 'new' sources."
          },
          "A sequence of events involving the exfiltration of files containing password hashes (e.g., NTDS.dit, SAM backup), followed by a successful login using an associated account from an unusual source.": {
            "Data": "Zeek files.log; Zeek conn.log; Windows Event ID 4663; Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use correlation analysis to link a sequence of suspicious events across multiple data sources. First, identify anomalous access to or creation of hash database files (Windows Event ID 4663 on SAM/NTDS.dit, or creation of backups). Second, monitor Zeek files.log or conn.log for large or unusual outbound transfers from the same server, potentially containing these files. Third, within a subsequent time window (e.g., 1-72 hours), monitor for a successful login (Windows Event ID 4624) for an account within that domain originating from a new or rare external IP address. A positive correlation across these three steps provides a high-confidence indicator of credential compromise via offline cracking."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```