[
  {
    "Is the adversary collecting data from the network or systems using automated techniques? (TA0009 - Collection)": {
      "Indicators": {
        "T1119 - Automated Collection": {
          "Detection of unusual process accessing multiple files in rapid succession across different directories, potentially followed by copy operations.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (if configured) and 4663 (if configured, e.g., via Sysmon) for file access events. Identify processes accessing a high number of unique files within a short time window across diverse paths. Use descriptive statistics (e.g., count, rate per minute) and outlier detection (e.g., IQR, standard deviation) on file access counts per process over time. Correlate with process creation (Event ID 4688) and file copy commands observed in command line arguments."
          },
          "Execution of command-line tools or scripts (PowerShell, WMI) performing file discovery or data exfiltration commands.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (process creation) and 4104 (PowerShell script block logging) for suspicious command-line arguments or script content related to file discovery (`dir`, `find`, `ls`), compression (`zip`, `tar`, `Compress-Archive`), or transfer (`copy`, `xcopy`, `robocopy`, `Invoke-WebRequest`). Look for entropy increases in command-line arguments that might indicate obfuscation. Use correlation analysis to link script execution with subsequent file access or network connection events (Zeek conn.log)."
          },
          "Unusual increase in outbound network data volume from a host or set of hosts following file access or scripting activity associated with collection.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log (bytes_sent) and http.log (response_body_len) for each internal host. Establish baseline outbound data volume patterns using descriptive statistics and time series analysis. Flag hosts exhibiting statistically significant deviations (e.g., exceeding 3 standard deviations or 95th percentile) in outbound data volume, particularly when correlated temporally with host activity such as high file access counts (Windows Event ID 4656) or execution of scripting/collection tools (Windows Event ID 4688)."
          },
          "Detection of sequential file access across multiple directories on a host followed by data aggregation into a single file or archive.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event IDs 4656 (handle requested, if configured for file reads) and 4663 (object accessed, if configured for file reads) by process and timestamp. Identify sequences where a single process accesses a high number of unique files in different directories within a short period (e.g., using time windowing). Correlate these sequences with subsequent file write events (4663) creating a single large file or with process creation events (4688) executing archive/compression tools (e.g., `zip`, `tar`) or copying utilities (`copy`, `xcopy`) targeting a specific output file/directory. Use correlation analysis to chain these events together and identify the staging file/location."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]