[
  {
    "Has the adversary obtained valid credentials through password cracking? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1110.002 - Password Cracking": {
          "Detection of techniques often used to acquire password hashes, such as OS Credential Dumping (e.g., Mimikatz activity, LSASS access).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4648",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs for process creation (4688) of known credential dumping tools or suspicious processes accessing sensitive processes like LSASS (4656/4663). Correlate explicit credential logons (4648) with suspicious processes or sources. Identify rare process/access patterns using frequency analysis."
          },
          "Anomalous successful logins or access attempts using accounts suspected of being targeted, possibly from unusual sources or involving excessive failed attempts followed by success.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 (successful logins) and 4625 (failed logins) for accounts suspected of being targeted for cracking. Look for bursts of failed logins followed shortly by a successful login for the same account. Analyze source IP addresses for successful logins for anomalies using geolocation and frequency analysis. Correlate successful logins with network activity (Zeek conn.log) from the corresponding hosts/users."
          },
          "Access or exfiltration attempts targeting systems or repositories known to contain hashed credentials (e.g., configuration files, databases).": {
            "Data": "Windows Event ID 4663; Zeek fileinfo.log; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access attempts to configuration files or databases containing credentials on known servers. Filter Zeek fileinfo.log for suspicious file accesses or transfers from these servers. Analyze Zeek conn.log for outbound connections (potential exfiltration) from these servers to unusual destinations using descriptive statistics for data volume. Use correlation analysis to link file access/transfer events with suspicious network connections."
          },
          "High volume of failed authentication attempts across multiple accounts originating from a limited set of external or internal sources.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4625 by source IP address and username. Identify source IPs exhibiting a high rate of failed login attempts across a large number of unique usernames (credential stuffing) or a high rate of failed login attempts for a small number of usernames from many source IPs (password spray). Use statistical thresholds (e.g., attempts per minute/hour exceeding historical baseline via time series analysis or simple counts) to flag suspicious sources/accounts. Correlate source IPs with Zeek conn.log to identify associated network traffic."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]