[
  {
    "Is the adversary maintaining persistence by modifying the Registry? (TA0003 - Persistence)": {
      "Indicators": {
        "T1112 - Modify Registry": {
          "Registry modifications adding/changing startup programs or service configurations.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 and 4688 on critical servers. Alert on changes to known startup Registry keys (e.g., Run, RunOnce, services) by processes other than known installers or system updates. Correlate with process creation events (4688) involving 'reg.exe', 'powershell.exe', or unusual processes modifying these keys."
          },
          "Attempts to modify Registry keys using methods like prepending null characters (Reghide).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing strings associated with hiding registry keys (e.g., null bytes, specific tools). Review Event ID 4657 (if available) for changes to keys that exhibit unusual naming patterns or lack obvious purpose. Perform periodic scans of critical registry hives using tools like Autoruns or RegDelNull to identify hidden entries not reported by standard events."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by modifying the Registry? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1112 - Modify Registry": {
          "Registry modifications known to disable or impair security software or logging.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of Registry keys/values known to disable or weaken security controls (e.g., disabling firewall, changing logging levels, disabling specific security features). Alert on Windows Event ID 4657 indicating modification of these specific keys/values. Correlate with process execution (4688) to identify the source."
          },
          "Registry modifications storing obfuscated payloads or configuration data in unusual keys.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to unusual or rarely modified Registry keys, especially if the value data appears encoded, encrypted, or unusually long/complex. Use entropy analysis on Registry value data from suspicious modifications to identify potentially obfuscated content. Cross-reference modified keys with known malware behaviors or C2 storage locations."
          }
        }
      }
    }
  }
]