```json
[
  {
    "Is the adversary attempting to gain credentials via brute force? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1110 - Brute Force": {
          "Authentication attempts originating from source IP addresses or using user agents known to be part of brute-force botnets or malicious infrastructure.": {
            "Data": "Windows Event ID 4625; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses from authentication failure logs (Windows Event ID 4625) and network connection logs (Zeek conn.log) against a CTI feed of known malicious IPs, proxies, or botnet nodes updated daily. For web-based services, also inner join user-agent strings from Zeek http.log against a list of known malicious or brute-forcing tool user agents. Alert on any matches."
          },
          "Authentication failures targeting a sequence of common or default administrative account names (e.g., 'admin', 'administrator', 'root', 'support') from a single source.": {
            "Data": "Windows Event ID 4625",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 for failed login attempts. From a single source IP, identify a pattern of attempts against a list of common administrative or default usernames within a short time frame (e.g., 5 minutes). Use a dictionary list to match against the target username field. A high frequency of failures (e.g., >10) against multiple common usernames from a single source strongly indicates a dictionary attack targeting common accounts."
          },
          "A high volume of failed login attempts against a single user account from one or a few source IPs, indicating a targeted password guessing or credential stuffing attempt.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 for authentication failures, especially on externally facing services (RDP, VPNs, webmail). Group events by target username and source IP. For each user, establish a baseline of normal failed login rates. Use time series analysis or statistical thresholds (e.g., a z-score > 3 or exceeding the 99th percentile of the baseline failure rate) on failed login counts per account to flag anomalous rates indicative of classic brute force or credential stuffing."
          },
          "A large number of unique user accounts experiencing a single or few failed login attempts from a single source IP, indicating a password spraying attack.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 for authentication failures. Group events by source IP address. For each source IP, identify attempts that target a large number of distinct user accounts with a low failure count per account (e.g., 1-3 failures per account). Calculate the entropy of the target username list per source IP over a time window (e.g., 1 hour); a combination of high user count, low failure count per user, and high entropy is a strong signal of password spraying. Correlate with Zeek conn.log to confirm the attempts are against a specific service."
          },
          "A successful login event immediately preceded by a statistically anomalous number of failed login attempts for the same user account from the same source IP.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a stateful rule that correlates successful logon events (Windows Event ID 4624) with preceding failed logon events (Windows Event ID 4625) for the same user account and source IP pair within a defined time window (e.g., 10 minutes). Use descriptive statistics on historical data to establish a baseline distribution of failure counts preceding successful logons. Flag any successful logon that occurs after a count of failed attempts exceeding a statistical threshold, such as the 95th percentile or a value identified as an outlier using an IQR box-plot."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```