[
  {
    "Is the adversary attempting to gain credentials via brute force? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1110 - Brute Force": {
          "A high volume of failed login attempts targeting a single user account from external or internal sources.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 and Zeek logs for authentication failures. Group events by target username and source IP address. Identify accounts with a high number of failed login attempts within a short time frame. Use time series analysis or statistical thresholds (e.g., z-score) on failed login counts per account/source IP pair to flag anomalous rates."
          },
          "Multiple failed login attempts distributed across a large number of user accounts originating from one or a few source IP addresses.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 and Zeek logs for authentication failures. Group events by source IP address. Identify source IPs that have a high number of failed login attempts distributed across a wide range of distinct target user accounts. Calculate entropy on the distribution of target usernames per source IP; high entropy with many failures indicates spraying activity."
          },
          "Failed login attempts specifically targeting exposed remote access services (RDP, SSH, VPN, web applications) from external sources.": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek rdp.log; Zeek http.log; Windows Event ID 4625",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek logs (conn.log, ssh.log, rdp.log, http.log) and Windows Event ID 4625 for failed authentication attempts targeting known external-facing service ports/protocols (e.g., RDP 3389, SSH 22, common VPN ports, specific web server ports). Group failures by target IP/port and source IP. Identify source IPs with high failure rates against these specific external services compared to baseline. Use correlation analysis between Zeek logs showing connection attempts and Event ID 4625 showing failures on the target system."
          },
          "Successful logins immediately preceded by a high volume of failed login attempts from the same source IP and targeting the same user account.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful logon events (Windows Event ID 4624) with preceding failed logon events (Windows Event ID 4625) from the same source IP and targeting the same user account within a defined time window (e.g., 1-5 minutes). Use descriptive statistics or percentile analysis on historical data to establish a threshold for the number of failed attempts preceding a successful logon. Flag successful logons that occur after a count of failed attempts exceeding this statistical threshold (e.g., 95th percentile)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]