[
  {
    "Is the adversary attempting to gain credential access using credential stuffing? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1110.004 - Credential Stuffing": {
          "High volume of failed authentication attempts originating from one or a few source IP addresses targeting multiple accounts or services.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 (Failed Login) and relevant Zeek logs (conn.log, ssh.log, http.log) for failed authentication attempts. Group events by source IP address and target account/service. Calculate the rate of failed attempts per source IP over time. Identify source IPs with a login failure rate significantly higher than the historical average (e.g., using statistical process control or anomaly detection)."
          },
          "Numerous failed authentication attempts spread across many different user accounts or services originating from an external source.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4625 and relevant Zeek logs. For each source IP address, calculate the number of unique target accounts and unique target services/ports experiencing failed logins. Flag source IPs with a high number of unique targets, which could indicate an automated credential stuffing attack."
          },
          "Sequence of failed authentication attempts immediately followed by a successful login from the same source IP address or user account.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624; Zeek conn.log; Zeek ssh.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4625 (failed login) and 4624 (successful login) events, or relevant Zeek logs (ssh.log, http.log) showing failed/successful authentication, by source IP address and target user/service. Identify sequences where multiple failed attempts (e.g., >3 within 1 minute) are immediately followed by a successful login from the same source IP. Flag these sequences for investigation as potential credential stuffing success."
          },
          "Failed authentication attempts specifically targeting default or common usernames (e.g., 'admin', 'test') across multiple systems or services.": {
            "Data": "Windows Event ID 4625; Zeek conn.log; Zeek ssh.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and maintain a list of common/default usernames frequently targeted in attacks (e.g., 'admin', 'test', 'administrator', 'user'). Monitor Windows Event ID 4625 and relevant Zeek logs for failed authentication attempts where the target username is on this list. Aggregate failures by source IP and username. Identify source IPs that generate a high volume of failed logins targeting multiple common usernames across different systems. Use correlation analysis to link attempts targeting the same common username across different servers and services."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]