```json
[
  {
    "Is the adversary attempting to gain credential access using credential stuffing? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1110.004 - Credential Stuffing": {
          "Authentication attempts originating from source IP addresses or using User-Agents known to be associated with credential stuffing campaigns or botnet activity.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from authentication logs (Windows Event IDs 4624/4625, Zeek conn.log) and User-Agent strings from web login attempts (Zeek http.log) against high-confidence threat intelligence feeds listing indicators of credential stuffing botnets or malicious proxies (updated daily). Inner join log data with threat feeds and alert on any matches, prioritizing alerts from IPs with a history of such activity."
          },
          "Authentication attempts using request patterns or targeting usernames characteristic of automated tools rather than human users.": {
            "Data": "Windows Event ID 4625; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor failed login attempts (Windows Event ID 4625) and HTTP requests to login endpoints (Zeek http.log). Maintain and check against a list of common/default usernames ('admin', 'test', etc.) and previously breached but currently invalid usernames (to serve as honeypot accounts). Identify sources repeatedly trying these names. Additionally, analyze HTTP headers for patterns indicative of automation, such as missing standard browser headers or the presence of User-Agents from known credential stuffing tools. Use regular expression matching for these patterns and flag sources with multiple matches."
          },
          "A high volume of failed logins across many distinct user accounts originating from a single source IP or a small pool of related IPs.": {
            "Data": "Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate failed login events (Windows Event ID 4625) by source IP over short time windows (e.g., 5-10 minutes). For each IP, calculate the number of unique target accounts. Use descriptive statistics (mean, median, standard deviation) to establish a baseline of normal activity and identify outlier IPs that target an anomalously high number of unique accounts. Calculate the entropy of target usernames per source IP; a sudden spike in entropy indicates an IP is cycling through a large list of users, a strong indicator of credential stuffing."
          },
          "A low rate of successful logins distributed across numerous accounts originating from a source IP that is also generating a high volume of failed logins.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate failed (Windows Event ID 4625) and successful (Windows Event ID 4624) login events by source IP. Calculate the success ratio (successful logins / total attempts) for each source IP. Flag IPs with a very low success ratio (e.g., <1%) but a high absolute number of total attempts and successful logins to multiple distinct accounts. Use a scatter plot of (total attempts vs. unique successful accounts) or correlation analysis to visually and programmatically identify outlier IPs characteristic of a successful credential stuffing operation."
          },
          "A successful login for a user account that creates an 'impossible travel' scenario, especially if preceded by failed login attempts for that same account.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each successful login (Windows Event ID 4624), geolocate the source IP. Compare the location and timestamp with the user's previous successful login. Calculate the travel velocity required and flag any 'impossible travel' events. Increase the alert's severity if the successful login was preceded by a series of failed logins (Windows Event ID 4625) for the same account from the same or different geolocations, as this may indicate the successful culmination of a credential stuffing attack against that specific account."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```