[
  {
    "Is the adversary attempting to intercept multi-factor authentication mechanisms? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1111 - Multi-Factor Authentication Interception": {
          "Detection of suspicious processes or API calls associated with capturing input or hooking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with suspicious command-line arguments or file paths known to be associated with keyloggers or input capture tools. Analyze process execution frequency using descriptive statistics or identify rare process names/paths using percentile analysis to flag anomalies."
          },
          "Anomalous network traffic patterns originating from endpoints potentially involved in MFA interception (e.g., proxied connections, access to out-of-band channels).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for unusual connection patterns originating from endpoints, looking for connections to unusual external endpoints, high volume of small connections, or connections matching known infrastructure related to messaging services or attacker C2. Use correlation analysis to link network traffic from endpoints with known MFA token usage periods."
          },
          "Concurrent successful logins to external remote services or internal resources using the same credentials from different or unusual source locations/IPs.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs to identify successful logons for the same user account occurring from different source IP addresses within a short time frame (e.g., < 60 seconds). Correlate source IPs with geolocation data. Flag users and IPs involved in near-simultaneous logons from geographically distant locations or unusual IPs. Use descriptive statistics to baseline concurrent logon patterns per user/group."
          },
          "Creation or modification of scheduled tasks, services, or registry entries associated with persistence or execution of input capture tools.": {
            "Data": "Windows Event ID 4697; Windows Event ID 4702; Windows Event ID 4703",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697 (service creation), 4702 (scheduled task update), and 4703 (scheduled task creation) on endpoints and servers. Examine the event details for suspicious service binary paths, service names, scheduled task actions, and command-line arguments that indicate the installation or execution of known keyloggers or custom input capture tools. Maintain a baseline of legitimate service and scheduled task creations/updates and flag deviations using frequency analysis or rare occurrence detection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]