```json
[
  {
    "Is the adversary executing malicious code using shared modules? (TA0002 - Execution)": {
      "Indicators": {
        "T1129 - Shared Modules": {
          "Loading of shared modules (DLLs) with known malicious hashes, names, or digital signatures associated with malware.": {
            "Data": "Windows Event ID 7 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (ImageLoad) events. Compare the hash (e.g., MD5, SHA256 from `Hashes` field) and name (`ImageLoaded` field) of loaded modules against a continuously updated threat intelligence feed of known malicious DLLs. Check the `Signed` and `Signature`/`SignatureStatus` fields; alert on loading of unsigned modules, modules with invalid/revoked signatures, or modules signed by known malicious/untrusted signers, especially if loaded by common processes or from unusual locations. Maintain and regularly update internal lists of malicious hashes, names, and signer certificates."
          },
          "Loading of shared modules (DLLs) from network shares (UNC paths) or high-risk temporary/user-writable locations (e.g., %TEMP%, %APPDATA%, download folders), particularly if the module is unsigned or newly created.": {
            "Data": "Windows Event ID 7 (Sysmon); Windows Event ID 11 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (ImageLoad) events for modules loaded from UNC paths (paths starting with `\\\\`). Also, monitor for modules loaded from common user-writable directories such as `%TEMP%`, `%APPDATA%`, `%LOCALAPPDATA%`, `C:\\Users\\Public\\`, or user profile download directories. Correlate these load events with the module's signature status (from Sysmon Event ID 7 `Signed`, `Signature`, `SignatureStatus` fields) and file creation details (from Sysmon Event ID 11 `TargetFilename`, `CreationUtcTime`). Prioritize alerts for unsigned, ad-hoc signed, or recently created modules loaded from these high-risk paths. Use frequency analysis (descriptive statistics) to identify processes that atypically load modules from such locations compared to established baselines."
          },
          "Loading of shared modules (DLLs) from unusual or non-standard directories (i.e., outside %SystemRoot%, %ProgramFiles%) identified through statistical anomaly detection.": {
            "Data": "Windows Event ID 7 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (ImageLoad) events. Establish a baseline of legitimate module load paths for all processes, or at least for critical/common processes, focusing on paths beyond the standard `%SystemRoot%` and `%ProgramFiles%` hierarchies. Calculate frequency distributions of these 'non-standard' load paths per process and globally. Use statistical methods (e.g., entropy measures of load paths per process, low-frequency path detection using percentile thresholds or IQR) to identify processes loading modules from paths that are rare for that specific process or rare across the entire environment. Investigate processes exhibiting a sudden increase in the diversity (entropy) of their module load paths from such non-standard locations."
          },
          "Shared module (DLL) load events correlating with recent suspicious file write operations or other anomalous process behaviors on the same host.": {
            "Data": "Windows Event ID 7 (Sysmon); Windows Event ID 11 (Sysmon); Windows Event ID 4688 (Security)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Sysmon Event ID 7 (ImageLoad) events with recent Sysmon Event ID 11 (FileCreate) events on the same host and within a short time window (e.g., 1-5 minutes), especially if the created file is the loaded module and it's in a non-standard path. Analyze process lineage (via Security Event ID 4688 `ParentProcessName` and `CreatorProcessName` from Sysmon Event ID 7) for processes loading modules shortly after creation by another suspicious process or after exhibiting other risky behaviors (e.g., running unusual command lines). Use correlation analysis to identify statistically significant temporal associations between module loads (especially from non-standard paths or unsigned modules) and preceding suspicious file creation or process events."
          },
          "Loading of statistically unusual or unauthorized shared modules by common or sensitive system processes (e.g., explorer.exe, svchost.exe, lsass.exe).": {
            "Data": "Windows Event ID 7 (Sysmon); Windows Event ID 4688 (Security)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline normal DLL loads (module names, paths, signers) for common and sensitive system processes (e.g., `explorer.exe`, `svchost.exe`, `lsass.exe`, `services.exe`, `winlogon.exe`) using historical Sysmon Event ID 7 (ImageLoad) data. Use frequency analysis or statistical profiling (e.g., calculating probability distributions of loaded modules or using clustering algorithms) on module paths and names associated with specific process names (from Event ID 4688 or Sysmon Event ID 7 `Image` field). Flag instances where these processes load modules from unusual paths, load modules that are statistically rare for that specific process, or load unsigned/unexpectedly signed modules. Investigate the command line and parent process of the loading process (Security Event ID 4688) for additional context."
          },
          "Network connections initiated by a process shortly after it loads a shared module from a non-standard location or an unsigned/suspicious module.": {
            "Data": "Windows Event ID 7 (Sysmon); Windows Event ID 5156 (Security); Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Sysmon Event ID 7 (ImageLoad) events, particularly where the module path is non-standard (as per previous rules) or the module is unsigned/suspicious, with subsequent Windows Security Event ID 5156 (Network Connection Filtered Platform Connection) events initiated by the same Process ID within a short time window (e.g., 5-60 seconds). Alternatively, correlate host-based ImageLoad events (Sysmon Event ID 7) with Zeek conn.log entries showing new outbound connections (especially to known malicious IPs/ports, or exhibiting unusual characteristics like high data volume or beaconing patterns) from the host where the module load occurred. Use time series analysis or sequence analysis to find statistically significant links between unusual module loads and subsequent suspicious network connections."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```