[
  {
    "Is the adversary using trusted system utilities to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1127.001 - MSBuild": {
          "Execution of MSBuild.exe with suspicious command-line arguments (e.g., referencing external XML files, inline tasks, suspicious file paths).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs for MSBuild.exe execution. Parse command-line arguments. Compare argument patterns against known legitimate MSBuild usage baselines. Identify arguments containing suspicious keywords (e.g., 'inline', '.xml') or referencing unusual file paths. Use frequency analysis on command-line argument components to identify rare occurrences."
          },
          "MSBuild.exe executed with an unusual parent process or subsequently launching suspicious child processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs. Identify parent process IDs for all MSBuild.exe executions. Map parent PIDs to parent process names. Establish a baseline of common parent processes for MSBuild.exe using frequency analysis. Identify and investigate executions where the parent process is statistically rare or unknown. Also, monitor child processes launched by MSBuild.exe and check against known suspicious binaries or scripts."
          },
          "Outbound network connections initiated by MSBuild.exe to unusual destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 (Network Connection) for outbound connections where the initiating process name is MSBuild.exe. Filter Zeek conn.log for connections originating from hosts that executed MSBuild.exe around the connection time. Cross-reference destination IPs and domains with threat intelligence feeds and internal baselines. Flag connections to rare or known malicious destinations. Use frequency analysis to identify infrequently accessed destination IPs or ports initiated by MSBuild.exe."
          },
          "Anomalous network traffic volume or patterns from MSBuild.exe executions.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for network sessions initiated by hosts executing MSBuild.exe. Use descriptive statistics (mean, median, sum of bytes_orig, bytes_resp) and time series analysis on data transfer volumes and connection frequency for sessions linked to MSBuild.exe. Identify and flag sessions with unusually high outbound traffic volumes (potential data exfiltration) or patterns indicative of command-and-control (e.g., small, frequent, periodic connections)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]