[
  {
    "Is the adversary attempting to discover peripheral devices? (TA0007 - Discovery)": {
      "Indicators": {
        "T1120 - Peripheral Device Discovery": {
          "Execution of commands or processes known to list peripheral devices (e.g., systeminfo, driverquery, specific PowerShell cmdlets).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify command-line arguments containing keywords related to device or hardware listing (e.g., 'driverquery', 'systeminfo', 'Get-PnpDevice', 'wmic logicaldisk'). Analyze frequency of these commands per host/user using descriptive statistics to identify outliers."
          },
          "Suspicious WMI or PowerShell activity querying device information, or anomalous API calls related to device enumeration.": {
            "Data": "Windows Event ID 4688; Zeek dce_rpc.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for PowerShell script blocks or command-line arguments related to WMI queries for device information (e.g., 'Get-WmiObject Win32_PnPEntity'). Monitor Zeek dce_rpc.log for DCOM/WMI activity originating from unusual processes or targeting multiple systems rapidly. Analyze the rate of WMI calls per host/user over time using time series analysis to detect spikes."
          },
          "Network traffic patterns indicative of rapid scanning or enumeration of devices/shares potentially identifying attached storage or other peripherals.": {
            "Data": "Zeek conn.log; Zeek smb_mapping.log; Zeek dce_rpc.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for rapid connections to common SMB/MSRPC ports (e.g., 445, 139) from a single source IP to multiple destinations within a short time period. Analyze Zeek smb_mapping.log and dce_rpc.log for enumeration activity (e.g., listing shares, services). Use frequency analysis on destination IPs per source IP to identify scanning behavior. Calculate correlation coefficients between connection volume and enumeration events to detect coordinated discovery activity."
          },
          "Execution of device-interacting utilities (like devcon) or PowerShell cmdlets related to device control/information by processes with unusual parent-child relationships or associated with remote access tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing commands or scripts related to device interaction (e.g., `devcon`, `driverquery`, PowerShell cmdlets like `Get-PnpDevice`, `Enable-PnpDevice`, `Disable-PnpDevice`). Investigate events where these commands are executed by processes associated with remote access tools or have unusual parent processes (e.g., cmd.exe or powershell.exe spawning from a non-standard service or application). Use parent-child process analysis and frequency counts per process name to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]