[
  {
    "Is the adversary collecting data via audio capture? (TA0009 - Collection)": {
      "Indicators": {
        "T1123 - Audio Capture": {
          "Anomalous process accessing audio capture APIs or devices (microphone, webcam).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for suspicious processes (e.g., unsigned, unusual parent/child relationships, unexpected execution paths) that also show signs of interacting with audio APIs (requires additional logging or analysis not directly in Event ID 4688). Correlate suspicious process creation with other host telemetry. Use descriptive statistics on process execution times and parent processes to identify outliers."
          },
          "Periodic or unusual writing of files with audio data characteristics to disk by suspicious processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for suspicious processes writing new files. Analyze characteristics of newly created files (e.g., size, analyze entropy for potential encoded audio data, file name patterns) written by suspicious processes. Use time series analysis to identify periodic file creation events that could indicate scheduled recordings."
          },
          "Outbound network connections to unusual destinations or involving high data volume, initiated by processes that lack typical application signatures or have suspicious command lines.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ftp.log; Zeek smtp.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections with high byte counts or to destinations outside expected ranges (e.g., based on frequency analysis of destinations). Investigate associated process creation events (Windows Event ID 4688) for the originating process, examining its path, command line, and parent process for signs of abnormality (e.g., unsigned executable, temporary path, suspicious command arguments). Use correlation analysis to link high-volume outbound connections to specific processes and their characteristics."
          },
          "Execution of command-line tools or scripts with arguments indicative of audio device interaction or recording.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line contains strings or patterns associated with audio capture utilities (e.g., `rec.exe`, `ffmpeg`, `powershell -command Add-Type -AssemblyName System.Media`) or suspicious arguments passed to common scripting engines. Establish a baseline of normal command line arguments for frequently executed processes using frequency analysis or entropy calculations on command line strings and flag significant deviations or matches against known suspicious patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]