
[
  {
    "Is the adversary gathering information about the system time or time zone? (TA0007 - Discovery)": {
      "Indicators": {
        "T1124 - System Time Discovery": {
          "Execution of a file whose hash matches a known malicious tool or script that performs system time discovery.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) and extract the SHA256 or MD5 hash of the executed process image. Correlate these hashes against a continuously updated cyber threat intelligence feed of known malicious file hashes. Alert on any match where the tool's documented functionality includes system time discovery or broader host reconnaissance."
          },
          "Execution of common built-in system utilities and commands used for querying system time or time zone information.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation command lines (Windows Event ID 4688) for exact matches or variations of system time discovery commands, such as `net time`, `w32tm /query`, `w32tm /tz`, `Get-Date` (PowerShell), `[System.DateTime]::Now` (PowerShell), `date /t`, `time /t`. Create a hunting query or low-priority alert for any execution of these specific command patterns to enable correlation with other behavioral indicators."
          },
          "System time discovery commands executed by an unusual parent process, a non-interactive account, or as part of a suspicious process chain.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For every time discovery command detected, analyze the execution context in Windows Event ID 4688. Establish a baseline of normal parent processes (e.g., `explorer.exe`, `cmd.exe`) and user accounts for these commands using frequency analysis and descriptive statistics. Flag executions with rare or anomalous parent processes (e.g., `svchost.exe`, `winword.exe`, `powershell.exe` with an encoded command) or those run under service accounts (e.g., NT AUTHORITY\\SYSTEM) outside of expected administrative scripts. Use parent-child process relationship analysis to flag suspicious chains."
          },
          "System time discovery occurring in rapid succession with other discovery techniques or immediately preceding a defense evasion or execution action.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the execution of a time discovery command with other discovery commands (e.g., `whoami`, `ipconfig`, `net user`, `systeminfo`) by the same process ID or user within a short time window (e.g., less than 2 minutes). Use correlation analysis to identify sequences where time discovery is followed by techniques like scheduled task creation (`schtasks`) or service modification (`sc.exe`), which may indicate time-stamping or scheduling for persistence. Measure the entropy of commands run by a single process; a spike in command entropy that includes time discovery could indicate a reconnaissance script."
          },
          "Anomalous Network Time Protocol (NTP) traffic, such as a client querying an unapproved external time server or a host exhibiting a sudden spike in NTP queries.": {
            "Data": "Zeek conn.log; Zeek ntp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ntp.log and Zeek conn.log for UDP traffic on port 123. Establish a baseline of approved internal and external NTP servers used by the organization. Alert on any hosts initiating NTP queries to unapproved or known-malicious external time servers. Use time series analysis to monitor the volume of NTP queries from individual hosts and alert on significant spikes or deviations from the baseline (using IQR or Z-score), which could indicate an attempt to bypass local time for sandbox evasion or time-stamping activities."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
