
[
  {
    "Is the adversary attempting to discover peripheral devices? (TA0007 - Discovery)": {
      "Indicators": {
        "T1120 - Peripheral Device Discovery": {
          "Execution of a process whose file hash matches a known malicious discovery script or binary used for enumerating peripheral devices.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously compare file hashes of all newly created processes (from enriched Windows Event ID 4688 logs) against a cyber threat intelligence (CTI) feed of known malicious discovery tools (e.g., binaries from Seatbelt, SharpHound, or custom actor scripts). Alert immediately on any match and isolate the host for further investigation."
          },
          "Execution of built-in system utilities or specific PowerShell cmdlets known to be used for device discovery, such as 'systeminfo', 'driverquery', 'fsutil fsinfo drives', or 'Get-PnpDevice'.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events and their command-line arguments. Maintain a specific list of suspicious command strings and PowerShell cmdlets associated with peripheral device enumeration (e.g., 'systeminfo', 'driverquery', 'Get-PnpDevice', 'Get-CimInstance Win32_PnPEntity', 'fsutil fsinfo drives'). Use descriptive statistics (frequency counts per host/user) to baseline normal administrative activity and identify abnormal or rare usage."
          },
          "Execution of device discovery commands by non-standard user accounts or processes with anomalous parent-child relationships, such as being spawned by a web server, Office application, or remote access tool.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) involving device discovery commands. Investigate any instance where the parent process is unusual for this activity (e.g., WINWORD.EXE, OUTLOOK.EXE, w3wp.exe) or where the command is executed under a user context (e.g., service accounts) that does not typically perform such actions. Use correlation analysis to model normal parent-child process trees and flag executions that deviate from established baselines."
          },
          "A single host or user performing an unusually high volume of local device discovery queries or network-based device enumeration in a short period, indicating automated scanning.": {
            "Data": "Windows Event ID 4688; Zeek dce_rpc.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate device discovery command executions (from Windows Event ID 4688) and remote enumeration attempts (from Zeek dce_rpc.log) per source host and user. Use time series analysis or a sliding window count to establish a baseline rate of this activity. Alert on statistically significant spikes or bursts of activity that exceed normal thresholds (e.g., using Inter-Quartile Range or Z-score). Correlate high-frequency host-based queries with network scanning behavior (rapid connections on port 445 seen in Zeek conn.log) from the same host."
          },
          "Device discovery activity observed as part of a larger sequence of malicious behaviors, such as immediately following a remote login and preceding data staging on a newly discovered device.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the timing of peripheral device discovery events (T1120) with other suspicious activities on the same host or by the same user. Define and search for high-confidence attack chains, such as: 1. Remote login (Windows Event ID 4624 Logon Type 10 or 3). 2. Execution of 'fsutil fsinfo drives' or 'Get-PnpDevice -Class DiskDrive' (T1120). 3. Subsequent process creation (Windows Event ID 4688) indicating data staging (e.g., 'robocopy', 'xcopy', or '7z.exe' targeting a discovered drive letter). Use time-windowed correlation analysis (e.g., all events within a 30-minute window for a given host/user) to identify and alert on these logical sequences."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
