[
  {
    "Is the adversary using ClickOnce for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1127.002 - ClickOnce": {
          "Detection of DFSVC.EXE launching child processes that are non-standard or malicious executables/scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Filter for processes where ParentProcessName is 'dfsvc.exe'. Analyze the ChildProcessName and CommandLine for suspicious or unknown executables/scripts. Use descriptive statistics to baseline common child processes of dfsvc.exe and flag outliers based on frequency or deviation from expected norms."
          },
          "Suspicious command-line executions involving 'rundll32.exe dfshim.dll,ShOpenVerbApplication1'.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Filter for processes where Image is 'rundll32.exe'. Search the CommandLine for the specific string 'dfshim.dll,ShOpenVerbApplication1'. Identify the process that launched rundll32.exe and analyze the path of the ClickOnce application being launched for suspicious locations or names."
          },
          "Network connections to unusual or untrusted external sources (web servers, file shares) immediately preceding or correlated with the execution of DFSVC.EXE.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections originating from endpoints to potentially malicious or uncommon domains/IPs (e.g., using threat intelligence feeds or reputation scoring), especially those associated with executable downloads. Correlate these network connections with Windows Event ID 4688 showing the creation of the 'dfsvc.exe' process on the same endpoint within a short time window (e.g., 60 seconds). Use frequency analysis or correlation analysis to identify network sources consistently preceding dfsvc.exe execution that are outside the baseline of trusted software distribution points (e.g., corporate software deployment servers)."
          },
          "Creation or modification of ClickOnce application files (.appref-ms, .application) in user startup folders or other persistence locations, followed by DFSVC.EXE execution targeting these files.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (requires SACL configuration) for 'WriteData' or 'AppendData' operations on files with extensions '.appref-ms' or '.application' in user startup folders (e.g., '%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup') or other common persistence locations. Correlate these file modification events with subsequent Windows Event ID 4688 showing 'dfsvc.exe' execution where the Command Line contains the path to one of these files. Use time series analysis to identify patterns of file modifications followed by execution outside normal user activity periods or from unexpected processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]