
[
  {
    "Is the adversary using ClickOnce for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1127.002 - ClickOnce": {
          "Execution of a ClickOnce application involving known malicious URLs, domains, or file hashes.": {
            "Data": "Zeek http.log; Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 command lines and Zeek http.log requests for URLs passed to 'dfshim.dll' or used to download '.application'/'appref-ms' files. Inner join these URLs/domains against a high-confidence CTI feed of known malicious indicators. Separately, calculate file hashes of downloaded ClickOnce components (from Zeek files.log or endpoint tools) and check them against a malicious hash repository. Alert on any match."
          },
          "Execution of ClickOnce applications via the characteristic 'rundll32.exe dfshim.dll,ShOpenVerbApplication' command-line pattern.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection rule to specifically monitor Windows Event ID 4688 for process command lines containing both 'rundll32.exe' and the string 'dfshim.dll,ShOpenVerbApplication'. For every alert, extract and investigate the parent process (e.g., Office applications, browsers) and the full URL of the ClickOnce application. Correlate the domain in the URL against an organizational whitelist of approved software sources."
          },
          "The ClickOnce service (dfsvc.exe) launches an unexpected or anomalous child process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for all child processes of 'dfsvc.exe'. Establish a baseline of legitimate child processes and their common command-line arguments in your environment. Use descriptive statistics (frequency analysis, percentile ranking) to identify rare or never-before-seen child processes. Flag executions of command shells (cmd.exe, powershell.exe), scripting engines (wscript.exe, cscript.exe), or any process outside the established baseline as highly suspicious."
          },
          "Network connections to untrusted external sources for ClickOnce manifests (.application) or assemblies, immediately followed by ClickOnce execution on an endpoint.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network events with endpoint process creation. Monitor Zeek logs for endpoints downloading '.application' files or connecting to unusual domains. If such a connection is observed, correlate by endpoint IP and timestamp (e.g., within 60 seconds) with the creation of 'dfsvc.exe' or 'rundll32.exe dfshim.dll...' (Windows Event ID 4688). Use time series analysis and correlation to identify network sources that consistently precede ClickOnce execution but are not on a list of trusted software distribution points."
          },
          "Creation of a ClickOnce application reference file (.appref-ms) in a persistence location like a user's Startup folder.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable file system auditing (SACL) on user Startup folders (e.g., '%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'). Monitor Windows Event ID 4663 for file creation events ('WriteData' or 'AppendData') for files with the '.appref-ms' extension in these locations. Correlate file creation events with subsequent process executions (Windows Event ID 4688) by 'dfsvc.exe' or 'rundll32.exe' referencing the same file path, especially after a system reboot or user logon, to detect attempts to establish persistence."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
