[
  {
    "Is the adversary executing malicious code using shared modules? (TA0002 - Execution)": {
      "Indicators": {
        "T1129 - Shared Modules": {
          "Loading of shared modules (DLLs) from unusual or non-standard directories (%SystemRoot%, %ProgramFiles%).": {
            "Data": "Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor host logs (Windows Event ID 7) for 'LoadLibrary' or similar calls loading DLLs. Filter for DLLs loaded from paths outside of common system directories like C:\\Windows\\System32, C:\\Program Files, etc. Use descriptive statistics to identify paths with low frequency of DLL loads across the environment."
          },
          "Shared module (DLL) load events correlating with recent suspicious file writes or process behaviors.": {
            "Data": "Windows Event ID 7; Windows Event ID 11; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 7 (ImageLoad) events with recent Windows Event ID 11 (FileCreate) events on the same host and within a short time window. Analyze process relationships (via Event ID 4688) for processes loading modules shortly after creating suspicious files. Use correlation analysis to identify statistically significant associations between module loads from non-standard paths and suspicious file creation events."
          },
          "Loading of unusual shared modules by common or system processes.": {
            "Data": "Windows Event ID 7; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline normal DLL loads for common system processes (`explorer.exe`, `svchost.exe`, etc.) using Windows Event ID 7 (ImageLoad), capturing the process name and the loaded module path/name. Use frequency analysis or statistical profiling (e.g., calculating probability distributions or using clustering) on module paths and names associated with specific process names (from Event ID 4688). Flag instances where system processes load modules from unusual paths or load modules that are statistically rare for that specific process. Investigate the command line and parent process of the loading process (Event ID 4688) for additional context."
          },
          "Network connections initiated by a process shortly after loading a shared module from a non-standard location.": {
            "Data": "Windows Event ID 7; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 7 (ImageLoad) events where the module path is non-standard with subsequent Windows Event ID 5156 (Network Connection) events initiated by the same process within a short time window (e.g., 60 seconds). Alternatively, correlate Zeek conn.log entries showing connections (especially to known C2 ports/IPs or with unusual byte counts/timing) with host-based ImageLoad events (Event ID 7) where the module path is non-standard for the process initiating the connection. Use correlation analysis or sequence analysis to find statistically significant links between unusual module loads and suspicious network connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]