
[
  {
    "Is the adversary evading defenses using legitimate build utilities? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1127.003 - JamPlus": {
          "Execution of a JamPlus binary with a file hash matching a known malicious sample, or network connections from JamPlus to known malicious C2 infrastructure.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Calculate the file hash (e.g., SHA256) for any executed 'jam.exe' or 'JamPlus.exe' process (identified via Windows Event ID 4688) and compare it against a threat intelligence feed of known malicious file hashes. Concurrently, monitor network logs (Zeek conn.log) for connections originating from these processes and inner join the destination IP addresses against a CTI feed of known malicious C2 servers. Alert on any match."
          },
          "Execution of JamPlus in an environment where it is not an authorized or expected developer tool, or its use to process build files from non-standard locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of hosts and directories where JamPlus ('jam.exe', 'JamPlus.exe') is expected to run. Monitor Windows Event ID 4688 for executions outside of these baselined 'developer zones'. Analyze the command line for the build file being processed (e.g., 'Jambase', 'Jamfile'); flag executions that occur in non-standard locations (e.g., %TEMP%, C:\\Users\\Public\\), as this is a known pattern for malicious use. Use correlation analysis to link the presence of the build file with the anomalous process execution."
          },
          "Execution of JamPlus with an anomalous parent process (e.g., an Office application, browser, or script interpreter) or from a suspicious directory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For every 'jam.exe' or 'JamPlus.exe' execution (Windows Event ID 4688), analyze its parent process and execution path. Establish a baseline of normal parent processes (e.g., cmd.exe, explorer.exe, development IDEs). Use frequency analysis to identify rare parent-child relationships or flag executions where the parent is anomalous (e.g., winword.exe, outlook.exe, powershell.exe) or the execution path is a temporary or user-writable location like %APPDATA% or C:\\Users\\Public\\Downloads. A box-plot of parent process frequencies can identify outliers."
          },
          "JamPlus process spawning suspicious child processes, such as scripting engines (PowerShell, cmd), network utilities (curl, certutil), or processes executing from temporary locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 logs for child processes where the parent process name is 'jam.exe' or 'JamPlus.exe'. Analyze the child process's name and command line. Flag instances where JamPlus launches scripting interpreters (powershell.exe, cmd.exe, wscript.exe), tools for downloading/executing code (certutil.exe, bitsadmin.exe, rundll32.exe), or any process from a temporary directory. Use entropy measures on command-line arguments to detect potential obfuscation and use correlation analysis to link the suspicious child process back to the initial JamPlus execution event."
          },
          "JamPlus, or a process spawned by it, initiating network connections to unusual external destinations, using non-standard ports, or exhibiting C2-like beaconing patterns.": {
            "Data": "Windows Event ID 5156; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process execution data (Windows Event ID 4688 for JamPlus and its children) with network connection logs (Windows Event ID 5156 on the host, Zeek conn.log on the network). For these correlated events, analyze destination IPs and ports. Flag connections to non-organizational IPs, rare geolocations, or non-standard ports for the given application. Use time series analysis on Zeek conn.log data to detect periodic, low-volume connections (beaconing) originating from the host after JamPlus execution. Use linear regression to model expected data transfer volumes and flag significant outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
