[
  {
    "Has the adversary used Parent PID Spoofing for privilege escalation? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1134.004 - Parent PID Spoofing": {
          "A process is spawned with a spoofed parent ID resulting in an unexpected elevation of privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creations. Analyze parent-child process relationships. Identify processes spawned with ParentProcessId fields that do not match expected parent processes for that user/context/command, particularly if the new process runs with higher privileges than its apparent parent."
          },
          "A user-level process is spawned with a parent ID corresponding to a high-privilege system process (e.g., lsass.exe, svchost.exe) without normal UAC elevation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify processes spawned with ParentProcessId corresponding to critical system processes (e.g., lsass.exe, svchost.exe) where the NewProcessName is a user-level application (e.g., powershell.exe, cmd.exe) and the spawning user is not SYSTEM or an expected service account. Filter for processes created under suspicious user contexts and high-privilege parent IDs."
          }
        }
      }
    }
  },
  {
    "Is the adversary using Parent PID Spoofing for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1134.004 - Parent PID Spoofing": {
          "Inconsistency between the parent process ID reported in process creation logs (e.g., Windows Event ID 4688 Creator Process ID/Name) and the actual parent process ID (requiring additional data source analysis).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Build baseline profiles of normal parent-child process relationships for common applications and system processes. Flag process creations where the ParentProcessName/ParentProcessId is unusual or inconsistent with the NewProcessName/command line based on the baseline. Use correlation analysis to identify frequent deviations and prioritize investigation."
          },
          "Observation of unusual command line arguments or process chains in process creation events that may indicate explicit PPID assignment or malicious API usage.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious process creations (NewProcessName) and examine the CommandLine field for unusual parameters or sequences that might result from specific API calls like CreateProcess with extended flags. Analyze frequency of unusual command line arguments or process chains using descriptive statistics."
          }
        }
      }
    }
  }
]