[
  {
    "Is the adversary maintaining persistence via Outlook Rules? (TA0003 - Persistence)": {
      "Indicators": {
        "T1137.005 - Outlook Rules": {
          "Existence of unusual or hidden Outlook rules in user mailboxes, potentially created or modified using MAPI editor or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation of known tools like 'MFCMapi.exe' or suspicious PowerShell script execution that could manipulate Outlook rules. Analyze command lines and parent processes. Investigate network connections initiated by these processes via Zeek logs using correlation analysis to identify suspicious communication patterns (e.g., unexpected external connections)."
          },
          "Abnormal child process execution originating directly from Outlook (outlook.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the Parent Process Name is 'OUTLOOK.EXE'. Identify child processes that are unusual or known malicious executables (e.g., scripting engines like wscript.exe, cscript.exe, command shells like cmd.exe, powershell.exe, downloaded malware). Use correlation analysis to identify patterns of specific child processes consistently launched by Outlook and calculate their frequency and entropy to identify anomalous occurrences."
          },
          "Unusual outbound network connections initiated by Outlook or its immediate child processes, potentially downloading files or communicating with C2.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events for processes where the parent is 'OUTLOOK.EXE' or processes commonly launched by malicious rules/forms (e.g., wscript.exe, powershell.exe) with network connection events observed in Zeek conn.log or Zeek http.log initiated by these child processes. Investigate connections to external IPs not on approved lists or those flagged by threat intelligence feeds. Analyze Zeek http.log for suspicious user agents or unusual downloaded file types originating from these processes. Use correlation analysis to link specific process executions to outbound network traffic."
          },
          "Suspicious process behavior, such as execution from unusual directories or execution with suspicious command-line arguments, launched by Outlook rules.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched where the Parent Process Name is 'OUTLOOK.EXE'. Filter for child processes exhibiting suspicious characteristics such as execution from unusual or temporary directories (e.g., AppData\\Local\\Temp, Recycle.Bin), presence of obfuscated command-line arguments, or command lines attempting to interact with MAPI interfaces or manipulate sensitive Outlook/Exchange configuration files or registry keys. Use frequency analysis to identify rare parent-child relationships or uncommon command-line patterns for processes launched by Outlook."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]