[
  {
    "Is the adversary maintaining persistence using malicious Office add-ins? (TA0003 - Persistence)": {
      "Indicators": {
        "T1137.006 - Add-ins": {
          "Presence of suspicious or unauthorized Office add-in files or registry entries in trusted locations or add-in load paths.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation/modification/access events (Windows Event ID 4656, 4663) and registry modifications (Windows Event ID 4657) in known Office add-in directories and relevant registry paths. Cross-reference new or modified entries against a baseline of legitimate add-ins using frequency analysis. Look for entries pointing to suspicious file locations or executables."
          },
          "Anomalous process execution chains originating from Office applications (e.g., Word launching cmd.exe, Excel launching PowerShell).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688). Filter events where the parent process is an Office application (winword.exe, excel.exe, outlook.exe etc.). Identify child processes that are commonly abused for execution (e.g., cmd.exe, powershell.exe, rundll32.exe). Use correlation analysis to identify repeated occurrences or unusual patterns across multiple endpoints by counting occurrences per user or host."
          },
          "Network connections initiated by Office applications or child processes launched by Office applications to unusual or external destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) where the parent is an Office application with subsequent Windows Event ID 5156 (Network Connection) or Zeek conn.log entries. Filter for connections originating from Office processes or their child processes to external or unusual destinations. Use frequency analysis or percentile analysis on destination IPs, ports, or country codes to identify low-frequency connections originating from processes spawned by Office applications."
          },
          "Repeated access to Office add-in files or registry keys at unusual times or correlated with Office application launch events outside normal working hours.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4656, 4657, and 4663 related to known Office add-in file paths and registry keys. Correlate these events with successful user logons (Windows Event ID 4624) and Office application process creation (Windows Event ID 4688) to determine access timing relative to user activity and application launches. Use time series analysis and descriptive statistics to identify access patterns to add-in artifacts occurring persistently outside typical user working hours (e.g., using mean, median, IQR of event timestamps)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]