[
  {
    "Has the adversary escalated privileges using token impersonation/theft? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.001 - Token Impersonation-Theft": {
          "Detection of Windows API calls related to token duplication and impersonation (DuplicateToken(Ex), ImpersonateLoggedOnUser, SetThreadToken).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (focus on correlating process creation Event ID 4688 with other activity) for events potentially indicative of API calls like DuplicateToken(Ex), ImpersonateLoggedOnUser, SetThreadToken by analyzing call stacks or associated activities if available in logs. Correlate with command-line arguments from 4688 events. Use frequency analysis to identify rare occurrences of processes making such calls."
          },
          "Unusual changes to process or thread tokens, potentially assigning higher privileges than the original process/thread.": {
            "Data": "Windows Event ID 4696",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4696 (A primary token was assigned to process). Analyze events for unusual token assignments, especially to processes that previously ran with lower privileges. Correlate token assignment events over time to identify persistent changes in process token privileges using time series analysis."
          },
          "Processes accessing token-related Windows APIs (DuplicateToken(Ex), ImpersonateLoggedOnUser, SetThreadToken) from unusual or unexpected process contexts (e.g., non-system utilities, user applications).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Analyze command line arguments, parent-child relationships, and process names for correlation with known tools or behaviors associated with token manipulation. Use frequency analysis of processes creating child processes that then exhibit token manipulation activity (e.g., logging 4696, or potentially other related events if available)."
          },
          "Elevated process activity (e.g., access to protected resources, system modifications) originating from a process that recently had its token modified or a new token assigned (Event ID 4696).": {
            "Data": "Windows Event ID 4696; Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4696 events (A primary token was assigned to process) with subsequent Windows Event ID 4663 or 4656 events originating from the same Process ID/Handle ID. Identify instances where the process receiving the token (4696) then accesses protected objects or performs actions (4663/4656) that the original process user account should not have access to. Use correlation analysis and baselining of normal process access patterns (frequency, object types) to identify anomalous elevated activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using token impersonation/theft? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.001 - Token Impersonation-Theft": {
          "Suspicious usage of the 'runas' command or similar functionality via command-line or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for process creations containing 'runas' in the command line. Investigate the user executing the command and the target command being run to identify unauthorized or suspicious privilege assumption. Use frequency analysis to flag users or commands with unusual 'runas' usage."
          },
          "Creation of new processes or modification of existing threads using duplicated or impersonated tokens.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4696",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) and 4696 (Token Assignment) for new processes or modified threads. Correlate these events with preceding activity (e.g., successful token theft) and examine the assigned token's privileges (if available in logs or correlated). Use correlation analysis to link token-related events across multiple logs for a single process execution chain."
          },
          "Execution of known token manipulation utilities or command-line interfaces (e.g., Meterpreter's incognito, Mimikatz sekurlsa::pth) via command-line or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line contains names or patterns associated with known token manipulation tools (e.g., 'incognito', 'sekurlsa::pth'). Use frequency analysis to identify rare or first-seen command line arguments involving these tools, especially when executed by standard user accounts or from unusual directories."
          },
          "Network connections originating from a process using an impersonated or duplicated token to access internal network resources or services.": {
            "Data": "Windows Event ID 5156; Zeek conn.log; Zeek dce_rpc.log",
            "Data Platform": "Endpoints; Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4696 (Token Assignment) or other token-related events (if available) with Windows Event ID 5156 (Filter Platform Connection) and Zeek conn.log/dce_rpc.log entries originating from the same process ID. Identify processes that receive an unusual token and then initiate network connections to internal hosts or services (e.g., SMB, WinRM, RPC) that are not typical for that process or user context. Use correlation analysis to link host events (token assignment) with network events (connections) to trace the activity path."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]