[
  {
    "Has the adversary gained initial access to the network via external remote services? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1133 - External Remote Services": {
          "Anomalous login attempts to external remote services (VPN, Citrix, RDP) from unusual geographic locations or outside normal business hours.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect remote service authentication logs (Windows Event ID 4624, 4625, VPN/Citrix logs, Zeek conn.log for VPN traffic). Identify source IP addresses for successful and failed logins. Geolocate source IPs. Calculate frequency distribution of source countries/regions and login times. Flag logins from low-frequency locations or occurring outside typical business hours (e.g., using IQR or percentile analysis on login times)."
          },
          "Anomalous external usage patterns targeting potentially exposed remote services (e.g., Docker API, Kubernetes API) that do not require authentication.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to known ports associated with exposed services (e.g., Docker API 2375/2376, K8s API 6443/443, kubelet 10250). Analyze connection volume, source IPs, and request patterns. Use time series analysis to detect sudden spikes or changes in traffic patterns from external IPs to these services."
          },
          "Multiple failed login attempts from a single external IP or geographic location followed by a successful login to an external remote service.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4625 (failed login) and 4624 (successful login) logs for external remote services by source IP address and destination user account within a short time window (e.g., 1-10 minutes). Count failed login attempts from each source IP before a successful login for the same user. Flag source IPs exceeding a threshold of failed attempts before success (e.g., >10 failures within 5 minutes). Use descriptive statistics on attempt counts and time deltas."
          },
          "Discovery or exploitation attempts observed via connection patterns to external-facing services that do not require authentication (e.g., unusual scan activity, malformed requests, unexpected ports).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to known or unusual ports exposed externally (e.g., Docker API 2375/2376, K8s API 6443/443, kubelet 10250, or other ports with low-frequency connection counts from external IPs). Identify patterns indicative of scanning (e.g., rapid connections across multiple ports). Analyze Zeek http.log for malformed requests or requests targeting known vulnerabilities against exposed web services. Use frequency analysis and correlation to identify potential discovery or exploitation attempts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary maintaining persistence using external remote services? (TA0003 - Persistence)": {
      "Indicators": {
        "T1133 - External Remote Services": {
          "Successful logins to external remote services exhibiting unusual access patterns (e.g., multiple failed logins followed by success, logins at odd hours consistently over time) matching known Valid Accounts.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful logins (Event ID 4624, VPN/Citrix logs) with preceding failed attempts (Event ID 4625) for valid accounts. Analyze login timestamps for patterns inconsistent with normal user behavior (e.g., logins consistently occurring late at night or on weekends). Use descriptive statistics (mean, median, mode of login times) to establish baseline login behavior per user/group and identify deviations using percentile analysis."
          },
          "Connections via external remote services originating from IP addresses associated with other known suspicious activities or previously compromised accounts.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Cross-reference source IP addresses from remote service logs (Zeek conn.log, VPN/Citrix logs) against a list of IP addresses identified in other security alerts or known compromised host lists. Inner join connection logs with Threat Intelligence feeds for known malicious IPs connecting via remote services. Investigate all sessions involving such IPs."
          },
          "Repeated successful logins by a valid account to external remote services from changing or unusual geographic locations or at consistent, off-hour times over an extended period.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze successful external remote service logins (Event ID 4624, Zeek conn.log for relevant connections) for valid accounts. Geolocate source IPs. Track source location diversity and login times for specific accounts over weeks or months. Identify accounts logging in from a wide range of locations or consistently outside their normal work hours or at the same unusual off-hour times daily/weekly. Use statistical profiling (descriptive statistics, time series analysis) for individual account access patterns to detect anomalies."
          },
          "Successful external connections to internal systems using typically internal-only remote administration tools (e.g., WinRM, RDP to internal IPs, VNC) via unexpected network paths or without standard VPN usage.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for external source IPs connecting to internal destination IPs on ports associated with internal remote administration (e.g., WinRM 5985/5986, internal RDP 3389, VNC 5900+). Correlate with Windows Event ID 4624 (Logon Type 3 for network logon) on the destination server for successful logons originating from these external IPs. Investigate connections that bypass expected external access methods (e.g., corporate VPN gateway). Use frequency analysis to identify hosts receiving unexpected external remote administration connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]