[
    {
        "information_requirement": "Is the adversary performing network and host discovery to identify resources?",
        "tactic_id": "TA0007",
        "tactic_name": "Discovery",
        "indicators": [
            {
                "technique_id": "T1135",
                "name": "Network Share Discovery",
                "evidence": [
                    {
                        "description": "Execution of a known malicious script or binary (identified by file hash) that performs network share discovery.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor for process creation events (Windows Event ID 4688) and PowerShell script executions (Windows Event ID 4104). Calculate the hash of the executed binary or the script block content. Compare these hashes against a cyber threat intelligence feed of known malicious discovery tools or scripts (e.g., BloodHound ingestors, PowerView scripts, Mimikatz). Alert on any hash match and isolate the host for further investigation."
                    },
                    {
                        "description": "Execution of common network share discovery commands (e.g., `net view`, `net share`, `Get-SmbShare`, `Find-LocalAdminAccess`) especially when initiated by unusual parent processes or non-interactive shells.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process command-line arguments (Windows Event ID 4688) and PowerShell script blocks (Windows Event ID 4104) for string patterns associated with network share discovery (e.g., `net view`, `net share`, `Get-SmbShare`, `Invoke-ShareFinder`, `wmic.*share get name`, `dir \\\\*`). Correlate executions with their parent process. Use frequency analysis to find rare parent-child relationships and flag executions originating from non-standard administrative tools (e.g., `wscript.exe`, `mshta.exe`), web server processes, or processes running as SYSTEM from a service, which is anomalous for interactive discovery commands."
                    },
                    {
                        "description": "A single host generating a high volume of SMB connection requests or share enumeration attempts across many unique hosts in the network within a short time frame.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek smb.log",
                            "Windows Event ID 5140"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate Zeek conn.log data for SMB traffic (TCP/445) and Zeek smb.log `tree_connect` events by source IP (or Windows Event ID 5140 by source hostname). For each source, count the number of unique destination IPs or unique shares (`\\\\dest\\share`) accessed over a rolling time window (e.g., 10 minutes). Use percentile analysis, Inter-Quartile Range (IQR), or a fixed threshold (e.g., > 20 unique hosts) to identify source systems exhibiting scanning behavior. Use time series analysis to detect sudden spikes in SMB discovery activity originating from a single host."
                    },
                    {
                        "description": "A user or host accessing network shares they have never accessed before, or accessing shares in a pattern that deviates significantly from their established behavioral baseline.",
                        "data_sources": [
                            "Zeek smb.log",
                            "Windows Event ID 5140"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal share access for each user and host by analyzing historical Zeek smb.log or Windows Event ID 5140 data, creating an access graph of typical user-to-share interactions. Monitor for and alert on first-time access events (i.e., a new edge in the graph). Use correlation analysis to detect when a single user suddenly accesses a high number of new shares or shares belonging to a different business unit. Calculate the entropy of shares accessed per user over time; a sudden increase can indicate discovery activity."
                    },
                    {
                        "description": "Widespread attempts to connect to administrative shares (e.g., C$, ADMIN$, IPC$) across multiple hosts, especially from a non-administrator host or a standard user account.",
                        "data_sources": [
                            "Zeek smb.log",
                            "Windows Event ID 5140"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Zeek smb.log for 'tree_connect' events or Windows Event ID 5140 for access attempts where the 'ShareName' field matches an administrative share pattern (e.g., `\\\\*\\C$`, `\\\\*\\ADMIN$`, `\\\\*\\IPC$`). Correlate the source of the attempt (user and host) with its known role in the environment. Flag any non-domain-controller or non-admin-workstation source that attempts to connect to administrative shares on more than a few hosts within a short period. Use descriptive statistics to identify sources with an unusually high count of admin share access attempts."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
