[
  {
    "Is the adversary communicating with command and control infrastructure using encoded data? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1132.001 - Standard Encoding": {
          "Unusual network traffic flow patterns, such as a client uploading significantly more data than it downloads from a server.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to calculate byte ratios (sent/received) for network sessions. Use descriptive statistics or box-plots to identify sessions with unusually high or low byte ratios compared to typical traffic for the service/port. Flag sessions where client bytes sent vastly exceed server bytes received."
          },
          "Network sessions containing encoded data in unexpected protocols or with anomalous character sets/patterns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan Zeek logs (conn.log, http.log, etc.) payload data for common encoding patterns (e.g., Base64 strings). Use entropy analysis on payload data within sessions to identify high-entropy data that might indicate encoding or encryption. Correlate findings with known C2 IP addresses or domains."
          },
          "Previously unseen or non-standard processes initiating network connections containing high-entropy data, suggesting encoded C2 communication.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new or rarely seen processes. Correlate these processes with network connections logged in Windows Event ID 5156 or Zeek conn.log. For connections made by these suspicious processes, analyze payload samples (if available via Zeek or other packet capture) for high entropy using entropy measures, or look for patterns indicative of encoding (e.g., Base64). Establish a baseline of common network-communicating processes and flag deviations using frequency analysis."
          },
          "Network traffic on standard ports (e.g., HTTP/80, HTTPS/443) exhibiting characteristics inconsistent with the expected protocol, containing patterns of known encoding schemes.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for unusually long strings in URI paths, query parameters, or POST bodies, especially those matching Base64 or other encoding patterns. For traffic on common ports (e.g., 80, 443) identified in Zeek conn.log that isn't properly parsed by protocol-specific Zeek analyzers (e.g., http.log shows no activity for a port 80 connection), flag for manual review. Calculate character frequency or entropy of suspicious payloads to identify encoded data. Compare against baselines of typical traffic for specific services using descriptive statistics on field lengths or entropy values."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]