```json
[
  {
    "Has the adversary gained initial access to the network via external remote services? (TA0001 - Initial Access)": {
      "Indicator": {
        "Connections to external remote services from IP addresses known to be malicious or associated with credential stuffing campaigns targeting remote service credentials.": {
          "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
          "Data Platform": "Network devices, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Correlate source IP addresses from remote service authentication logs (Windows Event IDs 4624 for success, 4625 for failure) and network connection logs (Zeek conn.log monitoring traffic to VPN, RDP, Citrix, Docker API, K8s API ports) against a continuously updated cyber threat intelligence (CTI) feed of known malicious IPs, TOR exit nodes, or IPs associated with recent credential stuffing campaigns. Alert on any confirmed matches and investigate associated activity."
        },
        "Use of specific tool-related artifacts (e.g., distinctive User-Agent strings, known exploit patterns for common vulnerabilities, default credentials) in connection attempts to external remote services.": {
          "Data": "Zeek http.log; Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek http.log for requests to external remote services (including exposed APIs like Docker/K8s) containing known malicious User-Agent strings, specific exploit patterns targeting vulnerabilities in remote services (e.g., CVEs in Citrix, VPNs), or attempts to use default credentials. Use regular expression matching against a maintained list of such patterns. For non-HTTP services, inspect Zeek conn.log for unusual payload patterns if deep packet inspection is feasible or for connection attempts to services known to be targeted by specific exploitation tools."
        },
        "A cluster of multiple failed login attempts from a single external IP or disparate IPs within the same geolocation to an external remote service, possibly followed by a successful login, indicating brute-force or password spraying activity.": {
          "Data": "Windows Event ID 4625; Windows Event ID 4624",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Aggregate Windows Event ID 4625 (failed login) and 4624 (successful login) for external remote services. Identify high rates of failed logins from single IPs or multiple IPs from similar geolocations targeting one or multiple accounts. Correlate high-volume failed attempts (e.g., >10 failures in 5 minutes from one IP, or >50 failures across >5 IPs from a /24 CIDR targeting a specific account or service) with any subsequent successful logins from those sources. Use descriptive statistics (counts, frequency distributions) and establish dynamic thresholds. Box-plots of failed login counts per source IP can help identify outliers indicative of brute-force attempts."
        },
        "Anomalous login activity to external remote services (VPN, Citrix, RDP) based on deviations from established user or organizational baselines, such as logins from unusual geographic locations, at atypical times, or exhibiting impossible travel scenarios.": {
          "Data": "Windows Event ID 4624; Zeek conn.log",
          "Data Platform": "Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Establish baseline login patterns for users and groups accessing external remote services, considering source IP geolocation, time-of-day/day-of-week, login frequency, and typical session duration using historical Windows Event ID 4624 and Zeek conn.log data. Continuously monitor for deviations. Geolocate source IPs for all remote logins. Employ statistical methods (e.g., Inter-Quartile Range (IQR) for outlier detection, Z-score for deviations, percentile analysis on login times and locations, linear regression for trend anomalies) to flag anomalous logins. Implement 'impossible travel' detection by correlating login timestamps and geolocations for individual accounts, alerting on physically unfeasible sequential logins."
        },
        "Unusual connection patterns or anomalous API interaction with exposed external remote services (e.g., Docker API, Kubernetes API) that do not require authentication, indicative of scanning, discovery, or initial exploitation.": {
          "Data": "Zeek conn.log; Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek conn.log for connections to known ports of exposed, non-authenticating services (e.g., Docker API 2375/2376, K8s API 6443/443, kubelet 10250). Profile normal traffic volume, source IP diversity, and request types/paths (from Zeek http.log if applicable). Use time series analysis (e.g., ARIMA, Exponential Smoothing) to detect significant spikes or changes in traffic patterns from external IPs. Analyze entropy of requested API endpoints or commands from a single external source; unusually high or low entropy compared to baseline may indicate scanning or targeted interaction. Correlate findings with network scans or malformed requests."
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary maintaining persistence using external remote services? (TA0003 - Persistence)": {
      "Indicator": {
        "Connections via external remote services originating from or destined to IP addresses/domains on threat intelligence lists, or involving user accounts previously associated with suspicious activity or compromise.": {
          "Data": "Zeek conn.log; Windows Event ID 4624",
          "Data Platform": "Network devices, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Continuously cross-reference source IP addresses from external remote service logs (Zeek conn.log capturing VPN, Citrix, RDP sessions; Windows Event ID 4624 for logins) against up-to-date threat intelligence feeds for known malicious IPs/domains. Additionally, correlate login events with internal lists of user accounts or IP addresses associated with prior security incidents or confirmed compromises. Alert on any confirmed matches and prioritize investigation for persistent threats."
        },
        "Traffic patterns characteristic of command and control (C2) communication (e.g., regular beaconing, specific data exfiltration signatures, known malicious JA3/SNI hashes) tunneled through established external remote service connections.": {
          "Data": "Zeek conn.log; Zeek ssl.log; Zeek files.log; Windows Event ID 4688",
          "Data Platform": "Network devices, Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "After an external remote session is established (identified via Zeek conn.log, VPN logs, or Windows Event ID 4624), monitor the subsequent network traffic from the internal endpoint involved in the session. Analyze Zeek conn.log for periodic, fixed-interval connections (beaconing) or unusually large/sustained data transfers to external destinations inconsistent with typical user behavior. Inspect Zeek ssl.log for JA3/JA3S hashes or SNI values known to be associated with C2 frameworks. Monitor Zeek files.log for suspicious file transfers (type, size, frequency) over the remote session. Correlate with Windows Event ID 4688 on the accessed host for processes launched during the remote session that might initiate C2 traffic. Use correlation analysis between session start time and these patterns."
        },
        "A valid user account exhibiting persistent, anomalous login behavior to external remote services over an extended period, such as consistent off-hours access from unusual geolocations, or session characteristics markedly different from established individual baselines.": {
          "Data": "Windows Event ID 4624; Zeek conn.log",
          "Data Platform": "Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "For each valid account using external remote services, maintain and update a dynamic baseline of normal login behavior (typical login times, source geolocations, session durations, data transfer volumes, frequency of access) using historical Windows Event ID 4624 and Zeek conn.log data. Continuously monitor for significant long-term deviations. Employ time series analysis to detect gradual or sudden shifts in login frequency or timing patterns. Use geolocation tracking to identify accounts consistently logging in from new or high-risk locations, or those exhibiting 'impossible travel' scenarios repeatedly. Flag accounts with persistently high entropy in login source IPs or login times consistently falling outside of 2-3 standard deviations from their established norm, which could indicate account takeover for persistent access."
        },
        "Use of external remote services to establish connections to high-value internal assets or perform sensitive administrative actions not typical for the user account's role or the context of remote access, especially if MFA appears to be bypassed or satisfied suspiciously.": {
          "Data": "Zeek conn.log; Windows Event ID 4624; Active Directory security logs; MFA logs",
          "Data Platform": "Network devices, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Correlate external remote service access (identified via Zeek conn.log, Windows Event ID 4624) with subsequent internal network activity originating from the endpoint used for the remote session. Monitor for access to critical servers (e.g., domain controllers, financial systems), databases, or administrative interfaces that are anomalous for the user's role or typical remote access behavior. Analyze Active Directory security logs for privileged group modifications or sensitive commands executed. If MFA logs are available, investigate remote sessions that bypassed MFA or where MFA was satisfied under suspicious circumstances (e.g., multiple MFA push notifications followed by approval, logins from new devices). Use regression analysis to identify if specific remote access events correlate with increased internal risk indicators or lateral movement attempts."
        },
        "Sustained or regularly repeated anomalous external connections to non-authenticating remote services (e.g., exposed Docker API, Kubernetes API) from the same external source or range, indicating persistent unauthorized access rather than one-off exploitation.": {
          "Data": "Zeek conn.log; Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Track external IP addresses and their interaction patterns with exposed, non-authenticating remote services (e.g., Docker API on ports 2375/2376, Kubernetes API on 6443/443, kubelet on 10250) using Zeek conn.log and http.log. Profile interaction frequency, session duration, and types of commands/API calls over time for each source. Use time series analysis to detect external sources that maintain unusually long connections, reconnect at regular intervals (suggesting scripted persistence), or issue commands indicative of ongoing malicious activity (e.g., repeatedly deploying malicious containers, querying sensitive information, exfiltrating data) rather than initial reconnaissance. Calculate entropy of API commands per source IP over extended periods; stable, non-zero entropy might indicate persistent interactive use or automated tool activity."
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```