```json
[
  {
    "Has the adversary escalated privileges using token impersonation/theft? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.001 - Token Impersonation-Theft": {
          "Execution of a command containing highly specific strings known to be used by malicious tools for token theft, such as 'incognito' or 'steal_token'.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a high-fidelity alert rule that scans the command line field in Windows Event ID 4688 for exact string matches of known malicious token manipulation commands (e.g., 'incognito', 'steal_token'). Maintain this list based on current cyber threat intelligence. Since these strings are rarely, if ever, legitimate, any match should be considered a high-priority incident for immediate investigation."
          },
          "An unusual process (e.g., cmd.exe, powershell.exe) is created as a child of a service process (e.g., svchost.exe, services.exe) that commonly holds privileged tokens.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for parent-child process relationships. Create and maintain a baseline of normal process ancestry. Flag any instances where processes that typically hold privileged tokens and do not spawn interactive shells (e.g., svchost.exe, services.exe, winlogon.exe, lsass.exe) create a child process of cmd.exe, powershell.exe, or other unexpected binaries. Use descriptive statistics to find rare parent-child combinations across the environment, which can indicate a compromised service being used to launch a shell with stolen token privileges."
          },
          "A handle is requested for a high-privilege process (e.g., lsass.exe, winlogon.exe) by an unusual source process, potentially to steal its token.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable object access auditing and monitor Windows Event ID 4656 (A handle to an object was requested) with a SACL on critical system processes like lsass.exe. Profile the legitimate processes that normally request handles to lsass.exe (e.g., svchost.exe for specific services, legitimate security software). Alert on handle requests from non-standard processes (e.g., powershell.exe, rundll32.exe, Office applications, or processes running from temporary user directories). Analyze the 'Accesses' field in the event for 'ProcessDupHandle' rights, a key indicator for token theft."
          },
          "A process receives a new primary token and subsequently performs privileged actions, such as accessing protected system objects or creating files in system directories, which were not permitted under its original token.": {
            "Data": "Windows Event ID 4696; Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4696 (A primary token was assigned to process) with subsequent object access events (4663 for specific objects, 4656 for handle requests) originating from the same Process ID within a short time window (e.g., 5 minutes). Identify instances where the process receiving the token then accesses objects or performs actions that the original user account should not have access to (e.g., writing to C:\\Windows\\System32, accessing the SAM hive, modifying service configurations). Use correlation analysis to link these events into a single high-confidence alert indicating successful privilege escalation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using token impersonation/theft? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.001 - Token Impersonation-Theft": {
          "Command-line execution containing the exact string 'sekurlsa::pth', used by Mimikatz for pass-the-hash which relies on token creation to impersonate a user.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a high-fidelity alert rule to scan the command-line field of Windows Event ID 4688 for the exact string 'sekurlsa::pth'. Due to its exclusive use in a well-known malicious tool for lateral movement and defense evasion, any detection is a strong indicator of compromise and warrants immediate containment and investigation."
          },
          "Suspicious or anomalous usage of the 'runas' command, particularly when invoked by automated processes, from unusual parent processes, or with credential-saving flags.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'runas.exe' process creations. Establish a baseline of legitimate 'runas' usage by user and parent process. Flag deviations, such as 'runas' being executed by a non-interactive process (e.g., a service), a web server process, or with the '/savecred' flag which facilitates persistence. Use frequency analysis to identify users or systems with an unusually high rate of 'runas' execution, potentially indicating scripted impersonation for defense evasion."
          },
          "A process, such as explorer.exe or an Office application, is observed running under a highly privileged account (e.g., NT AUTHORITY\\SYSTEM) with which it is not typically associated.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the user context field (e.g., 'SubjectUserName') in Windows Event ID 4688 for all process creations. Create a baseline of normal user contexts for common processes. Alert when a process that typically runs as a standard user (e.g., explorer.exe, outlook.exe, winword.exe) is created with the security context of a system account (e.g., SYSTEM, LocalService, NetworkService). Correlate this event with the parent process to identify the source of the token impersonation, a common technique to make malicious activity appear as legitimate system behavior."
          },
          "A process with a recently assigned token initiates network connections to internal resources, mimicking legitimate traffic to evade network-based detection.": {
            "Data": "Windows Event ID 4696; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate host-based token assignment events (Windows Event ID 4696) with network connection events from the same Process ID (Windows Event ID 5156 and Zeek conn.log) within a short time window. Profile the normal network behavior for a given process (e.g., explorer.exe typically does not make SMB connections to multiple servers). Flag instances where a process receives a new token and then immediately initiates connections (e.g., SMB, RDP, WinRM) to other internal systems, especially if that process does not normally initiate such connections or if the destination is a high-value asset. Use linear regression to model normal data flows and detect anomalous spikes in traffic post-token assignment, indicating impersonation for lateral movement."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```