```json
[
  {
    "Is the adversary maintaining persistence using malicious Office add-ins? (TA0003 - Persistence)": {
      "Indicators": {
        "T1137.006 - Add-ins": {
          "Creation of Office add-in files or registry keys that match known malicious indicators such as file hashes, specific filenames, or registry values.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor file creation events (Windows Event ID 4663) in standard Office add-in directories (e.g., AppData\\Roaming\\Microsoft\\AddIns, AppData\\Roaming\\Microsoft\\Word\\STARTUP) and registry modifications (Windows Event ID 4657) for add-in loading keys. Correlate the hashes of new add-in files and the full registry key/value pairs against a high-confidence cyber threat intelligence feed of known malicious add-in IOCs. Alert immediately on any matches."
          },
          "Installation of Office add-ins from suspicious or non-standard file paths, or add-ins that are unsigned or signed by an untrusted publisher.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define a pattern of suspicious add-in installation locations, including temporary directories (%TEMP%), user download folders, or public directories (C:\\Users\\Public\\). Monitor for the creation of add-in files (.xlam, .ppam, .wll) (Windows Event ID 4663) in these locations and for registry keys (Windows Event ID 4657) pointing to them. Use frequency analysis to identify rare add-in installation paths across the enterprise. Check the digital signature status of new add-in files and alert on any that are unsigned or signed by publishers not on an approved allow-list."
          },
          "Anomalous process execution chains originating from an Office application, such as spawning command shells, scripting engines, or living-off-the-land binaries.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) to track parent-child process relationships. Establish a baseline of normal child processes for Office applications (winword.exe, excel.exe, powerpnt.exe, outlook.exe). Alert on significant deviations, particularly the launching of cmd.exe, powershell.exe, wscript.exe, cscript.exe, rundll32.exe, or other known LoLBins. Use correlation analysis to identify hosts where this behavior is recurrent, and use descriptive statistics (e.g., box-plots) to find hosts with an outlier count of such anomalous chains."
          },
          "Office applications or their child processes initiating network connections to external IP addresses, domains with low reputation, or using non-standard ports or protocols.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events originating from Office applications (Windows Event ID 4688) with network connection logs (Zeek conn.log). Baseline the typical network destinations, ports, and protocols for Office applications. Alert when an Office process or its immediate child process initiates connections to external IPs, especially to destinations with no or low reputation, or over ports not associated with standard Office functionality. Use time series analysis on connection logs to detect periodic beaconing behavior indicative of C2 communication tunneled through the Office process."
          },
          "An Office application, after loading an add-in, modifies files or registry keys outside of its normal operational scope, such as creating executables or altering system persistence mechanisms.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "After an Office application starts (Windows Event ID 4688), monitor its subsequent file (Windows Event ID 4663) and registry (Windows Event ID 4657) write activities. Baseline normal file and registry write locations for each Office application. Hunt for behavioral anomalies such as creating executable files in user directories, modifying browser security settings, or creating or modifying system-level persistence keys (e.g., HKLM\\...\\Run). Use entropy measures on the names of files or registry keys written by Office processes to detect unusually random or obfuscated persistence attempts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```