
[
  {
    "Is the adversary attempting to obfuscate command and control traffic using data encoding? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1132 - Data Encoding": {
          "Network traffic destined for or originating from IP addresses or domains known to be associated with C2 infrastructure where the payload exhibits characteristics of encoding.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join network connection logs (Zeek conn.log, http.log, dns.log) with a high-confidence, continuously updated threat intelligence feed of known malicious C2 IPs and domains. For any matches, perform secondary analysis on the associated payload data. Calculate payload entropy; if it is unusually high, or if the data matches Base64 or other encoding patterns, escalate for investigation as it indicates a known adversary is actively using encoding for C2."
          },
          "Presence of Base64 or other standard encoding character sets within unusual fields of common protocols where they are not expected, such as in DNS queries, HTTP headers, or URI parameters.": {
            "Data": "Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use regular expression matching to scan specific protocol fields for patterns indicative of encoding. For Zeek dns.log, search for long (`>50` characters) queries composed primarily of the Base64 character set `[A-Za-z0-9+/=]`. For Zeek http.log, scan User-Agent strings, custom headers, cookies, and URI paths/queries for similar long, encoded strings. Maintain and apply signatures for known C2 encoding patterns within these fields."
          },
          "Statistical anomalies in network data streams suggesting non-standard data representation, such as abnormally high entropy or unusual character frequency distributions.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For network sessions (especially over HTTP, DNS, or custom TCP/UDP ports), calculate the Shannon entropy of the payload data. Establish a baseline entropy for normal traffic on a given port or for a specific application. Use time series analysis or percentile-based thresholds (e.g., flag anything above the 99th percentile) to detect sessions with significantly higher entropy, which suggests encryption or compression commonly used with encoding. A Chi-squared test can also compare payload character distribution against expected distributions for a protocol to find anomalies."
          },
          "Anomalous data size relationships within protocol communications, such as unusually large DNS queries or asymmetric HTTP traffic where request size is disproportionate to response size.": {
            "Data": "Zeek dns.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the byte sizes of requests and responses within protocols. For Zeek dns.log, flag any DNS query payloads that are unusually large (e.g., >100 bytes), as this can be a channel for encoded data exfiltration. For Zeek http.log, calculate the ratio of request bytes to response bytes (`orig_bytes`/`resp_bytes` from conn.log). Use descriptive statistics and box plots to find outliers where this ratio is abnormally high or low compared to typical traffic for that destination, which could indicate C2 beacons or data staging."
          },
          "An internal process, not typically associated with network communications or running from an unusual path, initiating network connections that contain encoded data.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connections from Zeek conn.log with the initiating process on the host using Windows Event ID 5156 (`Application Name` field). Maintain a frequency baseline of common network-connecting processes. Flag connections from unexpected processes (e.g., `notepad.exe`, `calc.exe`) or processes running from non-standard locations (e.g., `%APPDATA%`). For these flagged connections, analyze the network traffic for high entropy or other encoding indicators. Use parent-child process analysis from Windows Event ID 4688 to identify suspicious chains (e.g., Office document spawns PowerShell which initiates a high-entropy connection)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
