[
  {
    "Has the adversary escalated privileges using token impersonation/theft? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.001 - Token Impersonation-Theft": {
          "Detection of Windows API calls related to token duplication and impersonation (DuplicateToken(Ex), ImpersonateLoggedOnUser, SetThreadToken).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (focus on correlating process creation Event ID 4688 with other activity) for events potentially indicative of API calls like DuplicateToken(Ex), ImpersonateLoggedOnUser, SetThreadToken by analyzing call stacks or associated activities if available in logs. Correlate with command-line arguments from 4688 events."
          },
          "Unusual changes to process or thread tokens, potentially assigning higher privileges than the original process/thread.": {
            "Data": "Windows Event ID 4696",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4696 (A primary token was assigned to process). Analyze events for unusual token assignments, especially to processes that previously ran with lower privileges. Correlate token assignment events over time to identify persistent changes in process token privileges."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using token impersonation/theft? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.001 - Token Impersonation-Theft": {
          "Suspicious usage of the 'runas' command or similar functionality via command-line or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for process creations containing 'runas' in the command line. Investigate the user executing the command and the target command being run to identify unauthorized or suspicious privilege assumption."
          },
          "Creation of new processes or modification of existing threads using duplicated or impersonated tokens.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4696",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) and 4696 (Token Assignment) for new processes or modified threads. Correlate these events with preceding activity (e.g., successful token theft) and examine the assigned token's privileges (if available in logs or correlated). Use correlation analysis to link token-related events across multiple logs for a single process execution chain."
          }
        }
      }
    }
  }
]