[
  {
    "Has the adversary escalated privileges by creating a process with a stolen or manipulated token? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.002 - Create Process with Token": {
          "Detection of 'runas' command or similar privilege escalation command-line usage.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments containing 'runas' or similar process creation/privilege commands. Analyze the parent process and user context of the 'runas' execution for anomalies."
          },
          "Creation of processes with different user tokens not initiated by standard OS functions or known legitimate applications, potentially via API calls.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and 4624. Identify processes (Event ID 4688) where the 'SubjectUserSid' (creator) differs significantly from the 'NewProcessId's' user context or associated logon session (from correlating with Event ID 4624 using Logon ID). Look for process creations without a clear parent process or from unusual parent processes. Use correlation analysis between 4688 and 4624 events based on Logon ID."
          }
        }
      }
    }
  },
  {
    "Is the adversary bypassing defenses by creating a process with a stolen or manipulated token? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.002 - Create Process with Token": {
          "Use of 'runas' command or similar from unexpected processes or user contexts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing 'runas'. Baseline normal 'runas' usage (user, parent process) for different systems/users. Flag executions where the user or parent process deviates from the established baseline using descriptive statistics."
          },
          "Anomalous process creation where the parent-child process relationship or user token context is inconsistent with normal behavior, potentially indicating API use.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 entries focusing on processes created with unusual token/logon information (correlate with 4624 by Logon ID). Examine process creation times and parent-child relationships using time series analysis or graphical representations to identify anomalous process trees not typical for the host or user."
          }
        }
      }
    }
  }
]