[
  {
    "Is the adversary maintaining persistence by creating local accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1136.001 - Local Account": {
          "Detection of suspicious command-line parameters or processes associated with local account creation (e.g., net user /add, useradd, dscl -create) on endpoints or servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creations containing command-line arguments like 'net user /add', 'useradd', or 'dscl -create'. Correlate these events with parent processes and user accounts initiating the commands. Use statistical analysis to identify outliers in terms of user accounts running these commands or frequency of execution over time."
          },
          "Presence of Windows Event ID 4720 indicating user account creation, or identification of unusual local accounts during system audits.": {
            "Data": "Windows Event ID 4720",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event ID 4720 logs across all servers and endpoints. Identify newly created local accounts, particularly those with unusual naming conventions or lack of documentation. Perform regular audits of local accounts on systems; use correlation analysis to identify accounts created shortly before or after other suspicious activity detected on the host."
          },
          "Detection of local account creation events within Authentication, Authorization, and Accounting (AAA) logs from network devices.": {
            "Data": "Network device AAA logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze AAA logs from network infrastructure devices. Filter logs for events indicating local user account creation commands (e.g., 'username', 'useradd'). Use frequency analysis or statistical process control to identify creation events occurring outside normal maintenance windows or by unusual administrative accounts."
          },
          "Correlation of newly created local accounts (Event ID 4720) with network activity (Zeek conn.log) from or to the host where the account was created, occurring shortly after creation.": {
            "Data": "Windows Event ID 4720; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4720 (user account created) events with Zeek conn.log activity involving the host where the account was created, within a specified time window (e.g., 30 minutes) after the event. Analyze Zeek logs for connections initiated by or directed to the host shortly after the new account creation. Look for connections to unusual destinations, ports, or high data volumes, potentially using time series analysis to identify anomalies compared to the host's baseline network behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]