[
  {
    "Is the adversary maintaining persistence using Outlook Forms? (TA0003 - Persistence)": {
      "Indicators": {
        "T1137.003 - Outlook Forms": {
          "Detection of malicious or suspicious custom Outlook forms via detection script output.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Run Microsoft's PowerShell script or SensePost's NotRuler tool across endpoints/servers running Outlook/Exchange. Analyze script output for reported malicious or suspicious custom forms. Investigate processes launched around the time emails are received matching the form's trigger criteria using Event ID 4688. Use correlation analysis to link form detection with process activity."
          },
          "Abnormal child process creation originating from the Outlook process (e.g., outlook.exe launching suspicious executables or script interpreters).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints running Outlook. Identify child processes spawned by outlook.exe. Establish a baseline of normal child processes (e.g., winword.exe, excel.exe, Teams.exe). Flag and investigate any child processes outside the baseline, particularly command interpreters (cmd.exe, powershell.exe), script hosts (wscript.exe, cscript.exe), or unusual executables. Use descriptive statistics to understand common process relationships and entropy measures to identify unusual command lines or execution patterns."
          },
          "Network connections initiated by the Outlook process to external or unusual destinations, potentially indicative of C2 communication or data exfiltration triggered by form execution.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 5157",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event IDs 5156/5157 (if enabled) for outbound network connections where the originating process is outlook.exe. Establish a baseline of normal connections made by outlook.exe (e.g., to Exchange servers, O365 endpoints). Flag connections to external IP addresses or domains not in the baseline, especially those associated with known C2 infrastructure (using threat intelligence correlation). Use correlation analysis to link these connections to suspicious process activity or form detection events."
          },
          "Modification or creation of Outlook form definition files or related registry keys in user profiles or system locations.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for access attempts (creation, modification, write) targeting Outlook form files (e.g., .oft, .fdm extensions) or relevant registry keys (e.g., `HKCU\\Software\\Microsoft\\Office\\*\\Outlook\\Forms`, `HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\*\\Outlook\\Forms`). Focus on write/create actions. Correlate these events with process creation (Event ID 4688) to identify the process responsible for the modification. Establish baselines for authorized processes modifying these locations (e.g., Outlook installer, admin scripts) and flag actions by unusual processes using frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]