[
    {
        "information_requirement": "Is the adversary maintaining persistence using Outlook Forms?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1137.003",
                "name": "Outlook Forms",
                "evidence": [
                    {
                        "description": "Network connections from outlook.exe to known malicious IP addresses or domains, or detection of Outlook form files (.oft, .fdm) with known malicious file hashes.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join network connection logs originating from endpoints running Outlook (identified in Zeek conn.log) with a continuously updated cyber threat intelligence feed of known malicious C2 IPs/domains. Separately, use endpoint agents to hash Outlook form files (.oft, .fdm) during file write events (monitored via Windows Event ID 4663) and compare hashes against a known malicious file hash database. Alert on any matches."
                    },
                    {
                        "description": "Child processes of outlook.exe are created with command-line arguments matching known malicious patterns, such as downloading payloads or executing obfuscated scripts.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze the command-line arguments of all child processes spawned by outlook.exe (from Windows Event ID 4688). Use regular expression matching to search for patterns commonly used by malware, such as `powershell -enc`, `IEX(New-Object Net.WebClient).DownloadString`, `mshta.exe javascript:`, or `certutil -urlcache`. Maintain and regularly update a list of these malicious command-line patterns for alerting."
                    },
                    {
                        "description": "The Outlook process (outlook.exe) spawns an abnormal child process, such as a command interpreter or scripting engine, that deviates from established baseline activity.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) where the parent process is outlook.exe. Establish and maintain a baseline of legitimate child processes for different user groups (e.g., winword.exe, teams.exe, browser processes). Alert on any deviation from this baseline, especially the creation of command interpreters (cmd.exe, powershell.exe), scripting hosts (wscript.exe, cscript.exe), or any unsigned/uncommon executable. Use descriptive statistics on process names and entropy measures on command-line arguments to identify outliers and suspicious activity."
                    },
                    {
                        "description": "The Outlook process initiates network connections to unusual or low-reputation external destinations not associated with standard email or cloud services.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal destination IPs, domains, and ports for traffic originating from endpoints running outlook.exe. Monitor Zeek conn.log for connections from these endpoints that deviate from the established baseline. Flag connections to non-corporate, non-Microsoft O365 IP space, newly registered domains, or destinations with poor reputation scores. Use time series analysis to detect sudden increases in the volume of anomalous connections from Outlook across the enterprise."
                    },
                    {
                        "description": "Anomalous modification or creation of Outlook form files (.oft, .fdm) or related persistence registry keys by an unauthorized process.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4657",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable auditing and monitor for file system modifications (Windows Event ID 4663) to Outlook Forms folders and for registry modifications (Windows Event ID 4657) to `HKCU\\Software\\Microsoft\\Office\\*\\Outlook\\Forms`. Correlate modification events with the responsible process using process tracking and Event ID 4688. Baseline legitimate processes that perform these actions (e.g., outlook.exe, setup.exe, approved admin tools). Alert on modifications made by unexpected processes such as powershell.exe, cmd.exe, or a script spawned from a document. Use frequency analysis to identify rare processes modifying these persistence locations."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
