
[
  {
    "Is the adversary communicating via command and control using non-standard encoding? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1132.002 - Non-Standard Encoding": {
          "TLS handshakes (JA3/JA3S hashes) or other network artifacts (e.g., specific static HTTP headers) matching known threat actor tools that utilize non-standard encoding for C2.": {
            "Data": "Zeek ssl.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Compare JA3/JA3S client and server hashes from Zeek ssl.log and specific combinations of HTTP headers/values from Zeek http.log against a continuously updated Cyber Threat Intelligence (CTI) feed of indicators associated with malware families and tools known to use custom C2 encoding. Inner join network logs with the CTI feed and alert on any matches for immediate investigation."
          },
          "Network traffic containing structured data that violates protocol specifications but follows a consistent, non-standard pattern, such as DNS queries with fixed-length, high-entropy subdomains or HTTP requests with unusual, static custom headers.": {
            "Data": "Zeek dns.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for queries where subdomains have an abnormally long length and high character set diversity but maintain a consistent length across multiple queries from the same source, suggesting a patterned data tunnel. In Zeek http.log, hunt for the presence of unusual, static custom headers (e.g., X-Session-ID, X-Config) across multiple requests to the same domain. Use correlation analysis to link these patterns with beaconing behavior (periodic connections to the same host) identified in Zeek conn.log."
          },
          "Network sessions with highly asymmetric data flow or unusual data transfer volumes inconsistent with established protocol norms, suggesting hidden C2 communication.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each protocol and destination port, establish a baseline of the typical ratio of bytes sent (orig_bytes) vs. received (resp_bytes) using historical Zeek conn.log data. Use time series analysis and descriptive statistics (mean, median, Inter-Quartile Range) to model this baseline. Continuously monitor and flag sessions where the ratio is a significant outlier (e.g., > 3x IQR from the median), especially client-initiated sessions with large outbound data volumes on ports like 80, 443, or 53. Use box plots to visually identify these statistical outliers per protocol."
          },
          "Presence of high-entropy data within protocol fields that should typically contain human-readable text or structured data, indicating probable encryption or custom encoding.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Calculate the Shannon entropy for specific text-based fields within network protocols (e.g., HTTP URI paths/parameters, User-Agents, POST bodies; DNS query names; SSL SNI values). Establish a baseline entropy score for each field type across the network. Flag any instances where the entropy score significantly exceeds the baseline (e.g., > 2 standard deviations above the mean), suggesting the presence of non-standard encoded data. Correlate high-entropy findings with other suspicious connection metadata, such as rare domains, long connection durations, or asymmetric data flows."
          },
          "Network connections containing anomalously encoded data that originate from a process not typically associated with network activity or that is running from an unusual file path.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection data (Windows Event ID 5156 or Zeek conn.log) with process creation data (Windows Event ID 4688) using timestamp and source IP/port. Develop a baseline of processes that normally initiate outbound connections from endpoint and server populations. Alert on connections from rare or unknown processes, especially if they are communicating with low-reputation domains or the network traffic exhibits high entropy or asymmetric data flow patterns. Use frequency analysis on process command lines and parent processes to identify behavioral outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
