[
  {
    "Is the adversary performing network and host discovery to identify resources? (TA0007 - Discovery)": {
      "Indicators": {
        "T1135 - Network Share Discovery": {
          "Execution of commands or scripts associated with network share discovery (e.g., net view, net share, sharing -l) on hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events containing command-line arguments like 'net view', 'net share', or 'sharing -l'. Correlate execution with user accounts and machine names. Use frequency analysis to identify unusually high occurrences of these commands from specific sources or users."
          },
          "Anomalous SMB/file sharing network traffic patterns, including scanning activity or connections to shares from unexpected sources.": {
            "Data": "Zeek smb.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smb.log for connections and share enumeration attempts. Look for a high frequency of connections to multiple hosts/shares from a single source IP within a short timeframe (indicating scanning). Analyze Zeek conn.log for connections on SMB ports (445, 139) with unusual source/destination pairs or patterns using descriptive statistics on connection counts per host."
          },
          "Attempts to enumerate or access administrative/default shares (C$, Admin$, IPC$) on multiple remote systems via SMB.": {
            "Data": "Zeek smb.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek smb.log for 'tree_connect' events where the 'path' field indicates an administrative share (e.g., 'C$', 'ADMIN$', 'IPC$'). Group events by source IP and count the number of unique destination hosts or share names accessed within a specific timeframe. Flag source IPs exhibiting access attempts to an unusually high number of hosts or shares using percentile analysis or IQR."
          },
          "Execution of host-based commands (PowerShell, WMI, net.exe) to list network shares, especially from suspicious processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command line arguments containing 'net view', 'net share', 'sharing -l', 'powershell.*Get-SMBShare', 'powershell.*Get-ChildItem \\\\', 'wmic.*share'. Correlate with parent process names (using Event ID 4688's parent process field). Identify and flag executions of these commands by non-standard parent processes or in unusual directories. Use frequency analysis to detect users/systems performing a large volume of share discovery commands."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]