[
  {
    "Has the adversary escalated privileges using token manipulation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.003 - Make and Impersonate Token": {
          "Creation of new logon sessions (Logon Type 9 - NewCredentials) with high privileges initiated by non-standard parent processes.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 for Logon Type 9 (NewCredentials). For each event, identify the process name (via Event ID 4688 correlating Logon/Process IDs) that initiated the logon. Flag events where the initiating process is not a standard OS or admin tool. Analyze the user account used for the new logon session for high privileges (e.g., administrators, SYSTEM). Use descriptive statistics on initiating processes to identify outliers or low-frequency occurrences."
          },
          "Execution of runas command with administrator privileges or for high-privilege accounts by non-administrator users.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creations where CommandLine contains 'runas '. Extract the full command line and the user executing the command. Identify executions by users who are not administrators or where the target specified is a high-privilege account. Use frequency analysis to identify rare users or parent processes executing 'runas'."
          },
          "Correlation of successful logon events (Logon Type 9) with subsequent process creation or file access by the new token's user, especially if the original process was not a standard system utility or the user's normal activity.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful logon events with Logon Type 9 (NewCredentials) using Event ID 4624. Track the Logon ID. Within a short time window (e.g., 1-10 seconds) following the logon, search for process creation events (Event ID 4688) or sensitive file access events (Event ID 4663 on protected resources) associated with the new Logon ID. Correlate these sequences and analyze the parent process of the Logon Type 9 event and the nature of the subsequent actions. Flag patterns that deviate significantly from typical user or service behavior using frequency analysis on process names and accessed resources."
          },
          "Execution of the runas command launching processes associated with privilege escalation tools or attempts to modify system configurations/credentials.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creations where CommandLine contains 'runas '. Extract the full command line and the Target Process (ProcessName and CommandLine of the process launched by 'runas'). Maintain a list of known privilege escalation tool names or command patterns. Flag executions where the Target Process matches a known privesc tool or attempts suspicious system modifications (e.g., registry changes, service modifications) shortly after being launched via 'runas'. Use correlation analysis to link the 'runas' execution with subsequent actions by the target process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary bypassing defenses using token manipulation? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.003 - Make and Impersonate Token": {
          "Unusual sequence of events involving a new logon session (Logon Type 9) followed quickly by sensitive file access or process creation.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify Windows Event ID 4624 (Logon Type 9) events. Within a short time window (e.g., 5 seconds), search for subsequent sensitive actions by the same user account, such as file access (Event ID 4663 for sensitive files/paths) or process creation (Event ID 4688 for suspicious process names/paths). Use time series analysis or event correlation rules to link these events and flag sequences not observed in baseline behavior."
          },
          "Execution of runas command by processes other than standard shells (cmd.exe, powershell.exe) or expected administration tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creations where CommandLine contains 'runas '. Analyze the ParentProcessName field. Flag executions where ParentProcessName is not a standard user shell or expected admin tool. Use descriptive statistics to identify the most common parent processes for 'runas' across the environment and flag significant deviations or low-frequency occurrences."
          },
          "Outbound network connections originating from a process that recently created a new logon session (Logon Type 9), especially if the destination or protocol is unusual for the original user/process context.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful logon events with Logon Type 9 (NewCredentials) using Event ID 4624, noting the Process ID and new Logon ID. Identify the corresponding process details (Path, Name, CommandLine) using Event ID 4688. Within a short time window, correlate these with outbound network connection events (Event ID 5156 on host, Zeek conn.log on network) originating from the same Process ID or associated with the new Logon ID. Use frequency analysis on destination IPs/ports/protocols and compare to baselines for that process/user/host. Flag connections that are rare or match known C2 infrastructure using correlation with threat intelligence feeds."
          },
          "Modification of sensitive system files, registry keys, or security policies by a user operating under a newly created logon session (Logon Type 9).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful logon events with Logon Type 9 (NewCredentials) using Event ID 4624, noting the new Logon ID. Within a short time window, search for sensitive object access (Event ID 4663 for files/directories, Event ID 4657 for registry keys) or policy changes performed by the user associated with the new Logon ID. Focus on critical system directories (e.g., C:\\Windows\\System32), program files, and security-related registry hives (e.g., SAM, SECURITY, SYSTEM). Flag modifications that are unusual for the user or the system baseline. Use correlation analysis to link the Logon Type 9 event to the subsequent modifications."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]