[
  {
    "Has the adversary established persistence by creating unauthorized accounts? (TA0003 - Persistence)": {
      "Indicators": {
        "T1136 - Create Account": {
          "New user accounts detected that were not created through standard administrative processes or are assigned high privileges unexpectedly.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4720 (Account Creation) and group membership change events (4728, 4732, 4756) across Domain Controllers and critical servers. Correlate new accounts with group additions, especially to privileged groups (Administrators, Domain Admins, etc.). Compare creation timestamps against known authorized administrative changes. Flag accounts created outside of change windows or assigned excessive privileges upon creation."
          },
          "Detection of unusual patterns in account creation activity or discrepancies found during account audits of local or domain accounts.": {
            "Data": "Windows Event ID 4720",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4720 logs over time using time series analysis or statistical process control to identify sudden spikes or unusual frequencies of account creation events across the environment. Implement regular audits of user accounts (scripts, tools) to identify accounts lacking proper documentation or following naming conventions, potentially using entropy measures on account names or similarity analysis against known good accounts."
          },
          "Execution of suspicious commands or scripts associated with local or domain account creation/modification via command line or scripting interfaces.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4720; Windows Event ID 4722; Windows Event ID 4738",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints and servers for execution of `net user`, `net group`, `wmic useraccount`, or scripting tools (PowerShell, wscript, cscript) with parameters indicative of account creation, modification, or enablement (e.g., `/add`, `/active:yes`, group names). Correlate these 4688 events with account-related events (4720, 4722, 4738) occurring shortly after on the same or targeted system. Use correlation analysis to link suspicious command executions to account changes. Calculate the frequency of specific command usage per user/host and flag rare occurrences (e.g., using frequency distribution or percentiles)."
          },
          "Suspicious network connections originating from a host immediately following execution of commands or scripts related to account creation.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints and servers for execution of account creation commands (`net user`, `useradd`, `wmic`). For systems where such commands were executed, analyze Zeek conn.log entries originating from that system's IP address within a short time window (e.g., 60 seconds) after the command execution event. Calculate metrics for these connections (e.g., bytes transferred, destination IP, port, protocol). Flag connections to unusual or external destinations, or those using non-standard ports or protocols, potentially using outlier detection (e.g., IQR on bytes transferred, frequency analysis on destination ports/IPs) or comparing connection patterns to historical baselines using time series analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]