
[
  {
    "Is the adversary maintaining persistence via Outlook Rules? (TA0003 - Persistence)": {
      "Indicators": {
        "T1137.005 - Outlook Rules": {
          "An Outlook rule launches a process whose executable hash matches known malware, or a process launched by an Outlook rule connects to a known malicious domain or IP address.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For every child process launched by 'OUTLOOK.EXE' (identified via Windows Event ID 4688), calculate and lookup the file hash of the child executable against a threat intelligence feed of known malware. Concurrently, monitor network connections (Zeek conn.log) and DNS requests (Zeek dns.log) from Outlook and its child processes. Correlate destination IPs and domains against a CTI feed of known command and control (C2) servers. Alert on any confirmed matches."
          },
          "Execution of tools or specific script command lines known to programmatically create or modify Outlook rules, such as MFCMapi or PowerShell using Exchange-related cmdlets.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Generate alerts for any execution of 'MFCMapi.exe'. For PowerShell execution ('powershell.exe'), analyze command-line arguments for keywords related to programmatic Outlook rule manipulation, such as 'New-InboxRule', 'Set-InboxRule', 'EWS', 'Mailbox', or 'Microsoft.Exchange.WebServices'. Use regular expression matching to find these patterns, and use frequency analysis to identify rare command-line patterns or parent processes for PowerShell."
          },
          "The Outlook process (outlook.exe) spawns an unexpected or high-risk child process not associated with legitimate email activity, such as a command shell or scripting engine.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for all process creation events where the Parent Process Name is 'OUTLOOK.EXE'. Establish a baseline of normal child processes (if any) in the environment. Alert on any deviation from this baseline, with high-priority alerts for the creation of 'cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', or any executable running from a temporary or user-writable directory (e.g., %APPDATA%, %TEMP%). Use descriptive statistics on parent-child process relationships to identify rare or first-seen occurrences."
          },
          "A process spawned by an Outlook rule initiates suspicious network behavior or executes from an anomalous file path, indicating malicious activity triggered by an email.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) where 'OUTLOOK.EXE' is the parent with subsequent network connection data (Zeek conn.log, http.log). Investigate child processes that: 1) Execute from unusual locations (e.g., AppData\\Local\\Temp, C:\\Users\\Public\\). 2) Initiate network connections to non-standard ports, low-reputation IPs, or newly registered domains. 3) Exhibit C2-like beaconing behavior, which can be identified via time series analysis of connection intervals in Zeek conn.log. Use correlation analysis to explicitly link a specific child process execution to its subsequent suspicious network behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
