[
  {
    "Has the adversary escalated privileges using access token manipulation? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1134 - Access Token Manipulation": {
          "Inconsistencies in process/thread token information, such as processes owned by a standard user impersonating the SYSTEM account.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes running under the SYSTEM account where the Parent Process is not a standard system process or was created by a non-SYSTEM user. Use correlation analysis between Event 4688 and potential service creation events (4697) or logon events (4624) to identify suspicious privilege escalations."
          },
          "Detection of the 'runas' command execution or suspicious process creation associated with token manipulation API calls.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable command-line auditing (Event ID 4688). Search for command lines containing 'runas'. Additionally, look for suspicious parent-child process relationships associated with common token manipulation tools or scripts by analyzing process trees derived from Event ID 4688 ParentProcessId."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using access token manipulation? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1134 - Access Token Manipulation": {
          "Network connections originating from a process under an impersonated token that are inconsistent with the original user's normal activity or security context.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes potentially running under elevated or impersonated tokens (based on analysis of Event ID 4688). Correlate these processes with network connection logs (Zeek conn.log) originating from the host. Analyze network traffic patterns (destination, protocol, volume) using statistical methods (e.g., descriptive statistics, anomaly detection) for connections made by these processes that deviate significantly from established baselines for the host or the original user."
          },
          "Discrepancies between the Parent Process ID (PPID) reported by different sources (e.g., Event ID 4688 vs. ETW data).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Reconstruct process trees using the Creator Process ID/Name and New Process Id fields. Look for breaks or inconsistencies in the process tree where a child process's reported parent does not logically match the actual process that initiated it, potentially indicating PPID spoofing or manipulation affecting audit trails."
          }
        }
      }
    }
  }
]