[
  {
    "Has the adversary escalated privileges using SID-History Injection? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.005 - SID-History Injection": {
          "Presence of unusual or unexpected SIDs in user SID-History attributes, especially SIDs from the same domain.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5136 on Domain Controllers for modifications to user objects where the 'sIDHistory' attribute is changed. Investigate events where the new sIDHistory value contains SIDs originating from the same domain or known privileged SIDs. Compare against a baseline of expected SID history changes (e.g., during legitimate domain migrations)."
          },
          "Successful or failed account management events indicating modification of SID-History.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5136 on Domain Controllers for modifications to user objects, specifically tracking changes to the 'sIDHistory' attribute. Analyze event logs for successful modifications. Use correlation analysis to link these modifications to other account management activity by the modifying account or user."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using SID-History Injection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.005 - SID-History Injection": {
          "SID-History attributes modified on non-migration-related accounts containing SIDs granting access to sensitive resources or domains.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Periodically audit user accounts for the presence of sIDHistory values. Query Active Directory or monitor Event ID 5136 for user accounts with non-empty sIDHistory attributes that are not documented as part of domain migration processes, particularly for high-value or recently active accounts. Use statistical methods (e.g., frequency distribution) to identify accounts with sIDHistory that deviate significantly from the norm or expected patterns."
          },
          "Unusual spikes or patterns in account management events targeting SID-History attribute.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the volume and frequency of Windows Event ID 5136 events indicating modifications to the 'sIDHistory' attribute on Domain Controllers. Use time series analysis or statistical process control (e.g., upper control limits) to detect sudden spikes or unusually high rates of these events, indicating potential automated attempts to modify SID history on multiple accounts as a defense evasion technique."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]