[
  {
    "Is the adversary maintaining persistence using Office Template Macros? (TA0003 - Persistence)": {
      "Indicators": {
        "T1137.001 - Office Template Macros": {
          "Modification of Office template files (e.g., Normal.dotm, PERSONAL.XLSB) or relevant registry keys (e.g., GlobalDotName).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (4656/4663 for file access, 4657 for registry modification, 4688 for process creation) for changes to standard Office template paths (AppData\\Roaming\\Microsoft\\Templates, AppData\\Roaming\\Microsoft\\Excel\\XLSTART) or modifications to the GlobalDotName registry key. Investigate processes modifying these files/keys that are not standard software installers or updates. Use correlation analysis between process creation and file/registry modification events targeting these specific locations."
          },
          "Office application process (WINWORD.EXE, EXCEL.EXE) loading a template from an unusual location or executing unexpected macros on startup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for WINWORD.EXE or EXCEL.EXE processes starting. Analyze command-line arguments for non-standard template file paths being loaded. Analyze process ancestry to identify suspicious parent processes launching Office applications. Look for Office processes launching child processes (e.g., cmd.exe, powershell.exe) immediately after startup, which could indicate macro execution. Use frequency analysis to identify rare parent-child process combinations involving Office applications."
          },
          "Office application (WINWORD.EXE, EXCEL.EXE) initiating network connections to external or unusual internal destinations shortly after startup, potentially loading a remote template.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from systems running Office applications (Endpoints). Correlate Zeek logs with Windows Event ID 4688 to identify network connections made by WINWORD.EXE or EXCEL.EXE. Analyze connections occurring shortly after process creation time (from Event ID 4688) targeting external or unusual internal IPs/ports. Use frequency analysis to identify rare destination IPs or ports accessed by Office processes compared to historical data."
          },
          "Modification of registry keys controlling Office macro security settings.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Registry Value Set) for modifications to registry keys specifically associated with Office macro security levels (e.g., under `Software\\Microsoft\\Office\\<version>\\<application>\\Security\\Macro Settings`). Flag any changes to values that lower the security level (e.g., setting a value that enables macros without notification). Use correlation analysis to link these specific registry modifications to the process that made the change (found in the event data)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]