[
  {
    "Has the adversary escalated privileges using SID-History Injection? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.005 - SID-History Injection": {
          "Presence of unusual or unexpected SIDs in user SID-History attributes, especially SIDs from the same domain.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5136 on Domain Controllers for modifications to user objects where the 'sIDHistory' attribute is changed. Investigate events where the new sIDHistory value contains SIDs originating from the same domain or known privileged SIDs. Compare against a baseline of expected SID history changes (e.g., during legitimate domain migrations)."
          },
          "Successful or failed account management events indicating modification of SID-History.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5136 on Domain Controllers for modifications to user objects, specifically tracking changes to the 'sIDHistory' attribute. Analyze event logs for successful modifications. Use correlation analysis to link these modifications to other account management activity by the modifying account or user."
          },
          "Unusual LDAP modification requests targeting the 'sIDHistory' attribute of user objects on Domain Controllers, potentially adding privileged SIDs.": {
            "Data": "Zeek ldap.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ldap.log for 'modifyRequest' operations targeting user objects where the attribute 'sIDHistory' is present in the modification list. Analyze the frequency of such requests, the source IPs, and the user accounts being modified. Flag requests originating from unusual IPs or accounts, or a sudden spike in the volume of such requests using time series analysis. If possible, parse the modification data within the log to identify potentially added privileged SIDs (e.g., Domain Admins, Enterprise Admins)."
          },
          "Logon events by an account whose SID-History was recently modified, demonstrating successful authentication with potentially elevated privileges.": {
            "Data": "Windows Event ID 5136; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 5136 events showing modification of 'sIDHistory' for a user account with subsequent successful logon events (Windows Event ID 4624) for the same account on Domain Controllers or critical servers. Analyze the logon type (e.g., Interactive, Network) and consider correlating with access to resources that the original account SIDs would not permit. Prioritize analysis based on accounts where sensitive SIDs (e.g., Domain Admins, Enterprise Admins) were potentially injected."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using SID-History Injection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.005 - SID-History Injection": {
          "SID-History attributes modified on non-migration-related accounts containing SIDs granting access to sensitive resources or domains.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Periodically audit user accounts for the presence of sIDHistory values. Query Active Directory or monitor Event ID 5136 for user accounts with non-empty sIDHistory attributes that are not documented as part of domain migration processes, particularly for high-value or recently active accounts. Use statistical methods (e.g., frequency distribution) to identify accounts with sIDHistory that deviate significantly from the norm or expected patterns."
          },
          "Unusual spikes or patterns in account management events targeting SID-History attribute.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the volume and frequency of Windows Event ID 5136 events indicating modifications to the 'sIDHistory' attribute on Domain Controllers. Use time series analysis or statistical process control (e.g., upper control limits) to detect sudden spikes or unusually high rates of these events, indicating potential automated attempts to modify SID history on multiple accounts as a defense evasion technique."
          },
          "LDAP modification requests targeting the 'sIDHistory' attribute originating from unexpected sources or using methods not typical for legitimate migration activities.": {
            "Data": "Zeek ldap.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ldap.log for 'modifyRequest' operations on 'sIDHistory'. Establish a baseline for legitimate SID-History modification activity (usually rare, tied to migration projects). Flag any such modifications occurring outside these expected windows, from unexpected source IPs (especially non-DC IPs modifying objects), or targeting accounts not involved in migrations. Use time series analysis to identify anomalies in volume or timing."
          },
          "Account logons leveraging injected SIDs to bypass standard access controls or perform actions without triggering typical alerts for the account's original privileges.": {
            "Data": "Windows Event ID 5136; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 5136 events (sIDHistory modification) with subsequent Windows Event ID 4624 (successful logon) for the modified account. Analyze the activities performed by this account post-logon (requires correlation with other logs like file access, process creation, network connections) to identify actions requiring privileges granted by the injected SIDs, particularly if these actions would normally be blocked or heavily monitored for the original account's privilege level. Use correlation analysis to link the SID-History modification event with the privileged activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]