[
  {
    "Is the adversary communicating via command and control using non-standard encoding? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1132.002 - Non-Standard Encoding": {
          "Network traffic exhibiting significantly asymmetric data flow inconsistent with expected protocol behavior (e.g., client sending more data than receiving, or unexpected large outbound data chunks).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dce_rpc.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to calculate bytes sent (orig_bytes) and bytes received (resp_bytes) per connection. Calculate ratios (orig_bytes / resp_bytes) and identify connections with extreme ratios, especially for client-initiated sessions where orig_bytes >> resp_bytes. Use descriptive statistics and box plots to identify outliers in data volume and flow direction per protocol/port."
          },
          "Analysis of packet content showing encoding or data patterns that deviate from standard protocols used on observed ports.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek logs (http.log, dns.log, etc.) for data fields known to carry C2 traffic (e.g., HTTP request bodies/headers, DNS query names). Apply entropy calculations to these data fields to identify strings with unusually high randomness, indicative of non-standard encoding like modified Base64. Correlate high entropy findings with connections flagged for anomalous data flow."
          },
          "Network connections initiated by processes on endpoints or servers that do not typically establish outbound network connections or have unknown/rare executable paths.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) to collect process names and command lines. Monitor Windows Event ID 5156 (Network Connection) or Zeek conn.log to identify network connections and the processes initiating them (correlation needed via time/source IP/PID if available). Maintain a baseline of processes typically establishing outbound connections on endpoints and servers. Flag connections initiated by processes with low frequency of occurrence in the baseline or unknown/suspicious executable paths. Use descriptive statistics to count connections per process path and identify rare outliers."
          },
          "Presence of non-standard characters or data formats in network traffic fields that should conform to specific protocol specifications (e.g., unusual characters in DNS queries, malformed HTTP headers/bodies).": {
            "Data": "Zeek dns.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs for specific protocol fields known to be used for C2 (e.g., DNS query names in dns.log, HTTP Host headers or request bodies in http.log, SSL SNI in ssl.log). Develop rules or use pattern matching (including regex for identifying encoded patterns like modified Base64 or unusual character sets) to identify deviations from expected protocol formats or data that fails protocol validation checks. Correlate findings with connection details in conn.log."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]