[
  {
    "Has the adversary escalated privileges using token manipulation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1134.003 - Make and Impersonate Token": {
          "Creation of new logon sessions (Logon Type 9 - NewCredentials) with high privileges initiated by non-standard parent processes.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 for Logon Type 9 (NewCredentials). For each event, identify the process name (via Event ID 4688 correlating Logon/Process IDs) that initiated the logon. Flag events where the initiating process is not a standard OS or admin tool. Analyze the user account used for the new logon session for high privileges (e.g., administrators, SYSTEM). Use descriptive statistics on initiating processes to identify outliers."
          },
          "Execution of runas command with administrator privileges or for high-privilege accounts by non-administrator users.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creations where CommandLine contains 'runas '. Extract the full command line and the user executing the command. Identify executions by users who are not administrators or where the target specified is a high-privilege account. Use frequency analysis to identify rare users or parent processes executing 'runas'."
          }
        }
      }
    }
  },
  {
    "Is the adversary bypassing defenses using token manipulation? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1134.003 - Make and Impersonate Token": {
          "Unusual sequence of events involving a new logon session (Logon Type 9) followed quickly by sensitive file access or process creation.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify Windows Event ID 4624 (Logon Type 9) events. Within a short time window (e.g., 5 seconds), search for subsequent sensitive actions by the same user account, such as file access (Event ID 4663 for sensitive files/paths) or process creation (Event ID 4688 for suspicious process names/paths). Use time series analysis or event correlation rules to link these events and flag sequences not observed in baseline behavior."
          },
          "Execution of runas command by processes other than standard shells (cmd.exe, powershell.exe) or expected administration tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creations where CommandLine contains 'runas '. Analyze the ParentProcessName field. Flag executions where ParentProcessName is not a standard user shell or expected admin tool. Use descriptive statistics to identify the most common parent processes for 'runas' across the environment and flag significant deviations or low-frequency occurrences."
          }
        }
      }
    }
  }
]