[
  {
    "Is the adversary maintaining persistence using browser extensions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1176.001 - Browser Extensions": {
          "Installation or modification of unauthorized browser extensions on endpoints, potentially via command line or unusual file writes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints for processes creating files or running commands typically associated with browser extension installation paths or utilities. Correlate process creation events with file system monitoring logs (if available, or infer from command line) to detect unauthorized writes in extension directories."
          },
          "Network traffic patterns originating from a browser process that deviates from normal browsing (e.g., connections to known malicious C2 servers, unusual data exfiltration activity).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and dns.log for network connections originating from endpoints. Filter for connections associated with browser processes (if identifiable via host logs or mapping). Identify connections to known malicious IPs/domains by inner joining logs with CTI feeds. Use time series analysis and descriptive statistics on connection volume, destination frequency, and data transfer size to detect deviations from baseline user or group browser activity indicative of C2 or data exfiltration."
          },
          "Unusual spikes in network connection frequency or data transfer volume from an endpoint associated with browser activity compared to established baseline activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline daily/hourly network connection frequency and data transfer volume per endpoint using Zeek conn.log, focusing on TCP/UDP traffic on standard HTTP/S ports (80, 443) and other potentially related ports. Apply time series analysis or statistical process control (e.g., Cumulative Sum (CUSUM) charts) to flag significant deviations (spikes or sustained increases) above the baseline. Focus analysis on endpoints known to be user workstations."
          },
          "Browser processes (e.g., chrome.exe) creating suspicious child processes or executing commands indicative of malicious activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints. Filter for browser processes (chrome.exe, firefox.exe, msedge.exe) as Parent Process Name. Identify suspicious child processes launched by these browser processes (e.g., cmd.exe, powershell.exe, curl.exe, bitsadmin.exe, mshta.exe, reg.exe, etc.). Analyze command lines of both parent (browser) and child processes for attempts to download files, execute scripts, modify registry keys, or interact with system utilities. Use frequency analysis to identify rare child processes or command line arguments originating from browser processes compared to the environment baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]