```json
[
  {
    "Is the adversary maintaining persistence using software extensions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1176 - Software Extensions": {
          "Browser network traffic connects to known malicious C2 domains/IPs, or files/registry keys associated with known malicious browser extensions are created.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join Zeek dns.log queries and Zeek conn.log destination IPs from browser-related traffic against a high-confidence threat intelligence feed of known malicious C2 domains and IPs (updated daily). Separately, scan endpoint registry and file systems by monitoring Windows Event ID 4663 for creation events where the object name contains identifiers (e.g., Chrome extension IDs) or file names/hashes of known malicious extensions. Alert on any matches."
          },
          "A browser extension is installed by a non-standard process, such as a script, or a browser is launched with command-line arguments to load an unpacked extension from an unusual directory.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for scripts (powershell.exe, cscript.exe) or other unusual parent processes that trigger file creation/modification events (Windows Event ID 4663) within known browser extension directories. Concurrently, monitor 4688 events for browser processes launched with command-line arguments like '--load-extension=' pointing to non-standard paths (e.g., %TEMP%, C:\\Users\\Public). Correlate these patterns to identify sideloaded or script-installed extensions, which is a common pattern for malicious deployment."
          },
          "A non-browser or non-whitelisted process accesses or modifies browser extension configuration files, databases, or directories.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and maintain a baseline of legitimate processes (e.g., chrome.exe, firefox.exe, msedge.exe, legitimate update services) that access browser extension paths. Monitor file access events (Windows Event ID 4663) within these sensitive directories (e.g., %LOCALAPPDATA%\\Google\\Chrome\\User Data\\*\\Extensions). Correlate the accessing process name with process creation events (Windows Event ID 4688) and alert when the accessing process is not on the established baseline. Use frequency analysis to identify rare process access to these locations, flagging potential credential theft or configuration tampering."
          },
          "A browser process exhibits anomalous network activity, such as communication with a high-entropy or newly registered domain, traffic to non-standard ports, or data transfer patterns indicative of C2 beaconing.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal browser traffic for the organization. Monitor Zeek dns.log for queries to domains with high character entropy or those registered very recently (e.g., within the last 30 days). Analyze Zeek conn.log for browser processes communicating over non-standard ports (not 80/443). Use time series analysis on connection logs to detect periodic, 'heartbeat' connections to a single destination, indicative of C2 communications. Apply correlation analysis between different anomalous network indicators to increase confidence."
          },
          "The installation of a new browser extension is temporally correlated with subsequent anomalous system behavior, such as the creation of new persistence mechanisms or suspicious process executions.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Windows Event ID 4698; Windows Event ID 7045",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the installation of a new extension (detected via file creation in extension directories from Windows Event ID 4663) with subsequent system events. Within a short time window (e.g., 1 hour) after an extension install, hunt for: creation of new scheduled tasks (Event ID 4698), installation of new services (Event ID 7045), or the launch of suspicious processes (Event ID 4688, e.g., powershell.exe, wscript.exe). A linear regression model could test the correlation between the rate of new extension installs and the rate of new persistence mechanisms being created on endpoints."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```