[
  {
    "Is the adversary maintaining persistence using software extensions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1176 - Software Extensions": {
          "Installation of unauthorized or suspicious browser extensions observed via registry modifications, file system changes, or macOS profile installations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious process creations related to browser extension directories or installers. Correlate with Windows Event ID 4656 and 4663 for registry modifications or file creations/accesses within browser extension paths. Use statistical analysis (e.g., frequency analysis, inter-quartile range) to identify anomalous file system or registry changes compared to baselines."
          },
          "Anomalous network traffic originating from browser processes, potentially connecting to C2 infrastructure not associated with normal browsing.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections originating from standard browser ports/protocols to destinations that are unusual or not typically visited by users. Use correlation analysis to link suspicious network activity to specific internal hosts. Identify destinations with low reputation scores from threat intelligence feeds. Employ entropy measures on HTTP request headers or payloads for outbound browser traffic to detect potential C2 patterns."
          },
          "Processes accessing or modifying browser extension configuration or data files/directories that are not standard browser processes or known installers.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 to identify process executions. Correlate 4688 events with Windows Event ID 4663 events where the Object Name path corresponds to known browser extension directories (e.g., Chrome Extensions, Firefox Extensions, Edge Extensions paths) or configuration files, and the process is not the main browser executable or a whitelisted installer. Use frequency analysis or baselining to identify processes exhibiting rare access patterns to these locations."
          },
          "Browser processes initiating outbound network connections to suspicious destinations immediately or shortly after launch or after modifying extension configurations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for browser process startups or executions involving command-line arguments related to extensions. Correlate with Windows Event ID 5156 or Zeek conn.log entries where the initiating process is the browser executable and the destination IP/port is associated with known C2, suspicious infrastructure, or exhibits unusual connection patterns (e.g., connections to uncommon ports, frequent connections to the same non-browser destination). Use correlation analysis and descriptive statistics on connection frequency, duration, and volume per browser process instance."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]