[
  {
    "Is the adversary maintaining persistence through compromised IDE extensions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1176.002 - IDE Extensions": {
          "Installation or modification of IDE extensions on developer workstations/servers outside of approved channels or maintenance windows.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Event ID 4688) for known IDE installer processes or package managers associated with extensions. Monitor file system events (Event ID 4656/4663) in IDE extension directories for unauthorized modifications or new files. Identify outliers in installation frequency or timing across the environment using descriptive statistics."
          },
          "Unusual child processes, network connections, or file modifications originating directly from IDE processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor child processes created by known IDE executables (Event ID 4688). Look for suspicious processes like command shells, scripting engines, or uncommon executables. Monitor network connections originating from IDE processes using Zeek conn.log. Identify connections to unusual destinations or ports. Analyze patterns of file system access (read/write) by IDE processes for deviations from normal behavior using correlation analysis with known malicious activity patterns."
          },
          "Installation of IDE extensions from unusual network sources or the creation of executable/script files in IDE extension directories.": {
            "Data": "Zeek conn.log; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections from developer workstations to IP addresses/domains known to host IDE extension marketplaces or repositories. Identify connections to rare or unknown destinations using frequency analysis of destination IPs/domains. Monitor file system events (Event ID 4656/4663) within common IDE extension installation directories for the creation or modification of executable files (.exe, .dll) or script files (.ps1, .py, .sh). Flag files with low entropy or specific suspicious content patterns if advanced logging or file integrity monitoring is available."
          },
          "Persistent outbound network connections or tunneling activity originating from IDE processes or their child processes using unexpected protocols or ports.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with Windows Event ID 4688 to identify network connections originating from IDE processes or their immediate child processes. Filter for connections using unusual ports or protocols (e.g., SSH port 22, RDP port 3389 from an IDE, or known C2 ports). Use time series analysis or descriptive statistics to identify connections that are unusually long-lived, highly frequent, or occur outside of expected development activities. Use correlation analysis to link network activity with specific process command lines."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]