[
  {
    "Is the adversary collecting sensitive data via browser session hijacking? (TA0009 - Collection)": {
      "Indicators": {
        "T1185 - Browser Session Hijacking": {
          "Evidence of suspicious process injection into browser processes or elevated privileges obtained by browser processes.": {
            "Data": "Windows Event ID 8; Windows Event ID 10; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 8, 10 (Sysmon) for cross-process access or thread creation events where the target process is a browser executable (e.g., 'chrome.exe', 'firefox.exe', 'msedge.exe'). Analyze Windows Event ID 4688 for suspicious child processes spawned by browser processes. Identify instances of browsers obtaining elevated privileges (e.g., SeDebugPrivilege) via correlation analysis of process creation/modification events and privilege assignment logs if available."
          },
          "Detection of unusual network connections originating from a browser process, especially to internal resources not typically accessed or to external IPs/domains associated with C2.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and dns.log. Focus on connections originating from endpoint IPs that exhibit unusual patterns for a browser process, such as connections to internal server IPs/ports not typically browsed, connections to C2 IPs/domains (via threat intel lookup), or high volume of connections outside normal browsing behavior. Use correlation analysis to link specific browser process activity (if identifiable via endpoint logs) with network traffic patterns. Use time series analysis to detect anomalous connection rates or destinations from endpoints potentially involved in session hijacking."
          },
          "Anomalous internal resource access initiated by a browser process (e.g., direct connections to internal servers/ports not typically accessed via browser, unusual traffic volume to internal web applications).": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 5156 entries showing outbound connections from browser processes (`chrome.exe`, `firefox.exe`, `msedge.exe`) to internal IP addresses or ports with Zeek conn.log and http.log data for the same endpoints. Baseline normal internal browsing behavior per user/endpoint (e.g., access to known internal web applications on standard ports). Flag connections from browser processes to internal IPs/ports outside this baseline using frequency analysis. Use time series analysis on connection volume and destination entropy to detect statistically unusual internal browsing activity from browser processes."
          },
          "Browser process establishing connections to external IP addresses or domains associated with known malicious infrastructure or data exfiltration services.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, dns.log, and http.log for connections initiated from endpoint IPs where the originating process is a browser (identified via correlation with Windows Event ID 5156). Cross-reference destination IPs/domains against threat intelligence feeds for known C2, data exfiltration services, or suspicious infrastructure. Identify statistically unusual patterns like high-frequency connections to new or rare external destinations from a single browser process or user using frequency analysis and calculating the frequency distribution of destinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]