[
  {
    "Is the adversary attempting to gather credentials using forced authentication? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1187 - Forced Authentication": {
          "Outbound SMB or WebDAV traffic originating from internal endpoints destined for external, unknown IP addresses.": {
            "Data": "Zeek conn.log; Zeek smb.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, smb.log (TCP 139, 445, UDP 137), and http.log (TCP 80, 443) for connections originating from internal network segments destined for external, non-corporate IP ranges. Identify connections where the destination IP is not known or expected. Use correlation analysis to link outbound SMB/WebDAV connections with suspicious internal events (e.g., email receipt, file opening)."
          },
          "Creation or modification of .LNK or .SCF files containing external resource references on endpoints.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on endpoints for attempts to write/modify files with .lnk or .scf extensions. Correlate these events with process creation (Event ID 4688) to identify the source process. Analyze associated network connections (potentially using Zeek conn.log) to confirm external resource references using correlation analysis."
          },
          "Unusual internal SMB or WebDAV traffic between workstations, or from servers to workstations, inconsistent with normal resource sharing patterns.": {
            "Data": "Zeek conn.log; Zeek smb.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, smb.log (ports 139, 445), and http.log (ports 80, 443) for connections between internal hosts (workstation-to-workstation or server-to-workstation) using SMB or WebDAV protocols. Establish baselines for typical internal SMB/WebDAV traffic patterns (source/destination hosts, volume, time of day) using descriptive statistics and time series analysis. Flag deviations from baseline behavior, particularly connections involving hosts that don't typically communicate via SMB/WebDAV, or occurring outside normal work hours."
          },
          "Processes known to open external documents or files (e.g., Word, Explorer) initiating outbound connections to SMB or WebDAV ports on external hosts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek smb.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes like 'winword.exe', 'explorer.exe', etc. Filter Windows Event ID 5156 for outbound connection attempts by these processes targeting SMB (445, 139) or WebDAV (80, 443) ports. Correlate these endpoint events with Zeek conn.log entries showing successful or failed outbound connections to the same ports from the corresponding host IPs. Investigate instances where typical user applications initiate network connections to external SMB/WebDAV resources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]