[
  {
    "Is the adversary collecting sensitive data via browser session hijacking? (TA0009 - Collection)": {
      "Indicators": {
        "T1185 - Browser Session Hijacking": {
          "Evidence of suspicious process injection into browser processes or elevated privileges obtained by browser processes.": {
            "Data": "Windows Event ID 8, Windows Event ID 10, Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 8, 10 (Sysmon) for cross-process access or thread creation events where the target process is a browser executable (e.g., 'chrome.exe', 'firefox.exe', 'msedge.exe'). Analyze Windows Event ID 4688 for suspicious child processes spawned by browser processes. Identify instances of browsers obtaining elevated privileges (e.g., SeDebugPrivilege) via correlation analysis of process creation/modification events and privilege assignment logs if available."
          },
          "Detection of unusual network connections originating from a browser process, especially to internal resources not typically accessed or to external IPs/domains associated with C2.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek dns.log",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and dns.log. Focus on connections originating from endpoint IPs that exhibit unusual patterns for a browser process, such as connections to internal server IPs/ports not typically browsed, connections to C2 IPs/domains (via threat intel lookup), or high volume of connections outside normal browsing behavior. Use correlation analysis to link specific browser process activity (if identifiable via endpoint logs) with network traffic patterns. Use time series analysis to detect anomalous connection rates or destinations from endpoints potentially involved in session hijacking."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]