[
  {
    "Has the adversary gained initial access to the network via drive-by compromise? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1189 - Drive-by Compromise": {
          "Network traffic to websites with low reputation, known malicious scripts, or signs of content injection.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and conn.log for connections to websites. Integrate with URL/domain reputation services. Identify connections to sites with low reputation, short domain lifespan, or that match patterns of known malvertising/watering hole sites. Use statistical analysis (e.g., correlation or frequency analysis) to identify clusters of users visiting the same suspicious sites or spikes in visits to newly registered domains."
          },
          "Anomalous process execution, file writes, or network connections originating from a browser process or recently executed processes on an endpoint after visiting a suspicious website.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for child processes spawned by web browsers (e.g., chrome.exe, firefox.exe, msedge.exe) that are not typical browser helper processes. Monitor Windows Event ID 4656/4663 for unusual file writes or object access by browser processes. Analyze Zeek conn.log for unusual outbound connections from the compromised host immediately following website visits. Use behavioral analysis or baselining to flag deviations from typical browser process activity and network connections."
          },
          "Detection of known browser exploit patterns, obfuscated scripts, or suspicious payload delivery in network traffic associated with web browsing sessions.": {
            "Data": "Zeek http.log; Zeek ssl.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and ssl.log for connections indicating suspicious content delivery, such as unusual MIME types or file extensions in responses. Utilize network security monitoring tools or analyze Zeek logs for patterns indicative of known browser exploits, highly obfuscated JavaScript content (e.g., high entropy analysis on response bodies), or unusual data size transfers immediately after visiting a website. Correlate with Zeek file.log for identified file transfers associated with suspicious web sessions."
          },
          "Unusual process creation or network connection patterns originating from a web browser process or child processes immediately following a website visit.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created by web browsers (e.g., chrome.exe, firefox.exe, msedge.exe) that have unusual command lines, execution paths, or parent-child relationships (e.g., browser spawning cmd.exe, powershell.exe). Correlate the timestamp of suspicious process creation with Zeek http.log to identify recent website visits. Analyze Zeek conn.log for new or unusual outbound network connections originating from the browser process or its children. Use frequency analysis or baselining on spawned process names/command lines and network connection destinations to identify anomalies. Apply time series analysis on network connections from endpoints to detect sudden increases or unusual destinations following web activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]