[
  {
    "Has the adversary gained initial access to the network via supply chain compromise? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1195 - Supply Chain Compromise": {
          "Detection of mismatched file hashes or digital signatures during software/update verification checks.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor system logs (e.g., Windows Event ID 4688 for process creation, logs indicating software installation status) for activity associated with new software installations or updates where verification failures might be logged. Correlate with Zeek conn.log to identify source/destination of software downloads/updates. Look for processes launched from unusual directories or with unexpected command-line arguments associated with recent software deployments. Use time series analysis to identify spikes in software installation events or related network traffic."
          },
          "Anomalous network traffic or process activity originating from a newly installed or updated piece of software/hardware.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, dns.log, and http.log for connections originating from endpoints/servers shortly after new software or hardware deployment. Look for connections to unusual or known malicious external IPs/domains, or sudden changes in network behavior (e.g., using entropy measures on destination domains or correlation analysis between software install events and network spikes). Monitor Windows Event ID 4688 for unusual child processes spawned by newly installed software."
          },
          "Network connections from a newly installed/updated process to suspicious external destinations before expected user interaction or activity.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network connections (Zeek conn.log) made by processes created via recent software installations/updates (correlating with software deployment logs or heuristics). Analyze destination IPs/domains (Zeek dns.log, http.log) for connections to known bad IPs, unusual TLDs, or sudden spikes in communication with a single external endpoint shortly after installation. Use time series analysis to identify processes that initiate network connections significantly earlier than typical for that software, or exhibit sudden, unusual connection patterns."
          },
          "Execution of unsigned executable files appearing in system directories or temporary folders after a software installation or update event.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4699; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events, specifically focusing on executables (.exe, .dll, etc.) executed from unusual directories (e.g., temporary folders, newly created subdirectories in program files) or those lacking valid digital signatures. Correlate execution events with recent software installation events. Investigate processes launched by trusted parent processes but exhibiting suspicious behavior or located in non-standard paths. Use frequency analysis on process paths and digital signature status to identify rare occurrences."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]