
[
  {
    "Is the adversary maintaining persistence using BITS jobs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1197 - BITS Jobs": {
          "A BITS job is configured to download a file from a known malicious URL/IP, or the executable set to run upon completion has a known malicious file hash.": {
            "Data": "Windows Event ID 4688; Windows Event Logs (Microsoft-Windows-Bits-Client/Operational); Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract URLs from BITS job creation events (from command line in Windows Event ID 4688, BITS operational logs, or Zeek http.log requests with BITS user-agents). Correlate these URLs and associated IPs with a CTI feed of malicious domains/IPs. Separately, for jobs using `SetNotifyCmdLine`, extract the specified executable path, retrieve its file hash, and perform an inner join against a database of known malicious file hashes. Alert on any match."
          },
          "Creation of a BITS job using specific command-line arguments or PowerShell cmdlets known to establish persistence, such as setting a notification command.": {
            "Data": "Windows Event ID 4688; Windows PowerShell logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for `bitsadmin.exe` and PowerShell logs for BITS-related cmdlets (e.g., `Set-BitsTransfer`). Create a specific rule to detect the command-line patterns `/SetNotifyCmdLine` and `/SetNotifyFlags`. Also monitor for scripts that programmatically create BITS jobs with notification commands. Flag all occurrences for review, prioritizing those initiated by non-system accounts or specifying executables in unusual locations (e.g., %TEMP%, %APPDATA%)."
          },
          "A BITS job created by a non-system user account exhibits anomalous properties, such as an unusually long retry delay or lifetime, or is configured to persist across reboots.": {
            "Data": "Windows Event Logs (Microsoft-Windows-Bits-Client/Operational); Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze BITS operational logs to identify all newly created jobs. For each job, extract the creating user, job lifetime, and retry delay settings. Establish a baseline for these properties for legitimate jobs. Use descriptive statistics (mean, median, standard deviation) and percentile analysis to identify jobs with properties that are statistical outliers (e.g., retry delay > 95th percentile). Use correlation analysis to check if hosts with such jobs also exhibit other suspicious behaviors."
          },
          "A recurring sequence of events where a BITS job completion is followed by the execution of a new or unusual process, especially after system reboots.": {
            "Data": "Windows Event Logs (Microsoft-Windows-Bits-Client/Operational); Windows Event ID 4688; Windows Event ID 12",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate BITS job completion or error events (from BITS operational logs) with subsequent process creation events (Windows Event ID 4688) on the same host within a short time window (e.g., 1-5 minutes). Identify instances where the created process is suspicious (e.g., unsigned, runs from temporary directory). Use time series analysis, correlating these sequences with system boot events (Windows Event ID 12 for start) to confirm if the activity is persistent across reboots."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary using BITS jobs for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1197 - BITS Jobs": {
          "BITS-generated network traffic involves connections to or file transfers from external IPs, URLs, or domains present on threat intelligence feeds.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Isolate network traffic generated by the BITS service, identifiable by its default User-Agent in Zeek http.log. Extract all destination IPs and URLs from Zeek conn.log and http.log associated with this traffic. Perform an inner join of these connection details with a high-confidence, continuously updated CTI feed of known malicious C2 servers, dropzones, and exfiltration points. Alert on any matches."
          },
          "A BITS job is created with a custom User-Agent header or a display name designed to masquerade as a legitimate system process or update.": {
            "Data": "Windows Event ID 4688; Windows PowerShell logs; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor command-line logs (Windows Event ID 4688) for `bitsadmin.exe` usage of the `/SetCustomHeaders` parameter. Monitor PowerShell logs for `Add-BitsFile -CustomHeaders`. On the network, monitor Zeek http.log for BITS traffic where the User-Agent is not the default (e.g., 'Microsoft BITS/7.x'). Also, monitor BITS command lines for job display names that mimic legitimate software (e.g., 'svchost update', 'Chrome Updater') but are associated with suspicious file transfers. Maintain and match against a list of known-good and known-bad patterns."
          },
          "BITS is used to download or upload files with unusual characteristics (e.g., type, size, directory location) or by an anomalous user context, deviating from established baselines of legitimate BITS activity.": {
            "Data": "Zeek http.log; Zeek files.log; Windows Event ID 4688; Windows Event Logs (Microsoft-Windows-Bits-Client/Operational)",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal BITS traffic, including typical file types (.cab, .msu), file sizes, download/upload ratios, and source/destination servers (e.g., Microsoft update servers). Monitor for anomalies, such as BITS downloading executables (.exe, .dll, .ps1) or script files, uploading large archives (.zip, .rar), or writing files to non-standard directories (e.g., %PUBLIC%, %TEMP%). Use descriptive statistics and box plots on file sizes to identify outlier transfers. Flag all BITS activity initiated by interactive user accounts instead of the SYSTEM account."
          },
          "BITS network traffic exhibits patterns inconsistent with background file transfers, such as low-and-slow data exfiltration or connections to a wide array of disparate, low-reputation destinations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the statistical properties of network connections associated with the BITS service. Use time series analysis to detect periodic, small data uploads characteristic of 'low-and-slow' exfiltration, which would differ from bursty update downloads. Calculate the entropy of destination IPs for BITS traffic from a single internal host over a 24-hour period; a high entropy value may indicate connections to a domain generation algorithm (DGA) or scanning activity, which is not typical BITS behavior. Correlate with destination domain age and reputation to enrich findings."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
