[
  {
    "Has the adversary gained initial access via compromised hardware? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1195.003 - Compromise Hardware Supply Chain": {
          "Unexpected hardware enumeration or driver installation events potentially linked to tampering.": {
            "Data": "Windows Event ID 100; Windows Event ID 41; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to unexpected device enumeration or boot failures (e.g., Event ID 100, 41) on critical endpoints and servers. Look for correlations between these events and unusual network traffic patterns (Zeek conn.log) originating from those specific hosts around the same time. Use time series analysis on boot durations or error counts to detect anomalous changes."
          },
          "Windows Event Logs indicating boot failures, Secure Boot violations, or unexpected system errors during startup potentially linked to firmware integrity issues.": {
            "Data": "Windows Event ID 100; Windows Event ID 41; Windows Event ID 1001; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event IDs related to boot integrity checks (e.g., Secure Boot status, Event ID 100) and system errors (e.g., Event ID 41, 1001) during startup on target systems. Identify unexpected boot sequences, failures, or kernel panics. Cross-reference with Zeek conn.log for network activity occurring very early in the boot process or immediately following system startup errors. Use frequency analysis or anomaly detection on event patterns."
          },
          "Network connections initiated very early in the boot sequence, potentially indicating malicious firmware activity.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for network connections originating from system IPs immediately after the system starts but before standard user logon events (Windows Event ID 4624 Logon Type 2) are observed on the target host. Analyze connection destinations and timing relative to system boot events. Use time series analysis to establish baseline network activity patterns during system startup and flag connections deviating significantly from the norm."
          },
          "Execution of unusual or unsigned processes/services very early in the boot sequence potentially indicative of malicious firmware or boot components.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and 7036 (Service Start) occurring during system startup. Identify processes or services that are unsigned, have unusual names or locations, or are not part of the standard build. Correlate execution times with system boot events and look for network connections (Zeek conn.log) made by these processes/services immediately after they start. Maintain a baseline of expected startup processes using frequency analysis and flag rare occurrences."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]