[
  {
    "Has the adversary gained initial access by compromising software or updates? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1195.002 - Compromise Software Supply Chain": {
          "Installation of unapproved software or software updates with invalid digital signatures.": {
            "Data": "Windows Event ID 4688; Windows Event ID 8002; Windows Event ID 8006; Zeek pe.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creations associated with software installation or updates. Correlate with Code Integrity events (8002/8006) or PE file analysis (Zeek pe.log) to identify executables with missing, expired, or untrusted digital signatures. Flag installations outside of scheduled maintenance windows using time series analysis. Use descriptive statistics to identify rare installation sources or packages."
          },
          "Execution of newly installed or updated executables exhibiting suspicious process behavior (e.g., child processes, network connections to untrusted sites).": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 to identify child processes spawned by newly installed or updated executables. Analyze Zeek conn.log and dns.log for network connections made by these processes to unusual or untrusted external destinations. Apply correlation analysis between process execution (4688) and network activity (Zeek logs) to flag suspicious communication patterns. Use frequency analysis on destination IPs/domains to identify rare or malicious connections."
          },
          "Unauthorized modification or presence of executable files in expected software update or installation directories.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4699",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (Object Accessed) and 4656 (Handle Requested) for write/modify operations on executable files (.exe, .dll) within standard software installation or update directories (e.g., Program Files, C:\\Windows\\SoftwareDistribution). Correlate with Windows Event ID 4699 to detect creation or modification of scheduled tasks used for updates. Identify modifications occurring outside of scheduled maintenance windows or associated with unexpected processes using time series analysis and correlation against known update processes."
          },
          "Download or presence of executable files with known malicious hashes or from untrusted external sources.": {
            "Data": "Zeek http.log; Zeek files.log; Windows Event ID 4663",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for downloads of executable file types (.exe, .dll, .msi). Extract file hashes from Zeek files.log if available, or from Windows Event IDs related to file creation/modification (e.g., 4663 if configured for relevant directories like temp/downloads). Cross-reference collected file hashes against reputable threat intelligence sources for known malware. Analyze source URLs/IPs from http.log using frequency analysis and reputation lookups (e.g., against public blocklists or TI feeds) to identify downloads from untrusted external sources. Flag downloads matching known malicious hashes or originating from low-reputation external sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]