[
  {
    "Has the adversary gained initial access via compromised software dependencies or development tools? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1195.001 - Compromise Software Dependencies and Development Tools": {
          "Execution of suspicious processes originating from software recently installed or updated via dependencies.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify process executions where the parent process is a known software installer, package manager, or build tool, and the child process exhibits suspicious characteristics (e.g., unsigned, low prevalence, known malicious hash). Correlate process creation with recent software deployment/update logs. Use prevalence analysis to identify rare process executions originating from standard update paths."
          },
          "Network connections to unusual or malicious destinations made by processes associated with recently installed software.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log. Filter connections where the source process (if available via endpoint logs or correlation) is associated with recently installed/updated software. Join connection logs with threat intelligence feeds to identify connections to known malicious IPs or domains. Analyze connection destinations for entropy/randomness (potential DGA) or unusual ports/protocols using descriptive statistics."
          },
          "Network connections to unusual or unexpected software package repositories or download servers.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections originating from development/build servers or user endpoints attempting to download software dependencies. Maintain a baseline of known and approved software repositories (e.g., internal package managers, trusted public repositories). Flag connections to external IPs or domains not on the approved list using frequency analysis and correlation with known repository lists."
          },
          "Attempts by processes associated with installed software dependencies to perform unusual or malicious actions (e.g., inject threads, access sensitive files, create scheduled tasks).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and 4698 (Scheduled Task Creation) for activity originating from executables or scripts known to be part of installed software dependencies or development tools. Analyze command lines (4688) and task actions (4698) for suspicious patterns (e.g., obfuscated commands, attempts to download files, persistence mechanisms). Use prevalence analysis and correlation to identify processes or tasks associated with dependencies that exhibit low prevalence or known malicious characteristics compared to established baselines."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]