[
  {
    "Has the adversary gained initial access to the network via supply chain compromise? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1195 - Supply Chain Compromise": {
          "Detection of mismatched file hashes or digital signatures during software/update verification checks.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor system logs (e.g., Windows Event ID 4688 for process creation, logs indicating software installation status) for activity associated with new software installations or updates where verification failures might be logged. Correlate with Zeek conn.log to identify source/destination of software downloads/updates. Look for processes launched from unusual directories or with unexpected command-line arguments associated with recent software deployments. Use time series analysis to identify spikes in software installation events or related network traffic."
          },
          "Anomalous network traffic or process activity originating from a newly installed or updated piece of software/hardware.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4697, Zeek conn.log, Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, dns.log, and http.log for connections originating from endpoints/servers shortly after new software or hardware deployment. Look for connections to unusual or known malicious external IPs/domains, or sudden changes in network behavior (e.g., using entropy measures on destination domains or correlation analysis between software install events and network spikes). Monitor Windows Event ID 4688 for unusual child processes spawned by newly installed software."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]