```json
[
  {
    "Has the adversary gained initial access via compromised software dependencies or development tools? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1195.001 - Compromise Software Dependencies and Development Tools": {
          "Downloaded software dependencies or development tools matching known malicious file hashes or containing known malicious code signatures.": {
            "Data": "Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Capture or log metadata of downloaded software dependencies and development tool installers/packages (e.g., from Zeek files.log during transfer, or file paths from Windows Event ID 4688 if file creation/modification is logged post-download). Compute file hashes (MD5, SHA256) and compare against a CTI feed of known malicious file hashes associated with supply chain attacks. Scan downloaded files with up-to-date AV/EDR signatures, YARA rules, or other static analysis tools looking for known malicious code signatures. Alert on any matches."
          },
          "Network connections from development tools or newly installed dependencies to IP addresses, domains, or URLs known to be associated with malware C2, typosquatting of legitimate repositories, or distribution of malicious packages.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, Zeek http.log (Host header, URI), and Zeek dns.log (queries) for connections originating from systems after software dependency installation or updates, particularly from developer workstations or build servers. Correlate destination IPs, domains, and URLs against high-fidelity, frequently updated threat intelligence feeds specifically identifying infrastructure used in software supply chain attacks (e.g., known malicious package repositories, typosquatted domains for popular libraries, C2 servers contacted by compromised dependencies). Alert on exact matches and investigate associated processes."
          },
          "Execution of unexpected or suspicious script content (e.g., PowerShell, Python, Node.js) within package manager installation scripts (e.g., npm 'preinstall'/'postinstall' scripts, pip setup.py) or build processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor detailed script execution logging (e.g., Windows PowerShell Script Block Logging Event ID 4104, auditd for Linux if applicable). Analyze command lines from Windows Event ID 4688 where parent processes are known package managers (npm, pip, nuget, yarn) or build tools (MSBuild, make, gradle, ant). Look for patterns indicative of malicious activity within these scripts, such as: invocation of obfuscated commands, downloaders (Invoke-WebRequest, curl, wget) fetching payloads from unusual URLs, direct registry manipulation for persistence, or reconnaissance commands (whoami, ipconfig, netstat). Use regular expressions and correlation analysis to match known malicious script patterns or sensitive API calls not typical for legitimate installation/build scripts."
          },
          "Presence of known malicious package names, specific file names/paths, or other IOCs associated with documented software supply chain attacks in file systems, process executions, or network traffic.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and regularly update a list of known malicious package names (e.g., 'pygrata-requests', 'electorn'), specific malicious file names, or distinct path segments used by compromised dependencies or development tools (derived from CISA alerts, threat reports, or community IOC sharing platforms). Monitor Windows Event ID 4688 (Process Name, OriginalFileName, Image Path, CommandLine) for these specific strings. Monitor Zeek http.log for URI patterns or HTTP headers that include these known malicious names. Use exact string matching or robust pattern matching (e.g., regex for variants) and alert on detections."
          },
          "Anomalous process behavior originating from software recently installed or updated via dependencies, such as unexpected child processes, high-entropy command lines, or execution of unsigned binaries where signed ones are expected.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for typical processes and child processes spawned by legitimate package managers, installers, and build tools within the environment. Monitor Windows Event ID 4688 (Process Creation). Flag deviations such as: 1. Unexpected child processes (e.g., cmd.exe, powershell.exe, wscript.exe, cscript.exe spawned by a typically non-interactive build tool or package manager process). 2. Command lines with unusually high character entropy or length, indicative of obfuscation or embedded scripts. 3. Execution of unsigned executables or DLLs loaded from dependency directories where signed binaries are the norm for that software. Use prevalence analysis (e.g., frequency of this parent-child process relationship or command line pattern in the environment) and correlation with recent software deployment logs. Apply descriptive statistics on command line length and entropy to identify outliers."
          },
          "Anomalous network traffic patterns when fetching software dependencies, such as connections to geographically unusual or low-reputation domains for package repositories, direct IP connections bypassing DNS for downloads, or unusual User-Agent strings.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log (User-Agent, Host header), and dns.log for connections related to software dependency downloads. Maintain a profile of typical repository domains, their geolocations, and associated User-Agent strings from package managers. Flag connections to: 1. Domains not on an organizational allow-list or whose ASN/geolocation is anomalous. 2. Newly Registered Domains (NRDs) or low-reputation domains serving packages. 3. Direct IP address connections for package downloads where a domain name is expected (correlate Zeek conn.log IPs with lack of preceding DNS query in Zeek dns.log, or HTTP requests with IP in Host header). 4. Deviations from expected User-Agent strings. Use frequency analysis of repository domains and employ statistical methods (e.g., IQR on data transfer sizes from new or unusual repositories) to spot anomalies."
          },
          "Post-installation activity by processes associated with software dependencies or development tools involving unauthorized system modifications, data access/staging, or establishment of persistence mechanisms.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698; Windows Event ID 4657; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process activity (Windows Event ID 4688) originating from recently installed/updated dependencies with subsequent system events. Look for: 1. Creation of new scheduled tasks (Event ID 4698) by these processes. 2. Modifications to sensitive registry keys for persistence or configuration changes (Event ID 4657, e.g., Run keys, service creation, browser helper objects). 3. Unexpected network connections to external hosts not related to legitimate software functionality (Event ID 5156, correlated with Zeek conn.log). 4. Attempts to access sensitive files/directories or stage data (requires enabling and monitoring specific file access audit events like 4663). Baseline normal post-install behavior of common dependencies and alert on deviations. Use time series analysis to correlate installation events with subsequent suspicious system changes initiated by the same process lineage within a defined window."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```