[
  {
    "Is the adversary maintaining persistence using BITS jobs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1197 - BITS Jobs": {
          "Detection of BITS jobs configured to run executables or scripts upon job completion or error.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes starting 'bitsadmin'. Parse command line arguments for 'SetNotifyCmdLine'. Alert on non-standard executables or scripts specified as completion/error commands."
          },
          "Identification of BITS jobs with extended lifetimes or those persisting across reboots configured by non-system users.": {
            "Data": "Windows Event Logs related to BITS service/tasks",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event Logs pertaining to BITS jobs. Identify jobs created by non-SYSTEM/non-Service accounts. Analyze job properties (e.g., lifetime) using descriptive statistics (mean, max lifetime per user/host) and flag jobs significantly exceeding the normal distribution or default lifetimes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary using BITS jobs for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1197 - BITS Jobs": {
          "Execution of BITSAdmin with suspicious flags (e.g., SetNotifyCmdLine, SetMinRetryDelay) or by unusual user accounts.": {
            "Data": "Windows Event ID 4688, PowerShell logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and PowerShell logs for 'bitsadmin' execution. Filter for suspicious flags like 'SetNotifyCmdLine', 'SetMinRetryDelay', 'SetCustomHeaders'. Perform correlation analysis between the user account executing bitsadmin and other suspicious activities."
          },
          "BITS-generated network traffic involving connections to unusual external destinations or using non-standard ports/protocols.": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections originating from processes associated with BITS (e.g., svchost.exe hosting BITS service). Filter for connections to external IPs or unusual destinations. Use frequency analysis on destination IPs/ports and flag rare connections. Compare BITS traffic patterns against baseline using time series analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]