[
  {
    "Is the adversary maintaining persistence using BITS jobs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1197 - BITS Jobs": {
          "Detection of BITS jobs configured to run executables or scripts upon job completion or error.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes starting 'bitsadmin'. Parse command line arguments for 'SetNotifyCmdLine'. Alert on non-standard executables or scripts specified as completion/error commands."
          },
          "Identification of BITS jobs with extended lifetimes or those persisting across reboots configured by non-system users.": {
            "Data": "Windows Event Logs related to BITS service/tasks",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event Logs pertaining to BITS jobs (e.g., Microsoft-Windows-Bits-Client/Operational). Identify jobs created by non-SYSTEM/non-Service accounts. Analyze job properties (e.g., lifetime, persistence settings) using descriptive statistics (mean, max lifetime per user/host) and flag jobs significantly exceeding the normal distribution or default lifetimes (e.g., using IQR or percentile analysis)."
          },
          "BITS job successfully executing a downloaded executable or script persistently after job completion or reboot.": {
            "Data": "Windows Event ID 4688; Windows Event Logs related to BITS tasks",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate BITS job completion/error events (from relevant Windows BITS logs) with subsequent process creation events (Windows Event ID 4688) on the same host. Identify instances where the process created matches the executable or script configured in the BITS job's 'SetNotifyCmdLine'. Use time series analysis to check if these processes appear repeatedly after system reboots or at times consistent with BITS job triggers."
          },
          "Creation or modification of BITS jobs using BITSAdmin or PowerShell with parameters indicating persistence configuration.": {
            "Data": "Windows Event ID 4688; PowerShell logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'bitsadmin.exe' execution and PowerShell logs for BITS-related cmdlets (e.g., `Start-BitsTransfer`, `Set-BitsTransfer`, `Complete-BitsTransfer`). Analyze command line arguments or script contents for parameters indicative of persistence, such as 'SetNotifyCmdLine', 'SetMinimumRetryDelay', or settings that cause the job to run after reboot. Flag activities originating from non-standard users or contexts using frequency analysis on user accounts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using BITS jobs for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1197 - BITS Jobs": {
          "Execution of BITSAdmin with suspicious flags (e.g., SetNotifyCmdLine, SetMinRetryDelay) or by unusual user accounts.": {
            "Data": "Windows Event ID 4688; PowerShell logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and PowerShell logs for 'bitsadmin' execution or BITS cmdlets. Filter for suspicious flags or parameters like 'SetNotifyCmdLine', 'SetMinRetryDelay', 'SetCustomHeaders', 'Transfer', 'Create', 'AddFile', 'Resume'. Use frequency analysis to identify execution by unusual user accounts or source hosts. Perform correlation analysis between the user account executing bitsadmin and other suspicious activities observed."
          },
          "BITS-generated network traffic involving connections to unusual external destinations or using non-standard ports/protocols.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections originating from processes associated with BITS (commonly svchost.exe hosting the BITS service, but investigate other potential processes). Filter for connections to external IPs or unusual destinations (using frequency analysis on destination IPs/ports). Use time series analysis to identify traffic patterns inconsistent with expected BITS updates or background transfers. Compare BITS traffic patterns against baseline using time series analysis."
          },
          "BITS job downloading files from suspicious external locations or with suspicious file names/types.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for transactions originating from BITS-related processes involving file downloads (HTTP GET requests). Extract source URLs/IPs, destination file paths, and file names. Compare source IPs/domains against threat intelligence feeds using inner join. Flag downloads from known malicious IPs/domains, unusual top-level domains, suspicious file extensions (e.g., .dll, .exe), or downloads to sensitive/unusual directories. Use frequency analysis to identify rare source URLs or file types downloaded by BITS."
          },
          "BITS job uploading data to suspicious external destinations, potentially performing exfiltration.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for HTTP PUT/POST requests originating from BITS-related processes. Identify destination URLs/IPs and the size of the uploaded data. Compare destination IPs/domains against threat intelligence feeds using inner join. Flag uploads to known malicious IPs/domains or unusual destinations (using frequency analysis). Use descriptive statistics (sum, mean, max of uploaded bytes per connection or job) to identify unusually large upload sizes via BITS compared to baseline BITS traffic. Use correlation analysis between the source host/user and potential access to sensitive data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]