[
  {
    "Has the adversary achieved execution through a malicious image? (TA0002 - Execution)": {
      "Indicators": {
        "T1204.003 - Malicious Image": {
          "Deployment of a container/instance from a suspicious or untracked image added to the local registry.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for container process creations (e.g., docker, containerd, kubelet). Analyze Zeek conn.log and dns.log for image pull activity from external or unexpected sources. Cross-reference image names/hashes against known malicious lists or track new/unattributed images in the local registry. Use correlation analysis to link deployment events to source origins."
          },
          "Anomalous process execution or network activity originating from a newly deployed container/instance.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for child processes spawned by container runtime processes that exhibit suspicious behavior (e.g., cmd.exe launching, unexpected binaries). Analyze Zeek conn.log and dns.log for unusual outbound connections (high volume, rare ports/protocols, connections to known bad IPs/domains) originating from the IP range assigned to containers. Apply time series analysis to detect unusual spikes in network activity or process creation from container sources."
          },
          "Deployment of containers/instances from images with names similar to legitimate ones but from suspicious repositories or with slight naming variations.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect container deployment logs (e.g., Windows Event ID 4688 for `docker run` commands including image names) and Zeek logs capturing image pull requests (conn.log, dns.log for host/domain names). Maintain a list of known legitimate image names and approved repositories. Compare newly deployed image names from logs against this list using fuzzy string matching or sequence alignment to identify potential deceptive naming (T1036.005). Flag deployments from external repositories or with low similarity scores to legitimate names for investigation."
          },
          "Anomalous, sustained high network I/O observed from container processes or the host running newly deployed containers.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for container processes, capturing process ID and command line. Correlate process IDs or container names with network connection logs (Zeek conn.log) for the host or container IP. Measure sustained outbound network traffic volume (bytes_out) and duration from processes identified as containers. Identify containers with high, sustained network I/O patterns not typical of their intended function using statistical methods like outlier detection based on historical usage patterns (e.g., IQR, percentile analysis) of similar containers or time series analysis to spot sustained deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]