[
  {
    "Is the adversary using a rogue domain controller for defense evasion or persistence? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1207 - Rogue Domain Controller": {
          "Anomalous Active Directory replication traffic or events originating from a non-Domain Controller host.": {
            "Data": "Windows Event ID 4928; Windows Event ID 4929; Zeek dce_rpc.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4928 and 4929 on Domain Controllers for replication events. Correlate these events with network traffic logs (Zeek dce_rpc.log) to identify DRS calls (DrsAddEntry, DrsReplicaAdd, GetNCChanges). Analyze the source IPs of replication traffic/events. Flag traffic originating from IPs not present in the list of authorized Domain Controllers. Use time series analysis to detect spikes or deviations from baseline replication traffic volume/frequency."
          },
          "Creation of new nTDSDSA objects or unusual Kerberos SPN activity associated with Directory Replication Service (DRS) on non-DC hosts.": {
            "Data": "Windows Event ID 4662; Windows Event ID 4769; Zeek krb.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Domain Controllers for Windows Event ID 4662 (Object Modified) on the Configuration partition for nTDSDSA objects (requires specific SACL). Monitor Windows Event ID 4769 (Kerberos Service Ticket Requested) and Zeek krb.log for requests for DRS SPNs (GUID E3514235–4B06–11D1-AB04–00C04FC2DCD2). Identify the source hosts of these SPN requests. Use frequency analysis or outlier detection (e.g., box plot on event counts per host) to identify hosts requesting DRS SPNs that are not designated Domain Controllers."
          },
          "Unusual or rapid changes to Active Directory objects (e.g., user accounts, group memberships) detected via directory service change events.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable detailed auditing for directory service changes (Windows Event ID 5136) on Domain Controllers. Monitor for rapid or large-scale modifications to sensitive Active Directory objects (e.g., administrator accounts, sensitive groups, GPOs) originating from unusual sources or occurring outside standard maintenance windows. Use time series analysis and statistical process control (e.g., charting the rate of changes) to detect sudden spikes in change volume or frequency indicative of rogue DC injection."
          },
          "Kerberos service ticket requests for Domain Controller SPNs (e.g., DRS, GC) originating from hosts that are not legitimate Domain Controllers.": {
            "Data": "Zeek krb.log; Windows Event ID 4769",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek krb.log and Windows Event ID 4769 on Domain Controllers for Kerberos service ticket requests where the service principal name (sname) corresponds to a known DC service (e.g., `E3514235-4B06-11D1-AB04-00C04FC2DCD2` for DRS, or `GC/<Domain Name>`). Filter these requests to identify the client principal name (cname) or source IP (client_addr in Zeek) of the request. Compare the source hosts/IPs against a list of authorized Domain Controllers. Flag requests for DC service SPNs originating from non-DC hosts. Use frequency analysis to identify hosts making repeated requests for these SPNs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]