[
  {
    "Is the adversary using traffic signaling for persistence? (TA0003 - Persistence)": {
      "Indicators": {
        "T1205 - Traffic Signaling": {
          "Sequence of connection attempts to closed ports (port knocking) or packets containing unusual magic values/strings.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for sequences of failed connection attempts to multiple closed ports from a single source IP within a short time window. Use time series analysis to identify bursts of failed connections. Search Zeek conn.log (if payload logging is enabled/sufficient) or Windows Event ID 5156 details for specific byte sequences or 'magic values' indicative of signaling. Calculate the frequency of failed connection patterns to identify anomalous bursts."
          },
          "Observation of network activity originating from systems that were recently offline, potentially activated by Wake-on-LAN.": {
            "Data": "Zeek conn.log; Windows Event ID 6005; Windows Event ID 6006",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for new connections originating from systems that were recently offline based on historical Zeek data or asset inventory. Correlate this activity with Windows Event IDs (6005 System startup, 6006 System shutdown) to identify unexpected system activation events. Use correlation analysis to link the startup event with the first observed network activity."
          },
          "Execution of packet sniffing or raw socket tools on endpoints or servers not authorized for such activities.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events related to known packet capture libraries or tools (e.g., specific process names for Wireshark, tcpdump, Npcap/WinPcap drivers). Use frequency analysis to identify rare process executions or executions by unusual users or on sensitive systems. Maintain a baseline of authorized tools and users, flagging deviations."
          },
          "Persistent connections to internal systems using unusual ports or protocols, immediately following a detected signaling sequence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify persistent or recurring connections (long duration, repeated connections from same source/dest over time) using non-standard ports or protocols. Develop correlation rules to link these persistent connections to preceding signaling activity observed in Zeek logs (e.g., sequences of failed connections, packets with unusual flags). Use time series analysis on connection duration and frequency to identify persistent links."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using traffic signaling for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1205 - Traffic Signaling": {
          "Detection of network traffic with specific, unusual packet flags or header characteristics designed to evade detection.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log fields for unusual combinations or presence of TCP flags (e.g., SYN+FIN, ACK+URG) in connection attempts that don't follow standard handshakes. Use frequency analysis on flag combinations per source/destination pair to identify statistically rare occurrences. Review Windows Event ID 5156 for connections blocked based on specific packet characteristics."
          },
          "Connections to standard open ports where the initial data payload contains a recognizable 'magic value' sequence not typical for the service.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Search Zeek conn.log payloads (if logged sufficiently) for predefined 'magic value' strings or byte sequences known to trigger specific actions on target services, but which are not standard for the protocol. Apply pattern matching and potentially entropy analysis on payload data to identify potentially obfuscated signaling content within established connections."
          },
          "Identification of Wake-on-LAN magic packets (`FF:FF:FF:FF:FF:FF` followed by MAC address) on the network.": {
            "Data": "Zeek raw packet logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure Zeek or supplemental packet capture systems to log relevant packet payloads. Search Zeek data for the Wake-on-LAN magic packet signature: `FF:FF:FF:FF:FF:FF` followed by 16 repetitions of a MAC address. Use pattern matching or regular expressions to identify these specific byte sequences in network traffic, particularly in UDP broadcasts or direct traffic to systems."
          },
          "Detection of connections to host ports that were previously consistently blocked by host-based firewalls, potentially indicating firewall manipulation via signaling.": {
            "Data": "Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 for connections that are logged as 'permitted' on ports or from sources/destinations that were previously consistently 'blocked'. Identify significant changes in the frequency of blocked vs. permitted connections for specific ports or rules. Correlate these changes with preceding unusual network traffic patterns observed in Zeek logs that might indicate a signaling attempt designed to alter firewall rules or state."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using traffic signaling for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1205 - Traffic Signaling": {
          "Traffic matching port knocking sequence followed by connection to potential C2 port/protocol.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Develop detection logic to identify sequences of failed connection attempts (Zeek conn.log, Windows Event ID 5156) originating from the same source IP/port pair within a short time window, followed immediately by a successful connection to a potential C2 port or protocol (e.g., standard ports used non-standardly, or high/unusual ports). Use time-based correlation analysis to link the sequence to the successful connection."
          },
          "Network traffic payloads containing specific patterns or sequences consistent with known C2 signaling after an initial signaling sequence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Search Zeek conn.log payloads for patterns, high entropy, or specific byte sequences indicative of encoded, encrypted, or custom C2 communication following an initial signaling sequence identified in Zeek conn.log. Use correlation analysis to link unusual payloads on a connection to preceding potential signaling activity that may have opened or activated the C2 channel."
          },
          "A period of network silence from an internal system followed by signaling traffic and subsequent communication with an external IP.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for internal hosts that exhibit significant periods of inactivity (e.g., hours or days based on baseline) followed by short bursts of signaling traffic (e.g., failed connection sequences, packets with unusual flags) and then initiate or receive connections to external IPs. Use time series analysis and correlation to link the return to activity, signaling, and external communication, especially if the external IP is not a typical destination."
          },
          "Detection of beaconing-like communication patterns on a port that only became active or responsive after a signaling event was observed.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify connections in Zeek conn.log to ports that have shown previous signaling activity (e.g., were previously closed/unresponsive or showed unusual handshakes/flags). Analyze the characteristics of traffic on these ports for beaconing behavior (consistent connection intervals, small data volumes, specific timing). Use time series analysis and correlation analysis to identify periodic communication and link it back to potential signaling events that activated the channel."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]