
[
  {
    "Is the adversary maintaining persistence using port knocking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Port knocking-like behavior observed from an IP address known to be malicious or associated with APT activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for sequences of failed connections indicative of port knocking. Inner join the source IP addresses of this activity with a high-confidence cyber threat intelligence (CTI) feed of known malicious IPs. Alert on any matches where a known malicious IP is exhibiting port knocking behavior."
          },
          "Detection of known port knocking daemon processes, configuration files, or associated artifacts on a host.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for the execution of known port knocking daemons (e.g., 'knockd', 'fwknopd'). Scan command-line arguments for paths to known port knocking configuration files (e.g., /etc/knockd.conf). Maintain a list of hashes and process names for known port knocking tools and alert on any matches."
          },
          "A sequence of failed connection attempts from a single external source IP to multiple distinct, closed ports on a host within a short time frame.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for failed connection attempts (e.g., conn_state = 'REJ', 'RSTO', 'S0'). Group these events by source IP and destination host. Use sequence analysis to identify sources making > N attempts to distinct destination ports on the same host within M seconds. Use descriptive statistics on the number of ports and time deltas between attempts to establish a baseline for scan traffic vs. potential knocking."
          },
          "A host-level state change, such as a new listening port opening or a firewall rule modification, occurring immediately after a suspected inbound port knocking sequence.": {
            "Data": "Zeek conn.log; Windows Event ID 5154; Windows Event ID 4946",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate suspected inbound port knocking sequences (identified via behavioral analysis of Zeek conn.log) with subsequent host events. Monitor for a new listening port being permitted by the Windows Filtering Platform (Event ID 5154) or a firewall rule being added (Event ID 4946) on the target host. Use temporal correlation analysis to link the host event to the completion of the knock sequence within a tight time window (e.g., < 5 seconds)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using port knocking? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Observed port knocking sequences originating from IP addresses on a threat intelligence feed.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify IP addresses exhibiting port knocking behavior (sequences of failed connections to multiple ports). Correlate these source IPs by performing an inner join with a CTI feed of known malicious IPs, scanners, or anonymizer services. Prioritize alerts where the knocking source IP has a poor reputation."
          },
          "Network traffic matching known signatures of specific port knocking tools, such as distinctive TCP flag combinations, payload sizes, or inter-packet timing.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the characteristics of failed connection attempts in Zeek conn.log. Develop signatures for known port knocking tools based on patterns in TCP flags (e.g., SYN-ACK instead of SYN for a knock), specific payload sizes, or consistent inter-packet timing. Use correlation analysis to find sources that match these specific, tool-based patterns."
          },
          "A successful connection from an external IP to a previously closed or non-advertised port on a host, occurring immediately after a sequence of failed connection attempts from the same IP.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each host, maintain a stateful baseline of normally active listening ports. Monitor for successful inbound connections (e.g., conn_state = 'SF') to ports not in the baseline. For each such connection, query Zeek conn.log for a preceding sequence of failed connection attempts ('REJ', 'RSTO', 'S0') from the same source IP within a short lookback window (e.g., 30 seconds). Use temporal correlation to confirm the successful connection immediately follows the failed sequence, indicating a hidden port was opened on demand."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary establishing command and control using port knocking? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "An outbound connection to a known C2 server IP or domain, initiated by an internal host immediately after it was the target of a port knocking sequence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify internal hosts targeted by inbound port knocking sequences using Zeek conn.log. Correlate these events with subsequent outbound connections from the same internal host. Inner join the destination IPs of these outbound connections with a CTI feed of known C2 servers. Alert when a knock sequence is immediately followed by a C2 callback from the target host."
          },
          "A recurring pattern of an inbound port knocking sequence followed by a short-lived outbound connection, consistent with periodic C2 beaconing.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use time series analysis on Zeek conn.log data to find patterns of behavior. Specifically, search for a repeating sequence of events for a given internal host: [inbound knock sequence] -> [outbound connection] -> [period of silence]. Identify patterns where the time delta between the knock and the outbound beacon, and the time between beacons, are consistent. Use autocorrelation to find periodicity in this pattern."
          },
          "An outbound connection from an internal host to an external destination, initiated within seconds of the completion of a suspected inbound port knocking sequence targeting that host.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify the completion time of suspected inbound port knocking sequences targeting internal hosts. Monitor for any outbound connection initiated by that same internal host within a very short time window (e.g., 1-10 seconds) after the knock sequence completes. Use temporal correlation analysis to link the inbound knock to the outbound connection, which may be a reverse shell or C2 callback. Use descriptive statistics to find outliers in the knock-to-callback time delta."
          },
          "A successful inbound connection for interactive C2, established to a high or non-standard port that was opened on demand by a port knocking sequence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful inbound connections to unusual ports that were immediately preceded by a port knocking sequence from the same source IP. Analyze the characteristics of the successful connection in Zeek conn.log, such as long duration, low-and-slow data transfer (orig_bytes/resp_bytes), or periodic small packets, which are indicative of an interactive 'keep-alive' C2 session. Use linear regression to model normal session duration versus data volume and flag outliers that may represent interactive C2."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
