[
  {
    "Has the adversary achieved execution through user interaction? (TA0002 - Execution)": {
      "Indicators": {
        "T1204 - User Execution": {
          "Execution of suspicious document files (e.g., .docm, .pdf) spawning unusual child processes or making network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the parent process is a common application like Word, Excel, Adobe Reader, or a web browser, and the child process is suspicious (e.g., powershell.exe, cmd.exe, wscript.exe, cscript.exe) or known malware. Correlate process creation events with Zeek conn.log to identify unexpected network connections originating from these processes. Analyze process creation command lines for unusual arguments or paths. Use frequency analysis to identify rarely executed child processes originating from common parent applications."
          },
          "Execution of command-line interpreters (e.g., powershell.exe, cmd.exe) with suspicious arguments or scripts originating from a user-executed process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of command-line interpreters (powershell.exe, cmd.exe) with suspicious command-line arguments (e.g., encoded commands, remote downloads, unusually long strings). Analyze the parent process of these command interpreters to identify if they were spawned by common user applications or processes known for user interaction. Use correlation analysis to link suspicious command execution to preceding events like file downloads or email interactions."
          },
          "Outbound network connections initiated by standard user applications (e.g., Word, Excel, PDF reader) to unusual or external destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 (Windows Filtering Platform Connection) for outbound network connections originating from processes like WINWORD.EXE, EXCEL.EXE, ACROBAT.EXE, etc. Establish a baseline of normal network activity for these processes (e.g., connections to corporate update servers). Flag connections to unusual or known malicious destinations, especially those with low frequency in historical data. Use frequency analysis or IQR to identify outliers in destination IPs/ports for these processes."
          },
          "Execution of compression/decompression utilities immediately followed by execution of unusual executable files, especially from temporary or download directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events involving common archive utilities (e.g., WINRAR.EXE, 7Z.EXE, WINZIP.EXE). Correlate these events with subsequent process creation events (within a short time window, e.g., 30 seconds) where the child process is a less common executable (.exe, .dll, .bat, .vbs) and originates from a temporary directory (%TEMP%), downloads folder, or suspicious path. Use correlation analysis to link the archive utility execution to the subsequent suspicious process launch and analyze the child process command line arguments."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]