
[
  {
    "Has the adversary executed malicious code via user interaction with a malicious file? (TA0002 - Execution)": {
      "Indicators": {
        "T1204.002 - Malicious File": {
          "Execution of a process whose file hash matches a known malicious indicator from threat intelligence sources.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each process creation event (Windows Event ID 4688), retrieve the full path of the executable. Programmatically retrieve the file associated with the event, calculate its hash (e.g., SHA256), and inner join the hash against a CTI feed of known malicious file hashes updated daily. Alternatively, correlate process creation events with alerts from integrated EDR/AV solutions that perform this function. Investigate any matches immediately."
          },
          "A network connection to a known malicious IP address, domain, or URL immediately following the execution of a user-initiated file.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process execution events (Windows Event ID 4688) with subsequent network connections made by that process (Windows Event ID 5156) or from that host (Zeek logs). Inner join the destination IPs (Zeek conn.log), DNS queries (Zeek dns.log), and HTTP host headers (Zeek http.log) against CTI feeds of malicious indicators. Alert on any connections to known malicious infrastructure that occur within minutes of a user-initiated file execution."
          },
          "A common office application (e.g., WINWORD.EXE, EXCEL.EXE, ACROBAT.EXE) or archive utility (e.g., WINRAR.EXE, 7z.exe) spawns an interpreter process (e.g., powershell.exe, cmd.exe, wscript.exe, cscript.exe, mshta.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Create a specific watch list for parent processes like 'WINWORD.EXE', 'EXCEL.EXE', etc., and child processes like 'powershell.exe', 'cmd.exe', etc. Alert on any parent-child relationship that matches this pattern. Maintain and update the lists of office applications and suspicious interpreters. Use descriptive statistics to establish a baseline of normal process chains and identify rare or new patterns."
          },
          "Execution of an interpreter with suspicious command-line arguments indicative of obfuscation, fileless execution, or downloading content, particularly when spawned from a user-initiated file.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688, focusing on interpreter processes (powershell.exe, cmd.exe, wscript.exe, etc.). Use regular expression matching on the command-line field to detect known malicious patterns, such as 'IEX (New-Object Net.WebClient).DownloadString', '-enc' (PowerShell encoded command), '-nop -w hidden', 'javascript:', 'vbscript:'. Calculate the entropy of command-line arguments; unusually high entropy can indicate obfuscation or packed commands. Correlate findings with parent process to trace back to the initial file."
          },
          "An application makes a network connection where its parent process is not a web browser or other standard network-aware application, indicating potential execution from a malicious document.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Build a baseline model of normal process ancestry for applications that make network connections (e.g., chrome.exe -> chrome.exe, outlook.exe -> various). Monitor process creation (Windows Event ID 4688) and network connection (Windows Event ID 5156) logs. Flag network connections originating from processes whose parent is an office application, PDF reader, or any process not on an approved list of network-capable applications. Use frequency analysis on parent-child-network tuples to identify statistically rare behavioral outliers."
          },
          "A process is executed from a temporary or user-specific download directory (e.g., %TEMP%, %APPDATA%, Downloads) immediately following the likely download of a file from an external source.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek files.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the process path is within a common temporary or download directory. Correlate these execution events by host and timestamp with network logs (Zeek conn.log, files.log) that indicate a recent file download from the internet (e.g., from a web or mail server). Use time series analysis to detect abnormal spikes in execution from these directories. Flag executables that are new to the environment or have a very low prevalence across all endpoints."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
