```json
[
  {
    "Is the adversary maintaining persistence using socket filters? (TA0003 - Persistence)": {
      "Indicators": {
        "T1205.002 - Socket Filters": {
          "Detection of network traffic from known malicious IPs or containing specific, predefined 'magic packet' signatures known to activate persistent socket filter-based backdoors.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Deploy and monitor Zeek scripts or SIEM rules that inspect inbound packets for known malicious trigger signatures (e.g., unique byte sequence, specific flags and port combination) associated with persistent socket filter backdoors. Cross-reference source IP addresses of such packets against a continuously updated threat intelligence feed of IPs known to deploy or use socket filter C2 techniques. Alert on confirmed matches."
          },
          "Processes launched with command-line arguments, or loading modules (e.g., WinPcap driver), explicitly indicating raw socket usage or packet filtering setup, especially if the process is unsigned, runs from an unusual path, or is configured for auto-start/persistence.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command lines containing strings like 'WinPcap', 'raw_socket', 'pcap_setfilter', 'setsockopt', 'SO_ATTACH_FILTER', or names of known tools that utilize socket filters. Correlate findings with process persistence mechanisms (e.g., scheduled tasks, services, registry run keys). Use frequency analysis on process names, paths, and command-line parameters to identify rare or unauthorized occurrences. Investigate processes that are unsigned or run from non-standard locations."
          },
          "A persistent process (e.g., running as a service or auto-start entry) associated with raw socket usage or packet capture libraries, exhibiting little to no network activity over extended periods until a specific, anomalous inbound network packet is received, followed by a change in host behavior (e.g., new process spawn, outbound connection).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify long-running processes (from Event ID 4688 process start/stop events or system snapshots) that are known or suspected to use raw sockets (from Pattern-based evidence). Baseline their typical network activity using Zeek conn.log. Monitor for instances where such a persistent process shows minimal or no observable network traffic for extended durations (hours/days), then suddenly initiates activity (e.g., spawns a child process identified by Event ID 4688, or initiates outbound connections recorded in Zeek conn.log) immediately following the receipt of an unusual inbound packet (identified by anomalous size, flags, source, or specific trigger signature from Zeek conn.log). Use time series correlation between the anomalous packet arrival and the subsequent host behavior change to confirm the link."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using socket filters? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1205.002 - Socket Filters": {
          "Observed network packets with characteristics matching known evasive 'magic packet' triggers, such as specific TTL values, fragmented packets forming a trigger, or use of non-standard IP protocol numbers designed to be ignored by some security tools but parsed by a custom socket filter.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for inbound packets exhibiting characteristics known to be used in evasive socket filter triggers. This includes monitoring for packets with unusually low TTLs (potentially to avoid wide network detection or IDS), specific IP fragmentation patterns that reassemble into a known trigger, or IP packets using rarely seen protocol numbers if the filter is set at the IP layer. Maintain a list of such evasive selectors based on threat intelligence updates. Use correlation analysis to link these packets to hosts running processes suspected of using socket filters."
          },
          "Processes employing techniques to hide raw socket usage or the filter itself, such as filter code injected into legitimate processes or use of rootkit-like methods to mask listening sockets from standard enumeration tools, where the parent process shows signs of using socket filter libraries or is otherwise suspicious.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for legitimate processes (e.g., svchost.exe, explorer.exe, common browsers) spawning unexpected child processes or loading unusual DLLs, particularly shortly after an anomalous inbound network event. While direct detection of injected filter code from Event IDs is challenging, look for legitimate processes making unexpected network calls or exhibiting uncharacteristic behavior post-trigger. Cross-reference with outputs from advanced host inspection tools that can list raw sockets or Windows Filtering Platform (WFP) filters (Event ID 5156 may show WFP filter additions by unexpected processes) and look for discrepancies or unassociated filters that might indicate hidden mechanisms."
          },
          "A host receiving specific, low-volume, and individually innocuous-looking 'trigger' packets that do not result in immediate, obvious malicious activity but are suspected to alter system state (e.g., disable security logging, modify firewall rules) or activate a dormant component for later execution, thereby bypassing typical alert thresholds based on overt actions.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Security Event Logs (e.g., 4719 for audit policy change, 4947 for WFP change)",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for extremely low-frequency, uniquely characterized inbound packets (e.g., specific small UDP packet to a high port, ICMP echo reply with specific payload without a prior request) targeting internal hosts, especially those not typically receiving such traffic. Establish baselines for 'normal' rare traffic types per host profile. If such a packet is observed, monitor the target host via Event ID 4688 and other relevant Windows Security Event Logs for subtle changes (e.g., Event ID 4719 indicating system audit policy change, Event ID 4947 indicating a change to WFP, registry modifications indicative of tampering, file creation in temporary/hidden locations) that might not trigger immediate high-severity alarms but indicate activation of a defense evasion capability. Use entropy measures on packet characteristics per host to find highly unique, low-volume events."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary establishing command and control via socket filters? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1205.002 - Socket Filters": {
          "Inbound 'trigger' packets for C2 activation originating from known C2 infrastructure IP addresses/domains or matching highly specific, publicly documented 'magic packet' structures used by known malware families employing socket filters for C2.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Integrate threat intelligence feeds of IP addresses/domains and detailed 'magic packet' signatures (e.g., specific byte patterns, port, protocol, TCP flag combinations) associated with malware using socket filters for C2. Scan Zeek conn.log in near real-time for matches to these selectors. Alert on any confirmed hits. If full packet capture is available, analyze packet payloads against known C2 trigger signatures."
          },
          "A process, after being activated by a suspected socket filter trigger packet, initiates outbound C2 communication using protocols or patterns consistent with known socket filter-based backdoors (e.g., custom TCP/UDP protocol, data encoded in ICMP packets, or DNS tunneling initiated post-trigger from an unexpected process).": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the reception of a suspected trigger packet (identified via behavioral or selector-based evidence) with subsequent network activity from the target host. Monitor Windows Event ID 4688 for new processes spawned post-trigger. Analyze Zeek conn.log for outbound connections from these processes using custom protocols (non-standard ports, unusual handshake sequences), data encoded in ICMP payloads (if logged), or Zeek dns.log for DNS queries indicative of tunneling (e.g., high-entropy or unusually long subdomains from processes not typically performing such lookups). This aims to identify the C2 channel established *after* the socket filter is triggered."
          },
          "A host, following the receipt of specific inbound network stimuli matching socket filter criteria, spawns a reverse shell or establishes a persistent outbound connection to an external entity, where no prior legitimate listening service was active on the port that received the trigger packet.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for inbound connections, especially those with anomalous characteristics or matching known trigger signatures. Correlate these network events with near-simultaneous (e.g., within 1-5 seconds) Windows Event ID 4688 events on the target host. Specifically look for the creation of shell processes (cmd.exe, powershell.exe, bash.exe) or other processes known to establish reverse shells (e.g., netcat, socat variants) by an unexpected parent process. Crucially, verify against network state monitoring or baseline data that no legitimate listening service was active on the port/protocol that received the trigger packet prior to the event. Use time-series analysis and correlation logic to establish the temporal link between packet arrival and shell/C2 initiation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```