[
  {
    "Is the adversary attempting to discover network password policies? (TA0007 - Discovery)": {
      "Indicators": {
        "T1201 - Password Policy Discovery": {
          "Execution of command-line utilities (net accounts, Get-ADDefaultDomainPasswordPolicy, chage, cat /etc/pam.d/common-password, pwpolicy) associated with password policy discovery on hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creations containing command lines with `net accounts`, `Get-ADDefaultDomainPasswordPolicy`, `chage`, `cat /etc/pam.d/common-password`, or `pwpolicy`. Analyze frequency of execution per host/user. Flag executions from low-frequency users or hosts, or those occurring outside normal business hours using frequency analysis or time series analysis."
          },
          "Network traffic or process execution indicative of tools or scripts querying password policy via APIs or network device interactions.": {
            "Data": "Zeek http.log; Zeek syslog.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for connections containing strings related to cloud password policy APIs (e.g., 'GetAccountPasswordPolicy'). Monitor Zeek syslog.log for messages originating from network devices containing password policy command strings (`show aaa`). Monitor Windows Event ID 4688 for execution of tools/scripts potentially used for API calls or network device interaction. Analyze source IPs/hosts and destination. Use correlation analysis to link this activity with other suspicious network flows or host events."
          },
          "Execution of password policy discovery commands by user accounts or on hosts where such activity is not typically observed, or occurring outside standard administrative windows.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for executions of password policy discovery commands (`net accounts`, `Get-ADDefaultDomainPasswordPolicy`, etc.). Create a baseline of users and hosts typically executing these commands using descriptive statistics (e.g., frequency tables). Flag executions from accounts/hosts not in the baseline or with low historical frequency. Identify executions occurring outside typical work hours for the user/host using time series analysis or IQR on execution timestamps."
          },
          "High frequency of password policy discovery command execution or API calls originating from a single host or user account within a short time frame.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek syslog.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4688 events for password policy commands, Zeek http.log for relevant API calls, and Zeek syslog.log for network device commands by source host/IP and time. Calculate the rate or count of these events per source within specific time windows (e.g., per minute, per hour). Flag sources exhibiting a rate or count significantly higher than their historical average or a system-wide baseline using statistical process control or percentile thresholds. Investigate sources showing bursty activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]