[
  {
    "Has the adversary achieved execution using user interaction (copy and paste)? (TA0002 - Execution)": {
      "Indicators": {
        "T1204.004 - Malicious Copy and Paste": {
          "Process execution originating from clipboard interaction into a command or scripting interpreter (e.g., cmd.exe, powershell.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify instances where command/scripting interpreter processes (cmd.exe, powershell.exe, etc.) are created with unusual or obfuscated command-line arguments, especially if the parent process is a browser or email client. Apply entropy analysis to command line arguments to detect obfuscation. Use correlation analysis to link process creation events with preceding browser or email client activity."
          },
          "Process execution originating from clipboard interaction into the Windows Run dialog (explorer.exe launching other processes with command line arguments).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify instances where explorer.exe launches processes with command-line arguments that deviate significantly from normal user-initiated launches (i.e., indicating execution via the Run dialog). Analyze command line arguments for suspicious patterns or known malicious commands. Use frequency analysis to identify rare command executions via explorer.exe."
          },
          "Outbound network connections to unusual or known malicious destinations originating from a command or scripting interpreter process shortly after its creation.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation for cmd.exe, powershell.exe, etc.) with subsequent Windows Event ID 5156 (Network Connection) and Zeek conn.log entries originating from the same process/host within a short time window (e.g., 30 seconds). Filter for connections to unusual ports, protocols, or destinations not matching standard traffic patterns. Cross-reference destination IPs/domains against threat intelligence feeds. Use frequency analysis to identify rare destination connections."
          },
          "Creation of a command/scripting interpreter process with highly obfuscated or unusual command-line arguments, following recent activity in browser or email client applications.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command/scripting interpreter processes (cmd.exe, powershell.exe, wscript.exe, cscript.exe, etc.) created with complex, encoded, or unusually long command-line arguments. Calculate the entropy of command-line strings to identify obfuscation (high entropy suggests encoding). Correlate the timestamp of such suspicious process creations with recent activity (e.g., within the last minute) from browser processes (chrome.exe, firefox.exe, msedge.exe) or email client processes (outlook.exe) using timestamp analysis. Flag instances where high-entropy commands are executed shortly after user interaction with browsers or email clients."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]