[
  {
    "Is the adversary maintaining persistence using port knocking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Sequential connection attempts from a single source IP to a series of closed ports on a target system.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for failed connection attempts (e.g., conn_state = 'REJ' or 'RSTO'). Group events by source IP and destination host. Identify sequences of connection attempts from a single source IP to multiple unique ports on the same destination within a short time frame. Use time series analysis on connection attempts from specific source IPs to identify sequential patterns across ports."
          },
          "Unusual network traffic patterns characterized by short bursts of connection attempts to non-standard or seemingly random ports, followed by successful connections.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify external source IPs initiating multiple connection attempts (successful or failed) to a range of ports on internal systems. Use descriptive statistics (e.g., number of connections, range of ports, time delta between attempts) for each source IP. Compare these statistics to normal network behavior to find outliers potentially indicative of knocking patterns."
          },
          "Detection of raw socket usage or packet sniffing activity on a host correlating with receipt of suspicious inbound network traffic patterns.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for known packet sniffing tools or processes using raw sockets/low-level network APIs. Correlate these events with inbound network traffic patterns observed in Zeek conn.log that might match a port knocking sequence. Investigate if this activity is tied to user accounts or processes not normally authorized for such actions."
          },
          "Appearance of a new or previously inactive listening port on a host immediately following a suspected inbound port knocking sequence from an external source.": {
            "Data": "Windows Event ID 5158; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor host logs (Windows Event ID 5158 - A Windows Filtering Platform listening port has been blocked) and network visibility logs (Zeek conn.log showing unexpected server states on a port, or specific listening logs if configured) for new listening ports appearing on internal systems, especially those bound by unusual processes. Correlate the time of the port becoming active with suspected inbound port knocking sequences from external IPs identified in Zeek conn.log failed connection attempts. Analyze temporal correlation."
          },
          "Detection of a backdoor process starting or network service becoming active on a host immediately following a suspected port knocking sequence.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Windows Event ID 5158",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of suspicious processes (e.g., uncommon service names, unusual file paths, processes with hidden windows) or Windows Event ID 5158 for new listening ports bound by suspicious processes on internal hosts. Correlate the timestamps of these events with the completion time of suspected port knocking sequences targeting the same host identified in Zeek conn.log. Analyze the process lineage in Event ID 4688 and the network connections (Event ID 5156) associated with the new listening port or process."
          },
          "Recurring port knocking sequences observed targeting the same host at specific, low-activity times (e.g., late night, weekends).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for sequences of failed connection attempts characteristic of port knocking targeting internal hosts (as per existing actions). Use time series analysis and frequency analysis on the timing of these detected sequences. Identify patterns where sequences consistently occur outside of normal business hours or during periods of low network activity for the target host, and flag recurring sequences targeting the same host using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using port knocking? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Network sessions recorded with a small number of packets or unexpected flags/payloads that do not establish a standard TCP/UDP flow.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections with unusual conn_state values or short durations that don't represent established sessions. Correlate these with potential 'knocking' source IPs identified in other analyses. Use entropy measures on port sequences attempted by specific IPs to identify non-random or patterned probing."
          },
          "Detection of a previously closed port briefly opening or becoming active immediately after a suspected port knocking sequence from an external source.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for successful connections to ports that are typically closed or inactive. Look for correlations between a successful connection to an unusual port and preceding sequences of failed connection attempts from the same source IP (identified as per Evidence 1 action). Analyze temporal correlation between failed sequences and subsequent successful connections."
          },
          "Network traffic flows containing packets with unusual characteristics (e.g., unexpected flags, small payloads) that don't fit standard protocol handshakes, potentially used for knocking.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for sessions characterized by unusual TCP flags combinations or connection states indicating incomplete handshakes ('S0', 'SF' with very few packets). Filter for external source IPs and internal destinations. Use descriptive statistics on packet size, flags, and timing within potential knocking sequences to identify outliers or non-standard patterns."
          },
          "Observation of a successful connection to a port that was recently scanned or probed multiple times by the same external source IP without establishing a full session.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate entries in Zeek conn.log showing a successful connection (conn_state='SF') from an external IP to an internal host/port with preceding failed connection attempts ('REJ', 'RSTO', 'S0') from the *same* source IP to *other* ports on the *same* destination host within a recent time window. Analyze the temporal proximity and the specific sequence of attempted/failed ports leading to the successful connection using time series analysis."
          },
          "Modification of host-based firewall rules to temporarily open a port, immediately following a suspected inbound port knocking sequence.": {
            "Data": "Windows Event ID 4703; Windows Event ID 4716",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4703 (A policy in the Windows Firewall with Advanced Security has been changed) and 4716 (A rule in the Windows Firewall with Advanced Security policy has been changed) for changes that open inbound ports. Correlate the timestamps of these rule changes with the completion time of suspected inbound port knocking sequences identified in Zeek conn.log targeting the same host. Investigate rule changes that enable inbound connections to ports shortly after a knocking sequence using temporal correlation."
          },
          "Network traffic exhibiting characteristics of low-and-slow scanning or probing attempts to a series of ports, potentially used as part of a stealthy knocking sequence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for failed connection attempts from external IPs to internal hosts that are spread out over a longer duration or use longer delays between attempts than typical scans. Identify sequences of these low-frequency attempts targeting multiple ports on the same host. Use time series analysis and correlation analysis (e.g., calculating time delta distributions between attempts) to identify these spaced-out port probing patterns that might indicate a stealthy or low-and-slow port knocking attempt."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary establishing command and control using port knocking? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Identification of outbound connections from an internal host to an external IP or domain known to be suspicious, immediately following a detected port knocking sequence targeting that host.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate suspicious outbound connections (e.g., to known malicious IPs/domains from threat intel feeds) originating from internal hosts with inbound port knocking sequences targeting those same internal hosts. Use time series correlation to identify outbound C2 traffic occurring immediately after an inbound knock sequence is completed."
          },
          "Successful connections established to high or uncommon ports on internal systems that appear to be triggered by specific inbound traffic patterns from external sources.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful inbound connections from external sources to high or non-standard ports. Analyze the preceding network traffic from the source IP to the destination host for patterns matching a known or suspected port knocking sequence (e.g., specific port orders or timing). Use sequence analysis techniques on connection attempts to identify the knocking pattern that precedes the successful connection."
          },
          "Spikes in data transfer or unusual connection patterns on an internal host immediately following receipt of a suspected inbound port knocking sequence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For internal hosts targeted by suspected port knocking sequences (identified via prior evidence/actions), analyze subsequent Zeek conn.log entries for unusual outbound or inbound traffic patterns. Look for sudden increases in bytes transferred (`orig_bytes`, `resp_bytes`), connections to high/uncommon ports, or connections to unusual destinations/ports indicating C2 or exfiltration occurring within a short time window after the knocking sequence completes. Use time series analysis on data transfer volumes and connection counts."
          },
          "Outbound connection initiated from an internal host to an external destination immediately after a port knocking sequence was received and processed by that host.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate detected inbound port knocking sequences targeting an internal host with subsequent outbound connections initiated by that same internal host to external destinations within a short time frame (e.g., seconds to minutes). Analyze the destination IPs/domains of these outbound connections for known C2 infrastructure using threat intelligence feeds. Use temporal correlation analysis to link the inbound knock sequence to the outbound connection."
          },
          "Identification of connections on the port 'opened' by port knocking exhibiting characteristics of known C2 activity (e.g., beaconing, unusual protocol, encryption to suspicious endpoints).": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For connections to ports identified as potentially opened by port knocking, analyze associated Zeek logs (conn.log, ssl.log, dns.log) for C2 characteristics. Look for periodic connections (beaconing, use time series analysis or frequency analysis on connection timing), connections using uncommon ports or protocols, or connections involving encrypted traffic to suspicious external IPs or domains (check ssl.log subject/issuer, dns.log queries). Correlate with threat intelligence."
          },
          "Execution of suspicious commands or data staging/transfer activities on a host shortly after an inbound connection is established on a port potentially opened by port knocking.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful inbound connections to ports potentially opened by port knocking (identified in Zeek conn.log) with subsequent process creation events (Windows Event ID 4688) or outbound network connections (Windows Event ID 5156, Zeek conn.log) on the target host within a short time frame. Look for command execution (e.g., `cmd.exe`, `powershell.exe` with encoded commands), data compression/staging utilities, or outbound connections to unusual destinations/ports indicating C2 or exfiltration. Use temporal correlation analysis to link the inbound connection to the host activity."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
}
]