[
  {
    "Is the adversary maintaining persistence using socket filters? (TA0003 - Persistence)": {
      "Indicators": {
        "T1205.002 - Socket Filters": {
          "Presence of unexpected processes opening raw network sockets (using libpcap or setsockopt/SO_ATTACH_FILTER) on critical systems.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for process creations on servers/endpoints. Identify processes potentially using network access libraries or parameters associated with low-level network access. Calculate baseline network activity (bytes in/out from Zeek conn.log) for similar legitimate processes or for the specific host. Use descriptive statistics and correlation analysis to identify processes with parameters related to network access that show significantly lower network activity than expected or no recorded Zeek connections over time."
          },
          "Identification of specific, potentially crafted network packets arriving at target systems matching known filter criteria followed by host activity.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Develop Zeek detection rules (or queries in SIEM) to identify network connections or packets matching known or suspected socket filter criteria (e.g., specific ports, unusual connection patterns). Correlate identified network events from Zeek with host activity (Windows Event ID 4688 for process creation/termination) occurring within seconds of the packet arrival on the destination endpoint."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using socket filters? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1205.002 - Socket Filters": {
          "Existence of processes with raw sockets exhibiting minimal network or CPU activity over time, inconsistent with normal application behavior.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (process creation) and Zeek conn.log. Identify persistent processes via time series analysis of Event ID 4688 over time. For identified processes, query corresponding Zeek conn.log for network activity. Flag processes that persist but have minimal or no recorded network connections over extended periods, potentially using entropy measures on process network events or lack thereof."
          },
          "Detection of network traffic using specific, non-standard protocols or unusual port combinations targeting internal hosts, potentially designed to match a socket filter.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify inbound connections using non-standard ports (<1024 or >49151) or unusual protocol usage for those ports. Calculate frequency distribution of destination ports and protocols on internal hosts. Use percentile analysis or outlier detection to flag connections to ports or using protocols with extremely low occurrence rates, potentially indicative of socket filter triggers designed to bypass standard network monitoring."
          }
        }
      }
    }
  },
  {
    "Is the adversary establishing command and control via socket filters? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1205.002 - Socket Filters": {
          "Inbound network traffic containing specific byte sequences or headers known to trigger socket filters on target hosts.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inspect inbound network connections in Zeek logs for anomalies in packet size, structure, or flags that deviate significantly from typical traffic for the destination port (requires deeper parsing or packet data, but can be inferred from conn.log sometimes). Use descriptive statistics on packet size or other available fields and flag outliers potentially indicative of crafted packets designed to match a socket filter for C2."
          },
          "Sudden spawning of shell processes or execution of commands on a host immediately following the arrival of a specific network packet, without a standard listener active.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries (especially inbound connections with suspicious characteristics from the previous evidence) with Windows Event ID 4688 for process creation events on the destination host occurring immediately (e.g., within 1-5 seconds) after the network event. Specifically look for shell processes (cmd.exe, powershell.exe) being created via Event ID 4688 without a prior associated network listener process being detected."
          }
        }
      }
    }
  }
]