[
  {
    "Is the adversary bypassing security restrictions using indirect command execution? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1202 - Indirect Command Execution": {
          "Process creation events where utilities like pcalua.exe or scriptrunner.exe are parent processes to suspicious child processes or network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify instances where pcalua.exe, scriptrunner.exe, or similar utilities are the parent process of suspicious executables (e.g., those found in temporary directories, known malware locations, or with low execution frequency) or initiate network connections documented in Zeek conn.log. Use descriptive statistics to baseline common parent-child relationships and flag rare occurrences."
          },
          "Process creation events involving ssh.exe with unusual command line arguments (-o ProxyCommand/LocalCommand) or execution of uncommon utilities followed by suspicious activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify ssh.exe processes with command-line arguments containing -o ProxyCommand or -o LocalCommand. Identify process creations by less common utilities. Analyze the execution frequency of these specific command lines or utilities across the environment and investigate low-frequency or outlier occurrences (e.g., using percentile analysis on execution counts)."
          },
          "Execution of uncommon or rarely used Windows utilities (e.g., forfiles.exe, wsl.exe) with command-line arguments that specify executing another program or script.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations of utilities listed in T1202 (e.g., forfiles.exe, pcalua.exe, scriptrunner.exe, wsl.exe) with command-line arguments indicative of executing other processes or scripts (e.g., containing `/c`, `/p`, `-o`, invoking shell commands via /K or /C, or referencing non-standard executable paths/scripts). Use frequency analysis on the combination of utility name and command-line pattern to identify rare or novel execution instances compared to established baselines."
          },
          "Network connections initiated by processes of Windows utilities typically not expected to make external network connections (e.g., forfiles.exe, pcalua.exe).": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection events (Windows Event ID 5156, Zeek conn.log) with process creation events (Windows Event ID 4688). Filter for network connections originating from process IDs associated with utilities known to be abused for indirect command execution (e.g., forfiles.exe, pcalua.exe, scriptrunner.exe), especially those connecting to external or unusual destinations. Establish a baseline of typical network behavior for these utilities (if any) and flag deviations using statistical methods like comparing connection counts or destination diversity via entropy measure."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]