
[
  {
    "Has the adversary achieved execution using user interaction (copy and paste)? (TA0002 - Execution)": {
      "Indicators": {
        "T1204.004 - Malicious Copy and Paste": {
          "Execution of a command containing known malicious IP addresses, domains, or file hashes via a command-line interpreter or the Run dialog.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for all process creations, specifically capturing the full command line. Use regular expressions to scan command-line arguments for indicators of compromise (IOCs) such as known malicious IP addresses, domains, or file hashes sourced from a continuously updated CTI feed. Alert on any exact match found within the command line of processes like powershell.exe, cmd.exe, wscript.exe, cscript.exe, or any process launched by explorer.exe with a command line."
          },
          "Execution of command-line patterns commonly associated with malicious paste payloads, such as PowerShell download cradles, certutil commands for downloading files, or specific LOLBAS execution patterns.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 command lines for specific, known malicious patterns that are resilient to minor IOC changes. This includes regex for PowerShell download cradles (e.g., IEX(New-Object Net.WebClient).DownloadString), use of `certutil -urlcache -split -f`, or execution of other Living Off the Land Binaries (LOLBAS) with arguments typically used for malicious purposes (e.g., `mshta.exe javascript:...`). Maintain and update a library of these malicious patterns. Use correlation analysis to flag if these patterns appear in processes with no direct parent or are launched by a generic shell."
          },
          "A command-line interpreter (e.g., powershell.exe, cmd.exe) is executed with a highly obfuscated or unusually long command line, shortly after user activity in a browser, email client, or document reader.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 process creation events. Calculate the entropy and length of command lines for interpreters like powershell.exe, cmd.exe, wscript.exe, etc. Establish a baseline for command-line length and entropy for these processes. Flag events with statistically significant deviations (e.g., high entropy or length in the >95th percentile). Correlate the timestamps of these anomalous executions with preceding process activity (within 1-2 minutes) from browsers (chrome.exe, msedge.exe), email clients (outlook.exe), or document readers (acrord32.exe) on the same host to establish a likely copy-paste context."
          },
          "A newly created command-line interpreter process immediately initiates an outbound network connection, especially to a rare or newly observed external destination.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation (Windows Event ID 4688 for interpreters like powershell.exe, cmd.exe, curl.exe, certutil.exe) with subsequent network connections from that same host (Zeek conn.log) within a very short time window (e.g., <10 seconds). Profile normal network destinations for the environment. Use frequency analysis and descriptive statistics to identify connections to rare or never-before-seen destination IPs/domains. A time series analysis on the frequency of new destination domains being contacted by interpreters can reveal campaigns."
          },
          "A process is created by explorer.exe with a complex command line, indicative of pasting into the Windows Run dialog, followed by suspicious child processes or network activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes where the parent process is `explorer.exe` and a command line is present. Normal Run dialog usage is often simple (e.g., 'cmd', 'notepad'). Profile the complexity (length, special characters, entropy) of commands launched by `explorer.exe`. Flag unusually complex commands using Inter-Quartile Range (IQR) or percentile-based outlier detection. Correlate these flagged events with any subsequent suspicious child process creations (e.g., spawning of other interpreters) or network connections to identify the full chain of activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
