[
  {
    "Is the adversary maintaining persistence using port knocking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Sequential connection attempts from a single source IP to a series of closed ports on a target system.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for failed connection attempts (e.g., conn_state = 'REJ' or 'RSTO'). Group events by source IP and destination host. Identify sequences of connection attempts from a single source IP to multiple unique ports on the same destination within a short time frame. Use time series analysis on connection attempts from specific source IPs to identify sequential patterns across ports."
          },
          "Unusual network traffic patterns characterized by short bursts of connection attempts to non-standard or seemingly random ports, followed by successful connections.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify external source IPs initiating multiple connection attempts (successful or failed) to a range of ports on internal systems. Use descriptive statistics (e.g., number of connections, range of ports, time delta between attempts) for each source IP. Compare these statistics to normal network behavior to find outliers potentially indicative of knocking patterns."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using port knocking? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Network sessions recorded with a small number of packets or unexpected flags/payloads that do not establish a standard TCP/UDP flow.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections with unusual conn_state values or short durations that don't represent established sessions. Correlate these with potential 'knocking' source IPs identified in other analyses. Use entropy measures on port sequences attempted by specific IPs to identify non-random or patterned probing."
          },
          "Detection of a previously closed port briefly opening or becoming active immediately after a suspected port knocking sequence from an external source.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for successful connections to ports that are typically closed or inactive. Look for correlations between a successful connection to an unusual port and preceding sequences of failed connection attempts from the same source IP (identified as per Evidence 1 action). Analyze temporal correlation between failed sequences and subsequent successful connections."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary establishing command and control using port knocking? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1205.001 - Port Knocking": {
          "Identification of outbound connections from an internal host to an external IP or domain known to be suspicious, immediately following a detected port knocking sequence targeting that host.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate suspicious outbound connections (e.g., to known malicious IPs/domains from threat intel) originating from internal hosts with inbound port knocking sequences targeting those same internal hosts. Use time series correlation to identify outbound C2 traffic occurring immediately after an inbound knock sequence is completed."
          },
          "Successful connections established to high or uncommon ports on internal systems that appear to be triggered by specific inbound traffic patterns from external sources.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful inbound connections from external sources to high or non-standard ports. Analyze the preceding network traffic from the source IP to the destination host for patterns matching a known or suspected port knocking sequence (e.g., specific port orders or timing). Use sequence analysis techniques on connection attempts."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]