[
  {
    "Is the adversary using traffic signaling for persistence? (TA0003 - Persistence)": {
      "Indicators": {
        "T1205 - Traffic Signaling": {
          "Sequence of connection attempts to closed ports (port knocking) or packets containing unusual magic values/strings.": {
            "Data": "Zeek conn.log, Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for sequences of failed connection attempts to multiple closed ports from a single source IP. Use time series analysis to identify bursts of failed connections. Search Zeek conn.log (if payload logging is enabled/sufficient) or Windows Event ID 5156 details for specific byte sequences or 'magic values' indicative of signaling."
          },
          "Observation of network activity originating from systems that were recently offline, potentially activated by Wake-on-LAN.": {
            "Data": "Zeek conn.log, Windows Event ID 6005, Windows Event ID 6006",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for new connections originating from systems that were recently offline based on historical Zeek data or asset inventory. Correlate this activity with Windows Event IDs (6005 System startup, 6006 System shutdown) to identify unexpected system activation events."
          }
        }
      }
    }
  },
  {
    "Is the adversary using traffic signaling for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1205 - Traffic Signaling": {
          "Detection of network traffic with specific, unusual packet flags or header characteristics designed to evade detection.": {
            "Data": "Zeek conn.log, Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log fields for unusual combinations or presence of TCP flags (e.g., SYN+FIN, ACK+URG) in connection attempts that don't follow standard handshakes. Use frequency analysis on flag combinations to identify statistically rare occurrences. Review Windows Event ID 5156 for connections blocked based on specific packet characteristics."
          },
          "Connections to standard open ports where the initial data payload contains a recognizable 'magic value' sequence not typical for the service.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Search Zeek conn.log payloads (if logged sufficiently) for predefined 'magic value' strings or byte sequences known to trigger specific actions on target services, but which are not standard for the protocol. Apply pattern matching and entropy analysis on payload data to identify potentially obfuscated signaling content."
          }
        }
      }
    }
  },
  {
    "Is the adversary using traffic signaling for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1205 - Traffic Signaling": {
          "Traffic matching port knocking sequence followed by connection to potential C2 port/protocol.": {
            "Data": "Zeek conn.log, Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Develop detection logic to identify sequences of failed connection attempts (Zeek conn.log, Windows Event ID 5156) originating from the same source IP/port pair, followed immediately by a successful connection to a potential C2 port or protocol (e.g., standard ports used non-standardly). Use time-based correlation analysis."
          },
          "Network traffic payloads containing specific patterns or sequences consistent with known C2 signaling after an initial signaling sequence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Search Zeek conn.log payloads for patterns or high entropy indicative of encoded or encrypted C2 commands following an initial signaling sequence identified in Zeek conn.log. Use correlation analysis to link unusual payloads to potential signaling activity."
          }
        }
      }
    }
  }
]