
[
  {
    "Is the adversary attempting to discover network password policies? (TA0007 - Discovery)": {
      "Indicators": {
        "T1201 - Password Policy Discovery": {
          "Execution of a script or binary whose file hash is known to be associated with malicious tools that perform password policy discovery.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable file hash computation for process creation events (e.g., via Sysmon Event ID 1 or augmented Windows Event ID 4688). Continuously correlate the file hashes of all executed processes against a threat intelligence feed of known malicious file hashes, specifically looking for tools like BloodHound, PowerSploit modules, or other adversary toolkits known to perform discovery. Alert immediately on any hash match."
          },
          "Execution of specific command-line utilities and arguments known to be used for discovering password policies across Windows, Linux, and macOS environments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection rule that monitors Windows Event ID 4688 process creation command-lines for exact strings and common variations of password policy discovery commands. This includes: `net accounts /domain`, `Get-ADDefaultDomainPasswordPolicy`, `chage -l`, `cat /etc/pam.d/common-password`, `cat /etc/security/pwquality.conf`, and `pwpolicy getaccountpolicies`. Flag any execution of these command patterns for review, prioritizing those found on non-administrative workstations or servers."
          },
          "Password policy discovery commands executed by an anomalous user account, from an unusual parent process, or at an atypical time.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events matching password policy discovery patterns. Build a baseline of normal activity: which users/hosts execute these commands, from which parent processes (e.g., `explorer.exe`, `mmc.exe`), and at what times. Flag deviations, such as: execution by a non-administrative user, execution from a suspicious parent process (e.g., `winword.exe`, `powershell.exe`), or execution outside of established working hours for that user/host. Use descriptive statistics for baselining and Inter-Quartile Range (IQR) or percentile analysis to detect time-based anomalies."
          },
          "Password policy discovery activity occurring as part of a broader sequence of reconnaissance or credential access behaviors.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the execution of password policy discovery commands (T1201) with other discovery techniques (e.g., `net user`, `net group` for T1087, T1069) or subsequent credential access attempts (e.g., process memory dumping via T1003) originating from the same host and user session within a short time window (e.g., 1 hour). Use correlation analysis to chain these events together. Increase the risk score for hosts exhibiting this sequence of behaviors, as it strongly suggests goal-oriented adversary activity rather than benign administrative action."
          },
          "Anomalous network queries related to password policies, such as to network devices or cloud APIs, originating from unusual sources or in high volumes.": {
            "Data": "Zeek http.log; Zeek syslog.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs for password policy queries. For syslog, baseline which hosts normally query network devices for configuration (e.g., commands like `show aaa`). For http logs, baseline which services/hosts query cloud password policy APIs (e.g., AWS `GetAccountPasswordPolicy`). Use time series analysis to detect unusual spikes in query volume from a single source. Use frequency analysis to detect queries from a source that has never performed this action before. Analyze the entropy of sources making such queries to find outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
