[
  {
    "Has the adversary gained initial access via unauthorized hardware additions? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1200 - Hardware Additions": {
          "Detection of unauthorized or unknown network devices/endpoints not registered in asset management systems.": {
            "Data": "Zeek conn.log; Zeek dhcp.log; Zeek arp.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Compare list of active devices/IPs/MACs from Zeek logs (conn.log, dhcp.log, arp.log) and network scans against asset management database records. Identify devices present in network logs but not in asset management. Use correlation analysis between network scan data and Zeek logs over time to detect recent unapproved additions not accounted for in inventory updates."
          },
          "Logging of connection events for new or unknown hardware devices (USB, Thunderbolt, PCIe) on endpoints.": {
            "Data": "Windows Event ID 20001; Windows Event ID 20003; Windows Event ID 10001; Windows Event ID 10003",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs on endpoints for Plug and Play device installation events (e.g., DeviceInstall-Driver events 20001, 20003, DeviceSetupManager events 10001, 10003). Identify events for hardware types commonly used in attacks (USB, PCIe devices). Use frequency analysis or time series analysis to detect sudden spikes in new device connections across multiple endpoints or deviations from baseline device connection patterns for specific user groups."
          },
          "Anomalous network traffic patterns or destinations associated with newly connected or unauthorized network devices.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, http.log, ssl.log, dns.log) for network traffic originating from or routed through devices recently flagged as unauthorized or unknown from asset comparison. Analyze destination IPs/domains, ports, and protocol usage (e.g., unexpected outbound connections, connections to C2 infrastructure). Use time series analysis on traffic volume or frequency analysis on destinations to identify deviations from baseline behavior for similar device types or network segments, or flag connections to known malicious indicators."
          },
          "Unusual privileged process execution or unexpected network interfaces/wireless connections originating from an endpoint following detection of new hardware.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek wireless.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate endpoint events (Windows Event ID 4688 for processes with high privileges, Windows Event ID 5156 for new network connections) and Zeek logs (conn.log for unusual connections, wireless.log for unexpected MAC addresses on the wireless network) with the timestamp of new hardware connection events (e.g., Windows Event IDs 20001/20003). Flag instances where privileged processes or unusual network activity (e.g., connection to rogue AP MAC address via Zeek wireless.log) occur immediately after a new device is detected using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]