
[
  {
    "Has the adversary achieved execution via user interaction with a malicious link? (TA0002 - Execution)": {
      "Indicators": {
        "T1204.001 - Malicious Link": {
          "User navigation to URLs containing known malicious domains, IPs, or specific URI patterns associated with phishing or malware delivery kits.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate domains and IPs from Zeek http.log and conn.log against high-confidence threat intelligence feeds (updated hourly). Use regular expression matching on the full URI in Zeek http.log to detect patterns common to credential harvesting or malware kits (e.g., long hex strings, keywords like 'login' or 'verify' in conjunction with typosquatted domains). Calculate entropy on subdomains or URL paths to identify potential DGA or algorithmically generated URLs and flag outliers."
          },
          "A browser or document reader process spawning a suspicious script interpreter or living-off-the-land binary (LOLBin) with command-line arguments containing a URL or remote script path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for specific, high-risk parent-child process relationships. Create pattern-based alerts for when a browser (e.g., chrome.exe, msedge.exe), email client (e.g., outlook.exe), or document reader (e.g., acrord32.exe) spawns processes like mshta.exe, wscript.exe, cscript.exe, powershell.exe, or certutil.exe. Scrutinize the command-line arguments of the child process for the presence of URLs, remote file paths (e.g., .sct, .hta, .js), or encoded commands, as this is a common pattern for malicious link execution."
          },
          "A file is downloaded from a URL and the same file is executed on the endpoint within a very short time window.": {
            "Data": "Zeek http.log; Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection that correlates network and host events in a sequence. First, identify file downloads from web traffic using Zeek http.log (MIME types) and Zeek files.log (file details). Then, correlate the timestamp and destination host IP with process creation events (Windows Event ID 4688) on that host. A high-fidelity alert is generated if a process is created with the same filename (or hash, if available) as the downloaded file within a tight time window (e.g., less than 30 seconds), indicating a likely drive-by download or user-tricked execution."
          },
          "A browser or email client spawns a child process that executes from an unusual or non-standard file path, such as a temporary internet folder, user profile appdata folder, or the downloads directory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Establish a baseline of normal child processes and their typical execution paths for common parent applications (browsers, email clients, document readers). Use frequency analysis and baselining to flag rare parent-child process relationships or, more importantly, executions from unexpected locations (e.g., executables running directly from `%APPDATA%`, `%TEMP%`, or a user's `Downloads` folder). Correlate these events with recent network activity from the same host to link them to a potential malicious link click."
          },
          "A newly created process, spawned after a user navigates to a suspicious URL, immediately initiates outbound network connections, especially to known malicious infrastructure or using unusual protocols.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Trace process execution chains originating from user web activity. Correlate a suspicious web visit (Zeek http.log) with a subsequent process creation event (Windows Event ID 4688) on the user's endpoint. Further correlate the new Process ID with network connection creation events (Windows Event ID 5156, and enriched by Zeek conn.log). Alert when a process spawned shortly after a link click initiates outbound connections to IPs/domains flagged by threat intelligence (selector), or exhibits behavioral anomalies like connecting over non-standard ports, using a protocol inconsistent with the port, or beaconing. Use time series analysis to detect sudden bursts of network activity following a suspicious link click."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
