[
  {
    "Has the adversary executed malicious code via user interaction with a malicious file? (TA0002 - Execution)": {
      "Indicators": {
        "T1204.002 - Malicious File": {
          "Execution of common office applications (Word, Excel, PDF reader) or archive utilities (WinRAR, 7z) that result in suspicious child processes or network connections.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Filter for parent processes being common office applications or archive utilities. Identify suspicious child processes commonly used by adversaries (e.g., powershell.exe, cmd.exe, wscript.exe, mshta.exe) spawned by these parent processes. Use frequency analysis or correlation to identify rare process relationships."
          },
          "Network connections initiated by typically non-network-aware applications (e.g., Word, Excel, PDF reader) or anomalous connections following file execution.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from hosts shortly after a user activity event. Correlate Zeek connection logs with Windows Event ID 4688 (Process Creation) and Windows Event ID 5156 (Network Connection) to identify network connections initiated by processes spawned by suspicious parent applications (like Word/Excel) or applications not typically making outbound connections. Use time series analysis on connection volume or entropy analysis on destination IPs/ports for connections originating from user workstations."
          },
          "Execution of suspicious file types or documents initiating uncommon processes from user directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation on endpoints. Identify processes launched from temporary directories or user download paths with suspicious extensions (.scr, .lnk, .pif, .cpl). Filter for office applications or PDF readers whose command line arguments indicate password protection or suspicious options (e.g., external command execution). Use frequency analysis per user/host to baseline normal process execution paths and types, flagging outliers."
          },
          "Outbound network connections to rare or malicious destinations originating from user workstations immediately following process execution.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log with Windows Event ID 4688/5156 to identify outbound connections from user workstations and the processes creating them. Filter connections originating from processes launched from suspicious file types or paths identified in Windows Event ID 4688. Identify connections to destination IPs/domains that are rare across the network (using frequency analysis or entropy) or listed in threat intelligence feeds (using inner join). Use time series analysis to detect anomalous connection patterns (e.g., sudden spikes, unusual timing)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]