[
  {
    "Is the adversary attempting to evade defenses using signed binaries? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.008 - Odbcconf": {
          "odbcconf.exe executed with /S /A {REGSVR ...} arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for processes named 'odbcconf.exe'. Filter for command lines containing '/S /A' and 'REGSVR'. Collect count of occurrences per host/user. Use descriptive statistics to identify outliers or sudden increases in this activity."
          },
          "odbcconf.exe loading an unusual or malicious DLL.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine the command line arguments of 'odbcconf.exe' executions captured by Windows Event ID 4688. Extract the path to the DLL being loaded. Compare the loaded DLL path against known trusted locations (e.g., System32) and a blacklist of known malicious DLLs. Use correlation analysis to link odbcconf.exe execution to prior/subsequent process executions or network connections."
          },
          "Odbcconf.exe execution associated with a process spawned from an unusual parent process or executed in an unusual location (not System32).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'odbcconf.exe' process creations. Identify the ParentProcessName and ParentProcessCommandLine fields. Compare parent processes and execution paths against a baseline of normal odbcconf.exe usage (typically spawned by installers, run from System32). Flag executions from unusual parent processes (e.g., cmd.exe, powershell.exe, explorer.exe, unusual custom applications) or from non-standard directories using frequency analysis and correlation with parent process activity."
          },
          "Outbound network connections initiated by a process spawned from odbcconf.exe or by a DLL loaded via odbcconf.exe.": {
            "Data": "Windows Event ID 5156; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful odbcconf.exe executions loading a DLL (from Windows Event ID 4688) with subsequent outbound network connections (Windows Event ID 5156 on host, Zeek conn.log on network) originating from the odbcconf.exe process ID or any child processes spawned directly from it. Analyze destination IPs/ports for suspicious patterns or known malicious infrastructure using threat intelligence feeds. Use correlation analysis to link the network activity back to the specific odbcconf.exe execution and loaded DLL."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]