[
  {
    "Is the adversary using Electron applications to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.015 - Electron Applications": {
          "Legitimate Electron application processes (e.g., teams.exe, chrome.exe) spawning unusual child processes (e.g., cmd.exe, powershell.exe, script interpreters) with suspicious command line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Filter for process creations where the parent process is a known Electron application (e.g., teams.exe, slack.exe, code.exe). Analyze command line arguments of child processes (e.g., cmd.exe, powershell.exe, wscript.exe, cscript.exe) for suspicious patterns, encoded commands, or execution of unusual file paths. Use correlation analysis to link parent/child process creation events."
          },
          "Detection of suspicious activity originating from within an Electron application's process space, such as outbound network connections to unusual destinations or subsequent spawning of suspicious processes.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for network connections where the source process is a known Electron application. Analyze connection destinations for communication with suspicious or unknown external IP addresses or domains (e.g., C2 traffic). Monitor Windows Event ID 4688 for child processes spawned *by* Electron applications and correlate with network activity. Use descriptive statistics on connection destinations and frequency to identify outliers."
          },
          "Execution of Electron application processes or their components with suspicious command line arguments (e.g., '--disable-gpu-sandbox', '--gpu-launcher').": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Filter for processes where the executable name is associated with Electron applications (e.g., teams.exe, slack.exe, code.exe, chrome.exe when spawned by electron). Analyze the \"Command Line\" field using string matching for presence of '--disable-gpu-sandbox' or '--gpu-launcher'. Flag instances where these arguments are used, as they can indicate attempts to disable security features or launch arbitrary payloads."
          },
          "Script interpreter processes (e.g., powershell.exe, cmd.exe executing scripts, wscript.exe, cscript.exe) spawned as child processes of Electron applications.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Filter for processes where the \"Parent Process Name\" is a known Electron application and the \"New Process Name\" is a script interpreter or command shell often used to execute scripts (e.g., powershell.exe, cmd.exe, wscript.exe, cscript.exe). Analyze the \"Command Line\" of the child process for execution of scripts, encoded commands, or unusual file paths. Use frequency analysis to identify rare parent-child executions or statistically unusual command line lengths/entropy."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]