[
  {
    "Is the adversary attempting to evade defenses using Control Panel? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.002 - Control Panel": {
          "Execution of control.exe or rundll32.exe with parameters indicating CPL file execution, especially from unusual locations or with suspicious command line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for executions of 'control.exe' or 'rundll32.exe' with '.cpl' file extensions in the command line. Analyze command line arguments for suspicious patterns (e.g., unusual paths, unexpected arguments). Use frequency analysis or clustering of command line arguments to identify rare or outlier executions."
          },
          "Presence of unregistered or suspicious .cpl files on systems, or unusual registry entries related to Control Panel items (CPLs, Extended Properties, NameSpace).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes captured by Windows Event ID 4688 that may interact with Control Panel related registry keys (e.g., regedit.exe, cmd.exe modifying registry). Periodically scan endpoints and servers for .cpl files in unusual directories (not System32). Correlate file presence/creation events with corresponding registry modifications or process executions. Use statistical analysis on file modification times or sizes to flag anomalies."
          },
          "Creation or modification of .cpl files, particularly in non-standard locations or with unusual naming conventions.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes creating or writing files with a '.cpl' extension, especially in directories outside System32 (e.g., user directories, temp folders) by analyzing the command line and target path. Use Windows Event ID 4663 (requires specific SACL configuration on target directories) to audit write/modify operations on '.cpl' files. Use frequency analysis on file paths to identify rare locations for .cpl files."
          },
          "Execution of control.exe or rundll32.exe targeting a .cpl file, where the executing process or its children initiate suspicious network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `control.exe` or `rundll32.exe shell32.dll,Control_RunDLL` executions where the command line includes a '.cpl' file path. Correlate these process executions with subsequent network connections (Windows Event ID 5156, Zeek conn.log) initiated by the process or its child processes. Cross-reference destination IPs/domains against threat intelligence feeds. Use correlation analysis between process execution times and network connection times to identify potential C2 or data exfiltration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]