
[
  {
    "Is the adversary collecting sensitive information from internal SharePoint repositories? (TA0009 - Collection)": {
      "Indicators": {
        "T1213.002 - Sharepoint": {
          "Access to SharePoint documents or list items containing predefined sensitive keywords (e.g., 'password,' 'secret,' 'credentials,' 'network diagram,' 'API key') by accounts not typically authorized for such information or exhibiting other anomalous access characteristics.": {
            "Data": "SharePoint Access Logs; SharePoint Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and parse SharePoint Access Logs and Audit Logs. Define and maintain a list of sensitive keywords critical to the organization. Monitor for access events to documents/items where filenames, titles, or metadata (if logged) match these keywords. Correlate these access events with user roles, typical access patterns, and source IP geolocation. Alert on access to keyword-matched content by non-authorized users, from unusual IP ranges/geolocations, or if a user suddenly accesses an abnormally high number of such sensitive documents. Use frequency analysis and descriptive statistics on keyword hits per user to identify outliers."
          },
          "Use of specific User-Agent strings, HTTP request patterns (e.g., unusual API calls, specific query parameters), or PowerShell cmdlets known to be associated with SharePoint enumeration tools, vulnerability scanners, or data scraping scripts.": {
            "Data": "SharePoint IIS Logs; Zeek http.log; Windows Event ID 4104 (PowerShell Script Block Logging)",
            "Data Platform": "Servers, Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect SharePoint IIS logs or monitor Zeek http.log for traffic to SharePoint. Maintain and update a list of User-Agent strings, HTTP request patterns (e.g., specific `/_vti_bin/` calls, `/_api/web/lists/` enumeration patterns, known malicious query strings), and PowerShell commands/cmdlets (from Windows Event ID 4104 on systems interacting with SharePoint) associated with known SharePoint exploitation/collection tools (e.g., PowerSploit modules, SharePointMapper, SPIDER). Alert on matches using regular expression matching and signature-based detection for these patterns."
          },
          "An individual user account accessing an anomalously high volume or unusual diversity of distinct SharePoint documents, pages, or list items within a short timeframe, deviating significantly from their established baseline or peer group activity.": {
            "Data": "SharePoint Access Logs; SharePoint Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and parse SharePoint Access/Audit Logs. For each user, establish a dynamic baseline of typical SharePoint activity (e.g., number of distinct files/pages accessed per hour/day, types of content, common site paths). Monitor for significant deviations using statistical methods such as Z-scores, percentile analysis (e.g., activity in the >99th percentile), or Inter-Quartile Range (IQR) on access counts. Calculate the entropy of accessed file types or site paths per user session; a sudden increase in entropy might indicate broad, indiscriminate collection. Alert on users exhibiting unusually high access volume or breadth compared to their individual or group baseline."
          },
          "Access to SharePoint resources by highly privileged Active Directory accounts (e.g., Domain Admins, Enterprise Admins, Schema Admins) or specific service accounts outside of their normal, documented functional scope or at unusual times.": {
            "Data": "SharePoint Access Logs; Windows Event ID 4624 (on SharePoint server); Active Directory logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify and maintain a list of highly privileged Active Directory accounts and critical service accounts. Monitor SharePoint Access Logs and Windows Event ID 4624 (Logon Type 3 for network access) on SharePoint servers for any access attempts or resource interactions by these accounts. Establish strict baselines; most such accounts should have zero or minimal legitimate SharePoint activity. Alert on any detected access or significant deviation from expected behavior (e.g., access outside business hours if any baseline exists). Use correlation analysis to link logon events with SharePoint resource access by these high-privilege accounts."
          },
          "A correlated sequence of SharePoint access followed by unusual internal network activity or data staging, such as accessing sensitive documents on SharePoint and then connecting to multiple internal file shares, internal code repositories, or initiating large internal data transfers.": {
            "Data": "SharePoint Access Logs; Zeek conn.log; Windows Event ID 5140; Windows Event ID 5145 (File Share Access)",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate SharePoint access events (user, timestamp, accessed resource/keywords) with subsequent network activity from the same user's endpoint using Zeek conn.log. Look for patterns such as: 1. User accesses SharePoint documents known to contain sensitive information or links. 2. Within a short time window (e.g., 5-30 minutes), the user's endpoint initiates connections to internal file shares (confirm with Windows Event IDs 5140, 5145), internal wikis, code repositories not typically accessed by that user, or initiates large data transfers to other internal systems. Use time-series correlation and descriptive statistics on data transfer volumes to identify potentially related staging activities."
          },
          "Anomalous download activity from SharePoint, characterized by users downloading an unusually large number of files or total data volume, especially if followed by suspicious outbound network traffic or execution of archival utilities.": {
            "Data": "SharePoint Access Logs; SharePoint Audit Logs (for download events); Zeek conn.log; Zeek http.log; Windows Event ID 4688 (Process Creation)",
            "Data Platform": "Servers, Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor SharePoint logs for file download events, capturing user, file count, and total data volume. Establish baselines for user download activity (number of files, total size per session/day). Alert on users significantly exceeding these baselines (e.g., using IQR, Z-score, or percentile-based thresholds). Correlate high SharePoint download activity with subsequent large or unusual outbound data transfers from the user's endpoint (Zeek conn.log, Zeek http.log) or the execution of compression/archival tools (e.g., 7zip.exe, rar.exe from Windows Event ID 4688) on the user's endpoint shortly after the downloads. Use linear regression or correlation analysis to explore relationships between SharePoint download spikes and potential exfiltration indicators."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
