[
  {
    "Is the adversary establishing command and control using remote desktop software? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1219.002 - Remote Desktop Software": {
          "Execution of known remote desktop software processes (e.g., teamviewer.exe, anydesk.exe, vncserver.exe) on endpoints or servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints and servers. Filter for process names corresponding to common remote desktop software (TeamViewer, AnyDesk, VNC, RDP variants if unusual execution paths/parents). Analyze process execution frequency using descriptive statistics or time series analysis to identify spikes or deviations from normal baselines. Investigate execution initiated by unusual parent processes."
          },
          "Outbound network connections to known remote desktop service infrastructure or IP addresses from internal hosts.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound connections to known ports or IP ranges associated with remote desktop services. Use Zeek dns.log to identify resolutions of domains associated with these services. Cross-reference destination IPs/domains with threat intelligence feeds. Use correlation analysis to link these network connections with process execution logs (Windows Event ID 4688) where possible."
          },
          "Successful authentication to external remote desktop services originating from an internal host using a user account that has not previously used such services or is using them outside of normal working hours/patterns.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (specifically Logon Type 10 - RemoteInteractive) on servers/endpoints to identify successful remote interactive logons. Correlate with Zeek conn.log showing sustained outbound connections from the source host of the logon event to common remote desktop service ports/domains. Identify user accounts performing this activity. Establish a baseline of typical users and times for such activity using descriptive statistics. Flag users initiating these connections outside of their established normal working hours or users who have not performed this action in the past using frequency analysis or time series anomalies."
          },
          "Execution of suspicious commands or data transfer occurring during or immediately after an active remote desktop session initiated from an internal host.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify periods of active remote desktop sessions (e.g., based on Logon Type 10 duration from Windows events or sustained outbound connections to remote desktop services in Zeek conn.log). Monitor Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) on the remote host during these periods. Look for the execution of suspicious commands (e.g., via 4688 command line analysis) or unusual network connections (e.g., large data transfers indicated by Zeek conn.log bytes_orig/bytes_resp, or connections to unusual destinations via 5156) initiated by processes during the session. Use correlation analysis to link specific processes/connections to the time frame of the remote desktop activity. Apply statistical methods (e.g., Z-score or IQR) to identify anomalous network transfer volumes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]