[
  {
    "Is the adversary attempting to evade defenses using MMC? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.014 - MMC": {
          "Execution of mmc.exe with non-standard or suspicious .msc file paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes where the 'New Process Name' is 'mmc.exe'. Filter these events to identify occurrences where the 'Command Line' contains '.msc'. Compare the '.msc' file path and name against a baseline of commonly used legitimate .msc files (e.g., services.msc, eventvwr.msc, gpedit.msc). Flag executions of .msc files outside of standard system directories or with unusual names. Use frequency analysis on non-standard .msc files to identify rare occurrences."
          },
          "Execution of mmc.exe with suspicious command-line arguments (e.g., '-Embedding', '/a', or arguments related to system recovery inhibition like 'delete catalog').": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes where the 'New Process Name' is 'mmc.exe'. Analyze the 'Command Line' for suspicious arguments such as '-Embedding', '/a', 'delete catalog', or other command-line parameters associated with malicious use documented in threat intelligence. Use pattern matching or correlation analysis with known malicious command patterns."
          },
          "Network connections initiated by mmc.exe to unusual or external destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 for network connections initiated by the process 'mmc.exe'. Identify destination IPs and ports. Compare against a baseline of known legitimate remote management destinations or services used by administrators. Flag connections to external IPs, known malicious IPs (correlate with TI feeds), or unusual ports/services. Use frequency analysis to identify rare destinations or correlation analysis to link connections with suspicious MMC arguments or file paths."
          },
          "Execution of mmc.exe targeting specific sensitive .msc files (e.g., wbadmin.msc, services.msc, taskschd.msc) with actions indicative of system modification or recovery inhibition.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'mmc.exe' process creations. Filter for command lines containing specific sensitive `.msc` file names like 'wbadmin.msc', 'services.msc', 'taskschd.msc', etc. Analyze the command line and correlate with subsequent process activity (e.g., related Service Control Manager events like 7036, or other 4688 events) for arguments or actions indicative of malicious intent (e.g., 'delete catalog', 'stop', 'disable'). Use correlation analysis to link mmc.exe execution with specific undesirable system state changes initiated shortly after."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]