[
  {
    "Is the adversary attempting to evade defenses using signed binaries? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.013 - Mavinject": {
          "Execution of mavinject.exe with suspicious command-line arguments like '/INJECTRUNNING' or '/HMODULE'.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where NewProcessName ends with 'mavinject.exe'. Filter for command lines containing '/INJECTRUNNING' or '/HMODULE'. Analyze frequency and compare to historical baseline using descriptive statistics to identify rare or unusual occurrences."
          },
          "Execution of a process with file properties matching mavinject.exe but a different filename, using arguments like '/INJECTRUNNING'.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line contains '/INJECTRUNNING' but the NewProcessName is not 'mavinject.exe'. Investigate the OriginalFileName field (if available in logs) or perform file property analysis on the binary itself to identify if it is a renamed mavinject.exe. Correlate execution times across endpoints using time series analysis to find synchronized suspicious activity."
          },
          "Mavinject.exe execution targeting sensitive processes or injecting from unusual file paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'mavinject.exe' executions. Extract the target process ID (PID) and the injected DLL path from the command line. Identify the target process name associated with the PID. Flag executions injecting into known sensitive processes (e.g., explorer.exe, services.exe, winlogon.exe, specific application processes) or injecting DLLs located in temporary folders, user profiles outside of standard application locations, or network shares. Use correlation analysis to link mavinject execution events with the target process and analyze the frequency of injections into different process types."
          },
          "Anomalous frequency, timing, or location of mavinject.exe execution relative to historical patterns.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'mavinject.exe' executions across the environment. Track the count and timestamps of executions per host and per user. Use time series analysis to detect sudden increases (spikes) in execution volume or executions occurring outside of established business hours or maintenance windows for a given host/user. Identify hosts where mavinject.exe is rarely or never executed and flag the first instance. Use descriptive statistics (mean, std dev, IQR) to profile normal execution patterns and identify outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]