
[
  {
    "Is the adversary attempting to evade defenses using trusted system binaries? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218 - System Binary Proxy Execution": {
          "Execution of a system binary proxy involving file hashes or command-line arguments that are known indicators of compromise (IOCs) for specific malware.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of system binary proxies (rundll32.exe, regsvr32.exe, etc.). Extract file paths of any DLLs or scripts being executed from the command line. Using Windows Event ID 4663 (Object Access), obtain the hash of the file being accessed/executed by the proxy binary. Correlate these hashes and full command-line strings against a high-confidence threat intelligence feed of known malicious IOCs. Trigger a high-severity alert on any match."
          },
          "Execution of system binaries (e.g., rundll32.exe, regsvr32.exe, msiexec.exe) with command-line patterns indicative of malicious proxy execution, such as loading files from non-standard locations or using suspicious flags.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Use regular expressions to flag command lines where system proxies load payloads from atypical directories (e.g., C:\\Users\\Public\\, C:\\Windows\\Temp\\, C:\\$Recycle.Bin\\, AppData\\Local\\Temp). Specifically search for patterns like `regsvr32 /s /i:http[...] scrobj.dll` or `msiexec /q /i http[...]`. Maintain and apply a list of known-malicious command-line structures for these binaries and use it for pattern matching."
          },
          "A system binary proxy being spawned by an unusual parent process, such as an Office application, browser, or email client, indicating a potential phishing payload or code execution from a compromised user application.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 process creation events, analyzing the full parent-child process relationship. Establish a baseline of common parent processes for each system binary proxy (e.g., `svchost.exe` is a common parent for `rundll32.exe`). Use frequency analysis to identify rare parent processes, flagging executions where the parent is an Office application (winword.exe, excel.exe), browser (chrome.exe), PDF reader, or a script host spawned by one of these applications. Use correlation analysis to score the risk of the entire process execution chain."
          },
          "Anomalous network connections or file system modifications initiated by system binary proxies that typically do not perform such actions as part of their legitimate function.": {
            "Data": "Windows Event ID 5156; Windows Event ID 4663; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for system binary proxies (e.g., `regsvr32.exe`, `cmstp.exe`, `mshta.exe`) initiating network connections (Windows Event ID 5156, Zeek conn.log) or creating/modifying executable files (Windows Event ID 4663). Establish a strict baseline of expected network and file I/O behavior for each binary (many should have none). Use time series analysis on Zeek data to spot sudden enterprise-wide spikes in connections from a specific proxy binary. Use linear regression to detect anomalous data transfer volumes correlated with proxy execution events."
          },
          "A correlated sequence of events where a user-facing application spawns a shell or script interpreter that, in turn, launches a system binary proxy for malicious code execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and monitor for a high-risk sequence using process creation events (Windows Event ID 4688). Correlate events within a short time window (e.g., 60 seconds) that match the pattern: 1) A parent process like `WINWORD.EXE` or `OUTLOOK.EXE` spawns 2) a child process like `powershell.exe`, `cmd.exe`, or `wscript.exe`, which then spawns 3) a grandchild process that is a known system binary proxy (e.g., `rundll32.exe`, `msiexec.exe`). This detection should correlate events based on Process GUIDs and Parent Process IDs to reconstruct the full, high-fidelity execution chain."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
