[
  {
    "Is the adversary collecting sensitive information from Confluence repositories? (TA0009 - Collection)": {
      "Indicators": {
        "T1213.001 - Confluence": {
          "Access to Confluence repositories by privileged accounts or accounts with no prior history of accessing Confluence.": {
            "Data": "Confluence Access Logs; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Confluence Access Logs for successful logins and page views. Cross-reference accessed user accounts against a list of privileged accounts. Identify users with no prior history of Confluence access (e.g., calculate access frequency per user over time and flag users with zero or low frequency accessing it for the first time). Investigate access by privileged or new/unusual users."
          },
          "A user account rapidly accessing or retrieving a large number of documents/pages from Confluence.": {
            "Data": "Confluence Access Logs; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Confluence Access Logs (and potentially Zeek http.log for request/response sizes) to count the number of documents/pages accessed and volume of data retrieved per user within a given time window. Calculate baseline access rates and data volumes per user. Use statistical methods like Z-score or IQR to identify users accessing significantly more documents or retrieving larger data volumes than their typical behavior or the group average within a short period."
          },
          "Unusual volume or frequency of data downloads from the Confluence server.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek fileinfo.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and fileinfo.log for data transfers originating from the Confluence server. Analyze the total bytes transferred and the count of files downloaded per external destination or unusual internal destination over time. Use statistical methods (e.g., IQR, z-score) to identify significant deviations from established baselines for download activity from the Confluence server."
          },
          "Successful logons to other internal systems shortly after suspicious Confluence access by the same user account.": {
            "Data": "Confluence Access Logs; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify user accounts exhibiting anomalous Confluence access (e.g., privileged account access, rapid data retrieval) using Confluence Access Logs. Correlate these users and timestamps with successful network logons (Windows Event ID 4624, Type 3) or other authentication events (e.g., RDP via Zeek conn.log) on other internal servers within a defined time window (e.g., 30 minutes). Investigate logons to systems not typically accessed by that user or from unusual source IPs, potentially using correlation analysis between Confluence access time and subsequent logon time/location."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]