[
    {
        "information_requirement": "Has the adversary used exploitation techniques to gain credential access?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1212",
                "name": "Exploitation for Credential Access",
                "evidence": [
                    {
                        "description": "Network traffic containing specific signatures or IOCs associated with known credential access exploits (e.g., Zerologon/CVE-2020-1472, PetitPotam/CVE-2021-36942).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dce_rpc.log",
                            "Zeek ntlm.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Deploy and monitor network intrusion detection signatures (e.g., via Zeek scripting or a dedicated NIDS) specific to credential access vulnerabilities like CVE-2020-1472 (Zerologon), which involves an all-zero challenge in Netlogon RPC calls, or CVE-2021-36942 (PetitPotam), which involves specific EFSRPC calls. Correlate alerts with Zeek dce_rpc.log and ntlm.log to confirm exploit attempts against domain controllers. Alert immediately on any signature match."
                    },
                    {
                        "description": "Anomalous Kerberos ticket requests or forged ticket attributes indicative of known exploitation patterns like Kerberoasting or Golden/Silver Ticket attacks.",
                        "data_sources": [
                            "Windows Event ID 4769",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4769 (A Kerberos service ticket was requested) for an unusually high volume of requests for various service principal names (SPNs) from a single host, a key pattern of Kerberoasting. Profile normal SPN request volume per host and use the IQR method or Z-scores to detect outliers. In Zeek kerberos.log, monitor for tickets with weak encryption (RC4_HMAC), abnormally long lifetimes, tickets signed with an old krbtgt key, or tickets for non-existent users that are successfully used for authentication (Windows Event ID 4624)."
                    },
                    {
                        "description": "Anomalous crashes, resource consumption, or unexpected behavior in critical authentication processes (e.g., LSASS) on servers, particularly Domain Controllers.",
                        "data_sources": [
                            "Windows Event ID 1000"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Domain Controllers and other critical servers for application crash events (Event ID 1000) involving lsass.exe. Establish a baseline for process stability and alert on any crash of LSASS, as this is highly anomalous and a potential indicator of credential dumping attempts or other exploits. Use correlation analysis to link the crash timestamp with any preceding unusual network activity (from Zeek conn.log) or process creation events (from Windows Event ID 4688) from a specific source, potentially identifying the attacker's host and methods."
                    },
                    {
                        "description": "Authentication traffic patterns indicating credential reuse attacks like Pass-the-Hash or Pass-the-Ticket, such as widespread NTLM use from unexpected sources or an account logging into multiple systems simultaneously from one host.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek ntlm.log",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4624, specifically looking for Logon Type 9 (NewCredentials), which can indicate credential reuse tools, or Logon Type 3 (Network) using NTLM authentication from hosts that should use Kerberos (e.g., domain-joined Windows clients). Use Zeek ntlm.log to profile and detect widespread or unusual NTLM usage. Use correlation analysis to identify a single source IP performing authentications to many distinct target systems using the same account credentials within a short time window (<5 minutes), a behavioral pattern indicative of lateral movement with stolen credentials."
                    },
                    {
                        "description": "Anomalous authentication patterns following a suspected credential exploitation event, such as logins from unusual geolocations, impossible travel scenarios, or access to atypical resources for the compromised account.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate any suspected exploit alert (from other detections) with subsequent successful authentication activity (Windows Event ID 4624) by potentially compromised user accounts. For these high-risk accounts, immediately analyze login geolocation, time-of-day, and destination resources against their established individual baseline. Use statistical profiling (e.g., percentile analysis of login times) and impossible travel analysis to flag suspicious successful logins. Use linear regression to determine if the compromised account's access patterns correlate with known lateral movement or data access behaviors."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
