[
  {
    "Is the adversary attempting to discover browser information on compromised hosts? (TA0007 - Discovery)": {
      "Indicators": {
        "T1217 - Browser Information Discovery": {
          "Access or enumeration of browser data files/directories (e.g., bookmarks, history, saved logins) by unusual processes or from unusual locations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (Accesses field contains ReadData, ReadAttributes, EnumerateSubdirectories) and 4656 (Access Mask indicates read/enumerate) for access attempts to known browser profile directories (%APPDATA%\\*BrowserName* or equivalent paths) by non-browser processes. Analyze Windows Event ID 4688 to identify the process name and parent process. Use correlation analysis to link process execution with subsequent file/directory access events. Establish a baseline of normal processes accessing these directories using frequency analysis and flag deviations."
          },
          "Suspicious processes executing commands or accessing APIs to gather browser information, potentially using scripting or system management tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for process creations involving system management tools (e.g., PowerShell, wmic.exe) or common scripting interpreters (e.g., cscript.exe, wscript.exe) with command lines targeting browser data paths or executing commands known to extract browser data (e.g., reading specific registry keys or files). Use frequency analysis to identify rare or anomalous command line arguments or parent-child process relationships involving browsers and data access tools. Flag command lines containing known browser file paths or credential extraction tool names."
          },
          "Outbound network connections from processes known to access browser data paths, potentially indicating data exfiltration.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes known to access browser profile paths (e.g., standard browser processes or suspicious processes flagged by other detections based on Windows Event IDs 4663/4656). Monitor Windows Event ID 5156 for outbound network connections initiated by these processes. Correlate with Zeek conn.log to analyze connection details (destination IP/port, bytes transferred - orig_bytes, resp_bytes). Use frequency analysis or outlier detection (e.g., IQR) on data volume for connections originating from these processes to external or unusual internal IPs. Investigate connections to suspicious destinations or those transferring significantly larger amounts of data than normal baseline for that process."
          },
          "Access to browser files known to store cached credentials or session cookies by non-browser processes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 and 4656 for read access attempts (`Accesses` field indicates ReadData) on known browser credential files (e.g., 'Login Data', 'Cookies', 'Web Data', 'History') located within browser profile directories, specifically looking for access by non-browser processes. Correlate these file access events with process creation events (Windows Event ID 4688) to identify the accessing process and its parent. Establish a baseline of normal processes accessing these specific files and flag access by other processes. Investigate correlations between suspicious file access and subsequent network connections (Zeek conn.log) or command execution (Windows Event ID 4688)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]