[
  {
    "Is the adversary collecting sensitive data or information via messaging applications? (TA0009 - Collection)": {
      "Indicators": {
        "Suspicious file transfers or sharing activity detected within messaging applications.": {
          "Data": "Zeek file.log; Zeek conn.log",
          "Data Platform": "Network devices, Endpoints",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek file.log for files associated with messaging application traffic patterns. Identify connections in Zeek conn.log involving relevant endpoints and estimate data volume (bytes_sent, bytes_recv). Identify unusually large file transfers or connections with high data volume using statistical methods like outliers analysis (e.g., IQR) on size/volume metrics."
        },
        "Unusual access patterns or volume of messaging activity associated with accounts potentially involved in data collection.": {
          "Data": "Windows Event ID 4688; Zeek conn.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for the creation of messaging application processes on endpoints. For endpoints running these processes, analyze Zeek conn.log to identify connections originating from those endpoints. Use time series analysis or descriptive statistics to detect unusually high frequency or volume of connections associated with these endpoints, especially during abnormal hours."
        },
        "Messaging application process creation followed by suspicious file access or transfer activity.": {
          "Data": "Windows Event ID 4688; Zeek file.log; Zeek conn.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for creation of messaging application processes. Correlate these events temporally and by host with Zeek file.log entries showing file transfers or Zeek conn.log indicating connections for file transfer protocols (e.g., SMB, HTTP/S to suspicious destinations). Look for large files, uncommon file types transferred from user directories, or transfers to unusual external IPs occurring shortly after messaging app activity. Use correlation analysis based on time and source host to identify suspicious patterns."
        },
        "Messaging application process initiating network connections to internal network resources or unusual external destinations.": {
          "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for messaging application processes. Correlate these processes with outbound network connections identified in Windows Event ID 5156 or Zeek conn.log originating from the same process or host. Identify connections targeting internal IP ranges/ports not typically used by messaging apps (e.g., databases, file shares, internal APIs) or connections to external IPs/domains categorized as suspicious (e.g., C2, paste sites, personal cloud storage). Use descriptive statistics on destination addresses and ports to find rare connections or cluster analysis to group similar suspicious connections."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]