[
  {
    "Is the adversary attempting to evade defenses using system script proxies? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1216 - System Script Proxy Execution": {
          "Execution of script interpreter processes (e.g., cscript, wscript) with unusual child processes or command-line parameters.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the parent process is a known script interpreter (e.g., cscript.exe, wscript.exe) and the child process is unusual or known to be associated with malware. Analyze command-line arguments for suspicious patterns (e.g., execution of encoded commands, remote scripts, or common malware file names). Use frequency analysis to identify uncommon child processes launched by these interpreters."
          },
          "Execution of specific known proxy scripts (e.g., PubPrn.vbs, Forfiles.exe) with suspicious command-line arguments pointing to external or unusual files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving known script proxy executables (e.g., pubprn.vbs, forfiles.exe, pcalua.exe). Analyze command-line arguments for references to external files (URLs, network paths), unusual paths, encoded strings, or suspicious commands. Use correlation analysis to link this execution to prior events (e.g., file drops or network connections)."
          },
          "Outbound network connections originating from script interpreter processes (cscript, wscript) or known proxy executables.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 for outbound network connections where the initiating process name is a script interpreter (e.g., cscript.exe, wscript.exe) or a known proxy executable (e.g., pubprn.vbs, forfiles.exe). Correlate with Zeek conn.log entries originating from the same host and timestamp to identify destination IPs, ports, and protocols. Identify rare destination IPs, ports, or protocols using frequency analysis compared to baseline network traffic for these processes. Flag connections to external or suspicious destinations (e.g., C2 indicators from TI feeds)."
          },
          "Execution of a script interpreter or proxy executable with command-line arguments pointing to files in suspicious or non-standard locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the process name is a script interpreter (e.g., cscript.exe, wscript.exe) or a known proxy executable (e.g., pubprn.vbs, forfiles.exe). Analyze the 'Command Line' field in Event ID 4688 for arguments referencing files located in common temporary directories (%TEMP%, %APPDATA%, %USERPROFILE%\\Downloads), recently created folders, or network shares (e.g., \\\\...). Use correlation analysis to identify patterns where execution from these locations is unusual for specific users or hosts, potentially flagging outlier executions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]