[
  {
    "Is the adversary using rundll32.exe for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.011 - Rundll32": {
          "Execution of rundll32.exe with unusual command line arguments, unknown DLLs, or suspicious function names/ordinals.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for rundll32.exe process creations. Extract command line arguments. Compare arguments (DLL path, function name/ordinal) against a baseline of known legitimate rundll32 usage. Use frequency analysis or set difference to identify rare or new command patterns. Flag executions loading DLLs from non-standard paths or using suspicious function calls/ordinals."
          },
          "Execution of rundll32.exe attempting to load or execute scripts (e.g., JavaScript) or Control Panel (.cpl) files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for rundll32.exe process creations. Extract command line arguments. Identify command lines containing patterns indicative of script execution (e.g., 'javascript:', '.sct', suspicious URLs) or loading '.cpl' files via shell32.dll functions. Analyze the arguments for embedded scripts or remote script fetches."
          },
          "Rundll32.exe making outbound network connections, especially to suspicious domains or IP addresses, or to download files.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for rundll32.exe executions. Correlate rundll32.exe Process ID with network connection events (Windows Event ID 5156 for process-specific connections on host, or Zeek conn.log for general network traffic). Analyze destination IPs/domains against threat intelligence feeds. Use descriptive statistics to identify unusual port usage or data transfer volumes by rundll32.exe. Flag command lines containing URLs (e.g., in 'javascript:' arguments) and investigate corresponding network connections."
          },
          "Execution of rundll32.exe loading DLLs from unusual locations or with mismatched file names/extensions, or invoking functions with W/A suffixes without corresponding base functions (or vice-versa) as an obfuscation technique.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze rundll32.exe command lines (Windows Event ID 4688) for DLLs loaded from atypical paths (e.g., %TEMP%, user profile directories, browser cache locations). Check for DLLs with legitimate names but residing in unexpected locations or having incorrect file extensions. For function calls, examine if `FunctionNameW` or `FunctionNameA` is called when only `FunctionName` (or vice-versa) is a known legitimate export for that DLL in its standard path, or if the invoked function name doesn't match known exports. Maintain a baseline of legitimate DLLs, their paths, and their function call patterns for rundll32.exe and identify deviations using rule-based checks or anomaly detection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]