[
  {
    "Is the adversary establishing command and control using remote access hardware? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1219.003 - Remote Access Hardware": {
          "Unusual persistent network connections or data transfer patterns to external IPs associated with potential KVM/remote access protocols.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for persistent connections to external IPs on ports not typically used for known legitimate services or ports commonly associated with remote access tools (e.g., SSH, VNC, RDP if tunneled, or less common ports). Analyze connection duration and data volume for these sessions. Use time series analysis or correlation analysis to identify unusual connection patterns or spikes in traffic to suspicious destinations, correlating with known internal host IPs."
          },
          "System activity (e.g., process execution) inconsistent with normal user behavior but typical of interactive remote control.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for process creation activity occurring without corresponding interactive logon events (e.g., Event ID 4624 type 2 or 10) within a reasonable time window. Look for sequences of processes executed rapidly or in an unusual order on critical systems. Correlate host activity timestamps with unusual network connection timestamps identified in Zeek logs. Use statistical analysis (e.g., frequency analysis, entropy) on executed commands to identify deviations from baseline user behavior for specific systems."
          },
          "Network traffic patterns consistent with IP KVM devices or remote access hardware, potentially correlated with physical device connection events.": {
            "Data": "Zeek conn.log; Windows Event ID 2003",
            "Data Platform": "Network devices; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections involving ports or network behaviors potentially indicative of KVM devices or remote access hardware. Analyze connection timing, frequency, and bytes transferred. Correlate external connections with Windows Event ID 2003 on endpoints indicating new USB or other hardware connections on targeted systems. Use frequency analysis to identify systems receiving new hardware connections and concurrent suspicious external network traffic."
          },
          "System activity (e.g., keyboard/mouse input simulation) occurring without a corresponding interactive user logon session.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify all process creation events (Windows Event ID 4688) or other user activity logs on critical systems. Correlate these events with successful interactive logon events (Windows Event ID 4624, Logon Type 2 or 10) within a reasonable time window (e.g., 15 minutes). Flag system activity or process execution that occurs *without* a preceding interactive logon event. Use time series analysis to detect activity patterns that don't align with user presence and interactive logon activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]