[
  {
    "Is the adversary using IDE tunneling for command and control? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1219.001 - IDE Tunneling": {
          "Execution of IDE tunneling CLI tools or related processes/extensions with unusual parameters or from unexpected locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for execution of known IDE tunneling CLIs (e.g., 'code tunnel') or related executables. Look for executions with suspicious command-line arguments or unusual parent processes. Use frequency analysis on process names/paths per host/host group to identify outliers."
          },
          "Outbound network connections from hosts to unusual external IP addresses or domains on non-standard ports, exhibiting characteristics of IDE tunneling traffic.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound connections from internal hosts to external destinations on unusual ports (beyond standard web, mail, etc.). Correlate with Zeek ssl.log to identify encrypted connections. Investigate traffic patterns (e.g., connection duration, data volume) for anomalies compared to baseline network traffic using descriptive statistics. Use correlation analysis to link suspicious network traffic with host process execution."
          },
          "Installation or execution of IDE software or associated remote access components on non-developer systems.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process names of IDEs or their remote components and Windows Event ID 4697 for related service installations. Establish a baseline of systems where IDEs are legitimately installed or run. Use frequency analysis or whitelisting to identify execution/installation events on systems outside this baseline (e.g., critical servers, non-developer workstations). Analyze parent processes and command lines for suspicious behavior (e.g., silent installation switches)."
          },
          "Outbound network connections exhibiting specific encrypted protocol characteristics associated with IDE tunneling.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for JA3/JA3S hashes or SNI values known to be associated with IDE remote development services (e.g., VS Code remote, GitHub Codespaces tunneling). Correlate these findings with Zeek conn.log to identify the source IP and connection details. Maintain a list of legitimate destinations and fingerprints for known development teams and flag connections to unusual external IPs or with unknown/suspicious fingerprints using frequency analysis on observed JA3/SNI pairs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]