[
    {
        "information_requirement": "Is the adversary attempting to evade defenses using MMC?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense-Evasion",
        "indicators": [
            {
                "technique_id": "T1218.014",
                "name": "MMC",
                "evidence": [
                    {
                        "description": "Execution of mmc.exe with a console file (.msc) name or full path matching known malicious indicators from threat intelligence.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for 'mmc.exe' process creations. Extract the full path of the console file (.msc) from the 'Command Line' field. Compare the file name and its full path against a maintained, up-to-date list of atomic indicators (known malicious file names/paths) from threat intelligence feeds. Alert on any exact matches."
                    },
                    {
                        "description": "Execution of mmc.exe with known suspicious command-line argument patterns, such as those used for COM hijacking or inhibiting system recovery.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creations of 'mmc.exe'. Analyze the command line using regular expressions to detect known malicious patterns, including but not limited to: the '-Embedding' argument (often used for COM hijacking), '/a' (author mode), or arguments targeting specific snap-ins like 'wbadmin.msc' combined with 'delete catalog' to inhibit recovery. Correlate with parent process information; execution by an unusual parent (e.g., Office application, wscript.exe) increases suspicion."
                    },
                    {
                        "description": "The mmc.exe process is spawned by an unusual parent process, such as a Microsoft Office application, a script interpreter, or a process running from a temporary location.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for 'mmc.exe' process creations and analyze the 'Creator Process Name' (parent process). Establish a baseline of legitimate parent processes for mmc.exe (e.g., 'explorer.exe', 'cmd.exe', 'powershell.exe' when run by an administrator). Alert on mmc.exe executions spawned by unexpected parents like 'winword.exe', 'excel.exe', 'wscript.exe', 'cscript.exe', or any process running from a non-standard path (e.g., %TEMP%, %APPDATA%). Use frequency analysis to identify rare parent-child relationships."
                    },
                    {
                        "description": "Execution of mmc.exe with a console file (.msc) from a non-standard or user-writable directory, or targeting sensitive snap-ins for defense evasion purposes.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4688 for 'mmc.exe' executions. Establish a baseline of legitimate `.msc` file locations (e.g., C:\\Windows\\System32\\). Flag any execution of `.msc` files from unusual locations like user profiles, temp directories, or network shares. Additionally, monitor for the execution of sensitive snap-ins (`wbadmin.msc`, `services.msc`, `taskschd.msc`, `secpol.msc`) and correlate with subsequent system changes (e.g., service stop/disable events, task deletion, security policy modifications) to detect malicious sequences of activity. Use descriptive statistics on file path locations to identify outliers."
                    },
                    {
                        "description": "Anomalous network connections initiated by the mmc.exe process, especially to external destinations, known malicious IPs, or on non-standard ports.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 5156"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Windows Event ID 5156 (Windows Filtering Platform connection permitted) for the 'mmc.exe' process with Zeek conn.log data. Establish a baseline of normal network behavior for mmc.exe (which should rarely initiate external connections). Flag all connections to external IP addresses. Use a box-plot or IQR analysis on destination ports to find outliers. Inner join destination IPs with threat intelligence feeds for high-fidelity alerts. High entropy in destination ports or IPs from a single host's mmc.exe process over a short time could indicate C2 or scanning activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
