[
  {
    "Is the adversary bypassing defenses using CMSTP? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.003 - CMSTP": {
          "Execution of CMSTP.exe with unusual command-line arguments or making external network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for CMSTP.exe execution. Identify instances where CMSTP.exe is the Parent Image or makes outgoing network connections (Zeek conn.log). Analyze command-line arguments (Event ID 4688) for unusual patterns or remote file references (.INF, .DLL, .SCT). Compare frequency of specific arguments over time using descriptive statistics to identify rare or new command lines."
          },
          "Process access or registry events related to CMSTP.exe involving auto-elevated COM interfaces (CMLUA.dll, CMSTPLUA, CMLUAUTIL).": {
            "Data": "Windows Event ID 10; Windows Event ID 12; Windows Event ID 13; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 10, 12, 13 (Sysmon) for activity involving CMSTP.exe or its parent CMMGR32.exe, specifically looking for references to CMLUA.dll or COM interface GUIDs (3E5FC7F9-9A51-4367-9063-A120244FBEC7, 3E000D72-A845-4CD9-BD83-80C07C3B881F). Analyze correlating Windows Event ID 4688 events for CMSTP.exe launched with associated flags or child processes."
          },
          "CMSTP.exe loading or attempting to load files from remote network locations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for CMSTP.exe execution. Analyze command line arguments for file paths containing network shares (e.g., \\\\host\\share) or URLs (http://, https://, ftp://). Correlate CMSTP.exe process creation events with Zeek conn.log to identify outgoing connections made by CMSTP.exe or its child processes to external or unusual internal destinations (e.g., unusual SMB traffic initiated by CMSTP). Use frequency analysis on destination IPs/ports associated with CMSTP connections."
          },
          "Creation of suspicious child processes or files by CMSTP.exe or processes it executes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 11",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 where CMSTP.exe is the Parent Image. Identify child processes with suspicious names, locations (e.g., Temp directories, user profile directories), or command lines (e.g., powershell, cmd, wscript, cscript executing unusual scripts). Monitor Windows Event ID 11 (Sysmon) for files created by CMSTP.exe or its child processes with suspicious extensions (.sct, .dll, .vbs, .js, .ps1) or in unusual locations. Use frequency analysis or correlation analysis to identify rare child processes or file creations originating from CMSTP."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]