[
  {
    "Is the adversary bypassing defenses using trusted utilities? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.009 - Regsvcs-Regasm": {
          "Execution of Regsvcs.exe or Regasm.exe process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the creation of processes named 'regsvcs.exe' or 'regasm.exe' (Windows Event ID 4688). Alert on any execution of these processes, as their legitimate use is often limited in typical enterprise environments."
          },
          "Execution of Regsvcs.exe or Regasm.exe with unusual command-line arguments or attempting to register unusual .NET assemblies.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect command-line arguments for all 'regsvcs.exe' or 'regasm.exe' process creations (Windows Event ID 4688). Compare current arguments, parent process, and the paths/hashes of the referenced .NET assemblies against a baseline of known good executions. Use frequency analysis or outlier detection on command-line parameters or referenced assembly paths to identify rare occurrences."
          },
          "Execution of Regsvcs.exe or Regasm.exe originating from an unusual parent process or in an unusual directory location.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations of 'regsvcs.exe' or 'regasm.exe'. Analyze the 'ParentProcessName' and 'ProcessPath' fields. Establish a baseline of common parent processes (e.g., installer processes, Visual Studio) and process paths (e.g., System32, Framework directories) using descriptive statistics. Flag executions originating from unusual parent processes or non-standard directories using frequency analysis or deviation from baseline."
          },
          "Network connections initiated by or immediately following execution of Regsvcs.exe or Regasm.exe connecting to unusual or external destinations.": {
            "Data": "Windows Event ID 5156; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 5156 (network connections) and Windows Event ID 4688 (process creation) on the same host to identify connections initiated by 'regsvcs.exe', 'regasm.exe', or their child processes. Additionally, correlate Zeek conn.log entries with the timing of 'regsvcs.exe'/'regasm.exe' execution, focusing on connections from the host to external or unusual destinations. Analyze destination IPs against threat intelligence feeds or identify statistically rare destination ports/protocols using frequency analysis or entropy measures."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]