[
  {
    "Is the adversary collecting sensitive information from internal repositories? (TA0009 - Collection)": {
      "Indicators": {
        "T1213.002 - Sharepoint": {
          "Access to SharePoint resources by privileged accounts that typically do not interact with these systems.": {
            "Data": "SharePoint Access Logs; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and parse SharePoint Access Logs and Windows Event ID 4624 (Logon) from the SharePoint server. Filter for access events by known privileged accounts (e.g., Domain Admins, Enterprise Admins). Correlate these accesses with typical activity baselines for these accounts. Investigate any access to SharePoint resources by these accounts using methods like frequency analysis or comparison against historical access patterns."
          },
          "A single user account or a small group of accounts accessing an unusually large number of documents or pages within SharePoint in a short period.": {
            "Data": "SharePoint Access Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and parse SharePoint Access Logs. Group access events by user and time window (e.g., hourly, daily). Count the number of distinct documents/pages accessed per user per time window. Use statistical methods (e.g., Z-score, percentile analysis, or IQR) to identify users whose access volume significantly deviates from their baseline or the overall user population mean/median. Investigate accounts showing unusually high access volume, which may indicate programmatic scraping."
          },
          "Network connections from systems accessing SharePoint to internal network shares or resources, potentially following links found in documents.": {
            "Data": "Zeek conn.log; Windows Event ID 5140; Windows Event ID 5145",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from systems known to access SharePoint (servers or user endpoints) to internal file share ports (e.g., 445, 139) or other internal service ports shortly after the system accessed SharePoint. Correlate with Windows Event IDs 5140 (Share access audited) and 5145 (Detailed Share access audited) on file servers to confirm file share access details. Analyze correlation results for accesses to sensitive shares or accesses from unexpected sources, using time correlation analysis to link SharePoint access and subsequent internal connections."
          },
          "Large volume of data transfer from systems accessing SharePoint to external destinations, potentially indicating bulk data exfiltration.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusually large outbound data transfers (bytes_out) from systems accessing SharePoint (servers or user endpoints) to external IP addresses. Filter for connections occurring after the user/system accessed SharePoint, particularly focusing on protocols commonly used for tunneling (e.g., HTTP via Zeek http.log). Use statistical methods (e.g., median, IQR, Z-score analysis) to identify transfer sizes significantly exceeding the baseline for that system or destination. Investigate large transfers, especially if they coincide with accessing sensitive data on SharePoint."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]