[
  {
    "Is the adversary employing defense evasion techniques using InstallUtil? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.004 - InstallUtil": {
          "Execution of InstallUtil.exe from an unusual location or with unusual parent processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Win Event ID 4688) for InstallUtil.exe execution. Filter for execution path not matching expected .NET framework directories (C:\\Windows\\Microsoft.NET\\Framework*). Analyze parent process relationships from Event ID 4688's 'ParentProcessName'. Use frequency analysis to identify rare or never-before-seen parent processes launching InstallUtil.exe."
          },
          "Execution of InstallUtil.exe with command-line arguments targeting suspicious or unsigned .NET binaries.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command-line arguments for InstallUtil.exe executions captured in process creation events (Win Event ID 4688). Identify arguments pointing to specific .NET binaries (.dll, .exe) and their paths. Cross-reference target binary paths/hashes against known good lists or look for binaries located in temporary or user directories. Use correlation analysis to link InstallUtil execution with subsequent suspicious process activity by analyzing child processes in Event ID 4688."
          },
          "Network connections initiated by InstallUtil.exe or a process created by it immediately after execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created by InstallUtil.exe. Correlate these child processes and InstallUtil.exe itself with network connection events (Windows Event ID 5156) and Zeek conn.log entries occurring within a short time window (e.g., 60 seconds) of InstallUtil.exe execution on the same host. Flag connections to unusual or external destinations, especially if the originating process is unknown or the connection occurs outside normal network flows. Use frequency analysis on destination ports/IPs observed for processes spawned by InstallUtil."
          },
          "InstallUtil.exe execution following or preceding command-line utilities commonly used for malicious purposes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify sequences of process creation events where InstallUtil.exe is executed within a short time window (e.g., 10 seconds) after or before the execution of known suspicious utilities (e.g., `powershell.exe`, `cmd.exe`, `bitsadmin.exe`) with suspicious command-line arguments, using timestamp correlation. Use correlation analysis based on time and parent-child relationships (if available) to link these activities, flagging sequences involving InstallUtil.exe."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]