[
  {
    "Is the adversary attempting to evade defenses using trusted executables? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.012 - Verclsid": {
          "Execution of verclsid.exe with unusual command-line arguments (e.g., /S /C {CLSID}) or from a suspicious parent process (e.g., Office application, unusual process).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for verclsid.exe execution. Analyze command-line arguments for suspicious flags like /S /C. Identify the parent process. Use correlation analysis to identify instances where verclsid.exe is spawned by non-standard or unexpected parent processes (e.g., Office applications, scripts) and compare against historical baseline activity using descriptive statistics."
          },
          "verclsid.exe spawning child processes or initiating outbound network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created by verclsid.exe. Monitor Zeek conn.log for outbound network connections initiated by verclsid.exe or its direct child processes. Use statistical analysis (e.g., frequency analysis, time series analysis) to identify rare or anomalous child process creation or network connection patterns compared to baseline activity."
          },
          "Execution of verclsid.exe referencing an unusual or unknown CLSID.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for verclsid.exe execution. Extract the CLSID from the command line (/C {CLSID}). Maintain a baseline/list of commonly observed CLSIDs used by verclsid.exe in the environment using frequency analysis. Flag execution with CLSIDs not present in the baseline, or CLSIDs known to be associated with malicious activity."
          },
          "Execution of verclsid.exe where the launching command or parent process command line contains suspicious elements.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for verclsid.exe execution. Extract the ParentProcessCommandLine. Analyze the parent command line for suspicious keywords, encoded commands, or patterns often seen in exploitation frameworks, scripts, or documents using string matching and regular expressions. Flag instances where the parent command line contains obfuscated strings or known malicious command patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]