[
    {
        "information_requirement": "Is the adversary employing defense evasion techniques using InstallUtil?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1218.004",
                "name": "InstallUtil",
                "evidence": [
                    {
                        "description": "Execution of InstallUtil.exe targeting a .NET assembly with a known malicious file hash.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for InstallUtil.exe. Extract the filename of the target assembly from the command-line arguments. Obtain the file hash (e.g., SHA256) of that target assembly. Perform a join operation to compare the assembly's hash against a continuously updated threat intelligence feed of known malicious file hashes. Alert on any match and isolate the host for forensic investigation."
                    },
                    {
                        "description": "Execution of InstallUtil.exe with the '/u' or '/uninstall' switch targeting a .NET assembly located in a non-standard, user-writable directory.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for InstallUtil.exe. Filter for executions that contain the command-line switches '/u' or '/uninstall'. For those events, parse the target assembly's file path. Flag any execution where the target path matches a pattern of high-risk, user-writable directories (e.g., `C:\\Users\\*`, `C:\\Windows\\Temp\\*`, `C:\\Temp\\*`, `C:\\ProgramData\\*`). Correlate these events with suspicious parent processes like `cmd.exe`, `powershell.exe`, or Office applications to increase confidence."
                    },
                    {
                        "description": "Execution of InstallUtil.exe by an unusual parent process, such as an Office application, web browser, or script interpreter, deviating from its expected parentage.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for InstallUtil.exe. Establish a baseline of legitimate parent processes (e.g., `explorer.exe`, `Visual Studio`, `msiexec.exe`, `services.exe`) by analyzing historical data. Use descriptive statistics to identify the most common parents. Flag any execution where the parent process is not on the established baseline, with high priority alerts for parents like `winword.exe`, `excel.exe`, `powershell.exe`, `wscript.exe`, or `mshta.exe`. Use frequency analysis or a pre-defined list of suspicious parents to prioritize alerts."
                    },
                    {
                        "description": "A sequence of events where InstallUtil.exe executes a .NET assembly that subsequently initiates outbound network connections, especially to unknown or low-reputation IP addresses.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a time-based correlation rule. First, detect an InstallUtil.exe execution via Windows Event ID 4688, noting the host and timestamp. Second, monitor Zeek conn.log for any new outbound network connections from that same host within a short window (e.g., 60 seconds) after the execution. Analyze the destination IP/domain; use correlation analysis to link the process event with the network event. Flag connections to non-corporate IP space, destinations with low reputation scores, or those using non-standard ports. Use time series analysis to detect anomalous spikes in network traffic following InstallUtil executions across the enterprise."
                    },
                    {
                        "description": "A temporal cluster of activity where InstallUtil.exe is executed shortly after a file is downloaded or written to disk, suggesting a download-and-execute payload delivery chain.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for sequences by correlating data across different platforms. Look for a file download (especially .dll or .exe) to a host, identified via Zeek files.log. Correlate this with a subsequent execution of InstallUtil.exe (Windows Event ID 4688) on the same host, where the command line targets the recently downloaded file. The correlation should be based on filename, host IP/name, and a tight time window (e.g., under 5 minutes). Use graph analysis to visualize these chains of events (download -> execute) to identify common patterns of attack."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
