```json
[
  {
    "Is the adversary bypassing defenses using CMSTP? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.003 - CMSTP": {
          "CMSTP.exe is executed to install a malicious INF profile with a known malicious file hash or one that attempts to connect to a known malicious C2 IP address or domain.": {
            "Data": "Windows Event ID 4688; Windows Event ID 11; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the creation of INF files (Windows Event ID 11) and capture their file hashes. Correlate the INF filename with CMSTP.exe executions (Windows Event ID 4688) that reference the file. Match the file hash against a threat intelligence database of known malicious files. Separately, correlate CMSTP.exe process execution with subsequent network connections (Zeek conn.log) and match destination IPs/domains against a CTI feed of known C2 infrastructure. Alert on any matches."
          },
          "CMSTP.exe is executed using specific command-line switches and interacts with COM interfaces known to be associated with UAC bypass techniques.": {
            "Data": "Windows Event ID 4688; Windows Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a specific detection rule that identifies a pattern of CMSTP.exe execution with the '/au' command-line switch (Windows Event ID 4688) immediately followed by a process access event (Windows Event ID 10) from CMSTP.exe targeting CMLUA.dll with specific access masks. This pattern is a strong indicator of the CMSTP UAC bypass technique."
          },
          "Execution of CMSTP.exe from an unusual parent process (e.g., an Office application) or from a non-standard file path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate parent processes for CMSTP.exe (e.g., explorer.exe, cmd.exe). Monitor Windows Event ID 4688 for executions where the parent process is anomalous, such as WINWORD.EXE, OUTLOOK.EXE, or powershell.exe. Additionally, flag any execution of CMSTP.exe from a directory other than its default location in System32. Use frequency analysis on parent process names and process executable paths to identify rare and suspicious occurrences."
          },
          "CMSTP.exe spawns suspicious child processes (e.g., PowerShell, Rundll32) or initiates network connections to unusual external destinations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for instances where CMSTP.exe is the parent process. Flag the creation of unexpected child processes like powershell.exe, cmd.exe, wscript.exe, cscript.exe, or rundll32.exe, especially if they are executing encoded commands or scripts from temporary locations. Correlate the CMSTP.exe process start time with network connection logs (Zeek conn.log) to identify any network connections made by the process or its immediate children. Use time series analysis or regression to find correlations between CMSTP execution and subsequent anomalous network beaconing or data transfers."
          },
          "A temporary INF file is created in a user-writable directory, executed via CMSTP.exe, and then quickly deleted.": {
            "Data": "Windows Event ID 11; Windows Event ID 4688; Windows Event ID 23",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlation rule to detect a sequence of events within a short time window (e.g., < 1 minute): 1. An INF file is created (Windows Event ID 11) in a user-writable location like %TEMP% or %APPDATA%. 2. CMSTP.exe is executed with a command line referencing that INF file (Windows Event ID 4688). 3. The same INF file is deleted (Windows Event ID 23). This create-execute-delete sequence is a strong behavioral indicator of malicious use."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```