[
  {
    "Has the adversary collected sensitive data from information repositories? (TA0009 - Collection)": {
      "Indicators": {
        "T1213 - Data from Information Repositories": {
          "Successful authentication events for privileged accounts accessing systems hosting information repositories (e.g., database servers, collaboration servers) outside of normal administrative duties.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4672; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify all successful login events (Event ID 4624) and privilege assignments (Event ID 4672) on servers hosting information repositories (databases, collaboration platforms). Filter for privileged accounts (Domain Admins, Enterprise Admins, etc.). Analyze the frequency and timing of these privileged access events. Use descriptive statistics and correlation analysis to identify privileged logins that occur outside typical administrative maintenance windows or correlate with suspicious network activity identified in Zeek logs."
          },
          "Network traffic patterns indicative of large data transfers originating from information repository systems or user endpoints accessing repositories, especially towards external destinations.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections originating from known information repository systems or user endpoints accessing repositories. Calculate the total bytes transferred per session or host. Use statistical methods (e.g., IQR, percentiles, or time series analysis) to identify sessions/hosts with unusually large data transfers compared to baseline or typical activity, especially connections to external IP addresses."
          },
          "Unusual volume or rate of document/page access or retrieval by a single user account from an information repository.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for GET requests or large responses from identified information repository domains/IPs. Monitor Zeek conn.log for data transfer volumes associated with user-initiated connections to repositories. If applicable, monitor Windows Event ID 4663 on file share repositories. Aggregate activity by source user/IP. Use statistical methods (e.g., mean/median data volume or request rate, percentile analysis) to identify users exhibiting significantly higher access volumes or rates than their peers or their own historical baseline. Flag users exceeding thresholds for investigation."
          },
          "Outbound network connections or data transfers from information repository systems or user endpoints to external cloud storage or file-sharing services.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Windows Event ID 5156",
            "Data Platform": "Network devices; Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, dns.log, and http.log for connections originating from information repository servers or endpoints to known domains/IPs associated with external cloud storage (e.g., Dropbox, Google Drive, OneDrive, Mega) or file-sharing services. Monitor Windows Event ID 5156 on endpoints/servers for outbound connections to these services. Filter for connections with large data transfer volumes. Use frequency analysis and correlation analysis to identify repeated transfers or transfers occurring outside normal patterns, especially if associated with users exhibiting high repository access volumes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]