```json
[
  {
    "Is the adversary collecting sensitive data from code repositories? (TA0009 - Collection)": {
      "Indicators": {
        "T1213.003 - Code Repositories": {
          "Connection to or cloning from a code repository URL known to be malicious or associated with data exfiltration tools.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate destination IP addresses, HTTP host headers (from Zeek http.log), and DNS queries (from Zeek dns.log) against a continuously updated cyber threat intelligence (CTI) feed of known malicious repository URLs, domains, or IPs used by threat actors for code exfiltration. Alert on any matches and investigate the source endpoint for compromise."
          },
          "Execution of `git` commands with specific argument patterns indicative of mass data collection, such as cloning an entire repository (`git clone`), fetching all branches (`--all`), or using mirroring (`--mirror`).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where `New Process Name` contains `git.exe` or other Git client executables. Analyze the `CommandLine` field using regular expressions to find known mass-collection patterns like `git clone`, `git fetch --all`, `git pull --all`, or `git clone --mirror`. Flag these specific command patterns, especially when executed by service accounts, non-interactive processes, or on systems not baselined as developer workstations."
          },
          "Anomalous data transfer volume from a code repository, such as a single user or system downloading an entire repository or multiple repositories in a short time frame, deviating from baseline activity.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal data transfer volume (e.g., total bytes transferred) and connection frequency for each user/host that interacts with code repositories using historical Zeek conn.log and http.log data. Use statistical methods (e.g., Inter-Quartile Range (IQR) and box-plots) to detect significant outliers in data volume per session or over a time window. A sudden, large download from a user who typically performs small commits/pulls is highly suspicious. Use time series analysis to detect sudden spikes in repository traffic originating from a single source."
          },
          "Access to an unusually high number of distinct code repositories or sensitive projects by a single user account, especially a privileged or service account, inconsistent with their role or historical behavior.": {
            "Data": "Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze network logs (e.g., URLs and host headers in Zeek http.log) to track which repositories are accessed by each user. Calculate the number of distinct repositories accessed per user per day/week. Establish a baseline for each user or user group (e.g., developers vs. administrators) and use descriptive statistics and percentile analysis to identify users accessing an anomalously high number of repositories. Correlate user access with account privilege level (e.g., via Windows Event ID 4624 logon types or AD group membership) and flag any repository access by highly privileged accounts, as this is often non-standard behavior."
          },
          "Git client activity originating from non-developer workstations or servers, especially when correlated with subsequent data staging or compression activity on the same host.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline hosts that normally exhibit Git client activity (e.g., `git.exe` execution captured in Windows Event ID 4688) by department or role. Flag any Git execution on hosts outside this baseline (e.g., domain controllers, finance department workstations, or servers not designated for CI/CD). Use correlation analysis to link Git process creation events with subsequent process creation events on the same host for common compression utilities (e.g., `7z.exe`, `rar.exe`, `tar.exe`, `zip.exe`) within a short time window (e.g., 5-15 minutes). Investigate this sequence as potential collection and staging."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```