```json
[
  {
    "Is the adversary bypassing defenses using trusted utilities like Regsvcs/Regasm? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.009 - Regsvcs-Regasm": {
          "Registration of a .NET assembly (DLL/EXE) or COM component by Regsvcs/Regasm where the assembly hash matches a known malicious indicator.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "From process creation events (Windows Event ID 4688) for Regsvcs.exe or Regasm.exe, extract the full file path of the .NET assembly specified in the command line. Correlate the file's hash (if available from an EDR or other endpoint tool) or the file name against a threat intelligence database of known malicious file indicators. Alert on any match and isolate the host for forensic analysis."
          },
          "Execution of Regsvcs/Regasm with command-line argument patterns highly indicative of malicious use, such as registering components from non-standard, user-writable directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for Regsvcs.exe and Regasm.exe processes. Use regular expressions to analyze command-line arguments for known malicious patterns, such as the registration of files from suspicious locations like 'C:\\Users\\Public\\', '%APPDATA%', or '%TEMP%'. Maintain and update a list of suspicious argument patterns and file paths, and alert on any matches."
          },
          "Execution of Regsvcs/Regasm from an anomalous parent process (e.g., an Office application, web browser, or script interpreter) or from an atypical file path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For every Regsvcs/Regasm execution (Windows Event ID 4688), analyze its parent process name and its own file path. Establish a baseline of legitimate parent processes (e.g., msiexec.exe, devenv.exe, Visual Studio installers) and execution directories (e.g., C:\\Windows\\Microsoft.NET\\...). Use descriptive statistics and frequency analysis to flag executions with rare or unexpected parent processes (like winword.exe, powershell.exe, wscript.exe) or those running from non-standard locations. Use box-plots on the frequency of parent-child relationships to identify statistical outliers."
          },
          "Network connections to external or statistically unusual destinations made immediately following the execution of Regsvcs/Regasm, indicating potential C2 communication or payload retrieval.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the timestamp of Regsvcs/Regasm execution (Windows Event ID 4688) on a host with network connection logs (Zeek conn.log) from that same host's IP address. Investigate any external connections occurring within a short time window (e.g., 0-5 minutes) after execution. Use time series analysis to detect anomalous spikes in traffic following execution. Prioritize connections to non-standard ports, low-reputation IPs, or geolocations inconsistent with normal business activity. Calculate the entropy of destination ports for post-execution traffic to find unusual port usage."
          },
          "A behavioral sequence involving a file being written to a temporary location, followed by its registration via Regsvcs/Regasm, and subsequent suspicious network activity or child process creation.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlated detection rule that triggers on the following sequence: 1. A file with a .dll or .exe extension is written to a temporary or user-writable directory like '%TEMP%' or '%APPDATA%' (monitored via Windows Event ID 4663 with file auditing enabled). 2. That same file is then used as a command-line argument by Regsvcs.exe or Regasm.exe (Windows Event ID 4688). 3. The host initiates external network connections (Zeek conn.log) or spawns suspicious child processes (e.g., powershell.exe, cmd.exe) shortly thereafter. Use correlation analysis across these data sources, linking events by hostname, timestamp, and file path to detect the full attack chain."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```