
[
  {
    "Is the adversary attempting to evade defenses using Control Panel items? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.002 - Control Panel": {
          "Execution of a Control Panel item (.cpl) where the CPL file itself or the network destination of subsequent traffic matches known threat intelligence.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions involving `.cpl` files. If possible, hash the CPL file referenced in the command line and compare it against a threat intelligence feed of known malicious file hashes. Concurrently, correlate the process execution with subsequent network connections (Zeek conn.log) from the host. Inner join destination IPs/domains from this traffic against a CTI feed of known malicious C2 servers. Alert on any match from either the file hash or network indicators."
          },
          "Execution of `control.exe` or `rundll32.exe` with a command line invoking a .cpl file located in a non-standard directory such as user profiles, temp folders, or network shares.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations of 'control.exe' or 'rundll32.exe' with command lines containing '.cpl'. Maintain and use an allowlist of legitimate CPL file paths (primarily in %SystemRoot%\\System32\\). Alert on any execution of a CPL file from a path not on the allowlist, paying close attention to user directories (e.g., C:\\Users\\), temporary folders (e.g., C:\\Windows\\Temp\\), program data folders, and network share paths (\\\\*\\*). Use regular expression matching on the command line to identify and flag these non-standard paths."
          },
          "The `control.exe` process is spawned by an unusual parent process, such as an Office application (winword.exe, excel.exe), web browser, or script interpreter (powershell.exe, wscript.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 process creation events for `control.exe`. Establish a baseline of normal parent processes for `control.exe` (e.g., explorer.exe, services.exe). Alert on executions of `control.exe` where the parent process is not on the baseline allowlist, particularly if the parent is an Office application, browser, script interpreter, or another process running from a temporary location. Use frequency analysis on parent-child process relationships to identify rare and suspicious chains."
          },
          "A process writes a new .cpl file to disk in a non-standard location, which is then immediately or shortly after executed.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for processes (e.g., powershell.exe, curl.exe, certutil.exe) creating files with a '.cpl' extension by analyzing command line arguments in Windows Event ID 4688. Correlate this file creation activity with a subsequent process creation event for `control.exe` or `rundll32.exe` executing that same CPL file path on the same host. Use correlation analysis based on host, file path, and a short time window (e.g., under 1 minute) between write and execution. Alert on this sequence, especially if the file is created in a temporary or user-writable directory."
          },
          "Execution of a Control Panel item followed by the parent or child process initiating suspicious network communications.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate `control.exe` or `rundll32.exe` CPL executions (Windows Event ID 4688) with subsequent network connections (Zeek conn.log) initiated by that process or its children within a short time window (e.g., 5 minutes). Analyze the network traffic for behavioral indicators such as connections to non-standard ports, unusual geographic destinations, long-lived connections, periodic beaconing, or high-volume data transfers inconsistent with normal user activity. Use time series analysis to detect beaconing patterns and linear regression to spot anomalous data transfer volumes."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
