[
  {
    "Is the adversary evading defenses using trusted Windows executables? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.010 - Regsvr32": {
          "Execution of regsvr32.exe with unusual command-line arguments referencing local .dll, .sct, or other scriptlet files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creations of the 'regsvr32.exe' process. Analyze command-line arguments. Identify instances using flags like /i or /s with unusual local file paths or file types (e.g., .sct, .dll from suspicious locations). Compare argument patterns to a baseline of normal regsvr32 usage using descriptive statistics on argument structures and file paths."
          },
          "Execution of regsvr32.exe with command-line arguments containing URLs.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creations of the 'regsvr32.exe' process. Analyze command-line arguments for patterns matching a URL (e.g., containing 'http://', 'https://', '.sct'). For identified URLs, check Zeek conn.log for corresponding outbound connections from the affected host. Analyze connection frequency and destination reputation using correlation analysis between process events and network logs."
          },
          "Creation of suspicious processes or network connections originating from the regsvr32.exe process.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for child processes of 'regsvr32.exe'. Filter for child processes with suspicious names or command lines. Correlate 'regsvr32.exe' execution (Event ID 4688) with subsequent network connection attempts from that process (Windows Event ID 5156, Zeek conn.log). Use correlation analysis to link regsvr32 execution times with anomalous outbound network activity."
          },
          "Modification of COM-related registry keys following regsvr32.exe execution with registration arguments.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'regsvr32.exe' executed with registration flags (e.g., /i or /s without /n). Correlate these events with Windows Event ID 4657 showing modifications to registry keys associated with COM object registration (e.g., under *Classes*\\CLSID). Use time series analysis to identify regsvr32 execution immediately preceding unusual or new registry modifications in these keys."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]