[
  {
    "Is the adversary using trusted utilities like mshta.exe for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.005 - Mshta": {
          "Execution of mshta.exe with suspicious or obfuscated command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for mshta.exe process creations. Extract the command-line arguments. Use string analysis (e.g., entropy measure on argument strings) or pattern matching to identify obfuscated or suspicious script content (e.g., vbscript:Execute, GetObject, script:http/https). Compare current arguments to historical baseline of mshta.exe usage."
          },
          "Execution of mshta.exe loading external content (URLs) or HTA files, particularly in environments where HTA usage is uncommon.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for mshta.exe process creations. Extract command-line arguments. Look for executions referencing .hta files or external URLs (http/https). Analyze frequency of mshta.exe executions across the environment. Use time series analysis or frequency distribution to identify unusual spikes or occurrences, especially if HTA usage is low in the environment. Analyze Zeek http.log for connections initiated by mshta.exe."
          },
          "Execution of mshta.exe originating from suspicious parent processes (e.g., office applications, temporary directories, email clients).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for mshta.exe process creations. Extract the parent process name and path. Identify mshta.exe executions where the parent process is unusual (e.g., spawned directly from winword.exe, excel.exe, outlook.exe, wscript.exe, cscript.exe, processes running from temporary user directories) compared to a baseline of normal parent processes (e.g., explorer.exe, cmd.exe, powershell.exe). Use frequency analysis to flag rare parent processes."
          },
          "Network connections made by mshta.exe or its child processes, especially to external or unusual destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate mshta.exe process creation events (Windows Event ID 4688) with subsequent network connection events (Windows Event ID 5156 on the same host by Process ID) or Zeek conn.log entries where the source IP/port matches the host where mshta.exe ran. Analyze destination IPs/ports. Flag connections to known malicious IPs (using Threat Intelligence), unusual ports, or destinations outside of normal business communications. Use descriptive statistics on destination ports and IP ranges to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]