[
  {
    "Is the adversary collecting sensitive data using CRM software? (TA0009 - Collection)": {
      "Indicators": {
        "T1213.004 - Customer Relationship Management Software": {
          "Unusual user access patterns to CRM software, such as access by dormant accounts or access from unexpected locations/devices for a given user.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624/4625 for login attempts to systems hosting CRM or CRM interfaces. Analyze Zeek conn.log for connections to CRM servers. Identify dormant or infrequently used accounts accessing CRM. Use correlation analysis to link logins to source IPs and compare against known user behavior patterns. Flag access from rare source IPs or devices based on frequency analysis."
          },
          "Large volume data downloads or exports initiated from CRM software by single users or accounts.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for large file download indicators or excessive data transfer volume associated with CRM endpoints/URLs. Analyze Zeek conn.log for unusually large outbound connections from CRM servers or systems known to interact with CRM. Use statistical analysis (e.g., IQR, percentile analysis) on transfer sizes/volumes per user/endpoint to identify outliers."
          },
          "Access or manipulation of sensitive CRM backend database files or processes by unexpected accounts or from unusual processes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for read/write attempts on sensitive CRM database files (if applicable, requires specific audit policy). Monitor Windows Event ID 4688 for execution of database client tools or export utilities on CRM servers/endpoints. Correlate these host events with Windows Event ID 5156 (network connections initiated by the suspicious process) and Zeek conn.log entries showing connections to CRM backend databases from the relevant servers/endpoints. Identify access by accounts or processes that are not typically involved in CRM administration or data handling. Use frequency analysis to baseline normal process execution and file access patterns."
          },
          "Unusual patterns of API calls or web requests to CRM endpoints indicative of programmatic or bulk data access.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests made to CRM web/API endpoints. Look for specific URL patterns associated with data export, bulk query, or sensitive record retrieval. Analyze request frequency, volume (bytes transferred), and HTTP methods (e.g., excessive GET requests, POSTs to export URLs) per source IP/user. Use correlation analysis to link suspicious requests to source IPs and user agents. Apply time series analysis to detect sudden increases in API call volume or changes in access patterns over time. Identify requests from unusual user agents (e.g., scripting libraries, bots) using frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]