[
  {
    "Is the adversary attempting to evade defenses using msiexec.exe? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1218.007 - Msiexec": {
          "Execution of msiexec.exe with command-line arguments targeting unusual network resources (.msi or .dll) or suspicious remote locations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs across endpoints and servers. Filter for msiexec.exe process creations. Analyze command line arguments for indicators such as /qn (quiet install), /i <network_path_to_msi>, /a <network_path_to_msi>, /z <network_path_to_dll>, or remote URLs. Identify network connections made by msiexec (correlate with Zeek conn.log). Use correlation analysis to link msiexec execution to suspicious parent processes and analyze arguments for network paths."
          },
          "Unusual frequency or context of msiexec.exe execution, deviating from established baselines.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs for msiexec.exe. Establish a baseline frequency of msiexec.exe execution per host and user using descriptive statistics (e.g., daily count, time of day). Identify deviations from the baseline using IQR or time series analysis. Investigate executions originating from unusual parent processes or occurring in unexpected user sessions. Analyze process parent-child relationships."
          },
          "Execution of msiexec.exe with command-line arguments or parameters that are unusual for the host or user, or contain obfuscated/suspicious strings.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs for msiexec.exe execution. Analyze the 'CommandLine' field. Establish a baseline of common msiexec.exe command lines per host and user using frequency analysis and descriptive statistics. Flag command lines that deviate significantly from the baseline, contain suspicious patterns (e.g., base64 encoded strings, unusually long strings), or use rarely seen parameters like `/q /i http://` or `/z`. Use correlation analysis to link suspicious arguments to the parent process."
          },
          "Execution of msiexec.exe immediately following suspicious user activity or resulting in unexpected outbound network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs for msiexec.exe. Analyze the 'ParentProcessName' and 'ParentCommandLine' fields to identify suspicious parent processes (e.g., office applications, web browsers, script interpreters). Use time series analysis to identify msiexec execution occurring shortly after other potentially malicious events logged on the endpoint. Correlate msiexec process creation (Event ID 4688) with subsequent outbound network connections from that process (Zeek conn.log) using correlation analysis based on process ID and timestamp. Investigate connections to unusual destinations or known C2 servers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]