[
    {
        "information_requirement": "Is the adversary collecting sensitive information from Confluence repositories?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1213.001",
                "name": "Confluence",
                "evidence": [
                    {
                        "description": "Confluence access from IP addresses known to be malicious or involving user accounts previously flagged as compromised.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Confluence Access Logs",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate source IP addresses from Confluence access logs and Zeek conn.log traffic to the Confluence server against a high-confidence threat intelligence feed of malicious IPs. Separately, cross-reference user accounts from Confluence logs and associated Windows Event ID 4624 logins against an internal, maintained list of accounts known or suspected to be compromised. Alert on any matches for immediate investigation."
                    },
                    {
                        "description": "Execution of an unusually high number of searches in Confluence, especially for sensitive keywords like 'password', 'secret', 'key', 'config', or 'api_key'.",
                        "data_sources": [
                            "Confluence Access Logs",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Parse Confluence access logs or Zeek http.log URI fields for search queries. Maintain a list of sensitive keywords. Establish a baseline for search frequency per user. Use descriptive statistics to flag users performing an anomalous number of searches (e.g., > 3 standard deviations above their mean or the organizational mean). Prioritize alerts where searches contain sensitive keywords. Use correlation analysis to link high-frequency searching with data download events."
                    },
                    {
                        "description": "Use of automated scripts or non-standard clients to access Confluence, identified by anomalous User-Agent strings or rapid, programmatic API interaction patterns.",
                        "data_sources": [
                            "Zeek http.log",
                            "Confluence Access Logs"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze User-Agent strings from Zeek http.log for all connections to the Confluence server. Create a baseline of common, legitimate User-Agents (e.g., major browsers). Alert on connections using uncommon User-Agents, especially those associated with scripting languages or command-line tools (e.g., 'Python-requests', 'curl', 'Wget', 'PowerShell'). Analyze API call sequences for non-human patterns like fixed time delays between requests, indicating automation."
                    },
                    {
                        "description": "A single user account accessing an anomalously large number of unique Confluence pages or downloading a volume of data significantly exceeding their established baseline.",
                        "data_sources": [
                            "Confluence Access Logs",
                            "Zeek http.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each user, create a baseline profile of Confluence activity, including the average number of unique pages accessed and data volume downloaded per session or day. Use time series analysis to monitor these metrics. Alert when a user's activity significantly deviates from their own historical baseline (e.g., using Z-score or Inter-Quartile Range (IQR) on page count/data volume). Box-plots of daily user activity can visually identify outlier behavior across the organization."
                    },
                    {
                        "description": "Access to Confluence by a highly privileged account (e.g., domain admin) or an account with no established history of accessing the platform.",
                        "data_sources": [
                            "Confluence Access Logs",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Cross-reference all user accounts in Confluence access logs against a list of highly privileged accounts that should not typically be used for accessing such resources. Separately, track the history of Confluence access for all users; alert when an account accesses Confluence for the first time, or for the first time in an extended period (e.g., >180 days). Prioritize alerts involving privileged accounts."
                    },
                    {
                        "description": "A user account accessing a high number of Confluence pages or spaces that are historically infrequently visited by the general user population.",
                        "data_sources": [
                            "Confluence Access Logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of page/space access frequency across the entire organization using historical Confluence access logs. Identify pages and spaces in the long tail of the access distribution (e.g., pages accessed by <1% of users or fewer than N times per quarter). Monitor for individual users who access an unusually high number of these 'cold' pages within a short timeframe, which may indicate indiscriminate collection rather than targeted work. Use frequency and percentile analysis to define and identify this behavior."
                    },
                    {
                        "description": "A user account performing suspicious Confluence collection activity followed shortly by network logons to other internal systems, suggesting use of discovered credentials for lateral movement.",
                        "data_sources": [
                            "Confluence Access Logs",
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify user accounts flagged by other Confluence collection detectors (e.g., rapid access, sensitive searches). Correlate these user accounts and timestamps with subsequent successful network logons (Windows Event ID 4624, Logon Type 3) or RDP sessions (Zeek conn.log on port 3389) on other internal systems within a defined time window (e.g., 1 hour). Use correlation analysis to investigate logon activity that is anomalous for that user (e.g., accessing a server for the first time) immediately following suspicious collection behavior."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
