[
  {
    "Is the adversary evading defenses using compiled HTML files? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1218.001 - Compiled HTML File": {
          "Execution of hh.exe with unusual arguments or as a parent process to suspicious child processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where New Process Name is hh.exe. Analyze Command Line arguments for obfuscated strings, base64 encoding, or execution of suspicious commands. Identify child processes spawned by hh.exe and analyze their process names and command lines for known malicious patterns or deviations from expected behavior (e.g., using correlation analysis between hh.exe execution and subsequent suspicious child processes)."
          },
          "Presence or execution of CHM files originating from untrusted sources or in unusual locations on endpoints.": {
            "Data": "Windows Event ID 4663; Zeek fileinfo.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) targeting .chm files, focusing on file creations or executions in user directories, temp folders, or network shares not typically used for legitimate help files. Correlate with Zeek fileinfo.log to identify CHM files transferred over the network. Use descriptive statistics to profile normal CHM file locations and origins within the environment and flag outliers."
          },
          "Outbound network connections initiated by processes spawned by hh.exe to unusual or known malicious destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created where Parent Process Name is hh.exe. Correlate these child processes with Windows Event ID 5156 (Network Connection) to identify network connections made by them. Cross-reference destination IPs/domains from Event ID 5156 and Zeek conn.log with threat intelligence feeds for known malicious infrastructure. Use frequency analysis on destination ports and IPs contacted by hh.exe child processes to identify rare or unusual patterns compared to baseline."
          },
          "Creation or modification of executable files or script files in unusual locations immediately following the execution of a CHM file.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for hh.exe execution. Correlate the timestamp of hh.exe execution with subsequent Windows Event ID 4663 events showing file creations or modifications, specifically targeting executable files (.exe, .dll, .scr) or script files (.vbs, .ps1, .js, .hta) in temporary directories (e.g., %TEMP%) or user profile directories within a short time window. Calculate the time difference between hh.exe execution and suspicious file events and look for short intervals. Use correlation analysis to identify common patterns of suspicious file creation/modification following hh.exe execution."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]