```json
[
  {
    "Is the adversary collecting sensitive data from Customer Relationship Management (CRM) software? (TA0009 - Collection)": {
      "Indicators": {
        "T1213.004 - Customer Relationship Management Software": {
          "Connection to CRM software or its backend database from a source IP address known to be associated with malicious C2 infrastructure, proxies, or anonymization services.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Zeek conn.log for connections to CRM application servers and backend database servers. Inner join the source IP addresses of these connections with a high-confidence, frequently updated Cyber Threat Intelligence (CTI) feed of known malicious IPs (e.g., C2 servers, TOR exit nodes, malicious proxies). Generate a high-priority alert for any matches."
          },
          "Use of non-standard User-Agents, such as those from scripting libraries or command-line utilities (e.g., curl, wget, python-requests), to access CRM web interfaces or APIs.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log to establish a baseline of common User-Agent strings used by legitimate browsers to access the CRM application. Create a watchlist of User-Agents associated with programmatic access (e.g., 'curl', 'Wget', 'Python-urllib', 'Go-http-client', 'PowerShell'). Alert when a request to a CRM URL is made using a User-Agent from this watchlist, particularly if targeting search, report, or export functionalities."
          },
          "Execution of database client or data export utilities on CRM servers with command-line arguments indicative of bulk data extraction.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On CRM database and application servers, monitor process creation events (Windows Event ID 4688) with full command-line logging enabled. Search for executions of known database utilities (e.g., `sqlcmd.exe`, `bcp.exe`, `mysqldump`, `pg_dump`). Scrutinize command lines for patterns indicating bulk export, such as `SELECT * FROM`, output redirection to a file (`> dump.sql`), or specific export flags. This pattern is highly suspicious if not part of a documented backup procedure."
          },
          "A user account accessing CRM software with anomalous session characteristics, such as from a new or rare geographic location, at an unusual time, or exhibiting impossible travel velocity.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Build dynamic user-level baselines for CRM access based on historical Windows Event ID 4624 (logons) and Zeek conn.log (network sessions). Profile typical login times, session durations, and source IP geolocations. Use statistical methods (e.g., Inter-Quartile Range or Z-scores) to detect outliers. Implement 'impossible travel' logic by correlating login timestamps and geolocations for each user, alerting on physically unfeasible sequential logins. Use frequency analysis to flag access from geolocations rarely or never seen for that user."
          },
          "An unusually large volume of data downloaded or exported from the CRM application by a single user account, far exceeding their historical baseline or peer group average.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the `resp_bytes` field in Zeek conn.log and http.log for connections to and from CRM servers. Establish a baseline for data transfer volume per user per day/week using descriptive statistics (mean, median, standard deviation). Flag any user session where the downloaded volume is an outlier (e.g., >3 standard deviations above the mean, or in the 99th percentile) compared to their own history and that of their peer group. Use time series analysis to spot sudden spikes in data transfer for specific users."
          },
          "An account, particularly a non-interactive service account, directly accessing the CRM backend database in a manner inconsistent with its normal application-driven behavior, such as running an unusually high number of queries or accessing an abnormally large number of distinct tables.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor object access auditing (Windows Event ID 4663) on CRM database files. Baseline normal access patterns by the legitimate CRM application service account. Monitor process creation (Windows Event ID 4688) by the service account. Alert on deviations, such as the service account spawning interactive shells (`cmd.exe`, `powershell.exe`) or database query tools, or if the rate or diversity of table access (monitored via Event ID 4663 or native DB logs) significantly deviates from the established baseline. Use entropy measures on accessed table names per time window to detect unusually broad discovery and collection activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```