[
    {
        "information_requirement": "Is the adversary establishing command and control using remote desktop software?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1219.002",
                "name": "Remote Desktop Software",
                "evidence": [
                    {
                        "description": "Outbound network connections from internal hosts to IP addresses or domains known to be associated with remote desktop services or malicious C2 infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join Zeek dns.log queries and Zeek conn.log destination IPs against multiple, continuously updated threat intelligence feeds. Maintain separate lists for: 1) Legitimate but potentially unauthorized remote desktop services (e.g., TeamViewer, AnyDesk) to detect policy violations, and 2) Known malicious C2 IPs/domains that masquerade as or abuse these services. Alert on any matches and investigate the source host."
                    },
                    {
                        "description": "Execution of known remote desktop software processes, especially from non-standard file paths or with unusual parent processes.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (with command line logging enabled) for process names of common remote desktop tools (e.g., anydesk.exe, teamviewer.exe, tv_w32.exe, vncserver.exe, screenconnect.exe). Correlate process name with its file path; flag executions from non-standard directories like %TEMP%, %APPDATA%, or user download folders. Analyze the parent process; execution by `powershell.exe`, `wscript.exe`, or an Office application is highly suspicious compared to a standard `explorer.exe` parent."
                    },
                    {
                        "description": "Execution of remote desktop software using command-line arguments indicative of silent installation or unattended access configuration.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Using Windows Event ID 4688 logs with command line logging, scan process command lines for arguments commonly used for silent installation or setting up unattended access. Use regular expression matching to search for flags like `--silent`, `/S`, `--install`, `--set-password`, `--get-id`, or `--start-service`. Maintain a library of such patterns for various remote desktop tools and alert on any matches."
                    },
                    {
                        "description": "A sequence of events indicating the download, installation, and execution of remote desktop software on a host for the first time.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek files.log",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Hunt for a behavioral sequence within a short time window (e.g., 15 minutes) on a single host: 1) A file download from a known remote desktop software vendor URL or a low-reputation domain (Zeek http.log, files.log). 2) Followed by the execution of a new process matching the software's name (Windows Event ID 4688). 3) Followed by an outbound network connection to the service's known infrastructure (Zeek conn.log). Use correlation analysis to link these events by source host IP and timestamp. Identify hosts performing this sequence for the first time."
                    },
                    {
                        "description": "Anomalous data transfer patterns during an active remote desktop session, such as unusually large volumes of outbound data or connections to multiple distinct external destinations.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "First, identify active remote desktop sessions by finding long-lived connections in Zeek conn.log to known remote desktop service ports/IPs. During the timeframe of these active sessions, monitor all other network connections from the same internal source IP. Establish a baseline for normal data transfer volume (`bytes_orig`) for remote sessions. Use statistical methods like IQR or Z-scores to detect sessions with outlier data transfer volumes, which may indicate data exfiltration. Also, flag sessions where the source host makes concurrent connections to multiple, unusual external destinations."
                    },
                    {
                        "description": "A user account establishing a remote desktop connection from a host they do not typically use, or at a time that deviates significantly from their established work patterns.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create and maintain a baseline of normal user-host relationships by analyzing historical login data (Windows Event ID 4624, specifically Logon Type 10 for remote interactive). When a remote desktop process is launched (Windows Event ID 4688) and a connection is made (Zeek conn.log), check if the user is on a host they rarely or have never used before. Also, use time series analysis or percentile analysis on login times (Event ID 4624) per user to identify remote sessions occurring at anomalous hours or on weekends, which deviate from their established work schedule."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
