[
    {
        "information_requirement": "Is the adversary using legitimate remote access software for command and control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1219",
                "name": "Remote Access Software",
                "evidence": [
                    {
                        "description": "Network connections to known malicious domains or IP addresses associated with Remote Access Software C2 infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join network logs (Zeek conn.log destination IPs, Zeek dns.log queried domains, Zeek ssl.log Server Name Indication values) against a high-confidence, continuously updated threat intelligence feed of IPs and domains known to be used for malicious Remote Access Software C2. Alert on any matches and investigate the source host for compromise."
                    },
                    {
                        "description": "Installation or configuration of remote access software using patterns indicative of malicious deployment, such as specific command-line arguments, service creation, or registry modifications for persistence.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4697",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for common remote access software (e.g., teamviewer.exe, anydesk.exe) and scan the command line for arguments enabling silent or unattended access (e.g., '--silent', '--unattended', '--password'). Correlate with service creation events (Windows Event ID 4697) or registry modifications (Windows Event ID 4657) that establish persistence for this software, especially if not associated with an authorized change. Maintain and query against a pattern library of known malicious installation commands."
                    },
                    {
                        "description": "Execution of remote access software from non-standard file paths, under a masqueraded process name, or by an unusual parent process.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze process creation events (Windows Event ID 4688). Establish a baseline of legitimate paths (e.g., C:\\Program Files\\) and parent processes for approved remote access tools. Flag executions from user-writable or temporary directories (e.g., %APPDATA%, %TEMP%, C:\\Users\\...\\Downloads). Use correlation analysis to identify processes with names masquerading as legitimate system binaries (e.g., `svchost.exe`) but which are associated with remote access software network traffic or have an unusual parent process such as `winword.exe` or `powershell.exe`."
                    },
                    {
                        "description": "Anomalous outbound network traffic patterns associated with remote access software, such as connections at unusual hours, regular beaconing intervals, or abnormally high data transfer volumes.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Zeek conn.log for outbound connections to domains/IPs of common remote access services (e.g., TeamViewer, AnyDesk) or on their known ports. Establish a baseline of normal usage patterns (e.g., helpdesk activity during business hours). Use time series analysis to detect connections at unusual times (e.g., 2 AM on a weekend) or with periodic, fixed-interval timing indicative of C2 beaconing. Use descriptive statistics (mean, standard deviation, IQR) on session duration and data volumes (`orig_bytes`, `resp_bytes`) to identify significant outliers that may indicate data exfiltration rather than interactive use."
                    },
                    {
                        "description": "A sequence of events where remote access software is installed or executed immediately following initial access or execution activities, such as a user opening a malicious document or execution of a PowerShell download cradle.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate host-based events on a single system within a short time window (e.g., 5-10 minutes). Define and hunt for a sequence of process creation events (Windows Event ID 4688) such as: 1) An Office application (e.g., `winword.exe`) spawns a script interpreter (e.g., `powershell.exe`, `cmd.exe`, `wscript.exe`). 2) The script interpreter subsequently spawns a known remote access software process (e.g., `anydesk.exe`). Flagging this specific behavioral sequence provides high-confidence detection of malicious RAT deployment."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
