```json
[
  {
    "Has the adversary collected sensitive data from information repositories? (TA0009 - Collection)": {
      "Indicators": {
        "T1213 - Data from Information Repositories": {
          "Access to an information repository immediately followed by network connections from the same host to IP addresses or domains known to be malicious.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate repository access events (e.g., Windows Event ID 4663 for file shares, application logs for DBs/wikis, or login events like 4624 on the repository server) by user/host with all subsequent outbound network connections (from Zeek conn.log) within a short time window (e.g., 5-15 minutes). Inner join the destination IP addresses from these outbound connections with a high-confidence, continuously updated threat intelligence feed of malicious C2 servers or drop zones. Alert on any matches."
          },
          "Execution of common database dump utilities or suspicious command-line tools on database servers or user endpoints, especially when initiated by non-standard user accounts or processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) on database servers and user endpoints. Maintain a list of suspicious process names and command-line patterns related to data collection, such as `sqlcmd.exe`, `bcp.exe`, `mysqldump`, `pg_dump`, `rclone.exe`, or scripts using `SELECT * FROM` on multiple tables. Use regular expressions to detect these patterns. Flag executions by non-administrator accounts, executions from unusual parent processes (e.g., a web server process), or executions that redirect output to a file in a staging directory (e.g., `> C:\\Temp\\dump.sql`). Use correlation analysis to link these process executions with preceding remote login events."
          },
          "A user account accessing an unusually high volume of files or records from an information repository, or accessing sensitive repositories outside of its normal job function or working hours.": {
            "Data": "Windows Event ID 4663; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each user/role, establish a baseline of repository access, including average number of files/records accessed, data volume, time of day, and types of repositories accessed. Monitor repository access logs (e.g., Windows Event ID 4663), application-specific logs, and network traffic (Zeek conn.log, http.log). Use statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect users accessing a number of distinct files or total data volume significantly exceeding their own or their peers' baseline. Use time series analysis to detect unusual spikes in access activity, and flag any access occurring significantly outside of established working hours."
          },
          "Large volume of data read from a sensitive information repository followed by data being written to a temporary or staging location on an endpoint or server.": {
            "Data": "Windows Event ID 4663; Windows Event ID 5145",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "On file servers and endpoints, monitor for high-volume file read events (Windows Event ID 4663) from sensitive information repositories (e.g., network shares with PII). Correlate these reads with subsequent high-volume file write events by the same user/process to common temporary or staging directories (e.g., C:\\Users\\Public, C:\\Temp, %APPDATA%). Use correlation analysis based on User, ProcessID, and timestamps to link the read and write activities within a defined session window (e.g., 30 minutes). Flag sequences where many small files are read and one large (potentially compressed) file is written."
          },
          "Anomalous data transfer patterns from a host that recently accessed a sensitive information repository, including transfers to unapproved external destinations, cloud storage, or using non-standard protocols.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify hosts with recent high-volume access to information repositories using host or application logs. Then, monitor outbound traffic from these specific hosts using Zeek logs. Apply time series analysis to the `orig_bytes` field in Zeek conn.log to detect unusual spikes in data egress. Use Zeek dns.log to identify connections to cloud storage or file-sharing domains not on an approved corporate list. Analyze the entropy of destination IPs or protocols for the host; a sudden shift could indicate exfiltration. Monitor Zeek files.log for transfers of large files, especially compressed archives (`.zip`, `.rar`, `.7z`), over common exfiltration protocols like HTTP, DNS, or SMTP."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```