
[
  {
    "Is the adversary using template injection for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1221 - Template Injection": {
          "A document downloads a template from a URL, domain, or IP address known to be malicious, or the document's file hash matches a known malicious file.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously cross-reference URLs, hostnames, and destination IPs from Zeek http.log and dns.log against a cyber threat intelligence (CTI) feed of known malicious indicators associated with malware delivery. Additionally, calculate hashes of document files transferred over the network (from Zeek files.log) and correlate them against a feed of known malicious file hashes. Alert on any confirmed matches."
          },
          "An office application spawns a child process with command-line arguments matching known patterns for downloading and executing remote payloads.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the parent process is an office application (e.g., winword.exe, excel.exe, powerpnt.exe). Scan the child process command line using regular expressions for known malicious patterns, such as 'IEX(New-Object Net.WebClient).DownloadString', 'mshta.exe http', 'rundll32.exe javascript:', or 'certutil -urlcache'. Maintain and update a library of these attack patterns for alerting."
          },
          "An RTF document is observed containing the '*\\template' control word that points to a remote URL, a known pattern for remote template injection.": {
            "Data": "Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inspect the content of RTF files transferred over the network (captured via Zeek files.log) or from endpoint file monitoring systems. Use regular expression matching to identify the presence of the `*\\template` control word immediately followed by `http` or a UNC path to an external resource. Alert on any such findings and analyze the referenced remote location for malicious indicators."
          },
          "An office application (e.g., Winword.exe, Excel.exe) spawns an unexpected child process, such as a command shell or scripting interpreter, which is abnormal user behavior.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for any instance where a common office application (winword.exe, excel.exe, powerpnt.exe, etc.) is the parent process of a command shell (cmd.exe, powershell.exe), scripting host (wscript.exe, cscript.exe), or living-off-the-land binary (mshta.exe, certutil.exe, rundll32.exe). Establish a baseline of normal process chains and use frequency analysis (e.g., identifying rare parent-child relationships using descriptive statistics or percentile rankings) to alert on anomalous events."
          },
          "An office application initiates an outbound SMB connection to an external or unusual internal destination, potentially for NTLM credential harvesting.": {
            "Data": "Zeek smb.log; Zeek ntlm.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smb.log for SMB connection attempts originating from client subnets and destined for external IP addresses, which should violate perimeter security policy. Correlate with Zeek ntlm.log for NTLM authentication attempts over these connections. Use descriptive statistics to identify workstations initiating an anomalously high number of external SMB connections or connections to internal servers not designated as file servers."
          },
          "A correlated sequence of events occurs on an endpoint: an office application makes an external network connection to a rare domain, immediately followed by the execution of a script interpreter or living-off-the-land binary.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use correlation analysis to link events on a single host within a short time window (e.g., < 60 seconds). The sequence to detect is: 1. An office application process is active. 2. A network connection (Zeek conn.log) from the host to an external IP is observed. 3. The destination domain (from Zeek http.log or DNS logs) is identified as rare using a percentile-based scoring model (e.g., in the bottom 5% of domains visited organization-wide). 4. A child process such as powershell.exe or cmd.exe is spawned by the office application (Windows Event ID 4688). Alerting on this full behavioral sequence provides high-fidelity detection of malicious activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
