[
  {
    "Is the adversary using template injection for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1221 - Template Injection": {
          "User document applications (e.g., Winword.exe, Excel.exe) initiating unexpected outbound network connections or spawning suspicious child processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for instances where document applications (Winword.exe, Excel.exe, etc.) are the parent process of suspicious child processes (e.g., cmd.exe, powershell.exe, rundll32.exe). Correlate Zeek conn.log to identify outbound network connections initiated by document applications. Analyze connection destinations for unusual patterns or known malicious infrastructure. Use correlation analysis to link process creation and network activity."
          },
          "Identification of modified \"*\\template\" control words in RTF files referencing external URLs.": {
            "Data": "Windows Event ID 4663; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file modifications targeting RTF files. Scan identified RTF files for the presence of \"*\\template\" control words followed by external URL indicators (e.g., 'http', 'https', '\\u-'). If identified, analyze associated Zeek http.log or conn.log for download activity from the referenced URL. Apply string pattern matching and correlation."
          },
          "Outbound HTTP/HTTPS requests from document applications downloading files or content from unusual or external URLs, especially those not typically accessed by the user.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and conn.log for outbound connections originating from systems running document applications (e.g., workstations). Filter for HTTP/HTTPS requests to external IP addresses or unusual domains, particularly those referencing file extensions or patterns associated with executable code or documents (.doc, .docx, .rtf, .exe, .dll). Use frequency analysis or rare event analysis (e.g., identifying URLs/domains below a certain percentile of occurrence) to detect domains not commonly accessed by users or systems."
          },
          "Outbound SMB or NTLM authentication attempts originating from document applications or user systems immediately after opening a document, targeting external destinations.": {
            "Data": "Zeek smb.log; Zeek ntlm.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smb.log and ntlm.log for outbound SMB/NTLM connection or authentication attempts originating from user workstations, specifically targeting external IP addresses. Correlate with Windows Event ID 4624 (Successful Logon Type 3 - Network) and 4625 (Failed Logon) on potential target systems if feasible, filtering by source IP. Investigate attempts where the destination is external or does not align with expected network traffic. Use time series analysis to identify spikes in outbound authentication attempts following documented user activity or document openings."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]