[
  {
    "Is the adversary modifying file or directory permissions to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1222 - File and Directory Permissions Modification": {
          "Detection of specific system commands (e.g., icacls, cacls, chmod, chown) being executed to modify file or directory permissions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing command lines with utilities like 'icacls', 'cacls', 'chmod', 'chown'. Filter for executions targeting sensitive directories or executables (e.g., C:\\Windows\\System32). Perform statistical analysis (e.g., frequency distribution) of command usage per user/host to identify rare or anomalous executions."
          },
          "Auditing events indicating changes to DACLs or ownership for sensitive system files or directories.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4672",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Audit Windows Event ID 4670 for changes to DACLs on sensitive system files (e.g., .exe, .dll, configuration files in critical system directories). Correlate these events with Event ID 4672 if ownership changes are suspected or required. Analyze event volume using time series analysis or descriptive statistics to detect spikes or changes from baseline permission activity."
          },
          "Access attempts (read, write, execute) on sensitive files or directories, particularly on network shares, immediately following permission modification events on those objects.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4663; Zeek smb_files.log; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4670 (DACL changed) with subsequent Event ID 4663 (object access) on the same file path. Additionally, correlate 4670 events on file paths corresponding to network shares with activity in Zeek smb_files.log (file access) or Zeek conn.log (network connection to share server) accessing those paths/servers shortly after the permission change. Filter on sensitive file paths/types. Use time delta analysis between events to identify suspicious patterns."
          },
          "Modification of file/directory permissions specifically targeting common system startup locations or critical binaries by non-standard processes.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Audit Windows Event ID 4670 specifically for permission changes on files/directories within common persistence locations (e.g., user/all users Startup folders, System32, Winlogon helper locations) or critical binary paths (e.g., EXEs, DLLs). Correlate these events with process creation logs (Event ID 4688) by process ID and timestamp to identify the process responsible for the change. Flag changes initiated by processes or users not typically associated with system configuration management. Use frequency analysis to baseline permission changes in these areas by process/user and identify rare events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]