[
  {
    "Is the adversary attempting to evade defenses by modifying file or directory permissions? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1222.002 - Linux and Mac File and Directory Permissions Modification": {
          "Execution of suspicious commands like chmod or chown with potentially malicious arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Filter for command lines containing 'chmod' or 'chown' (acknowledging these are Linux/Mac commands, adapting to Windows log context means looking for process creation events indicative of such activity or Windows equivalents like 'icacls'). Analyze frequency distribution of command arguments. Flag command lines with suspicious arguments like '+x', '-R 777', '755' (mapping Linux/Mac examples to the Windows log context, e.g., 'icacls /grant Everyone:F /T')."
          },
          "Auditable permission changes on sensitive files or directories.": {
            "Data": "Windows Event ID 4670",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs to audit permission changes (Windows Event ID 4670) on sensitive system binaries, configuration files, or user directories. Correlate permission changes with other security events (e.g., login events, process execution). Use time series analysis to detect sudden clusters of permission changes on multiple files or directories."
          },
          "Modification of file/directory ownership on critical system files or user profiles using Windows utilities (e.g., 'takeown.exe', 'icacls /setowner'), potentially correlated with recent anomalous network activity or process execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4670; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of 'takeown.exe' or 'icacls.exe' with '/setowner' or '/grant <user>:F' arguments targeting sensitive files/directories. Monitor Windows Event ID 4670 for changes in object ownership. Correlate these host-based events with preceding anomalous network connections identified in Zeek conn.log (e.g., from untrusted IPs, to known C2 servers, or unusual protocols/ports) or suspicious parent processes (Event ID 4688) within a defined time window (e.g., 5-10 minutes). Use correlation analysis to link ownership changes to specific network sessions or suspicious originating processes."
          },
          "Granting of broad permissions (e.g., Execute, Full Control to 'Everyone') on files in user-writable directories using Windows utilities (e.g., 'icacls'), indicative of staging malicious executables or tools.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4670 for permission changes on files within common user-writable paths (e.g., C:\\Users\\*\\AppData\\*, C:\\ProgramData\\*, C:\\Windows\\Temp\\*). Specifically look for 'icacls' commands (via Event ID 4688, e.g., 'icacls <file> /grant Everyone:F' or 'icacls <file> /grant Users:X') or direct permission changes (Event ID 4670) that grant Execute (X) or Full Control (F) permissions to broad groups like 'Everyone', 'Users', or 'Authenticated Users'. Establish a baseline of typical permission-setting activities in these directories and use anomaly detection (e.g., unusual frequency, targeting of specific file extensions like .exe, .dll, .ps1, .bat, or changes made by unexpected processes) to flag suspicious activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]