
[
  {
    "Is the adversary attempting to evade defenses by modifying file or directory permissions? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1222.002 - Linux and Mac File and Directory Permissions Modification": {
          "Execution of Windows permission modification commands (e.g., `icacls.exe`, `takeown.exe`, PowerShell `Set-Acl`) with specific arguments or targeting files/directories known to be used by particular malware families or exploit kits.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of exact command-line strings for `icacls.exe`, `takeown.exe`, or PowerShell `Set-Acl` known to be used by specific threat actors or malware (e.g., `icacls C:\\Windows\\System32\\config\\SAM /grant CustomUser:F`). Monitor Windows Event ID 4688 (Process Creation) for these exact command execution patterns. Regularly update this list from cyber threat intelligence (CTI) feeds and malware analysis reports. Alert on any direct match, indicating a high-confidence selector hit."
          },
          "Use of Windows utilities (`icacls.exe`, `takeown.exe`, `cacls.exe`) or PowerShell cmdlets (`Set-Acl`) to grant overly permissive access (e.g., Full Control to 'Everyone', 'Users', or 'Authenticated Users', or adding Execute permissions) to files, especially in user-writable locations or on sensitive system files.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4670",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line execution of `icacls.exe`, `takeown.exe`, `cacls.exe` or PowerShell processes invoking `Set-Acl`. Filter for arguments patterns such as `/grant Everyone:F`, `/grant Users:F`, `/grant *S-1-1-0:F` (Everyone SID), `/grant Everyone:X`, or PowerShell equivalents granting FullControl/Execute to broad groups. Correlate with Windows Event ID 4670 (Permissions on an object were changed) to confirm these permission changes. Focus on changes in common user-writable directories (e.g., %TEMP%, %APPDATA%, C:\\Users\\Public) or critical system directories. Use descriptive statistics to baseline normal permission-granting arguments and flag outliers or known high-risk patterns."
          },
          "Attempted modification of ownership of critical system files/directories or user profiles to a non-standard or unauthorized account using Windows utilities like `takeown.exe` or `icacls.exe /setowner`.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4670",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of `takeown.exe` (e.g., `takeown /f <filepath>`) or `icacls.exe` with the `/setowner <NewOwner>` argument, especially when targeting critical system files (e.g., in C:\\Windows\\System32, C:\\Program Files) or key configuration files. Correlate with Windows Event ID 4670 (Permissions on an object were changed, specifically looking for ownership changes) to confirm the change and identify the new owner. Maintain a list of accounts authorized to take ownership of critical files/directories and alert on deviations or ownership changes to suspicious, newly created, or known compromised accounts."
          },
          "An unusual cluster or rapid succession of permission or ownership changes (evidenced by Windows Event ID 4670) across multiple sensitive files or directories, especially if initiated by a non-standard process or user account.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Windows Event ID 4670 (Permissions on an object were changed) on critical system files, configuration directories, and user data folders. Analyze the frequency and temporal clustering of these events for individual hosts. Use time series analysis or sliding window counts (e.g., count of Event ID 4670 per minute) to detect abnormal spikes in permission/ownership changes (e.g., >N changes in M minutes). Correlate the process ID (from Event ID 4670's 'Process Name' field, or via parent process lookup from Event ID 4688 for tools like `icacls`) initiating these changes with a baseline of known administrative scripts/software. Flag widespread changes or those made by unexpected processes or user accounts. Apply entropy measures to the set of modified file paths or parent directories to detect indiscriminate permission alterations."
          },
          "File or directory permission/ownership modifications on Windows systems closely preceded or followed by other suspicious activities, such as anomalous network connections, execution of unsigned binaries, or other defense evasion techniques.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate permission/ownership change events (Windows Event ID 4670, or Event ID 4688 for tools like `icacls`, `takeown`) with other security alerts or telemetry within a defined time window (e.g., +/- 15 minutes). Specifically, link these changes to: 1. Anomalous network connections (Zeek conn.log) from/to the host (e.g., connections to known C2 servers, unusual ports, unexpected data transfer volumes). 2. Execution of newly dropped or unsigned executables (Windows Event ID 4688). 3. Other defense evasion techniques (e.g., service stop/modification, scheduled task creation, clearing of event logs). Use a correlation engine or SIEM logic to build composite alerts based on these sequences. Linear regression could be explored to model relationships between permission changes and subsequent suspicious activities."
          },
          "Permissions on a file or directory are modified to be significantly more restrictive, potentially locking out legitimate users or security tools, shortly after evidence of compromise or when initiated by an unauthorized process or unknown software.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4670 for permission changes that substantially reduce access for standard users/groups (e.g., explicitly denying Read/Execute to 'Users', 'SYSTEM', or 'Administrators' on commonly accessed files, or removing all inherited permissions). Correlate these restrictive changes with prior alerts indicating potential compromise on the host or if the change is initiated by an unexpected process (identified via Event ID 4688 for tools or by inspecting the SubjectUserName/ProcessName in Event ID 4670). Baseline typical restrictive permission changes made by legitimate installers or system processes and alert on deviations, especially on critical system files, security software directories, or user profile directories."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
