[
  {
    "Is the adversary modifying file or directory permissions to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1222.001 - Windows File and Directory Permissions Modification": {
          "Modification of DACLs or ownership on critical system files or directories.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4670 for permission changes on pre-defined critical system directories (e.g., %SystemRoot%, Program Files). Analyze Event ID 4663 for access attempts to these locations with suspicious outcomes. Establish a baseline of normal permission changes based on frequency over time and identify outliers or changes on high-value targets using descriptive statistics."
          },
          "Execution of permission modification commands (icacls, cacls, takeown, attrib) or PowerShell cmdlets from unusual processes or contexts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for execution of `icacls`, `cacls`, `takeown`, `attrib` or PowerShell using command-line arguments indicative of permission modification. Use correlation analysis to link these executions with parent processes, user accounts, and timing, flagging executions originating from non-standard processes or occurring outside typical administrative windows (e.g., using IQR for timing analysis)."
          },
          "Modification of permissions on files commonly targeted for persistence or hijacking (e.g., accessibility executables, logon scripts, DLLs).": {
            "Data": "Windows Event ID 4670",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4670 filtered for specific file paths associated with known persistence mechanisms (e.g., C:\\Windows\\System32\\sethc.exe, C:\\Windows\\System32\\Utilman.exe, common DLL hijacking paths, startup script locations). Create a watch list of critical file paths based on frequency of legitimate changes and alert on any permission modifications that deviate from baseline or occur on high-risk files."
          },
          "Network connections to or from a host immediately following a permission modification event on that host, particularly involving unusual ports or destinations.": {
            "Data": "Windows Event ID 4670; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4670 (permission modification) events with Zeek conn.log entries showing network connections to or from the affected host within a short time window (e.g., 60 seconds) surrounding the modification event. Filter for connections on unusual ports (ports with low historical frequency using descriptive statistics) or to suspicious external IP addresses (e.g., using threat intelligence feeds). Use time series analysis to identify clusters of permission modifications followed by network activity patterns that deviate from historical norms."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]