```json
[
  {
    "Is the adversary bypassing defenses using XSL Script Processing? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1220 - XSL Script Processing": {
          "Network connection from wmic.exe or msxsl.exe to a URL or IP address known to host malicious XSL scripts.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process execution logs (Windows Event ID 4688) for `wmic.exe` or `msxsl.exe` command lines containing URLs. Extract URLs and destination IPs from these command lines and from network logs (Zeek conn.log, http.log) associated with these processes. Inner join the observed URLs/IPs with a high-confidence, frequently updated threat intelligence feed of known malicious hosts. Alert on any matches and investigate the full process chain."
          },
          "Execution of wmic.exe using the '/FORMAT' switch to load an XSL file, particularly from a remote URL or an unusual local path.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `wmic.exe` process creations. Use regular expressions on the 'CommandLine' field to detect the pattern `/FORMAT:.+\\.xsl`. Scrutinize executions where the XSL file is loaded from a non-standard or user-writable path (e.g., C:\\Users\\, C:\\Windows\\Temp\\, AppData) or from a remote URL (`http://`, `https://`). For remote files, correlate the execution with Zeek conn.log or http.log data to verify the network fetch and analyze the source reputation."
          },
          "Execution of msxsl.exe to process an XML file with an external XSL stylesheet that is fetched from a remote source or resides in a suspicious local directory.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `msxsl.exe` process creations. Analyze command-line arguments to identify both the input XML file and the target XSL stylesheet. Flag all instances where the XSL stylesheet is retrieved from a remote URL. Increase suspicion for XSL files loaded from temporary or user-writable directories. Use frequency analysis on parent processes; execution by a scripting engine (e.g., `wscript.exe`, `cscript.exe`) or an Office application is highly suspicious compared to a developer tool."
          },
          "Anomalous process chain where a common user application or script interpreter initiates XSL processing via wmic.exe or msxsl.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process ancestry using Windows Event ID 4688 data (requires linking `New Process ID` with `Creator Process ID`). Establish a baseline of normal parent-child relationships for `wmic.exe` and `msxsl.exe`. Flag unusual chains, such as `WINWORD.EXE` -> `cscript.exe` -> `wmic.exe` with the `/FORMAT` switch. Use statistical methods like entropy measures or frequency analysis on parent process names for `wmic.exe`/`msxsl.exe` to identify rare and potentially malicious execution chains."
          },
          "Execution of XSL processing followed by anomalous network behavior, such as C2 communication or data staging.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate T1220 process execution events (from Windows Event ID 4688) with subsequent network activity from the same host within a short time window (e.g., 5 minutes), using Zeek conn.log. Profile the network connections for indicators of C2, such as regular beaconing, long-lived connections, or connections to unusual ports or low-reputation IPs. Use correlation analysis to link the initial XSL execution event to suspicious outbound traffic, which may indicate successful code execution and follow-on activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```