[
  {
    "Has the adversary modified trust relationships for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1484.002 - Trust Modification": {
          "Logs showing changes to domain trust objects or properties.": {
            "Data": "Windows Event ID 4703",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs indicating trust modifications (e.g., 4703). Identify the user account performing the change. Analyze the frequency and timing of trust modifications; use time series analysis or simple count anomalies to identify unusual activity spikes."
          },
          "Security logs indicating modification of federation settings on a domain (e.g., setting authentication to Federated).": {
            "Data": "Windows Event ID 307, Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 307 and 510 on AD FS servers and Domain Controllers for changes to federation settings. Correlate these events by Instance ID. Investigate any changes setting domain authentication from Managed to Federated or modifying existing federation configurations. Analyze user accounts initiating these changes for legitimacy using baselines."
          }
        }
      }
    }
  },
  {
    "Is the adversary modifying trust relationships for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1484.002 - Trust Modification": {
          "Audit logs showing the addition of a new federated identity provider to an identity tenant.": {
            "Data": "Windows Event ID 307, Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 307 and 510 (if applicable for ADFS configuration changes) or forwarded audit logs for the addition of new identity providers. Analyze the source and context of these events. Use correlation analysis to link these events with other suspicious activities."
          },
          "Detection of specific PowerShell commands used to modify federated domain properties, potentially enabling credential manipulation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) and PowerShell logs. Search for execution of commands like 'Update-MSOLFederatedDomain'. Analyze the command parameters, user account, and host from which the command was executed. Use frequency analysis to identify rare or unauthorized usage of these commands."
          }
        }
      }
    }
  }
]