[
  {
    "Is the adversary attempting to discover domain trust relationships? (TA0007 - Discovery)": {
      "Indicators": {
        "T1482 - Domain Trust Discovery": {
          "Execution of command-line utilities (e.g., nltest) with arguments related to enumerating domain trusts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs across endpoints and servers. Filter for process names like \"nltest.exe\", \"powershell.exe\", \"cmd.exe\" and analyze command-line arguments for strings like \"/domain_trusts\", \"Get-DomainTrust\". Use descriptive statistics to identify processes or command arguments with low frequency within the environment."
          },
          "Execution of scripting or compiled tools using .NET methods (e.g., GetAllTrustRelationships) associated with domain trust enumeration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for processes like \"powershell.exe\", \"pwsh.exe\", or suspicious compiled executables. Analyze command-line arguments or script blocks (if logging is enhanced) for strings related to .NET methods like \"GetAllTrustRelationships\". Correlate this activity with user accounts and execution times, using descriptive statistics to identify unusual patterns."
          },
          "Network traffic patterns indicative of domain trust enumeration queries (e.g., LDAP queries) between domain controllers or trust partners.": {
            "Data": "Zeek ldap.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ldap.log for queries originating from potential attacker hosts or unusual service accounts targeting domain controllers or other trust anchors. Look for specific LDAP query filters or requested attributes commonly used in domain trust enumeration (e.g., querying 'trustedDomain' objects, trust flags). Use frequency analysis to identify unusual volumes or patterns of such queries from specific sources."
          },
          "Execution of domain trust discovery commands or scripts by processes launched via remote administration tools or by processes with unusual parent/child relationships.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for processes executing domain trust discovery commands (e.g., 'nltest /domain_trusts', PowerShell scripts querying trusts). Examine the 'Parent Process Name' field to identify if these commands are launched by remote administration tools (e.g., psexec, powershell remoting) or other suspicious parent processes. Use descriptive statistics to baseline normal process execution patterns and identify deviations, or use correlation analysis to link remote access events with subsequent trust discovery commands."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]