
[
  {
    "Is the adversary attempting to evade defenses using mutual exclusion mechanisms? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1480.002 - Mutual Exclusion": {
          "A process attempts to create or access a mutex with a name known to be associated with a specific malware family or offensive security tool.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously scan command line arguments from process creation events (Windows Event ID 4688) for strings that match a maintained threat intelligence list of known malicious mutex names. Since mutex names may not always appear in command lines, this detection is significantly enhanced by advanced logging (e.g., Sysmon Event ID 17 Pipe Created, used by some malware for mutexes, or direct API monitoring). Alert on any direct matches from the CTI list and investigate the associated process and parent process."
          },
          "A process executes and terminates in an extremely short time frame (e.g., <2 seconds), consistent with the pattern of checking for an existing mutex and then exiting.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Calculate the execution duration for all processes by correlating the process creation event (Windows Event ID 4688) with the corresponding termination event (Windows Event ID 4689) using the Process ID. Use descriptive statistics (mean, median, standard deviation) to baseline normal execution times for common system processes. Flag processes, especially those running from temporary or user-writable locations (%TEMP%, %APPDATA%), with an execution duration in the lowest percentile (e.g., < 2 seconds) as potentially performing a mutex check and exit."
          },
          "A non-security-related process attempts to access a mutex known to belong to a deployed security product (e.g., AV, EDR), indicating a targeted defense evasion check.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an internal list of known mutex names used by deployed security tools on endpoints and servers. Scan process creation command lines (Windows Event ID 4688) for these names, particularly when invoked by processes not part of the security tool's legitimate binaries. Prioritize alerts for processes running from non-standard locations (e.g., user profiles, temp directories) that appear to be referencing security tool mutexes. Correlate findings with short-lived process detections."
          },
          "A process creates a file-based lock using a hidden or randomly named file in a common staging directory, which is immediately followed by suspicious outbound network activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for command lines indicating file creation (e.g., 'echo > file', 'type NUL > file') in common staging directories (%TEMP%, %APPDATA%, C:\\Users\\Public). Use entropy measures on filenames in command lines to identify randomly generated names. Correlate the creation of these low-frequency, high-entropy, or hidden files with subsequent outbound network connections (Windows Event ID 5156, Zeek conn.log) from the same process within a short time window. Use correlation analysis to link the file-based mutex pattern to potential C2 activity."
          },
          "A process creates mutexes with high-entropy (randomly generated) names or names derived from unique system identifiers, indicating an attempt to create a unique identifier for an implant on the infected host.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command-line arguments from process creation events (Windows Event ID 4688) for patterns that suggest dynamic mutex name generation. Use entropy measures on strings within command lines of a single process image name across multiple endpoints to identify abnormally high-entropy naming conventions. Search for command-line patterns that combine static strings with dynamic system information (e.g., output of 'vol' or 'hostname' commands piped into a variable). Use linear regression or another correlation model to test if processes with these command-line characteristics are more likely to exhibit other suspicious behaviors, such as initiating network connections to low-reputation IPs."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
