```json
[
  {
    "Has the adversary impacted data availability or integrity by deleting cloud storage data? (TA0040 - Impact)": {
      "Indicators": {
        "T1485.001 - Lifecycle-Triggered Deletion": {
          "Outbound network connections from an internal host to cloud storage API endpoints originating from or destined to IP addresses listed in threat intelligence feeds as malicious, or execution of cloud CLI tools with command-line parameters matching signatures of known destructive malware.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log showing outbound connections from internal hosts to cloud storage API endpoints (e.g., s3.*.amazonaws.com, *.blob.core.windows.net, storage.googleapis.com) against a continuously updated CTI feed of known malicious IP addresses. Alert on matches. Separately, monitor Windows Event ID 4688 for cloud CLI executions (e.g., 'aws', 'az', 'gcloud') whose command-line arguments contain highly specific string patterns recognized as unique to known data destruction malware families (e.g., specific ransom note filenames passed as parameters, hardcoded bucket names used by malware). Maintain and regularly update these malware-specific signatures."
          },
          "Execution of cloud provider CLI/SDK commands on internal hosts with specific arguments known to modify or implement storage lifecycle policies to delete data, particularly with short expiration periods (e.g., 1 day).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events involving cloud provider CLI/SDKs (e.g., 'aws', 'az', 'gcloud'). Parse command-line arguments for commands and parameters related to storage lifecycle management (e.g., 's3api put-bucket-lifecycle-configuration', 'storage blob service-properties update --delete-retention-policy', 'storage buckets update --lifecycle-file') combined with keywords indicating deletion or short retention ('Expiration', 'Days:1', 'Status:Disabled' for previous rules, 'delete_marker_gc_after_days:1'). Use regular expressions to identify these patterns. Establish baselines for legitimate administrative use of these commands (e.g., by user, host, frequency) and alert on deviations, execution from unauthorized systems/accounts, or policies setting expiration to 0 or 1 day."
          },
          "Anomalous sequence of actions on an internal host involving reconnaissance of cloud storage, followed by modification of lifecycle policies via CLI/SDK, potentially correlated with unusual data access or deletion activity observed in network traffic.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command execution sequences on a single host within a short timeframe, such as: [1] Cloud CLI commands for listing cloud storage buckets or objects (e.g., 'aws s3 ls', 'az storage container list', 'gcloud storage ls'). [2] Followed by commands modifying storage lifecycle policies (as per the 'Pattern' detection). Correlate these host-based event sequences with Zeek conn.log data; look for associated unusual network activity like initial connections to cloud APIs from unexpected internal sources/processes, or a sudden cessation of expected data flows (e.g., application logs, backups) to specific cloud storage locations shortly after suspected lifecycle policy changes. Use correlation analysis based on host IP and time windows (e.g., within 30 minutes). Employ statistical methods like entropy measures on command sequences per user/host to detect unusual behavior."
          },
          "Sudden, unexplained decrease or complete cessation of expected outbound data flows (e.g., log shipping, backups) to specific cloud storage buckets, potentially indicating data deletion via lifecycle policies.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for expected outbound network traffic volume (bytes, packets) and connection frequency from known internal sources (e.g., log aggregators, backup servers, critical applications) to specific cloud storage service FQDNs or IP ranges. Use descriptive statistics (mean, median, standard deviation of traffic per hour/day) and time series analysis (e.g., moving averages, ARIMA models) to monitor for significant, abrupt decreases or total cessation of this traffic that cannot be attributed to planned maintenance or known outages. Generate alerts when traffic drops below a statistically significant threshold (e.g., >3 standard deviations below mean, or using IQR). Correlate these network-level alerts with any detected host-based lifecycle policy modification attempts."
          },
          "Unusual patterns of network connections from internal hosts to cloud provider API endpoints specifically managing storage lifecycle configurations, especially from hosts not authorized for such administrative actions or at anomalous times.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify specific API endpoint FQDNs or IP address ranges associated with cloud storage lifecycle management (these may overlap with general storage APIs but can be filtered by traffic volume/host source). Monitor Zeek conn.log for connections to these specific endpoints. Profile which internal hosts and user agents normally connect to these management functions. Use frequency analysis and baselining (e.g., host-API pair connection counts) to detect new or unauthorized internal hosts initiating connections, or an unusual burst of connections from any single host. Apply statistical methods like Inter-Quartile Range (IQR) or percentile analysis on connection counts per host to these sensitive API endpoints to flag outliers. Correlate with login times or business hours to detect off-hour activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```