```json
[
  {
    "Has the adversary modified trust relationships for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1484.002 - Trust Modification": {
          "Addition of an AD FS signing certificate with a thumbprint known to be associated with malicious actors or tools.": {
            "Data": "Windows Event ID 259",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 259 (AD FS Added Signing Certificate) on AD FS servers. Upon detection, extract the thumbprint of the newly added certificate. Compare this thumbprint against a high-confidence threat intelligence feed or an internal list of known malicious certificate thumbprints. Generate a high-priority alert on any match for immediate investigation."
          },
          "Modification of AD FS claim issuance rules to include overly permissive or known-abusable claim types, such as adding administrator SIDs or device claims that bypass MFA.": {
            "Data": "Windows Event ID 501",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 501 (Updated Claims Issuance Policy) on AD FS servers. Parse the event data to inspect the content of the claim issuance rule change. Define and search for patterns of high-risk modifications, such as the addition of specific SIDs (e.g., 'S-1-5-32-544' for Administrators), device claims intended to bypass MFA, or rules that pass through password-based claims for sensitive applications. Use regular expression matching on the event data to flag these specific risky patterns, especially if they occur outside of documented change control."
          },
          "A sequence of actions involving domain trust modification followed by anomalous cross-domain authentication activity, indicating potential abuse of the newly established trust.": {
            "Data": "Windows Event ID 4703; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate domain trust modification events (Windows Event ID 4703) on Domain Controllers with subsequent cross-domain authentication events (Windows Event ID 4624 with Logon Type 3, where the source workstation is in a different domain). Establish a baseline for normal cross-trust authentication volume and patterns. Use time series analysis or correlation analysis to detect a significant spike in authentications or access to sensitive resources from the newly trusted domain, particularly from accounts that do not typically perform such actions. Flag any trust modification event that is not followed by expected, legitimate cross-domain activity but is instead followed by suspicious lateral movement."
          },
          "Unauthorized or unscheduled modification of domain federation settings, such as changing a domain's authentication from 'Managed' to 'Federated'.": {
            "Data": "Windows Event ID 307; Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 307 and 510 on AD FS servers and Domain Controllers for changes to federation settings. Investigate any change that sets a domain's authentication from 'Managed' to 'Federated' without a corresponding change request. Establish a baseline of accounts and hosts that perform legitimate federation changes and use descriptive statistics (frequency analysis) to flag modifications by rare or unauthorized accounts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary modifying trust relationships for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1484.002 - Trust Modification": {
          "Modification of federation settings by adding a trusted realm URI or token-signing certificate public key known to be associated with malicious infrastructure.": {
            "Data": "Windows Event ID 307; Windows Event ID 510; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor AD FS configuration change events (Event IDs 307, 510) and PowerShell logs (Event ID 4688 with command-line logging) for the addition or modification of trusted realms (URIs) or token-signing certificates. Extract the URIs and certificate public keys. Compare these atomic indicators against a threat intelligence feed of known malicious C2 domains or certificate keys used by adversaries for federation abuse. Alert on any match."
          },
          "Execution of specific PowerShell cmdlets (`Update-MSOLFederatedDomain`, `Set-MsolDomainFederationSettings`) with parameters known to be abused for defense evasion, such as setting a malicious token signing certificate or a foreign issuer URI.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) with command-line logging enabled. Create a specific pattern-matching rule to detect the execution of `Update-MSOLFederatedDomain` or `Set-MsolDomainFederationSettings`. Scrutinize the command parameters used, specifically '-SigningCertificate', '-IssuerUri', and '-FederationBrandName'. Flag any execution where these parameters point to non-standard, unrecognized, or suspicious values, particularly when executed from non-administrative workstations or by accounts not authorized for federation management."
          },
          "An administrative account performing trust modifications outside of normal business hours, from an unusual source host, or without an associated change management ticket, followed by anomalous logon activity using the modified trust.": {
            "Data": "Windows Event ID 4703; Windows Event ID 307; Windows Event ID 501; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal administrative behavior for accounts authorized to manage domain trusts and federation. Monitor for any trust modification events (e.g., 4703, 307, 501, 259) and analyze the context: source hostname, time of day, and user account. Correlate this with change management system data to identify unauthorized changes. Use statistical methods (e.g., percentile analysis on timestamps, frequency analysis on source hosts) to flag anomalous administrative actions. Investigate any such change that is immediately followed by successful federated logons (Event ID 4624) from suspicious sources."
          },
          "Unusual external network connections originating from AD FS servers to cloud identity provider endpoints immediately following trust modification events.": {
            "Data": "Zeek conn.log; Windows Event ID 4703; Windows Event ID 307; Windows Event ID 501",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing connections originating from AD FS servers to known cloud identity provider endpoints (e.g., login.microsoftonline.com). Use time series analysis to identify unusual connection patterns or spikes to these endpoints. Specifically create a high-priority alert if a spike in connections occurs within a short time window (e.g., 5-15 minutes) immediately following a detected trust modification event (e.g., Windows Event IDs 4703, 307, 501, 259), as this may indicate an adversary testing or exploiting the new trust relationship."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```