[
  {
    "Has the adversary modified trust relationships for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1484.002 - Trust Modification": {
          "Logs showing changes to domain trust objects or properties.": {
            "Data": "Windows Event ID 4703",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs indicating trust modifications (e.g., 4703) on Domain Controllers. Identify the user account performing the change. Analyze the frequency and timing of trust modifications; use time series analysis or simple count anomalies to identify unusual activity spikes compared to historical patterns."
          },
          "Security logs indicating modification of federation settings on a domain (e.g., setting authentication to Federated).": {
            "Data": "Windows Event ID 307; Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 307 and 510 on AD FS servers and Domain Controllers for changes to federation settings. Correlate these events by Instance ID. Investigate any changes setting domain authentication from Managed to Federated or modifying existing federation configurations. Analyze user accounts initiating these changes for legitimacy using baselines and organizational change management records."
          },
          "Changes to AD FS claim issuance rules potentially allowing authentication based on arbitrary or weakly validated claims.": {
            "Data": "Windows Event ID 501",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 501 on AD FS servers for changes to claim issuance rules. Specifically look for rules that appear overly permissive or allow authentication/authorization based on arbitrary or weakly validated claims. Baseline normal claim rule configurations by capturing the content and use checksums or hash comparisons to detect changes. Flag changes that occur outside of documented changes or maintenance windows."
          },
          "Addition of a new, untrusted or suspicious signing certificate to the AD FS configuration.": {
            "Data": "Windows Event ID 259; Windows Event ID 260",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 259 (AD FS Added Signing Certificate) and 260 (Removed Signing Certificate) on AD FS servers. Immediately investigate any addition of a new signing certificate that is not part of a planned certificate rollover or update procedure. Validate the certificate details (issuer, validity period, thumbprint) against expected certificates. Use correlation analysis to link certificate changes with subsequent unusual authentication events (e.g., multiple failed logins followed by success) from external sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary modifying trust relationships for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1484.002 - Trust Modification": {
          "Audit logs showing the addition of a new federated identity provider to an identity tenant.": {
            "Data": "Windows Event ID 307; Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 307 and 510 (if applicable for ADFS configuration changes) or forwarded audit logs for the addition of new identity providers. Analyze the source account and context of these events. Use correlation analysis to link these events with other suspicious activities or unauthorized configuration changes."
          },
          "Detection of specific PowerShell commands used to modify federated domain properties, potentially enabling credential manipulation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) and PowerShell logs. Search for execution of commands like 'Update-MSOLFederatedDomain'. Analyze the command parameters, user account, and host from which the command was executed. Use frequency analysis to identify rare or unauthorized usage of these commands, especially when executed by accounts that typically do not perform federation management."
          },
          "Configuration changes enabling multi-domain support or other federation properties that could facilitate abuse.": {
            "Data": "Windows Event ID 4688; Windows Event ID 307; Windows Event ID 510",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of PowerShell commands modifying federation settings (e.g., `Update-MSOLFederatedDomain` with `-supportmultipledomain`). Correlate with AD FS event logs (307, 510) if applicable to confirm the change. Establish a baseline of authorized administrative actions and use frequency analysis to identify infrequent or unexpected execution of these commands, especially from unusual hosts or by non-administrative users."
          },
          "Unusual external network connections originating from AD FS servers or compromised hosts to cloud identity provider endpoints following trust modification events.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and Windows Event ID 5156 (Windows Filtering Platform Connection) entries showing connections originating from internal hosts, particularly AD FS servers, to known cloud identity provider endpoints (e.g., `sts.amazonaws.com`, `login.microsoftonline.com`). Use time series analysis to identify unusual connection patterns or spikes to these endpoints, especially when originating from unexpected sources or immediately following detected trust modification events (e.g., Windows Event ID 307, 510, 4703, 501, 259)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]