[
    {
        "information_requirement": "Is the adversary evading defenses using environmental keying?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1480.001",
                "name": "Environmental Keying",
                "evidence": [
                    {
                        "description": "Network connections to known malicious C2 infrastructure immediately following a series of environmental discovery commands, indicating a successful keying check.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify suspicious processes executing environmental discovery commands (from Windows Event ID 4688). Monitor for any subsequent network connections initiated by that process or its children (using Zeek conn.log). Correlate the destination IPs/domains of these connections against a high-confidence, continuously updated threat intelligence feed of known C2 infrastructure. A confirmed match strongly indicates the malware successfully keyed itself and is initiating C2 communication."
                    },
                    {
                        "description": "Execution of a specific sequence or combination of system discovery commands and arguments matching patterns used by known malware families for environmental keying.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain and apply a list of known environmental keying command patterns (e.g., `whoami.exe` followed by `net.exe user /domain`, or `wmic csproduct get uuid` followed by a network check). Monitor Windows Event ID 4688 logs for processes executing these command sequences from the same parent process within a short time window (e.g., < 30 seconds). Use correlation analysis on Process ID, Parent Process ID, and timestamps to link the commands. Alert when a known malicious pattern is observed."
                    },
                    {
                        "description": "A process executing an unusual burst or combination of system, network, or user discovery commands, deviating from established host or user activity baselines.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation. For each host and/or user, establish a baseline of normal discovery command usage (e.g., `whoami`, `ipconfig`, `systeminfo`, `wmic`, `getmac`, `nltest`, `nslookup`). Use time series analysis to detect unusual bursts of these commands from a single parent process. Calculate the entropy of commands used in a short window; a sudden spike in entropy can indicate broad, un-targeted discovery. Use descriptive statistics and Inter-Quartile Range (IQR) to flag hosts or users with an anomalously high frequency of such commands."
                    },
                    {
                        "description": "A suspicious or unsigned process that terminates immediately after launching, particularly after performing discovery checks, suggesting an environmental key mismatch.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 and correlate process creation with process termination events. Calculate the typical lifespan for common processes on the network. Use descriptive statistics (mean, median, standard deviation of process duration) and create box-plots to flag processes, especially newly seen or unsigned ones, that terminate in an unusually short time (< 2 seconds), which are statistical outliers. Use correlation analysis to link these short-lived processes with preceding discovery commands from the same parent process or user session to increase confidence."
                    },
                    {
                        "description": "Anomalous network reconnaissance, such as DNS queries for the machine's own hostname to external resolvers or connections to check the public-facing IP, used for key derivation.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log for internal hostnames or domain names being queried against external DNS servers, which is highly unusual behavior. Monitor Zeek conn.log for connections to 'what-is-my-ip' type services. Correlate this network activity with preceding on-host discovery commands (from Windows Event ID 4688). Use frequency analysis to identify rare external destinations for these keying checks. Use linear regression to determine if a statistical relationship exists between bursts of discovery commands and these specific types of network callouts."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
