[
  {
    "Is the adversary attempting to disrupt system availability by stopping services? (TA0040 - Impact)": {
      "Indicators": {
        "T1489 - Service Stop": {
          "Detection of processes or command-line arguments attempting to stop critical services (e.g., `net stop`, `sc stop`, taskkill on service processes).": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing 'net stop', 'sc stop', or 'taskkill' targeting known service executable names. Use correlation analysis to link these process creations to prior suspicious activity on the host. Use frequency analysis to identify unusual occurrences of these commands on specific hosts or targeting specific critical services."
          },
          "Modification of service configuration (e.g., startup type changed to disabled, binary path altered) via registry changes or API calls.": {
            "Data": "Windows Event ID 4657; Windows Event ID 7040",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Registry value modified) and 7040 (Service startup type changed) for changes to the 'Start' or 'StartType' value, and 'ImagePath' value within the HKLM\\SYSTEM\\CurrentControlSet\\Services registry hive. Filter for critical services. Correlate configuration changes with user activity logs (Event ID 4624/4625) and patch management records. Identify changes that occur outside scheduled maintenance windows or from unusual user accounts using time series analysis."
          },
          "Simultaneous stopping or failure of multiple critical services on a host or across multiple hosts.": {
            "Data": "Windows Event ID 7036; Windows Event ID 7023; Windows Event ID 7024; Windows Event ID 7026",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event IDs 7036 (Service stopped), 7023, 7024, and 7026 (service failures/errors) from critical endpoints and servers. Group events by host and timestamp. Use time series analysis to detect a sudden increase in the rate of these events occurring on a single host or correlated bursts across multiple hosts within a short time window (e.g., 1-5 minutes). Use frequency analysis or standard deviation from baseline to flag hosts or periods with an anomalous rate of service stop/failure events."
          },
          "Network communication failures or anomalies immediately following service stop events on critical hosts.": {
            "Data": "Windows Event ID 7036; Zeek conn.log; Zeek weird.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 7036 (Service stopped) on critical hosts with network logs (Zeek conn.log, Zeek weird.log) involving those hosts within a short time window (e.g., 1 minute) after the service stop. Identify a significant drop in expected connection volume (conn.log) or an increase in connection errors/anomalies (weird.log) related to the stopped service's function. Use correlation analysis to link the timing of service stops to observed network traffic pattern changes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]