```json
[
  {
    "Has the adversary escalated privileges by modifying domain or tenant policy? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1484 - Domain or Tenant Policy Modification": {
          "A Group Policy modification deploys a scheduled task, service, or script containing a known malicious hash, domain, or IP address.": {
            "Data": "Windows Event ID 5136; Windows Event ID 5141",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse the content of GPO modification events (Windows Event IDs 5136, 5141) for file paths, domain names, or IP addresses within pushed scripts, scheduled tasks, or software installation policies. Correlate these atomic indicators against a continuously updated threat intelligence feed of known malicious hashes, domains, and IPs. Alert on any confirmed match, as this indicates a GPO is being used to deploy a known threat."
          },
          "Modification of a GPO's User Rights Assignment to add a non-standard account to a privileged group (e.g., 'Backup Operators', 'Server Operators') in a pattern consistent with known privilege escalation tools.": {
            "Data": "Windows Event ID 5136; Windows Event ID 5141; Windows Event ID 4732",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor GPO changes (Event IDs 5136, 5141) specifically affecting the `gPCUserRightsAssignment` attribute. Parse changes to identify additions of users to privileged local groups. Correlate with group membership change events (Event ID 4732) on affected hosts. Flag instances where non-administrative accounts or accounts recently exhibiting suspicious activity are granted rights like SeBackupPrivilege, SeRestorePrivilege, or SeTakeOwnershipPrivilege, a known pattern for tools like SharpGPOAbuse or PowerGPO."
          },
          "Modification of critical GPOs (e.g., Default Domain Policy) or creation of new GPOs linked to high-level OUs by accounts not designated as administrators or during non-standard change windows.": {
            "Data": "Windows Event ID 5136; Windows Event ID 5137; Windows Event ID 5139; Windows Event ID 5141",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of accounts authorized to modify GPOs and the typical times for such changes. Monitor GPO modification, creation, and linking events (Event IDs 5136, 5137, 5139, 5141) on Domain Controllers. Alert when a change is made by an account not on the authorized list or occurs outside of established change windows. Use descriptive statistics and time series analysis on modification timestamps to identify temporal outliers (e.g., changes made at 3 AM)."
          },
          "Addition of a new federated identity provider or modification of a domain's authentication policy from 'Managed' to 'Federated', granting authentication control to an external entity.": {
            "Data": "Windows Event ID 307; Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor ADFS or identity provider servers for events indicating changes to domain authentication settings (e.g., `Set-MsolDomainAuthentication`, Event IDs 307, 510) or the addition of new `IssuanceTransformRules` or Claims Provider Trusts. As these are extremely rare and high-impact events, baseline the existing federation configuration. Any modification, especially the addition of a new trust or a switch to federated identity for a domain, should be treated as a high-priority incident and investigated immediately."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses by modifying domain or tenant policy? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1484 - Domain or Tenant Policy Modification": {
          "A Group Policy modification adds a known malicious file path, process name, or signature to a security tool's exclusion list.": {
            "Data": "Windows Event ID 5136; Windows Event ID 5141",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse GPO modification events (Event IDs 5136, 5141) that alter settings related to Windows Defender, EDR, or other security tools. Extract all file paths, process names, or signatures being added to exclusion lists. Cross-reference these strings against a threat intelligence feed of known malicious file paths or malware process names. Alert on any match, as this is a direct attempt to blind a specific security control to a known threat."
          },
          "Modification of a GPO to push a specific, known script or command (e.g., a PowerShell one-liner) designed to disable security features like AMSI, ETW, or Script Block Logging.": {
            "Data": "Windows Event ID 5136; Windows Event ID 5141",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor GPO modification events for changes that create or alter Startup/Logon scripts or Immediate Scheduled Tasks. Scan the script content or command-line arguments within the GPO data for patterns matching known defense evasion techniques. Maintain a library of regular expressions to detect common PowerShell commands used to disable AMSI (`[Ref].Assembly.GetType('S'+'y'+...)`), tamper with ETW providers, or set registry keys to disable Script Block Logging."
          },
          "Widespread modification of GPOs to disable or degrade security logging and auditing across the domain, such as reducing the size of security logs, disabling SACLs, or turning off critical audit categories.": {
            "Data": "Windows Event ID 5136; Windows Event ID 5141",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor GPO changes (Event IDs 5136, 5141) affecting audit policies (`MACHINE\\System\\CurrentControlSet\\Services\\EventLog\\Security`) or specific audit subcategories (`Audit: Force audit policy subcategory settings`). Baseline current audit settings. Alert on any change that reduces the level of logging, such as disabling 'Audit Process Creation' or 'Audit Security Group Management' across a large number of OUs. Use correlation analysis to link these policy changes with a subsequent decrease in event log volume from affected endpoints to confirm the evasion was successful."
          },
          "A rapid sequence of GPO modification followed by a reversion of the same policy, indicating a temporary change to perform a malicious action while minimizing detection.": {
            "Data": "Windows Event ID 5136; Windows Event ID 5141",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track the version number and modification history of critical GPOs by correlating modification events (Event IDs 5136, 5141) for the same GPO distinguished name. Flag sequences that occur within a short time window (e.g., under 30 minutes). Analyze the time delta between modification and reversion using descriptive statistics (mean, min, max, std dev); flag sequences with a significantly shorter delta than normal administrative changes. Investigate other activities by the source account or on affected hosts that occurred during the window when the malicious policy was active."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```