[
  {
    "Has the adversary encrypted data to impact system availability? (TA0040 - Impact)": {
      "Indicators": {
        "Large-scale or rapid file modification/renaming activity, especially in user directories or with characteristic ransomware extensions.": {
          "Data": "Windows Event ID 4663",
          "Data Platform": "Endpoints; Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4663 (Object Access - Write/Delete) for file modification/write events, particularly in user directories or targeting common file types (documents, images, etc.). Measure the rate of file modification per host using time series analysis. Flag hosts exhibiting sudden, large spikes in file modification activity within a short time window. Identify common file extensions being modified or created during these spikes."
        },
        "Execution of data destruction utilities (vssadmin, wbadmin, bcdedit) or suspicious binaries known to perform encryption.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints; Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 (Process Creation) for execution of binaries like vssadmin, wbadmin, bcdedit, or processes with suspicious names/paths commonly associated with ransomware. Analyze command-line parameters for actions like shadow copy deletion or boot configuration modification. Use descriptive statistics on process execution frequency across endpoints and servers to identify outliers or unusually high execution counts for these binaries."
        },
        "Creation of ransom notes or files with known ransomware extensions.": {
          "Data": "Windows Event ID 4663",
          "Data Platform": "Endpoints; Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4663 (Object Access) for file creation/write events where Access Mask indicates writing or appending data (e.g., 0x2, 0x4). Filter for filenames commonly associated with ransom notes (e.g., '*_README_*', 'HOW_TO_DECRYPT.*') or file extensions frequently used by ransomware families (maintain an updated list). Use frequency analysis to alert on hosts exhibiting sudden creation of multiple such files in a short time frame."
        },
        "Rapid increase in files exhibiting high entropy or other encryption-like characteristics.": {
          "Data": "Windows Event ID 4663; Zeek fileinfo.log",
          "Data Platform": "Endpoints; Servers; Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4663 for file write events ('Access Mask' includes 0x2 or 0x4) indicating modification or creation. Correlate with Zeek fileinfo.log entries for the same files, focusing on files with unusually high entropy (typically > 6.0 bits/byte). Use time series analysis on a per-host basis to detect a sudden spike in the creation or modification of high-entropy files, potentially combined with a high rate of file operations from Event 4663."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]