[
  {
    "Has the adversary escalated privileges by modifying domain or tenant policy? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1484 - Domain or Tenant Policy Modification": {
          "Modification events related to critical Group Policy Objects (GPOs) that could grant system-level permissions or execute malicious code.": {
            "Data": "Windows Event ID 5136, Windows Event ID 5137, Windows Event ID 5138, Windows Event ID 5139, Windows Event ID 5141",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 5136, 5137, 5138, 5139, 5141 on Domain Controllers for changes to critical GPO objects (e.g., Default Domain Policy, Default Domain Controllers Policy). Identify changes affecting software installation, script execution, user rights assignment, or security options. Investigate changes originating from non-administrative accounts or service accounts."
          },
          "Changes to domain trust relationships or identity federation settings.": {
            "Data": "Windows Event ID 307, Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor relevant logs (Windows Event ID 307, 510) on ADFS/Identity Servers for modifications to domain trust settings, federation settings, or authentication methods (Managed to Federated). Identify changes originating from unusual accounts or locations. Use frequency analysis to identify rare configuration changes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by modifying domain or tenant policy? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1484 - Domain or Tenant Policy Modification": {
          "Modification events for GPOs immediately preceding deployment of suspicious scheduled tasks or software.": {
            "Data": "Windows Event ID 5136, Windows Event ID 5137, Windows Event ID 5138, Windows Event ID 5139, Windows Event ID 5141, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate GPO modification events (Windows Event ID 5136-5141) with subsequent process creation events (Windows Event ID 4688) on domain machines or servers, looking for suspicious executables or scripts launched shortly after a GPO update. Use time series analysis to identify unusual timing between policy changes and subsequent actions."
          },
          "Rapid sequence of policy modification and subsequent reversion events for critical domain or tenant settings.": {
            "Data": "Windows Event ID 5136, Windows Event ID 5137, Windows Event ID 5138, Windows Event ID 5139, Windows Event ID 5141, Windows Event ID 307, Windows Event ID 510",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor sequence of policy modification (Windows Event ID 5136-5141) and deletion/undeletion/reversion events (Windows Event ID 5138, 5139, 5141, 307, 510) on Domain Controllers/Identity Servers. Identify rapid back-and-forth changes to the same policy objects. Analyze the time delta between modification and reversion using descriptive statistics (e.g., mean, min, max, stdev) to identify changes occurring much faster than normal administrative procedures."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]