[
  {
    "Has the adversary modified Group Policy for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1484.001 - Group Policy Modification": {
          "Modification of Group Policy objects (GPOs) recorded in directory service logs.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5136 on Domain Controllers. Identify modifications to GPO objects. Analyze modification timestamps and users/accounts performing the modifications. Identify deviations from baseline modification patterns using descriptive statistics on frequency and timing."
          },
          "Changes to user rights or privileges (e.g., SeEnableDelegationPrivilege) recorded in security logs.": {
            "Data": "Windows Event ID 4704, Windows Event ID 4672",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4704 and 4672 on Domain Controllers. Look for assignments of sensitive user rights like SeEnableDelegationPrivilege. Identify the account performing the assignment and the target account/group. Correlate with recent suspicious activity."
          }
        }
      }
    }
  },
  {
    "Has the adversary modified Group Policy for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1484.001 - Group Policy Modification": {
          "Modification of GPO policy files (e.g., XML preference files like ScheduledTasks.xml) via unexpected processes or users.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4656",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure auditing for Windows Event ID 4663 and 4656 on GPO files within the SYSVOL share (e.g., *.xml, GptTmpl.inf). Identify access attempts to GPO files by unexpected users or processes. Analyze access patterns over time using time series analysis to detect anomalous spikes or persistent access."
          },
          "Creation, deletion, or movement of Group Policy objects (GPOs) in directory service logs.": {
            "Data": "Windows Event ID 5137, Windows Event ID 5141, Windows Event ID 5139",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5137, 5141, and 5139 on Domain Controllers. Track the creation, deletion, and movement of GPO objects. Identify these events occurring outside of scheduled GPO maintenance windows or performed by non-standard administrative accounts. Use frequency analysis to identify unusual counts of these events."
          }
        }
      }
    }
  }
]