[
    {
        "information_requirement": "Is the adversary attempting to discover domain trust relationships?",
        "tactic_id": "TA0007",
        "tactic_name": "Discovery",
        "indicators": [
            {
                "technique_id": "T1482",
                "name": "Domain Trust Discovery",
                "evidence": [
                    {
                        "description": "Execution of a known malicious discovery tool (e.g., BloodHound, SharpHound, Adidnsdump) identified by its file hash.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor for process creation events (Windows Event ID 4688) across all endpoints and servers. Calculate or retrieve the file hash of the newly created process executable. Match the hash against a high-confidence threat intelligence feed of known malicious discovery tools and their variants. An exact match should trigger an immediate high-priority alert."
                    },
                    {
                        "description": "Execution of native Windows utilities or scripts using command-line arguments or methods specifically designed for enumerating domain trust relationships.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process names like `nltest.exe`, `dsquery.exe`, `powershell.exe`, or `pwsh.exe`. Use regular expressions to search command-line arguments for patterns such as `/domain_trusts`, `Get-ADDomainController -Discover`, `Get-DomainTrust`, `Get-ADTrust`, `(New-Object System.DirectoryServices.ActiveDirectory.Domain).GetAllTrustRelationships()`, or `dsquery * -filter '(objectClass=trustedDomain)'`. Use descriptive statistics to establish a baseline for these commands and flag executions by non-administrative users or from unusual hosts, which have a low frequency of occurrence."
                    },
                    {
                        "description": "Domain trust discovery commands executed within a suspicious process context, such as being launched by a web server, an Office application, or via a remote access service without a corresponding interactive logon.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4688 events where the process name is a known discovery utility (e.g., `nltest.exe`) or script host (`powershell.exe`). Scrutinize the `ParentProcessName` field. Flag instances where the parent is a non-standard shell (e.g., `w3wp.exe`, `WINWORD.EXE`, `EXCEL.EXE`, `svchost.exe` hosting a remote service). Correlate the timing of the discovery command with remote access logs (Windows Event ID 4624 with Logon Type 3 or 10) to identify non-interactive discovery activity. Use correlation analysis to link remote access events with subsequent trust discovery commands, flagging this sequence as highly suspicious."
                    },
                    {
                        "description": "Anomalous LDAP query activity from a non-Domain Controller source targeting domain trust objects, indicating network-based reconnaissance.",
                        "data_sources": [
                            "Zeek ldap.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek ldap.log for queries originating from hosts that are not Domain Controllers. Establish a baseline of normal LDAP query sources, destinations, and filter types. Alert on queries from unexpected sources (e.g., standard user workstations) that request trust-related objects (e.g., `objectClass=trustedDomain`) or attributes (`trustPartner`, `trustDirection`, `trustAttributes`). Use time series analysis to detect unusual spikes in LDAP queries from a single host, and use entropy measures on the `search_filter` field to detect hosts performing an unusually diverse set of LDAP queries, which may indicate active enumeration."
                    },
                    {
                        "description": "A single host observed performing a sequence of different discovery activities in a short time frame, including domain trust discovery alongside other reconnaissance types.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Implement a host-level risk scoring system. Increment a host's risk score when it executes commands related to domain trust discovery (T1482), network share discovery (T1135), system owner discovery (T1033), or remote system discovery (T1018) within a defined time window (e.g., 1 hour). Use correlation analysis to identify common sequences of discovery commands that represent a reconnaissance playbook. Hosts exceeding a predefined risk score threshold should be flagged for investigation as they are likely exhibiting a pattern of active, hands-on adversary reconnaissance rather than benign administrative activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
