[
  {
    "Has the adversary impacted data availability or integrity by deleting cloud storage data? (TA0040 - Impact)": {
      "Indicators": {
        "T1485.001 - Lifecycle-Triggered Deletion": {
          "Outbound network connections from an internal host to cloud provider API endpoints immediately preceding changes in cloud storage policy.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections to known cloud provider API endpoints (e.g., s3.amazonaws.com, storage.googleapis.com, blob.core.windows.net). Use time series analysis on connection volume or frequency from unexpected hosts to identify unusual spikes or patterns."
          },
          "Execution of cloud provider CLI/SDK commands related to storage lifecycle management on compromised internal servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events showing execution of cloud provider CLI/SDKs (e.g., 'aws', 'gcloud', 'az') with parameters related to lifecycle configuration or deletion. Use baselining or frequency analysis to detect execution on unauthorized hosts or at unusual times."
          },
          "Command line arguments in cloud provider CLI execution indicating changes to storage bucket lifecycle policies with short expiration periods.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes related to cloud CLI/SDKs (e.g., 'aws', 'gcloud', 'az'). Filter command line arguments for keywords indicating lifecycle policy modification ('put-bucket-lifecycle', 'lifecycle', 'Expiration', 'Days') and check for numeric values representing a short duration (e.g., values <= 1 or 2 for days). Flag execution on unauthorized systems or accounts."
          },
          "Sudden decrease or cessation of expected outbound logging traffic to cloud storage endpoints.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network traffic patterns from known logging sources (hosts, IPs) to cloud storage endpoints (e.g., s3.amazonaws.com). Establish a baseline of expected daily/hourly traffic volume or connection count using descriptive statistics. Use time series analysis to detect significant drops or complete cessation of this outbound traffic that deviate from the baseline (e.g., using statistical thresholds like Z-score or moving averages)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]