
[
  {
    "Has the adversary encrypted data to impact system availability? (TA0040 - Impact)": {
      "Indicators": {
        "T1486 - Data Encrypted for Impact": {
          "Creation of files with names or extensions matching known ransom notes, or processes executing with hashes matching known ransomware binaries.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation events with filenames matching a watchlist of known ransom notes (e.g., `DECRYPT_INSTRUCTIONS.txt`, `*_README.txt`) or extensions matching known ransomware families (e.g., `.lockbit`, `.conti`). Correlate file creation events from Zeek `files.log` (especially over SMB) with a CTI feed of known ransomware file hashes. Monitor Windows Event ID 4688 for process creation events and compare the binary's hash against a list of known ransomware executables."
          },
          "Execution of a sequence of commands to delete Volume Shadow Copies or disable system recovery features, immediately followed by high-volume file I/O operations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a high-fidelity alert for the execution sequence of specific commands via Windows Event ID 4688. Look for processes like `vssadmin.exe` with command-line arguments containing `delete shadows`, `wbadmin.exe` with `delete catalog`, or `bcdedit.exe` with `/set {default} recoveryenabled No`. Correlate these defense evasion events with a subsequent, rapid increase in file write operations (from Windows Event ID 4663, requiring file access auditing) originating from the same host or user session within a short time window (e.g., 5-15 minutes). Use correlation analysis to link the preparatory commands to the impact phase."
          },
          "A single process performing an anomalously high number of file modification or rename operations on a host, particularly targeting common user data file types.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Requires file access auditing (SACLs) to be enabled. Aggregate Windows Event ID 4663 (Object Access: WriteData/AppendData and Delete) events by the process name and host that initiated them. Use time series analysis to establish a baseline of normal file modification rates per process. Flag any process exceeding its baseline by a significant margin (e.g., > 3 standard deviations) in a short period. Prioritize alerts for non-system processes that modify a high diversity of file extensions (.doc, .xls, .pdf, .jpg) or that exhibit a high rate of file renames."
          },
          "A single host generating a high volume of file write or rename events across multiple network shares, indicating a ransomware 'patient zero' encrypting network-accessible data.": {
            "Data": "Windows Event ID 5145; Zeek smb_files.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5145 (Network Share Object Access) to identify a single source host (`Source Address`) accessing an unusually high number of distinct network shares (`Share Name`) in a short time window. Correlate this with Zeek `smb_files.log` data, aggregating by source IP (`id.orig_h`). Flag source IPs that perform an anomalous number of `action: SMB::FILE_WRITE` or `action: SMB::FILE_RENAME` operations across multiple destination IPs. Use descriptive statistics (count distinct destinations, count write/rename actions) and percentile analysis to identify outlier source hosts behaving as encryptors."
          },
          "Modification or encryption of strategically placed, low-impact 'canary' files (honeypot files) on file shares or user directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Deploy canary files with enticing names (e.g., `passwords.xlsx`, `2024_financial_plan.docx`) in various locations, particularly on high-value file shares. Apply a highly specific System Access Control List (SACL) to these files to generate Windows Event ID 4663 for any read or write access. Create a critical alert for any process that modifies or renames these specific files, as no legitimate user or process should ever access them. Investigate the source process and host immediately upon alert."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
