
[
  {
    "Is the adversary attempting to disrupt system availability by stopping services? (TA0040 - Impact)": {
      "Indicators": {
        "T1489 - Service Stop": {
          "A known malicious process (identified by hash or name) issues a command to stop a service, or a command is issued to stop a critical security service.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688) and correlate the initiating process hash/name against a threat intelligence feed of known malicious tools (e.g., ransomware payloads, hacking tools). Separately, monitor service stop commands (`net stop`, `sc stop`, `Stop-Service`) or service stop events (Event ID 7036) and alert if the target service name matches a watchlist of critical security services (e.g., antivirus, EDR, host firewall). This provides a high-confidence alert based on specific, atomic indicators."
          },
          "Execution of commands or scripts using common service control utilities (`net`, `sc`, `taskkill`, PowerShell's `Stop-Service`) to stop multiple services in rapid succession or targeting critical system services.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor command-line activity via Windows Event ID 4688 for the execution of `net.exe`, `sc.exe`, `taskkill.exe`, and `powershell.exe` with arguments such as `stop`, `/f`, `/im`, or the `Stop-Service` cmdlet. Create a pattern-based rule that triggers on a high frequency of these commands from a single parent process or within a short time frame (e.g., >3 services stopped in 1 minute). Apply higher scrutiny when the target service is on a watchlist of critical infrastructure, database, or security services. Use correlation analysis to link the parent process to other suspicious preceding events."
          },
          "The stopping of a specific non-security service (e.g., database, backup, volume shadow copy) immediately prior to other impact-related activities like data encryption or deletion.": {
            "Data": "Windows Event ID 7036; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define a behavioral sequence where the stopping of specific services is a precursor to impact. Monitor for the stopping of services like 'VSS' (Volume Shadow Copy), 'SQLSERVERAGENT', 'MSSQLSERVER', or enterprise backup services via Event ID 7036. Correlate these specific service stop events with subsequent high-volume file modification events (indicative of ransomware), deletion commands (e.g., `vssadmin delete shadows` in Event ID 4688), or large data outflows over the network (Zeek conn.log). The sequence 'Stop VSS -> High file I/O' is a strong behavioral indicator of ransomware activity."
          },
          "Anomalous modification of a service's configuration to prevent it from running, such as changing its startup type to 'Disabled' or altering its binary path, especially outside of scheduled maintenance windows.": {
            "Data": "Windows Event ID 4657; Windows Event ID 7040; Windows Event ID 1102",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for changes to a service's 'Start' type or 'ImagePath' in the registry (HKLM\\SYSTEM\\CurrentControlSet\\Services\\*) via Event ID 4657, or service start type changes via Event ID 7040. Establish a baseline of normal service configuration changes (e.g., during patching cycles). Use time series analysis to detect anomalous spikes in these modification events. Flag any changes made by non-standard administrative accounts or processes, or changes that are temporally correlated with other suspicious activities like the clearing of the security event log (Event ID 1102), and investigate."
          },
          "A statistically significant increase in the number of services entering a 'stopped' state on a single host or across multiple related hosts, deviating from established operational baselines.": {
            "Data": "Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 7036 (Service stopped) across the environment. For each host and for logical groups of critical hosts (e.g., domain controllers, database servers), establish a baseline rate of service stop events per hour/day. Use time series analysis or descriptive statistics (e.g., alert if count > mean + 3*standard_deviation) to detect anomalous bursts of service stops on individual hosts. Use correlation analysis to identify if a burst of service stops is occurring simultaneously across multiple hosts, which is highly indicative of a coordinated attack."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
