[
  {
    "Has the adversary attempted to destroy data to impact availability? (TA0040 - Impact)": {
      "Indicators": {
        "T1485 - Data Destruction": {
          "Execution of known data destruction tools or commands, or suspicious high volume file modification/deletion activity detected via host monitoring.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation with command-line arguments indicating data destruction tools (e.g., sdelete, shred, del /s /q). Monitor Windows Event ID 4663 (if configured) and Sysmon for file creation/modification/deletion events. Analyze events for patterns indicative of mass file operations (e.g., high volume of delete operations from a single process in a short time). Use correlation analysis to link suspicious processes to file modifications."
          },
          "Anomalously high volume of file deletion events or specific data destruction events detected on servers or network shares.": {
            "Data": "Windows Event ID 4663; Zeek file.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for deletion events on critical file paths or network shares. Monitor Zeek file.log for file removal events. Calculate the rate of deletion events per host or share over time. Use time series analysis or statistical process control techniques (e.g., EWMA) to detect statistically significant increases in deletion activity compared to historical baseline."
          },
          "Detection of high volume file modification or overwrite activity in critical system directories (e.g., C:\\Windows\\System32) or user profiles from a single process.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for Write/Modify operations targeting files in system directories (e.g., C:\\Windows\\System32, Program Files) or user profile directories. Correlate 4663 events with Windows Event ID 4688 (Process Creation) by Process ID. Analyze correlated events for high volume of modifications originating from a single process within a short period. Use rate analysis (events per minute/hour) to identify significant spikes in activity compared to baseline for those directories."
          },
          "Creation or modification of large quantities of files with non-typical content patterns (e.g., repetitive random data, image files used for overwriting) within a short time frame.": {
            "Data": "Zeek file.log; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for high volume file creation or modification events. Where available (e.g., via Zeek file.log or other file integrity monitoring), analyze the content properties (e.g., size, entropy of data) of newly created or modified files in suspicious bulk operations. Identify files with low data entropy (random data) or specific patterns (e.g., image file headers) being written to numerous locations, especially if originating from a single suspicious process. Use statistical analysis (e.g., calculating entropy) to flag anomalous file content patterns during high-volume write operations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]