[
  {
    "Is the adversary attempting to evade defenses using mutual exclusion mechanisms? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1480.002 - Mutual Exclusion": {
          "Creation or attempted access of suspicious or known malicious system mutexes by processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) and process handle activity (if enhanced logging is available, like Sysmon event ID 10). Correlate mutex names with running processes. Identify rare or previously unseen system mutex names created by suspicious processes or processes running from unusual locations (e.g., temporary folders). Use frequency analysis on system mutex names observed."
          },
          "Execution of a process that immediately terminates after potentially attempting to create or check a mutex.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) and termination (Windows Event ID 4689) events. Identify processes with very short execution times (e.g., less than a few seconds) by calculating the time difference between 4688 and 4689 events for the same process ID. Correlate these short-lived processes with any mutex creation/access attempts observed in available logs (e.g., Win Event 4688 command line or Sysmon if available). Use descriptive statistics on process execution duration per image name to identify outliers."
          },
          "Processes interacting with files on disk that are named or located in a manner suspicious for mutex usage (e.g., hidden files in user temp directories, files with random names in common malware locations).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command lines and process paths. Identify processes interacting with files in suspicious locations (e.g., %TEMP%, %APPDATA%, C:\\ProgramData) or files with suspicious naming conventions (e.g., randomly generated names, hidden attribute). Use frequency analysis on file paths and names accessed by processes. Flag processes interacting with low-frequency file paths or names in suspicious directories."
          },
          "Network connections from processes exhibiting behaviors consistent with malware performing mutex checks (e.g., suspicious process name/path, unusual command line arguments) or immediately following creation/acquisition of a suspicious mutex.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) with Zeek conn.log data using timestamp and process ID where possible. Identify processes flagged by other detections as potentially performing mutex checks (e.g., based on suspicious process characteristics from 4688). Monitor network connections (5156, Zeek conn.log) originating from these flagged processes. Identify connections to suspicious destinations (e.g., known C2 IPs/domains via threat intelligence, uncommon ports using frequency analysis, IPs with low reputation). Use correlation analysis (e.g., temporal correlation) between process start times/characteristics and outbound network connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]