
[
  {
    "Has the adversary attempted to destroy data to impact availability? (TA0040 - Impact)": {
      "Indicators": {
        "T1485 - Data Destruction": {
          "Execution of a process whose file hash matches a known data wiper or other destructive malware.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Windows Event ID 4688). For each new process, compute the hash of its executable file. Compare these hashes against a continuously updated cyber threat intelligence feed of file hashes for known data destruction malware (e.g., NotPetya, WhisperGate, CaddyWiper). Alert immediately on any match and initiate incident response protocols."
          },
          "Execution of common system utilities or scripts with command-line arguments and parameters strongly associated with data destruction.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Use regular expression matching on the command-line field to detect patterns of legitimate tools being used destructively. Examples include 'sdelete -p', 'cipher /w:', 'format <drive> /p:', 'wevtutil cl <logname>', and 'del /f /s /q' on sensitive directories. Correlate with the parent process to identify scripts executing these commands. Maintain and update a list of high-fidelity destructive command patterns."
          },
          "Anomalously high volume of file deletion or modification events originating from a single process or user account, particularly in critical system directories or across network shares.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal file operation rates (deletions, modifications per minute) per user, per host, and for critical directory paths using Windows Event ID 4663 (requires object access auditing) and Zeek file.log for network shares. Monitor for activity that significantly exceeds these baselines using statistical methods like Inter-Quartile Range (IQR) or Z-scores. Correlate high-volume file operations (e.g., >1000 events/minute) with the parent process (via Process ID in Windows Event ID 4688) to identify the source. Use time series analysis on file operation counts to detect sudden, drastic spikes."
          },
          "Mass creation or modification of files with non-typical or low-entropy content, indicating an attempt to overwrite original data.": {
            "Data": "Windows Event ID 4663; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "During detected high-volume file write operations (from Windows Event ID 4663 or Zeek file.log), sample the resulting files or analyze their metadata. Calculate the Shannon entropy of these files. A significant number of files with unusually low entropy (e.g., all zeros) or uniform high entropy (random data) written in a short time is indicative of data wiping. Use descriptive statistics to compare the entropy of these files against a baseline of normal file content entropy in the environment. Alert on significant deviations."
          },
          "Targeted deletion or modification of critical operating system files, boot records, or volume shadow copies, indicating a deliberate effort to render the system unbootable or unrecoverable.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and maintain a high-priority watchlist of critical system files and paths (e.g., boot.ini, NTLDR, SAM database, drivers in C:\\Windows\\System32). Monitor for any modification or deletion events (Windows Event ID 4663) targeting these assets, especially from non-system processes (e.g., correlate with Process Name from Event ID 4688, excluding trusted system processes like svchost.exe or trustedinstaller.exe in normal contexts). Separately, monitor for command-line execution (Event ID 4688) of 'vssadmin.exe delete shadows /all /quiet'. Any such activity should trigger an immediate high-severity alert."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
