[
  {
    "Is the adversary attempting to evade defenses using execution guardrails? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1480 - Execution Guardrails": {
          "Suspicious process execution that gathers system information or performs rapid discovery checks before proceeding.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) across endpoints and servers. Identify processes known to perform system information gathering or discovery (e.g., systeminfo, ipconfig, hostname, netstat) being executed in rapid succession or initiated by unusual parent processes. Use correlation analysis to link these rapid execution sequences and time series analysis to identify bursts of discovery activity."
          },
          "Network traffic exhibiting user-agent strings that do not match expected client configurations or show selective connection attempts based on user-agent.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for suspicious or unusual User-Agent strings. Compare observed User-Agent strings against known or standard User-Agent configurations for endpoints in the network. Use descriptive statistics or frequency analysis to identify rare or unique User-Agent strings connecting to external resources. Examine conn.log alongside http.log to identify selective connection attempts based on User-Agent presence or value (e.g., only connecting if a specific UA is present)."
          },
          "Attempts to access specific system information, files, or network resources that are not standard for the context (e.g., non-standard share access attempts, checking for specific mounted drives or files).": {
            "Data": "Windows Event ID 4663; Windows Event ID 5140; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Attempted Access to an Object) for access attempts to specific file paths or objects potentially used as guardrails. Monitor Windows Event ID 5140 (Network Share Access) for suspicious access attempts to network shares. Correlate these access events with process creation (Event ID 4688) to identify the initiating process. Use frequency analysis or anomaly detection (e.g., IQR) on access patterns to specific resources to flag unusual activity."
          },
          "Execution of suspicious scripts or binaries that perform environmental checks (e.g., domain checks, IP address checks, hostname checks) followed by a conditional action.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of scripts or unusual binaries. Analyze the command line arguments for keywords related to environmental checks ('Get-ADDomain', 'ipconfig', 'hostname', 'ifconfig', 'test-path', etc.). Identify sequences where these checks are performed, followed by a conditional action such as immediate process termination, execution of another payload, or network connection attempts. Use correlation analysis to link these events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]