[
  {
    "Is the adversary evading defenses using environmental keying? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1480.001 - Environmental Keying": {
          "Suspicious process execution or rapid succession of system/environment discovery commands used to gather environmental keying information (e.g., network info, device IDs, domain details).": {
            "Data": "Windows Event ID 4688; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify sequences of process executions associated with common system discovery commands (e.g., ipconfig, systeminfo, whoami, nslookup). Analyze timing using time series analysis to detect rapid execution bursts. Perform correlation analysis between process execution and network activity (Zeek logs) potentially used to exfiltrate discovery results or reach out for the payload."
          },
          "Attempted execution of a payload followed by immediate termination or error indicating a decryption/keying failure, potentially triggered by unexpected environmental conditions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious process creation attempts that terminate immediately or unexpectedly based on subsequent events (e.g., short process duration). Identify patterns using descriptive statistics (e.g., average process lifespan for specific processes). Correlate potential decryption/keying failures with preceding discovery activity as identified in other evidence points."
          },
          "DNS queries or network connections to external services resolving system/domain information, potentially for key derivation.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries related to system hostnames or internal domain names resolving to external IPs. Monitor Zeek conn.log for outbound connections to unusual services or IPs immediately following execution of a potentially keyed payload or discovery commands. Use frequency analysis to identify rare destination IPs/domains queried after suspicious activity. Correlate DNS/connection activity with processes flagged by Windows Event ID 4688."
          },
          "Execution of commands or scripts specifically designed to retrieve hardware identifiers, file hashes, or software version information, potentially linked to a pre-execution phase.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command line arguments containing utilities or scripts that query hardware info (e.g., `wmic csproduct get uuid`, `getmac`), check for specific files (`dir`, `Get-ChildItem` with specific paths/names), or software versions (`wmic product get name,version`). Use correlation analysis to link these information-gathering activities to subsequent attempts to execute encrypted payloads. Establish a baseline of normal system info queries per host/user and use descriptive statistics (e.g., frequency, unique commands) to flag outliers in frequency or command line parameters."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]