```json
[
  {
    "Has the adversary modified Group Policy for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1484.001 - Group Policy Modification": {
          "Deployment of files via GPO whose file hash matches a known malicious tool used for privilege escalation.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable object access auditing on the SYSVOL share (Event ID 4663) to detect file writes/modifications. Upon detection, hash the new/modified file. Separately, monitor process creation events (Event ID 4688) on endpoints for processes launched from GPO-related script paths. Hash the associated executables and inner join the hashes against a CTI feed of known privilege escalation tools. Alert on any matches and trace back to the initiating GPO modification."
          },
          "Execution of command-line arguments or script contents via GPO known to be used for local privilege escalation, such as adding a user to the local Administrators group.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688) with full command-line logging enabled across endpoints. Use regular expression matching to scan command lines for patterns commonly used in privilege escalation, such as `net localgroup administrators ... /add`, modifications to `SeImpersonatePrivilege`, or abuse of service binaries. Prioritize alerts for these patterns when the parent process is `gpscript.exe` or another GPO-related process. Maintain and update a list of known malicious command patterns."
          },
          "Anomalous modification of GPO Access Control Lists (ACLs) to grant modification permissions to non-standard administrative accounts or groups.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Directory Service object modification events (Event ID 5136) on Domain Controllers, specifically filtering for changes to the `nTSecurityDescriptor` attribute on GPO-related objects. Establish a baseline of accounts/groups that normally modify GPO permissions. Use correlation analysis to alert when an account outside this baseline modifies a GPO ACL, especially if the change grants write/modify permissions. Analyze the frequency and timing of such changes using descriptive statistics to identify outliers."
          },
          "Assignment of sensitive user rights known to enable privilege escalation (e.g., SeEnableDelegationPrivilege, SeTakeOwnershipPrivilege) via a GPO modification.": {
            "Data": "Windows Event ID 5136; Windows Event ID 4704; Windows Event ID 4672",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate GPO modification events (Event ID 5136) with subsequent user right assignment events (Event ID 4704) or special privilege assignments to a logon session (Event ID 4672). Specifically monitor for the assignment of highly sensitive privileges like SeDebugPrivilege, SeTcbPrivilege, or SeImpersonatePrivilege. Establish a baseline of which GPOs normally assign which rights, and alert on any deviation or on any new assignment of a predefined set of high-risk privileges by any GPO."
          },
          "Creation of a new GPO that deploys a scheduled task or service designed for privilege escalation on endpoints, such as a task running with SYSTEM privileges.": {
            "Data": "Windows Event ID 5137; Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the creation of a new GPO (Event ID 5137) on a Domain Controller with the subsequent creation of a new scheduled task (Event ID 4698) or service (Event ID 4702) on member servers/endpoints. Analyze the properties of the new task/service, specifically looking for those configured to run with high privileges (e.g., NT AUTHORITY\\SYSTEM). Use time series analysis to detect an abnormal spike in new task/service creation across the environment following a GPO push."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary modified Group Policy for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1484.001 - Group Policy Modification": {
          "Modification of GPO files within SYSVOL (e.g., registry.pol) to include specific registry keys known to disable security products.": {
            "Data": "Windows Event ID 4663; Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for write modifications (Event ID 4663) to GPO policy files (registry.pol, GptTmpl.inf) in SYSVOL. Upon modification, parse the file content for specific, known registry keys/values used to disable security tools (e.g., `DisableAntiSpyware` for Windows Defender, or keys related to third-party AV/EDR). Maintain a selector list of these atomic indicators (registry paths and values) and alert on any matches. Correlate with the GPO modification event (Event ID 5136) and the account that performed the change."
          },
          "Execution of scripts or commands via GPO that follow known patterns for disabling security defenses, such as stopping security services or clearing event logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688) with full command-line logging enabled. Use regular expression matching to detect command patterns associated with defense evasion, such as `net stop windefend`, `sc config <service> start= disabled`, `wevtutil.exe cl Security`, or PowerShell commands that modify AMSI settings. Alert when these patterns are observed, especially in processes spawned by `gpscript.exe` or `gpupdate.exe`."
          },
          "Anomalous modification of GPOs resulting in the disabling of critical security configurations, such as weakening Windows Firewall rules, turning off event logging, or disabling User Account Control (UAC).": {
            "Data": "Windows Event ID 5136; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a 'golden configuration' baseline for critical security settings within key GPOs. Monitor for GPO modification events (Event ID 5136) and file writes within SYSVOL (Event ID 4663). Programmatically compare the new GPO settings against the established baseline. Alert on any change that weakens the security posture (e.g., firewall `Enable` changing from 1 to 0, reduction in log sizes, disabling UAC). Analyze the frequency of such 'negative drift' changes and the accounts making them."
          },
          "A GPO modification is followed by a widespread, statistically significant reduction in security event log volume from affected endpoints, indicating successful disabling of logging capabilities.": {
            "Data": "Windows Event ID 5136",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate GPO modification events (Event ID 5136) with the volume of security logs received in the SIEM from organizational units (OUs) affected by that GPO. Use time series analysis (e.g., ARIMA) on the log volume per OU or per host. A significant, sustained drop in log volume (e.g., Windows Security, PowerShell, or Sysmon logs) following a GPO update is a strong behavioral indicator of successful defense evasion. Linear regression can be used to model expected log volume and detect negative deviations from the prediction."
          },
          "Modification of GPO files on a Domain Controller's SYSVOL share by an anomalous process or from a non-standard source host, indicating direct, non-standard manipulation.": {
            "Data": "Windows Event ID 4663; Windows Event ID 5145",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable detailed file share auditing on Domain Controllers (Event ID 5145 - Detailed File Share). Monitor for access to the SYSVOL share, specifically for file write/modification events (Event ID 4663). Baseline the normal processes (`dfsrcs.exe`, `mmc.exe`) and source workstations (e.g., designated admin workstations) that modify GPO files. Alert on modifications originating from unexpected source hosts (e.g., member servers, non-admin endpoints) or performed by unusual processes (e.g., `powershell.exe`, `cmd.exe`, custom binaries). Use frequency analysis on source host/process pairs to identify rare occurrences."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```