[
    {
        "information_requirement": "Is the adversary attempting to evade defenses using execution guardrails?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1480",
                "name": "Execution Guardrails",
                "evidence": [
                    {
                        "description": "Access to specific files, registry keys, or mutexes known to be checked as anti-analysis or anti-sandbox guardrails by specific malware families.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for process creation events (Windows Event ID 4688) whose file hash matches a CTI feed of known malware that employs guardrailing. Concurrently, monitor for object access attempts (Windows Event ID 4663) to specific registry keys (e.g., `HKLM\\SOFTWARE\\VMware, Inc.\\VMware Tools`, `HKLM\\HARDWARE\\Description\\System\\SystemBiosVersion` containing 'VBOX') or files (e.g., `C:\\windows\\System32\\drivers\\VBoxMouse.sys`) that are well-known sandbox/VM indicators. Alert on any process accessing these specific guardrail artifacts."
                    },
                    {
                        "description": "Execution of a script or process with command-line arguments containing a pattern of chained system discovery commands and conditional logic characteristic of guardrailing.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze command lines from process creation events (Windows Event ID 4688) using regular expressions to detect patterns that combine discovery commands (e.g., `systeminfo`, `whoami /user`, `query user`, `net view`, `Get-WmiObject Win32_ComputerSystem`) with scripting logic (e.g., `if`, `| findstr`, `&&`, `||`). A common pattern is a discovery command piped to a string search, followed by a conditional execution or exit, such as `systeminfo | findstr /i \"VMware\" && exit`. Flag these patterns, especially when initiated by unusual parent processes like office applications or untrusted binaries."
                    },
                    {
                        "description": "A newly executed process that performs a rapid series of environment checks and then terminates in an abnormally short time (< 2 seconds) without conducting significant follow-on activity.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4689",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation (Windows Event ID 4688) and termination (Windows Event ID 4689) events to calculate process lifespans. Use descriptive statistics (mean, median, standard deviation) on process lifetimes to identify significant outliers with extremely short lifespans. For these processes, analyze their command lines for discovery commands and cross-reference with Zeek conn.log to confirm they made no or minimal network connections. A cluster of such events indicates malware aborting execution after failing a guardrail check."
                    },
                    {
                        "description": "An anomalous sequence of information gathering activities, such as querying non-standard registry keys, enumerating unusual directories, or checking for specific hardware identifiers, initiated by a process without a clear legitimate purpose.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal information gathering for common processes in your environment. Monitor for process creation (Windows Event ID 4688) followed by a series of object access events (Windows Event ID 4663) to sensitive or unusual locations (e.g., registry hives related to virtualization software, specific security product directories, hardware IDs). Use correlation analysis to link the process to its subsequent access attempts. Employ entropy measures on the set of registry keys or file paths accessed by a new process to detect unusually broad or targeted reconnaissance that deviates from the baseline."
                    },
                    {
                        "description": "A process exhibiting selective network behavior, where it first performs a 'canary check' to a high-reputation domain to test for analysis or proxy environments, and then connects to a suspicious domain upon success.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688) with subsequent DNS queries (Zeek dns.log) and TCP/UDP connections (Zeek conn.log) originating from the same host. Use time series analysis to identify sequences where a process first queries/connects to a common, high-reputation domain (e.g., google.com, microsoft.com) and, upon success, immediately queries/connects to a low-reputation, newly-registered, or known-malicious domain. Flag this two-stage connection behavior occurring within a short time window (e.g., < 10 seconds)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
