[
  {
    "Is the adversary attempting to evade defenses using time-based methods? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497.003 - Time Based Evasion": {
          "Presence of processes executing long sleep commands or using scheduling mechanisms to delay execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the command line contains known sleep commands or scheduling utility arguments (e.g., 'timeout', 'sleep', 'schtasks'). Analyze process execution times relative to parent process creation time. Flag processes with unusually long delays before exhibiting core malicious behavior. Use time series analysis on process activity to identify periods of inactivity followed by bursts of activity."
          },
          "Detection of processes executing excessive loops of benign commands (like ping) or making rapid, repeated API calls without apparent purpose.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of commands like 'ping' with looping arguments. Monitor Zeek conn.log for unusual patterns of repeated, low-volume network connections (e.g., excessive pings). Use frequency analysis to identify processes or endpoints with unusually high rates of execution for specific benign commands or connection patterns."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting to discover the environment using time-based methods? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497.003 - Time Based Evasion": {
          "Execution of code that samples system time or uptime before and after delay functions, potentially calculating time discrepancies.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of commands related to system time or uptime enumeration (e.g., 'systeminfo'). Correlate execution times of such commands with any observed delays or subsequent activities. Identify suspicious sequences where enumeration occurs after delays. Use correlation analysis to find relationships between timing enumeration commands and other discovery/evasion techniques."
          },
          "Discovery activities (e.g., system information gathering commands) occurring only after a significant delay from initial process execution or triggered by specific time conditions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events indicating discovery activity (e.g., network scanning tools, 'whoami', 'ipconfig'). Analyze the time difference between the creation of the initial process (potential malware dropper/payload) and the execution of these discovery commands. Flag instances where discovery activities occur only after a significant or unusual delay, potentially triggered by specific conditions. Use descriptive statistics to baseline typical execution delays for legitimate processes and identify outliers."
          }
        }
      }
    }
  }
]