[
    {
        "information_requirement": "Is the adversary attempting to degrade or block endpoint service availability?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1499",
                "name": "Endpoint Denial of Service",
                "evidence": [
                    {
                        "description": "Network traffic targeting critical endpoints originating from IP addresses known to be part of a botnet or associated with DoS-for-hire services.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join source IP addresses from Zeek conn.log with a high-confidence, frequently updated threat intelligence feed of known botnet C2s, compromised hosts used in DDoS attacks, and DoS-for-hire infrastructure. Alert on any matching traffic directed at critical service ports and investigate for DoS activity."
                    },
                    {
                        "description": "Execution of known DoS attack tools on an endpoint, or network traffic patterns matching the specific signatures of known DoS attacks (e.g., Slowloris, specific amplification attack formats).",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek weird.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On endpoints, monitor process creation events (Windows Event ID 4688) for the execution of file names or command-line arguments associated with known DoS tools (e.g., loic.exe, hping3). On the network, analyze Zeek conn.log for patterns characteristic of specific attacks, such as an abnormally high number of connections in a 'half-open' state (SYN_SENT) indicative of a SYN flood, or many incomplete HTTP requests held open (Slowloris). Correlate small outbound requests to UDP services (DNS, NTP) with large inbound responses to the victim endpoint to detect amplification attacks. Use regular expressions or specific protocol analyzers to detect these patterns."
                    },
                    {
                        "description": "Anomalous resource consumption (CPU, Memory, Disk I/O) on an endpoint, leading to service degradation or system unresponsiveness.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Performance Counters"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor system performance counters (e.g., '% Processor Time', 'Memory\\Available MBytes', 'PhysicalDisk\\Avg. Disk Queue Length') on critical endpoints. Establish a dynamic baseline of these metrics using historical data. Use time series analysis (e.g., ARIMA, Exponential Smoothing) or statistical process control charts to detect significant, sustained deviations from the norm. Correlate periods of high resource usage with specific processes (via Windows Event ID 4688) to identify the source of the resource exhaustion."
                    },
                    {
                        "description": "A statistically significant increase in application or service crashes, hangs, or unexpected termination events on a critical endpoint.",
                        "data_sources": [
                            "Windows Event ID 1000",
                            "Windows Event ID 7031",
                            "Windows Event ID 7034"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate application and system error logs (Windows Event ID 1000 for application error, 7031 for service crash, 7034 for unexpected termination) per host. Calculate the rate of these events over time. Use statistical methods such as percentile-based thresholding (e.g., alert if error rate exceeds the 99th percentile of the historical baseline) or correlation analysis to detect an abnormal spike in errors. Investigate if error spikes correlate with resource utilization anomalies or anomalous network traffic to confirm a potential DoS attack."
                    },
                    {
                        "description": "An abnormally high volume of network connections or application-layer requests directed at a specific endpoint service, originating from one or many sources.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for connection rates and total data volume to critical service ports and Zeek http.log for application request rates. Establish baselines for these metrics per service. Use time series analysis and outlier detection (e.g., IQR, Z-score on connection rates per minute) to flag sudden, significant increases in traffic. Analyze the entropy of source IPs associated with the traffic surge; a sustained high rate with low source IP entropy may indicate a single-source DoS, while high entropy suggests a distributed DoS (DDoS) attack."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
