[
  {
    "Is the adversary attempting to evade defenses by detecting virtualization or sandboxes? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497.001 - System Checks": {
          "Execution of commands or scripts querying system information or registry keys known to reveal virtualization.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing keywords or patterns associated with VME detection queries (e.g., 'wmic', 'systeminfo', 'Get-VM', specific registry paths like HKLM\\HARDWARE\\DESCRIPTION\\System\\CentralProcessor\\0). Use frequency analysis on specific command executions or parameters to identify rare occurrences."
          },
          "Access attempts or checks for files, directories, or hardware properties specific to virtualized environments.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation or Windows Event ID 4663 for file/directory access attempts targeting paths or filenames commonly found in VMEs (e.g., 'C:\\Program Files\\VMware', 'C:\\Program Files\\VirtualBox', specific driver files). Correlate with processes known to perform VME checks."
          }
        }
      }
    }
  },
  {
    "Is the adversary performing system checks to discover the execution environment? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497.001 - System Checks": {
          "Multiple system discovery commands (e.g., systeminfo, query registry, network config) executed in rapid succession by an unusual process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of Windows Event ID 4688 events for the same process executing multiple discovery commands (e.g., 'systeminfo', 'ipconfig', 'netstat', 'reg query') within a short time frame. Use time series analysis or sequence analysis to identify bursts of discovery activity inconsistent with normal user or system processes."
          },
          "Unusual network traffic patterns or connections to potentially VME-specific I/O ports or services.": {
            "Data": "Zeek conn.log, Zeek dpd.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections on unusual ports (e.g., VMWare backdoor port 0x5658, often seen as 22180 in logs) or exhibiting suspicious protocol behavior (e.g., unusual DPD detections in zeek dpd.log). Analyze connection metadata (volume, frequency, source/destination) and use correlation analysis to link network activity to potential VME checks."
          }
        }
      }
    }
  }
]