[
    {
        "information_requirement": "Is the adversary attempting to cause a denial of service via network flooding?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1498.001",
                "name": "Direct Network Flood",
                "evidence": [
                    {
                        "description": "Network traffic associated with a suspected flood event originates from IP addresses or subnets blacklisted by threat intelligence feeds as sources of DDoS attacks or known botnet participants.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Integrate high-confidence, frequently updated threat intelligence feeds identifying IPs/subnets known for malicious activity, particularly DDoS or botnet participation. Correlate source IP addresses from high-volume incoming traffic (Zeek conn.log) against these blacklists in near real-time. Calculate the percentage of anomalous traffic originating from blacklisted sources. Use this correlation to prioritize mitigation strategies and validate behavioral alerts. Maintain descriptive statistics on traffic volume from matched IPs."
                    },
                    {
                        "description": "Detection of network traffic patterns matching signatures of known direct flood attack tools or techniques, such as specific packet constructions, unusual protocol options, or fixed packet sizes/rates characteristic of particular flood types (e.g., UDP fragment floods, specific TCP flag attacks beyond SYN floods).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek notice.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for packet characteristics (e.g., size, TTL, IP flags, TCP options, UDP length) and inter-packet timing. Compare these against a maintained library of known DDoS tool signatures and attack patterns (e.g., unusual IP fragmentation patterns, specific TCP flag combinations like XMAS scans used in floods, non-standard ICMP message types/sizes at high rates). Utilize Zeek notice.log for pre-built detections of protocol anomalies (e.g., `PacketFilter::Fragment_Overlap`). Implement custom Zeek scripts or rules to detect specific flood patterns (e.g., constant packet rate from many sources, specific payload content if unencrypted). Use correlation analysis to link pattern detection with volumetric anomalies."
                    },
                    {
                        "description": "An abrupt and sustained surge in network traffic volume (bits per second, packets per second) or connection rate (connections per second) targeting specific internal services, hosts, or entire network segments, significantly exceeding established operational baselines.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor key metrics from Zeek conn.log: total bytes, packet counts, and new connection establishments per unit of time (e.g., 1-second, 10-second, 1-minute intervals), segmented by destination IP/port and overall network ingress points. Establish dynamic baselines for these metrics using historical data and statistical methods (e.g., exponential smoothing, seasonal decomposition, moving averages). Trigger alerts when current traffic significantly deviates from baselines (e.g., >3 standard deviations, or exceeding the 99th percentile of historical values for a sustained period). Use time series analysis and linear regression to identify anomalous spikes and trends."
                    },
                    {
                        "description": "A significant deviation in the normal distribution of network traffic characteristics, such as an anomalous spike in a specific protocol (e.g., UDP, ICMP), unusual source port distribution, or a shift in traffic geolocation, targeting specific services.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile baseline network traffic by protocol distribution (TCP, UDP, ICMP percentages), common source/destination ports, and source IP geolocation. Monitor Zeek conn.log to detect shifts in these distributions in near real-time. Calculate entropy of protocols, source ports, and geolocations; a sudden decrease in entropy for protocols (one protocol dominates) or source ports, or a shift in dominant geolocations, can indicate an attack. Use Chi-squared tests or Kullback-Leibler divergence to compare current traffic distributions against historical norms for targeted services and generate alerts on significant deviations."
                    },
                    {
                        "description": "An abnormally high ratio of unique source IP addresses to a single destination IP address/port or a small set of targeted services, coupled with low data transfer per source, indicative of a distributed denial of service (DDoS) attack.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Within short, rolling time windows (e.g., 10-60 seconds), monitor Zeek conn.log to count unique source IP addresses connecting to specific destination IP/port pairs or subnets. Calculate the ratio of unique source IPs to destination services. Concurrently, analyze average bytes/packets per source IP for these connections. A sharp increase in this source IP to destination ratio, especially when combined with low average data per source, strongly suggests a DDoS. Use descriptive statistics (mean, median of this ratio over time) and percentile-based thresholds (e.g., 95th percentile) to detect anomalies and trigger alerts."
                    },
                    {
                        "description": "A rapid increase in incomplete TCP sessions (e.g., SYN floods), or a high volume of TCP packets with anomalous flag combinations or sequence numbers, targeting specific services.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek notice.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log `history` or `state` fields to monitor the rate of connections remaining in a SYN-sent (S0, S1) or half-open state without progressing to established (SF). A sudden spike in such connections to a specific port indicates a SYN flood. Additionally, monitor for high volumes of TCP packets with unusual flags (e.g., all flags set, FIN/URG/PSH without ACK in initial packets) or out-of-state RST packets, which can be indicative of other TCP-based floods or reconnaissance. Utilize Zeek's `Scan::SYN_Flood`, `TCP::Useful_SYN_ACK_With_Data_Not_Processed`, and other relevant notices from Zeek notice.log. Employ time series analysis on these metrics to detect sharp increases beyond baseline levels using Inter-Quartile Range (IQR) or standard deviation thresholds."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
