[
  {
    "Is the adversary attempting to cause denial of service by exhausting service resources? (TA0040 - Impact)": {
      "Indicators": {
        "T1499.002 - Service Exhaustion Flood": {
          "Sudden, high volume of network traffic to specific service ports (e.g., HTTP/S ports, DNS) originating from multiple external IP addresses.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for spikes in connection rates or request volumes targeting key service ports on exposed systems. Use time series analysis to detect sudden, statistically significant increases in traffic volume above a rolling baseline or historical norm for specific ports/services."
          },
          "High number of unusual requests or protocol-specific anomalies targeting service resources (e.g., SSL renegotiation requests, malformed requests) impacting service availability or performance.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn.log, ssl.log, http.log) for patterns indicative of resource exhaustion attacks. Look for a high frequency of SSL renegotiation attempts in ssl.log or an unusually high number of specific request types/patterns in http.log targeting service endpoints. Employ correlation analysis to link high request rates from single/multiple sources to performance degradation observed via external monitoring."
          },
          "Signs of service degradation or unresponsiveness (e.g., increased connection duration, transaction timeouts, HTTP errors) on the targeted service from Zeek logs.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections to the targeted service's ports. Calculate metrics such as average connection duration, average HTTP response time, and frequency of connection resets or HTTP error codes (e.g., 5xx errors). Use statistical process control or time series analysis to identify statistically significant increases in these metrics compared to established baselines, indicating potential service degradation due to exhaustion."
          },
          "Sudden increase in the rate of new connections or the number of unique source IP addresses attempting to connect to the targeted service.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for the targeted service's ports. Calculate the rate of new connection attempts per time unit (e.g., connections/second) and the count of unique source IP addresses seen attempting connections within a sliding time window (e.g., 1 minute). Use time series analysis or anomaly detection techniques (e.g., using IQR or z-scores on historical rates/counts) to flag sudden spikes in either the connection rate or the number of unique sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]