[
  {
    "Is the adversary attempting to evade defenses by detecting virtualization or sandboxes? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497.001 - System Checks": {
          "Execution of commands or scripts querying system information or registry keys known to reveal virtualization.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing keywords or patterns associated with VME detection queries (e.g., 'wmic', 'systeminfo', 'Get-VM', specific registry paths like HKLM\\\\HARDWARE\\\\DESCRIPTION\\\\System\\\\CentralProcessor\\\\0). Use frequency analysis on specific command executions or parameters to identify rare occurrences, especially when run by unusual processes."
          },
          "Access attempts or checks for files, directories, or hardware properties specific to virtualized environments.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation or Windows Event ID 4663 for file/directory access attempts targeting paths or filenames commonly found in VMEs (e.g., 'C:\\\\Program Files\\\\VMware', 'C:\\\\Program Files\\\\VirtualBox', specific driver files like 'vboxguest.sys'). Correlate access/execution events with processes known to perform VME checks. Use statistical analysis (e.g., count) to identify systems with an unusually high number of such checks."
          },
          "Discovery of processes or services specifically associated with virtualization or sandboxing tools.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process names and command lines, and Event IDs 7036 (Service Started/Stopped) / 7045 (Service Installed) for service names containing keywords related to known virtualization/sandboxing platforms (e.g., 'vmtools', 'vboxservice', 'sandboxie', 'virtdetect'). Use frequency analysis to baseline normal processes/services per host or group and flag rare or unexpected occurrences, especially if observed in conjunction with other suspicious activity."
          },
          "Querying of network adapter properties or MAC addresses often used by virtualization platforms.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines attempting to query network adapter information using tools like 'ipconfig /all', 'Get-NetAdapter', 'wmic nic get MACAddress', etc. Identify command execution by unusual processes. If MAC address or adapter name data can be derived or correlated from other logs, compare against known vendor/VME MAC ranges (e.g., VMware: 00:50:56, VirtualBox: 08:00:27, Hyper-V: 00:15:5D). Use correlation analysis to link command execution with specific network adapter details."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary performing system checks to discover the execution environment? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497.001 - System Checks": {
          "Multiple system discovery commands (e.g., systeminfo, query registry, network config) executed in rapid succession by an unusual process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of Windows Event ID 4688 events for the same process executing multiple discovery commands (e.g., 'systeminfo', 'ipconfig', 'netstat', 'reg query') within a short time frame. Use time series analysis or sequence analysis to identify bursts of discovery activity inconsistent with normal user or system processes. Flag processes exhibiting a high frequency of distinct discovery command executions within a defined time window."
          },
          "Unusual network traffic patterns or connections to potentially VME-specific I/O ports or services.": {
            "Data": "Zeek conn.log; Zeek dpd.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections on unusual ports (e.g., VMWare backdoor port 0x5658, often seen as TCP 22180 in logs) or exhibiting suspicious protocol behavior (e.g., unusual DPD detections in zeek dpd.log). Analyze connection metadata (volume, frequency, source/destination IPs). Use correlation analysis to link suspicious network activity on these ports to internal hosts potentially performing VME checks or being probed by malware."
          },
          "Attempts to access or list files/directories with names indicative of analysis environments (e.g., 'malware', 'sample', 'sandbox').": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access attempts (specifically ReadData/ListDirectory operations) targeting file or directory names containing keywords like 'malware', 'sample', 'hash', 'sandbox', 'analysis'. Additionally, monitor Windows Event ID 4688 for execution of commands (`dir`, `ls`, `Get-ChildItem`, `find`) with arguments targeting such paths or filenames. Use frequency analysis to identify rare access patterns or command arguments compared to baseline."
          },
          "Execution of commands or scripts querying the presence or state of hardware components often absent or virtualized in VMEs (e.g., audio devices, specific sensors).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines executing queries via `wmic`, `Get-PnpDevice`, `powershell` scripts, or other utilities attempting to enumerate or check the status of specific hardware components like audio devices ('Win32_SoundDevice'), temperature sensors ('Win32_TemperatureProbe'), fan ('Win32_Fan'), or other sensors often virtualized or absent in test environments. Flag executions by unusual processes and identify hosts where such checks are frequently performed."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]