[
    {
        "information_requirement": "Is the adversary attempting to evade defenses related to virtualization or sandboxing?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1497",
                "name": "Virtualization-Sandbox Evasion",
                "evidence": [
                    {
                        "description": "Execution of files with hashes known to be sandbox evasion tools or malware with specific T1497 evasion modules.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate the file hash (e.g., SHA256) of every new process captured in Windows Event ID 4688 against a cyber threat intelligence feed of known sandbox evasion tools (e.g., Pafish, VBoxHardenedLoader) or malware with documented T1497 capabilities. An alert on any match is a high-confidence indicator of an evasion attempt."
                    },
                    {
                        "description": "A process querying specific file paths, registry keys, MAC address prefixes, or WMI objects notoriously associated with virtualized or analysis environments.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process command lines (Windows Event ID 4688) for queries targeting a maintained list of known virtualization/sandbox artifacts. This includes registry keys (e.g., HKLM\\HARDWARE\\DEVICEMAP\\Scsi, HKLM\\SOFTWARE\\Oracle\\VirtualBox), file paths (e.g., C:\\windows\\System32\\Drivers\\Vmmouse.sys), MAC address prefixes (e.g., 08:00:27 for VirtualBox), and WMI queries (e.g., 'SELECT * FROM Win32_BIOS WHERE SerialNumber CONTAINS \"VMware\"'). Use correlation analysis to link multiple distinct checks from the same process to increase confidence."
                    },
                    {
                        "description": "A process that terminates itself without performing its apparent core function after detecting virtualization or sandbox artifacts.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify processes that execute one or more known virtualization/sandbox checks (from pattern-based detection) and then terminate within a very short time window (e.g., < 5 seconds) without creating child processes, writing significant data to disk, or initiating network connections. Use descriptive statistics to establish a baseline for normal process execution times and behaviors to identify these 'self-terminating' outliers. This behavior is highly indicative of successful evasion where the malware decides not to run."
                    },
                    {
                        "description": "A process that delays its primary execution or network activity, often entering a sleep state, after performing environment checks to wait out automated sandbox analysis timeouts.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate host-based environment checks (identified from pattern-based detections) with subsequent process and network activity. Use time series analysis of Windows Event ID 4688 and Zeek conn.log data to identify processes that perform a burst of system queries upon launch, followed by an unusual period of inactivity (e.g., > 60 seconds of no CPU/network activity, which could indicate a sleep call), and then initiate network connections or file modifications. Use correlation analysis to link the initial checks with the delayed malicious activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary conducting discovery to identify virtualization or analysis environments?",
        "tactic_id": "TA0007",
        "tactic_name": "Discovery",
        "indicators": [
            {
                "technique_id": "T1497",
                "name": "Virtualization-Sandbox Evasion",
                "evidence": [
                    {
                        "description": "Execution of specific commands or scripts containing unique strings known to be from public or private sandbox discovery tools.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process command lines (Windows Event ID 4688) for unique, high-fidelity strings or command combinations found in known discovery/evasion scripts (e.g., Pafish, Al-Khaser, 'Find-AVSignature.ps1'). Maintain a library of these high-confidence selectors and use regular expression matching for detection. An alert on a match is a strong indicator of active discovery."
                    },
                    {
                        "description": "A process enumerating running processes, services, or installed software and explicitly filtering the output for keywords related to security, analysis, and debugging tools.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for command lines that combine an enumeration command (e.g., 'tasklist', 'Get-Process', 'sc query', 'wmic product get name') with a filtering mechanism (e.g., a pipe `|` to 'findstr' or 'Select-String') that searches for a list of keywords associated with security tools (e.g., 'wireshark', 'sysmon', 'procmon', 'x64dbg', 'windbg', 'Fiddler'). Identify non-standard processes or scripts executing such chained commands using frequency analysis compared to a baseline of administrative activity."
                    },
                    {
                        "description": "A process performing an anomalously high number of diverse environment checks to build a 'humanity score' before execution, such as querying system uptime, mouse position, recent user documents, and screen resolution.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze sequences of Windows Event ID 4688 events to identify a single process performing a wide variety of distinct environment checks in a short period after launch. These checks include user activity (e.g., checking 'Recent' docs, querying mouse pointer position), system configuration (e.g., screen resolution, CPU core count, disk size), and uptime (`systeminfo | find \"System Boot Time\"`). Use entropy measures on the types of checks performed by a process in its first few seconds of life; a high entropy score compared to a baseline of normal applications indicates this broad discovery behavior."
                    },
                    {
                        "description": "A process initiating a low-volume network connection to a public time server or well-known domain to check for internet connectivity, a common sandbox test, without further meaningful data exchange.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688) with subsequent network activity. Monitor Zeek dns.log and conn.log for processes that make a single DNS query for a common, high-reputation domain (e.g., google.com, ntp.org) followed by a very small TCP or UDP connection (e.g., <1KB total bytes) with no further communication. Use descriptive statistics (mean, median, IQR on connection byte counts) to find sessions with anomalously low data transfer volumes. This 'canary' network check is a behavioral indicator of a process testing the environment's network connectivity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
