[
  {
    "Is the adversary impacting system or service availability by hijacking resources? (TA0040 - Impact)": {
      "Indicators": {
        "T1496 - Resource Hijacking": {
          "Anomalous process resource consumption (CPU, memory) by unfamiliar processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on endpoints and servers. Identify newly created or unfamiliar processes. Cross-reference process names/paths against known legitimate software lists. While direct resource usage isn't in Event ID 4688, flag suspicious processes identified. For flagged processes, initiate further investigation using other tools or logs (if available) to check resource utilization. Use descriptive statistics to establish baseline process behavior and identify outliers in execution frequency or parent-child relationships for unusual processes."
          },
          "Excessive or unusual network traffic patterns associated with resource hijacking activities (e.g., cryptocurrency mining pools, proxy networks).": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for connections to known cryptocurrency mining pool IPs/domains or proxy network infrastructure from internal hosts. Calculate traffic volume, duration, and frequency to these destinations. Use time series analysis to detect sudden increases or persistent high volume traffic to such destinations. Employ correlation analysis to link specific internal source IPs/ports to suspicious network traffic patterns."
          },
          "Presence or execution of known resource hijacking software processes or files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Create a watch list of known process names, command-line arguments, or file paths associated with cryptocurrency miners or other resource hijacking tools (e.g., xmrig, ethminer, specific proxy software). Flag any event where the process name or command line matches an entry in the watch list. Calculate the frequency of execution for flagged processes and investigate persistent or recurring instances using descriptive statistics."
          },
          "Network traffic to common cryptomining ports from internal hosts with high outbound data volume.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound connections on common cryptomining ports (e.g., TCP 3333, 4444, 14444, 8008, 8080, 9000) from internal hosts. Use descriptive statistics and percentile analysis on the 'resp_bytes' field (bytes sent from the internal host) to identify internal hosts exhibiting significantly higher outbound traffic volume than their baseline or peer groups when connecting to these ports. Investigate hosts showing persistently high outbound traffic to such ports."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]