[
  {
    "Has the adversary attempted to impact external systems through defacement? (TA0040 - Impact)": {
      "Indicators": {
        "T1491.002 - External Defacement": {
          "Unplanned or unauthorized changes detected on external-facing web pages.": {
            "Data": "Windows Event ID 4663; Zeek fileinfo.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor server logs (Windows Event ID 4663 for file modifications) and network file logs (Zeek fileinfo.log) for unexpected file modifications in web root directories. Analyze timestamp and user/process associated with modifications. Use time series analysis on file modification events to detect abnormal spikes or patterns in activity."
          },
          "Application logs showing abnormal behavior or network traffic indicating exploitation attempts (e.g., SQL injection attempts).": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for requests containing suspicious patterns indicative of exploitation (e.g., SQL injection keywords, path traversal sequences, unusual HTTP methods). Correlate these requests with source IP addresses and investigate frequency or volume anomalies using descriptive statistics."
          },
          "Suspicious process execution on the web server (e.g., uncommon shells, file transfer utilities, or scripts) immediately preceding or coinciding with web file modifications.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) events on web servers with Windows Event ID 4663 (File Object Access, specifically write or modify operations) events occurring shortly after process creation in web root directories. Investigate suspicious processes (e.g., powershell, cmd.exe, uncommon executables) or unusual command line arguments. Use correlation analysis to find statistically significant associations between specific process creations and subsequent file modifications in sensitive web folders."
          },
          "Large or unusual HTTP POST requests targeting web servers, potentially indicating web shell uploads or data delivery for defacement.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for HTTP POST requests targeting web servers. Analyze the size of the request body and the target URL. Flag POST requests with unusually large body sizes (e.g., exceeding typical form submissions or file uploads) or targeting unexpected file types/locations within the web root. Correlate with Zeek conn.log to examine duration and total bytes transferred in the session. Use statistical thresholds (e.g., IQR or percentiles of request body size) to identify outliers compared to baseline web traffic."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]