[
  {
    "Is the adversary causing negative impact via cloud service hijacking? (TA0040 - Impact)": {
      "Indicators": {
        "T1496.004 - Cloud Service Hijacking": {
          "High volume of outbound connections or data transfer attempts via messaging ports/protocols from potentially compromised internal systems or cloud platform egress points, indicative of spam or messaging abuse.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and smtp.log for unusually high volume of outbound connections to known messaging service ports/domains (e.g., 25, 465, 587). Use time series analysis to detect spikes in connection count or data volume originating from internal hosts or cloud egress IPs. Identify source IPs/hosts and correlate with known internal systems or cloud egress points. Calculate entropy of destination email addresses/domains if available to flag unusual patterns indicative of bulk messaging."
          },
          "Unusual network traffic patterns (e.g., large data transfers, connections to unexpected endpoints) from systems interacting with cloud services, indicative of resource misuse or LLMJacking.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for large data transfers or high connection counts to cloud service endpoints (e.g., AI model APIs, storage services) not matching expected usage patterns. Apply statistical methods (e.g., IQR, box plots) on data volume (bytes) and connection frequency per host/destination to identify outliers indicative of resource abuse like LLMJacking or data exfiltration via cloud services. Correlate with threat intelligence for known malicious cloud endpoints."
          },
          "Spikes in cloud service API calls or usage metrics (e.g., number of messages sent, compute time consumed) significantly exceeding baseline or quota limits.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections and requests to known cloud service API endpoints (e.g., AWS SES/SNS API endpoints, OpenAI/LLM endpoints). Track request volume and response data volume by source host/IP and destination API endpoint. Establish baseline usage patterns using time series analysis per host/service. Identify significant positive deviations or sudden spikes in usage that exceed established thresholds or known service quotas, indicating potential abuse like large-scale messaging or compute resource consumption beyond normal operations."
          },
          "Anomalous authentication events or API key usage associated with cloud service accounts used for hijacking.": {
            "Data": "Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for authentication attempts or API key usage patterns associated with cloud service providers (AWS, GCP, Azure, specific SaaS apps like SendGrid) by internal hosts. Correlate with Windows Event ID 4624 (Successful Logon) on internal systems used to access cloud services to identify associated user accounts. Flag authentication events or API key usage originating from unusual source IPs (using geolocation), or occurring at anomalous times (using frequency analysis/percentiles) for accounts observed making high-volume or unusual cloud service calls. Identify API key usage from unexpected internal hosts or devices."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]