[
  {
    "Is the adversary causing network impact through bandwidth hijacking? (TA0040 - Impact)": {
      "Indicators": {
        "T1496.002 - Bandwidth Hijacking": {
          "Sustained, abnormally high outgoing network traffic from internal hosts or network segments.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, focusing on `orig_bytes` and `resp_bytes`. Calculate the total outgoing bandwidth usage per internal host or network segment over time intervals (e.g., hourly, daily). Establish baseline bandwidth usage per host/segment using historical data and time series analysis. Identify outliers and significant deviations from the baseline using statistical methods (e.g., Z-score, control charts) to detect abnormally high outgoing traffic."
          },
          "Connections from internal hosts to external IP addresses or domains associated with known botnet infrastructure, proxyware services, or widespread scanning activity.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log. Extract destination IP addresses and queried domains for outgoing connections. Cross-reference these destinations against curated threat intelligence feeds for known botnet C2s, proxyware services, or IP ranges associated with malicious scanning. Use inner join operations to identify matches. Investigate connections to flagged destinations."
          },
          "Execution of processes on internal hosts known to be associated with botnet activity, proxyware, or resource-intensive network tasks.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for the creation of processes with names or command-line arguments known to be associated with cryptocurrency miners, proxyware clients, or common botnet malware components. Correlate these process executions with simultaneous increases in outgoing network traffic from the host using Zeek conn.log. Use time series analysis on network data segmented by host and compare periods of process execution to baseline network usage."
          },
          "Presence of peer-to-peer (P2P) network connections or unusual outbound connection patterns (e.g., scanning activity) from internal hosts.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections using ports commonly associated with P2P protocols (e.g., BitTorrent defaults) or for hosts making connections to an unusually large and diverse number of external IPs/ports within a short period (indicative of scanning). Use descriptive statistics (count of distinct IPs/ports connected to per host per time interval) and entropy measures (low destination IP entropy can indicate scanning). Correlate with Windows Event ID 5156 to identify the process initiating these connections on the host."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]