[
  {
    "Is the adversary attempting to evade defenses related to virtualization or sandboxing? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497 - Virtualization-Sandbox Evasion": {
          "Process execution querying system properties or registry keys indicative of virtualization.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing keywords or tool names associated with querying system properties (e.g., 'systeminfo', 'wmic', 'reg query') and filter for those querying common virtualization artifacts (e.g., 'VMware', 'VirtualBox', 'VBOX'). Identify frequent occurrences of these commands from single processes/executables. Use frequency analysis to find rare command combinations or sequences."
          },
          "Network connections exhibiting unusual delays or occurring after suspicious system checks.": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections from hosts exhibiting potential T1497 behavior (e.g., where Event ID 4688 analysis indicates environment checks). Use time series analysis and correlation analysis to identify connections that occur only after specific system checks are detected or exhibit unusual delays compared to normal host behavior."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary conducting discovery to identify virtualization or analysis environments? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497 - Virtualization-Sandbox Evasion": {
          "Process execution attempting to enumerate or identify security monitoring tools installed on the system.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing keywords or tool names associated with listing processes, files, or services (e.g., 'tasklist', 'wmic process', 'Get-Process', 'dir', 'sc query') and filter for those containing keywords related to security or analysis tools (e.g., 'wireshark', 'sysmon', 'procmon', 'debugger', 'sandbox'). Use frequency analysis of queried tool names and look for sudden spikes in related process creations."
          },
          "Process execution attempting to identify recent user activity or session details.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing keywords or tool names associated with querying user activity (e.g., 'query user', 'qwinsta', 'wevtutil', 'Get-WinEvent', accessing recent files/directories). Analyze the frequency and clustering of these events from suspicious processes using descriptive statistics."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]