
[
  {
    "Has the adversary impacted system availability by corrupting firmware? (TA0040 - Impact)": {
      "Indicators": {
        "T1495 - Firmware Corruption": {
          "Transfer or execution of tools with file hashes or names known to be associated with malicious firmware modification or rootkits.": {
            "Data": "Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Zeek files.log for files transferred over network protocols (e.g., HTTP, FTP) whose MD5/SHA hashes match a threat intelligence list of known malicious firmware modification tools or rootkits (e.g., Lojax, TrickBoot components). Concurrently, monitor Windows Event ID 4688 for the creation of processes whose names match these known malicious tools. An alert from either source should be considered a high-fidelity indicator of an attempted firmware attack."
          },
          "Execution of legitimate system or vendor utilities capable of modifying firmware with suspicious command-line arguments, from non-standard paths, or outside of authorized change windows.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a baseline of normal execution for legitimate firmware update utilities (e.g., vendor-specific flashing tools, `flashrom.exe`, `fwupdmgr.exe`). Monitor Windows Event ID 4688 for executions of these tools from unusual file paths (e.g., user profile directories, temporary folders) or with suspicious command-line parameters (e.g., writing an unrecognized firmware file, using flags to disable security checks). Use frequency analysis to flag executions on systems where updates are not expected or correlation with change management data to identify executions outside of authorized change windows."
          },
          "A logical sequence of events on a host involving hardware reconnaissance, acquisition of a tool, and privileged execution followed by system instability.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 1074; Windows Event ID 6006",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and hunt for a sequence of events on a single host within a short time window (e.g., 1-2 hours): 1) Execution of hardware discovery commands (e.g., `wmic baseboard get`, `dmidecode`) seen in Windows Event ID 4688. 2) A network connection to an uncategorized or suspicious external IP to download an executable (Zeek conn.log). 3) Execution of a known firmware utility or suspicious process with SYSTEM-level privileges (Event ID 4688). 4) An unexpected shutdown or crash event (Event ID 1074, 6006). Use correlation analysis to link these steps into a high-confidence alert for a potential firmware corruption attack chain."
          },
          "Anomalous network connections to network device management interfaces, involving unusual protocols or data volumes, that precede device failure or unresponsiveness.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal management traffic to network devices (e.g., switches, routers, firewalls). Monitor Zeek conn.log for anomalies such as connections using insecure or unexpected protocols (e.g., TFTP where only SSH is authorized), connections originating from unauthorized internal subnets, or unusually large data transfers to a device's management interface. Use time series analysis to detect spikes in management traffic volume or duration. Correlate these network anomalies with device syslog reports of reboots, configuration changes, or unresponsiveness to identify potential network device firmware attacks."
          },
          "A statistically significant cluster of systems experiencing unexpected crashes, boot failures, or reboots in a coordinated manner without a corresponding authorized patching event.": {
            "Data": "Windows Event ID 1074; Windows Event ID 6005; Windows Event ID 6006",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate system shutdown, startup, and crash events (Windows Event IDs 1074, 6005, 6006) across the enterprise into a centralized logging platform. Use statistical methods, such as a box-plot or percentile analysis on the count of unexpected reboots per hour, to identify a cluster of failures occurring in a short time frame across multiple systems. Compare the timestamps of any identified cluster against change management records for authorized firmware or OS updates. A spike in failures without a corresponding authorized change is a strong indicator of a widespread impact attack, such as coordinated firmware corruption. Use regression analysis to test for correlation between the failures and other suspicious activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
