[
    {
        "information_requirement": "Is the adversary impacting system or service availability through compute hijacking?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1496.001",
                "name": "Compute Hijacking",
                "evidence": [
                    {
                        "description": "Connections to known cryptocurrency mining pool domains/IPs or execution of processes matching known miner file hashes.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously compare DNS queries (Zeek dns.log) and outbound network connections (Zeek conn.log) against a high-fidelity, frequently updated list of known cryptocurrency mining pool domains and IP addresses. Additionally, compare file hashes of all newly created processes (from Windows Event ID 4688 enrichment) against a threat intelligence feed of known cryptominer executable hashes. Alert on any match."
                    },
                    {
                        "description": "Execution of processes with command-line arguments or configuration file content characteristic of cryptocurrency mining software.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) for command-line arguments commonly used by cryptomining software, such as '-o', '--url', '-u', '--user', '-p', '--pass', '--threads', '--cpu-affinity', and '--algo'. Use regular expression matching to detect these patterns even if the process name is obfuscated (e.g., 'svchost.exe'). Correlate findings with unexpected parent processes like 'wscript.exe', 'powershell.exe', or web server processes."
                    },
                    {
                        "description": "Sustained and anomalously high CPU utilization on a host that is not correlated with legitimate, expected business applications or workloads.",
                        "data_sources": [
                            "Windows Performance Counters",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Collect CPU utilization performance counters (e.g., Processor\\% Processor Time) at regular intervals. Establish a baseline of normal CPU usage for hosts or groups of hosts during different time periods (e.g., business hours vs. off-hours). Use time series analysis (e.g., moving averages, Z-score) to detect hosts with sustained CPU usage significantly above their baseline (e.g., >80% for >30 minutes) without corresponding legitimate high-compute tasks. Correlate high CPU periods with process creation events (Windows Event ID 4688) to identify the responsible process."
                    },
                    {
                        "description": "A sequence of events indicating defense evasion followed by suspicious compute and network activity, such as the termination of security software followed by high CPU usage and connections to unknown external services.",
                        "data_sources": [
                            "Windows Event ID 4689",
                            "Windows Performance Counters",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlated alert for a sequence of events on a single host within a short time window (e.g., 15 minutes): 1. Termination of a known security or monitoring process (Windows Event ID 4689). 2. A sustained spike in CPU utilization above the established baseline (Performance Counters). 3. New, long-lived outbound network connections to low-reputation or newly-seen IP addresses (Zeek conn.log). Use correlation analysis to link these disparate data sources by host and timestamp to detect the full TTP chain."
                    },
                    {
                        "description": "An increased rate of application crashes, system instability events, or thermal warnings on hosts, correlated with periods of high resource utilization.",
                        "data_sources": [
                            "Windows System Event Logs",
                            "Windows Application Event Logs",
                            "Windows Performance Counters"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows System and Application Event Logs for an increased frequency of events indicative of instability, such as application hangs (Event ID 1002), crashes (Event ID 1000), service failures (Service Control Manager events), or hardware-related thermal/power warnings. Use time series analysis to detect anomalous spikes in these event types. Correlate the timing of these instability events with periods of sustained high CPU utilization (from Performance Counters) on the same host to attribute the impact to resource exhaustion, likely caused by compute hijacking."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
