[
  {
    "Is the adversary attempting to evade defenses using user activity checks? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497.002 - User Activity Based Checks": {
          "Process activity monitoring user input (mouse/keyboard) at unusual rates or lack of input.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command lines or parent processes indicative of monitoring user input or unusual foreground activity checks. Analyze process execution frequency and duration using time series analysis or descriptive statistics. Look for processes exhibiting zero user input or extremely rapid, non-human-like input patterns (requires advanced analysis beyond standard logs, but flag suspicious processes)."
          },
          "Execution of suspicious code immediately following a specific user action on a file (e.g., macro execution after document close, file dropped after double-click).": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 4663 (File Object Access) involving common user document types (docx, xlsx, pdf) or script files. Look for new process creation immediately following read/write access to these files, especially if the parent process is an application like Word/Excel or a browser. Analyze event timestamps for tight temporal correlation."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary performing discovery using user activity checks? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497.002 - User Activity Based Checks": {
          "Process accessing user profile directories, browser history files, or common document locations in a suspicious manner.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4663 (File Object Access) and 4688 (Process Creation). Identify processes rapidly accessing multiple files within user profile directories (Desktop, Downloads, AppData, browser caches/histories) or program files often checked by malware. Use descriptive statistics to identify processes with unusually high file access counts in these areas or access patterns that deviate significantly from baseline."
          },
          "A sequence of rapid system information gathering commands or file access patterns characteristic of sandbox checks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious command-line arguments or sequences of discovery-related commands (e.g., system info, tasklist, netstat) executed by the same process in rapid succession. Analyze the frequency and timing of these command executions using time series analysis or correlation analysis to identify patterns indicative of automated discovery and checks within a short timeframe."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]