[
    {
        "information_requirement": "Is the adversary causing impact via SMS pumping?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1496.003",
                "name": "SMS Pumping",
                "evidence": [
                    {
                        "description": "SMS messages sent to phone numbers/prefixes known for SMS pumping fraud, or API/form requests from IP addresses/User-Agents linked to known pumping botnets.",
                        "data_sources": [
                            "Messaging Service API logs",
                            "Zeek http.log",
                            "Web application logs"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Cross-reference destination phone numbers from Messaging Service API logs against regularly updated lists of prefixes/numbers associated with SMS pumping fraud (e.g., from industry threat feeds, GSMA blocklists). Simultaneously, correlate source IP addresses and User-Agent strings from Zeek http.log or web application logs (for OTP/verification form submissions) against threat intelligence feeds of IPs/User-Agents known for SMS pumping or general botnet activity. Alert on any confirmed matches and investigate associated form submissions or API calls."
                    },
                    {
                        "description": "Repetitive, automated submission patterns to web forms (e.g., OTP, account verification) using tool-specific signatures, or execution of known SMS pumping scripts/tools on internal systems generating SMS requests.",
                        "data_sources": [
                            "Web application logs",
                            "Messaging Service API logs",
                            "Zeek http.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze web application logs for rapid, high-frequency submissions to OTP/verification forms. Look for patterns indicative of automation: requests from a single IP to the same form with slight variations in phone numbers (e.g., sequential, shared prefixes), or identical form data from multiple IPs. Check User-Agents in Zeek http.log for known bot/automation signatures. On servers handling these requests or making API calls, monitor Windows Event ID 4688 for execution of processes with names, hashes, or command-line arguments matching known SMS pumping tools/scripts. Correlate suspicious form submissions (e.g., using descriptive statistics on submission rates per IP) with bursts in Messaging Service API logs."
                    },
                    {
                        "description": "Anomalously high volume or rate of outbound SMS message requests originating from specific web forms, internal services, or messaging service API keys compared to established baselines.",
                        "data_sources": [
                            "Messaging Service API logs",
                            "Web application logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Messaging Service API logs and web application logs for outbound SMS requests. Establish baselines for normal SMS request rates per source IP, user session, API key, or specific web form endpoint using historical data. Calculate the rate of SMS requests over rolling time windows (e.g., 1-minute, 5-minute, 1-hour intervals). Identify statistically significant outliers or sudden, sustained increases in request volume using time series analysis (e.g., ARIMA, Holt-Winters decomposition) or percentile-based thresholding (e.g., requests exceeding the 99th percentile of the baseline). Examine Zeek conn.log for corresponding unusual connection patterns or volume to known messaging service API endpoints from internal hosts."
                    },
                    {
                        "description": "Unexpected and significant increase in messaging service costs attributable to SMS delivery, correlated with high API call volume, especially to phone numbers with unusual, high-risk, or geographically concentrated prefixes.",
                        "data_sources": [
                            "Billing/Cost data",
                            "Messaging Service API logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Integrate and monitor billing/cost data from messaging service providers for SMS services. Analyze for unexpected spikes in daily/hourly costs compared to historical averages using descriptive statistics and time series analysis. Correlate high-cost periods with Messaging Service API call volumes (from API logs) and Zeek conn.log data showing traffic to SMS provider APIs. Extract destination phone numbers from API logs during high-cost periods; use frequency distribution and prefix analysis (country codes, regional codes) to identify if costs are driven by messages to a concentrated set of unusual, international, or premium-rate number ranges. Calculate correlation coefficients between cost spikes and message volumes to specific prefixes."
                    },
                    {
                        "description": "SMS messages targeting an unusual geographic distribution of phone numbers or exhibiting an improbable signup/OTP request velocity from diverse geolocations, inconsistent with legitimate service usage patterns.",
                        "data_sources": [
                            "Messaging Service API logs",
                            "Web application logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze destination phone numbers in Messaging Service API logs to determine their country codes and, if possible, more granular regional prefixes. Establish a baseline of typical geographic distribution for legitimate SMS recipients. Monitor for significant deviations using statistical tests (e.g., chi-squared goodness-of-fit test for distribution changes) or by tracking the entropy of country codes/prefixes over time; a sudden decrease in entropy might indicate targeting of specific fraudulent prefixes. Correlate with web application logs (if user registration IP geolocation is captured) to detect 'impossible travel' scenarios for OTP requests (e.g., rapid requests for OTPs to phone numbers in different continents from IPs that also appear to jump geolocations rapidly within short timeframes)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
