```json
[
  {
    "Is the adversary attempting to impact system availability or functionality via OS exhaustion? (TA0040 - Impact)": {
      "Indicators": {
        "T1499.001 - OS Exhaustion Flood": {
          "High volume of SYN or ACK packets originating from IP addresses or subnets known to be sources of DoS attacks or part of botnets.": {
            "Data": "Zeek conn.log; Zeek tcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log (for SYN flood indicators like high rates of S0 state) and Zeek tcp.log (for ACK flood indicators like high rates of out-of-state ACKs). Correlate source IP addresses of high-volume traffic flows against a frequently updated cyber threat intelligence (CTI) feed of IPs/subnets known for DoS activity or associated with botnets. Use descriptive statistics (e.g., top N source IPs by packet/byte count) to identify primary contributors to flood traffic and check these against the CTI feed. Alert on sustained high-volume traffic from listed malicious sources targeting internal assets."
          },
          "Anomalous TCP characteristics such as non-randomized source ports or specific IP fragmentation patterns in a high volume of SYN or ACK packets, indicative of certain flood tools.": {
            "Data": "Zeek conn.log; Zeek tcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze high volumes of SYN packets (from Zeek conn.log by observing connection states and history, and Zeek tcp.log for packet flags) or ACK packets (from Zeek tcp.log) for patterns indicative of specific flood tools. This includes checking for: a) low entropy or unusual clustering in source port numbers (e.g., many connections from a narrow range of source ports, or a fixed source port seen in `id.orig_p` in Zeek conn.log), b) unusual or fixed TTL values (if derivable from packet traces or enhanced logging), c) fixed TCP window sizes (if available), or d) specific IP fragmentation patterns sometimes used by DoS tools. Maintain a library of such patterns from known DoS tools. Use frequency analysis and entropy measures on source ports from Zeek conn.log for identified high-volume streams."
          },
          "High volume of incoming SYN packets without corresponding SYN-ACK or ACK responses targeting specific endpoints or servers, leading to an accumulation of half-open connections.": {
            "Data": "Zeek conn.log; Zeek tcp.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connection attempts where `conn_state` is 'S0' (connection attempt seen, no reply from responder). Track high rates of 'S0' states or SYN packets (identified in Zeek tcp.log) that do not result in a SYN-ACK from the target or an ACK from the originator within a normal RTT window. Use time series analysis (e.g., moving averages, EWMA) on the count of SYN packets per second/minute to specific destination IPs/ports to detect sudden, sustained spikes. Calculate the ratio of SYN packets (or 'S0' states) to successfully established connections (e.g., 'SF' state); a sharp increase in this ratio for a target server indicates a SYN flood."
          },
          "High volume of incoming ACK packets targeting endpoints or servers for non-existent or closed TCP connections, forcing excessive OS state table lookups.": {
            "Data": "Zeek tcp.log; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek tcp.log for an abnormally high volume of ACK packets targeting internal endpoints/servers that do not correspond to any existing connection in the Zeek connection table (i.e., the `uid` in `tcp.log` does not map to an active `conn.log` entry, or ACKs arrive for connections with states like 'RSTO', 'RSTR', 'S2', 'S3', 'SHR' indicating termination or reset). Identify source IPs generating high volumes of such out-of-state ACKs. Use descriptive statistics (e.g., count of out-of-state ACKs per source IP per minute) and thresholding (e.g., >N ACKs/sec from a single source for non-established flows). Correlate with server CPU/memory telemetry, if available, to link ACK floods to resource exhaustion."
          },
          "Rapid and sustained increase in the number of concurrent half-open TCP connections (e.g., SYN_RECEIVED on server, or connection states like S0/S1 in Zeek conn.log) on targeted servers or critical services.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor the count of active connections in Zeek conn.log where `conn_state` is 'S0' (SYN sent, no reply from responder) or 'S1' (connection established, not terminated - often indicating SYN-ACK sent, awaiting final ACK). Group by destination IP and port. Use time series analysis (e.g., Holt-Winters) to establish baselines for concurrent half-open/pending connections for critical services and detect abnormal surges (e.g., exceeding 3 standard deviations above the mean or a high percentile like the 99th). This indicates the server's listen queue or connection table might be filling up due to SYN flood activity."
          },
          "Generation of specific system error events on targeted hosts indicating TCP/IP resource exhaustion, such as reaching limits on concurrent connection attempts, coinciding with network flood indicators.": {
            "Data": "Windows Event ID 4227; Windows Event ID 2019; Windows Event ID 2020; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor targeted Windows servers for specific event IDs related to network resource exhaustion: Windows Event ID 4227 (Tcpip: TCP/IP has reached the security limit imposed on the number of concurrent TCP connect attempts), Windows Event ID 2019 (Srv: The server was unable to allocate from the system paged pool), Windows Event ID 2020 (Srv: The server was unable to allocate from the system nonpaged pool). Correlate the timestamps of these critical host events with network-level observations of high-volume SYN/ACK floods or surges in half-open connections (identified from Zeek conn.log and Zeek tcp.log). A strong temporal correlation provides high confidence of an OS exhaustion attack impacting the host."
          },
          "Significant degradation or complete loss of service availability, measured by a sharp decrease in successfully established TCP connections or valid application-layer transactions, concurrent with identified flood characteristics.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for normal rates of successfully established TCP connections (`conn_state` 'SF' in Zeek conn.log) and valid application-layer transactions (e.g., HTTP 200 OK responses in Zeek http.log, successful DNS responses in Zeek dns.log) for critical services. Monitor these rates in real-time using time series analysis. Correlate significant drops in legitimate traffic rates (e.g., >50% decrease from baseline or multiple standard deviations below the mean) with periods of high-volume SYN/ACK traffic, increased half-open connections, or host-level exhaustion events as identified by other detections. Linear regression can be used to model and predict the impact of flood traffic volume on service degradation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```