
[
  {
    "Is the adversary attempting to evade defenses using user activity checks? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497.002 - User Activity Based Checks": {
          "Execution of a process whose file hash matches known malware or specific tools designed for sandbox evasion via user activity checks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously compare the file hashes of all newly created processes (from enriched Windows Event ID 4688 logs, such as those provided by Sysmon with Event ID 1) against a cyber threat intelligence (CTI) feed of known malware file hashes. Specifically flag matches to dedicated sandbox evasion tools like `pafish` or `al-khaser`, or other malware samples known to implement T1497.002. Alert immediately on any confirmed match."
          },
          "A process executing a sequence of file or registry accesses that matches the known operational pattern of a specific sandbox evasion script or framework.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and monitor for specific, ordered sequences of file or registry access events (Windows Event IDs 4663 for object access, 4656 for handle requests) by a single process that are characteristic of known evasion tools. For example, a sequence might involve checking for `C:\\Recent\\`, then querying the number of files in `C:\\Users\\*\\Desktop`, then checking for a specific registry key like `HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RunMRU`. Correlate events by Process ID within a very short time window (e.g., <5 seconds) to detect these specific, programmatic footprints."
          },
          "A process exhibiting a long, anomalous delay between its initial launch from a user-opened document and the initiation of suspicious child processes or network activity, suggesting a time-based evasion check.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For processes spawned by common document handlers (e.g., `WINWORD.EXE`, `ACRORD32.EXE`, `EXCEL.EXE`), measure the time delta between the parent process accessing the file and the creation of suspicious child processes (e.g., `powershell.exe`, `wscript.exe`, `rundll32.exe`) or any new outbound network connections (via Zeek conn.log). Establish a baseline for typical execution delays using descriptive statistics (mean, median). Use percentile analysis or the Inter-Quartile Range (IQR) method to flag processes with unusually long delays (e.g., > 5 minutes) as potential time-based evasion tactics."
          },
          "An unfamiliar or unsigned process rapidly accessing a high volume of disparate files and registry keys associated with generic user activity (e.g., recent documents list, browser history, desktop file count) without legitimate cause.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for processes (identified via Windows Event ID 4688) that generate a high frequency of object access events (Windows Event ID 4663) targeting multiple, distinct user activity artifacts (e.g., files in `%APPDATA%\\Microsoft\\Windows\\Recent\\`, browser history SQLite files, `%USERPROFILE%\\Desktop\\`). Correlate these events by Process ID. Use a sliding time window to calculate the entropy and frequency of file paths accessed by a process. Flag processes with abnormally high entropy and frequency targeting these specific locations, particularly if the process is unsigned or running from a temporary directory."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary performing discovery using user activity checks? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497.002 - User Activity Based Checks": {
          "Execution of a process whose file hash matches known spyware or information stealers that are known to collect user activity data for discovery and user profiling.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously compare file hashes from process creation events (from enriched Windows Event ID 4688 logs) against a CTI feed of known spyware, credential stealers, and information stealers that profile users based on their activity (e.g., browsing habits, document history, application usage). Alert on any matches and escalate for investigation into potential user data compromise."
          },
          "A process executing command-line tools (e.g., findstr, grep) or scripts designed to search within user documents or browser history files for specific keywords related to sensitive information.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation command lines (Windows Event ID 4688) for patterns indicating content searching within user directories. Look for commands such as `findstr /s /i 'password' C:\\Users\\*\\Documents\\*` or PowerShell scripts that access browser history SQLite databases and perform SQL queries for keywords like 'bank', 'login', 'crypto', 'confidential'. Maintain and use a regex list of sensitive keywords to detect this targeted discovery pattern."
          },
          "A process exhibiting a pattern of rapid, sequential access to numerous user-created files (documents, spreadsheets, text files) consistent with automated content scanning rather than normal user interaction.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for processes (identified by Windows Event ID 4688) that generate a high volume of file open and read events (Windows Event ID 4663) across user directories (`Documents`, `Desktop`, etc.). Differentiate this from legitimate system processes like search indexers by focusing on non-system, unsigned, or newly-seen processes. Establish a baseline for normal file access rates per user/process. Use time series analysis to flag processes that open and close hundreds of unique files in a short time window (e.g., < 1 minute), a behavior inconsistent with human activity but consistent with automated content scraping for discovery."
          },
          "A process making new network connections to external destinations immediately following access to sensitive user history or profile information, suggesting exfiltration of discovered user activity data.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate host-based events with network logs by creating a rule that triggers on a specific sequence. Identify when a process (Windows Event ID 4688) first accesses user activity files like browser history, password stores, or recent documents lists (Windows Event ID 4663), and is then immediately followed by a new network connection from that same host to an unknown or low-reputation external IP (Zeek conn.log). Use correlation analysis on timestamp (e.g., network connection occurs within 60 seconds of file access) and host IP to link the file access (discovery) to the network connection (potential exfiltration)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
