
[
  {
    "Is the adversary impacting system or service availability by hijacking resources? (TA0040 - Impact)": {
      "Indicators": {
        "T1496 - Resource Hijacking": {
          "Network connections from internal hosts to IP addresses, domains, or TLS server names (SNI) known to be associated with cryptocurrency mining pools or resource hijacking C2 infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate DNS queries (from Zeek dns.log), destination IP addresses (from Zeek conn.log), and TLS Server Name Indication (SNI) values (from Zeek ssl.log) against a high-confidence, frequently updated threat intelligence feed of known cryptocurrency mining pools, stratum servers, and resource hijacking C2 infrastructure. Alert on any confirmed matches and investigate the internal source host."
          },
          "Execution of processes with names, file paths, or command-line arguments characteristic of known resource hijacking tools, such as cryptominers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Match the 'New Process Name' and 'Command Line' fields against a curated list of regular expressions for known cryptomining software (e.g., xmrig, t-rex, nbminer) and their common command-line arguments (e.g., --wallet, --pool, -o stratum+tcp://, --cpu-max-threads-hint). Investigate any matches and use descriptive statistics to track the frequency and prevalence of these detections across the environment."
          },
          "A process exhibits behavior indicative of resource hijacking, such as masquerading as a legitimate system process, executing from an unusual file path, or running persistently for an abnormally long duration.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 to identify processes with names of common system utilities (e.g., svchost.exe, lsass.exe, rundll32.exe) that originate from atypical file paths (e.g., %APPDATA%, %TEMP%, C:\\Users\\, C:\\Windows\\Temp). Correlate process creation (Event ID 4688) with termination (Event ID 4689) to calculate process runtimes. Use percentile analysis or the Inter-Quartile Range (IQR) method to identify processes with unusually long durations compared to their peers or historical baseline, as miners often run continuously. Investigate outlier processes."
          },
          "A host exhibits sustained, long-duration network connections to a single external destination, consistent with a continuous mining session, especially outside of normal business operations or for servers that should not have such connections.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to calculate connection durations for all internal hosts. Use time series analysis and descriptive statistics (mean, median, 95th percentile) to establish a baseline for normal connection durations per host or per host group profile (e.g., workstations vs. web servers). Flag hosts that establish connections with durations significantly exceeding their baseline (e.g., lasting for multiple hours or days), especially to destinations not identified as legitimate business services. Use linear regression to identify trends of increasing session durations from a host, and correlate long-duration connections with other indicators like high data volume or unusual destination ports."
          },
          "Network traffic patterns consistent with mining protocols, such as connections to common cryptomining ports using Stratum, or containing specific mining-related keywords in application layer data.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to common cryptomining ports (e.g., 3333, 4444, 5555, 14444). For HTTP-based pools (e.g., on ports 80, 443, 8080), inspect Zeek http.log for JSON-RPC method calls common in mining protocols, such as 'login', 'submit', or 'getjob'. Analyze the entropy of connection payloads in Zeek conn.log for these connections; Stratum protocol messages often have a recognizable structure and lower entropy than encrypted traffic. Flag hosts with persistent connections exhibiting these patterns."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
