[
  {
    "Is the adversary impacting system or service availability? (TA0040 - Impact)": {
      "Indicators": {
        "T1496.001 - Compute Hijacking": {
          "Network connections to known cryptocurrency mining pools or unusual outbound network traffic volume associated with compute activity.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for connections to IP addresses or domains on lists of known cryptocurrency mining pools. Analyze Zeek conn.log for unusual patterns in outbound connection volume and duration from individual hosts or groups of hosts (e.g., using time series analysis or outlier detection on bytes_sent/bytes_recv compared to baseline)."
          },
          "Detection of unauthorized process creation or termination events related to cryptocurrency miners.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4689",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and 4689 (Process Termination). Create a baseline of normal process activity using descriptive statistics on process names and command lines. Identify process names or command lines matching known cryptocurrency miners or suspicious process termination events (e.g., termination of legitimate performance monitoring tools or competing miners) using anomaly detection on process names/hashes/parent processes."
          },
          "System or application event logs indicating unusual resource contention, crashes, or instability on hosts.": {
            "Data": "Windows System Event Logs; Windows Application Event Logs",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows System and Application Event Logs for patterns of events (e.g., frequency or clustering in time) indicative of resource exhaustion, application hangs (Event ID 1002), crashes (Event ID 1000), or service failures (Service Control Manager events). Correlate these events with suspicious network traffic (Zeek logs) or process activity (Windows Event ID 4688, 4689) on the same host. Use time series analysis to detect sudden increases in such events or correlation analysis to link them to specific processes or connections."
          },
          "Termination of legitimate system or security processes correlated with suspicious activity on the host.": {
            "Data": "Windows Event ID 4689; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4689 (Process Termination). Maintain a list of critical system and security processes. Flag unexpected termination events for processes on this list. Correlate these termination events with suspicious process creation (Event ID 4688, potentially of known miner executables or tools used to disable security) or other suspicious activity indicators (e.g., high network traffic volume from Zeek logs). Use frequency analysis to identify hosts with statistically anomalous rates of critical process terminations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]