[
  {
    "Is the adversary attempting to evade defenses related to virtualization or sandboxing? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497 - Virtualization-Sandbox Evasion": {
          "Process execution querying system properties or registry keys indicative of virtualization.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing keywords or tool names associated with querying system properties (e.g., 'systeminfo', 'wmic', 'reg query') and filter for those querying common virtualization artifacts (e.g., 'VMware', 'VirtualBox', 'VBOX'). Identify frequent occurrences of these commands from single processes/executables. Use frequency analysis to find rare command combinations or sequences."
          },
          "Network connections exhibiting unusual delays or occurring after suspicious system checks.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections from hosts exhibiting potential T1497 behavior (e.g., where Event ID 4688 analysis indicates environment checks). Use time series analysis and correlation analysis to identify connections that occur only after specific system checks are detected or exhibit unusual delays compared to normal host behavior."
          },
          "File system or registry access attempting to identify artifacts left by analysis tools or virtualization software installations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines attempting to access known file paths or registry keys associated with virtualization software (e.g., querying specific vendor keys or directories). If configured, monitor Windows Event ID 4663 (Object Access - File/Registry) for attempts to read specific virtualization/analysis artifact files or registry keys. Identify processes performing multiple such checks in a short time. Use frequency analysis to baseline normal system queries vs. suspicious concentrated checks."
          },
          "Execution of a process that rapidly performs multiple system or environment checks in quick succession upon startup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of Windows Event ID 4688 events for a single process ID executing multiple distinct system/environment check commands (referencing keywords from evidence related to querying properties, registry, or tools) within a very short timeframe (e.g., less than 10-15 seconds) after its initial creation event. Use time series analysis on process creation and command execution timestamps for specific processes to detect this rapid burst behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary conducting discovery to identify virtualization or analysis environments? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497 - Virtualization-Sandbox Evasion": {
          "Process execution attempting to enumerate or identify security monitoring tools installed on the system.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing keywords or tool names associated with listing processes, files, or services (e.g., 'tasklist', 'wmic process', 'Get-Process', 'dir', 'sc query') and filter for those containing keywords related to security or analysis tools (e.g., 'wireshark', 'sysmon', 'procmon', 'debugger', 'sandbox'). Use frequency analysis of queried tool names and look for sudden spikes in related process creations."
          },
          "Process execution attempting to identify recent user activity or session details.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing keywords or tool names associated with querying user activity (e.g., 'query user', 'qwinsta', 'wevtutil', 'Get-WinEvent', accessing recent files/directories). Analyze the frequency and clustering of these events from suspicious processes using descriptive statistics."
          },
          "Process execution attempting to list currently running processes or installed programs and filtering/searching for known security or analysis tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines that list processes (`tasklist`, `wmic process list brief`, `Get-Process`) or installed software (`wmic product get name`, `Get-Package`) and include parameters or pipes (`|`, `findstr`, `Select-String`, `grep`) to filter for names of common security tools or sandboxes (e.g., 'wireshark', 'sysmon', 'procmon', 'qemu', 'virtualbox', 'vmware'). Identify unusual processes executing such filtered enumeration commands using frequency analysis compared to baseline."
          },
          "Process execution querying system uptime, recent file access, or login history to infer user activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines querying system uptime (`systeminfo`, `Get-CimInstance -ClassName win32_operatingsystem`), recent file access (accessing 'Recent' folders, registry keys related to shell MRUs like BagMRU/StreamMRU), or executing tools that check login history (`wevtutil query-xml System /q:\"*[System[(EventID=4624)]]\"`). Correlate 4688 events with actual login event history (Event ID 4624) using correlation analysis to see if queries match recent activity. Flag processes executing multiple such user-activity checks within a short period."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]