[
    {
        "information_requirement": "Is the adversary attempting to impact network availability or functionality using reflection amplification?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1498.002",
                "name": "Reflection Amplification",
                "evidence": [
                    {
                        "description": "Inbound traffic on amplification-prone ports (e.g., DNS, NTP, Memcached) originating from external IP addresses identified as known open reflectors.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate the source IP addresses of inbound traffic on key amplification ports (e.g., UDP 53, 123, 11211) against a high-confidence cyber threat intelligence (CTI) feed of known, active open reflectors. Generate an alert for any traffic matching this list, especially if it coincides with an increase in service load or traffic volume, and investigate the targeted internal service for signs of impact."
                    },
                    {
                        "description": "Observation of specific, high-amplification query types or commands (e.g., DNS 'ANY' queries, NTP 'monlist' commands, Memcached 'stats' commands) targeting internal services from external sources.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek ntp.log",
                            "Zeek datagram.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze protocol-specific Zeek logs for query patterns known to maximize response size. For DNS, monitor Zeek dns.log for a high frequency of 'ANY', 'TXT', or 'RRSIG' queries for large zones. For NTP, monitor Zeek ntp.log or Zeek datagram.log for 'monlist', 'get_peers', or other diagnostic commands. Use regular expression matching on packet payloads if necessary for other protocols like Memcached. Alert when such query patterns are detected from external, untrusted sources, as they are common patterns for initiating amplification attacks."
                    },
                    {
                        "description": "Anomalous surge in inbound network traffic volume or service load on specific amplification-prone protocols, indicating a potential volumetric attack.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal traffic volume (bytes/sec, packets/sec) for key services (DNS, NTP, etc.) using historical Zeek conn.log data. Apply time series analysis (e.g., moving averages, exponential smoothing) and statistical process control to detect significant deviations from this baseline. Trigger alerts when traffic volume exceeds dynamic thresholds (e.g., 3+ standard deviations above the mean, or exceeding the upper whisker of a box plot representing normal traffic) and correlate with specific protocols."
                    },
                    {
                        "description": "High ratio of response bytes to request bytes for traffic on amplification-prone protocols, demonstrating a significant amplification factor.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For connections on known amplification ports (e.g., UDP 53, 123, 11211), calculate the amplification factor by dividing `resp_bytes` by `orig_bytes` from Zeek conn.log. Establish a baseline for normal amplification factors for these services. Use percentile analysis (e.g., flag anything above the 99th percentile) or Inter-Quartile Range (IQR) to identify connections with anomalously high amplification factors, which are a strong behavioral indicator of a reflection attack in progress."
                    },
                    {
                        "description": "High volume of inbound traffic on a specific port from a large, diverse, and unexpected set of external source IP addresses, characteristic of a distributed reflection attack.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "During periods of high traffic to a specific internal service or port, analyze the contributing external source IP addresses from Zeek conn.log. Calculate the entropy of the source IP addresses within a short time window (e.g., 1 minute). A simultaneous spike in traffic volume and source IP entropy strongly indicates a distributed attack. Further correlate this activity with geolocation data to identify traffic from unexpected countries or autonomous systems, providing additional context to the anomalous behavior."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
