[
  {
    "Is the adversary attempting to evade defenses using user activity checks? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1497.002 - User Activity Based Checks": {
          "Process activity monitoring user input (mouse/keyboard) at unusual rates or lack of input.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command lines or parent processes indicative of monitoring user input or unusual foreground activity checks. Analyze process execution frequency and duration using time series analysis or descriptive statistics. Look for processes exhibiting zero user input or extremely rapid, non-human-like input patterns (requires advanced analysis beyond standard logs, but flag suspicious processes)."
          },
          "Execution of suspicious code immediately following a specific user action on a file (e.g., macro execution after document close, file dropped after double-click).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 4663 (File Object Access) involving common user document types (docx, xlsx, pdf) or script files. Look for new process creation immediately following read/write access to these files, especially if the parent process is an application like Word/Excel or a browser. Analyze event timestamps for tight temporal correlation."
          },
          "Malware exhibiting delayed execution or requiring specific user interaction (e.g., multiple clicks, scrolling) before malicious payload is dropped or executed.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious processes created by common user applications (e.g., Office suite, PDF readers, browsers). Analyze the delay between the parent process creation/file access (Event ID 4663 on the file) and the child process execution (Event ID 4688). Identify instances where this delay is unusually long or where multiple user interactions with the file are observed (via 4663 or other logs if available) before execution. Use time series analysis to model typical execution delays and flag outliers."
          },
          "Suspicious process rapidly accessing multiple user-specific files or directories often checked by malware to determine if a user is present.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4663 (File Object Access) for file access events targeting common user activity indicators like browser history/cache files (e.g., sqlite databases), recent document lists, or file counts in Desktop/Downloads folders. Correlate these access events with the accessing process (Event ID 4688). Use descriptive statistics or correlation analysis to identify processes accessing an unusually high number of these files/directories in a short timeframe or accessing patterns inconsistent with legitimate applications."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary performing discovery using user activity checks? (TA0007 - Discovery)": {
      "Indicators": {
        "T1497.002 - User Activity Based Checks": {
          "Process accessing user profile directories, browser history files, or common document locations in a suspicious manner.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4663 (File Object Access) and 4688 (Process Creation). Identify processes rapidly accessing multiple files within user profile directories (Desktop, Downloads, AppData, browser caches/histories) or program files often checked by malware. Use descriptive statistics to identify processes with unusually high file access counts in these areas or access patterns that deviate significantly from baseline."
          },
          "A sequence of rapid system information gathering commands or file access patterns characteristic of sandbox checks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious command-line arguments or sequences of discovery-related commands (e.g., system info, tasklist, netstat) executed by the same process in rapid succession. Analyze the frequency and timing of these command executions using time series analysis or correlation analysis to identify patterns indicative of automated discovery and checks within a short timeframe."
          },
          "Suspicious process attempting to enumerate or access multiple web browser profiles or application data folders associated with specific user activity.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4663 for access attempts by suspicious processes (potentially identified via Event ID 4688 analysis) on known paths for browser profiles (Chrome, Firefox, Edge, etc.), email client data, or other applications storing user history/cache. Use descriptive statistics to identify processes accessing multiple different user profiles or application data stores within a short period. Flag access attempts by processes not typically associated with these file types."
          },
          "Execution of multiple host or user discovery commands/scripts within a short time window by a newly spawned process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Group process creation events by parent process and timestamp. Identify parent processes that rapidly spawn multiple child processes executing common discovery commands (e.g., `whoami`, `query user`, `ipconfig`, `systeminfo`, `tasklist`, `net user`, `net group`) or scripts accessing registry keys/files related to user configuration within a tight time window. Use correlation analysis or time series analysis to identify clusters of such events originating from a single parent."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]