[
  {
    "Is the adversary attempting to impact system availability or functionality via OS exhaustion? (TA0040 - Impact)": {
      "Indicators": {
        "T1499.001 - OS Exhaustion Flood": {
          "High volume of incoming SYN packets without corresponding SYN-ACK or ACK responses targeting endpoints or servers.": {
            "Data": "Zeek conn.log; Zeek tcp.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and tcp.log for high volumes of new connections (SYN packets) originating from a limited number of source IPs targeting specific internal endpoints/servers, where the connection state does not progress beyond SYN_SENT. Use time series analysis to detect sudden spikes in SYN traffic."
          },
          "High volume of incoming ACK packets targeting endpoints or servers for non-existent TCP connections, leading to potential resource exhaustion symptoms.": {
            "Data": "Zeek tcp.log; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek tcp.log for abnormally high volume of ACK packets targeting internal endpoints/servers without corresponding established connections (ACKs not part of a valid TCP stream). Identify source IPs generating high ACK volume. Correlate with system performance data (if available via other means) to see if high ACK volume precedes system sluggishness."
          },
          "Sudden and significant increase in the rate of half-open TCP connections (SYN_SENT state) on targeted servers or endpoints.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Calculate the rate of new connections in SYN_SENT state per minute or second, grouped by destination IP and port, using Zeek conn.log. Use time series analysis or simple thresholding to detect sudden spikes (e.g., exceeding a percentage increase or standard deviation above baseline rate over a recent period) in this rate targeting specific internal hosts or services."
          },
          "Significant decrease in the rate of successfully established TCP connections or application-layer activity to a server concurrent with high volumes of anomalous network traffic (SYN/ACK floods).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use time series analysis to monitor the rate of established TCP connections (state 'ESTABLISHED' in conn.log) or specific application layer events (e.g., HTTP requests in zeek http.log) for critical services/servers. Compare this rate to baseline activity. Correlate significant drops (e.g., >X standard deviations below baseline) in legitimate traffic rate with periods of high volume SYN/ACK traffic identified via other actions. This suggests impact on the service availability."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]