[
  {
    "Is the adversary attempting to disrupt network availability? (TA0040 - Impact)": {
      "Indicators": {
        "T1498 - Network Denial of Service": {
          "Sudden, anomalous surge in network traffic volume or rate targeting specific services or network connections.": {
            "Data": "Zeek conn.log; Zeek dstats.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and dstats.log for sudden increases in connection rate, byte volume, or packet rate targeting specific external services or network segments. Use time series analysis with anomaly detection algorithms (e.g., Holt-Winters forecasting, Z-score analysis) on traffic metrics (connections/sec, bytes/sec) to identify surges exceeding established baselines or thresholds."
          },
          "Detection of network traffic with characteristics consistent with DoS/DDoS, such as a sudden surge in a single protocol type or indications of source IP spoofing.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for sudden shifts in protocol distribution (e.g., sudden large volume of UDP, ICMP, or specific TCP flags like SYN). Look for patterns indicative of spoofing (e.g., high volume of unsolicited traffic with non-routable or unusual source IPs). Calculate entropy measures for source IP distributions to detect potential spoofing or botnet activity."
          },
          "Concentrated traffic volume from many distinct sources targeting a single internal host and specific service port(s).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for hosts receiving connections on common service ports (e.g., 80, 443, 25, 53). Aggregate connections by destination IP:port pair and time window (e.g., 1 minute). Calculate the number of distinct source IPs initiating connections per destination IP:port pair in each window. Flag destination IP:port pairs exhibiting a sudden, statistically significant increase in the number of distinct source IPs using time series anomaly detection or comparing current counts to historical baselines established via descriptive statistics (mean, standard deviation)."
          },
          "Network traffic patterns indicative of reflection/amplification attacks, such as large responses from internal servers following small external requests on specific UDP ports.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek ntp.log; Zeek snmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn.log, dns.log, ntp.log, snmp.log) for sessions originating from external IPs to internal services (e.g., DNS resolvers on port 53 UDP, NTP on 123 UDP, SNMP on 161 UDP). Calculate the ratio of bytes sent/received per session from the perspective of the internal server. Identify external IPs initiating many such requests or internal services generating large volumes of such responses (indicating high amplification factors). Use descriptive statistics (mean, median, percentile) and correlation analysis on traffic ratios to detect anomalies indicative of reflection/amplification attacks."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]