[
  {
    "Has the adversary impacted system availability by corrupting firmware? (TA0040 - Impact)": {
      "Indicators": {
        "T1495 - Firmware Corruption": {
          "Logged attempts to modify or read system or device firmware (BIOS, network device firmware).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event logs for suspicious process creation (Event ID 4688) attempting to access firmware-related drivers or locations (e.g., device paths like \\\\.\\PhysicalDrive0 or specific driver files). Monitor network device audit logs for unexpected firmware modification attempts. Compare timestamps of attempts against known, authorized firmware updates/patches. Use time series analysis to identify unusual bursts of activity targeting firmware interfaces on specific hosts or devices."
          },
          "Unexpected system or network device failures, crashes, or reboots correlated with suspicious activity.": {
            "Data": "Windows Event ID 1074; Windows Event ID 6005; Windows Event ID 6006; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect system shutdown/startup events (Windows Event ID 1074, 6005, 6006) and network device syslogs indicating crashes or unexpected reboots. Correlate timestamps of these events with any detected attempts to access or modify firmware. Use correlation analysis to identify statistically significant relationships between firmware access attempts and device instability. Investigate hosts/devices experiencing sudden, unexplained failures or reboot loops by examining precursor events."
          },
          "Execution of processes or drivers known to interact with system firmware or device drivers with elevated privileges, especially from non-standard locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for execution of specific executables (e.g., firmware flashing utilities, low-level disk tools) or command-line patterns (e.g., interacting with \\\\.\\PhysicalDriveX) known to interact with firmware/device drivers. Filter for processes running with elevated integrity levels (System, High). Use frequency analysis or anomaly detection to identify execution of these processes on hosts or users where this activity is unusual, or spikes in execution volume."
          },
          "Anomalous network traffic patterns directed at network devices' management interfaces immediately preceding device instability or reported firmware corruption.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections targeting network device IP addresses on common management or firmware update ports (e.g., SSH TCP/22, Telnet TCP/23, SNMP UDP/161, TFTP UDP/69, SCP TCP/22). Use time series analysis to detect unusual spikes in connection attempts, connection duration, or data volume directed at these ports on specific network devices. Correlate detected anomalies with reported device failures or reboots."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]