[
  {
    "Is the adversary maintaining persistence via web shell? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505.003 - Web Shell": {
          "Creation or modification of suspicious files in web server directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 logs on web servers for file creations or modifications within web root directories by unexpected user accounts or processes. Calculate baseline file modification rates for web directories and flag statistically significant deviations (e.g., using time series analysis or outlier detection)."
          },
          "Web server process (e.g., w3wp.exe, httpd) spawning unusual child processes or initiating outbound network connections to internal/external hosts.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs on web servers for the web server process spawning unexpected child processes (e.g., cmd.exe, powershell.exe). Analyze Zeek conn.log and http.log for unusual outbound connections initiated by the web server, particularly to internal hosts or external non-web ports. Use correlation analysis to link suspicious process creation events with outbound network activity from the web server."
          },
          "Unusual HTTP request parameters, body size, or user agents targeting known or suspected web shell file paths.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for HTTP requests targeting web server paths identified by file monitoring (Evidence 1) or known web shell locations. Analyze request parameters for suspicious commands (e.g., 'cmd', 'exec', 'eval', 'system'), request body size (large POST data compared to typical requests for that path), and non-standard user-agent strings. Use frequency analysis and outlier detection to identify requests with statistically unusual characteristics compared to baseline traffic."
          },
          "Repeated or patterned access attempts from external IPs to web server paths associated with known or suspected web shell files.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log to identify repeated HTTP requests from external source IPs targeting web server paths identified by file monitoring (Evidence 1) or known web shell locations. Use time series analysis and frequency counts to identify IPs making a statistically unusual number of requests to these paths within a short period or consistently over time. Analyze the variation in request methods, parameters, and body sizes for these repeated accesses using descriptive statistics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]