[
  {
    "Is the adversary maintaining persistence by abusing server software components? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505 - Server Software Component": {
          "Suspicious installation or modification of server software components in unusual file locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on servers for process creations initiated by server applications (e.g., web servers, database servers). Analyze command line arguments and parent-child relationships to detect processes associated with installing or modifying software components in non-standard directories. Calculate frequency distribution of process paths for server applications to identify rare occurrences."
          },
          "Abnormal child processes spawned by server processes or unusual network traffic originating from server components.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on servers for server applications spawning unexpected child processes (e.g., cmd.exe, powershell.exe). Correlate these process events with Zeek conn.log and http.log to identify outbound connections from the server process or host. Analyze network traffic patterns using time series analysis and correlation to identify communication with suspicious destinations or unusual data transfer volumes."
          },
          "Unusual or excessive authentication attempts to server administrative interfaces or components (e.g., database management ports, web server administration panels).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (successful) and 4625 (failed) and Zeek conn.log for connections and authentication attempts targeting known administrative ports or interfaces on servers (e.g., SQL ports 1433/3306, SSH 22, specific web admin ports). Identify source IPs with high rates of failed attempts (brute force) or successful logins from unusual locations/times. Use statistical measures (e.g., frequency, rate) to baseline normal authentication activity and flag significant deviations using IQR or percentile analysis."
          },
          "Outbound network connections initiated by a server process to internal systems that are unusual for that process or server.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 on servers to identify outbound network connections made by specific server process IDs. Correlate with Zeek conn.log for broader network visibility. Establish baselines for expected outbound connections for critical server processes (e.g., web server process, database process) by destination IP/port, volume, and time using frequency analysis or descriptive statistics. Flag connections to internal systems or ports that deviate significantly from this baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]