[
  {
    "Is the adversary maintaining persistence on hypervisors using malicious VIBs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505.006 - vSphere Installation Bundles": {
          "Detection of unauthorized network listeners or unusual outbound connections originating from ESXi host IPs, potentially installed via malicious VIBs.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from ESXi host IP addresses to unexpected ports or external destinations. Correlate network activity spikes or persistent outbound connections with known system reboot times to identify potential persistent backdoors. Analyze using correlation analysis (e.g., session duration vs time of day, source IP vs destination IP frequency)."
          },
          "Logging of unusual command execution (esxcli) on a Windows-based vCenter server or jump host used for ESXi management that corresponds to VIB installation or modification.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs from ESXi management servers or jump hosts. Search for executions of 'esxcli' with arguments related to software/vib installation, modification, acceptance level changes, or force flags ('--force'). Use time series analysis to identify bursts of 'esxcli' activity or executions at unusual times or intervals."
          },
          "Network transfer of files with VIB-related extensions (.vgz, .vib) or suspicious binaries to/from ESXi hosts or management servers from unusual sources or using uncommon protocols.": {
            "Data": "Zeek files.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for file transfers with extensions .vgz or .vib involving ESXi host IPs or management server IPs. Additionally, examine Zeek conn.log for connections involving these IPs using ports or protocols typically not used for VIB management or file transfer (e.g., non-SCP/SFTP, especially from non-standard internal or external sources). Use descriptive statistics on file sizes and frequency analysis on source/destination pairs to identify anomalies."
          },
          "Logging of ESXi acceptance level changes or repeated VIB installation commands (especially with '--force') on a Windows management server or jump host.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs from ESXi management servers or jump hosts. Search for executions of 'esxcli software acceptance set' commands setting the level to non-standard values (e.g., 'CommunitySupported', 'unsigned'). Also, look for repeated executions of 'esxcli software vib install', particularly those including the '--force' flag, within a short timeframe from the same user or source. Use frequency analysis to identify users or sources exhibiting unusual patterns of VIB installation or acceptance level modification attempts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]