[
  {
    "Is the adversary maintaining persistence on web servers using malicious IIS components? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505.004 - IIS Components": {
          "Creation or modification of suspicious DLL files or changes to the IIS configuration file (`applicationhost.config`) on web servers.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access to `%windir%\\system32\\inetsrv\\config\\applicationhost.config` or directories containing ISAPI/IIS module DLLs by unexpected processes. Monitor Windows Event ID 4688 for processes writing to these locations. Use frequency analysis to identify rare process executions interacting with these sensitive IIS configuration/binary locations."
          },
          "Execution of `AppCmd.exe` with command-line arguments related to adding or modifying IIS modules/handlers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creations of `AppCmd.exe` processes. Analyze command-line arguments for keywords like 'add module', 'set config', 'add handler', or specific paths within `inetsrv`. Use time series analysis to detect execution spikes or executions outside of typical administrative maintenance windows."
          },
          "Outbound network connections from the web server to unusual destinations or known malicious infrastructure, potentially indicative of C2 or data exfiltration by a malicious IIS component.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections from web servers to external IPs. Correlate destination IPs with threat intelligence feeds. Identify connections to unusual ports or protocols for a web server. Use frequency analysis to identify rare destination IPs or ports observed from web servers. Use time series analysis to detect sudden or persistent outbound connections."
          },
          "Suspicious child processes spawned by the IIS worker process (`w3wp.exe`) or other IIS-related processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 specifically for process creations where the parent process is the IIS worker process (e.g., `w3wp.exe`). Investigate child processes that are command shells (`cmd.exe`, `powershell.exe`), scripting engines (`cscript.exe`, `wscript.exe`), or unusual executables, especially if they include suspicious command-line arguments. Use descriptive statistics to baseline normal child processes spawned by `w3wp.exe` and identify outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]