
[
  {
    "Is the adversary maintaining persistence using Terminal Services DLL modification? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505.005 - Terminal Services DLL": {
          "The 'termsrv.dll' file on disk or a DLL pointed to by the 'ServiceDll' registry key matches the hash of a known malicious file.": {
            "Data": "Windows Event ID 1 (Sysmon); Windows Event ID 11 (Sysmon)",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor file creation/modification events (Sysmon Event ID 11) for '%SystemRoot%\\System32\\termsrv.dll' and any other DLL paths specified in the 'ServiceDll' registry value. Upon detection of a change, or as part of a scheduled integrity scan, compute the file hash (available in Sysmon Event ID 1 for the loading process or generated via script) and inner join it with a threat intelligence feed of known malicious file hashes. Alert on any hash match."
          },
          "Execution of specific command-line patterns or scripts using system utilities (e.g., reg.exe, PowerShell) to take ownership of, change permissions on, and replace 'termsrv.dll' or modify the 'ServiceDll' registry key.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Windows Event ID 4688 (Process Creation with Command Line Auditing). Create rules to detect specific, chained command patterns such as `takeown /f ...\\termsrv.dll` followed by `icacls ...\\termsrv.dll /grant`, or `reg.exe add 'HKLM\\...\\TermService\\Parameters' /v ServiceDll`. Use correlation analysis to link these discrete commands occurring within a short time window (e.g., < 5 minutes) into a single high-confidence alert representing the known modification pattern."
          },
          "Unauthorized modification of the Terminal Services 'ServiceDll' registry key or the replacement of the 'termsrv.dll' file by an unexpected or untrusted process.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor registry auditing (Windows Event ID 4657) on `HKLM\\System\\CurrentControlSet\\services\\TermService\\Parameters\\ServiceDll` and file system auditing (Windows Event ID 4663) on `%SystemRoot%\\System32\\termsrv.dll`. Establish a baseline of legitimate processes that interact with these objects (e.g., `TrustedInstaller.exe` during updates). Alert on any modification performed by a process not on the established baseline allowlist, particularly `cmd.exe`, `powershell.exe`, or any unsigned executable. Use frequency analysis to identify rare modifying processes and investigate their lineage using parent process information from Event ID 4688."
          },
          "Observation of multiple concurrent Remote Desktop Protocol (RDP) sessions from distinct users on a system where this behavior is not standard (e.g., a client OS), indicating a potential 'termsrv.dll' patch for this purpose.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4634; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor successful RDP logins (Windows Event ID 4624, Logon Type 10) and logoffs (Windows Event ID 4634, Logon Type 10). Maintain a stateful count of active RDP sessions per host by correlating logon and logoff events for distinct user accounts. For Windows client operating systems (e.g., Windows 10, 11), alert on any concurrent session count greater than one. For servers, establish a baseline for normal concurrent RDP user sessions and use time series analysis or percentile analysis to identify anomalous spikes. Cross-reference with Zeek conn.log data for active TCP sessions to port 3389 to validate concurrent connections."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
