[
  {
    "Is the adversary maintaining persistence using SQL stored procedures? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505.001 - SQL Stored Procedures": {
          "Execution of operating system commands via SQL stored procedures, specifically detecting xp_cmdshell usage.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs on SQL Servers. Identify processes created by the sqlservr.exe process, specifically looking for cmd.exe, powershell.exe, or other unusual executables. Analyze correlation between the creation of these processes and activity within the SQL server process."
          },
          "Creation or modification of SQL stored procedures or CLR assemblies that are configured for persistence (e.g., startup procedures or malicious CLR assemblies).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) logs on SQL Servers for access or modification of SQL Server configuration files, system tables related to stored procedures or CLR assemblies, or assembly files themselves (e.g., .dll files in SQL Server directories). Use correlation analysis to identify patterns of suspicious access or modification times that deviate from administrative norms."
          },
          "Outbound network connections initiated by the SQL server process (sqlservr.exe) to unusual destinations or ports.": {
            "Data": "Windows Event ID 5156; Windows Event ID 5158; Zeek conn.log",
            "Data Platform": "Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 5156 (Filtering Platform Connection Permitted) and 5158 (Filtering Platform Bind) originating from sqlservr.exe on SQL Servers to identify outbound connection attempts. Correlate with Zeek conn.log to identify destination IPs/ports and protocols of successful connections. Establish a baseline of normal SQL server outbound connections (e.g., to other databases, update servers) using frequency analysis of destinations and ports. Use correlation with threat intelligence feeds to flag connections to rare destinations, non-standard ports, or known malicious IPs."
          },
          "Unexpected file creation or modification activity originating from the SQL server process (sqlservr.exe) in non-SQL data directories.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure Windows SACLs to audit file system object access (Event IDs 4656 - Handle Requested, 4663 - Object Accessed) in sensitive directories (e.g., C:\\Windows\\Temp, C:\\ProgramData, C:\\Users\\*\\AppData\\Local\\Temp) for process sqlservr.exe. Filter logs for create or modify events (specifically access masks like WriteData or AppendData). Establish a baseline of normal file activity by sqlservr.exe in these directories using descriptive statistics (frequency, size, file type) and flag deviations (e.g., file types, names, locations, or frequency that fall outside the normal pattern)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]