```json
[
  {
    "Is the adversary maintaining persistence by abusing server software components? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505 - Server Software Component": {
          "A server software component file is created matching a known malicious hash or name, or a server process initiates a network connection to known C2 infrastructure.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for server processes executing commands that write files (e.g., using `certutil`, `bitsadmin`, or `powershell.exe`). Extract filenames and paths, and if a file hash can be obtained, compare it against a threat intelligence feed of known malicious file hashes. Also, correlate outbound network connections from server processes (e.g., w3wp.exe, sqlservr.exe) in Zeek conn.log against a CTI feed of known malicious C2 IP addresses and domains. Alert on any matches."
          },
          "A server process writes a new script file (e.g., .aspx, .php, .jsp) to a web-accessible directory, a common pattern for installing a web shell.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Windows Event ID 4663 (Object Access) for file write events in web server root directories (e.g., inetpub/wwwroot). Filter for files with script extensions (.aspx, .jsp, .php, .cfm). Correlate with Windows Event ID 4688 to identify the parent process that initiated the write. A web server process (e.g., w3wp.exe) writing a script file is highly suspicious. Use frequency analysis to establish a baseline of file types written to these locations and flag rare extensions."
          },
          "A legitimate server software process (e.g., w3wp.exe, sqlservr.exe) spawns an unexpected child process, such as an interactive shell or reconnaissance command.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for parent-child process relationships on servers. Establish a baseline of normal child processes for each critical server application (e.g., web server, database server). Alert on any deviation, especially the creation of `cmd.exe`, `powershell.exe`, `whoami.exe`, `net.exe`, or other shell/reconnaissance tools by server processes like `w3wp.exe`, `sqlservr.exe`, or `httpd.exe`. Use correlation analysis to link this activity to preceding network connections or file modifications."
          },
          "A server software process initiates anomalous network connections, such as connections to unusual destinations, using non-standard ports, or exhibiting C2-like communication patterns.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Using Zeek conn.log and Windows Event ID 5156, filter for connections originating from server application processes. Establish a baseline of normal outbound destinations, ports, protocols, and data volumes for each server process using descriptive statistics. Use time series analysis on connection frequency and data volume to detect beaconing or large data transfer behavior. Calculate the entropy of destination IPs or ports for a given process over time; a sudden increase can indicate scanning or lateral movement. Correlate alerts with file modification events on the server."
          },
          "Core server configuration files or binaries are modified by an unauthorized process or user, potentially altering server behavior to establish persistence.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable object access auditing on critical server application binaries and configuration files (e.g., web.config, httpd.conf, php.ini). Monitor Windows Event ID 4663 (Object Access) for write or handle request events on these files. Establish a baseline of authorized processes and administrative users that are permitted to modify these files. Alert on any modification activity that deviates from this baseline, as it could represent a direct manipulation of the server component for persistence."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```