[
  {
    "Is the adversary maintaining persistence using Terminal Services DLL modification? (TA0003 - Persistence)": {
      "Indicators": {
        "T1505.005 - Terminal Services DLL": {
          "Modification of Terminal Services Registry keys, specifically ServiceDll.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to registry values under HKLM\\System\\CurrentControlSet\\services\\TermService\\Parameters\\, specifically 'ServiceDll'. Analyze the process (from Event ID 4688) responsible for the change and the new value of 'ServiceDll' for suspicious paths or file names. Baseline typical changes and identify deviations using frequency analysis."
          },
          "Unexpected creation, modification, or loading of termsrv.dll or other DLLs by the Terminal Services process.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations on servers running Terminal Services (e.g., 'svchost.exe -k termsvcs'). Investigate processes with command lines indicating interaction with %SystemRoot%\\System32\\termsrv.dll or attempts to modify relevant registry keys using tools like 'reg.exe'. Use Windows Event ID 4663 (if configured) to detect attempts to write/modify termsrv.dll. Identify rare or suspicious processes interacting with these critical files/keys using frequency analysis."
          },
          "Multiple concurrent Remote Desktop Protocol (RDP) sessions established from a single source IP or user account to a system running Terminal Services." : {
            "Data": "Zeek rdp.log; Windows Event ID 4624; Windows Event ID 4778; Windows Event ID 4779",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek rdp.log and Windows Event IDs 4624 (Logon Type 10 or 11), 4778, and 4779 on systems running Terminal Services. Correlate events by source IP and username. Use statistical methods (e.g., counting concurrent connections per source/user over time windows) to identify instances where the number of concurrent RDP sessions exceeds normal limits (e.g., 1 for non-server OS without license, 2 for servers). Flag deviations from baseline behavior using percentile analysis."
          },
          "Command-line execution or scripts observed interacting with the 'termsrv.dll' file path or related registry keys via system utilities." : {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation with Command Line Auditing enabled) on systems running Terminal Services. Filter for processes with command lines containing keywords like '%SystemRoot%\\System32\\termsrv.dll', 'TermService', 'ServiceDll', 'reg.exe', 'powershell.exe', 'cmd.exe' followed by registry or file manipulation commands. Analyze arguments for specific actions like file copying, moving, renaming, registry value modification/deletion. Use frequency analysis to identify rare or suspicious command patterns and correlate with known malicious utility usage."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]