[
  {
    "Is the adversary enumerating installed software? (TA0007 - Discovery)": {
      "Indicators": {
        "T1518 - Software Discovery": {
          "Execution of system commands or scripts commonly used for software inventory (e.g., 'wmic product get name,version', 'Get-Package', registry queries).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing command-line arguments associated with software inventory queries (e.g., 'wmic product', 'powershell Get-Package', 'reg query HKLM\\Software'). Identify execution frequency of such commands by user and endpoint. Use frequency analysis to detect unusual spikes or executions by non-standard accounts or endpoints."
          },
          "Usage of WMI or PowerShell cmdlets/scripts to query installed software information.": {
            "Data": "Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4104 (PowerShell Script Block Logging) for scripts or commands querying software information (e.g., Get-WmiObject Win32_Product, Get-CimInstance Win32_Product, Get-Package). Monitor WMI activity logs if available. Look for execution originating from unusual processes or user contexts. Use correlation analysis to link software discovery activity with subsequent suspicious actions."
          },
          "Network traffic patterns indicative of automated software discovery or data exfiltration of discovered software lists.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusual internal network scanning patterns or connections to administrative ports across multiple hosts. Analyze Zeek http.log for suspicious requests or data transfer sizes to internal or external destinations immediately following suspected discovery activity. Monitor Zeek files.log for small files being transferred that might contain software lists. Use correlation analysis to link network activity with host-based discovery events (Windows Event IDs)."
          },
          "Network connections from internal compromised hosts to systems or ports associated with software deployment or management tools.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from suspected compromised internal hosts to known ports and/or IPs associated with enterprise software deployment systems (e.g., SCCM, PDQ Deploy, patching servers, or internal repositories). Analyze connection frequency, duration, and byte volume. Use correlation analysis to link these connections to prior discovery activities on the compromised host."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]