[
  {
    "Is the adversary attempting to discover security software or defensive tools? (TA0007 - Discovery)": {
      "Indicators": {
        "T1518.001 - Security Software Discovery": {
          "Execution of system commands (e.g., reg query, dir, tasklist) or scripts associated with identifying security software.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing command-line arguments associated with querying installed software, services, or registry keys known to list security products (e.g., \"reg query HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\", \"tasklist | findstr /I /C:'Antivirus'\"). Perform frequency analysis on command execution per host; identify rare command-line executions or spikes in discovery-related command usage on individual systems."
          },
          "Use of APIs or direct process inspection (e.g., via WMI, PowerShell) to list installed software or running security-related processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of 'wmic', 'powershell.exe', or other scripting/management tools with command-line arguments or script content (if available) that query system configuration, services, or processes known to be security software. Use correlation analysis to link execution of these tools with subsequent suspicious activity."
          },
          "Specific registry key queries or file system path access attempts associated with known security software installation locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing 'reg query' or file system commands ('dir', 'Get-ChildItem') targeting registry paths (e.g., 'HKLM\\SOFTWARE\\*Antivirus*', 'HKLM\\SOFTWARE\\*EDR*') or file paths (e.g., 'C:\\Program Files\\*Security*', 'C:\\ProgramData\\*AV*') commonly used by security software. Additionally, if SACLs are configured, monitor Windows Event ID 4663 for access attempts to known security software executables or directories by unusual processes. Use frequency analysis to detect bursts of such access attempts or queries on a single host."
          },
          "Network connections or DNS lookups to security vendor domains or IPs following execution of security software discovery commands.": {
            "Data": "Windows Event ID 4688; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 showing execution of security software discovery commands with subsequent Zeek dns.log entries querying known security vendor domains or Zeek conn.log entries connecting to security vendor IPs within a short time window (e.g., 60 seconds). Maintain a list of common security vendor network indicators. Use correlation analysis to link host discovery actions with suspicious network communication patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]