```json
[
  {
    "Is the adversary enumerating installed software? (TA0007 - Discovery)": {
      "Indicators": {
        "T1518 - Software Discovery": {
          "Execution of a file with a known malicious hash associated with software discovery scripts or tools used by threat actors.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) and their associated file hashes. Correlate the hashes against a continuously updated threat intelligence feed of known malicious files, especially those identified as discovery tools or scripts from actor toolkits. Alert on any match and immediately investigate the process's full activity chain, including parent process and subsequent network connections."
          },
          "Execution of common software discovery commands or PowerShell cmdlets, particularly when initiated by unusual processes or non-standard user accounts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process command lines (Windows Event ID 4688) and PowerShell script blocks (Windows Event ID 4104) for patterns matching software enumeration techniques. This includes `wmic product get`, `Get-ItemProperty HKLM:\\Software\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\*`, `Get-Package`, `dpkg --list`, `rpm -qa`, and `lslpp -L`. Use regular expression matching to detect variants. Correlate and flag executions when the parent process is unexpected (e.g., w3wp.exe, explorer.exe) or the user is not an administrator or member of an IT/systems management group. Use frequency analysis to establish typical usage patterns and identify outliers."
          },
          "An anomalous volume or pattern of software-related registry key queries on a host, deviating from established baselines for that system or user.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for normal software discovery activity (e.g., legitimate inventory scans by IT management tools) on servers and endpoints. Monitor for a high frequency of command executions (`reg query`, `Get-ItemProperty`) targeting software-related registry hives (e.g., HKLM\\SOFTWARE) within a short timeframe. Use time series analysis to detect unusual spikes in discovery commands from a single host or user. High entropy in the queried registry paths from a single process could also indicate broad, non-specific enumeration. A box-plot of query counts per host can reveal statistical outliers."
          },
          "A host initiating broad internal network connections to query other systems or exfiltrating a collected software list, following local discovery activity.": {
            "Data": "Zeek conn.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate host-based software discovery alerts (from event IDs 4688/4104) with subsequent network activity from the source host. Monitor Zeek conn.log for that host initiating connections to an unusually high number of other internal systems on ports associated with remote administration or WMI (e.g., TCP 135, 445, 5985). Use descriptive statistics to define a baseline for 'normal' connection diversity per host and alert on outliers. Monitor Zeek files.log for small text-based file transfers (.txt, .csv, .tmp) to internal staging servers or external destinations immediately following discovery activity, which may represent the exfiltration of the enumerated software list. Use correlation analysis to link the host events with the network events by source IP and timestamp."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```