```json
[
  {
    "Is the adversary attempting to discover security software or defensive tools? (TA0007 - Discovery)": {
      "Indicators": {
        "T1518.001 - Security Software Discovery": {
          "Execution of a process with a file hash matching a known malicious tool or script that performs security software discovery.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate the file hash of newly created processes (from Windows Event ID 4688, often requiring EDR enrichment) against a cyber threat intelligence (CTI) feed of known malicious file hashes. Prioritize matches for tools and malware specifically cataloged as performing security software discovery (T1518.001). Alert on any confirmed match."
          },
          "Execution of common system utilities (tasklist, wmic, reg query, PowerShell) with specific command-line arguments or script patterns used to query for security product processes, services, registry keys, or files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Use regular expressions and a curated list of keywords (e.g., 'av', 'edr', 'firewall', 'defender', 'sysmon', 'carbonblack', 'crowdstrike', 'tanium', 'sentinel') to flag command lines indicative of security software discovery. Alert on high-fidelity patterns like `tasklist /svc | findstr /i <keyword>`, `Get-Process -Name *<keyword>*`, `wmic /namespace:\\\\root\\securitycenter2 path antivirusproduct get displayName`, and `reg query HKLM\\SOFTWARE /s /f <keyword>`."
          },
          "A single process exhibiting an unusually high rate of file system or registry enumeration, particularly in locations associated with installed programs or system drivers, without a legitimate baseline.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for normal file and registry access rates per process using Windows Event ID 4663 (requires SACL configuration on key directories like `C:\\Program Files\\` and hives like `HKLM\\SOFTWARE`). Monitor for processes that generate a statistically significant number of access events (e.g., >3 standard deviations above the mean for that process name, or an outlier identified via box-plot analysis of access counts per process over a short time frame). Correlate these high-volume enumeration events back to the parent process (via Event ID 4688) to identify unusual scripts or binaries performing broad, untargeted discovery."
          },
          "Execution of security software discovery commands originating from a non-standard parent process, such as a Microsoft Office application, web browser, or PDF reader.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for parent-child process relationships. Create a high-priority alert when a discovery command process (e.g., 'tasklist.exe', 'wmic.exe', 'reg.exe', 'powershell.exe' with discovery-related arguments) is spawned by a process that typically handles user documents or web content (e.g., 'WINWORD.EXE', 'EXCEL.EXE', 'OUTLOOK.EXE', 'chrome.exe', 'AcroRd32.exe'). Use correlation and a baseline of expected parent-child relationships to identify these anomalous execution chains, which often indicate initial compromise via phishing or exploitation."
          },
          "An anomalous sequence of on-host discovery activity followed immediately by network connections or DNS queries to known security vendor domains.": {
            "Data": "Windows Event ID 4688; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events showing the execution of discovery commands (e.g., 'tasklist', 'Get-Process', 'wmic product get name') with subsequent Zeek dns.log entries showing queries for known security vendor domains (e.g., 'mcafee.com', 'symantec.com', 'crowdstrike.com') from the same host. Use a short time window (e.g., 1-5 minutes) for correlation. This behavioral sequence may indicate an automated script checking for a product's presence and then reporting its findings to an external server or attempting to download a specific bypass tool."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```