[
  {
    "Is the adversary attempting to discover cloud services in the environment? (TA0007 - Discovery)": {
      "Indicators": {
        "T1526 - Cloud Service Discovery": {
          "Execution of known cloud discovery tools or related command-line utilities on an endpoint or server.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations matching known cloud discovery tool names or command-line arguments (e.g., involving AWS, Azure, GCP SDK commands, 'pacu', 'stormspotter'). Use frequency analysis to identify hosts running such commands unusually often compared to a baseline."
          },
          "Anomalous network traffic patterns indicative of widespread scanning or enumeration of cloud service endpoints or APIs.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connection patterns to cloud provider endpoints (AWS, Azure, GCP IPs/domains). Identify hosts/users initiating an unusually high volume of connections to various cloud services or APIs in a short period. Use statistical methods like entropy measures on destination IPs/ports or correlation analysis of connection timings to identify communication patterns atypical for the environment, suggesting enumeration."
          },
          "Execution of command-line utilities attempting to authenticate to or query cloud APIs (e.g., AWS CLI, Azure CLI, Google Cloud SDK commands).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing command-line arguments indicative of cloud API interaction (e.g., `aws ec2 describe-instances`, `az vm list`, `gcloud compute instances list`). Filter for execution by potentially compromised accounts or from unusual hosts. Establish a baseline of normal API interaction commands and frequency per user/host using descriptive statistics and flag deviations (e.g., using IQR or percentile analysis)."
          },
          "Network connections to cloud instance metadata service endpoints from internal hosts.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and http.log for connections originating from internal hosts (e.g., EC2 instances) targeting known cloud metadata service IPs/domains (e.g., 169.254.169.254 for AWS IMDS). Analyze the frequency and volume of these connections over time. Use time series analysis to detect sudden spikes or persistent connections from hosts that don't typically interact with the metadata service or at unusual times/volumes compared to established baselines."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]