[
  {
    "Is the adversary attempting to impact system availability or recovery using shutdown/reboot? (TA0040 - Impact)": {
      "Indicators": {
        "T1529 - System Shutdown-Reboot": {
          "Execution of system shutdown/reboot commands or associated Windows Event IDs.": {
            "Data": "Windows Event ID 1074; Windows Event ID 6006; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 1074, 6006, and 4688 (process creation) for execution of system shutdown or reboot commands ('shutdown', 'restart', 'reboot', etc.). Investigate any unexpected, unauthorized, or scheduled events that occur at unusual times or originate from unexpected systems. Use time series analysis to identify anomalous spikes in the frequency or volume of these events across the environment or on critical systems."
          },
          "Execution of remote command execution tools targeting network devices from hosts, potentially preceding device reloads/downtime.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on servers and endpoints for process creations associated with remote command execution tools (e.g., 'ssh', 'plink', 'psexec', 'net rpc shutdown', 'wmic') where the target IP address or hostname corresponds to a network device. Identify execution attempts originating from unusual source systems, targeting critical network infrastructure, or occurring in conjunction with detected network instability or reloads."
          },
          "Sudden, widespread network connection failures or cessation of network traffic originating from a large number of internal hosts or critical infrastructure following a potential shutdown/reboot event.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for sudden drops in active connections or cessation of traffic across multiple internal systems simultaneously. Correlate with Windows Event ID 5156 indicating failed network connections on hosts. Use time series analysis and anomaly detection on connection counts, session durations, or byte volumes per host/subnet to identify widespread, synchronized network disruptions. Compare current network traffic patterns (e.g., using descriptive statistics on byte counts in conn.log) to historical baselines to identify significant deviations indicative of system outages."
          },
          "Remote login attempts or command execution activity targeting system management services (like WinRM or SSH) or remote administration tools (like RDP) immediately preceding a system shutdown/reboot event.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful remote logons (Windows Event ID 4624 Type 3 for network logon) or connections to management ports (Zeek conn.log for 5985, 5986, 22, 3389) on a system with subsequent system shutdown/reboot events (Windows Event ID 1074, 6006) on the same system within a short time window (e.g., 1-5 minutes). Analyze command line details in related Windows Event ID 4688 events on the target system for shutdown/reboot commands. Flag instances where remote access immediately precedes a shutdown."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]