[
  {
    "Has the adversary stolen application access tokens? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1528 - Steal Application Access Token": {
          "Authorization of a third-party application with high-risk permissions or permissions incongruous with the app's purpose.": {
            "Data": "Windows Event ID 4624; Zeek conn.log; Identity Provider Audit Logs",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Identity Provider (Azure AD) audit logs and CASB alerts. Filter for application authorization events, particularly those requesting high-risk permissions or granted by a small number of users. Correlate with user login events (Event ID 4624) and network traffic patterns (Zeek conn.log) to authentication endpoints using time series analysis to identify unusual spikes in authorization activity."
          },
          "Execution of privilege escalation actions (e.g., role creation, policy modification) attributed to an application or service account.": {
            "Data": "Windows Event ID 4663; Zeek conn.log; Cloud/SaaS Audit Logs",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud/SaaS audit logs for privilege escalation actions (e.g., role changes, policy modifications, new resource creation) performed by application or service accounts. Correlate these actions with observed host activity (Windows Event IDs) and network traffic (Zeek conn.log) originating from systems or IPs linked to the compromised account or application, looking for unusual correlation patterns."
          },
          "Requests to cloud metadata services (e.g., Azure IMDS) from systems or IP addresses not typically associated with accessing these services, potentially followed by connections to other cloud resources.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 for connections to cloud metadata service endpoints (e.g., Azure IMDS IP 169.254.169.254). Identify source IPs/hosts making these requests. Establish a baseline of normal IMDS access patterns (source hosts, frequency). Use frequency analysis and time series analysis to detect anomalous spikes in requests or requests originating from unusual hosts. Correlate successful IMDS requests with subsequent connections to other cloud service endpoints to identify potential token usage using correlation analysis."
          },
          "Network connections to application APIs (e.g., Kubernetes API server, Docker API) or cloud service APIs originating from hosts or service accounts previously flagged for suspicious activity or credential compromise.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 for connections to known application API ports (e.g., K8s API 6443/443, Docker API 2375/2376) or cloud service API endpoints. Cross-reference the source hosts (via IP or hostname lookup) and user/service accounts (if available in logs) against a list of compromised or suspicious accounts/hosts. Use correlation analysis to identify persistent or high-volume connections to APIs from flagged sources, potentially outside of normal operational patterns based on descriptive statistics of connection times and volume."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]