[
    {
        "information_requirement": "Has the adversary stolen application access tokens?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1528",
                "name": "Steal Application Access Token",
                "evidence": [
                    {
                        "description": "API calls or network connections using an application access token originating from a known malicious IP address, a TOR exit node, or an IP outside the application's expected geographic region.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate source IP addresses from network logs (Zeek conn.log) making authenticated requests to application or cloud service APIs (identified via Zeek http.log looking for 'Authorization: Bearer' headers or known API endpoint patterns) against CTI feeds of malicious IPs, TOR exit nodes, and known anonymous proxies. Geolocate source IPs and use frequency analysis to alert on requests from rare or unexpected countries for a given application's normal operating regions."
                    },
                    {
                        "description": "Execution of commands or use of specific User-Agents associated with known token theft tools or techniques, such as querying cloud metadata services or accessing local application data stores.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for command-line patterns used to query metadata services (e.g., `curl 169.254.169.254`, `Invoke-RestMethod -Uri http://169.254.169.254/`). Monitor Zeek http.log for User-Agent strings associated with malicious OAuth applications or known token-stealing frameworks during authentication flows. Maintain and hunt for patterns from a regularly updated watchlist of these command-line strings and User-Agents."
                    },
                    {
                        "description": "An anomalous spike in application authorizations, or authorizations for applications with high-risk permissions, originating from a single user or IP address, suggesting a malicious OAuth application campaign.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek http.log and conn.log for traffic to known identity provider authorization endpoints (e.g., `login.microsoftonline.com/common/oauth2/v2.0/authorize`). Establish a baseline for the frequency of these authorization events across the organization. Use time series analysis to detect anomalous spikes in authorizations from specific source IPs or directed at particular users. Analyze the entropy of application names or IDs being authorized during a spike; low entropy could indicate a widespread campaign for a single malicious application."
                    },
                    {
                        "description": "An application access token being used with anomalous characteristics, such as from multiple disparate geolocations simultaneously, at unusual times, or to access an atypical pattern of resources.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For API traffic identified in Zeek http.log, attempt to extract a token hash or session identifier. Profile the typical usage for a given token/session: source IP, User-Agent, time-of-day, and types of API calls made. Use statistical analysis to detect anomalies, such as 'impossible travel' (a token used from two distant locations in an impossibly short time), access at unusual hours compared to user/app baseline, or a sudden change in API call patterns (e.g., from read-only to write/delete actions). Use correlation analysis to link these anomalies to specific tokens or sessions."
                    },
                    {
                        "description": "Anomalous requests to cloud metadata services from an endpoint, especially if initiated by an unexpected process and followed by suspicious outbound network connections.",
                        "data_sources": [
                            "Windows Event ID 5156",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for network connections to the cloud metadata service IP (169.254.169.254) using Windows Event ID 5156 (Windows Filtering Platform connection) and Zeek conn.log. Baseline which processes (from Windows Event ID 4688 process creation logs) and hosts normally access this service. Alert on access from unexpected processes (e.g., `powershell.exe`, `cmd.exe`, a user-downloaded binary) or from hosts that do not typically interact with the service. Use correlation analysis to link a metadata service access event with subsequent outbound connections (in Zeek conn.log) to unexpected external IPs within a short time window (e.g., 5 minutes), which could indicate token exfiltration."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
