[
    {
        "information_requirement": "Is the adversary attempting to discover cloud services in the environment?",
        "tactic_id": "TA0007",
        "tactic_name": "Discovery",
        "indicators": [
            {
                "technique_id": "T1526",
                "name": "Cloud Service Discovery",
                "evidence": [
                    {
                        "description": "Network traffic to cloud provider API endpoints containing atomic indicators from threat intelligence, such as hardcoded API keys or known malicious User-Agent strings.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan Zeek http.log for requests to cloud provider domains (e.g., *.amazonaws.com, management.azure.com, *.googleapis.com). Use regular expression matching on HTTP headers and request bodies to search for known malicious User-Agent strings, publicly exposed or leaked API keys used by threat actors, or other specific string-based IOCs derived from up-to-date cyber threat intelligence feeds. Alert on any confirmed matches."
                    },
                    {
                        "description": "Execution of known cloud enumeration tools or specific discovery-oriented command-line arguments for cloud provider CLIs.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creations involving cloud CLI tools (`aws`, `az`, `gcloud`) followed by specific enumeration command patterns (e.g., `describe-*`, `list-*`, `get-*`). Also monitor for the execution of known standalone cloud discovery tools (e.g., `pacu`, `scoutsuite`, `stormspotter`, `cloudsplaining`). Maintain and update a list of high-risk commands and tool names. Correlate executions with the user context, flagging commands run by non-administrative users or service accounts that do not typically perform discovery tasks."
                    },
                    {
                        "description": "Anomalous volume or diversity of network connections from a single internal host to multiple distinct cloud service APIs, indicating broad enumeration.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log and http.log for connections to known cloud provider IP ranges or domains. For each internal source IP, calculate the number of unique destination cloud services/APIs contacted and the total number of requests over a rolling time window (e.g., 10 minutes). Use statistical methods (e.g., Z-score, IQR) to identify hosts exhibiting unusually high connection diversity or volume compared to an established baseline for its peer group or its own history. High entropy in destination IPs or requested API paths (from http.log) for a single source is a strong indicator of scanning."
                    },
                    {
                        "description": "Anomalous or first-time access to cloud instance metadata services by a host, especially when correlated with subsequent discovery activity.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek logs for HTTP requests to the instance metadata service IP (e.g., 169.254.169.254 for AWS/GCP, 169.254.169.254 for Azure IMDS). Establish a baseline of hosts that normally access this service. Alert on access from hosts that have never accessed it before or access at unusual times. Correlate metadata service access with subsequent process creation events (Windows Event ID 4688) on that host involving cloud discovery commands within a short time window (e.g., 5 minutes) to identify credential theft followed by enumeration."
                    },
                    {
                        "description": "A user account or service principal performing a range or frequency of cloud discovery actions inconsistent with its established role-based activity profile.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Develop a baseline profile for user accounts and service principals based on the types and frequency of cloud API calls they typically make, derived from Windows Event ID 4688 command lines and Zeek http.log API calls. Use descriptive statistics to model normal behavior for roles (e.g., 'Developer', 'DBA'). Monitor for significant deviations, such as a user suddenly making many 'list' or 'describe' calls across services they do not normally interact with. Use time series analysis or linear regression to detect anomalous trend changes in a user's discovery activity over time."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
