[
    {
        "information_requirement": "Is the adversary attempting to impact system availability or recovery using shutdown/reboot?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1529",
                "name": "System Shutdown-Reboot",
                "evidence": [
                    {
                        "description": "Execution of processes with file hashes or specific command-line arguments known to be associated with malware (e.g., ransomware, wipers) that performs a system shutdown or reboot.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor process creation events (Windows Event ID 4688) and analyze process file hashes and full command-line arguments. Correlate file hashes against a CTI feed of known malicious binaries. Use regular expression matching to detect command-line patterns specifically used by known malware families to issue shutdown commands (e.g., `shutdown.exe /s /f /t 0 /c 'Your files are encrypted'`). Immediately alert on any confirmed matches."
                    },
                    {
                        "description": "Execution of shutdown or reboot commands via scripting interpreters or with unusual parameters indicative of malicious intent.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for `shutdown.exe`, `Restart-Computer`, or equivalent commands. Specifically, filter for events where the parent process is a scripting engine like `powershell.exe` or `cmd.exe`. Analyze command-line parameters for unusual combinations, such as extremely short timeouts (e.g., `/t 0`), forced closure of applications (`/f`), or the inclusion of a non-standard comment (`/c '...'`). Flag executions that deviate from documented administrative practices or baseline behavior."
                    },
                    {
                        "description": "Use of remote administration tools from an endpoint or server to issue shutdown commands targeting network devices or other critical systems.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 on servers and endpoints for process creations associated with remote administration tools (e.g., `ssh`, `plink.exe`, `psexec.exe`, `wmic.exe`) or commands (`net rpc shutdown`). Correlate this activity with Zeek conn.log to confirm the target IP belongs to critical infrastructure. Flag executions originating from non-administrative workstations or those targeting a large number of devices in a short time frame."
                    },
                    {
                        "description": "A remote login event immediately followed by a shutdown or reboot command on the same system.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4688",
                            "Windows Event ID 1074"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate successful remote logons (Windows Event ID 4624, Logon Type 3 or 10) on a host with subsequent process creation events for shutdown/reboot commands (Windows Event ID 4688) or system shutdown initiation events (Windows Event ID 1074) on the same host. Define a short time window for correlation (e.g., 1-5 minutes). Use correlation analysis to automatically link these events and alert on any instance where a remote session immediately precedes a system shutdown, especially if the source of the remote login is untrusted or unusual."
                    },
                    {
                        "description": "A widespread and synchronized issuance of shutdown or reboot commands across numerous systems, inconsistent with planned maintenance schedules.",
                        "data_sources": [
                            "Windows Event ID 1074",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate and centralize all system shutdown events (Windows Event ID 1074, 4688 with shutdown commands) across the environment. Establish a baseline of normal reboot activity for different system groups (e.g., workstations, web servers). Use time series analysis and statistical outlier detection (e.g., Z-score, IQR on event counts per hour) to identify anomalous spikes in the volume of shutdown events. Correlate event timestamps with change management records to filter out legitimate activity. Alert when a statistically significant number of systems are shut down simultaneously or in rapid succession outside of a planned maintenance window."
                    },
                    {
                        "description": "A sudden, widespread cessation of network traffic from a large number of internal hosts or critical subnets, indicating mass outages.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor network traffic volume (e.g., total bytes, active connections) using Zeek conn.log, aggregated by subnet or critical asset groups. Establish a baseline of normal traffic patterns for different times of day and days of the week. Use time series analysis (e.g., ARIMA or Exponential Smoothing with confidence bands) to detect a sudden, statistically significant drop in traffic across multiple segments simultaneously. Investigate any such disruption as a potential indicator of a coordinated shutdown attack."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
