[
  {
    "Is the adversary maintaining persistence by implanting internal images? (TA0003 - Persistence)": {
      "Indicators": {
        "T1525 - Implant Internal Image": {
          "Anomalous addition or modification of cloud/container images within internal registries by users/accounts with unusual activity patterns.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections to known internal image registry endpoints. Analyze http.log for requests indicating image pushes or modifications (e.g., POST/PUT requests to image manifest/blob endpoints). Flag large data uploads (image pushes) or modifications occurring outside of standard deployment windows or from unusual source IPs/accounts. Use time series analysis to detect spikes in traffic or activity to the registry."
          },
          "Suspicious interactions with implanted or modified images via container runtime logs (e.g., Docker daemon, Kubernetes audit logs).": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections from hosts running container runtimes (Docker, Kubernetes nodes). Correlate Zeek connections with Windows Event ID 4688 on these hosts to identify processes originating connections, especially those associated with newly created or updated containers. Analyze destination IPs/domains for connections originating from containers, cross-referencing against threat intelligence feeds. Identify unusual network behavior patterns (e.g., connections to unexpected ports or services) using statistical methods."
          },
          "Registry API calls indicating image pushes or modifications from unexpected sources or accounts.": {
            "Data": "Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log filtering for connections to internal image registry domains/IPs indicating image pushes or modifications (e.g., `POST /v2/.../blobs/uploads/`, `PUT /v2/.../manifests/...`). Identify source IPs and correlate with Windows Event ID 4624 on management/authentication servers to identify accounts performing these actions. Flag image pushes or modifications from sources/accounts lacking a standard deployment/build process history or those showing rare activity patterns using frequency analysis."
          },
          "Container deployments using recently modified or added images exhibiting anomalous process execution or network activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify container images recently modified or added to internal registries (potentially by reviewing Zeek http.log or registry logs). Correlate these image changes with subsequent Windows Event ID 4688 events on container hosts indicating new container creation or process execution within containers using these images. Analyze Zeek conn.log from these container hosts for unusual network connections (e.g., connections to external unknown IPs, internal lateral movement attempts). Use correlation analysis between image modification timestamps and subsequent anomalous host/network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]