[
  {
    "Is the adversary evading defenses using unused or unsupported cloud regions? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1535 - Unused-Unsupported Cloud Regions": {
          "Creation of new cloud instances or resources in geographic regions not typically used by the organization.": {
            "Data": "Cloud Provider Audit Logs (e.g., AWS CloudTrail, Azure Activity Logs, GCP Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud provider audit logs across all regions for 'create instance', 'create resource', or similar API calls. Maintain a list of approved/used regions. Identify and alert on any such events occurring in unapproved regions. Calculate the frequency of activity per region over time using descriptive statistics and alert on sudden non-zero activity in previously zero-activity regions."
          },
          "Evidence of activity (e.g., resource usage, API calls) in cloud regions known to have limited or absent advanced detection/monitoring capabilities.": {
            "Data": "Cloud Provider Audit Logs (e.g., AWS CloudTrail, Azure Activity Logs, GCP Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud provider audit and usage logs for activity (e.g., API calls, network traffic, resource utilization events) in regions known or suspected to have weaker logging or detection features. Identify anomalous activity patterns in these regions by comparing them to activity in monitored regions or historical baselines using correlation analysis or time series analysis."
          },
          "API calls associated with account compromise (e.g., credential changes, key generation) originating from or targeting resources within previously unused cloud regions.": {
            "Data": "Cloud Provider Audit Logs (e.g., AWS CloudTrail, Azure Activity Logs, GCP Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud provider audit logs in all regions for API calls related to identity and access management (IAM) or account settings (e.g., `ChangePassword`, `CreateAccessKey`, `AssumeRole`) where the source IP or affected resource is located in a previously unused region. Correlate these events with any preceding activity in that region. Use time series analysis to identify sudden spikes or isolated occurrences of such events in these regions."
          },
          "Unusual resource utilization patterns (e.g., high CPU/GPU usage inferred from instance activity, high network egress) from newly created or existing resources in unused cloud regions.": {
            "Data": "Cloud Provider Audit Logs (e.g., AWS CloudTrail, Azure Activity Logs, GCP Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud provider audit logs for events indicating resource creation/start (`RunInstances`, `StartInstances`) or network activity (network flow logs if captured by the audit service) in unused regions. Focus on patterns indicative of high resource consumption shortly after creation, such as simultaneous startup of multiple resource-intensive instances or high volume of network egress traffic to unknown destinations captured in flow logs. Compare the frequency and volume of these events in new instances in unused regions against typical patterns in approved regions using descriptive statistics and frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]