
[
  {
    "Has the adversary exfiltrated data by transferring it to another cloud account? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1537 - Transfer Data to Cloud Account": {
          "Data transfer or resource sharing attempts directed towards external cloud account IDs or domains known to be associated with malicious actors.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Action is primarily based on cloud-native logs (e.g., AWS CloudTrail). Maintain a threat intelligence list of cloud account IDs (AWS account numbers, Azure tenant IDs, etc.) and associated domains known to be malicious. Monitor cloud logs for sharing events targeting these identifiers. As a proxy, monitor Zeek http.log for API call parameters containing these malicious identifiers. Correlate destination IPs of cloud traffic in Zeek conn.log with CTI feeds of known malicious infrastructure, understanding that shared IPs reduce fidelity."
          },
          "Execution of specific cloud CLI commands or API calls designed to share data resources (snapshots, storage objects, machine images) with external accounts.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "On hosts, monitor Windows Event ID 4688 for command-line execution of cloud CLI tools (e.g., `aws`, `az`, `gcloud`) with arguments explicitly used for sharing, such as `modify-snapshot-attribute`, `put-bucket-policy`, `copy-object` with cross-account flags, or `az storage blob sas`. From the network, monitor Zeek http.log for POST/PUT requests to cloud provider API endpoints corresponding to these sharing actions (e.g., requests to `*.s3.amazonaws.com` with `x-amz-copy-source` headers). Maintain and alert on a defined list of high-risk command patterns and API endpoints."
          },
          "Anomalous volume or frequency of data transfers to cloud storage provider networks, deviating from established baselines for a user, host, or the organization.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal data transfer volume (bytes sent) and connection frequency to known cloud storage provider IP address ranges (e.g., AWS S3, Azure Blob Storage) per internal host. Monitor Zeek conn.log for significant deviations from this baseline. Use time series analysis (e.g., ARIMA, exponential smoothing) to detect sudden spikes in data volume or connection counts. Use Inter-Quartile Range (IQR) or Z-score methods on daily/hourly transfer volumes per host to flag outlier activity indicative of bulk exfiltration."
          },
          "Cloud data sharing or transfer activities initiated from an unusual source, such as a non-administrative workstation, or by a user account that does not typically perform such actions.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile which users and hosts normally execute cloud CLI tools or make API calls for data transfer and sharing. Monitor Windows Event ID 4688 and Zeek http.log to detect when these actions are performed by an anomalous user or from an unexpected host (e.g., an `aws s3 cp` command run on a finance team laptop instead of a designated ETL server). Maintain an access control model or simple allow-list of source hosts/users for specific sharing actions and investigate any deviations."
          },
          "Data sharing or transfer initiated to a new or statistically rare external cloud account ID, domain, or IP address.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Action is primarily based on cloud-native logs. Maintain a baseline of all external cloud account IDs and domains that the organization legitimately shares data with. Monitor cloud logs for any sharing or copy events targeting an account ID/domain not on the established baseline. From network data, analyze Zeek http.log for API calls referencing new external account IDs. Use frequency analysis on destination IPs in Zeek conn.log within cloud provider ranges to identify connections to rare endpoints and investigate the associated transfers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
