
[
  {
    "Has the adversary attempted to remove user account access? (TA0040 - Impact)": {
      "Indicators": {
        "T1531 - Account Access Removal": {
          "Account modification or deletion events initiated by a user account or from a source host previously flagged as suspicious or confirmed compromised.": {
            "Data": "Windows Event ID 4723; Windows Event ID 4724; Windows Event ID 4726; Windows Event ID 4738; Windows Event ID 4740",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a dynamic watchlist of suspicious or confirmed compromised user accounts and hostnames based on prior security alerts. Continuously correlate this list against the 'Subject' or 'Source' fields in account modification event logs (e.g., 4724 for password reset, 4726 for deletion, 4738 for changes like disablement, 4740 for lockout). An inner join between event logs and the watchlist will produce high-fidelity alerts requiring immediate investigation."
          },
          "Execution of built-in command-line tools or scripting languages with specific command syntax known to delete, disable, or alter user accounts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor process creation events (Windows Event ID 4688) with full command-line logging. Use regular expression matching to detect command lines containing patterns such as `net user .* /delete`, `net user .* /active:no`, `dsmod user \".*\" -disabled yes`, as well as PowerShell cmdlets like `Remove-LocalUser`, `Disable-LocalUser`, `Remove-ADPrincipalGroupMembership`, `Set-ADAccountPassword`, and `Disable-ADAccount`. Alert on any occurrences, especially when executed by non-standard administrative processes or user accounts."
          },
          "A statistically significant increase in the volume of account deletion, disablement, or lockout events occurring within a short time frame across the environment.": {
            "Data": "Windows Event ID 4726; Windows Event ID 4738; Windows Event ID 4740",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for the normal rate of account deletions (4726), changes (4738, including disablement), and lockouts (4740) per hour or day across the domain. Use time series analysis (e.g., ARIMA or exponential smoothing) to forecast expected volumes. Alert when the observed count significantly exceeds the forecast or crosses a threshold of multiple standard deviations above the mean (e.g., Z-score > 3), indicating a potential mass impact event."
          },
          "Account modification actions performed by an unusual source, such as a non-administrative user, a service account outside of its normal function, or at an anomalous time.": {
            "Data": "Windows Event ID 4723; Windows Event ID 4724; Windows Event ID 4726; Windows Event ID 4738",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each account modification event, analyze the 'SubjectUserName' and 'Client Address' fields. Create profiles of which administrator accounts typically perform these actions and from which management hosts. Alert on deviations, such as a non-admin account performing the action, a service account performing the action unexpectedly, or an admin performing the action during non-business hours. Use frequency analysis and correlation to identify rare combinations of actor, action, source, and time, and use entropy measures to detect unusual randomness in the accounts being targeted by a single actor."
          },
          "A widespread increase in network service authentication failures immediately following a cluster of account modification events, indicating successful removal of access.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4771; Zeek conn.log; Zeek rdp.log; Zeek smb.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate account modification events (e.g., 4724, 4726) with subsequent authentication failure events (Windows Event ID 4625 for NTLM, 4771 for Kerberos pre-auth failure) for the same target accounts. Also monitor Zeek logs (`rdp.log`, `smb.log`, `conn.log`) for status codes indicating authentication failure. Use correlation analysis with a defined time window (e.g., 1-15 minutes) to link the modification event to the failures. A surge in failures for multiple accounts that were recently modified is a strong indicator of impact."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
