[
  {
    "Has the adversary attempted to remove user account access? (TA0040 - Impact)": {
      "Indicators": {
        "T1531 - Account Access Removal": {
          "Detection of Windows Event IDs indicating attempts to change or reset user account passwords (4723, 4724).": {
            "Data": "Windows Event ID 4723; Windows Event ID 4724",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4723 and 4724 on Domain Controllers or relevant servers. Analyze the rate and frequency of password change/reset attempts per user or system over time. Identify users/systems with significantly higher-than-average rates using descriptive statistics (e.g., mean, standard deviation, or box plots) and investigate deviations from established baselines."
          },
          "Detection of Windows Event IDs indicating user account deletion or lockout (4726, 4740) or process execution of 'net user /del' or 'passwd'.": {
            "Data": "Windows Event ID 4726; Windows Event ID 4740; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4726 (Account Deletion) and 4740 (Account Lockout). Monitor Windows Event ID 4688 for process creations involving 'net.exe' or 'passwd' with command line arguments related to account deletion or lockout (e.g., '/delete', '/active:no'). Correlate these events with other suspicious activity occurring on the same system or involving the same user account. Use time series analysis to detect unusual spikes or patterns in account lockouts or deletions."
          },
          "Process creation events showing execution of PowerShell or other scripting tools with command lines attempting to modify or delete user accounts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations on endpoints and servers. Filter events where the process name is commonly used for scripting (e.g., 'powershell.exe', 'pwsh.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe'). Analyze the command line field for keywords or patterns related to account modification or deletion (e.g., 'Set-LocalUser', 'Set-ADAccountPassword', 'Disable-ADAccount', 'Delete-ADAccount', 'net user.* /active:no', 'net user.* /delete'). Use frequency analysis to identify unusual counts or bursts of such commands from a single source or user."
          },
          "Increase in failed authentication attempts for specific user accounts on network services (SMB, RDP, etc.) correlating with recent account modification events (password change, deletion, lockout).": {
            "Data": "Windows Event ID 4625; Windows Event ID 4723; Windows Event ID 4724; Windows Event ID 4726; Windows Event ID 4740; Zeek conn.log; Zeek smb.log; Zeek rdp.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 (Failed Logon Type 3, 10) on servers. Identify failed logon attempts associated with user accounts recently affected by T1531 events (Event IDs 4723, 4724, 4726, 4740). Analyze Zeek logs (e.g., `smb.log`, `rdp.log`, `conn.log` for relevant ports) for authentication failures or unexpected connection patterns for these accounts/systems. Calculate the rate of failed logins for affected accounts using time series analysis to detect a significant increase immediately following a T1531 event. Correlate source IPs of failed logins with potentially malicious sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]