
[
  {
    "Has the adversary accessed user credentials or session cookies? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1539 - Steal Web Session Cookie": {
          "Detection of known malicious files, browser extensions, or JavaScript snippets associated with cookie theft, or network connections to known malicious infrastructure used in cookie theft campaigns.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Compare file hashes of newly executed processes or created files (from Windows Event ID 4688 with command-line auditing enabling script block logging or process creation with hash information) against a threat intelligence feed of known cookie-stealing malware. Monitor Zeek http.log for requests loading known malicious browser extension IDs or JavaScript file names/signatures linked to cookie theft. Correlate network connections observed in Zeek conn.log to IP addresses or domains known to be part of cookie theft infrastructure (e.g., C2 servers for tools like Evilginx2), using frequently updated CTI feeds."
          },
          "Execution of specific commands, toolchains, or scripts recognized for accessing, dumping, or exfiltrating browser cookies, or interaction with specific browser files/registry keys in a manner consistent with known cookie stealing tools.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments indicative of tools like Mimikatz (e.g., `sekurlsa::dpapi`, `sekurlsa::cookies`, `misc::cookies`), LaZagne, or specific PowerShell cmdlets/scripts used for cookie theft (e.g., Get-ChildItem on cookie paths piped to exfil commands). Track access patterns (Windows Event IDs 4663 for object access, 4656 for handle requests) to well-known browser cookie files (e.g., `Cookies`, `Login Data`, `cookies.sqlite` in Chrome/Edge/Firefox profiles) by unexpected processes or those using specific access flags commonly abused by credential theft tools. Maintain a list of such command patterns and process behaviors."
          },
          "Anomalous process access to browser cookie storage files or credential repositories on endpoints by non-browser or unauthorized processes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (An attempt was made to access an object) and 4656 (A handle to an object was requested) specifically for attempts to access browser cookie database files (e.g., Chrome/Edge: `User Data/*/Cookies`, Firefox: `cookies.sqlite`). Establish baselines of legitimate processes (browsers, approved password managers) accessing these files. Use frequency analysis, process whitelisting, and descriptive statistics (e.g., count of unique processes accessing cookie stores per host) to identify and alert on anomalous access by non-standard processes, scripts (powershell.exe, cscript.exe), or newly observed executables. An increase in the entropy of processes accessing these files on a host could indicate malicious activity."
          },
          "Anomalous process behavior such as attempts to inject into or dump browser process memory by unexpected or untrusted processes.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 (A handle to an object was requested) for processes requesting high-privilege access rights (e.g., `PROCESS_VM_READ`, `PROCESS_VM_WRITE`, `PROCESS_CREATE_THREAD`) to browser processes (chrome.exe, firefox.exe, msedge.exe). Correlate such requests with Windows Event ID 4688 (A new process has been created) to identify the parent process initiating the access attempt. Use descriptive statistics on the frequency of such attempts per source process and flag processes that frequently attempt to access browser memory without a legitimate, known purpose (e.g., not a recognized debugger or enterprise security tool). Time series analysis can detect unusual spikes in these access attempts across the environment."
          },
          "Anomalous network traffic patterns potentially indicative of cookie exfiltration via malicious proxy, Adversary-in-the-Middle (AitM) frameworks, or direct C2 communication following suspicious web interactions.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs for: 1. Users being redirected to unusual login pages or IP addresses during authentication flows (analyze Zeek http.log `Referer` and `Host` headers, destination IPs in Zeek conn.log). 2. Unexpected SSL certificate issuers, self-signed certificates for legitimate sites, or JA3/JA3S hash anomalies that deviate from baselines for known sensitive sites (Zeek ssl.log). 3. HTTP POST requests from clients containing unusually large cookie values or entire session tokens to unexpected domains, especially immediately after a successful login event to a legitimate service (Zeek http.log). Use correlation analysis: e.g., if a user authenticates to Site X, and immediately after, a connection is made to suspicious Site Y with session-like data, investigate for AitM (e.g., Evilginx2). Maintain baselines of typical SSL certificate details and HTTP transaction patterns for sensitive sites and alert on significant deviations using percentile analysis or clustering."
          },
          "Suspicious browser-initiated activity, such as spawning unusual child processes (e.g., command shells, scripting engines) or making anomalous network connections, potentially indicating malicious script execution for cookie theft or exfiltration.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (A new process has been created) for browser processes (chrome.exe, firefox.exe, msedge.exe) spawning unexpected child processes like cmd.exe, powershell.exe, wscript.exe, cscript.exe, or curl.exe. Analyze the command lines of these child processes for indicators of data access, manipulation, or exfiltration. Correlate with Windows Event ID 5156 (Windows Filtering Platform permitted a connection) or Zeek conn.log to detect network connections made by these child processes or directly by the browser process to non-standard domains, IPs, or those with low reputation, particularly if data exfiltration patterns (e.g., POST requests with encoded data, DNS tunneling attempts) are observed. Use time series analysis to detect unusual spikes in browser-initiated outbound connections or the creation rate of specific child processes."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
