
[
  {
    "Is the adversary using internal spearphishing for lateral movement? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1534 - Internal Spearphishing": {
          "Internal network traffic matches known malicious indicators, such as connections to blacklisted phishing domains or IPs, or file transfers involving known malicious hashes.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously inner join network logs with high-confidence cyber threat intelligence (CTI) feeds. Correlate Zeek conn.log and http.log destination IPs/domains against lists of known phishing, malware C2, or credential harvesting sites. Analyze Zeek files.log by correlating file hashes (MD5, SHA1, SHA256) with databases of known malicious files. Alert on any confirmed matches and investigate the source host."
          },
          "An office application or email client spawns a suspicious child process, such as PowerShell, CMD, or WScript, a pattern highly indicative of malicious macro or attachment execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs for specific parent-child process relationships. Create rules to flag instances where parent processes like OUTLOOK.EXE, WINWORD.EXE, EXCEL.EXE, or POWERPNT.EXE spawn child processes such as powershell.exe, cmd.exe, wscript.exe, cscript.exe, or any unsigned executable. Analyze the command-line arguments of the child process for suspicious keywords like '-enc', '-nop', or '-exec bypass' using regular expression matching."
          },
          "Internal emails contain suspicious artifacts such as spoofed sender information, mismatched reply-to headers, or unusual attachment types (e.g., LNK, ISO, VHD, HTML) being sent between internal accounts.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse Zeek smtp.log data. Identify emails where the 'From' header domain is internal but the source IP is external or an unexpected internal server. Flag emails where the 'Reply-To' address differs from the 'From' address. Use frequency analysis on attachment file extensions being exchanged internally; create alerts for statistically rare and potentially malicious types (e.g., .iso, .lnk, .vhd) that bypass typical executable filters."
          },
          "A user's host exhibits a behavioral chain of suspicious activities, such as connecting to a suspicious external site, followed shortly by anomalous process execution and then accessing sensitive network shares.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5145; Zeek http.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate events across multiple data sources in a short time window (e.g., 5-15 minutes) for a given host or user. Define and hunt for a behavioral sequence: 1) Connection to a suspicious external site (identified from Zeek http.log based on low-frequency domain, recent registration date, or high-entropy name). 2) Followed by anomalous process creation (Windows Event ID 4688). 3) Followed by access to unusual or sensitive network shares (Windows Event ID 5145). Use correlation analysis to link these events by source IP and timestamp to build a high-fidelity alert for post-compromise activity initiated by a phish."
          },
          "A compromised account is used to send a high volume of similar emails to other internal users, deviating significantly from the account's established email sending baseline.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal email activity for internal users using historical Zeek smtp.log data. Model features like email volume per hour/day, number of recipients per email, and subject line similarity (e.g., using Levenshtein distance or n-gram analysis). Use time series analysis or descriptive statistics (mean, standard deviation, IQR) to detect significant deviations from this baseline. Flag any account that sends a burst of emails with very similar subjects or content to an unusually large number of internal recipients, indicating its use for propagating the internal spearphish."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
