```json
[
  {
    "Is the adversary collecting data from cloud storage? (TA0009 - Collection)": {
      "Indicators": {
        "T1530 - Data from Cloud Storage": {
          "Access to cloud storage from IP addresses, or involving User-Agent strings, known to be malicious or associated with threat actors.": {
            "Data": "Cloud Provider Storage Access Logs; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from cloud storage access logs and Zeek conn.log against a high-confidence cyber threat intelligence (CTI) feed of known malicious IPs or anonymous proxies (updated daily). Scan User-Agent strings within cloud API logs or Zeek http.log for signatures of known malicious tools or scanners. Alert on any confirmed matches."
          },
          "Use of known data siphoning tools or specific API call patterns indicative of bulk data enumeration and retrieval.": {
            "Data": "Cloud Provider API Activity Logs; Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor User-Agent strings in cloud API logs and Zeek http.log for tools commonly used for cloud data siphoning (e.g., rclone, s4cmd, s3browser). On hosts, monitor process creation events (Windows Event ID 4688) for these tool names or associated command-line arguments targeting cloud storage. In cloud API logs, detect reconnaissance patterns such as a single principal making a 'ListBuckets' or equivalent call, followed by a rapid series of 'ListObjects' calls across many buckets, followed by a high volume of 'GetObject' calls."
          },
          "Anomalously high volume or frequency of data retrieval from cloud storage by a single user, service principal, or source IP, deviating significantly from established baselines.": {
            "Data": "Cloud Provider Storage Access Logs; Cloud Provider API Activity Logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each user/principal, establish a baseline for data access volume (bytes transferred) and frequency (GetObject/download calls) per hour/day. Monitor for significant deviations from this baseline. Use descriptive statistics (mean, standard deviation) and Inter-Quartile Range (IQR) & box-plots to identify outliers. Correlate high-volume cloud access events with large outbound data flows in Zeek conn.log to the respective cloud provider's IP ranges to confirm the scale of data transfer."
          },
          "A user or service principal accessing cloud storage data that is atypical for their role, originating from an unusual geographic location, or occurring at an abnormal time.": {
            "Data": "Cloud Provider API Activity Logs; Windows Event ID logs",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile normal data access patterns for users and roles (e.g., typical buckets, object prefixes accessed). Alert on access to sensitive or unusual data paths outside a principal's normal scope. Geolocate source IPs from cloud access logs and implement 'impossible travel' detection by correlating sequential access events. Use time series analysis and percentile analysis on access timestamps to flag activity occurring consistently outside of normal business hours. Correlate this cloud activity with host-based logs (Windows Event IDs) to understand the process context of the access."
          },
          "Anomalous sequence of API calls indicating permission discovery or exploitation of misconfigurations, such as numerous failed access attempts followed by a successful one, or any access by anonymous principals to non-public storage.": {
            "Data": "Cloud Provider API Activity Logs; Cloud Provider IAM Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud API logs for a high ratio of 'AccessDenied' errors to successful 'GetObject' calls from a single principal within a short time frame, which may indicate permission testing. Use correlation analysis to link these patterns to recent IAM policy changes for that principal. Generate high-priority alerts for any successful access to non-public storage objects where the principal is identified as 'Anonymous' or 'AllUsers', as this indicates a severe misconfiguration being actively exploited."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```