[
  {
    "Is the adversary using internal spearphishing for lateral movement? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1534 - Internal Spearphishing": {
          "Internal network connections to suspicious external websites potentially initiated from clicked spearphishing links.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log for internal source IPs connecting to suspicious external destinations (e.g., domains with high entropy, newly registered domains, domains matching known phishing patterns, or IPs from threat intelligence feeds). Correlate with timing of potential internal email/chat activity if other logs are available, otherwise focus on identifying anomalous external connections originating internally using correlation analysis between internal source IPs and suspicious external destinations."
          },
          "Execution of suspicious files or processes originating from internal communication channels (email attachments, shared files).": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on endpoints and servers, looking for executions of uncommon file types or processes with suspicious parent-child relationships (e.g., office application spawning cmd/powershell). Analyze Zeek file.log for detection of potentially malicious file hashes or suspicious file types being transferred internally over network protocols. Use entropy analysis on file names/paths in Event 4688 or file contents in Zeek file.log (if available) to flag potentially obfuscated or malicious payloads."
          },
          "Internal network traffic patterns suggestive of credential harvesting, such as HTTP POST requests containing common credential parameter names sent to unusual internal or external destinations.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for HTTP POST requests. Analyze the `request_body` or relevant fields for parameters commonly used in login forms (e.g., searching for strings like 'user=', 'pass=', 'login='). Investigate internal source IPs making such requests to suspicious internal hosts (e.g., non-standard servers) or suspicious external IPs/domains (correlation with threat intelligence or domain characteristics). Use frequency analysis on destination IPs/domains and requested URIs to identify statistically rare targets for credential submission POSTs."
          },
          "Unusual outbound communication patterns or process execution activity from a compromised internal account/host shortly after suspected internal spearphishing activity.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Windows Event ID 4688; Windows Event ID 5140; Windows Event ID 5145",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts/accounts suspected of being compromised or exhibiting initial spearphishing indicators. Monitor Zeek conn.log for unusual spikes in internal network connections from these hosts, especially to hosts or services they don't normally interact with. Analyze Zeek smtp.log for anomalous volume or recipients of internal emails sent *from* these hosts. Use Windows Event ID 4688 to look for unexpected processes or command lines executed on these hosts. Use Windows Event IDs 5140/5145 to detect unusual access to internal file shares. Use time series analysis or baseline comparisons to detect deviations from normal behavior for the specific account/host."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]