
[
  {
    "Is the adversary evading defenses using unused or unsupported cloud regions? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1535 - Unused-Unsupported Cloud Regions": {
          "Cloud API activity originating from IP addresses known to be malicious, or the creation of cloud resources using known malicious artifacts (e.g., public AMIs associated with cryptomining).": {
            "Data": "AWS CloudTrail; Azure Activity Logs; GCP Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate the `sourceIPAddress` field from all cloud provider audit logs (e.g., AWS CloudTrail, Azure Activity Logs) against a high-confidence threat intelligence feed of malicious IPs. Additionally, monitor resource creation events (e.g., AWS `RunInstances`, Azure `Microsoft.Compute/virtualMachines/write`) for the use of public image IDs (e.g., AMIs) known to be associated with malware or cryptomining. Maintain and inner join against a denylist of such image IDs, alerting on any matches."
          },
          "A specific sequence of API calls characteristic of initial foothold and setup in a new cloud region, such as creating a new IAM user, generating credentials, and then launching compute resources.": {
            "Data": "AWS CloudTrail; Azure Activity Logs; GCP Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and monitor for a specific sequence of API calls occurring within a short time window (e.g., under 15 minutes) within a single unused or unsupported region. An example pattern is: `CreateUser` -> `CreateAccessKey` -> `PutUserPolicy` -> `RunInstances`. Correlate these events by `userIdentity` and `awsRegion` (or equivalent). Use correlation analysis or a complex event processing engine to detect the full pattern and alert. Analyze the frequency and parameters of such patterns to distinguish them from legitimate administrator setup activities."
          },
          "Creation of any compute, storage, or networking resources in cloud regions explicitly designated as 'unused' or 'unapproved' by organizational policy.": {
            "Data": "AWS CloudTrail; Azure Activity Logs; GCP Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a strict allow-list of approved cloud regions for the organization. Configure real-time alerts from cloud audit logs to trigger on any resource creation API call (e.g., AWS `RunInstances`, `CreateDBInstance`, `CreateBucket`; Azure `Microsoft.Compute/virtualMachines/write`; GCP `compute.instances.insert`) where the region or location field is not on the approved list. This policy violation should trigger a high-severity alert."
          },
          "Anomalous API activity patterns or resource configurations in unused regions, such as disabling security logging, creating overly permissive firewall rules, or using resource types never seen in primary regions.": {
            "Data": "AWS CloudTrail; Azure Activity Logs; GCP Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For any activity detected in an unused region, perform deeper analysis. Monitor for specific API calls that degrade security posture (e.g., `StopLogging`, `DeleteTrail`, `UpdateSecurityGroup` with CIDR 0.0.0.0/0). Establish a baseline of typical resource types and configurations used in primary regions. Use descriptive statistics and frequency analysis to compare resource configurations in unused regions against this baseline, flagging significant deviations. Calculate the entropy of API calls by user in unused regions; a sudden spike may indicate discovery or malicious activity."
          },
          "Significant network egress or unusual communication patterns from resources within an unused cloud region, indicating data exfiltration, C2 communication, or cryptomining activity.": {
            "Data": "AWS VPC Flow Logs; Azure NSG Flow Logs; Zeek conn.log",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud provider flow logs for resources in unused regions. Use time series analysis to detect anomalous spikes in egress data volume compared to baseline. Correlate destination IPs with threat intelligence feeds for known C2 or cryptomining pool addresses. Analyze connection patterns for beaconing (periodic, low-volume connections) using frequency analysis on connection timestamps and durations. If host-based Zeek logs are available from instances, inspect `conn.log` and `ssl.log` for suspicious protocols, JA3 hashes, or anomalous communication patterns that correlate with the unused region activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
