[
  {
    "Has the adversary exfiltrated data by transferring it to another cloud account? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1537 - Transfer Data to Cloud Account": {
          "Detection of attempts to share cloud snapshots or data objects with untrusted/unusual external cloud accounts.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud service logs (e.g., AWS CloudTrail, Azure Activity Logs - note: these are not Windows Events or Zeek but necessary for technique). Identify events related to sharing snapshots or data objects ('ModifySnapshotAttribute', 'Get Snapshot SAS URL', 'ShareObject'). Filter for external or public sharing attempts. Analyze Zeek http.log for API calls to cloud sharing endpoints. Correlate Zeek/Host events with cloud logs if possible. Use descriptive statistics to identify unusual frequency or targets of sharing events."
          },
          "Monitoring for anomalous file transfer activity or unusual API calls related to data transfer between accounts within the same cloud provider.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud service logs for API calls indicating data transfer between accounts within the provider (e.g., S3 CopyObject, Blob Copy). Monitor Zeek conn.log and http.log for unusual traffic volume or patterns to cloud storage/transfer endpoints originating from internal assets. Use time series analysis on transfer volume or API call frequency to detect spikes or deviations from baseline behavior."
          },
          "Network activity indicating creation or utilization of shared cloud storage links.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for HTTP requests/responses to cloud provider APIs related to shared link creation (e.g., specific URLs/methods for generating pre-signed URLs, SAS URIs). Analyze source IPs and timestamps for unusual patterns (e.g., source not typically interacting with cloud storage APIs, bulk creation attempts). Use frequency analysis to baseline normal API interactions per host or user and flag deviations."
          },
          "Execution of cloud administration tools with snapshot or sharing parameters on non-standard hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for execution of cloud provider CLI tools (e.g., `aws.exe`, `az.exe`, `gcloud.cmd`). Analyze command line arguments for keywords or parameters related to snapshot/backup creation or sharing (`create-snapshot`, `copy-snapshot`, `share-snapshot`, `az backup`, `az snapshot create`, etc.). Identify hosts where such commands are executed but which are not designated cloud administration systems using simple filtering. Use frequency analysis to establish baseline execution patterns for cloud CLI tools on specific hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]