[
  {
    "Is the adversary collecting data from cloud storage? (TA0009 - Collection)": {
      "Indicators": {
        "T1530 - Data from Cloud Storage": {
          "Unusual access patterns or queries to cloud storage services from unexpected sources or with high volume/rate.": {
            "Data": "Cloud Provider Storage Access Logs; Cloud Provider API Activity Logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud storage access logs and cloud API activity logs for unusual query volumes, data retrieval sizes, and access frequencies from specific sources (IPs, users, roles). Use time series analysis or statistical process control (SPC) to detect significant deviations from baseline access patterns for specific buckets/containers or user accounts. Cross-reference with Zeek conn.log for outbound connections to cloud storage endpoints and monitor large outbound data flows to cloud provider IPs."
          },
          "Multiple failed attempts to access specific cloud storage objects followed by successful access by the same user or principal, potentially after privilege escalation.": {
            "Data": "Cloud Provider API Activity Logs; Cloud Provider IAM Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud provider API activity logs for failed access attempts to storage objects (e.g., GetObject, ListObjects, Download). Correlate failed attempts by user/principal with subsequent successful access or changes in privileges/roles (IAM logs). Use correlation analysis to link failed attempts to successful access events or privilege modifications within a defined timeframe."
          },
          "High volume of data retrieval from cloud storage by a single user, service principal, or source IP within a short timeframe, especially if from an unusual geographic location or occurring outside normal business hours.": {
            "Data": "Cloud Provider Storage Access Logs; Cloud Provider API Activity Logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze cloud storage logs (Storage Access Logs, API Activity Logs) for data retrieval events (e.g., GetObject, Download). Aggregate transferred bytes/data volume by user, service principal, and source IP over specified time windows (e.g., 1 hour). Identify outliers using descriptive statistics (e.g., mean, standard deviation) or IQR based on volume per user/principal/IP. Cross-reference source IPs with geolocation services and compare against known user/principal locations and typical access times. Flag high-volume transfers originating from unusual locations or outside standard work hours. Correlate with Zeek conn.log for outbound connections to cloud storage provider IPs showing high data transfer volumes."
          },
          "Access to cloud storage objects or containers by unauthenticated/anonymous users or by users/principals without explicit permission.": {
            "Data": "Cloud Provider Storage Access Logs; Cloud Provider IAM Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud storage access logs for successful access events where the principal is logged as 'anonymous' or where the principal lacks the required permissions according to current IAM policies. Filter IAM logs for recent policy or permission changes that may have inadvertently granted overly broad access. Investigate any successful access events logged without associated user credentials or from principals whose policies should deny such access by correlating access logs with IAM policy documents."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]