```json
[
  {
    "Is the adversary attempting to discover cloud resources or services? (TA0007 - Discovery)": {
      "Indicators": {
        "T1538 - Cloud Service Dashboard": {
          "Cloud console login from a source IP address known to be malicious, an anonymizing proxy (e.g., TOR), or originating from an unexpected or disallowed Autonomous System (AS).": {
            "Data": "Cloud Provider Activity Logs (e.g., AWS CloudTrail, Azure Activity Logs, Google Cloud Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously ingest console login events from cloud provider activity logs. For each login, correlate the `sourceIPAddress` against high-confidence threat intelligence feeds of malicious IPs, known anonymizing proxy exit nodes, and a curated list of Autonomous System Numbers (ASNs) representing geographies or providers from which legitimate access is not expected. Trigger an alert for any match."
          },
          "Cloud console login or subsequent API activity associated with a User-Agent string from a known offensive cloud security tool, unauthorized vulnerability scanner, or scripting library.": {
            "Data": "Cloud Provider Activity Logs (e.g., AWS CloudTrail, Azure Activity Logs, Google Cloud Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract the `userAgent` field from all cloud console-related events in the activity logs. Compare these against a maintained list of regular expressions and strings matching User-Agents of known offensive cloud tools (e.g., Pacu, CloudMapper), unauthorized scanners, or common scripting libraries (e.g., `boto3`, `python-requests`) that would be anomalous for a legitimate user's browser-based console session. Alert on matches, as this can indicate automated tool usage against the console."
          },
          "Anomalous cloud console login or activity from a user, particularly a high-privilege account, based on deviations from established baselines including geolocation, time of day, or impossible travel scenarios.": {
            "Data": "Cloud Provider Activity Logs (e.g., AWS CloudTrail, Azure Activity Logs, Google Cloud Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each user, establish a statistical baseline of normal console login behavior, including source IP geolocation, ISP/ASN, typical login hours, and session frequency, using historical cloud activity logs. Monitor for new logins and flag significant deviations from this baseline using methods like Z-scores or percentile analysis. Implement 'impossible travel' detection by correlating login timestamps and geolocations. Pay special attention to deviations involving highly privileged accounts (e.g., root, administrator roles)."
          },
          "A rapid, broad, or unusual sequence of read-only 'List', 'Describe', or 'Get' actions performed via the cloud console, indicative of systematic reconnaissance rather than normal administrative activity.": {
            "Data": "Cloud Provider Activity Logs (e.g., AWS CloudTrail, Azure Activity Logs, Google Cloud Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of API calls originating from console sessions by correlating events by user session or identity within a defined time window (e.g., 15 minutes). Identify sessions with an unusually high count of enumeration-related API calls (e.g., `Describe*`, `List*`, `Get*`). Calculate the entropy of service prefixes (e.g., `ec2`, `s3`, `rds`) and action types per session; a high entropy indicates an adversary is broadly enumerating many different types of resources, which is a strong reconnaissance indicator. Use correlation analysis to link these sequences to suspicious login events."
          },
          "Targeted enumeration of sensitive or high-value resources via the cloud console, such as secrets management services, databases containing PII, or critical infrastructure configurations.": {
            "Data": "Cloud Provider Activity Logs (e.g., AWS CloudTrail, Azure Activity Logs, Google Cloud Audit Logs)",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a curated list of sensitive resources and discovery-related API calls (e.g., `secretsmanager:ListSecrets`, `s3:ListBuckets`, `rds:DescribeDBInstances`, `ec2:DescribeSecurityGroups`). Monitor cloud activity logs for these specific events originating from console sessions. Analyze the frequency and context of this access. Use linear regression to determine if access to sensitive resources correlates with other suspicious indicators, such as a recent anomalous login. Alert when a user, especially one who does not typically manage these resources, performs discovery actions against them."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```