[
  {
    "Has the adversary accessed user credentials or session cookies? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1539 - Steal Web Session Cookie": {
          "Access to browser cookie storage files or repositories on endpoints.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (access attempts) and 4656 (handle requests) on endpoints for access attempts targeting known browser cookie database paths (e.g., %APPDATA%\\\\..\\\\Local\\\\<Browser>\\\\User Data\\\\Default\\\\Cookies). Identify processes attempting this access. Use statistical analysis (e.g., frequency distribution, count of accesses per process/user) to detect unusual access patterns by processes or users not typically interacting with these files."
          },
          "Attempts to inject into or dump browser process memory.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 on endpoints, filtering for handle requests targeting browser processes (e.g., chrome.exe, firefox.exe). Analyze requested access masks to identify attempts related to process memory dumping or injection (e.g., READ_CONTROL, VM_READ, VM_WRITE). Correlate with Windows Event ID 4688 to identify suspicious process creations (e.g., procdump, debugging tools) preceding or concurrent with such access attempts."
          },
          "Network traffic patterns indicative of cookie theft via malicious proxy or Man-in-the-Middle (MiTM) attacks.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to external IPs during user login flows to sensitive sites. Analyze Zeek ssl.log for unexpected SSL certificate errors, non-standard cipher suites, or connections to Certificate Authorities not typically seen for known sensitive sites. Analyze Zeek http.log for unusual HTTP headers or request patterns (e.g., unexpected POST requests sending large amounts of data, requests to domains unrelated to the visited site) that could indicate proxying or manipulation. Use frequency analysis or statistical clustering on destination IPs and SSL certificate details to flag outliers."
          },
          "Suspicious process activity or network connections initiated by browser processes, potentially indicating malicious script execution or unauthorized data exfiltration.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints to identify unusual child processes spawned by browser executables (e.g., command shells, scripting engines like wscript.exe/cscript.exe with unusual parameters). Correlate with Windows Event ID 5156 to identify network connections made by these suspicious child processes or directly by the browser process to uncommon external destinations. Analyze Zeek conn.log for connections from internal hosts to external IPs that don't correspond to standard web browsing patterns, particularly if associated with known browser ports (80, 443) but exhibiting unusual traffic volumes or durations. Use entropy analysis on destination IP addresses or ports for connections originating from browser processes; persistently low entropy for a given host might indicate targeted communication."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]