```json
[
  {
    "Is the adversary maintaining persistence through boot or logon autostart execution? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547 - Boot or Logon Autostart Execution": {
          "Presence of files or registry entries in autostart locations with file hashes, names, or values matching known malicious indicators.": {
            "Data": "Sysmon Event ID 1; Sysmon Event ID 11; Sysmon Event ID 13; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation events (Sysmon EID 11) in startup folders and registry modifications (Sysmon EID 13, Windows Event ID 4657) in autostart keys (e.g., HKLM/HKCU ...\\Run). Extract file hashes from the corresponding process creation events (Sysmon EID 1) and cross-reference the hashes, filenames, and registry values against a high-confidence CTI feed of known malware indicators. Alert on any match."
          },
          "Use of common scripting engines (e.g., powershell.exe, wscript.exe, cscript.exe) to execute obfuscated or unusually named scripts from an autostart location.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688, Sysmon EID 1) for scripting engines. Correlate the parent process and execution path with known autostart mechanisms. Flag executions with suspicious command-line patterns (e.g., -enc, -w hidden, -nop) or those launching unusually named scripts (e.g., random characters) or scripts from non-standard locations (e.g., %APPDATA%, %PUBLIC%). Use correlation analysis on command-line argument patterns and entropy measures to score suspiciousness."
          },
          "Creation of a new file or registry key in a common autostart location that is not associated with a known software installation, patching process, or legitimate user action.": {
            "Data": "Windows Event ID 4657; Sysmon Event ID 11; Sysmon Event ID 13",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal modifications to autostart locations (Registry Run keys, Startup folders, Services, etc.) by correlating changes with known good activities like software installations or approved GPO updates. Monitor for any modifications (Sysmon EID 11, 13; Windows EID 4657) that deviate from this baseline. Use time series analysis to detect anomalous spikes in autostart modifications across the environment. Investigate any outlier modifications not attributable to legitimate administrative actions."
          },
          "An autostart process initiating outbound network connections to a rare external destination or exhibiting beaconing behavior shortly after system boot or user logon.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Sysmon Event ID 1; Sysmon Event ID 3",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events at boot/logon (Windows EID 4688, Sysmon EID 1) with subsequent network connection events (Sysmon EID 3, Zeek conn.log). Establish a baseline of normal network destinations for startup processes. Identify processes making connections to low-frequency or previously unseen external IP addresses. Analyze connection timing and frequency using time series analysis to detect periodic, fixed-interval connections indicative of C2 beaconing."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting privilege escalation via boot or logon autostart execution? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547 - Boot or Logon Autostart Execution": {
          "Installation of a new service or modification of an existing one where the service's binary path points to a file with a known malicious hash, especially if configured for autostart with high privileges.": {
            "Data": "Windows Event ID 7045; Sysmon Event ID 13; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon service creation (Windows EID 7045) or ImagePath modification (Sysmon EID 13 targeting HKLM\\SYSTEM\\...\\Services\\*\\ImagePath), capture the hash of the file in the binary path using its process creation event (Sysmon EID 1) or by direct query. Cross-reference this hash against a CTI feed of known malicious file hashes. Alert with high severity if a match is found for a service configured to autostart (Start Type: Auto/Boot) with SYSTEM or Local Administrator privileges."
          },
          "Execution of system utilities (e.g., sc.exe, schtasks.exe, reg.exe) with command-line arguments that create or modify an autostart entry to run with SYSTEM or administrative privileges.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a watchlist of system utilities (`sc.exe`, `schtasks.exe`, `reg.exe`, `wmic.exe`, `powershell.exe`). Monitor process creation events (Windows EID 4688, Sysmon EID 1) for these utilities. Use regular expressions to detect command-line patterns associated with creating/modifying services (`create`, `config binpath=`), scheduled tasks (`/create /sc onlogon /ru SYSTEM`), or privileged registry keys (`add HKLM\\...\\Run`). Correlate execution with user context; flag any such modification attempted by a non-administrative user account."
          },
          "A legitimate system process configured to autostart loading an unsigned or anomalous DLL (potential DLL hijacking), especially from a user-writable path.": {
            "Data": "Sysmon Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor DLL load events (Sysmon EID 7) by processes that normally start at boot or logon (e.g., services.exe, winlogon.exe, userinit.exe). Maintain a baseline of normally loaded DLLs for these processes, including their expected paths and signature status. Flag any instance where these processes load an unsigned DLL or a DLL from an unusual, user-writable path (e.g., C:\\ProgramData\\, %TEMP%). Use descriptive statistics on DLL load locations and signers to identify rare outliers."
          },
          "A low-frequency or previously unseen process launching at boot or logon with SYSTEM privileges or a high integrity level, originating from a non-standard file path.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows EID 4688, Sysmon EID 1) that occur shortly after boot or logon. Filter for processes running as 'NT AUTHORITY\\SYSTEM' or with a high integrity level. Establish a baseline of common privileged startup processes and their file paths. Flag the execution of any process that has a low frequency of occurrence across the environment or originates from an atypical path for a privileged process (e.g., C:\\Users\\, C:\\PerfLogs\\, %APPDATA%). Calculate the entropy of privileged process paths at startup to identify novel locations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```