[
  {
    "Is the adversary maintaining persistence using interrupt signals? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.005 - Trap": {
          "Presence of suspicious or overly broad 'trap' commands in user or system configuration files (e.g., .bashrc, .profile, service scripts).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events involving shell interpreters (like bash/sh in WSL or Cygwin). Analyze command lines for the presence of 'trap' commands or suspicious scripts being executed. Calculate frequency and correlation with specific user sessions or system start-up events."
          },
          "Execution of unexpected or malicious processes originating from a shell or script triggered by an interrupt signal.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes spawned by shell interpreters or scripts. Look for unusual parent-child process relationships. Correlate process executions with Zeek conn.log for suspicious outbound network connections. Use entropy measures on command lines to identify potentially obfuscated or unusual execution parameters."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation via interrupt signals? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.005 - Trap": {
          "Detection of 'trap' commands within scripts or configuration files associated with privileged accounts (e.g., root) or system services.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creation events initiated by privileged users (e.g., System, Administrator or root in WSL/Cygwin). Look for shell or script executions by these users and analyze command lines for 'trap' usage or suspicious commands run in a privileged context. Identify low-frequency command lines associated with these users."
          },
          "Execution of commands via 'trap' that attempt to modify system files, create new privileged users, or execute code with elevated permissions.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4720",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executed by shell interpreters that attempt sensitive system modifications or user management activities (like creating new users, Windows Event ID 4720). Correlate these actions with the user context and execution time. Use time series analysis to detect executions occurring outside of typical administrative windows."
          }
        }
      }
    }
  }
]