[
  {
    "Is the adversary establishing or maintaining persistence by creating or modifying Windows services? (TA0003 - Persistence)": {
      "Indicators": {
        "T1543.003 - Windows Service": {
          "Creation or modification of a Windows service (especially with automatic startup) that does not correlate with known software installations or updates.": {
            "Data": "Windows Event ID 4697, Windows Event ID 7045, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event IDs 4697 and 7045. Identify newly created or modified services. Cross-reference service names and binary paths against a baseline of known legitimate services and recent software installation/update logs. Flag services with unusual names or paths, or those set to automatic startup outside of typical deployment cycles."
          },
          "Changes detected in the Registry configuration of a Windows service, particularly changes to the 'ImagePath' or 'Start' values.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to HKLM\\SYSTEM\\CurrentControlSet\\Services\\* Registry keys. Focus on changes to 'ImagePath' and 'Start' values. Correlate changes with user logon events (4624) and process creation events (4688) involving registry editing tools or scripts. Use time series analysis on the frequency of Registry modifications per host to detect anomalous spikes."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting to escalate privileges by modifying or creating Windows services? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1543.003 - Windows Service": {
          "Execution of command-line utilities (like sc.exe, PnPUtil.exe) or PowerShell cmdlets that create or modify services, especially when run with high privileges.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the parent process is a shell (cmd.exe, powershell.exe) and the command line includes 'sc.exe create', 'sc.exe config', 'PnPUtil.exe', or relevant PowerShell cmdlets (e.g., New-Service, Set-Service). Filter for executions with SYSTEM or Administrator privileges (via associated logon event 4624). Use descriptive statistics to identify rare command-line arguments or execution contexts."
          },
          "Outlier process execution originating from a legitimate Windows service, particularly if the process is not typically associated with that service or is observed for the first time.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 and analyze process trees originating from legitimate service executables (e.g., services.exe). Identify child processes that are not typically launched by the parent service. Cross-reference executed process names and hashes with threat intelligence feeds. Monitor Zeek conn.log for outbound network connections initiated by these suspicious processes. Use outlier detection methods to flag processes with unusual resource usage or network activity patterns."
          }
        }
      }
    }
  }
]