[
  {
    "Is the adversary maintaining persistence using WMI Event Subscriptions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.003 - Windows Management Instrumentation Event Subscription": {
          "Creation of new WMI EventFilter, EventConsumer, or FilterToConsumerBinding objects.": {
            "Data": "Windows Event ID 5861",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5861 or other WMI activity logs for the creation of new EventFilter, EventConsumer, or FilterToConsumerBinding objects. Compare newly created subscriptions against a baseline of known legitimate subscriptions on the host or similar hosts. Flag any unexpected creations for investigation."
          },
          "Suspicious process execution originating from WmiPrvSe.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 or Sysmon Event ID 1 for processes spawned by WmiPrvSe.exe. Analyze the command line and executable of the child process. Flag any suspicious or unrecognized executables or scripts being launched by WmiPrvSe.exe, especially if they are not standard system processes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to elevate privileges using WMI Event Subscriptions? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.003 - Windows Management Instrumentation Event Subscription": {
          "Use of commands or cmdlets to register WMI event subscriptions (e.g., Register-WmiEvent, mofcomp.exe).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 or Sysmon Event ID 1 for command-line arguments containing 'Register-WmiEvent' or 'mofcomp.exe'. Identify the parent process executing these commands. Flag any execution of these tools by non-administrative accounts or from unusual locations/processes."
          },
          "WMI event subscription bindings causing execution with SYSTEM privileges without clear administrative justification.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 or Sysmon Event ID 1 for processes where WmiPrvSe.exe is the parent and the running user is SYSTEM. Analyze the child process executable and command line. Correlate with known legitimate SYSTEM processes spawned by WMI. Investigate any unusual processes running as SYSTEM spawned by WmiPrvSe.exe."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]