[
  {
    "Is the adversary maintaining persistence using COM Hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.015 - Component Object Model Hijacking": {
          "Modification of COM object registry keys (e.g., HKCU\\Software\\Classes\\CLSID\\{CLSID}\\InProcServer32) pointing to suspicious or unknown binary paths.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for registry modifications under HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\. Filter for modifications to InProcServer32 or LocalServer32 values. Identify unknown or suspicious binary paths. Use correlation analysis to link registry modifications to subsequent suspicious process activity (Event ID 4688)."
          },
          "Unusual process creation or activity by legitimate processes that correlates with COM object registry modifications.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Correlate process creation events with prior Windows Event ID 4657 indicating COM registry modification. Analyze command line and parent-child process relationships for suspicious activity following a potential hijack event."
          },
          "Creation or modification of COM objects under HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\ pointing to suspicious locations or binaries.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for ObjectName containing `HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\` and ValueName containing `InProcServer32` or `LocalServer32`. Analyze NewValue for paths pointing outside standard system directories (e.g., C:\\Windows\\System32). Calculate the frequency of modifications to these keys per user account; deviations from baseline activity might indicate suspicious behavior using statistical outlier detection."
          },
          "Network connections initiated by processes that are configured to launch via a potentially hijacked HKCU COM key and are not expected to make external connections.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to HKCU COM keys, noting the target binary path. Monitor Windows Event ID 4688 for processes created from these paths. Correlate with Zeek conn.log for outbound connections originating from these processes (based on host/IP mapping), particularly if the process is typically not expected to make external connections (e.g., explorer.exe). Use correlation analysis based on process ID/name and time to link the registry event to the network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using COM Hijacking? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.015 - Component Object Model Hijacking": {
          "Modification of COM object registry keys under HKEY_LOCAL_MACHINE pointing to suspicious or unknown binary paths, potentially by processes with lower privileges.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for registry modifications under HKEY_LOCAL_MACHINE\\SOFTWARE\\Classes\\CLSID\\. Filter for modifications by processes running as SYSTEM or other high-privilege accounts, or modifications where the writing process has a lower integrity level than the key. Identify unknown or suspicious binary paths."
          },
          "Unusual process creation or activity by system processes (e.g., svchost.exe, explorer.exe) that are configured to run with higher integrity levels, potentially tied to COM object hijacking.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for system process creation (e.g., svchost.exe, explorer.exe) with unusual command lines or parent processes. Correlate these with prior Windows Event ID 4657 showing modifications to HKLM COM keys. Use entropy analysis on process command lines if applicable, or time series analysis to detect unusual frequency or timing of specific system processes starting."
          },
          "Modification of critical HKLM COM object registry keys (e.g., for system components) by processes running with a lower integrity level.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for ObjectName containing `HKEY_LOCAL_MACHINE\\SOFTWARE\\Classes\\CLSID\\`. Filter for modifications targeting well-known system component CLSIDs. Analyze the SubjectLogonId and process information (from correlated Event ID 4688 if needed) to determine the integrity level of the modifying process. Flag modifications to high-privilege keys by processes running at Medium or Low integrity using correlation analysis between the registry event and the writing process's properties."
          },
          "Change in the binary path (InProcServer32 or LocalServer32 value) of a well-known system COM object under HKLM to point to a location outside standard system directories or to an unknown binary.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4657 for ObjectName containing `HKEY_LOCAL_MACHINE\\SOFTWARE\\Classes\\CLSID\\` and ValueName containing `InProcServer32` or `LocalServer32`. Maintain a baseline or whitelist of expected binary paths for common system COM objects. Flag events where the NewValue does not match the baseline or points to a path in temporary directories, user profile directories, or other non-standard locations. Use descriptive statistics to track the frequency of changes to critical COM key values across the environment and identify statistical outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]