[
  {
    "Is the adversary maintaining persistence via malicious kernel modules/extensions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.006 - Kernel Modules and Extensions": {
          "Network traffic patterns consistent with C2 activity originating from a potentially compromised host, potentially related to kernel module backdoors.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn, http, dns) for connections from internal hosts to known malicious C2 IPs or domains. Use correlation analysis to identify hosts exhibiting connection patterns consistent with C2 (e.g., beaconing). Look for connections on unusual ports or protocols originating from systems or users not typically involved in external communications. Investigate outlier connections using descriptive statistics on port/protocol usage."
          },
          "Anomalous process creation or file modifications potentially associated with kernel module installation or malicious tooling.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving compilation tools (e.g., 'gcc', 'make', 'cl.exe') or attempts to execute unusual file types (e.g., '.ko', '.sys' with unusual properties) in sensitive directories. Monitor Windows Event ID 4657 for modifications to critical system files or service configurations that could indicate persistence mechanisms (requires appropriate SACLs). Use time series analysis to detect sudden bursts of activity or changes outside normal maintenance windows."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary achieved privilege escalation using malicious kernel modules/extensions? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.006 - Kernel Modules and Extensions": {
          "Execution of commands or processes potentially involved in attempting to load or manage kernel modules or related tooling.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event ID 4688 (Process Creation). Search for command-line arguments or process names potentially related to loading kernel modules or drivers ('sc.exe' followed by 'create' or 'start' commands for services with type 'kernel' or 'filesystem', or unusual use of compilation tools) potentially executed by low-privilege users. Use frequency analysis to identify rare commands or execution patterns by user and process path."
          },
          "New network connections or elevated process activity originating from a process or user after potential kernel module manipulation attempts.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with Windows Event ID 4688 on the same host, focusing on activity shortly after suspicious process creation events identified in related persistence/escalation detections. Look for new outgoing connections from processes that previously had no network activity, or from users who gained elevated privileges. Use correlation analysis to link unusual network sessions with specific process executions and identify outliers in network connection patterns using descriptive statistics or box plots."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]