[
  {
    "Has the adversary escalated privileges using Setuid/Setgid? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.001 - Setuid and Setgid": {
          "Execution of commands to find SUID/SGID files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation where the command line contains 'find' with arguments like '-perm +4000' or '-perm +2000'. Analyze the process lineage to identify the parent process and user. Calculate the frequency of such command executions per host/user to identify anomalies."
          },
          "Execution of commands (chmod) to set SUID/SGID bits.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation where the command line contains 'chmod' and arguments like '+s', 'u+s', 'g+s', '+4000', '+2000'. Analyze the target file path and the user executing the command. Use correlation analysis to see if `chmod` is executed shortly before unusual binary execution."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using Setuid/Setgid? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.001 - Setuid and Setgid": {
          "Execution of binaries with SUID/SGID properties from paths or with command lines not typical for legitimate use.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of common binaries that can be abused via SUID/SGID (e.g., bash, awk, find, perl) when executed from non-standard system directories (outside /bin, /usr/bin, /sbin, etc.) or with suspicious command-line parameters. Use frequency analysis or clustering on command-line arguments for these binaries to flag outliers."
          },
          "Execution of newly created or modified executable files located in unusual directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation from executable files (e.g., .sh, no extension) located in user directories, /tmp, /var/tmp, or other non-standard locations for system binaries. Correlate execution events with file creation/modification timestamps if available from other data sources to identify recently dropped and executed files. Calculate entropy of file names or paths in these directories to detect randomly named malicious droppers."
          }
        }
      }
    }
  }
]