[
  {
    "Is the adversary establishing persistence using port monitors? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.010 - Port Monitors": {
          "Modification of the Print Monitor Registry keys, specifically adding or changing the 'Driver' value under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Registry value set) for modifications to keys under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors, specifically changes to the 'Driver' value. Analyze the process (via Event ID 4688) making the change and its parent process. Use correlation analysis between Registry modifications and process events to identify unexpected processes making these changes or changes occurring at unusual times."
          },
          "Anomalous DLL files being loaded by spoolsv.exe or API calls to AddMonitor.": {
            "Data": "Windows Event ID 4688, Sysmon Event ID 7",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (Image Load) for spoolsv.exe loading DLLs from locations other than C:\\Windows\\System32 or C:\\Windows\\System64, or loading DLLs with suspicious names or unknown origins. Monitor Windows Event ID 4688 for spoolsv.exe parent process analysis. Use frequency analysis to identify rare DLLs loaded by spoolsv.exe."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting privilege escalation using port monitors? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.010 - Port Monitors": {
          "Modification of the Print Monitor Registry keys by a process without typical SYSTEM privileges or during an unusual system state.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Registry value set) for modifications to keys under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors, focusing on the 'Driver' value. Correlate these events with process creation events (Event ID 4688) and logon events (Event ID 4624) to determine the process integrity level and user context making the change. Flag modifications made by non-SYSTEM processes or during unusual administrative sessions."
          },
          "API calls to AddMonitor originating from unexpected processes or user contexts, or the loading of unusual DLLs by spoolsv.exe associated with processes attempting privilege escalation.": {
            "Data": "Windows Event ID 4688, Sysmon Event ID 7",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (Image Load) for spoolsv.exe loading unusual DLLs. Analyze the process details (Event ID 4688) associated with spoolsv.exe startup and its parent processes. Correlate unusual DLL loads or spoolsv.exe activity with other events indicating privilege escalation attempts occurring around the same time, such as access token manipulation (Sysmon Event ID 22) or suspicious service installations (Windows Event ID 4697)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]