[
  {
    "Is the adversary maintaining persistence through system firmware modification? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.001 - System Firmware": {
          "Execution of known firmware modification utilities or unknown executables with firmware-related command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of known firmware flashing/update tools or process names/command lines containing keywords related to firmware modification (e.g., 'flash', 'bios', 'uefi', device paths like '/dev/nvram'). Analyze frequency and timing of such events. Use correlation analysis to link process execution with network activity (Zeek logs) if tools are downloaded."
          },
          "Persistent, unusual processes starting outside of normal startup mechanisms, potentially launched by modified firmware.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for processes starting with unusual parent processes, unsigned executables running from unusual locations, or processes consistently starting at system boot or logon that are not standard services or startup items. Use descriptive statistics to baseline normal startup processes and identify outliers."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading detection through system firmware modification? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542.001 - System Firmware": {
          "Suspicious process activity attempting low-level system access indicative of firmware interaction.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4688 logs for processes attempting to access low-level system resources or devices potentially related to firmware. If configured, analyze Windows Event ID 4656/4663 for attempts to access specific firmware-related files or device objects. Look for high frequency access or access by unusual accounts/processes."
          },
          "Network connections or process activity initiated very early in the boot process before standard security controls are fully active.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for network connections occurring immediately after system boot (based on system uptime logs or correlations). Analyze Windows Event ID 4688 for processes initiating network connections very early in the boot sequence. Correlate these early connections with suspicious destinations (e.g., known C2, unusual external IPs). Use time series analysis to spot anomalies in boot-time network traffic."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]