```json
[
  {
    "Is the adversary maintaining persistence by auto-starting applications? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.007 - Re-opened Applications": {
          "An executable with a known malicious hash or file path matching a specific threat intelligence report is added to a Windows auto-start location.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to common auto-start registry keys (e.g., HKLM/HKCU...\\Run, ...\\RunOnce). Extract the executable path from the new registry value. Separately, monitor processes created from user Startup folder paths via Windows Event ID 4688. Hash the executables found and correlate these hashes and full file paths against a CTI feed of known malware. Alert on any confirmed match."
          },
          "An auto-start entry's command line contains patterns characteristic of known malware or living-off-the-land techniques, such as suspicious use of system utilities or encoded commands.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process command lines (Event ID 4688) for processes launched from autostart locations and registry values (Event ID 4657) for Run keys. Use regular expressions to search for patterns like `rundll32.exe` calling an export by ordinal, `regsvr32.exe` with `/s /i` flags and a remote resource, or command lines containing `powershell.exe -enc`, `-w hidden`, or `mshta.exe` with a VBScript/JavaScript payload. Maintain and update a library of these patterns associated with malicious persistence techniques."
          },
          "An auto-start entry is created by an unusual parent process (e.g., a Microsoft Office application, web browser) or points to an executable in an atypical location (e.g., %TEMP%, Recycle Bin).": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor registry modifications (Event ID 4657) and correlate the process that created the key with its parent process. Flag Run key modifications made by non-system, non-installer processes like browsers or document editors. For processes starting from auto-run locations (Event ID 4688), analyze their image path. Use frequency analysis and path logic to identify executables running from suspicious or uncommon directories (e.g., %TEMP%, %APPDATA% without a proper subdirectory, Recycle Bin)."
          },
          "A process launched from an auto-start location initiates recurring, beacon-like network connections to an external destination, deviating from established baselines of normal application behavior.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate processes created at login/startup (Event ID 4688) with outbound network connections (Zeek conn.log). For each auto-starting process, use time series analysis to profile connection frequency, data volume, and session duration. Identify processes exhibiting highly regular, periodic connections (beaconing) or connections to low-reputation or newly-registered domains. Establish a baseline of normal network behavior for legitimate auto-start applications and use regression or correlation analysis to alert on significant deviations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary escalated privileges via auto-starting applications? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.007 - Re-opened Applications": {
          "A known privilege escalation tool or malware, identified by file hash or name, is placed in a location that is automatically executed with elevated privileges.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for new services created (Windows Event ID 7045) or processes launched by NT AUTHORITY\\SYSTEM at startup (Windows Event ID 4688). Extract the service or process executable path. Hash the file and cross-reference the hash and filename against a CTI database of known privilege escalation tools (e.g., Juicy Potato, PrintSpoofer) or malware with privilege escalation capabilities. Alert on any confirmed matches."
          },
          "A low-privilege process modifies a file or registry key that is subsequently executed in a high-privilege context during system startup or user logon.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define a set of high-privilege auto-start locations (e.g., HKLM Run keys, service executable paths, privileged scheduled task paths). Monitor for modification events (e.g., file writes, registry set value via Event ID 4657) to these locations. Analyze the user context/integrity level of the process making the change. Flag any instance where a process running as a standard user or at a low/medium integrity level modifies a resource that will be executed as SYSTEM or Administrator upon the next boot/logon. This requires correlating modification events with a subsequent high-privilege process creation event (Event ID 4688) from that location."
          },
          "An unsigned or low-prevalence executable is launched from an auto-start location with SYSTEM or Administrator privileges, indicating a likely unauthorized payload.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter process creation events (Event ID 4688) that occur during startup or logon for processes running with High or System integrity levels. For each of these, check the signature status of the executable file. For all unsigned executables, calculate their prevalence across the environment. Use frequency analysis and external reputation services to flag executables that are both unsigned and rare (e.g., found on <5% of hosts), as this indicates a likely unauthorized and potentially malicious privileged persistence mechanism. Establish a baseline of legitimate unsigned processes that run at startup to reduce false positives."
          },
          "A process that auto-starts with elevated privileges initiates outbound network connections or performs suspicious downstream activity such as creating other processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify auto-starting processes running with High or System integrity (Event ID 4688). Correlate these processes with outbound network connections (Zeek conn.log) using timestamp and source host. Baseline the normal network behavior for legitimate privileged system services. Use descriptive statistics and correlation analysis to flag any new or unusual outbound connections, especially to external destinations. Further, monitor for suspicious child processes or DLL loads originating from these privileged auto-start processes as this may indicate payload execution."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```