[
  {
    "Is the adversary maintaining persistence using COM Hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.015 - Component Object Model Hijacking": {
          "Modification of COM object registry keys (e.g., HKCU\\Software\\Classes\\CLSID\\{CLSID}\\InProcServer32) pointing to suspicious or unknown binary paths.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for registry modifications under HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\. Filter for modifications to InProcServer32 or LocalServer32 values. Identify unknown or suspicious binary paths. Use correlation analysis to link registry modifications to subsequent suspicious process activity (Event ID 4688)."
          },
          "Unusual process creation or activity by legitimate processes that correlates with COM object registry modifications.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Correlate process creation events with prior Windows Event ID 4657 indicating COM registry modification. Analyze command line and parent-child process relationships for suspicious activity following a potential hijack event."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges using COM Hijacking? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.015 - Component Object Model Hijacking": {
          "Modification of COM object registry keys under HKEY_LOCAL_MACHINE pointing to suspicious or unknown binary paths, potentially by processes with lower privileges.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for registry modifications under HKEY_LOCAL_MACHINE\\SOFTWARE\\Classes\\CLSID\\. Filter for modifications by processes running as SYSTEM or other high-privilege accounts, or modifications where the writing process has a lower integrity level than the key. Identify unknown or suspicious binary paths."
          },
          "Unusual process creation or activity by system processes (e.g., svchost.exe, explorer.exe) that are configured to run with higher integrity levels, potentially tied to COM object hijacking.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for system process creation (e.g., svchost.exe, explorer.exe) with unusual command lines or parent processes. Correlate these with prior Windows Event ID 4657 showing modifications to HKLM COM keys. Use entropy analysis on process command lines if applicable, or time series analysis to detect unusual frequency or timing of specific system processes starting."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]