[
  {
    "Has the adversary escalated privileges or bypassed macOS TCC controls? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.006 - TCC Manipulation": {
          "Execution of unexpected child processes under the context of trusted macOS applications potentially visible via process creation logs or subsequent network activity.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify processes launched by potentially abused parent processes (e.g., system utilities, seemingly trusted applications). Analyze entropy or frequency of command-line arguments for unusual variations. Correlate with Zeek conn.log for subsequent network connections from these processes."
          },
          "Modification or access attempts on system configuration files potentially including TCC database files, followed by unauthorized activity.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for attempts to access/modify sensitive configuration files (substituting for TCC.db access). Analyze access patterns (e.g., frequency, time of access, user context). Correlate with process execution logs (Event ID 4688) to identify the process performing the access and look for subsequent unusual activity."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using macOS TCC manipulation? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.006 - TCC Manipulation": {
          "Unauthorized access or exfiltration attempts of sensitive data following potential TCC bypass, visible in file access or network logs.": {
            "Data": "Windows Event ID 4663, Zeek conn.log, Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for read/write/delete activity on sensitive data files. Analyze Zeek conn.log and http.log for large outbound data transfers or connections to unusual external destinations originating from potentially compromised hosts, using time series analysis to identify spikes in egress traffic."
          },
          "Execution of unsigned or unusual scripts/binaries originating from privileged contexts, potentially leading to anomalous network connections.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of scripts or binaries with unusual command-line arguments or originating from unexpected parent processes or locations. Analyze the frequency and correlation of these executions with connections observed in Zeek conn.log to identify potentially malicious network communication."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]