[
  {
    "Is the adversary maintaining persistence using login items? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.015 - Login Items": {
          "Creation or modification of files in user startup directories or login item configuration locations containing references to suspicious executables.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes writing to user startup folders (%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup). Analyze command line arguments. Use correlation analysis to identify processes writing to startup folders that also exhibit other suspicious behaviors (e.g., downloaded files, network connections)."
          },
          "Unusual processes launching automatically at user login exhibiting suspicious behavior (e.g., high network traffic, unusual parent process).": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 where the Parent Process is explorer.exe and the process starts from a user startup folder. Analyze Zeek conn.log for network connections initiated by these processes. Identify rare process names or network destinations using frequency analysis and potentially entropy analysis on destination strings."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting to escalate privileges using login items? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.015 - Login Items": {
          "Process creation events indicating execution of scripting engines or API calls associated with manipulating startup persistence locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of scripting engines (e.g., powershell.exe, cscript.exe, wscript.exe) with command line arguments indicating manipulation of registry keys or files related to startup persistence (e.g., Run keys, Startup folder paths). Look for suspicious argument patterns using keyword matching or correlation with other events."
          },
          "Processes launched at login attempting network connections to known malicious IPs or requesting elevated privileges unexpectedly.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections initiated shortly after user logon (correlated with Windows Event ID 4624) from processes identified via Windows Event ID 4688 as starting from startup locations. Inner join connection logs with threat intelligence feeds. Analyze destination IPs and ports using frequency distribution to identify rare or malicious destinations. Look for process behaviors indicative of privilege escalation attempts."
          }
        }
      }
    }
  }
]