[
  {
    "Is the adversary establishing persistence using screensaver configuration? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.002 - Screensaver": {
          "Registry modifications to screensaver settings (HKCU\\Control Panel\\Desktop) to point to non-standard executables or disable security.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to keys under HKCU\\Control Panel\\Desktop related to SCRNSAVE.exe, ScreenSaveActive, ScreenSaverIsSecure, and ScreenSaveTimeout. Establish baseline values/patterns for these settings across user groups. Identify outliers where SCRNSAVE.exe path is outside C:\\Windows\\System32 or C:\\Windows\\sysWOW64, ScreenSaveActive is '1', or ScreenSaverIsSecure is '0'. Correlate with user activity logs to identify unauthorized changes."
          },
          "Execution of .scr files from unusual directories or with unusual command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the image file ends with '.scr'. Analyze the full path and command-line arguments. Compare observed paths/arguments to a list of known legitimate screensavers and parameters. Use frequency analysis to identify rare or never-before-seen .scr executions or command lines. Focus analysis on executions originating from user profile directories or temporary folders."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary elevating privileges via screensaver execution? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.002 - Screensaver": {
          "Execution of .scr files by user accounts or from locations not typically associated with screensaver execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for .scr process creations. Analyze the 'SubjectUserName' and 'NewProcessName' fields. Identify .scr executions performed by SYSTEM or other high-privilege accounts outside of OS updates or installations. Use clustering or anomaly detection to group common user/process/path combinations for .scr execution and flag deviations."
          },
          "Suspicious child processes spawned by legitimate or malicious .scr processes, particularly those requesting elevated privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688, specifically correlating parent processes ending in '.scr' with their child processes. Analyze the command line and new process name of child processes. Look for child processes attempting to launch with elevated privileges or connect to network resources. Use correlation analysis to link suspicious child process behavior back to the initiating .scr execution."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]