[
  {
    "Is the adversary establishing or maintaining persistence by creating or modifying system processes? (TA0003 - Persistence)": {
      "Indicators": {
        "T1543 - Create or Modify System Process": {
          "Creation or modification of system services (Windows Services, Linux Daemons, macOS Launch Daemons/Agents) not associated with known software installations or system updates.": {
            "Data": "Windows Event ID 4697, Windows Event ID 7045, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697, 7045, and 4688 for service creation/modification events. Correlate events with known system update/software installation schedules. Identify outliers by comparing new service names, executable paths, and configurations against a baseline of approved services using difference analysis or clustering on service properties."
          },
          "Unusual child processes spawned by legitimate system services or daemons.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify processes spawned by known legitimate services (based on parent process ID and executable path). Analyze the command line and executable path of child processes. Use correlation analysis to identify child processes that make suspicious network connections (using Zeek conn.log) or execute known malicious commands."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges by creating or modifying system processes? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1543 - Create or Modify System Process": {
          "Creation or modification of system services configured to run under SYSTEM/root privileges by an unprivileged or non-standard account.": {
            "Data": "Windows Event ID 4697, Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697 and 7045. Extract the Service Account Name and Privileges information. Flag events where a service is created/modified to run as SYSTEM/root but the account performing the creation/modification is not a standard administrative account. Analyze entropy of creating account names or login sessions if needed."
          },
          "Execution of command-line tools (e.g., sc.exe, systemctl, launchctl) used to create, modify, or start system services or daemons, particularly when invoked by suspicious processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation, specifically filtering for command-line arguments containing service control commands or executables like 'sc.exe', 'systemctl', 'launchctl'. Analyze the parent process of these commands. Flag execution of these tools by processes not typically associated with system administration or software deployment. Use time series analysis to detect unusual frequency or timing of these commands."
          }
        }
      }
    }
  }
]