
[
  {
    "Is the adversary maintaining persistence using the Emond service? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.014 - Emond": {
          "Emond rule file or its executed payload matches the hash or command signature of a known malicious actor or malware family.": {
            "Data": "macOS File System Event Logs; macOS Process Execution Logs",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon file creation in '/etc/emond.d/rules/', calculate the file hash. Correlate this hash against a CTI feed of known malicious file hashes. Concurrently, monitor commands executed by the 'sbin/emond' process and match them against a curated list of known malicious command strings or regular expression patterns associated with specific malware families."
          },
          "A new or modified Emond rule file contains a generic pattern for executing arbitrary code, such as invoking a shell or script interpreter.": {
            "Data": "macOS File System Event Logs; macOS File Content Monitoring Logs",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon detection of a new or modified '.plist' file in '/etc/emond.d/rules/', parse the file content. Flag any rule containing a 'RunCommand' or 'RunExecutable' key where the command invokes a script interpreter (e.g., '/bin/sh', '/bin/bash', 'python', 'perl', 'osascript'). This pattern is a highly reliable indicator of malicious persistence, independent of the specific script payload."
          },
          "Anomalous process activity related to Emond, such as a process not normally associated with system administration creating an Emond rule, or 'sbin/emond' spawning any child process.": {
            "Data": "macOS Process Execution Logs; macOS File System Event Logs",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file creation events in '/etc/emond.d/rules/' with the parent process that created the file. Flag creations by unexpected processes (e.g., processes running from user-space directories, document applications, browsers). Separately, establish a baseline of all child processes of 'sbin/emond'. Since legitimate use is extremely rare, alert on *any* child process spawned by 'sbin/emond' and investigate its command line and subsequent activity. Use descriptive statistics to confirm that child process creation is a zero-frequency event in the baseline environment."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting to escalate privileges via the Emond service? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.014 - Emond": {
          "Commands executed by Emond match specific payloads or arguments used by known public privilege escalation tools or malware.": {
            "Data": "macOS Process Execution Logs",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the command lines of all processes spawned by 'sbin/emond'. Compare the full command strings and their arguments against a curated list of signatures for known macOS privilege escalation exploits or payloads (e.g., specific commands used by Metasploit modules, Empire, or known malware). Alert on any exact or partial matches and treat as high-priority incidents."
          },
          "An Emond rule is created to execute a command that modifies a sensitive system configuration file or directory associated with privilege management.": {
            "Data": "macOS File System Event Logs; macOS Process Execution Logs; macOS File Content Monitoring Logs",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon detection of a new or modified Emond rule, parse its content. Identify 'RunCommand' or 'RunExecutable' actions and check if the command line targets sensitive system resources. Flag patterns such as attempts to modify '/etc/sudoers', add users with 'dscl', write to '/Library/LaunchDaemons' or '/Library/LaunchAgents', or load/unload kernel extensions with 'kextload'/'kextunload'. Use regular expression matching to detect these high-risk command patterns."
          },
          "A sequence of events indicating privilege escalation: an Emond rule is created, and the resulting process execution leads to the creation of a new administrative account or the installation of a secondary, privileged persistence mechanism.": {
            "Data": "macOS File System Event Logs; macOS Process Execution Logs; macOS System Log (logd)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use correlation analysis to detect a sequence of events within a short time window (e.g., 2 minutes): 1. A file is created in '/etc/emond.d/rules/' by an unauthorized process. 2. 'sbin/emond' spawns a new child process. 3. That child process (or its descendants) performs a sensitive follow-on action, such as creating a new user account (monitor 'dscl' execution or system logs for account creation events), or writing a new '.plist' file to '/Library/LaunchDaemons/'. Link the events in the sequence based on timestamps, user context, and process IDs to construct a high-fidelity alert for privilege escalation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
