[
  {
    "Is the adversary maintaining persistence by modifying file associations? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.001 - Change Default File Association": {
          "Unusual process execution triggered by opening a specific file type.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line or parent process indicates execution via a file handler (e.g., explorer.exe launching a non-executable). Identify processes with low frequency of occurrence relative to their parent or file type."
          },
          "Execution of processes in an unusual parent-child relationship, indicating a modified file association handler.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) to identify unusual parent-child process relationships where a file handler (like explorer.exe or a document application) launches an unexpected executable. Map process execution paths and flag deviations from normal behavior using correlation analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges by modifying file associations? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.001 - Change Default File Association": {
          "Processes associated with elevated privileges (e.g., running as SYSTEM) being launched from non-standard file association handlers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes running with elevated privileges (e.g., SYSTEM user) in Windows Event ID 4688. Cross-reference these with the parent process. Flag instances where privileged processes are launched from non-standard or recently introduced parent processes commonly associated with file handlers."
          },
          "Unexpected network connections originating from processes launched via modified file associations.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Join Windows Event ID 4688 data from endpoints/servers with Zeek conn.log data on hostname/IP and timestamp. Identify network connections made by processes launched via file associations. Correlate process execution time with connection time. Use entropy measures on connection properties (like destination IPs/ports) for processes launched this way to identify unusual communication patterns."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]