[
  {
    "Is the adversary maintaining persistence using login items? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.015 - Login Items": {
          "Creation or modification of files in user startup directories or login item configuration locations containing references to suspicious executables.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes writing to user startup folders (%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup). Analyze command line arguments for file write operations to these locations. Use correlation analysis to identify processes writing to startup folders that also exhibit other suspicious behaviors (e.g., downloaded files, network connections) based on related events."
          },
          "Unusual processes launching automatically at user login exhibiting suspicious behavior (e.g., high network traffic, unusual parent process).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 where the Parent Process is explorer.exe or winlogon.exe and the process starts from a user startup folder or common login item locations. Analyze Zeek conn.log for network connections initiated by these processes. Identify rare process names or network destinations using frequency analysis and potentially entropy analysis on destination strings. Correlate process launch events with network traffic timestamps."
          },
          "Modification of Windows Registry Run/RunOnce keys pointing to suspicious executables.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to Registry Run/RunOnce keys (e.g., HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run, HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run). Analyze the 'New Value' field for paths to suspicious executables (e.g., temporary directories, non-standard application locations). Use frequency analysis on target paths and executable names to identify rare additions."
          },
          "Processes launched at user login exhibiting unusual or frequent network connections to external hosts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate processes launched at user login (identified by Windows Event ID 4688 from login-related parent processes like explorer.exe or winlogon.exe, or from standard startup locations) with network connection events (Windows Event ID 5156, Zeek conn.log). Filter for external connections. Use frequency analysis and time series analysis to identify processes making unusual numbers of connections, connecting to rare destinations, or establishing connections outside of normal user activity hours. Calculate connection frequency per process per time window."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to escalate privileges using login items? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.015 - Login Items": {
          "Process creation events indicating execution of scripting engines or API calls associated with manipulating startup persistence locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of scripting engines (e.g., powershell.exe, cscript.exe, wscript.exe) with command line arguments indicating manipulation of registry keys or files related to startup persistence (e.g., Run keys, Startup folder paths) or privilege-related settings. Look for suspicious argument patterns using keyword matching or correlation with other events showing elevated context or system interaction."
          },
          "Processes launched at login attempting network connections to known malicious IPs or requesting elevated privileges unexpectedly.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections initiated shortly after user logon (correlated with Windows Event ID 4624 Logon Type 2) from processes identified via Windows Event ID 4688 as starting from startup/login locations. Inner join connection logs with threat intelligence feeds. Analyze destination IPs and ports using frequency distribution to identify rare or malicious destinations. Look for associated process behaviors indicative of privilege escalation attempts in Windows Event ID 4688 data (e.g., integrity level, parent-child relationships)."
          },
          "Processes launched at user login requesting elevated privileges shortly after execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes started at user login (correlate with Windows Event ID 4624 Logon Type 2) that have an Integrity Level higher than 'Medium' or where the Parent Process has a lower integrity level but the Child Process is elevated. Use correlation analysis to identify processes starting from login items that subsequently trigger a UAC prompt or spawn processes at a High/System integrity level, potentially using frequency analysis on parent-child combinations with integrity level changes."
          },
          "Processes launched at user login attempting to interact with protected operating system resources or spawn processes with elevated privileges.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes launched at user login (correlate Windows Event ID 4688 with Windows Event ID 4624 Logon Type 2). Monitor these processes' command lines and integrity levels in subsequent Windows Event ID 4688 events for attempts to spawn child processes with 'High' or 'System' integrity levels, or indications of interaction with protected system locations or registry keys (based on command line arguments or correlated file/registry events if available, but focus on 4688 data). Use correlation analysis to link the initial login-item process launch to these later events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]