[
  {
    "Is the adversary maintaining persistence by modifying Unix shell configurations? (TA0003 - Persistence)": {
      "Indicators": {
        "Outbound network connections from endpoints/servers to suspicious external IP addresses or domains at times corresponding to user logins, potentially triggered by modified shell configurations.": {
            "Data": "Zeek conn.log, Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for connections/queries from internal hosts to external IPs/domains flagged as suspicious by threat intelligence. Correlate connection/query timestamps with typical user logon events logged by authentication systems. Use time series analysis or statistical methods (e.g., percentiles) to identify unusual network activity patterns occurring specifically during user login periods."
        },
        "Unusual network activity (e.g., connections on non-standard ports, high volume) originating from endpoints/servers potentially executing commands from user shell configurations during logon.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections from endpoints/servers during user logon periods on ports not typically used by standard applications or with data volumes significantly deviating from the norm. Use descriptive statistics or IQR to identify outliers in port usage or data transfer volume during these specific time windows."
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges by modifying Unix shell configurations? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "Outbound network connections from servers or critical systems to suspicious external IP addresses or domains at times corresponding to system startup or privileged user logins, potentially triggered by system-wide shell configurations.": {
            "Data": "Zeek conn.log, Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log from servers and critical systems for connections/queries to external IPs/domains flagged as suspicious by threat intelligence. Correlate connection/query timestamps with known system boot times or administrative user login events. Use time series analysis to detect anomalies occurring specifically during these sensitive time windows."
        },
        "HTTP/HTTPS requests from servers or critical systems to known C2 domains or suspicious URLs at times corresponding to system startup or privileged user logins.": {
            "Data": "Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for requests from servers and critical systems to known C2 domains or suspicious URLs identified via threat intelligence. Correlate timestamps with system startup or administrative user login events. Use correlation analysis to identify network requests that are tightly coupled in time with these critical system events."
        }
      }
    }
  }
]