```json
[
  {
    "Is the adversary maintaining persistence by modifying Unix shell configurations? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.004 - Unix Shell Configuration Modification": {
          "Outbound network connections or DNS queries from a Unix host to a known malicious IP address, domain, or URL, occurring immediately after a user login event.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the timestamps of user login events (inferred from periodic user-driven traffic or sourced from authentication logs) with network logs. Inner join destination IPs/domains/URLs from Zeek conn.log, dns.log, and http.log with a high-confidence CTI feed of known malicious indicators. Alert on any matches that occur within a short time window (e.g., 1-5 minutes) after a user login."
          },
          "Network traffic containing specific patterns or artifacts (e.g., URI patterns, User-Agents, JA3 hashes) associated with common persistence tools or reverse shells, triggered consistently upon user login.": {
            "Data": "Zeek http.log; Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network traffic originating from Unix hosts post-login. Use regular expressions to search Zeek http.log for URI patterns or User-Agents associated with droppers or reverse shells (e.g., `wget ... /payload.sh`, `curl ... | bash`). Analyze Zeek ssl.log for JA3/JA3S hashes known to be used by malicious frameworks. Look for sequences in Zeek conn.log characteristic of a reverse shell being established (e.g., connection to a high port followed by specific interaction patterns). Correlate these patterns with user login events."
          },
          "A user's login consistently triggers network connections to a new or rare external destination (IP/domain/port) not previously associated with that user or their organizational peer group.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal network destinations (IPs, domains, ports) for each user or user group. After a user login, monitor for connections to new destinations. Use frequency analysis and calculate the entropy of destinations per user to identify rare or first-seen destinations. A linear regression model could predict expected traffic volume post-login, with significant deviations flagged as anomalous. Prioritize alerts where the destination is in a low-reputation ASN or country."
          },
          "A user login on a Unix host consistently triggers anomalous connection or authentication attempts to internal Windows resources, such as SMB shares or WinRM services.": {
            "Data": "Zeek conn.log; Zeek smb_mapping.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Unix user login events with subsequent network traffic from the Unix host to internal Windows servers. Monitor Zeek conn.log for connections on ports 445 (SMB) or 5985/5986 (WinRM). Analyze Zeek smb_mapping.log for unusual share access. On the target Windows servers, monitor for a spike in logon failures (Event ID 4625) or unexpected successful logons (Event ID 4624) originating from the Unix host's IP. Use correlation analysis to link the Unix login event with the Windows access attempt."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary escalating privileges by modifying Unix shell configurations? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.004 - Unix Shell Configuration Modification": {
          "Outbound connections from a critical Unix server to a known malicious IP/domain, triggered immediately following a system startup or a privileged user (e.g., root) login.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network traffic from critical servers during boot sequences and following privileged user logins. Inner join destination IPs/domains/URLs from Zeek logs with a CTI feed of malicious indicators. Correlate matches with system event logs indicating boot completion or privileged account login events. Alert on any connection to a known-bad destination that is temporally linked to a privileged system event."
          },
          "Execution of credential harvesting or discovery tools observed through network traffic patterns (e.g., specific LDAP queries, SMB session enumeration) originating from a Unix server immediately after a privileged user login.": {
            "Data": "Zeek conn.log; Zeek ldap.log; Zeek smb_mapping.log; Windows Event ID 4769",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate privileged user logins on Unix servers with subsequent internal network reconnaissance traffic from that server. Monitor Zeek ldap.log for unusual search filters indicative of tools like BloodHound. Monitor Zeek smb_mapping.log for enumeration of shares across many hosts. On Domain Controllers, watch for a spike in Kerberos service ticket requests (Event ID 4769) originating from the Unix host, which may indicate Kerberoasting. Flag any such reconnaissance patterns that consistently follow a privileged login."
          },
          "A system startup or privileged user login on a critical Unix server consistently triggers anomalous outbound network activity, such as connections to residential ISPs, unapproved cloud providers, or on non-standard ports.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a strict baseline of expected network connections for critical servers during startup and normal operation. Monitor for any deviation following a privileged login or boot event. Use descriptive statistics on destination ASNs and ports. Alert on any connections to ASNs associated with residential ISPs or cloud providers not whitelisted for that server. Use box-plots or Inter-Quartile Range (IQR) analysis on destination ports to identify connections to unusual high-numbered ports. A time series analysis can detect anomalous spikes in outbound traffic correlated with privileged logins."
          },
          "A privileged login on a Unix host triggers access to highly sensitive Windows resources, such as Domain Controller administrative shares (C$, ADMIN$), using high-privilege credentials potentially captured from the Unix session.": {
            "Data": "Zeek smb_mapping.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for SMB connections (Zeek smb_mapping.log) from critical Unix servers to Windows Domain Controllers or other high-value servers immediately following a privileged login on the Unix host. Specifically look for attempted access to administrative shares like C$ or ADMIN$. On the target Windows server, correlate these attempts with successful logons (Event ID 4624) using high-privilege accounts (e.g., Domain Admin). Flag any instance where a Unix privileged login is followed by a successful privileged logon to a Windows DC from that same Unix host IP."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```