[
  {
    "Is the adversary maintaining persistence using XDG Autostart entries? (TA0003 - Persistence)": {
      "Indicators": {
        "Creation or modification of unusual `.desktop` files in user XDG autostart directories.": {
          "Data": "Windows Event ID 4663",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor file modification events (e.g., Windows Event ID 4663 forwarded from Linux auditd) targeting files with a '.desktop' extension within standard or configured user-level XDG autostart directories (~/.config/autostart). Collect entropy measurements of the file contents. Flag files with high entropy or names/contents not matching known legitimate applications, potentially using correlation analysis against a baseline of trusted files."
        },
        "Execution of suspicious processes originating from user XDG autostart directories.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor process creation events (e.g., Windows Event ID 4688 forwarded from Linux auditd). Identify processes where the parent process is a known desktop component. Analyze the command line for suspicious patterns or scripts executed from user-level autostart directories. Use time series analysis to identify processes that consistently start at user login times but are not part of the standard user profile."
        },
        "Processes launched from user XDG autostart directories exhibiting unusual network connections or file access patterns.": {
          "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor process creation (Windows Event ID 4688) where the parent process is a desktop component and the executable path is within user autostart directories (~/.config/autostart or derived from XDG variables). Correlate these process starts with network connection events (Windows Event ID 5156, Zeek conn.log). Identify processes that establish connections to unusual external IPs or ports shortly after starting. Use correlation analysis to link process starts to network activity and filter against baseline network behavior."
        },
        "Creation or modification of user XDG autostart files with names mimicking legitimate applications or in unexpected locations.": {
          "Data": "Windows Event ID 4663",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor file modification/creation events (Windows Event ID 4663) in user autostart directories. Compare file names against a baseline of known legitimate autostart entries and application names. Use string comparison or fuzzy matching techniques to identify file names with small character differences or unexpected capitalization/extensions (Masquerading). Analyze the full path for files located in unusual subdirectories within autostart directories."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation using XDG Autostart entries? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "Creation or modification of `.desktop` files in system-wide XDG autostart directories by non-privileged accounts.": {
          "Data": "Windows Event ID 4663; Windows Event ID 4656",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor file modification events (e.g., Windows Event ID 4663 forwarded from Linux auditd) for the /etc/xdg/autostart directory. Correlate these events with the user context (e.g., Windows Event ID 4656 or similar audit events capturing user ID). Flag any modifications not originating from root or administrative accounts. Use descriptive statistics to identify users who are unexpectedly modifying system-wide autostart files."
        },
        "Suspicious processes launched from system-wide XDG autostart attempting privileged operations.": {
          "Data": "Windows Event ID 4688; Windows Event ID 4663",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor process creation events (e.g., Windows Event ID 4688 forwarded from Linux auditd) originating from desktop components that are launched from system-wide autostart (/etc/xdg/autostart). Apply correlation analysis to identify these processes attempting to access sensitive system directories or execute privileged commands (e.g., via Windows Event ID 4663 for access attempts, or command line analysis in 4688). Use linear regression or time series analysis to model normal process behavior at login for system-wide entries and flag deviations indicative of attempts to gain higher privileges or persistent access."
        },
        "Processes launched from system-wide XDG autostart attempting to change user context or execute as root.": {
          "Data": "Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4648",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor process creation events (Windows Event ID 4688) where the executable path is within system-wide autostart (/etc/xdg/autostart). Analyze command lines for keywords like `sudo`, `pkexec`, `su`, or references to scripts that might perform privilege escalation. Correlate with successful logons (Windows Event ID 4624, type 10 - RemoteInteractive, or others indicating new session) or explicit credential use (Windows Event ID 4648) occurring shortly after the autostart process begins, where the target user is `root` or another privileged account. Use correlation analysis to link autostart process execution to subsequent privileged activity."
        },
        "Network connections to suspicious external endpoints originating from processes launched from system-wide XDG autostart directories.": {
          "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
          "Data Platform": "Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor process creation (Windows Event ID 4688) for executables within system-wide autostart directories. Correlate these process starts with network connection events (Windows Event ID 5156, Zeek conn.log). Identify processes that establish connections to known malicious IPs, domains, or unusual external ports shortly after starting. Use correlation analysis and threat intelligence feeds to identify suspicious network destinations and investigate."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]