[
  {
    "Is the adversary maintaining persistence using Winlogon Helper DLLs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.004 - Winlogon Helper DLL": {
          "Suspicious modifications to Winlogon Registry keys (Notify, Userinit, Shell) adding or changing DLL/executable paths.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to the Registry keys 'HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Notify', '\\Userinit', and '\\Shell'. Baseline expected values and alert on any modifications, especially the introduction of new DLL/executable paths. Use historical data to identify statistically infrequent modifications."
          },
          "Anomalous child processes spawned by winlogon.exe or unusual DLLs loaded by processes launched by Winlogon.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the Parent Process is 'winlogon.exe' and the created process is not 'userinit.exe' or 'explorer.exe'. Also monitor for 'userinit.exe' or 'explorer.exe' creating unusual child processes. Analyze the command-line arguments (EventData) for suspicious paths or arguments. Use descriptive statistics on process names/paths launched from winlogon/userinit/explorer to find outliers."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges using Winlogon Helper DLLs? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.004 - Winlogon Helper DLL": {
          "Suspicious modifications to Winlogon Registry keys (Notify, Userinit, Shell) pointing to malicious DLLs/executables that execute with elevated privileges.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 targeting the same Winlogon Registry keys. Investigate modifications that introduce paths to executables or DLLs known to perform malicious actions or that reside in unusual directories, especially if they are configured to execute with system privileges."
          },
          "Anomalous DLL loads or child processes from winlogon.exe or userinit.exe that execute in a privileged context.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes created by 'winlogon.exe' or 'userinit.exe'. Examine process execution details (e.g., command line, path) for anomalies. Correlate with other events to determine process integrity level or user context to identify privileged execution."
          }
        }
      }
    }
  }
]