[
  {
    "Has the adversary escalated privileges or bypassed macOS TCC controls? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.006 - TCC Manipulation": {
          "Execution of unexpected child processes under the context of trusted macOS applications potentially visible via process creation logs or subsequent network activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify processes launched by potentially abused parent processes (e.g., system utilities, seemingly trusted applications). Analyze entropy or frequency of command-line arguments for unusual variations. Correlate with Zeek conn.log for subsequent network connections from these processes."
          },
          "Modification or access attempts on system configuration files potentially including TCC database files, followed by unauthorized activity.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for attempts to access/modify sensitive configuration files (substituting for TCC.db access). Analyze access patterns (e.g., frequency, time of access, user context). Correlate with process execution logs (Event ID 4688) to identify the process performing the access and look for subsequent unusual activity."
          },
          "Execution of processes attempting to access or control sensitive input/output devices or system services from unexpected parent processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Filter for command lines or process names known to interact with sensitive devices (e.g., webcam, microphone drivers, screen capture utilities) or system services. Analyze parent-child relationships to identify if these processes are launched by unexpected or potentially injected parents. Use frequency analysis to baseline normal process interactions with these devices/services and alert on rare occurrences."
          },
          "Modification of system startup locations, scheduled tasks, or security policy settings that could facilitate persistent privileged execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4688, 4698, and 4702. For 4688, search for command lines modifying common persistence locations (e.g., registry Run keys, startup folders). For 4698/4702, monitor for newly created or modified scheduled tasks, especially those configured to run with high privileges or at system startup. Use frequency analysis to detect rare or never-before-seen task names, command lines, or registry modifications."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using macOS TCC manipulation? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.006 - TCC Manipulation": {
          "Unauthorized access or exfiltration attempts of sensitive data following potential TCC bypass, visible in file access or network logs.": {
            "Data": "Windows Event ID 4663; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for read/write/delete activity on sensitive data files. Analyze Zeek conn.log and http.log for large outbound data transfers or connections to unusual external destinations originating from potentially compromised hosts, using time series analysis to identify spikes in egress traffic."
          },
          "Execution of unsigned or unusual scripts/binaries originating from privileged contexts, potentially leading to anomalous network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of scripts or binaries with unusual command-line arguments or originating from unexpected parent processes or locations. Analyze the frequency and correlation of these executions with connections observed in Zeek conn.log to identify potentially malicious network communication."
          },
          "Execution of unsigned code or scripts from unexpected memory regions or unusual parent processes known to have broad system access.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Analyze command lines for execution of script interpreters (e.g., `powershell.exe`, `cmd.exe`, `wscript.exe`) with encoded commands or unusual arguments. Correlate with parent process information to identify executions originating from unexpected or potentially compromised applications. Use frequency analysis on command line arguments or process paths to identify rare executions."
          },
          "Outbound network connections from processes or ports associated with remote control, screen sharing, or file transfer services on hosts where TCC bypass is suspected.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for outbound connections on ports commonly used by remote control (e.g., VNC 5900+, RDP 3389 if unexpected), screen sharing, or file transfer protocols from internal hosts. Correlate with Windows Event ID 4688 to identify the process initiating the connection. Use frequency analysis or time series analysis to detect rare or anomalous connections (e.g., connections to unknown external IPs, connections at unusual times, sudden increase in activity) originating from these service ports or associated processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]