[
    {
        "Is the adversary maintaining persistence using Windows Time Providers? (TA0003 - Persistence)": {
            "Indicators": {
                "T1547.003 - Time Providers": {
                    "Unauthorized modification or creation of registry keys under HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\.": {
                        "Data": "Windows Event ID 4657",
                        "Data Platform": "Servers, Endpoints",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Monitor Windows Event ID 4657 (Registry Value Set) on endpoints and servers. Filter events where the Object Name path is under `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\`. Investigate events with unusual callers (processes, users) or those targeting keys/values outside the standard configuration. Use frequency analysis to detect unusual bursts of modifications."
                    },
                    "Registration of a new, unusual, or unrecognized DLL name in the DllName value of a Time Provider registry key.": {
                        "Data": "Windows Event ID 4657",
                        "Data Platform": "Servers, Endpoints",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Monitor Windows Event ID 4657 for modifications to the `DllName` value under `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\`. Analyze the DLL path and file name. Cross-reference the DLL hash/name with known legitimate system files and threat intelligence. Use frequency analysis to identify rare or newly registered DLLs across the environment."
                    },
                    "Execution of the W32tm.exe utility with parameters used to configure time providers.": {
                        "Data": "Windows Event ID 4688",
                        "Data Platform": "Endpoints, Servers",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Monitor Windows Event ID 4688 for process creations where `New Process Name` ends with `w32tm.exe`. Analyze the `Command Line` field for parameters (`/register`, `/unregister`, `/config`, `/s`, `/manualpeerlist`, etc.) that indicate configuration changes to time providers. Correlate `w32tm.exe` execution by non-SYSTEM users or at unusual times with subsequent W32Time service restarts (Windows Event ID 7036). Use time series analysis to detect execution spikes."
                    },
                    "Outbound network connections from the w32time.exe process to unusual or suspicious external IP addresses or domains.": {
                        "Data": "Zeek conn.log; Windows Event ID 5156",
                        "Data Platform": "Endpoints, Servers, Network devices",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Monitor Zeek conn.log for outbound connections originating from systems where `w32time.exe` is running (requires mapping IPs to hosts). Filter Windows Event ID 5156 (Filtering Platform Connection) on endpoints/servers where the `Process ID` corresponds to `w32time.exe`. Analyze destination IP addresses, ports, and domains. Compare against baseline network activity for `w32time.exe` (typically NTP traffic on UDP 123). Flag connections to non-NTP ports, known malicious IPs/domains (using TI feeds), or destinations outside expected time synchronization sources. Use frequency analysis to identify rare external destinations."
                    }
                }
            },
            "version": "1.1",
            "last_updated": "2025-05-07"
        }
    },
    {
        "Is the adversary attempting privilege escalation by abusing Windows Time Providers? (TA0004 - Privilege-Escalation)": {
            "Indicators": {
                "T1547.003 - Time Providers": {
                    "Failed attempts to modify or create registry keys under HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\ by non-privileged users or processes.": {
                        "Data": "Windows Event ID 4657; Windows Event ID 4663",
                        "Data Platform": "Servers, Endpoints",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Monitor Windows Event ID 4657 (failure audits for Registry Value Set) or 4663 (Object Access - Registry, configured for failure audits) on endpoints and servers. Filter events targeting paths under `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\`. Investigate failed attempts by non-SYSTEM users or unusual processes. Use correlation analysis to link failed registry attempts to other suspicious activity occurring around the same time."
                    },
                    "Execution of the W32Time service process with parameters or in a context indicative of using a modified time provider.": {
                        "Data": "Windows Event ID 4688; Windows Event ID 7036",
                        "Data Platform": "Servers, Endpoints",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Monitor Windows Event ID 4688 (Process Creation) for instances of `w32time.exe`. Correlate these events with detected registry modifications (Evidence 1 & 2 under the Persistence PIR) or unusual service start events (Event ID 7036 for W32Time). Analyze parent processes and command line arguments (if available/logged) for anomalies. Use time series analysis to detect service restarts or executions at unusual times or frequencies compared to baseline."
                    },
                    "Successful modification of Time Provider registry keys by a user account that recently experienced a privilege increase.": {
                        "Data": "Windows Event ID 4657; Windows Event ID 4720; Windows Event ID 4728; Windows Event ID 4732; Windows Event ID 4756",
                        "Data Platform": "Servers, Endpoints",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Monitor Windows Event ID 4657 for successful modifications to `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\`. For each successful modification event, correlate with recent (e.g., within the last 15 minutes) events (4720, 4728, 4732, 4756) indicating the involved user account was created or added to an administrative group. Flag Time Provider modifications performed by accounts immediately following a recorded privilege elevation."
                    },
                    "Attempts (successful or failed) to create new registry subkeys directly under HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\.": {
                        "Data": "Windows Event ID 4656",
                        "Data Platform": "Servers, Endpoints",
                        "NAI": "Insert site-specific NAI here",
                        "Action": "Configure SACLs on `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\` to log handle requests (Windows Event ID 4656). Monitor Event ID 4656 for `Accesses` values indicating `CREATE_KEY` for this registry path. Analyze events involving non-SYSTEM accounts or unusual processes attempting to create new subkeys. Use frequency analysis to establish baseline create attempts (should be rare) and flag anomalous activity."
                    }
                }
            },
            "version": "1.1",
            "last_updated": "2025-05-07"
        }
    }
]