[
  {
    "Is the adversary establishing persistence using application shimming? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.011 - Application Shimming": {
          "Execution of 'sdbinst.exe' to install a custom shim database (.sdb file).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Query Windows Event ID 4688 logs for 'sdbinst.exe' process creations. Analyze command line arguments for the '-q' or '-u' flags and a path to a .sdb file. Correlate with processes writing to %WINDIR%\\AppPatch\\Custom."
          },
          "Presence or repeated modification of custom shim database files or registry entries.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs to log access (Event ID 4656, 4663) on custom shim database files (%WINDIR%\\AppPatch\\Custom\\*.sdb) and relevant registry keys (HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AppCompatFlags\\*). Monitor these logs for write/modify attempts by processes other than expected system installers. Use time series analysis to identify recurring or scheduled modification attempts indicative of persistence."
          },
          "Suspicious behavior of applications known to be targeted by persistence shims, such as unexpected child processes or network connections.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify applications commonly targeted by persistence shims. Monitor Windows Event ID 4688 for these applications and analyze child processes, command lines, and parent relationships for anomalies. Correlate with Zeek conn.log and Windows Event ID 5156 for network connections originating from these applications, especially those to unusual destinations or occurring outside normal patterns. Use frequency and deviation analysis to flag anomalous process execution or network connections."
          },
          "Unusual or repeated access to custom shim database files or registry keys by non-system processes indicating persistence mechanisms.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs to log access (Event ID 4656, 4663) to %WINDIR%\\AppPatch\\Custom\\*.sdb and HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AppCompatFlags\\custom\\*. Filter logs for access by processes other than expected system processes (e.g., services.exe, wininit.exe). Use time series analysis to identify repeated access patterns to these resources, especially during system startup or associated with specific user logons, indicating a persistence mechanism."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation using application shimming? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.011 - Application Shimming": {
          "Execution of 'sdbinst.exe' from an unusual process or by a low-privileged user, potentially indicating UAC bypass.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Query Windows Event ID 4688 logs for 'sdbinst.exe'. Examine parent process ID and user account for executions not originating from trusted system installers or running under administrative privileges. Calculate frequency distribution of parent processes for sdbinst.exe and flag low-frequency or never-seen-before parents. Correlate with login/privilege events (e.g., 4624, 4648) if available."
          },
          "Suspicious process execution immediately following 'sdbinst.exe' activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events for 'sdbinst.exe' with subsequent process creations (within a short time window, e.g., 30 seconds) by the same user or parent process. Investigate processes that run with elevated privileges (if detectable via logging like Event ID 4624 Logon Type 10/Elevated Token) or have suspicious command lines/paths, especially if launched after 'sdbinst.exe' execution."
          },
          "Execution of processes with elevated privileges or sensitive system modifications immediately following the execution of an application targeted by a privilege escalation shim.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4648",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes known targets of privilege escalation shims. Monitor Windows Event ID 4688 for these processes starting. Correlate with subsequent process creations (within seconds), analyzing command lines (4688) and logon context (4624/4648). Flag sequences where the target process execution is quickly followed by actions requiring elevated privileges (e.g., service installation, critical registry/file writes) using correlation analysis."
          },
          "Anomalous network connections originating from standard Windows processes (e.g., explorer.exe) after potential shim application, possibly indicating C2 or data exfiltration.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal network connections (using Zeek conn.log and Windows Event ID 5156) for common Windows processes (e.g., explorer.exe, svchost.exe). Monitor for connections from these processes to unusual external IP addresses, non-standard ports, or known malicious infrastructure. Use deviation analysis and frequency analysis to flag connections that fall outside the established baseline, as this could indicate API redirection or injection via a shim enabling malicious network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]