[
  {
    "Is the adversary maintaining persistence via authentication packages? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.002 - Authentication Package": {
          "Modification of the LSA 'Authentication Packages' Registry key to include a malicious binary.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 targeting the 'Authentication Packages' value under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\. Alert on any modifications, specifically changes adding new DLL paths or modifying existing ones."
          },
          "Suspicious unsigned DLL loaded by the LSA process during boot.": {
            "Data": "Windows Event ID 4691",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4691 (LSA Authentication Package Loaded). Identify packages loaded by the LSA process (LSASS.exe). Cross-reference loaded package names/paths with known legitimate LSA packages. Flag unknown or suspicious paths."
          },
          "Network connections initiated by the LSA process or a process launched by it shortly after a system boot, associated with a suspicious loaded authentication package.": {
            "Data": "Zeek conn.log; Windows Event ID 4691; Windows Event ID 6005; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 6005 (System boot) and 4691 (LSA Package Loaded). Within a short time window (e.g., 5-10 minutes) after a boot event, correlate 4691 events indicating suspicious package loads with Zeek conn.log entries where the source process is LSASS.exe or a process recently created by LSASS (Event ID 4688 parent-child analysis). Flag any external network connections originating from LSASS or its child processes using frequency analysis of destinations."
          },
          "Modification of the LSA 'Authentication Packages' Registry key immediately preceding a system shutdown or reboot event.": {
            "Data": "Windows Event ID 4657; Windows Event ID 6006",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 targeting the 'Authentication Packages' value under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\ for modifications. Correlate these modification events with subsequent Windows Event ID 6006 (System shutdown) occurring within a short time frame (e.g., 1-5 minutes). Flag instances where the LSA auth package key is modified right before a system restart/shutdown."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary achieved privilege escalation via authentication packages? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.002 - Authentication Package": {
          "Attempted modification of the LSA 'Authentication Packages' Registry key.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for audit failures or attempts to modify the 'Authentication Packages' value under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\, especially if auditing is configured for writes/modifications."
          },
          "Detection of an unsigned DLL attempting to load into the LSA process.": {
            "Data": "Windows Event ID 4691",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4691 for LSA package loads. If auditing is configured (e.g., AuditLevel=8 via Image File Execution Options), analyze related logs or Event ID 4691 properties for indications of unsigned DLLs attempting to load into LSASS.exe. Focus on correlation between suspicious activity preceding the attempt and subsequent unusual LSA package loads."
          },
          "Creation of a child process by the LSA process (LSASS.exe) following the loading of a suspicious or unsigned authentication package DLL.": {
            "Data": "Windows Event ID 4691; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4691 (LSA Authentication Package Loaded) and 4688 (Process Creation). Correlate 4688 events where the Parent Process Name is 'lsass.exe' with preceding 4691 events for suspicious/unsigned packages loading within a short time window. LSASS spawning processes is highly unusual; flag any such occurrences, especially when correlated with suspicious DLL loads. Analyze command lines of spawned processes from 4688 using frequency analysis to identify anomalies."
          },
          "Network connections from a system shortly after a suspicious LSA package load, targeting sensitive internal resources or external C2.": {
            "Data": "Windows Event ID 4691; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4691 for suspicious LSA package loads. Within a short time window after such an event, monitor Zeek conn.log for outbound connections from the affected host. Analyze destination IPs/ports for connections to sensitive internal systems (e.g., domain controllers, critical servers) or known external suspicious/C2 IPs (via TI feed correlation). Use frequency analysis or baseline deviation to identify unusual connection destinations or volumes after the suspicious load."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]