[
  {
    "Is the adversary establishing persistence using application shimming? (TA0003 - Persistence)": {
      "Indicators": {
        "Execution of 'sdbinst.exe' to install a custom shim database (.sdb file).": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Query Windows Event ID 4688 logs for 'sdbinst.exe' process creations. Analyze command line arguments for the '-q' or '-u' flags and a path to a .sdb file. Correlate with processes writing to %WINDIR%\\AppPatch\\Custom."
        },
        "Presence or repeated modification of custom shim database files or registry entries.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 logs for processes writing to %WINDIR%\\AppPatch\\Custom\\ or %WINDIR%\\AppPatch\\AppPatch64\\Custom\\, or processes modifying registry keys HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AppCompatFlags\\*. Use time series analysis to identify recurring activity or persistence attempts related to these locations."
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting privilege escalation using application shimming? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "Execution of 'sdbinst.exe' from an unusual process or by a low-privileged user, potentially indicating UAC bypass.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Query Windows Event ID 4688 logs for 'sdbinst.exe'. Examine parent process ID and user account for executions not originating from trusted system installers or running under administrative privileges. Calculate frequency distribution of parent processes for sdbinst.exe and flag low-frequency or never-seen-before parents."
        },
        "Suspicious process execution immediately following 'sdbinst.exe' activity.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Correlate Windows Event ID 4688 events for 'sdbinst.exe' with subsequent process creations (within a short time window) by the same user or parent process. Investigate processes that run with elevated privileges (if detectable via logging) or have suspicious command lines/paths, especially if launched after 'sdbinst.exe' execution."
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]