[
  {
    "Is the adversary maintaining persistence using modified system configuration? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.017 - Udev Rules": {
          "Evidence of unauthorized modification to system configuration files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for processes writing to or modifying system configuration file locations. Identify rare processes or locations by low frequency of occurrence. Use time series analysis to detect sudden spikes in configuration file modification attempts."
          },
          "Execution of unauthorized processes potentially triggered by system events.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for processes lacking typical parent processes or triggered at unusual times or system events. Use correlation analysis to link these processes to specific triggering conditions. Analyze command line entropy if suspicious."
          },
          "Process execution showing write or delete operations targeting specific system configuration file paths commonly abused for persistence.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command line arguments indicative of writing to, modifying, or deleting files in critical system configuration directories (e.g., paths relevant for startup scripts). Identify process names or command patterns frequently associated with legitimate configuration changes and flag outliers using frequency analysis."
          },
          "Suspicious process creation lacking a common parent process or exhibiting characteristics of a detached background process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify processes with parent process ID 0 or a system process ID that is not a common parent for user applications. Correlate with process command lines for unusual arguments or background execution flags. Use descriptive statistics to baseline typical parent processes for common executables and flag significant deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation via system configuration? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.017 - Udev Rules": {
          "Execution of privileged commands from unexpected sources.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for commands executed with high privileges or by system accounts. Correlate these events with successful logon events (Windows Event ID 4624) for service accounts. Use descriptive statistics to identify unusual execution patterns by user or source."
          },
          "Processes executed from sensitive system directories.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for executables originating from sensitive system directories. Calculate frequency of execution from these directories and identify outliers using percentile analysis. Use correlation analysis to link process execution to parent processes or network activity (using Zeek logs)."
          },
          "Execution of processes with elevated privileges exhibiting network connections to unusual external destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) for processes running with elevated privileges (e.g., SYSTEM user) with Windows Event ID 5156 (WFP Connection) or Zeek conn.log entries where the process initiates network connections. Identify connections to unusual or known malicious external IP addresses or domains by joining with threat intelligence feeds. Use frequency analysis on destination IPs and ports for privileged processes to identify rare connections."
          },
          "Modification or execution of files located in system directories related to device drivers or low-level hardware interaction.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure auditing (SACLs) for write and execute permissions on critical system directories potentially related to device drivers. Monitor Windows Event ID 4663 for unauthorized write/delete attempts and Windows Event ID 4688 for execution attempts in these locations by non-standard processes or users. Use frequency analysis to identify rare process executions or file modifications in these paths."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]