[
  {
    "Has the adversary achieved privilege escalation by abusing temporary elevated cloud access? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.005 - Temporary Elevated Cloud Access": {
          "Creation of just-in-time access sessions for privileged roles initiated from an unexpected host or outside established workflows.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections to cloud provider API endpoints (e.g., AWS STS, Azure AD, GCP IAM APIs). Identify source IPs. Analyze volume and frequency of these connections using time series analysis to detect sudden increases or connections from unusual internal hosts. Monitor Windows Event ID 4688 on endpoints/servers for execution of cloud CLI tools (aws, az, gcloud) with arguments related to session tokens or credentials."
          },
          "Service account impersonation or role passing activities detected through analysis of network traffic patterns or host command execution logs.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections to cloud provider identity/access management APIs. Look for patterns or parameters indicative of impersonation or pass-role attempts (e.g., unusual data volume, sequence of API calls, though deep inspection is limited). Monitor Windows Event ID 4688 for cloud CLI commands with arguments like 'assume-role', 'impersonate', 'create-token' executed from unusual locations or by unexpected users."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by using temporary elevated cloud access? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.005 - Temporary Elevated Cloud Access": {
          "Suspicious connections originating from cloud resource IPs (e.g., VMs, functions) to internal network assets or external C2 infrastructure not typical for the resource's function.": {
            "Data": "Zeek conn.log, Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for inbound or outbound connections involving IP ranges associated with cloud resources (e.g., EC2 public IPs, Azure VNet IPs, GCP VM IPs). Analyze source/destination IPs and ports. Use correlation analysis to identify cloud resources making multiple connections to disparate internal or external hosts, potentially indicating impersonation or use as a pivot. Monitor Windows Event ID 4624 for logins to internal systems originating from cloud resource IPs."
          },
          "Resource actions (via passed roles) manifesting as anomalous network traffic patterns originating from cloud assets.": {
            "Data": "Zeek conn.log, Windows Event ID 4624, Windows Event ID 4663",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from cloud resources. Analyze traffic patterns (e.g., volume, destination ports/IPs, protocols) using descriptive statistics to identify deviations from the resource's established baseline behavior. Look for connections to sensitive internal systems or data stores. Monitor Windows Event ID 4624/4663 for access attempts or successful data access originating from cloud resources on internal file shares or sensitive systems."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]