[
  {
    "Has the adversary escalated privileges using sudo or sudo caching? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.003 - Sudo and Sudo Caching": {
          "Successful execution of `sudo` commands by non-standard users or for unusual commands.": {
            "Data": "Audit logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor audit logs for `sudo` command executions where the effective user ID differs from the real user ID. Filter for executions by accounts not typically granted sudo privileges or executions of commands considered high-risk. Use descriptive statistics to profile normal sudo usage per user and identify outliers."
          },
          "Repeated `sudo` command executions within the `timestamp_timeout` period without password prompt, potentially across different terminals if `tty_tickets` is disabled.": {
            "Data": "Audit logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze audit logs for sequences of `sudo` commands by the same user occurring in rapid succession without re-authentication prompts. Check for events indicating `tty_tickets` being disabled in sudo configuration logs. Apply time series analysis to identify periods of unusually frequent sudo usage by a single user/terminal."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading detection using sudo or sudo caching? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.003 - Sudo and Sudo Caching": {
          "Modification of the `/etc/sudoers` file, specifically adding `NOPASSWD` or disabling `tty_tickets` through `Defaults !tty_tickets`.": {
            "Data": "Audit logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor audit logs or file integrity monitoring for changes to `/etc/sudoers`. Parse changes to identify lines containing `NOPASSWD` or `Defaults !tty_tickets`. Alert on any such detected modifications."
          },
          "Unusual frequency, timing, or command arguments associated with `sudo` usage by specific users, potentially obscured via sudo logging options.": {
            "Data": "Audit logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze audit logs for `sudo` command executions, extracting user, command, arguments, and timestamp. Profile baseline usage patterns (frequency, timing, commands) per user using descriptive statistics. Use anomaly detection or entropy measures on command arguments or timing to identify deviations from normal usage that may indicate evasion or unusual activity."
          }
        }
      }
    }
  }
]