
[
  {
    "Is the adversary maintaining persistence using COM Hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.015 - Component Object Model Hijacking": {
          "A COM object registry key (e.g., HKCU\\...\\InProcServer32) is modified to point to a binary file with a known malicious hash.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to COM server keys (InProcServer32, LocalServer32, etc.) under HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\. Extract the new binary path from the event's 'New Value' field. When a change is detected, calculate or retrieve the hash of the specified binary file. Correlate this hash against a threat intelligence feed of known malicious file hashes. Alert on any match."
          },
          "A COM server registry key is modified to point to a script interpreter (e.g., powershell.exe, mshta.exe) with a script file as an argument, a common pattern for fileless persistence.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to COM server keys under HKCU. Use regular expression matching on the new key value to detect patterns where the path points to a known script interpreter (e.g., powershell.exe, wscript.exe, cscript.exe, mshta.exe, rundll32.exe) often followed by command-line arguments. This pattern is highly suspicious and warrants immediate investigation as it is a common technique for executing malicious scripts via COM."
          },
          "A COM server key under HKCU is modified to point to a binary located in a non-standard or suspicious directory, such as a user's temporary folder, appdata, or download directory.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for COM server key modifications under HKCU. Maintain a baseline of standard system paths (e.g., C:\\Windows\\System32). Flag any modification where the new binary path points to a non-standard location (e.g., using regex for `\\Temp\\`, `\\AppData\\`, `\\Downloads\\`, `\\Public\\`). Use descriptive statistics to track the frequency of COM key modifications per host or user and apply outlier detection methods like IQR or Z-scores to identify anomalous rates of change."
          },
          "A legitimate process (e.g., explorer.exe) loads a COM object that subsequently spawns a suspicious child process or initiates an anomalous network connection.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate COM registry modification alerts with subsequent process activity. Monitor Windows Event ID 4688 for legitimate applications (e.g., explorer.exe, svchost.exe) spawning unusual child processes (e.g., cmd.exe, powershell.exe, or unknown binaries from non-standard paths). Further correlate the host's activity with Zeek conn.log to detect if these legitimate processes initiate network connections to rare external destinations. Use time series analysis on a host's network activity to detect new, periodic C2 traffic following a potential hijack event."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary escalating privileges using COM Hijacking? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.015 - Component Object Model Hijacking": {
          "A COM object registry key under HKEY_LOCAL_MACHINE is modified to point to a binary with a known malicious hash.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to COM server keys (InProcServer32, LocalServer32) under HKEY_LOCAL_MACHINE\\SOFTWARE\\Classes\\CLSID\\. Extract the new binary path from the event. When a change is detected, calculate or retrieve the hash of the new binary file and check it against a threat intelligence feed of known malicious file hashes. An alert on a match is a strong indicator of a privilege escalation attempt."
          },
          "Modification of a specific HKLM COM registry key known to be loaded by a high-privilege system process and targeted in public privilege escalation exploits.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a watchlist of specific CLSIDs under HKLM\\SOFTWARE\\Classes\\CLSID\\ known to be targets for privilege escalation (e.g., from public exploit PoCs, threat research, or components known to be loaded by SYSTEM-level services). Monitor Windows Event ID 4657 for any modification to the InProcServer32 or LocalServer32 values of these specific, high-risk CLSIDs. Any change to these keys is highly suspicious and should be immediately investigated as a potential privilege escalation event."
          },
          "A process running at a low or medium integrity level successfully modifies a COM object registry key under HKEY_LOCAL_MACHINE.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for any modification to keys under `HKLM\\SOFTWARE\\Classes\\CLSID\\`. For each modification event, use the Process ID to correlate with a corresponding process creation event (Windows Event ID 4688) or other enriched process data to determine the integrity level of the modifying process. Alert on any instance where a process with an integrity level of 'Medium' or 'Low' modifies an HKLM COM key, as this indicates a likely privilege escalation exploit."
          },
          "A high-privilege system process loads a COM object from a non-standard path or initiates anomalous network activity after a corresponding HKLM COM key modification.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal module loads and binary paths for high-privilege system processes. Correlate HKLM COM key modifications (Windows Event ID 4657) with subsequent process activity (Windows Event ID 4688). Alert when a system process loads a DLL or executes a binary from a path specified in a recent COM hijack alert. Further correlate with Zeek conn.log to detect if these high-privilege processes initiate new or unusual external network connections. Use correlation analysis to link the registry modification time with the start of anomalous process or network behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
