[
  {
    "Is the adversary maintaining persistence via authentication packages? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.002 - Authentication Package": {
          "Modification of the LSA 'Authentication Packages' Registry key to include a malicious binary.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 targeting the 'Authentication Packages' value under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\. Alert on any modifications, specifically changes adding new DLL paths or modifying existing ones."
          },
          "Suspicious unsigned DLL loaded by the LSA process during boot.": {
            "Data": "Windows Event ID 4691",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4691 (LSA Authentication Package Loaded). Identify packages loaded by the LSA process (LSASS.exe). Cross-reference loaded package names/paths with known legitimate LSA packages. Flag unknown or suspicious paths."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary achieved privilege escalation via authentication packages? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.002 - Authentication Package": {
          "Attempted modification of the LSA 'Authentication Packages' Registry key.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for audit failures or attempts to modify the 'Authentication Packages' value under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\, especially if auditing is configured for writes/modifications."
          },
          "Detection of an unsigned DLL attempting to load into the LSA process.": {
            "Data": "Windows Event ID 4691",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4691 for LSA package loads. If auditing is configured (e.g., AuditLevel=8 via Image File Execution Options), analyze related logs or Event ID 4691 properties for indications of unsigned DLLs attempting to load into LSASS.exe. Focus on correlation between suspicious activity preceding the attempt and subsequent unusual LSA package loads."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]