[
  {
    "Is the adversary maintaining persistence via Active Setup? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.014 - Active Setup": {
          "Creation or modification of suspicious Registry keys within the Active Setup hive (HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\).": {
            "Data": "Windows Event ID 4656, Windows Event ID 4657, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656, 4657, and 4663 filtering for object names/paths under HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\. Alert on any creation, deletion, or modification operations in this path, especially focusing on the 'StubPath' value. Baseline normal modifications and flag deviations."
          },
          "Execution of unusual or unrecognized programs triggered by user login via Active Setup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events where the process creation is triggered by a user login and appears to originate from an 'Active Setup' context (requires correlating events/understanding execution flow). Identify processes with unusual names, command lines, or execution directories. Use frequency analysis on process names and paths launched via login events to identify rare occurrences."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges via Active Setup? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.014 - Active Setup": {
          "Creation or modification of Active Setup Registry keys attempting to execute code with elevated privileges or impersonating legitimate system components.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4657, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656, 4657, and 4663 filtering for object names/paths under HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\. Focus on 'StubPath' values that point to system directories (like System32) or known locations used by adversaries for privilege escalation. Use string analysis on StubPath values to identify suspicious patterns or known malicious filenames."
          },
          "Detection of outlier processes originating from 'Active Setup' execution context upon user login, particularly those exhibiting elevated permissions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs from all endpoints and servers. Identify processes created shortly after user login where the parent process or context suggests Active Setup execution. Perform statistical analysis (e.g., descriptive statistics, outlier detection using IQR) on the process names, command line arguments, parent processes, and execution paths of processes launched during login compared to historical baselines. Flag processes that are statistically rare or not seen before, correlating with process integrity levels to identify potential privilege escalation."
          }
        }
      }
    }
  }
]