[
  {
    "Is the adversary maintaining persistence using PowerShell profiles? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.013 - PowerShell Profile": {
          "Creation or modification of PowerShell profile files (profile.ps1) in unexpected locations or user directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write/modify operations on files named 'profile.ps1' in user profile directories ($Home), $PsHome, or common program data paths. Identify creation events using relevant file system monitoring logs if available (if 4663 doesn't cover it, explain limitations or assume capability). Use statistical analysis (e.g., time series) to detect bursts of file modifications/creations outside typical patching/configuration windows."
          },
          "Execution of PowerShell scripts or commands immediately upon PowerShell launch, originating from profile execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes where 'powershell.exe' is created. Correlate 'powershell.exe' process creations with parent processes or sequences indicating logon or initial user activity. Look for command line arguments that execute scripts or commands immediately upon launch, especially if the '-NoProfile' flag is *not* used or if suspicious scripts are referenced. Use entropy measures on command line strings to identify obfuscated commands."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges using PowerShell profiles? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.013 - PowerShell Profile": {
          "Execution of PowerShell profile scripts by high-privilege accounts (e.g., Domain Admins, System) accessing systems.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (powershell.exe execution) with Windows Event ID 4624 (successful logon) to identify which user account launched PowerShell. Filter for executions initiated by high-privilege accounts or service accounts. Use descriptive statistics to identify unusual frequency or timing of PowerShell usage by these accounts."
          },
          "PowerShell command line arguments containing unusual or obfuscated commands initiated by a profile script.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine the command line arguments in Windows Event ID 4688 for 'powershell.exe' processes. Search for keywords associated with profile execution (e.g., '. .\\profile.ps1', '$profile') followed by suspicious command patterns (base64 encoding, unusual script blocks, calls to external executables). Apply correlation analysis between profile execution instances and subsequent suspicious process activity."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]