[
  {
    "Is the adversary maintaining persistence using shortcut modification? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.009 - Shortcut Modification": {
          "Creation or modification of shortcut (.lnk) files in user or system startup folders.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 for '.lnk' file creation/modification events in user or system startup directories (e.g., 'AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup', 'ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'). Identify events not correlated with software installation or updates. Use time series analysis or frequency analysis to detect bursts of shortcut modifications."
          },
          "Shortcut (.lnk) files with unusual properties (e.g., Zone Identifier > 1, suspicious target path, masqueraded icon/name) being created or modified.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze properties of newly created/modified '.lnk' files identified via file system events (Windows Event 4656/4663). Check for specific indicators like a Zone Identifier greater than 1 or unusual target paths pointing to suspicious executables/locations. Correlate with process creation events (Event ID 4688) originating from suspicious LNK execution, analyzing the command line for the target path. Use frequency analysis to identify rare target paths."
          },
          "Execution of shortcut (.lnk) files pointing to unusual or suspicious target paths, especially when the shortcut name or icon attempts masquerading.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for processes launched from a shortcut (.lnk) file. Analyze the command line ('New Process Command Line') to identify the target executable path. Compare target paths against a baseline of known legitimate shortcut targets in startup locations. Flag executions of LNKs pointing to executables in temporary directories, user profile downloads, or other suspicious locations. Use frequency analysis to identify LNK targets that are rarely executed across the environment."
          },
          "Network connections initiated by processes launched from shortcut (.lnk) files, especially if the connection destination is suspicious (e.g., known C2, unusual external IP).": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 where the parent process is explorer.exe (common for startup LNKs) or related login processes, with subsequent network connection events (Windows Event ID 5156, Zeek conn.log) by the child process. Compare destination IPs/domains against threat intelligence feeds and internal baseline network activity. Flag connections to known suspicious infrastructure or those deviating significantly from typical network patterns using descriptive statistics and correlation analysis of connection metrics (e.g., bytes sent/received)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary modified shortcuts for privilege escalation? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.009 - Shortcut Modification": {
          "Modification of existing shortcuts pointing to legitimate system programs to execute adversary code before or instead of the original program.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 for modifications to '.lnk' files located in protected directories or those commonly used to launch system tools. Compare the modified target path (from Event 4663 'Target Filename' if available) against the original or expected path. Flag changes pointing to non-standard or suspicious executable locations using correlation analysis between baseline file properties and current state."
          },
          "Execution of a modified shortcut followed by process creation with elevated privileges or access attempts to restricted resources.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4672; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) events where the parent process is explorer.exe or a login process (indicating startup execution) with subsequent process creation (Event ID 4688) where the new process attempts privileged actions (Event ID 4672) or spawns network connections (Zeek conn.log). Look for deviations from baseline process relationships and network activity using correlation analysis. Use frequency analysis on spawned privileged processes."
          },
          "Modification of shortcut (.lnk) files located in system-wide or protected directories, particularly those used by scheduled tasks or services, to point to potentially malicious executables.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 for file modifications targeting '.lnk' files within system directories (e.g., 'C:\\Windows\\System32', 'C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup') or directories used by privileged users/services. Analyze the new 'Target Filename' property (available in Event ID 4663 if configured) and compare it to a baseline of expected targets for those shortcuts. Flag changes that redirect execution to non-standard or user-writable locations using correlation analysis between baseline LNK properties and observed modifications."
          },
          "Process creation (especially with elevated privileges) originating from execution of shortcut (.lnk) files in system-wide or protected directories, followed by suspicious activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4672",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created where the parent process is a system service, scheduled task executor, or a process running with elevated privileges (e.g., SYSTEM, Administrator), AND the command line involves executing a '.lnk' file located in a system directory. Correlate these events with subsequent privileged actions (Event ID 4672) or suspicious process behavior (anomalous command line arguments in 4688) using correlation analysis and baselining of normal privileged process activity. Identify rare process executions using frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]