[
  {
    "Is the adversary maintaining persistence using Systemd services? (TA0003 - Persistence)": {
      "Indicators": {
        "T1543.002 - Systemd Service": {
          "Creation or modification of Systemd service unit files (.service) in system or user directories, especially in unexpected locations or with suspicious content.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) for writes/modifications to files in standard systemd service directories (/etc/systemd/system, /usr/lib/systemd/system, user directories) and Windows Event ID 4688 for processes creating/modifying these files. Filter for uncommon process names or modifications by non-root/non-system users. Use frequency analysis on file paths and modifying processes to identify anomalies."
          },
          "Suspicious processes spawned with a parent process ID of 1 (systemd), particularly if running unusual executables or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) events. Identify processes spawned with Parent Process ID (PPID) of 1 (analogous to systemd's behavior). Filter for unusual executables, scripts, or command-line arguments initiated this way. Use frequency analysis on process names/command lines associated with PPID 1 to establish a baseline and identify outliers."
          },
          "Changes detected in the content of existing, known Systemd service unit files that alter execution commands.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write or modification operations on known legitimate systemd service files in standard directories. Implement file integrity monitoring or periodic hashing and comparison of known service files. Flag changes to critical directives like `ExecStart`, `ExecReload`, `ExecStop`, `User`, or `WorkingDirectory`. Correlate file changes with process execution events to identify the process making the modification."
          },
          "Creation of symbolic links within Systemd service directories pointing to malicious payloads or scripts for persistent execution.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for the creation of new symbolic links (or other link types like hard links if applicable in the logging) within Systemd service directories (/etc/systemd/system, user directories, etc.). Investigate the target path of newly created links to identify if they point to files outside expected system binary locations or user home directories. Periodically list and review symbolic links in systemd directories."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using Systemd services? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1543.002 - Systemd Service": {
          "Systemd service unit files (.service) with modified `Exec*` directives or `User` directives configured to run as privileged users for non-standard services.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4688 for processes with PPID 1. Compare the command lines or executable paths against a baseline of known legitimate services. Flag services running unusual executables or services configured to run with elevated privileges or as unexpected users based on service name/path. Use descriptive statistics on execution times or arguments to identify anomalous service starts."
          },
          "Execution of `systemctl` or `/usr/sbin/service` commands with parameters indicative of creating, enabling, starting, or modifying suspicious services.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of `systemctl` or `/usr/sbin/service` (or Windows equivalents managing services like `sc.exe` or `powershell` cmdlets). Analyze command line arguments for actions like `enable`, `start`, `install`, `set-property`, or modifications (`edit`) to service configurations that are not part of standard system updates or administration scripts. Use correlation analysis to link suspicious command executions to specific user accounts or source processes."
          },
          "Creation of *new* Systemd service unit files configured to run as a high-privilege user (e.g., root) with suspicious or non-standard executables.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for the creation of new `.service` files in standard systemd directories. For newly created files, attempt to extract or parse content to check for the presence and value of the `User` directive and the path specified in `ExecStart` or `ExecStartPre/Post`. Flag creations where `User` is set to `root` or other high-privilege users AND `ExecStart` points to a non-standard or suspicious executable path. Correlate with Windows Event ID 4688 to see if the specified executable is run with the requested privileges."
          },
          "Execution of unexpected systemd generator executables that dynamically create or modify service units, potentially leading to privilege escalation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation in systemd generator directories (e.g., `/usr/lib/systemd/system-generators/`, `/etc/systemd/system-generators/`). Flag execution of any unknown executables in these directories or known generators executed with unusual command-line arguments, by unexpected users, or with a parent process other than PID 1 (or the system initialization process). Use frequency analysis to baseline generator execution behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]