
[
  {
    "Is the adversary maintaining persistence via authentication packages? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.002 - Authentication Package": {
          "The LSA 'Authentication Packages' registry key is modified to contain a DLL name or path associated with a known malicious tool or threat actor.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to the registry value at `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Authentication Packages`. For each modification, extract the new DLL names added to the multi-string value. Compare these names against a maintained threat intelligence list of known malicious authentication package DLLs (e.g., DLLs used by Mimikatz, Cobalt Strike, etc.). Alert on any matches as a high-fidelity indicator of compromise."
          },
          "An unsigned, abnormally located, or non-standard DLL is loaded as an LSA authentication package at system startup.": {
            "Data": "Windows Event ID 4691",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4691 (LSA Authentication Package Loaded), which occurs during system boot. For each loaded package, validate its digital signature and file path. Maintain a baseline of standard, signed Microsoft authentication packages (e.g., `kerberos.dll`, `msv1_0.dll`, `schannel.dll`) located in `C:\\Windows\\System32\\`. Use descriptive statistics to identify rare or new package names. Alert on any DLLs that are unsigned, signed by an untrusted publisher, or located in a non-standard directory (e.g., `C:\\Users\\`, `C:\\Temp\\`, `C:\\ProgramData\\`)."
          },
          "Any modification to the LSA 'Authentication Packages' registry key, particularly when performed by an unusual process or followed by a forced system reboot.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Windows Event ID 1074",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a high-priority alert for any modification event (Windows Event ID 4657) to `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Authentication Packages`. Correlate this event with the process that initiated the registry change (identified via Windows Event ID 4688 process tracking). Flag modifications made by non-standard processes (e.g., anything other than system installers or `regedit.exe` run interactively by an administrator). Further correlate the modification with subsequent reboot events (Event ID 1074) to detect adversaries forcing the malicious DLL to load for persistence."
          },
          "Anomalous network traffic or process creation originating from the LSASS process immediately following a system boot, indicating a malicious authentication package is active.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 6005",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate system boot events (Windows Event ID 6005) with subsequent anomalous activity from `lsass.exe`. Monitor for `lsass.exe` spawning child processes (via Windows Event ID 4688), which is extremely anomalous and a strong indicator of compromise. Concurrently, monitor Zeek conn.log for any network connections where the source process is `lsass.exe`. Use time series analysis to detect periodic network beacons. Investigate any such activity occurring within minutes of system startup as it indicates a malicious package has successfully established persistence."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary achieved privilege escalation via authentication packages? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.002 - Authentication Package": {
          "A process associated with a known exploitation tool or malware successfully writes a malicious DLL path to the LSA 'Authentication Packages' registry key.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Authentication Packages`. For each successful write, identify the source process via Windows Event ID 4688 (Process Creation) logs if available. Cross-reference the process name or file hash with a threat intelligence database of known malicious tools (e.g., Mimikatz, Cobalt Strike beacons). Alert on any modification performed by a known malicious process, as this confirms the tool used for privilege escalation."
          },
          "A process attempts to write a DLL to the LSA 'Authentication Packages' registry key that does not conform to baseline standards (e.g., is unsigned, has a suspicious path, or is not on an allowlist).": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for both successful and failed attempts to modify `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Authentication Packages`. For each attempt, parse the data being written to extract the DLL path. Flag any attempts to add DLLs that are not on an established allowlist of legitimate packages, especially if the path points to a temporary or user-writable directory (e.g., `C:\\Temp\\`, `C:\\Windows\\Temp\\`, `%APPDATA%`). Use regular expressions to find and alert on these suspicious path patterns."
          },
          "The LSASS process spawns a child process, such as a command shell or PowerShell, immediately after a new, unverified authentication package is loaded into memory.": {
            "Data": "Windows Event ID 4691; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a critical severity alert for any process creation event (Windows Event ID 4688) where the 'ParentProcessName' is `lsass.exe`. This behavior is extremely rare and strongly indicates code execution within LSASS. Use correlation analysis to link this alert with a preceding LSA package load event (Windows Event ID 4691) to confirm the likely infection vector. Immediately investigate the command line of the child process to understand the adversary's immediate post-escalation actions."
          },
          "An immediate burst of anomalous network activity from a host following the loading of a new LSA authentication package, such as connections to known C2 infrastructure or large-scale internal scanning.": {
            "Data": "Windows Event ID 4691; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate LSA package load events (Windows Event ID 4691) with subsequent network connections from that host recorded in Zeek conn.log. Analyze connections occurring within minutes of the load event. Inner join destination IPs against a threat intelligence feed of known C2 servers. Additionally, use statistical methods to detect anomalous patterns, such as a sudden increase in the number of unique internal IPs or ports contacted (indicative of scanning) or a large data transfer to an unusual external destination. Use time series analysis on the host's connection volume to detect a sharp increase immediately following the package load event, indicating successful privilege escalation and follow-on activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
