[
  {
    "Is the adversary maintaining persistence through boot or logon autostart execution? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547 - Boot or Logon Autostart Execution": {
          "Modification or addition of entries in Registry Run keys, Startup folders, or other autostart locations that are not linked to legitimate software installation.": {
            "Data": "Windows Event ID 4657, Sysmon Event ID 12, Sysmon Event ID 13",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 and Sysmon Event ID 12/13 targeting Registry keys associated with autostart (e.g., Run, RunOnce, Startup folders). Baseline normal modifications. Flag changes not correlated with software installs or updates. Use time series analysis to identify sudden bursts of modifications across multiple endpoints."
          },
          "Execution of previously unseen or suspicious processes shortly after system boot or user logon.": {
            "Data": "Windows Event ID 4688, Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688/Sysmon Event ID 1 for processes starting within a short time window after system boot or user logon. Establish a baseline of normal startup processes using descriptive statistics (frequency counts). Flag processes with low frequency or high entropy in process name/path relative to established baselines."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting privilege escalation via boot or logon autostart execution? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547 - Boot or Logon Autostart Execution": {
          "Modification of configuration or binaries for services or scheduled tasks configured to run with high privileges at boot or logon.": {
            "Data": "Windows Event ID 4674, Windows Event ID 4697, Windows Event ID 4700, Windows Event ID 4701, Windows Event ID 4702, Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4674, 4697, 4700-4702 and Sysmon Event ID 1 for changes to service configurations or scheduled tasks set to run as SYSTEM or other privileged accounts, especially those configured for autostart. Correlate these events with known administrative actions or software deployments. Flag anomalous modifications or creations."
          },
          "Processes configured for boot or logon autostart loading suspicious or unknown DLLs.": {
            "Data": "Sysmon Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 for DLL loads by processes identified as running at boot/logon. Maintain a baseline of normally loaded DLLs per process using frequency analysis. Flag processes loading DLLs with low frequency, unknown signers, or suspicious paths, particularly if the process itself is flagged as unusual."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]