[
  {
    "Has the adversary escalated privileges using Setuid/Setgid? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.001 - Setuid and Setgid": {
          "Execution of commands to find SUID/SGID files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation where the command line contains 'find' with arguments like '-perm +4000' or '-perm +2000'. Analyze the process lineage to identify the parent process and user. Calculate the frequency of such command executions per host/user to identify anomalies."
          },
          "Execution of commands (chmod) to set SUID/SGID bits.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation where the command line contains 'chmod' and arguments like '+s', 'u+s', 'g+s', '+4000', '+2000'. Analyze the target file path and the user executing the command. Use correlation analysis to see if `chmod` is executed shortly before unusual binary execution."
          },
          "Execution of sensitive system commands or binaries with elevated privileges from an unexpected user context or path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation of common administrative tools or system binaries (e.g., powershell, cmd, net, tasklist) where the 'SubjectUserName' (user executing) differs significantly from the context or path ('NewProcessName'/'CommandLine') from which it is typically executed. Compare execution patterns to historical data using descriptive statistics to identify rare user/process privilege combinations."
          },
          "Outbound network connections initiated by processes with elevated privileges originating from unexpected user accounts or paths.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 and Zeek conn.log. Correlate Windows Event ID 5156 (Filtering Platform Connection) to identify processes initiating outbound network connections, noting the UserID, ProcessID, and Destination IP/Port. Identify connections made by system processes or processes running with elevated privileges (e.g., SYSTEM, Administrators) when executed from non-standard user sessions or paths. Analyze destination IPs against threat intelligence feeds or historical connection logs using frequency analysis to flag rare destinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using Setuid/Setgid? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.001 - Setuid and Setgid": {
          "Execution of binaries with SUID/SGID properties from paths or with command lines not typical for legitimate use.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of common binaries that can be abused via SUID/SGID (e.g., bash, awk, find, perl if present) when executed from non-standard system directories (outside /bin, /usr/bin, /sbin, etc.) or with suspicious command-line parameters. Use frequency analysis or clustering on command-line arguments for these binaries to flag outliers."
          },
          "Execution of newly created or modified executable files located in unusual directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation from executable files (e.g., .exe, .bat, .sh, no extension) located in user directories, temporary directories (/tmp, /var/tmp), or other non-standard locations for system binaries. Correlate execution events with file creation/modification timestamps if available from other data sources to identify recently dropped and executed files. Calculate entropy of file names or paths in these directories to detect randomly named malicious droppers."
          },
          "Execution of executable files with high entropy names or from highly unusual, temporary, or hidden directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation where the 'NewProcessName' is located in temporary directories (user temp, C:\\Temp), hidden folders, or paths/names with high entropy characteristics (calculate Shannon entropy of file path/name). Analyze command line arguments ('CommandLine') for suspicious patterns or lack of standard arguments. Flag executions based on entropy thresholds and path location anomalies."
          },
          "Suspicious command line arguments used with common binaries known to be abusable via shell escapes, executed from unexpected contexts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of common Windows binaries that can be chained for defense evasion (e.g., powershell, cmd, wmic, certutil). Analyze the 'CommandLine' arguments for complex or obfuscated commands, use of uncommon flags, or attempts to execute code from non-standard sources. Use frequency analysis on command lines for these binaries to identify rare or unique execution patterns that deviate from baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]