```json
[
  {
    "Has the adversary achieved privilege escalation by abusing temporary elevated cloud access? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.005 - Temporary Elevated Cloud Access": {
          "Cloud CLI tools or scripts are executed from a host with a known malicious indicator (e.g., IP address on a watchlist, known malicious file hash) to request temporary elevated cloud access.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate cloud CLI command execution (identified in Windows Event ID 4688 logs) with known malicious file hashes from a threat intelligence feed. Separately, correlate outbound connections to cloud provider IAM/STS API endpoints (from Zeek conn.log) with source IPs on an internal watchlist of compromised or suspicious hosts. Alert on any confirmed matches."
          },
          "Execution of specific cloud CLI commands or scripts associated with assuming roles or impersonating service accounts, especially with unusual or suspicious parameters.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation with Command Line Logging) for execution of cloud CLIs (`aws`, `az`, `gcloud`). Use regular expressions to hunt for command-line arguments containing keywords such as `sts assume-role`, `sts get-session-token`, `iam impersonate-service-account`, `account get-access-token`. Analyze parameters for anomalies, such as requests for unusually long session durations or role names that deviate from standard naming conventions. Use frequency analysis on command-line arguments to spot rare or first-seen patterns."
          },
          "Requests for temporary elevated cloud access (JIT, role assumption) originating from an unapproved or anomalous source, such as a user workstation instead of a designated bastion host, or at an unusual time.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate source hosts/subnets and typical work hours for temporary access requests by monitoring outbound connections to cloud IAM/STS API endpoints in Zeek conn.log and CLI executions in Windows Event ID 4688. Create profiles for users/roles that typically request such access. Use descriptive statistics and percentile analysis to identify requests from low-frequency source IPs or at times that deviate significantly (e.g., >2 standard deviations using Z-score) from the established baseline for that user or role."
          },
          "An identity, after receiving temporary elevated cloud access, immediately performs a sequence of high-risk actions, such as accessing sensitive internal data stores or reconfiguring network security controls.": {
            "Data": "Zeek conn.log; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define a high-risk event sequence. Trigger: an outbound connection to a cloud IAM/STS endpoint (Zeek conn.log) or execution of a role-assumption command (Windows Event ID 4688). Correlate this trigger event with subsequent activity from the source host within a short time window (e.g., 15 minutes). Look for connections to internal database servers, domain controllers, or sensitive file shares (Zeek conn.log), or attempts to access/modify sensitive files or objects (Windows Event ID 4663). Use correlation analysis to link these events by source host and timestamp, and alert on the suspicious sequence."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses by using temporary elevated cloud access? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.005 - Temporary Elevated Cloud Access": {
          "Network traffic from a company-owned cloud resource (e.g., VM, container) to an external destination IP address or domain known to be associated with command and control (C2) infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an up-to-date list of company-owned cloud resource IP ranges. Monitor all outbound traffic from these ranges using Zeek conn.log. Cross-reference destination IPs and domain names (queried in Zeek dns.log) against a high-confidence threat intelligence feed of known C2 servers (updated daily). Inner join network logs with CTI data and alert on any matches, investigating the associated cloud resource and its function."
          },
          "Execution of known defense evasion tools or the explicit clearing of security logs on a cloud resource (e.g., VM) immediately following a temporary privilege escalation event.": {
            "Data": "Windows Event ID 4688; Windows Event ID 1102",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate events indicating temporary privilege escalation (inferred from on-prem CLI usage or from cloud provider logs) with subsequent actions on the affected cloud VM. Monitor Windows Event ID 4688 for process names or command-line arguments matching known defense evasion tools (e.g., Mimikatz, commands to disable security services). Alert immediately on the occurrence of Windows Event ID 1102 (The audit log was cleared) on any cloud resource, especially if it occurs shortly after a temporary access grant."
          },
          "A cloud resource, after being accessed via temporary credentials, initiates unusual network connections to internal enterprise assets, acting as a pivot point for lateral movement.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a network traffic baseline for cloud resources, defining expected internal destinations (e.g., specific application servers, databases). Monitor Zeek conn.log for connections originating from cloud IP ranges to internal assets. Flag connections to unusual destinations (e.g., domain controllers, developer workstations, other network segments) or using non-standard ports. Use entropy measures on destination IPs/ports per source cloud resource to identify scanning behavior. Correlate with Windows Event ID 4624 (successful logon) on the destination hosts to confirm access from cloud resources."
          },
          "A cloud resource communicates with an external destination using anomalous protocols, data volumes, or connection patterns inconsistent with its designated business function, suggesting C2 or data exfiltration.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each class of cloud resource, profile its normal outbound communication patterns (e.g., destination countries, protocols, data volume, connection duration). Monitor Zeek conn.log and dns.log for significant deviations from this baseline. Use time series analysis to detect spikes in data transfer volume. Use frequency analysis to flag connections to rare or previously unseen domains or geolocations. Employ linear regression to model expected data transfer size based on other factors and flag significant residuals. Identify long-running, low-volume connections which may represent interactive C2 channels."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```