[
  {
    "Is the adversary maintaining persistence using AppInit DLLs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.010 - AppInit DLLs": {
          "Modification of AppInit_DLLs Registry values that does not correlate with authorized software installations or patches.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to the AppInit_DLLs Registry keys (HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs and Wow6432Node path). Identify the process responsible for the modification. Correlate modification events with known software installation or patch cycles. Flag changes originating from unusual processes or pointing to unknown DLL paths."
          },
          "Loading of unrecognized or unusual DLLs into multiple processes via AppInit mechanism.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the AppInit_DLLs Registry value for unusual or unknown DLL names listed. Monitor Windows Event ID 4688 for process creation events on systems where user32.dll is loaded (implicitly loading AppInit DLLs). Investigate processes starting where the loaded AppInit DLL is unknown or suspicious based on the registry value, potentially using frequency analysis of DLL names found in the registry value or correlation with suspicious registry modification events (4657)."
          },
          "AppInit_DLLs Registry value contains paths to DLLs in unusual locations (e.g., user directories, temp folders) or paths that don't exist.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to the AppInit_DLLs Registry keys. Extract the 'New Value' field. Parse the list of DLL paths within the New Value. Flag paths that point to user directories (like C:\\Users\\), temporary directories (like %TEMP%), or other common malware locations. Use correlation analysis or frequency analysis to identify paths that are rare or never seen before in these registry values."
          },
          "Processes loading AppInit DLLs exhibit unusual outbound network connections or attempt to access sensitive resources.": {
            "Data": "Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes likely loading AppInit DLLs (based on AppInit registry value and correlation with 4688 process names). Correlate the timing of these process starts with Zeek conn.log entries showing outbound network connections from the same host shortly after. Identify connections to suspicious destinations (e.g., non-corporate IPs, unusual ports). Monitor Windows Event ID 4663 (Object Access) for attempts by these processes to access sensitive files or registry keys (e.g., credential stores, configuration files). Use correlation analysis to link process start events (4688) with network connection events (Zeek) and object access events (4663) within a short time window."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary elevating privileges using AppInit DLLs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.010 - AppInit DLLs": {
          "Loading of unrecognized or unusual DLLs into privileged processes (e.g., system processes) via AppInit.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor AppInit_DLLs registry value for suspicious entries. Monitor Windows Event ID 4688 for creation of privileged processes (processes running as SYSTEM, TrustedInstaller, etc.). Correlate the creation of privileged processes with recent modifications to the AppInit_DLLs key (Event ID 4657) or the presence of a suspicious DLL path listed in that key. Flag privileged processes that start shortly after a suspicious AppInit DLL is configured or loaded."
          },
          "Abnormal process behavior (e.g., network connections, file modifications, child processes) initiated from processes that loaded an unrecognized AppInit DLL.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes likely loading AppInit DLLs (based on AppInit registry value and 4688 process name correlation). Monitor Windows Event ID 4688 for suspicious child processes spawned by these processes or unusual command-line arguments suggesting malicious activity. Analyze Zeek conn.log for outbound network connections originating from the hosts running these processes, focusing on destination ports/IPs not matching known good behavior. Monitor Windows Event ID 4663 for unauthorized access attempts by these processes."
          },
          "Processes that loaded an AppInit DLL attempt to create new processes with elevated privileges or perform system-level actions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes known to load AppInit DLLs (based on AppInit registry value and correlation with 4688 process names/paths). Monitor Windows Event ID 4688 for child processes created by these parent processes. Analyze the 'New Process Name' and 'Token Elevation Type' fields in Event ID 4688 for child processes indicating elevation (e.g., Type 2 or 1 becoming Type 3 'Full') or execution of common privilege escalation tools/commands in the command line. Use frequency analysis or baselining to identify unusual parent-child process relationships for processes loading AppInit DLLs."
          },
          "Privileged processes that loaded an AppInit DLL attempt to access sensitive system configuration (e.g., SAM hive) or credential stores.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure auditing for Windows Event ID 4663 on critical system objects like the SAM registry hive, LSA secrets, or sensitive files. Correlate Event ID 4663 entries showing access attempts to these objects with the accessing process name and ID. Cross-reference the process ID with recent Windows Event ID 4688 events or the AppInit_DLLs registry value to identify if the accessing process is one known to load AppInit DLLs, especially if it's a privileged process. Flag access attempts by processes that loaded a suspicious AppInit DLL or are known system processes exhibiting unusual access patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]