[
  {
    "Is the adversary maintaining persistence using XDG Autostart entries? (TA0003 - Persistence)": {
      "Indicators": {
        "Creation or modification of unusual `.desktop` files in user XDG autostart directories.": {
          "Data": "Windows Event ID 4663",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor file modification events (e.g., Windows Event ID 4663 forwarded from Linux auditd) targeting files with a '.desktop' extension within standard or configured user-level XDG autostart directories (~/.config/autostart). Collect entropy measurements of the file contents. Flag files with high entropy or names/contents not matching known legitimate applications, potentially using correlation analysis against a baseline of trusted files."
        },
        "Execution of suspicious processes originating from user XDG autostart directories.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor process creation events (e.g., Windows Event ID 4688 forwarded from Linux auditd). Identify processes where the parent process is a known desktop component. Analyze the command line for suspicious patterns or scripts executed from user-level autostart directories. Use time series analysis to identify processes that consistently start at user login times but are not part of the standard user profile."
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation using XDG Autostart entries? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "Creation or modification of `.desktop` files in system-wide XDG autostart directories by non-privileged accounts.": {
          "Data": "Windows Event ID 4663, Windows Event ID 4656",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor file modification events (e.g., Windows Event ID 4663 forwarded from Linux auditd) for the /etc/xdg/autostart directory. Correlate these events with the user context (e.g., Windows Event ID 4656). Flag any modifications not originating from root or administrative accounts. Use descriptive statistics to identify users who are unexpectedly modifying system-wide autostart files."
        },
        "Suspicious processes launched from system-wide XDG autostart attempting privileged operations.": {
          "Data": "Windows Event ID 4688, Windows Event ID 4663",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor process creation events (e.g., Windows Event ID 4688 forwarded from Linux auditd) originating from desktop components that are launched from system-wide autostart (/etc/xdg/autostart). Apply correlation analysis to identify these processes attempting to access sensitive system directories or execute privileged commands (e.g., via Windows Event ID 4663). Use linear regression or time series analysis to model normal process behavior at login for system-wide entries and flag deviations indicative of attempts to gain higher privileges or persistent access."
        }
      }
    }
  }
]