[
  {
    "Is the adversary establishing persistence using screensaver configuration? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.002 - Screensaver": {
          "Registry modifications to screensaver settings (HKCU\\Control Panel\\Desktop) to point to non-standard executables or disable security.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to keys under HKCU\\Control Panel\\Desktop related to SCRNSAVE.exe, ScreenSaveActive, ScreenSaverIsSecure, and ScreenSaveTimeout. Establish baseline values/patterns for these settings across user groups. Identify outliers where SCRNSAVE.exe path is outside C:\\Windows\\System32 or C:\\Windows\\sysWOW64, ScreenSaveActive is '1', or ScreenSaverIsSecure is '0'. Correlate with user activity logs to identify unauthorized changes."
          },
          "Execution of .scr files from unusual directories or with unusual command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the image file ends with '.scr'. Analyze the full path and command-line arguments. Compare observed paths/arguments to a list of known legitimate screensavers and parameters. Use frequency analysis to identify rare or never-before-seen .scr executions or command lines. Focus analysis on executions originating from user profile directories or temporary folders."
          },
          "Screensaver executable path changed to a location outside of standard system directories (C:\\Windows\\System32, C:\\Windows\\sysWOW64).": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4657 for changes to HKCU\\Control Panel\\Desktop\\SCRNSAVE.exe. Specifically flag changes where the new value (RegistryValueData) is not within the expected directories C:\\Windows\\System32\\ or C:\\Windows\\sysWOW64\\. Identify changes made by non-standard users or processes using correlation analysis."
          },
          "Network connections initiated by a screensaver process (.scr file execution).": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 where NewProcessName ends in '.scr' with subsequent Windows Event ID 5156 (filtered network connection) and Zeek conn.log entries originating from that process/PID and host. Screensavers should typically not initiate outbound network connections. Flag any .scr process that makes an outbound connection, particularly to unusual destinations or known malicious IPs (using Threat Intelligence correlation). Use time series analysis to identify persistent or unusual network activity patterns from screensaver processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary elevating privileges via screensaver execution? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.002 - Screensaver": {
          "Execution of .scr files by user accounts or from locations not typically associated with screensaver execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for .scr process creations. Analyze the 'SubjectUserName' and 'NewProcessName' fields. Identify .scr executions performed by SYSTEM or other high-privilege accounts outside of expected contexts (e.g., OS updates). Use clustering or anomaly detection to group common user/process/path combinations for .scr execution and flag deviations."
          },
          "Suspicious child processes spawned by legitimate or malicious .scr processes, particularly those requesting elevated privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688, specifically correlating parent processes ending in '.scr' with their child processes. Analyze the command line and new process name of child processes. Look for child processes attempting to launch with elevated privileges (e.g., 'runas' in command line, or subsequent UAC prompt events if captured) or connect to network resources. Use correlation analysis to link suspicious child process behavior back to the initiating .scr execution."
          },
          "Screensaver process (.scr execution) attempting to access protected system resources or modify security configurations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events where the process is an '.scr' file with subsequent access control events (e.g., Windows Event ID 4663 for access to specific files/directories, Windows Event ID 4657 for registry modifications). Identify .scr processes attempting to modify sensitive registry keys or access critical system files outside their normal function. Use frequency analysis to identify rare access patterns by screensaver processes across the environment."
          },
          "Screensaver process (.scr execution) attempting to access process memory or read credential-related files/registry keys.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for .scr process creations. Use correlation analysis to link these events with Windows Event ID 4663 events showing read access attempts to known credential storage locations (e.g., lsass.exe process memory dumps, SAM hive, credential manager files/registry keys) initiated by the .scr process or its child processes. Flag any such access attempt and analyze frequency across hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]