[
  {
    "Is the adversary establishing persistence using accessibility features? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.008 - Accessibility Features": {
          "Unauthorized modification or replacement of accessibility feature binaries (sethc.exe, utilman.exe, etc.) with suspicious executables.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write attempts on accessibility feature binaries (sethc.exe, utilman.exe, osk.exe, etc.) located in System32. Monitor Windows Event ID 4657 for changes to ImagePath values in accessibility feature registry keys. Flag any modifications not tied to patching or legitimate software installs by comparing against known good states or authorized change logs."
          },
          "Changes to Registry keys that control accessibility feature binary paths or pointers (e.g., under Image File Execution Options).": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to registry keys under HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Accessibility and HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options associated with accessibility features. Identify changes to keys like 'Configuration' or 'ApplicationName' or 'Debugger'. Use time series analysis to identify infrequent or anomalous write events to these specific keys."
          },
          "Successful remote desktop network authentications (Logon Type 3) immediately following the execution of a modified accessibility feature binary (e.g., sethc.exe) at the logon screen.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek rdp.log",
            "Data Platform": "Servers; Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful network logons (Windows Event ID 4624, Logon Type 3) or RDP connections (Zeek rdp.log) with the creation of a shell/command process (Windows Event ID 4688, cmd.exe, powershell.exe) where the Parent Process Name is an accessibility feature binary (sethc.exe, utilman.exe, osk.exe, etc.). Look for these event sequences originating from or immediately following a logon screen state."
          },
          "Creation or modification of registry values pointing to accessibility features with suspicious or non-standard executable paths.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for 'SetValue' or 'CreateValue' operations targeting registry keys associated with accessibility features (e.g., under HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Accessibility or HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options). Specifically inspect the 'New Value' field for suspicious executable paths that are not in the expected System32 directory or are not standard Windows binaries. Flag changes by users other than SYSTEM or trusted installers. Use frequency analysis to identify rare registry value modifications."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to escalate privileges using accessibility features? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.008 - Accessibility Features": {
          "Execution of accessibility feature binaries from unexpected locations or with unexpected parameters (potentially indicating replacement).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Filter for processes where the Parent Process Name is an accessibility feature binary (sethc.exe, utilman.exe, osk.exe, etc.) and the New Process Name is a shell or command interpreter (cmd.exe, powershell.exe) or other unexpected process. Use frequency analysis to spot rare parent-child process combinations emanating from accessibility features."
          },
          "Modification of Image File Execution Options (IFEO) debugger registry keys for accessibility features.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for the creation or modification of 'Debugger' values under HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\ followed by the name of an accessibility feature binary (e.g., sethc.exe). Use correlation analysis to link these registry modifications to preceding or subsequent suspicious activity such as file modifications."
          },
          "Execution of processes with SYSTEM privileges originating from a user-initiated accessibility feature trigger at the login screen.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events (e.g., cmd.exe, powershell.exe) where the Parent Process is an accessibility binary (sethc.exe, utilman.exe, osk.exe, etc.). Check the 'TokenElevationType' field in Event ID 4688 for the child process. Flag instances where 'TokenElevationType' indicates high integrity or SYSTEM privileges, especially if correlated with Logon Type 2 (interactive) or 10 (remote interactive) sessions that appear to originate from the login screen."
          },
          "Outbound network connections initiated by shell or command processes (cmd.exe, powershell.exe) that were launched with elevated privileges by an accessibility feature binary.": {
            "Data": "Windows Event ID 5156; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) where a shell/command process (cmd.exe, powershell.exe) is spawned by an accessibility feature binary with subsequent network connection events (Windows Event ID 5156) originating from that shell/command process ID. Also, correlate with Zeek conn.log entries where the source IP/Port matches the behavior of the escalated shell process. Flag outbound connections to unusual or malicious destinations. Use descriptive statistics on connection frequency and destination types to spot anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]