[
  {
    "Has the adversary successfully escalated privileges using elevation control mechanisms? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548 - Abuse Elevation Control Mechanism": {
          "Detection of process launches or modifications associated with known Windows UAC bypass techniques.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command-line arguments or parent-child relationships indicative of UAC bypass (e.g., auto-elevating executables launched from non-standard locations, specific registry hive manipulation tools). Monitor Windows Event ID 4657 for changes to specific user-accessible Registry keys known to be involved in UAC bypass methods. Use correlation analysis to link suspicious process creation events with preceding registry modifications."
          },
          "Execution of privilege escalation commands (e.g., sudo) or processes with elevated privileges observed via process creation logs.": {
            "Data": "Windows Event ID 4688; Zeek software.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and Zeek software.log (if applicable) for command lines containing 'sudo' or other known privilege escalation tools/commands (e.g., runas with specific flags, suspicious PSExec usage). Look for process creations with command lines or metadata that indicate execution as root, NT AUTHORITY\\SYSTEM, or another privileged user. Use frequency analysis on command execution per user and per process name to identify unusual spikes or rare users/processes executing privilege escalation commands."
          },
          "Modification of system service configurations or scheduled tasks by non-privileged accounts.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4698",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to service control manager registry keys (e.g., under `SYSTEM\\CurrentControlSet\\Services`). Monitor Windows Event ID 4698 for new or modified scheduled tasks. Filter events for changes made by accounts without expected administrative privileges based on user/group analysis. Use frequency analysis or baseline comparison to identify unexpected modifications to these critical configuration points."
          },
          "Successful logons or process executions showing a transition from a lower privilege level to a higher one within a user session.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4624 (successful logons) with subsequent Windows Event ID 4688 (process creations) within the same logon session ID. Identify sequences where a process is launched with elevated privileges (e.g., command line containing `runas`, specific UAC auto-elevating executables, or processes launched with high integrity level if that data is captured in 4688) following a standard interactive logon (Logon Type 2). Use correlation analysis to link the initial logon event to the subsequent elevated process creation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using elevation control mechanisms to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548 - Abuse Elevation Control Mechanism": {
          "Loading of unsigned or unusual DLLs by processes running with elevated privileges.": {
            "Data": "Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 7 (Sysmon Image Loaded) logs. Filter events where the process path corresponds to a process running with elevated privileges (e.g., system processes, processes launched via runas/sudo). Check the 'Signed' field. Identify unsigned DLLs loaded by these privileged processes. Use frequency analysis to identify rare or newly observed unsigned DLLs loaded by privileged processes across the environment. Use correlation analysis to link this to execution of the privileged process."
          },
          "Process injection or suspicious process spawning originating from elevated processes.": {
            "Data": "Windows Event ID 8; Windows Event ID 10; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 8 (Sysmon CreateRemoteThread) and Windows Event ID 10 (Sysmon ProcessAccess) for source processes with elevated privileges. Monitor Windows Event ID 4688 for child processes spawned by parent processes with elevated privileges. Identify suspicious relationships (e.g., a core Windows service spawning a command prompt or script interpreter) or target processes (e.g., injecting into explorer.exe from a service process). Apply correlation analysis to link injection/spawning events to potentially malicious code execution or attempts to bypass security tools."
          },
          "Modification of specific Windows Registry keys associated with User Account Control (UAC) behavior.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Registry Value Set) for changes to Registry keys under `HKCU` or `HKLM\\Software` paths specifically known to control UAC behavior or be exploited by UAC bypass techniques (e.g., `ConsentPromptBehaviorAdmin`, `EnableLUA`, AutoElevate entries under `Classes`). Use frequency analysis to identify changes made by non-standard processes or users, or at unusual times, especially if not matching expected system updates or configuration changes."
          },
          "Network connections originating from processes running with newly acquired elevated privileges.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with process privilege levels (if captured or inferable) and compare against Windows Event ID 5156 (Network Connection) and Zeek conn.log entries. Identify network connections originating from processes that have transitioned to or were spawned with elevated privileges, especially if the destination is unusual, external, or associated with C2 infrastructure (via Threat Intelligence correlation). Use correlation analysis to link privilege elevation events (from other evidence points) to subsequent suspicious outbound network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]