
[
  {
    "Is the adversary maintaining persistence using pre-OS boot mechanisms? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542 - Pre-OS Boot": {
          "Network connections from a host to external IP addresses or domains known to be associated with specific bootkit or UEFI implant command and control (C2) infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate all outbound network connections (Zeek conn.log) and DNS queries (Zeek dns.log) against a high-confidence cyber threat intelligence (CTI) feed specializing in malware C2 infrastructure, particularly those linked to known firmware implants or bootkits (e.g., LoJax, TrickBoot, MosaicRegressor). Alert on any matches, as this could indicate that the payload of a persistent pre-OS implant is active and communicating."
          },
          "Execution of known utilities used to modify boot configuration data (BCD), master boot records (MBR), or UEFI variables from an unauthorized process or user context.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a specific watchlist for Windows Event ID 4688 (Process Creation) events for executables like `bcdedit.exe`, `bootsect.exe`, `reagentc.exe`, and other third-party UEFI/firmware flashing utilities. Analyze the command-line arguments for suspicious parameters indicative of persistence (e.g., `bcdedit /set`, `bootsect /nt60 /mbr`). Use correlation analysis to investigate the parent process; execution by non-standard parents (e.g., `winword.exe`, `powershell.exe`) is highly suspicious. Use frequency analysis to flag rare executions of these tools."
          },
          "Anomalous writing activity to raw disk sectors or system-reserved partitions outside of normal patching or installation cycles, potentially indicating MBR/VBR modification.": {
            "Data": "Windows Security Event ID 5145",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for processes accessing physical drives directly by watching for Windows Event ID 5145 (A network share object was checked to see whether client can be granted desired access) where the Object Name corresponds to a raw physical drive (e.g., `\\Device\\Harddisk0\\DR0`). Profile legitimate processes that perform this action (e.g., backup software, disk utilities during maintenance windows). Use time series analysis and descriptive statistics to create a baseline of this activity and alert on deviations or access by unauthorized processes."
          },
          "A system repeatedly failing to boot or generating boot-related error logs, followed by an unexpected successful boot without documented intervention, suggesting a faulty but active bootkit.": {
            "Data": "Windows Event ID 4608; Windows Event ID 4609; Windows System Log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate unexpected shutdown events (e.g., System Event Log ID 6008) with subsequent boot failure logs, followed by a successful startup event (Windows Event ID 4608). Create a time series of boot success/failure states for critical systems. A recurring pattern of [Successful Shutdown -> Startup -> Crash -> Startup -> Success] within a short time window is anomalous and warrants investigation for boot integrity issues that could be symptomatic of a pre-OS implant."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using pre-OS boot mechanisms? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542 - Pre-OS Boot": {
          "Installation of a new service or driver whose file hash matches a known malicious bootkit component used for defense evasion.": {
            "Data": "Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor for the installation of new services (Windows Event ID 7045) or the creation of driver files (inferred from process creation events, Windows Event ID 4688, in driver directories). Extract file hashes from these events (if available in logs) or from the endpoint upon alert. Correlate these hashes against a CTI feed of known malicious bootkit and rootkit components. An exact match is a high-confidence indicator of compromise."
          },
          "Use of boot configuration utilities to disable security controls like Data Execution Prevention (DEP) or to boot into Safe Mode to bypass security software.": {
            "Data": "Windows Event ID 4688; Windows System Event Log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for command-line execution (Windows Event ID 4688) of `bcdedit.exe` with arguments targeting security features (e.g., `/set nx AlwaysOff`, `/set {current} safeboot minimal`). Correlate any such command with subsequent Service Control Manager events (e.g., Event ID 7036) showing critical security services (e.g., Windows Defender, EDR agent) failing to start or stopping after the next reboot. This pattern indicates a deliberate attempt to evade defenses."
          },
          "Security products (e.g., EDR, Antivirus) repeatedly failing to start, crashing, or being reported as disabled after a system reboot, with no corresponding administrative action logs.": {
            "Data": "Windows System Event Log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a baseline of normal security service states on endpoints. Monitor Service Control Manager events for security services entering a stopped state (Event ID 7036) or failing to start (Event IDs 7000, 7009, 7024). Use time series analysis to detect an abnormal increase in these failure events across the environment or on specific hosts, especially following a reboot. Correlate these failures with a lack of authorized change requests or administrative logs to identify potentially malicious tampering by a pre-OS implant."
          },
          "Absence of expected security telemetry from an endpoint that is otherwise active on the network, suggesting host-based sensors have been disabled at a low level.": {
            "Data": "Zeek conn.log; SIEM log ingestion data",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network activity seen in Zeek conn.log with security log data received in the SIEM for each host. Create a regression model to establish the expected volume of security logs (e.g., from an EDR agent) per host based on its network traffic volume. Identify 'ghost assets' — hosts with significant, ongoing network traffic but from which expected security logs have stopped arriving for an anomalous period (e.g., > 1 hour). This discrepancy suggests the host's logging or security agent has been disabled, a key goal of defense evasion via a pre-OS boot compromise."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
