[
  {
    "Is the adversary maintaining persistence by auto-starting applications? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.007 - Re-opened Applications": {
          "Detection of new or modified auto-start entries launching unusual executables or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creations associated with common auto-start locations (e.g., Run keys, Startup folders). Identify processes launched from unusual paths or with unusual parent processes. Use frequency analysis to find rare executables or command lines appearing in auto-start contexts."
          },
          "Outbound network connections from applications configured for auto-start that typically do not make network connections.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 logs (process creation with command line) with Zeek conn.log. Identify network connections initiated by processes launched via auto-start mechanisms. Flag connections from processes known to be typically non-networked. Use correlation analysis between process names/paths and destination IPs/ports to identify suspicious network activity."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary escalated privileges via auto-starting applications? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.007 - Re-opened Applications": {
          "Auto-start of executables or scripts under elevated privileges or unusual user contexts.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for processes created under elevated contexts (e.g., new SCM entries, tasks scheduled to run as SYSTEM/Administrator). Analyze login types (Event ID 4624) associated with auto-start mechanisms that grant elevated privileges. Use descriptive statistics to baseline normal process execution contexts upon login and identify outliers."
          },
          "Auto-start of suspicious unsigned executables or those with low prevalence, launched with elevated privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for processes launched with elevated privileges. Extract process image paths and verify digital signatures. Identify unsigned executables or those with low global prevalence using external threat intelligence/reputation services. Flag unsigned or low-prevalence processes starting in elevated contexts via auto-start mechanisms."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]