```json
[
  {
    "Is the adversary maintaining persistence using WMI Event Subscriptions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.003 - Windows Management Instrumentation Event Subscription": {
          "Presence of WMI subscription components (Filter, Consumer, Binding) with names, queries, or payloads matching known malicious indicators from threat intelligence.": {
            "Data": "Windows Event ID 5861",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Windows Event ID 5861 for WMI subscription component creation. Extract the 'Name' property of new EventFilter, EventConsumer, and FilterToConsumerBinding objects, the 'Query' property of filters, and the command-line/script content of consumers. Correlate these extracted values against a cyber threat intelligence (CTI) feed of known malicious WMI persistence indicators (e.g., names like 'BotFilter', specific filter queries, or payload hashes). Alert on any direct matches."
          },
          "Creation of WMI subscriptions using command-line patterns or script blocks characteristic of known offensive security tools or frameworks (e.g., PowerSploit, Metasploit).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation command lines (Windows Event ID 4688) for execution of `powershell.exe`, `wmic.exe`, or `mofcomp.exe` with arguments indicative of WMI persistence. Use regular expressions to find patterns like `__EventFilter`, `ActiveScriptEventConsumer`, or `CommandLineEventConsumer` in command lines. Simultaneously, monitor PowerShell Script Block logs (Windows Event ID 4104) for function calls like `New-WmiEventFilter`, `Set-WmiInstance`, or `Register-WmiEvent` with suspicious arguments or obfuscated code structures commonly associated with known persistence tools."
          },
          "Creation of a new, non-standard WMI event subscription where the consumer executes a script or binary from a temporary, user-writable, or otherwise unusual directory.": {
            "Data": "Windows Event ID 5861; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the creation of new WMI subscriptions using Windows Event ID 5861. Upon detection, inspect the properties of the EventConsumer component, specifically the command line or script path. Flag any consumers that are configured to execute payloads from non-standard directories (e.g., `%TEMP%`, `%APPDATA%`, `C:\\Users\\*`, `C:\\Windows\\Tasks`, `C:\\ProgramData`). Correlate the WMI creation event with subsequent process creation events (Windows Event ID 4688) spawned by `WmiPrvSe.exe` to confirm the anomalous execution path. Use frequency analysis across the environment to identify rare consumer executable paths."
          },
          "A process spawned by a WMI event subscription (`WmiPrvSe.exe`) establishes a network connection, especially to an external IP address or over a non-standard port.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events on hosts (Windows Event ID 4688) where the parent process is `WmiPrvSe.exe` with network connection logs (Zeek conn.log) originating from the same host endpoint. Establish a baseline of normal network activity for processes legitimately spawned by WMI. Use correlation analysis based on timestamp and source host to alert on any connections to external IP addresses, connections using uncommon protocols or ports, or connections to internal destinations that are unusual for the host. Use time series analysis to detect beaconing behavior from these processes."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting to elevate privileges using WMI Event Subscriptions? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.003 - Windows Management Instrumentation Event Subscription": {
          "Execution of `mofcomp.exe` to compile a Managed Object Format (MOF) file whose file hash matches a known malicious MOF file used for privilege escalation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for `mofcomp.exe` process executions using Windows Event ID 4688. When an execution is detected, trigger an action to retrieve the MOF file specified in the command line. Calculate its file hash and compare it against a CTI database of known malicious files, particularly those associated with privilege escalation. Alert on any matches and investigate the parent process of `mofcomp.exe` to identify the source of the attack."
          },
          "Execution of `mofcomp.exe` with a MOF file located in a world-writable or non-standard directory, or execution of WMI configuration commands by an unexpected process or user.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor command lines (Windows Event ID 4688) for `mofcomp.exe` execution. Analyze the path of the MOF file argument, flagging executions where the file resides in high-risk, non-standard directories like `%TEMP%`, `%APPDATA%`, or user profile folders. Profile the parent process and user context of `mofcomp.exe`; flag executions by processes other than standard system installers or by non-administrative users. Use frequency analysis on parent process names and MOF file parent directories to identify rare, suspicious patterns."
          },
          "A process is spawned by WMI (`WmiPrvSe.exe`) running with SYSTEM privileges, where the child process is not a standard system utility and is launched shortly after a system startup or user logon event.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) where the parent process is `WmiPrvSe.exe` and the process is running as NT AUTHORITY\\SYSTEM. Establish a baseline of legitimate processes spawned by WMI as SYSTEM on similar hosts. Flag any child process that deviates from this baseline. Correlate the timestamp of the anomalous process creation with recent system startup events or user logon events (Windows Event ID 4624) to identify triggers commonly used for privilege escalation. Use descriptive statistics on child process names to find rare executables running as SYSTEM via WMI."
          },
          "Rapid creation and subsequent deletion of a WMI subscription, particularly when the consumer is configured to execute a payload as SYSTEM, indicating a transient mechanism for privilege escalation.": {
            "Data": "Windows Event ID 5861; Windows Event ID 5860",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate WMI subscription creation events (Windows Event ID 5861) with corresponding unbinding or deletion events (Windows Event ID 5860) occurring on the same host within a short time window (e.g., less than 15 minutes). Investigate these transient subscriptions, prioritizing those where the associated consumer command line points to a suspicious payload or script, and the intended execution context is elevated (e.g., SYSTEM). Use time series analysis to detect unusual spikes in the rate of WMI subscription creation/deletion activity on a host or across the environment."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```