
[
  {
    "Has the adversary escalated privileges by manipulating macOS TCC? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.006 - TCC Manipulation": {
          "Direct modification of the TCC.db SQLite database by a known malicious tool or unauthorized process.": {
            "Data": "macOS Endpoint Security Framework (ESF) file events; Process execution events; File hashes",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for any write or modification events on the TCC database file located at `/Library/Application Support/com.apple.TCC/TCC.db`. Correlate the writing process with a list of known-good system processes. Investigate any unauthorized process, especially if its hash matches a known malicious tool, that modifies this file."
          },
          "Execution of command-line tools, such as `sqlite3`, to programmatically alter TCC.db permissions.": {
            "Data": "macOS Endpoint Security Framework (ESF) process events",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process execution events for the `sqlite3` binary where the command-line arguments include the path `/Library/Application Support/com.apple.TCC/TCC.db`. This specific pattern is a strong indicator of direct manipulation. Analyze the parent process of `sqlite3` to add context; execution by a user-launched script or unexpected daemon is highly suspicious."
          },
          "A trusted application with existing TCC permissions (e.g., Terminal, VSCode) spawning an unusual child process that subsequently accesses TCC-protected data or establishes a network connection.": {
            "Data": "macOS Endpoint Security Framework (ESF) process and file events; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal child processes for applications commonly granted broad TCC permissions (e.g., Terminal.app, iTerm.app). Monitor for anomalous parent-child relationships, such as Terminal spawning a downloaded script which then accesses `~/Library/Messages` or `~/Library/Safari`. Correlate process execution data with Zeek conn.log to detect when these unexpected child processes initiate outbound network connections. Use frequency analysis on parent-child pairings to identify rare occurrences."
          },
          "A newly installed or unsigned application rapidly acquiring TCC permissions without a corresponding user approval prompt, followed by suspicious file or network activity.": {
            "Data": "macOS Unified Log; macOS Endpoint Security Framework (ESF) events; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate TCC.db modification events (indicating a permission change) with application installation and execution logs. Use time series analysis to detect when a permission grant occurs within seconds of an application's first run, especially for unsigned applications. Further correlate this event with subsequent high-volume file access to protected locations (`~/Documents`, `~/Desktop`) or new, unexpected network flows observed in Zeek conn.log. The absence of a corresponding approval event in the macOS Unified Log is a key indicator of a behavioral anomaly."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses by manipulating macOS TCC? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.006 - TCC Manipulation": {
          "Network connections to known malicious C2 infrastructure from a process that has inherited sensitive TCC permissions (e.g., screen capture, full disk access).": {
            "Data": "macOS Endpoint Security Framework (ESF) process events; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes with sensitive TCC permissions (e.g., `kTCCServiceScreenCapture`, `kTCCServiceSystemPolicyAllFiles`). Correlate process IDs and associated network activity from these processes with Zeek conn.log data. Inner join the destination IP addresses and domains from these connections against a high-confidence threat intelligence feed of known C2 servers. Alert on any matches."
          },
          "A process with screen capture or accessibility permissions spawning a command-line file transfer utility (e.g., `curl`, `wget`, `ncat`) to exfiltrate data.": {
            "Data": "macOS Endpoint Security Framework (ESF) process events; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection pattern for parent-child process relationships where a parent process known to have `kTCCServiceScreenCapture` or `kTCCServiceAccessibility` permissions (e.g., Zoom, Slack, ScreenCapture.app) spawns a child process of `curl`, `wget`, `ncat`, or other network utilities. Correlate with Zeek conn.log to confirm outbound data transfer. This pattern indicates an adversary is abusing a trusted application's permissions to exfiltrate data captured via its approved access."
          },
          "A process with microphone or camera TCC permissions (`kTCCServiceMicrophone`, `kTCCServiceCamera`) generating sustained, low-bandwidth, periodic outbound network traffic inconsistent with the application's normal function.": {
            "Data": "macOS Endpoint Security Framework (ESF) process events; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline the normal network behavior (e.g., data volume, destination reputation, protocol, connection frequency) of applications with camera/mic access (e.g., Zoom, FaceTime, Teams). Use time series analysis on Zeek conn.log data to detect significant behavioral deviations, such as an application that normally sends megabytes of video data suddenly sending kilobytes in a steady, periodic stream (beaconing). Such behavior may indicate exfiltration of captured audio or keystrokes rather than legitimate conference traffic. Use correlation analysis to link these network patterns to the specific host process."
          },
          "An application gaining Full Disk Access and immediately performing a recursive file enumeration of sensitive user directories, followed by data staging and exfiltration.": {
            "Data": "macOS Endpoint Security Framework (ESF) file and process events; Zeek conn.log; Zeek files.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define a behavioral sequence: 1. A process gains `kTCCServiceSystemPolicyAllFiles` permission. 2. Within minutes, the same process initiates high-volume file read operations across sensitive directories (`~/Documents`, `~/Library/Messages`, `~/Library/Mail`). 3. This is followed by write activity to a temporary staging directory (e.g., `/tmp/`, `~/.Trash/`). 4. Finally, a significant outbound data transfer is observed from the host in Zeek conn.log or Zeek files.log. Correlating this entire sequence of events provides a high-confidence indicator of data theft enabled by TCC bypass."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
