[
  {
    "Is the adversary maintaining persistence using modified system configuration? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.017 - Udev Rules": {
          "Evidence of unauthorized modification to system configuration files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for processes writing to or modifying system configuration file locations. Identify rare processes or locations by low frequency of occurrence. Use time series analysis to detect sudden spikes in configuration file modification attempts."
          },
          "Execution of unauthorized processes potentially triggered by system events.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for processes lacking typical parent processes or triggered at unusual times or system events. Use correlation analysis to link these processes to specific triggering conditions. Analyze command line entropy if suspicious."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation via system configuration? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.017 - Udev Rules": {
          "Execution of privileged commands from unexpected sources.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for commands executed with high privileges or by system accounts. Correlate these events with successful logon events (Windows Event ID 4624) for service accounts. Use descriptive statistics to identify unusual execution patterns by user or source."
          },
          "Processes executed from sensitive system directories.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for executables originating from sensitive system directories. Calculate frequency of execution from these directories and identify outliers using percentile analysis. Use correlation analysis to link process execution to parent processes or network activity (using Zeek logs)."
          }
        }
      }
    }
  }
]