[
  {
    "Is the adversary maintaining persistence using Winlogon Helper DLLs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.004 - Winlogon Helper DLL": {
          "Suspicious modifications to Winlogon Registry keys (Notify, Userinit, Shell) adding or changing DLL/executable paths.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to the Registry keys 'HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Notify', '\\Userinit', and '\\Shell'. Baseline expected values and alert on any modifications, especially the introduction of new DLL/executable paths. Use historical data to identify statistically infrequent modifications (e.g., using frequency analysis)."
          },
          "Anomalous child processes spawned by winlogon.exe or unusual DLLs loaded by processes launched by Winlogon.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the Parent Process Name is 'winlogon.exe' and the created process is not 'userinit.exe' or 'explorer.exe'. Also monitor for 'userinit.exe' or 'explorer.exe' creating unusual child processes. Analyze the command-line arguments (EventData) for suspicious paths or arguments. Use descriptive statistics on process names/paths launched from winlogon/userinit/explorer to find outliers."
          },
          "Creation or modification of DLL files in standard system directories (like System32) that are subsequently referenced by Winlogon Registry keys or loaded by system processes.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write/create actions on DLL files in directories like C:\\Windows\\System32 or C:\\Windows\\SysWOW64. Correlate these events with Windows Event ID 4657 showing changes to Winlogon Notify/Userinit/Shell registry keys referencing these new or modified DLLs. Additionally, correlate with process creation events (e.g., Windows Event ID 4688 if configured with module loads) to see if the suspicious DLL is loaded by winlogon.exe, userinit.exe, or explorer.exe. Use frequency analysis to identify DLLs created/modified in system directories that are statistically rare."
          },
          "Outbound network connections originating from processes launched by Winlogon (userinit.exe, explorer.exe) that are anomalous for typical user activity.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 and Zeek conn.log for outbound connections where the initiating process is 'userinit.exe' or 'explorer.exe'. Establish a baseline of normal network connections for these processes (typically limited or none depending on configuration). Flag connections to remote IPs/domains that are not part of the organization's normal network activity or are known indicators of compromise. Use correlation analysis between process start times (e.g., from Event ID 4688 if configured) and connection times to identify temporal anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using Winlogon Helper DLLs? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.004 - Winlogon Helper DLL": {
          "Suspicious modifications to Winlogon Registry keys (Notify, Userinit, Shell) pointing to malicious DLLs/executables that execute with elevated privileges.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 targeting the same Winlogon Registry keys. Investigate modifications that introduce paths to executables or DLLs known to perform malicious actions or that reside in unusual directories, especially if they are configured to execute with system privileges. Correlate with process creation events to understand the execution context."
          },
          "Anomalous DLL loads or child processes from winlogon.exe or userinit.exe that execute in a privileged context.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes created by 'winlogon.exe' or 'userinit.exe'. Examine process execution details (e.g., command line, path, user context, integrity level if available). Flag processes running with SYSTEM privileges or high integrity levels that are not expected. Correlate with user logon events (Event ID 4624) to understand the session context (e.g., Session 0 vs interactive sessions)."
          },
          "Processes launched by Winlogon helper mechanism executing with SYSTEM privileges or in Session 0, which is inconsistent with normal user session processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes created by 'winlogon.exe', 'userinit.exe', or 'explorer.exe', paying close attention to the 'SubjectUserSid' (user context) and 'Process Integrity Level' (if audited). Correlate with Windows Event ID 4624 (Logon Type 10 for RDP, 2 for console) to identify the user session. Flag processes running with System privileges (SID S-1-5-18) or high integrity levels (SID S-1-16-12288/S-1-16-16384) in interactive user sessions or running in Session 0 if they are not standard system processes."
          },
          "Creation of new administrative accounts or access to sensitive system resources by a process launched via the Winlogon helper mechanism.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4720; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) for processes launched by the Winlogon helper chain (parent winlogon.exe, userinit.exe, or explorer.exe) with subsequent events indicating privilege abuse. Look for Windows Event ID 4720 (User Account Created), especially if the new account is added to privileged groups (Event ID 4728/4732/4756). Monitor Windows Event ID 4656/4663 (Handle/Object Access) for access attempts by these processes on sensitive system files (e.g., SAM hive, security policy files) or registry keys (e.g., critical service keys). Use correlation analysis to link the malicious process to the privileged action."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]