[
  {
    "Is the adversary maintaining persistence using AppCert DLLs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.009 - AppCert DLLs": {
          "Unexpected modification of the AppCertDLLs Registry value.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 events targeting HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs. Identify the process and user account making the modification. Compare modifications against change management records or known software installations. Flag any unauthorized changes."
          },
          "Unrecognized DLL loaded into processes via AppCertDLLs.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 events for processes created. Analyze command line and parent process relationships for anomalies potentially indicative of triggering AppCert DLL loads. Investigate subsequent suspicious behavior (e.g., unexpected network connections via Zeek conn.log) from these processes."
          }
        }
      }
    }
  },
  {
    "Has the adversary escalated privileges using AppCert DLLs? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.009 - AppCert DLLs": {
          "Modification of AppCertDLLs Registry value by a low-privilege process.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 events targeting HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs. Identify events where the modifying process or user account has lower privileges than SYSTEM or Administrator. Use process lineage (via Event ID 4688) to trace the source of the modification."
          },
          "Unrecognized DLL loaded into elevated processes via AppCertDLLs.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events for processes created with elevated privileges (e.g., running as SYSTEM, Administrator). Look for unusual network connections originating from these elevated processes using Zeek conn.log. Use correlation analysis to link suspicious process creation events with unexpected network activity."
          }
        }
      }
    }
  }
]