[
  {
    "Has the adversary achieved privilege escalation by abusing temporary elevated cloud access? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.005 - Temporary Elevated Cloud Access": {
          "Creation of just-in-time access sessions for privileged roles initiated from an unexpected host or outside established workflows.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections to cloud provider API endpoints (e.g., AWS STS, Azure AD, GCP IAM APIs). Identify source IPs. Analyze volume and frequency of these connections using time series analysis to detect sudden increases or connections from unusual internal hosts. Monitor Windows Event ID 4688 on endpoints/servers for execution of cloud CLI tools (aws, az, gcloud) with arguments related to session tokens or credentials."
          },
          "Service account impersonation or role passing activities detected through analysis of network traffic patterns or host command execution logs.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections to cloud provider identity/access management APIs. Look for patterns or parameters indicative of impersonation or pass-role attempts (e.g., unusual data volume, sequence of API calls, though deep inspection is limited). Monitor Windows Event ID 4688 for cloud CLI commands with arguments like 'assume-role', 'impersonate', 'create-token' executed from unusual locations or by unexpected users. Use frequency analysis to identify rare command arguments."
          },
          "Access or modification attempts on sensitive resources (e.g., critical data stores, configuration settings) originating from a cloud resource IP immediately following a temporary access grant or impersonation event.": {
            "Data": "Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate temporary access grants or impersonation events (identified through other means or cloud logs) with subsequent Windows Event ID 4663 on sensitive internal servers (e.g., file servers, database servers) or Zeek conn.log showing connections to these sensitive resources originating from the source IP that received the temporary access. Analyze frequency and volume of access attempts using descriptive statistics."
          },
          "Repeated or unusual requests for temporary elevated access (just-in-time, impersonation) by an account from an unexpected source IP or at unusual times.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud IAM/STS/AD APIs associated with temporary access requests. Filter by destination port (e.g., 443 to cloud API endpoints). Analyze source IPs and timestamps. Identify requests originating from unusual external IPs, internal IPs not associated with cloud administration, or occurring outside of established work hours using frequency distribution and time series analysis. Correlate with Windows Event ID 4624 on management servers if API access involves network authentication."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by using temporary elevated cloud access? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.005 - Temporary Elevated Cloud Access": {
          "Suspicious connections originating from cloud resource IPs (e.g., VMs, functions) to internal network assets or external C2 infrastructure not typical for the resource's function.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for inbound or outbound connections involving IP ranges associated with cloud resources (e.g., EC2 public IPs, Azure VNet IPs, GCP VM IPs). Analyze source/destination IPs and ports. Use correlation analysis to identify cloud resources making multiple connections to disparate internal or external hosts, potentially indicating impersonation or use as a pivot. Monitor Windows Event ID 4624 for logins to internal systems originating from cloud resource IPs."
          },
          "Resource actions (via passed roles) manifesting as anomalous network traffic patterns originating from cloud assets.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from cloud resources. Analyze traffic patterns (e.g., volume, destination ports/IPs, protocols) using descriptive statistics to identify deviations from the resource's established baseline behavior. Look for connections to sensitive internal systems or data stores. Monitor Windows Event ID 4624/4663 for access attempts or successful data access originating from cloud resources on internal file shares or sensitive systems."
          },
          "Modification or deletion of security monitoring configurations, logs, or security software on cloud resources after a temporary access grant or impersonation event.": {
            "Data": "Windows Event ID 4663; Windows Event ID 1102",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate temporary access grant/impersonation events (identified via other means or cloud logs) with subsequent Windows Event ID 4663 showing modifications to security-sensitive files, registry keys, or configurations (e.g., security agent settings, logging configurations) on cloud resources. Alert on Windows Event ID 1102 (Security Log Cleared) occurring on cloud resources, especially if preceded by temporary elevated access. Use time series analysis to identify suspicious sequences of events."
          },
          "Outbound connections from cloud resources to unusual external destinations (e.g., non-corporate, suspicious domains/IPs) using protocols or ports inconsistent with the resource's normal function, potentially indicative of C2 or data exfiltration via temporarily granted network access.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections from cloud resource IP ranges. Analyze destination IPs/ports and correlate with Zeek dns.log for hostnames. Identify connections to rare or previously unseen external destinations, non-standard ports, or destinations known from threat intelligence. Use correlation analysis to group connections by source cloud resource and look for multiple connections to disparate external points or long-duration connections inconsistent with function (e.g., using time series analysis on connection duration). Flag destinations with low frequency of occurrence using percentile analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]