[
  {
    "Has the adversary escalated privileges using UAC bypass techniques? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.002 - Bypass User Account Control": {
          "Execution of system binaries (e.g., eventvwr.exe, sdclt.exe, rundll32.exe) with unusual command-line arguments or parent processes associated with UAC bypasses.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation logs (Event ID 4688). Filter for processes like 'eventvwr.exe', 'sdclt.exe', 'rundll32.exe' launched by non-standard parent processes (e.g., not explorer.exe). Analyze command-line arguments for suspicious patterns known in UAC bypasses. Use frequency analysis to identify rare parent/child process combinations or command-line patterns."
          },
          "Modification of specific User-Hive Registry keys ([HKEY_CURRENT_USER]) known to be abused by UAC bypass techniques.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Registry event logs (Event ID 4657) for modifications to specific keys under HKEY_CURRENT_USER, such as 'Software\\Classes\\mscfile\\shell\\open\\command' or 'Software\\Microsoft\\Windows\\CurrentVersion\\App Paths\\control.exe'. Investigate modifications to these keys, particularly if the data is set to execute an arbitrary binary."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary bypassing UAC for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.002 - Bypass User Account Control": {
          "Process injection detected targeting processes running at high integrity levels, or unusual DLLs loaded into elevated processes.": {
            "Data": "Windows Event ID 7, Windows Event ID 8",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Sysmon event logs (Event ID 7, 8) for unusual DLL loads into high-integrity processes or remote thread creation targeting high-integrity processes. Use entropy analysis on DLL names or paths to identify packed or obfuscated malicious libraries. Correlate with process execution events (Event ID 4688) to identify the injecting process."
          },
          "Anomalous file system or registry operations performed by processes running at high integrity levels.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4657, Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation (Event ID 4688), file access (Event ID 4663), and registry modification (Event ID 4657) logs from processes running at high integrity levels. Establish baseline behavior for high-integrity processes using descriptive statistics (e.g., typical file paths accessed, registry keys modified). Flag deviations from the baseline, particularly actions targeting sensitive data locations or system configurations. Correlate with Zeek conn.log for subsequent outbound connections."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]