[
  {
    "Has the adversary successfully escalated privileges using elevation control mechanisms? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548 - Abuse Elevation Control Mechanism": {
          "Detection of process launches or modifications associated with known Windows UAC bypass techniques.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with command-line arguments or parent-child relationships indicative of UAC bypass. Monitor Windows Event ID 4657 for changes to specific user-accessible Registry keys known to be involved in UAC bypass methods. Use correlation analysis to link suspicious process creation events with preceding registry modifications."
          },
          "Execution of privilege escalation commands (e.g., sudo) or processes with elevated privileges observed via process creation logs.": {
            "Data": "Windows Event ID 4688, Zeek software.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and Zeek software.log for command lines containing 'sudo' or other known privilege escalation tools/commands. Look for process creations with command lines that indicate execution as root or another privileged user. Use frequency analysis on command execution per user to identify unusual spikes or rare users executing privilege escalation commands."
          }
        }
      }
    }
  },
  {
    "Is the adversary using elevation control mechanisms to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548 - Abuse Elevation Control Mechanism": {
          "Loading of unsigned or unusual DLLs by processes running with elevated privileges.": {
            "Data": "Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 7 (Sysmon Image Loaded) logs. Filter events where the process path corresponds to a process running with elevated privileges. Check the 'Signed' field. Identify unsigned DLLs loaded by these processes. Use frequency analysis to identify rare or newly observed unsigned DLLs loaded by privileged processes across the environment."
          },
          "Process injection or suspicious process spawning originating from elevated processes.": {
            "Data": "Windows Event ID 8, Windows Event ID 10, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 8 (Sysmon CreateRemoteThread) and Windows Event ID 10 (Sysmon ProcessAccess) for source processes with elevated privileges. Monitor Windows Event ID 4688 for child processes spawned by parent processes with elevated privileges. Identify suspicious relationships or target processes (e.g., injecting into explorer.exe from a service process). Apply correlation analysis to link injection/spawning events to potentially malicious code execution or defensive countermeasure attempts."
          }
        }
      }
    }
  }
]