[
  {
    "Is the adversary establishing persistence via event triggered execution? (TA0003 - Persistence)": {
      "Indicators": {
        "Creation or modification of persistence mechanisms like registry Run keys, Startup folders, or WMI event subscriptions.": {
          "Data": "Windows Event ID 4657, Windows Event ID 4688, Zeek conn.log",
          "Data Platform": "Endpoints, Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4657 (Registry Value Set) for changes to common persistence keys (e.g., Run keys). Monitor WMI event-related logs for new consumers or filters. Use time series analysis to identify bursts of configuration changes inconsistent with normal administrative activity. Correlate configuration changes with initiating process (Event ID 4688) and subsequent network connections (Zeek conn.log)."
        },
        "Execution of unusual programs or scripts by event trigger processes (e.g., svchost.exe, winlogon.exe) or during logon events.": {
          "Data": "Windows Event ID 4688, Windows Event ID 4624, Zeek conn.log",
          "Data Platform": "Endpoints, Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688. Filter for child processes spawned by common event-trigger parent processes (e.g., 'svchost.exe' with specific parameters) or processes starting around successful logon events (Event ID 4624). Analyze command lines, file paths, and hashes. Calculate the frequency of specific command lines or file paths per parent process; flag low-frequency occurrences using percentiles. Correlate execution with outbound network connections using Zeek conn.log."
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary elevating privileges via event triggered execution? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "Processes with suspicious command lines or file paths executing under high-privilege accounts (SYSTEM, Service Accounts) via event triggers.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688. Filter for process creation events where the 'SubjectLogonId' or 'SubjectUserName' corresponds to SYSTEM or common service accounts. Review 'CommandLine' and 'NewProcessName' for suspicious patterns, known malicious tools, or activity inconsistent with the account's normal function. Use entropy analysis on command lines to identify potentially obfuscated code execution."
        },
        "Outbound network connections originating from processes that are normally passive or triggered by events, especially when running with high privileges.": {
          "Data": "Zeek conn.log, Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Correlate Zeek conn.log events with Windows Event ID 4688 using timestamps and source IP addresses. Identify network connections initiated by processes known to be used for event-triggered execution (e.g., svchost.exe hosting a WMI consumer, unusual processes started at logon). Focus investigation on connections from processes running under SYSTEM or service accounts. Join with threat intelligence feeds to identify connections to known malicious infrastructure."
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]