[
  {
    "Is the adversary maintaining persistence using print processors? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.012 - Print Processors": {
          "Registry key writes to the Print Processors hive (HKLM\\SYSTEM\\...\\Control\\Print\\Environments\\...).": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (4657) for writes to the Print Processors Registry hive (HKLM\\SYSTEM\\*\\Control\\Print\\Environments\\*\\Print Processors). Identify writes by processes or users not typically authorized for system-level configuration. Use frequency analysis to flag unusual or unexpected writes."
          },
          "spoolsv.exe loading unexpected or unsigned DLLs from the print processor directory during system boot.": {
            "Data": "Windows Event ID 7 (Sysmon); Windows Event ID 1 (Sysmon); Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (ImageLoad) where the Image is 'spoolsv.exe'. Analyze the 'ImageLoaded' field (the DLL path). Compare loaded DLLs against a baseline of known good print processor DLLs. Use file reputation services or hash lookups against threat intelligence feeds to identify unexpected or unsigned DLLs loaded from the print processor directory during boot. Correlate with Sysmon Event ID 1 (Process Creation) and Windows Event ID 4688 to understand the context of spoolsv.exe execution."
          },
          "File creation in the Windows print processor directory by a process other than typical print installers.": {
            "Data": "Windows Event ID 11 (Sysmon); Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 11 (File Creation) where 'TargetFilename' matches the Windows print processor directory path (e.g., C:\\Windows\\System32\\spool\\prtprocs\\x64). Identify 'SourceProcessName' and 'User'. Use frequency analysis on the source process names writing to this directory to identify rare or anomalous writers. Correlate with Windows Event ID 4688 to get full process details and parent process. Investigate file creations by processes not identified as legitimate print driver/processor installers."
          },
          "Network connections initiated by spoolsv.exe or newly loaded print processor DLLs to unusual external destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 for outbound network connections initiated by 'spoolsv.exe'. Correlate these connections with Zeek conn.log entries from the corresponding source server IP. Compare destination IPs and ports against a baseline of legitimate print spooler network activity (e.g., connections to printer discovery services, print servers) and threat intelligence feeds. Use frequency analysis on destination IPs/ports initiated by spoolsv.exe to identify rare or anomalous connections. Correlate with Windows Event ID 4688 to link the connection to the spoolsv.exe process instance."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to gain elevated privileges via print processors? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.012 - Print Processors": {
          "Registry key writes to the Print Processors hive by a process not typically associated with print driver/processor installation or without appropriate privileges.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event Logs (4657) showing writes to the Print Processors Registry hive. Correlate with Process Creation events (4688) to identify the writing process ('SubjectProcessId' in 4657 matches 'NewProcessId' in 4688) and user ('SubjectUserName'). Use statistical analysis (e.g., frequency or outlier detection) on the 'SubjectProcessName' or 'SubjectUserName' fields for writes to this specific hive to identify anomalous activity, potentially indicating an attempt to write the DLL path without typical system privileges."
          },
          "spoolsv.exe loading a DLL with a low reputation or known malicious hash from the print processor directory.": {
            "Data": "Windows Event ID 7 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 7 (ImageLoad) for spoolsv.exe loading DLLs. Extract DLL file hashes using the 'Hashes' field. Perform correlation analysis by joining the loaded DLLs and hashes with threat intelligence data (IOCs for malicious DLLs or hashes). Investigate any matches or DLLs with low reputation scores identified via external lookups, as this indicates a potential malicious DLL being loaded by a SYSTEM process."
          },
          "Suspicious child processes or actions spawned by spoolsv.exe running under SYSTEM privileges after a potential malicious DLL load.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7 (Sysmon)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created where 'ParentProcessName' is 'spoolsv.exe'. Analyze 'NewProcessName' and 'CommandLine' for suspicious executables or commands (e.g., `cmd.exe`, `powershell.exe`, `schtasks.exe`, `sc.exe` performing configuration changes) executed by spoolsv.exe. Correlate these events with Sysmon Event ID 7 (ImageLoad) indicating the loading of an unusual DLL by spoolsv.exe, as this child process execution under spoolsv.exe's SYSTEM context indicates successful privilege escalation."
          },
          "Registry key write to the Print Processors hive by a process or user account not typically authorized or observed performing such modifications.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for 'Object Name' matching the Print Processors Registry paths. Use 'SubjectUserName' and 'SubjectProcessName' from 4657. Correlate with Windows Event ID 4688 (Process Creation) for the 'SubjectProcessId' to get command line and parent process ('ParentProcessName'). Use frequency analysis on 'SubjectProcessName' and 'SubjectUserName' performing modifications to this hive to identify outliers. Flag writes from unexpected user accounts (especially non-SYSTEM accounts, if the adversary first gains write access) or processes not associated with legitimate print management or system updates, as this write is a prerequisite step for gaining privileged execution."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]