[
  {
    "Is the adversary maintaining persistence using component firmware? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.002 - Component Firmware": {
          "Unusual outbound network connections originating from hosts where component firmware compromise is suspected.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts generating unusual outbound network connections. Analyze Zeek conn.log for connections to uncommon destinations, ports, or protocols from hosts where this is not typical. Use frequency analysis or anomaly detection methods (e.g., Z-score) on connection volume, destination diversity, or port usage per host."
          },
          "Execution of unexpected processes with high privileges or unusual parent processes on hosts where component firmware compromise is suspected.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on target hosts. Look for processes launched with high privileges without a clear parent process (PID 0 or system process) or parent-child relationships that deviate significantly from established baselines. Use correlation analysis to link unusual processes to other system events."
          },
          "Anomalous behavior or crashes related to specific device drivers or system components on affected hosts.": {
            "Data": "Windows Event ID 7; Windows Event ID 1001; Windows Event ID 7000; Windows Event ID 7026",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows System event logs (Event ID 7, 7000, 7026) and Application event logs (Event ID 1001) related to driver operations (loading/failure), service failures, or application crashes. Analyze these events for frequency and correlation on hosts exhibiting other suspicious activity or specific components. Use time series analysis to identify sudden increases or unusual patterns in driver/service errors or application crashes that might suggest underlying component issues."
          },
          "System events indicating file system corruption, disk read/write errors, or unusual disk activity on system drives.": {
            "Data": "Windows Event ID 55; Windows Event ID 130; Windows Event ID 137",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows System event logs for disk-related errors such as Event ID 55 (NTFS File System), 130 (NTFS Volume State), 137 (NTFS Metadata). Collect these events specifically for system drives. Analyze frequency and type of errors. Correlate occurrences with other system behavior or time periods. Use frequency analysis to identify hosts with an unusual spike in disk errors compared to others or their own historical baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using component firmware? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1542.002 - Component Firmware": {
          "Repeated system errors or crashes on endpoints, potentially indicative of underlying component instability.": {
            "Data": "Windows Event ID 1000; Windows Event ID 1001; Windows Event ID 6008",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event IDs 1000, 1001, 6008 from endpoints. Count the frequency of these error events per host over time. Use time series analysis to identify sudden spikes or unusual patterns in system errors that correlate across multiple components."
          },
          "Network activity exhibiting characteristics of covert channels or unusual protocols from endpoints.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek logs (conn.log, dns.log, http.log, etc.) for patterns indicative of covert channels, such as excessive DNS queries to specific domains, low-volume/high-frequency connections, or unusual data encoding within standard protocols. Apply statistical analysis (e.g., entropy measures on data payloads) to identify hidden data transmission."
          },
          "Failure or inability of standard system integrity checks or anti-malware scans to complete successfully on affected hosts.": {
            "Data": "Windows Event ID 1001; Windows Event ID 7031; Windows Event ID 7034",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 1001 (Application Error), 7031 (Service Control Manager - Service crashes), and 7034 (Service Control Manager - Service terminated unexpectedly) on endpoints and servers. Look for frequent crashes or failures of services associated with endpoint security products or built-in Windows security features. Correlate these failures across multiple events or with other suspicious activity on the host. Use frequency analysis to identify hosts where security services are unusually unstable or failing."
          },
          "Network connections originating from a host that do not correspond to any known running process.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing outbound connections from a host with Windows Filtering Platform (WFP) events (Event ID 5156 for allowed connections) on that host. Identify connections seen in Zeek conn.log that do not have a corresponding WFP event or where the WFP event does not list a valid, known process ID. This correlation requires aligning timestamps and network tuples (source/dest IP/port, protocol). Flag hosts with unexplained outbound connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]