[
  {
    "Is the adversary maintaining persistence using PowerShell profiles? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.013 - PowerShell Profile": {
          "Creation or modification of PowerShell profile files (profile.ps1) in unexpected locations or user directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write/modify operations on files named 'profile.ps1' in user profile directories ($Home), $PsHome, or common program data paths. Identify creation events using relevant file system monitoring logs if available (if 4663 doesn't cover it, explain limitations or assume capability). Use statistical analysis (e.g., time series) to detect bursts of file modifications/creations outside typical patching/configuration windows."
          },
          "Execution of PowerShell scripts or commands immediately upon PowerShell launch, originating from profile execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes where 'powershell.exe' is created. Correlate 'powershell.exe' process creations with parent processes or sequences indicating logon or initial user activity. Look for command line arguments that execute scripts or commands immediately upon launch, especially if the '-NoProfile' flag is *not* used or if suspicious scripts are referenced. Use entropy measures on command line strings to identify obfuscated commands."
          },
          "Outbound network connections initiated by powershell.exe processes, especially after initial logon or outside typical user activity periods.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 for network connections originating from powershell.exe processes. Correlate with Zeek conn.log to identify destination IPs, ports, and connection volumes. Analyze connections occurring shortly after user logon (indicating potential profile execution) or outside normal business hours. Use correlation analysis to link suspicious connections to specific powershell.exe executions and their command lines (if available). Use descriptive statistics (e.g., count of unique destinations, total bytes) to identify anomalous network activity compared to baseline."
          },
          "Loading of unusual PowerShell modules or drives by powershell.exe processes, potentially associated with profile execution.": {
            "Data": "Windows Event ID 4103; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable PowerShell Module Logging (Event ID 4103). Monitor for the loading of non-standard, unknown, or suspicious PowerShell modules (e.g., obfuscated names, names matching known adversary tools). Correlate with Windows Event ID 4688 for powershell.exe process creation to identify the context (user, parent process, command line) of module loading. Identify modules loaded shortly after logon or during periods of inactivity, which might indicate profile execution. Maintain a baseline of commonly loaded modules using frequency analysis and flag deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using PowerShell profiles? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.013 - PowerShell Profile": {
          "Execution of PowerShell profile scripts by high-privilege accounts (e.g., Domain Admins, System) accessing systems.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (powershell.exe execution) with Windows Event ID 4624 (successful logon) to identify which user account launched PowerShell. Filter for executions initiated by high-privilege accounts or service accounts. Use descriptive statistics to identify unusual frequency or timing of PowerShell usage by these accounts compared to their normal activity patterns."
          },
          "PowerShell command line arguments containing unusual or obfuscated commands initiated by a profile script.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine the command line arguments in Windows Event ID 4688 for 'powershell.exe' processes. Search for keywords associated with profile execution (e.g., '. .\\profile.ps1', '$profile') followed by suspicious command patterns (base64 encoding, unusual script blocks, calls to external executables). Apply correlation analysis between profile execution instances and subsequent suspicious process activity. Use entropy measures on command line arguments to detect obfuscation."
          },
          "Sensitive security-related actions (e.g., service installation, user creation, firewall changes) initiated by powershell.exe, especially when run by a high-privilege account.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4703; Windows Event ID 4720; Windows Event ID 5025; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure auditing for security events (e.g., Event IDs 4703, 4720, 5025) to capture the initiating process. Monitor these logs where powershell.exe is the initiating process. Correlate with Windows Event ID 4688 to get the full command line and parent process. Further correlate with Windows Event ID 4624 to identify the user account context. Focus analysis on actions performed by high-privilege accounts, looking for sequences of events indicative of privilege escalation."
          },
          "Access or modification of sensitive system files or configuration files by powershell.exe processes, particularly when executed with elevated privileges.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure system access control list (SACL) auditing for sensitive files (e.g., SAM, SYSTEM hives, security policies, critical configuration files) to log Event ID 4663 on access/modification. Monitor Event ID 4663 where the accessing process is powershell.exe. Correlate with Windows Event ID 4688 to identify the powershell.exe command line and user context. Flag access or modification attempts by powershell.exe running under high-privilege accounts that coincide with potential profile execution timing. Use frequency analysis to identify unusual access patterns to sensitive files."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]