[
  {
    "Is the adversary establishing persistence using malicious installer packages? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.016 - Installer Packages": {
          "Execution of unusual or unsigned scripts (e.g., .bat, .ps1, shell scripts) triggered by software installer processes (e.g., msiexec.exe, package managers).": {
            "Data": "Windows Event ID 4688, Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created by common installer executables (e.g., msiexec.exe, setup.exe, install.exe) where the created process is a script interpreter (cmd.exe, powershell.exe, sh, bash). Analyze script content logged via Event ID 4104. Flag scripts that are unsigned or exhibit unusual behavior. Use frequency analysis to identify installers triggering script execution rarely observed in the environment."
          },
          "Creation or modification of persistence mechanisms (e.g., Run keys, Scheduled Tasks, Services) originating from software installation processes.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4698, Windows Event ID 4697, Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4688 (for process creation of schtasks.exe, sc.exe) and 4698, 4697, 4657. Filter these events to identify those where the creating process is a known installer executable. Investigate newly created Scheduled Tasks, Services, or Registry Run key entries originating from installer processes. Use correlation analysis to link installer execution timestamps with persistence mechanism creation timestamps."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary elevating privileges using malicious installer packages? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.016 - Installer Packages": {
          "Execution of child processes with elevated privileges (SYSTEM, Administrator) by installer processes that are not typical for standard software installations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Filter for processes where the ParentProcessName is a known installer executable (e.g., msiexec.exe) and the NewProcessPrivileges field indicates high privileges (e.g., SeDebugPrivilege, SeTcbPrivilege). Analyze entropy of the created process command line arguments or executable name to identify unusual executables run with high privileges."
          },
          "Modification of system files, registry keys, or service configurations with elevated privileges by installer processes.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 (Object Access - requires SACLs) and 4697. Filter events where the access/modification was performed by a known installer process and targets critical system files (e.g., System32), registry keys (e.g., HKLM\\SYSTEM), or service configurations. Use time series analysis to identify bursts of privileged modifications correlated with installer execution events."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]