[
  {
    "Is the adversary maintaining persistence using Image File Execution Options? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.012 - Image File Execution Options Injection": {
          "Registry modifications to HKLM\\...\\Image File Execution Options\\* or SilentProcessExit\\* pointing to suspicious executables or scripts.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to Registry keys under 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\' and 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\'. Filter for 'Debugger' or 'MonitorProcess' value changes. Identify suspicious executable paths or scripts being set. Use baseline analysis (descriptive statistics) to identify newly created or modified IFEO entries not present in a known good state or associated with standard software installations."
          },
          "Unusual child processes spawned from applications known to be targeted by IFEO or processes spawned with debugging flags.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify child processes spawned from common IFEO targets (e.g., calc.exe, notepad.exe, services.exe) or processes spawned with debugging flags (if available in log configuration). Correlate parent/child process relationships and analyze command-line arguments for unusual patterns. Use frequency analysis to identify rare parent-child process combinations."
          },
          "Execution of the GFlags tool with parameters related to setting IFEO or silent process exit options.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the process name is 'gflags.exe'. Analyze the command line arguments for parameters like /i, /p, /enable, /disable, /reg, /local related to setting Image File Execution Options or Silent Process Exit flags. Flag any execution of gflags.exe by non-administrator accounts or outside of standard system administration tasks. Use frequency analysis to identify rare or unusual gflags.exe command line patterns."
          },
          "Registry modifications to IFEO keys for common security or system monitoring executables indicating defense evasion persistence.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to the 'Debugger' value under 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\' specifically targeting known security product executables (e.g., AV, EDR agents) or critical system tools (e.g., taskmgr.exe, services.exe). Identify changes where the 'New Value' points to an invalid or suspicious path, suggesting an attempt to disable the target application via IFEO. Use correlation analysis to link these registry modifications to other suspicious activities."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary escalated privileges using Image File Execution Options? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.012 - Image File Execution Options Injection": {
          "Registry modifications to HKLM\\...\\Image File Execution Options\\utilman.exe or sethc.exe pointing to cmd.exe or other shell/executables.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to specific IFEO keys targeting accessibility tools, e.g., 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\utilman.exe' or 'sethc.exe'. Specifically look for the 'Debugger' value being set to 'cmd.exe' or other shell/executable paths. Use time series analysis to identify recent, anomalous changes to these specific critical keys."
          },
          "Execution of cmd.exe or other shells with SYSTEM privileges originating from accessibility tool processes at the logon screen.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) and Windows Event ID 4624 (Successful Logon). Look for processes like 'cmd.exe' or other shells being spawned where the Parent Process Name is 'utilman.exe', 'sethc.exe', or similar accessibility tools, especially when the process creation is associated with an interactive logon session (Logon Type 2 or 10 in 4624). Look for processes running with SYSTEM privileges spawned under these conditions. Calculate the frequency of such events; any occurrence is highly suspicious."
          },
          "Suspicious use of Registry modification API calls targeting IFEO or SilentProcessExit keys by unexpected processes.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for 'ObjectType'='Key' events targeting Registry paths under 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\' or 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SilentProcessExit\\'. Analyze the 'Process Name' associated with the event. Flag modifications originating from processes other than standard installers, Windows Update, or known legitimate system tools. Use frequency analysis on process names making these specific Registry modifications to identify rare or anomalous sources."
          },
          "Suspicious executables launched as debuggers via IFEO, evidenced by process creation with the target application in the command line.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify processes where the command line arguments indicate they are acting as a debugger for another process (e.g., '<suspicious_exe> <target_exe>', potentially with debugger flags). Analyze the 'New Process Name' and 'Parent Process Name'. Flag executions of known suspicious executables or executables in unusual paths acting as debuggers for common Windows applications (e.g., notepad.exe, calc.exe, etc.). Use frequency analysis to identify rare parent-child relationships or unusual executables appearing as debuggers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]