```json
[
  {
    "Is the adversary maintaining persistence using modified network device firmware? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.004 - ROMMONkit": {
          "Network transfer of a file whose hash matches a known malicious ROMMON image, or network connections from a device to an IP/domain known to be a C2 for a ROMMONkit.": {
            "Data": "Zeek files.log; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously hash files transferred via TFTP, FTP, or SCP to network devices (captured in Zeek files.log) and inner join the results against a threat intelligence feed of known malicious firmware or ROMMONkit hashes. Separately, monitor Zeek conn.log and dns.log for any connections or queries originating from network device IP addresses to IPs/domains on a C2 threat feed. Alert on any matches."
          },
          "Execution of a specific sequence of commands on a network device or specific network traffic patterns that match known adversary playbooks for ROMMON modification.": {
            "Data": "Network Device Syslogs; Zeek tftp.log; Zeek snmp.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and monitor for specific sequences of commands in aggregated device syslogs indicative of firmware modification (e.g., 'copy tftp flash:', setting boot variables, 'reload'). Correlate these command sequences with network traffic from Zeek logs (tftp.log, snmp.log) for patterns associated with known ROMMON implant tools, such as specific TFTP block sizes or SNMP OIDs used to write to memory. Use regular expression matching and stateful sequence analysis to detect these known attack patterns."
          },
          "Anomalous file transfers (e.g., TFTP, SCP, FTP) to a network device, characterized by unusual source hosts, timing outside of maintenance windows, or file sizes inconsistent with legitimate firmware updates.": {
            "Data": "Zeek tftp.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate firmware update activity, including authorized source hosts, typical maintenance windows (time-of-day/day-of-week), and expected file sizes per device type. Monitor Zeek tftp.log and conn.log for transfers that deviate from this baseline. Use Inter-Quartile Range (IQR) or box-plots to flag anomalous file sizes and time-series analysis for unusual timing. Correlate with process execution logs (Windows Event ID 4688) on source endpoints to verify the legitimacy of the initiating process and user account."
          },
          "An unexpected network device reboot followed immediately by anomalous network connections originating from the device, suggesting execution of a malicious persistent payload.": {
            "Data": "Network Device Syslogs; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate device reboot events (from aggregated syslogs) with subsequent network connections originating from the device's IP address (from Zeek conn.log and dns.log) within a 5-minute window. Establish a baseline of normal post-reboot traffic (e.g., NTP, SNMP, syslog, routing protocol updates). Flag any connections to unusual external IPs, non-standard ports, or DNS queries for rare domains, as these may indicate C2 communication from a persistent ROMMONkit. Use frequency analysis on destination IPs, ports, and DNS queries to spot outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using modified network device firmware? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542.004 - ROMMONkit": {
          "Connections from security scanning tools or logging servers being dropped when targeting or traversing a specific network device, where the C2 destination is a known indicator for a ROMMONkit.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "When investigating alerts for known C2 IPs (from a CTI feed), check Zeek conn.log for connection attempts from security infrastructure (e.g., vulnerability scanners, central syslog servers) to other internal devices that are routed through the suspect network device. A pattern of 'REJ' (rejected) or 'RST' (reset) connection states for only this security-related traffic, while other traffic passes, could indicate selective filtering. Monitor Zeek's weird.log for anomalous network behavior related to the device under suspicion."
          },
          "Traffic passing through a network device exhibits specific header modifications or protocol anomalies known to be used by a specific ROMMONkit to hide traffic or bypass inspection devices.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and search for specific patterns associated with known defense-evading ROMMONkits based on CTI. This could include unusual TTL values, specific IP flags being set, or DNS queries using non-standard opcodes or record types to tunnel data. This requires detailed intelligence on the specific ROMMONkit's TTPs. Use Zeek scripting or advanced query logic to search for these mid-level artifacts in conn.log and dns.log records."
          },
          "Significant and unexplained deviations in network traffic flow patterns through a device, such as traffic being rerouted to unusual destinations, or specific traffic types (e.g., to security tools) being selectively dropped.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of network traffic flows (source/destination subnets, protocols, volume) for critical network devices using Zeek conn.log. Use time series analysis and correlation to detect significant and persistent deviations from this baseline not attributable to known configuration changes. Specifically model flows to/from security infrastructure and alert on a sudden drop in volume or connection success rate for those flows while other traffic remains normal. Use linear regression to predict expected flow volumes and flag significant negative residuals."
          },
          "Anomalous absence or alteration of device-generated management traffic, such as syslog messages, SNMP traps, or NTP requests, following a reboot or other suspected compromise event.": {
            "Data": "Zeek conn.log; Network Device Syslogs (from aggregator)",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for the frequency and volume of management traffic (syslog, SNMP, NTP) originating from each network device. Monitor aggregated syslog data and Zeek conn.log for this traffic. Use time series analysis to detect a significant drop or complete cessation of this traffic from a specific device, especially after an unscheduled reboot. A modified ROMMON might suppress logging or other management communications to evade detection. Compare the device's local log buffer (if accessible via authenticated scan) with the central syslog server to detect selective log filtering."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```