[
  {
    "Is the adversary maintaining persistence using interrupt signals? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.005 - Trap": {
          "Presence of suspicious or overly broad 'trap' commands in user or system configuration files (e.g., .bashrc, .profile, service scripts).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events involving shell interpreters (like bash/sh in WSL or Cygwin). Analyze command lines for the presence of 'trap' commands or suspicious scripts being executed. Calculate frequency and correlation with specific user sessions or system start-up events."
          },
          "Execution of unexpected or malicious processes originating from a shell or script triggered by an interrupt signal.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes spawned by shell interpreters or scripts. Look for unusual parent-child process relationships. Correlate process executions with Zeek conn.log for suspicious outbound network connections. Use entropy measures on command lines to identify potentially obfuscated or unusual execution parameters."
          },
          "Modification or creation of user or system shell configuration files (.bashrc, .profile, etc.) to include 'trap' commands by non-standard processes or users.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write/append operations targeting common shell configuration files (e.g., .bashrc, .profile, considering WSL/Cygwin paths). Correlate with Windows Event ID 4688 to identify the process responsible for the write. Flag modifications by unusual processes or user accounts using frequency analysis. Use descriptive statistics to baseline file modification activity on these paths and identify outliers."
          },
          "Network connections initiated by processes launched via 'trap' commands, particularly to external or unusual destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events identified as potential trap-triggered process executions with subsequent Windows Event ID 5156 (network connection) and Zeek conn.log entries. Analyze destination IPs, ports, and data volumes. Flag connections to known malicious infrastructure (using TI feeds) or unusual destinations/ports. Use correlation analysis between process name/command line and network destination to identify suspicious pairs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation via interrupt signals? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.005 - Trap": {
          "Detection of 'trap' commands within scripts or configuration files associated with privileged accounts (e.g., root) or system services.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for process creation events initiated by privileged users (e.g., System, Administrator or root in WSL/Cygwin). Look for shell or script executions by these users and analyze command lines for 'trap' usage or suspicious commands run in a privileged context. Identify low-frequency command lines associated with these users using frequency analysis."
          },
          "Execution of commands via 'trap' that attempt to modify system files, create new privileged users, or execute code with elevated permissions.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4720",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executed by shell interpreters or scripts that attempt sensitive system modifications or user management activities (like creating new users, Windows Event ID 4720), particularly when run with elevated privileges. Correlate these actions with the user context and execution time. Use time series analysis to detect executions occurring outside of typical administrative windows or in unusual sequences."
          },
          "Identification of 'trap' commands within scripts designed to run with elevated privileges that modify permissions, user accounts, or security policies.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4720; Windows Event ID 4724; Windows Event ID 4738",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process executions by privileged accounts (System, Administrator, etc.) or processes running as services. Analyze command lines and script contents for 'trap' commands paired with actions like user creation (4720), password changes (4724), or group membership changes (4738). Identify rare combinations of 'trap' usage and privileged system modification commands using frequency analysis and cross-correlation."
          },
          "Successful privileged logons (e.g., Remote Desktop, network logon) to a system shortly after the execution of a privileged script containing a 'trap' command on that system.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events showing execution of scripts containing 'trap' commands by privileged users with subsequent Windows Event ID 4624 events indicating successful privileged logons (e.g., Logon Type 3 or 10) to the same system. Look for logons by unusual accounts or source IPs occurring within a short time window (e.g., 15 minutes) after the trap script execution. Use time series analysis to identify unusual sequences of events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]