```json
[
  {
    "Is the adversary establishing persistence via Netsh Helper DLL? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.007 - Netsh Helper DLL": {
          "Registration of a Netsh helper DLL with a file name or hash known to be associated with malicious activity.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to the 'HKLM\\SOFTWARE\\Microsoft\\Netsh' registry key. From the event, extract the path and name of the registered DLL. Calculate the file's hash and compare the file name and hash against a continuously updated threat intelligence feed of known malicious indicators. Correlate with the process that wrote the key (from Event ID 4688 or advanced registry auditing) and alert on any match."
          },
          "Execution of 'netsh.exe' with command-line arguments consistent with adding a new helper DLL, such as 'add helper'.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where 'NewProcessName' is 'netsh.exe'. Analyze the 'CommandLine' field for the specific string pattern 'add helper'. Since this can be a legitimate administrative action, use descriptive statistics and frequency analysis to establish a baseline of this command's usage. Flag executions that are anomalous in terms of user context, parent process (e.g., not cmd.exe or powershell.exe run by an admin), or time of day."
          },
          "A new DLL is registered as a Netsh helper that is located in an unusual directory, is unsigned, or has low prevalence across the enterprise.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to 'HKLM\\SOFTWARE\\Microsoft\\Netsh'. For each new DLL registration, extract the DLL path. Flag paths pointing to non-standard, user-writable locations (e.g., C:\\Users\\, C:\\Temp\\, C:\\ProgramData\\). Programmatically check the DLL's digital signature status. Use frequency analysis and percentile rankings to identify registered DLLs with low prevalence across the environment. Use box-plots on file path entropy or prevalence counts to identify outliers requiring investigation."
          },
          "A Netsh helper DLL registry key modification is followed by 'netsh.exe' execution that spawns an anomalous child process or makes an outbound network connection.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Implement a chained behavioral rule that triggers when: 1) A modification to 'HKLM\\SOFTWARE\\Microsoft\\Netsh' is detected (Event ID 4657), and 2) Within a short time window (e.g., 24 hours), 'netsh.exe' is executed on the same host (Event ID 4688), and 3) The 'netsh.exe' process spawns an unusual child process (e.g., powershell.exe, wscript.exe) or initiates an outbound network connection to an unusual destination (detected via Event ID 5156 or Zeek conn.log). Use time-based correlation analysis to link these discrete events into a single high-confidence alert for persistent C2 activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary escalating privileges via Netsh Helper DLL? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.007 - Netsh Helper DLL": {
          "A known malicious or suspicious DLL is registered as a Netsh helper by a non-administrative process or user, staging a privilege escalation attack.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to 'HKLM\\SOFTWARE\\Microsoft\\Netsh'. Check the registered DLL's name and hash against CTI feeds. Correlate the registry write event with the creating process information (from Event ID 4688 or advanced registry auditing). Specifically flag instances where a known suspicious DLL is registered by a process running with standard user privileges or a 'Medium' integrity level, as this is a key indicator of a privilege escalation setup."
          },
          "A process running as a standard user executes 'netsh.exe add helper' to register a DLL located in a user-writable directory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor 'netsh.exe' process creations (Event ID 4688) with the 'add helper' command-line pattern. Analyze the user context ('SubjectUserName') and process integrity level of the process. Flag any instance where this command is run by a non-administrative user, especially when the specified DLL path points to a user-writable location (e.g., C:\\Users\\, %APPDATA%, C:\\Temp\\). This pattern is highly indicative of privilege escalation staging."
          },
          "Execution of 'netsh.exe' with a high or system integrity level spawns a child process that also runs with elevated privileges and performs sensitive administrative actions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for 'netsh.exe' executions (Event ID 4688) where the 'ProcessIntegrityLevel' is 'High' or 'System'. For each such instance, track any child processes spawned. Analyze the child process's command line for administrative commands (e.g., 'net user /add', 'sc.exe create', PowerShell execution policy changes) and confirm that the child process inherited the elevated integrity level. Use descriptive statistics to baseline normal 'netsh.exe' child process activity and flag rare or suspicious administrative actions as outliers."
          },
          "A DLL registered as a Netsh helper is loaded by a high-privilege 'netsh.exe' process, where the DLL file or its registry key had insecure permissions allowing modification by a standard user.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "This is a hunting query. When an elevated 'netsh.exe' process (Event ID 4688) runs, identify the helper DLLs it loads by querying the 'HKLM\\SOFTWARE\\Microsoft\\Netsh' registry key. For each loaded helper DLL, programmatically check the file permissions on the DLL and the permissions on its registry key. Flag any instance where a standard user account or group (e.g., 'Everyone', 'Authenticated Users') has write permissions. Correlate this finding with the user context of the process that last modified the file or key (via Event ID 4657 auditing or file system auditing) to identify a successful privilege escalation chain."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```