[
  {
    "Is the adversary establishing persistence using container services? (TA0003 - Persistence)": {
      "Indicators": {
        "T1543.005 - Container Service": {
          "Process creation events showing container run commands with persistence options or network traffic patterns consistent with DaemonSet deployment.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command lines containing container run/create commands (`docker run`, `podman run`, etc.) along with persistence flags (`restart=always`) or volume mounts indicative of host access. Monitor Zeek logs (conn, http) for network traffic patterns associated with Kubernetes DaemonSet deployment API calls (e.g., PUT requests to /apis/apps/v1/namespaces/*/daemonsets). Use frequency analysis to identify rare or newly occurring command line arguments or network communication patterns."
          },
          "Process creation events indicating new container deployment or modifications to existing container configurations on hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for commands used to create, start, or modify containers (e.g., `docker create`, `docker start`, `docker update`, `podman create`, `podman start`). Establish a baseline of normal container management activity and flag deviations using time series analysis or statistical process control."
          },
          "Process creation or configuration changes setting up container run commands as system services with persistent restart policies.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for commands interacting with system services (e.g., `sc.exe`, `powershell New-Service`) or container commands (`docker run`, `podman run`) that configure services. Monitor Windows Event ID 4697 (Service Creation) for new services created that include container execution commands or configuration files in their definition. Use frequency analysis to identify rare or newly observed service creation events."
          },
          "Network traffic indicating deployment of DaemonSets or Pods with node selectors via Kubernetes API from unexpected sources or with unusual configurations.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to the Kubernetes API server (typically ports 6443/443). Filter Zeek http.log for PUT or POST requests targeting `/apis/apps/v1/namespaces/*/daemonsets` or `/api/v1/namespaces/*/pods`. Analyze request bodies (if available/loggable) for suspicious configurations like `restartPolicy: Always`, `nodeSelector`, `hostPath` volumes, or privileged containers. Use correlation analysis to link API calls to source IPs and users. Detect deployment patterns that deviate from baseline using time series analysis on API call frequency."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges using container services? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1543.005 - Container Service": {
          "Process creation events showing privileged container commands or Zeek logs showing connections to unsecured container APIs.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command lines executing container run/exec commands with privileged options (`--privileged`, `-v /:/host`) or executing commands inside privileged containers. Monitor Zeek logs (conn, http) for connections to known unsecured container API ports (e.g., Docker 2375) from unexpected sources. Use correlation analysis to link privileged command execution with network connections to internal resources."
          },
          "Unexpected process creation (Windows Event ID 4688) or network connections (Zeek conn.log) originating from processes known to be running inside containers.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) events originating from within a container process with processes or network connections that are not expected from that container's normal function. Use entropy analysis or frequency distribution on spawned processes/network destinations from container origins to detect anomalous host activity indicative of container escape."
          },
          "Process creation events showing container run/create commands that mount sensitive host directories into the container.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command lines containing container execution commands (`docker run`, `podman run`, etc.) with volume mount options (`-v` or `--mount`). Specifically search for patterns indicative of mounting sensitive host directories (e.g., `-v C:\\:/host`, `--mount type=bind,source=C:\\,target=/mnt/host`). Flag such mounts as potential privilege escalation attempts. Use frequency analysis to identify newly observed or rare volume mounts."
          },
          "Suspicious process execution on the host system initiated by container runtime processes or processes originating from within containers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) on container hosts. Identify processes created whose parent process is the container runtime (e.g., `dockerd.exe`) or processes originating from within containers (requires identifying container processes). Filter for suspicious commands or scripts (e.g., creating new users, modifying system files, executing uncommon executables in system directories) inconsistent with container's purpose. Use parent-child process analysis and entropy measures on command line arguments or spawned processes to detect anomalous activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]