[
  {
    "Is the adversary maintaining persistence using pre-OS boot mechanisms? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542 - Pre-OS Boot": {
          "Unexplained changes detected in BIOS/UEFI firmware or boot records.": {
            "Data": "Windows Event ID 1001, Windows Event ID 1002",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event IDs potentially related to boot errors (1001, 1002) or unexpected system configuration changes. Investigate any logs indicating boot failures or system file integrity issues that might be symptoms of underlying pre-OS tampering. Compare logs against known good boot configurations or snapshots."
          },
          "Logging or monitoring indicates API calls modifying boot-related settings or drivers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for processes initiating system configuration changes potentially related to drivers or boot settings. Analyze process command lines and parent-child relationships for unusual activity. Use correlation analysis to link these events to other suspicious activities."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using pre-OS boot mechanisms? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542 - Pre-OS Boot": {
          "Integrity check failure on pre-OS boot components, suggesting modification to evade detection.": {
            "Data": "Windows Event ID 1001, Windows Event ID 1002",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event logs (e.g., Event IDs 1001, 1002) for reported integrity check failures or errors during the boot process. Correlate these failures with system reboots or unexpected shutdowns. Use time series analysis to identify recurring integrity issues."
          },
          "Anomalous sequence or timing of API calls related to boot configuration, potentially masked or hidden.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4688 (Process Creation) logs for sequences of system-level processes or API calls occurring during the boot phase that deviate from expected behavior. Establish a baseline of normal boot processes using descriptive statistics on Event 4688 activity and flag significant deviations or unusual process chains."
          }
        }
      }
    }
  }
]