```json
[
  {
    "Is the adversary maintaining persistence using AppCert DLLs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.009 - AppCert DLLs": {
          "The AppCertDLLs registry key is modified to include a DLL path or filename known to be used by specific malware or threat actors.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (A registry value was modified) for any changes to the value of HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs. Compare the new DLL path specified in the event data against a threat intelligence list of known malicious DLL names or paths associated with this technique. Alert on any direct match."
          },
          "A new DLL is written to a non-standard or temporary directory, followed shortly by a modification of the AppCertDLLs registry key to point to that DLL.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable file access auditing on non-standard directories (e.g., C:\\Users\\Public, %TEMP%, C:\\ProgramData) to generate Windows Event ID 4663 (An attempt was made to access an object). Correlate file creation events for DLLs ('Object Name' ends with .dll and 'Accesses' includes WriteData) in these locations with subsequent modifications to the AppCertDLLs registry key (Event ID 4657) within a short time window (e.g., under 5 minutes). Use correlation analysis on hostname and timestamp to link these two events, flagging the sequence as a high-confidence indicator of this pattern."
          },
          "Following an unauthorized modification of the AppCertDLLs registry key, common user- or system-initiated processes begin exhibiting anomalous network activity or creating suspicious child processes.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify any unauthorized modification to the AppCertDLLs key using Event ID 4657. After a modification is flagged, monitor all newly created processes (Event ID 4688) for anomalous behavior. Correlate process creation events with network connection logs (Zeek conn.log) to identify common processes (e.g., explorer.exe, svchost.exe) making new or unusual external connections (e.g., to non-standard ports, IPs with low reputation). Use time series analysis to detect beaconing. Also, monitor for unusual parent-child process relationships, flagging the correlated sequence of registry-mod-then-anomalous-behavior."
          },
          "A common, legitimate process makes an outbound network connection using a non-standard protocol for that process, following an AppCertDLLs modification.": {
            "Data": "Windows Event ID 4657; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "After flagging an AppCertDLLs registry change (Event ID 4657), monitor network connections (Zeek conn.log, Windows Event ID 5156) made by all newly created processes. Profile standard protocols and ports used by common processes (e.g., svchost.exe typically uses RPC; browsers use HTTP/S). Flag any new process that uses a non-standard protocol or port (e.g., svchost.exe using DNS for C2, explorer.exe making a direct TCP connection to an external IP). Use correlation analysis to link the process name and anomalous protocol/port combination with the initial registry change."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary escalated privileges using AppCert DLLs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.009 - AppCert DLLs": {
          "A known malicious DLL, identified by its name/path in the AppCertDLLs registry key, is associated with subsequent privileged actions, such as creating a new administrative user.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Windows Event ID 4720; Windows Event ID 4732",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for AppCertDLLs registry modifications (Event ID 4657) pointing to known malicious DLLs from a selector list. Correlate this event with subsequent privileged activity, such as user account creation (Event ID 4720) or a user being added to a local/domain administrators group (Event ID 4732). Investigate if the process performing the action (or its parent process from Event ID 4688) was created shortly after the registry modification, as the malicious DLL would be loaded into it."
          },
          "A process running with elevated privileges (e.g., as SYSTEM or Administrator) spawns an unexpected child process, such as a command shell, shortly after the AppCertDLLs key was modified.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate AppCertDLLs registry modifications (Event ID 4657) with subsequent process creation events (Event ID 4688). Specifically look for privileged processes (e.g., services.exe, winlogon.exe) that are created after the registry modification and then immediately spawn child processes like `cmd.exe` or `powershell.exe`. This pattern strongly indicates a malicious DLL, loaded into the privileged parent, has executed a command shell to provide the adversary with elevated access."
          },
          "An attempt to modify the AppCertDLLs registry key originates from a process associated with standard user-level activity, such as a web browser or Office document.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for all attempts (successful and failed) to modify the AppCertDLLs registry key (Event ID 4657). For any attempt, analyze the process lineage using Event ID 4688 to identify the parent and grandparent processes. Flag any modification attempt where the process lineage traces back to a non-administrative, user-context process like `WINWORD.EXE`, `CHROME.EXE`, or a script host (`powershell.exe`, `wscript.exe`) that was spawned by a standard user. This indicates an initial exploit is attempting to establish a privilege escalation mechanism."
          },
          "Following an AppCertDLLs registry modification, a newly created privileged process accesses or modifies sensitive system files or registry keys not associated with its normal function.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, flag any modification to the AppCertDLLs key (Event ID 4657). After this flag, enable heightened monitoring of privileged process activity. Configure and monitor file/registry access events (Event ID 4663) for sensitive resources (e.g., `%SystemRoot%\\System32\\config\\SAM`, `HKLM\\SECURITY`, credentials stores). Correlate these access events with the creation of privileged processes (Event ID 4688) that occurred after the registry modification. Use frequency analysis to establish a baseline of normal file/registry access for common privileged processes and alert on deviations that are temporally linked to an AppCertDLLs change."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```