[
  {
    "Is the adversary establishing or maintaining persistence using LC_LOAD_DYLIB injection? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.006 - LC_LOAD_DYLIB Addition": {
          "Suspicious processes modifying executable binary headers (e.g., Mach-O files).": {
            "Data": "Host File System/Process Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor host file system events and process activity for modifications to executable files in system or application directories. Use correlation analysis to link binary modifications to suspicious processes or user accounts. Flag modifications not coinciding with scheduled software updates."
          },
          "Executable binaries exhibiting invalid or missing digital signatures or altered checksums.": {
            "Data": "Host File Integrity Monitoring Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Regularly calculate checksums or verify digital signatures for critical system and application binaries. Compare current checksums/signatures against known good values. Flag binaries with invalid or missing signatures. Use time series analysis to identify unusual frequency or timing of signature invalidation events."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting privilege escalation using LC_LOAD_DYLIB injection? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.006 - LC_LOAD_DYLIB Addition": {
          "Execution of critical system or application binaries that have been recently modified or have invalid signatures/checksums.": {
            "Data": "Host Process Execution Logs, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process execution logs for execution of binaries identified with invalid signatures or recent modifications. Analyze execution patterns, including parent-child process relationships and command-line arguments. Correlate execution events with subsequent network connections observed in Zeek conn.log."
          },
          "Processes loading unexpected dynamic libraries (dylibs), particularly those from unusual or non-standard paths.": {
            "Data": "Host Process Module Load Logs, Host Process Execution Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process events for dynamic library loading (e.g., dylib loading on macOS). Identify loaded libraries originating from non-standard system paths (e.g., user directories, temporary folders). Use frequency analysis to identify rare or previously unseen dylibs being loaded by legitimate processes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]