[
  {
    "Is the adversary maintaining persistence by modifying Unix shell configurations? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.004 - Unix Shell Configuration Modification": {
          "Outbound network connections from endpoints/servers to suspicious external IP addresses or domains at times corresponding to user logins, potentially triggered by modified shell configurations.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for connections/queries from internal hosts to external IPs/domains flagged as suspicious by threat intelligence. Correlate connection/query timestamps with typical user logon events logged by authentication systems. Use time series analysis or statistical methods (e.g., percentiles) to identify unusual network activity patterns occurring specifically during user login periods."
          },
          "Unusual network activity (e.g., connections on non-standard ports, high volume) originating from endpoints/servers potentially executing commands from user shell configurations during logon.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections from endpoints/servers during user logon periods on ports not typically used by standard applications or with data volumes significantly deviating from the norm. Use descriptive statistics or IQR to identify outliers in port usage or data transfer volume during these specific time windows."
          },
          "Recurring outbound connections to external IPs/domains not typically associated with user activity, occurring consistently after a specific user logs in.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and dns.log for recurring connections/queries from specific user endpoints/servers to external IPs/domains. Correlate these connections with user logon events. Use time series analysis to identify patterns of persistent outbound communication that start shortly after a user logs in, especially if the destination is unusual or known malicious via threat intelligence."
          },
          "Unusual network file transfer activity (e.g., SMB, FTP) or outbound connections on unexpected ports originating from a system immediately after a user login.": {
            "Data": "Zeek conn.log; Zeek smb.log; Zeek ftp.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, smb.log, and ftp.log for unusual file transfer activity (e.g., large transfers, unusual file types) or connections on non-standard ports originating from endpoints/servers during user login times. Use descriptive statistics and percentile analysis to identify outliers in file size, transfer volume, or port usage during these periods. Correlate with user login events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges by modifying Unix shell configurations? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.004 - Unix Shell Configuration Modification": {
          "Outbound network connections from servers or critical systems to suspicious external IP addresses or domains at times corresponding to system startup or privileged user logins, potentially triggered by system-wide shell configurations.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log from servers and critical systems for connections/queries to external IPs/domains flagged as suspicious by threat intelligence. Correlate connection/query timestamps with known system boot times or administrative user login events. Use time series analysis to detect anomalies occurring specifically during these sensitive time windows."
          },
          "HTTP/HTTPS requests from servers or critical systems to known C2 domains or suspicious URLs at times corresponding to system startup or privileged user logins.": {
            "Data": "Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for requests from servers and critical systems to known C2 domains or suspicious URLs identified via threat intelligence. Correlate timestamps with system startup or administrative user login events. Use correlation analysis to identify network requests that are tightly coupled in time with these critical system events."
          },
          "Outbound network connections from critical servers or network devices to external destinations during system startup or privileged user login, originating from unexpected processes or users (if identifiable via logs).": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and dns.log for outbound connections/queries from critical servers or network devices during system boot cycles or privileged user login times. Identify connections to external IPs/domains not part of normal system startup/admin activity. Correlate with known boot times and privileged user login events. Use frequency analysis to identify rare or first-seen destinations during these sensitive periods."
          },
          "Access attempts or successful connections from a system to sensitive network resources (e.g., domain controller shares, critical server shares) immediately following system startup or privileged user login.": {
            "Data": "Zeek smb.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smb.log for connections/access attempts from internal systems to sensitive network shares (e.g., Domain Controller SYSVOL/NETLOGON, critical server shares) during system startup or privileged user login times. Correlate with Windows Event ID 4624/4625 on the target Windows systems for logon/access attempts from the potentially compromised Unix host. Use time series analysis to identify access attempts tightly correlated with these sensitive time points, especially if the accessing system or user is unusual for that resource."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]