[
  {
    "Is the adversary maintaining persistence by modifying file associations? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.001 - Change Default File Association": {
          "Unusual process execution triggered by opening a specific file type.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the command line or parent process indicates execution via a file handler (e.g., explorer.exe launching a non-executable). Identify processes with low frequency of occurrence relative to their parent or file type using frequency analysis."
          },
          "Execution of processes in an unusual parent-child relationship, indicating a modified file association handler.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688) to identify unusual parent-child process relationships where a file handler (like explorer.exe or a document application) launches an unexpected executable. Map process execution paths and flag deviations from normal behavior using correlation analysis with known good patterns."
          },
          "Repeated execution of a suspicious process originating from a file handler over time.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for processes with a parent that is a common file handler or associated application. Use time series analysis to identify processes that are repeatedly launched with the same command line or from the same unusual path over an extended period (e.g., days or weeks), which is indicative of a persistent mechanism like a modified file association."
          },
          "Connections to known malicious or unusual external IP addresses/domains by processes launched by file handlers.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) and Zeek conn.log. Identify network connections originating from processes whose parent is a common file handler or whose command line indicates file association execution. Cross-reference destination IPs/domains against threat intelligence feeds. Flag connections to known malicious IPs or domains, or destinations with low frequency of occurrence across the network (using descriptive statistics or percentile analysis on destination frequency)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges by modifying file associations? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.001 - Change Default File Association": {
          "Processes associated with elevated privileges (e.g., running as SYSTEM) being launched from non-standard file association handlers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes running with elevated privileges (e.g., SYSTEM user, TokenElevationType 2 or 3) in Windows Event ID 4688. Cross-reference these with the parent process. Flag instances where privileged processes are launched from non-standard or recently introduced parent processes commonly associated with file handlers."
          },
          "Unexpected network connections originating from processes launched via modified file associations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Join Windows Event ID 4688 data from endpoints/servers with Zeek conn.log data on hostname/IP and timestamp/process ID. Identify network connections made by processes launched via file associations. Correlate process execution time with connection time. Use entropy measures on connection properties (like destination IPs/ports) for processes launched this way to identify unusual communication patterns compared to baseline for that process/user."
          },
          "File handler process launching a child process that immediately runs with elevated privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Filter events where the parent process is a file handler and the 'TokenElevationType' for the child process is 2 (Limited) or 3 (Full), indicating elevation was requested/granted. Flag instances where common document/file handlers are parents to child processes receiving elevated tokens, using frequency analysis to identify rare occurrences."
          },
          "Launch of system utilities often used for privilege escalation (e.g., cmd, PowerShell, RunDLL32) by file handlers, especially if combined with elevation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify events where the parent process is a file handler (e.g., explorer.exe, document viewers) and the child process is a common system utility (e.g., cmd.exe, powershell.exe, rundll32.exe, regsvr32.exe). Correlate with 'TokenElevationType' for the child process. Flag instances of such launches, particularly if 'TokenElevationType' is 2 or 3 (indicating elevation), using frequency analysis to identify unusual combinations of parent, child utility, and elevation status."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]