[
  {
    "Has the adversary escalated privileges using UAC bypass techniques? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1548.002 - Bypass User Account Control": {
          "Execution of system binaries (e.g., eventvwr.exe, sdclt.exe, rundll32.exe) with unusual command-line arguments or parent processes associated with UAC bypasses.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation logs (Event ID 4688). Filter for processes like 'eventvwr.exe', 'sdclt.exe', 'rundll32.exe' launched by non-standard parent processes (e.g., not explorer.exe). Analyze command-line arguments for suspicious patterns known in UAC bypasses (e.g., referencing specific COM objects or arbitrary binaries). Use frequency analysis to identify rare parent/child process combinations or command-line patterns."
          },
          "Modification of specific User-Hive Registry keys ([HKEY_CURRENT_USER]) known to be abused by UAC bypass techniques.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Registry event logs (Event ID 4657) for modifications to specific keys under HKEY_CURRENT_USER, such as 'Software\\Classes\\mscfile\\shell\\open\\command' or 'Software\\Microsoft\\Windows\\CurrentVersion\\App Paths\\control.exe'. Investigate modifications to these keys, particularly if the data is set to execute an arbitrary binary. Correlate with process execution events (Event ID 4688) to identify the process performing the modification."
          },
          "Execution of Rundll32.exe with command-line arguments referencing COM objects or DLLs known to be involved in UAC bypasses.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation logs (Event ID 4688). Filter for 'rundll32.exe' execution where the command line contains strings like ' shell32.dll,Control_RunDLL', 'advapi32.dll,ShellExecute', or references to known auto-elevating COM objects (e.g., documented in UACMe research). Use frequency analysis to identify rare or never-seen-before command-line arguments for rundll32.exe within the environment."
          },
          "Remote network logon (e.g., Logon Type 3) resulting in the creation of high-integrity processes on the target system without explicit UAC prompts.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4624 events with Logon Type 3 (Network) on target systems with subsequent Windows Event ID 4688 events on the same system indicating the creation of processes with 'High' integrity levels (requires collecting process integrity level, often added by EDR or Sysmon, or inferring from process path/type). Filter for cases where the initiating remote logon account is a member of the local administrators group. Analyze the types of processes launched and compare their integrity levels against local interactive logons by administrators using descriptive statistics to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary bypassing UAC for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1548.002 - Bypass User Account Control": {
          "Process injection detected targeting processes running at high integrity levels, or unusual DLLs loaded into elevated processes.": {
            "Data": "Windows Event ID 7; Windows Event ID 8",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Sysmon event logs (Event ID 7 - ImageLoad, 8 - CreateRemoteThread) for unusual DLL loads into high-integrity processes or remote thread creation targeting high-integrity processes. Use entropy analysis on DLL names or paths to identify packed or obfuscated malicious libraries. Correlate with process execution events (Event ID 4688) to identify the injecting process."
          },
          "Anomalous file system or registry operations performed by processes running at high integrity levels.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation (Event ID 4688 including integrity level), file access (Event ID 4663), and registry modification (Event ID 4657) logs from processes running at high integrity levels. Establish baseline behavior for high-integrity processes using descriptive statistics (e.g., typical file paths accessed, registry keys modified). Flag deviations from the baseline, particularly actions targeting sensitive data locations or system configurations. Correlate with Zeek conn.log for subsequent outbound connections from these processes (requires augmenting network logs with process information)."
          },
          "Creation of processes from unusual directories or temporary locations by processes running at high integrity levels.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation logs (Event ID 4688) including full process path and integrity level. Identify processes running at 'High' integrity. Analyze the executable paths of high-integrity processes. Use frequency analysis and set comparison against known legitimate high-integrity process paths to identify executions from directories commonly used for temporary files or malicious payloads (e.g., user Temp directories, C:\\Windows\\Tasks, etc.) that are not typical for legitimate elevated processes."
          },
          "Outbound network connections initiated by processes running at high integrity levels from locations not typically associated with legitimate system processes or immediately following a UAC bypass activity.": {
            "Data": "Windows Event ID 5156; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate outbound network connections (Event ID 5156, Zeek conn.log) with process creation events (Event ID 4688) including process integrity level. Filter for outbound connections made by processes at 'High' integrity. Establish a baseline of typical outbound connections for legitimate high-integrity processes (e.g., Windows Update, Antivirus updates) using descriptive statistics on destination ports and IPs. Flag connections to unusual destinations, particularly if originating from a process identified in other UAC bypass evidence (e.g., unusual path) or occurring within a short time window after a detected bypass."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]