[
  {
    "Is the adversary maintaining persistence using AppInit DLLs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.010 - AppInit DLLs": {
          "Modification of AppInit_DLLs Registry values that does not correlate with authorized software installations or patches.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to the AppInit_DLLs Registry keys (HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs and Wow6432Node path). Identify the process responsible for the modification. Correlate modification events with known software installation or patch cycles. Flag changes originating from unusual processes or pointing to unknown DLL paths."
          },
          "Loading of unrecognized or unusual DLLs into multiple processes via AppInit mechanism.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the AppInit_DLLs Registry value for unusual or unknown DLL names listed. Monitor Windows Event ID 4688 for process creation events that indicate loading of user32.dll (which implicitly loads AppInit DLLs). Investigate processes starting where the loaded AppInit DLL is unknown or suspicious based on the registry value, potentially using frequency analysis of DLL names found in the registry value."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary elevating privileges using AppInit DLLs? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1546.010 - AppInit DLLs": {
          "Loading of unrecognized or unusual DLLs into privileged processes (e.g., system processes) via AppInit.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor AppInit_DLLs registry value for suspicious entries. Monitor Windows Event ID 4688 for creation of privileged processes (processes running as SYSTEM, TrustedInstaller, etc.). Correlate the creation of privileged processes with recent modifications to the AppInit_DLLs key (Event ID 4657) or the presence of a suspicious DLL path listed in that key. Flag privileged processes that start shortly after a suspicious AppInit DLL is configured."
          },
          "Abnormal process behavior (e.g., network connections, file modifications, child processes) initiated from processes that loaded an unrecognized AppInit DLL.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes known to load AppInit DLLs (based on AppInit registry value and Event ID 4688). Monitor Windows Event ID 4688 for suspicious child processes spawned by these processes. Analyze Zeek conn.log for outbound network connections originating from the hosts running these processes, focusing on destination ports/IPs not matching known good behavior, potentially using correlation analysis between process activity timing (from 4688) and network connection timing (from Zeek)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]