```json
[
  {
    "Is the adversary establishing persistence using malicious installer packages? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.016 - Installer Packages": {
          "Execution of an installer package or an associated dropped script whose file hash matches a known malicious indicator.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events related to installers (e.g., msiexec.exe, setup.exe, install.exe) and their child processes (e.g., cmd.exe, powershell.exe). Extract file hashes of the installer executables and any scripts they launch (script content available in Windows Event ID 4104 for PowerShell). Continuously compare these hashes against a high-confidence CTI feed of known malicious installers, droppers, or persistence scripts. Alert on any match."
          },
          "An installer process creating a persistence mechanism (Scheduled Task, Service, Run Key) with a name, command, or path matching known patterns used by specific malware families or offensive tools.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4697; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the creation of persistence mechanisms: Windows Event ID 4698 (Scheduled Task Created), 4697 (Service Installed), and 4657 (Registry Value Set, with SACLs on Run/RunOnce keys). Filter for events where the creating process is a known installer. Analyze the created task/service/key name, path, and command line against a maintained list of regular expressions and string patterns associated with known malware (e.g., task names like 'OneDrive Updater' pointing to a file in %TEMP%, services using names of known C2 frameworks, or run keys containing obfuscated commands). Alert on pattern matches."
          },
          "An installer process creating a persistence mechanism (e.g., Run keys, Scheduled Tasks, Services) in a manner that is anomalous for legitimate software installations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698; Windows Event ID 4697; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate installer execution events with the creation of persistence mechanisms (Windows Event IDs 4698, 4697, 4657) within a short time window. Establish a baseline of normal persistence modifications for common, legitimate installers in the environment. Use frequency analysis and correlation to identify installers that create persistence mechanisms when they typically should not, or that create persistence pointing to unusual locations (e.g., C:\\Users\\Public, %APPDATA%)."
          },
          "An installer process dropping or executing files in unusual directories or making unexpected network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for file write events (Windows Event ID 4663, with SACLs) by installer processes to locations outside of standard installation paths (e.g., C:\\Program Files, C:\\Program Files (x86)). Baseline normal installation directories for common software and alert on deviations. Correlate file writes and subsequent process executions (Windows Event ID 4688) with network connections (Zeek conn.log) to external destinations not associated with legitimate software updates or activation. Use descriptive statistics on file paths and destination IPs to find rare occurrences."
          },
          "Execution of an unusual or unsigned script (e.g., .bat, .ps1, shell scripts) by an installer process, especially one that contains obfuscated or suspicious commands.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for installer processes (e.g., msiexec.exe) creating child processes that are script interpreters (cmd.exe, powershell.exe). For PowerShell, inspect the script block content in Windows Event ID 4104. Calculate the entropy of script content to detect obfuscation. Analyze script content for suspicious commands related to persistence, credential access, or defense evasion. Use frequency analysis to identify installers that rarely trigger script execution or execute scripts from unusual locations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary elevating privileges using malicious installer packages? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.016 - Installer Packages": {
          "Execution of an installer package whose file hash is known to be associated with a privilege escalation exploit or a vulnerable application.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Capture file hashes of all installer executables upon execution (from Windows Event ID 4688 process creation events, potentially augmented by other EDR data). Cross-reference these hashes against CTI feeds that specifically track malware or vulnerable software versions known to contain privilege escalation exploits (e.g., mapping to specific CVEs). Alert on any match and investigate for post-exploitation activity."
          },
          "An installer process launching a known privilege escalation tool or a script with characteristic command-line arguments for privilege escalation.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for child processes spawned by installers. Scan the child process name and command line for signatures of known privilege escalation tools (e.g., PrintSpoofer.exe, JuicyPotato.exe, PowerUp.ps1, etc.). Maintain and use a list of regular expressions to detect these tool names or their characteristic command-line patterns. For PowerShell scripts launched by installers, analyze the script block content (Windows Event ID 4104) for functions or commands associated with common privilege escalation frameworks."
          },
          "An installer process spawning an unexpected child process that runs with a higher integrity level (High or System) than is typical for the parent installer or standard software installations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Establish a baseline of normal child processes and their integrity levels for common, legitimate installers. Flag instances where an installer process launches an unusual child process (e.g., cmd.exe, powershell.exe, rundll32.exe) that is running at a 'High' or 'System' integrity level. Use entropy measures on the command line arguments of these elevated child processes to detect obfuscation or complexity that deviates from the norm."
          },
          "An installer process making sensitive system modifications inconsistent with its manifest, such as altering security policies, disabling security tools, or modifying user account privileges.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4738; Windows Event ID 4720",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for sensitive modifications originating from installer processes. This includes file/registry writes (Windows Event ID 4663 with SACLs on critical locations), user account changes (Windows Event ID 4738 - A user account was changed), or new account creation (Windows Event ID 4720). Correlate these modifications with the execution of an installer. Use time series analysis to detect a burst of privileged system changes following an installation event. Investigate any modifications that are not documented or expected for the specific software being installed."
          },
          "An installer process attempting to access or modify highly sensitive registry keys associated with privilege escalation or defense evasion (e.g., Image File Execution Options, Winlogon, LSA).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor object access auditing (with specific SACLs) on critical registry keys such as HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options, HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon, and HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa. Monitor Windows Event IDs 4656 (handle requested), 4657 (value set), and 4663 (object access) for any write or delete access attempts by installer processes. Any such access is highly suspicious and should be investigated, as legitimate installers rarely touch these keys."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```