[
  {
    "Is the adversary maintaining persistence using component firmware? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.002 - Component Firmware": {
          "Unusual outbound network connections originating from hosts where component firmware compromise is suspected.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts generating unusual outbound network connections. Analyze Zeek conn.log for connections to uncommon destinations, ports, or protocols from hosts where this is not typical. Use frequency analysis or anomaly detection methods (e.g., Z-score) on connection volume, destination diversity, or port usage per host."
          },
          "Execution of unexpected processes with high privileges or unusual parent processes on hosts where component firmware compromise is suspected.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on target hosts. Look for processes launched with high privileges without a clear parent process (PID 0 or system process) or parent-child relationships that deviate significantly from established baselines. Use correlation analysis to link unusual processes to other system events."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using component firmware? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1542.002 - Component Firmware": {
          "Repeated system errors or crashes on endpoints, potentially indicative of underlying component instability.": {
            "Data": "Windows Event ID 1000, Windows Event ID 1001, Windows Event ID 6008",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event IDs 1000, 1001, 6008 from endpoints. Count the frequency of these error events per host over time. Use time series analysis to identify sudden spikes or unusual patterns in system errors that correlate across multiple components."
          },
          "Network activity exhibiting characteristics of covert channels or unusual protocols from endpoints.": {
            "Data": "Zeek conn.log, Zeek dns.log, Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek logs (conn.log, dns.log, http.log, etc.) for patterns indicative of covert channels, such as excessive DNS queries to specific domains, low-volume/high-frequency connections, or unusual data encoding within standard protocols. Apply statistical analysis (e.g., entropy measures on data payloads) to identify hidden data transmission."
          }
        }
      }
    }
  }
]