[
  {
    "Is the adversary maintaining persistence using TFTP boot on network devices? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.005 - TFTP Boot": {
          "Unauthorized changes detected in network device startup configuration (boot sequence, TFTP server setting).": {
            "Data": "Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for transfer of known network device configuration file names via TFTP (port 69). Identify transfers to or from unexpected source/destination IPs or devices. Analyze file transfer frequency using descriptive statistics to identify rare events."
          },
          "Unusual or unexpected TFTP connection activity originating from/to network devices.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections using TFTP (port 69) involving network devices. Identify connections to/from unexpected source/destination IPs or ports. Analyze connection volume and duration using descriptive statistics and identify outliers (e.g., using IQR) for connections outside baseline patterns."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using TFTP boot on network devices? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542.005 - TFTP Boot": {
          "Network device running an unauthorized or modified system image.": {
            "Data": "Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for transfer of large files (potential OS images) via TFTP (port 69) to network devices. Analyze file transfer size, frequency, and compare against known device image file sizes/transfer patterns to identify anomalies using descriptive statistics."
          },
          "Network device boot information (image booted, startup config used) is inconsistent with expected state.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for TFTP traffic (port 69) to network devices immediately preceding or following device reboots. Correlate unusual TFTP activity with device uptime/reboot events observed through other means. Use time series analysis on TFTP traffic volume per device to identify unusual spikes potentially related to boot processes."
          }
        }
      }
    }
  }
]