[
  {
    "Is the adversary establishing persistence using malicious installer packages? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.016 - Installer Packages": {
          "Execution of unusual or unsigned scripts (e.g., .bat, .ps1, shell scripts) triggered by software installer processes (e.g., msiexec.exe, package managers).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created by common installer executables (e.g., msiexec.exe, setup.exe, install.exe) where the created process is a script interpreter (cmd.exe, powershell.exe, sh, bash). Analyze script content logged via Event ID 4104 (PowerShell). Flag scripts that are unsigned or exhibit unusual behavior. Use frequency analysis to identify installers triggering script execution rarely observed in the environment."
          },
          "Creation or modification of persistence mechanisms (e.g., Run keys, Scheduled Tasks, Services) originating from software installation processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4698; Windows Event ID 4697; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4688 (for process creation of schtasks.exe, sc.exe) and 4698 (Scheduled Task Creation), 4697 (Service Creation), 4657 (Registry Value Set - requires SACLs for Run keys). Filter these events to identify those where the creating process is a known installer executable. Investigate newly created Scheduled Tasks, Services, or Registry Run key entries originating from installer processes. Use correlation analysis to link installer execution timestamps with persistence mechanism creation timestamps."
          },
          "Dropping or executing suspicious files with elevated privileges by an installer process outside of typical installation directories.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 where the ParentProcessName is an installer executable and the created process is an uncommon executable or script interpreter. Use Event ID 4656/4663 (with appropriate SACLs) to identify file creations/modifications by installer processes in suspicious locations (e.g., temp directories not directly managed by the installer, user profile directories, C:\\ProgramData). Analyze file hashes against threat intelligence. Use frequency analysis to identify files created by installers that are rarely seen across the environment."
          },
          "Network connections initiated by processes or scripts launched by installer packages, especially to external or unusual destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events showing script interpreters or newly created executables launched by installers with Windows Event ID 5156 (Network Connection) and Zeek conn.log entries originating from these child processes. Identify connections to external IP addresses, unusual ports, or destinations not typically associated with software installation updates or licensing. Use correlation analysis to link process execution, network connection timestamps, and destination IPs. Cross-reference destination IPs with threat intelligence feeds."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary elevating privileges using malicious installer packages? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.016 - Installer Packages": {
          "Execution of child processes with elevated privileges (SYSTEM, Administrator) by installer processes that are not typical for standard software installations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Filter for processes where the ParentProcessName is a known installer executable (e.g., msiexec.exe) and the process integrity level is 'High' or 'System'. Analyze entropy of the created process command line arguments or executable name to identify unusual executables run with high privileges. Use frequency analysis to baseline typical child processes and integrity levels for known installers."
          },
          "Modification of system files, registry keys, or service configurations with elevated privileges by installer processes.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4697; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 (Object Access - requires SACLs) and 4697. Filter events where the access/modification was performed by a known installer process and targets critical system files (e.g., System32), registry keys (e.g., HKLM\\SYSTEM, HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\), or service configurations. Use time series analysis to identify bursts of privileged modifications correlated with installer execution events and investigate if modifications are outside the scope of the expected installation."
          },
          "Execution of suspicious command lines by script interpreters or processes launched by installers with elevated privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes created by installer executables with elevated privileges (High or System integrity level). Specifically focus on child processes that are script interpreters (cmd.exe, powershell.exe) or common living-off-the-land binaries. Analyze the command line arguments (CommandLine) for suspicious patterns, encoding, obfuscation, or commands used for system configuration changes, privilege management, or malicious code execution. Use frequency analysis on command line arguments or their hashes to identify anomalous execution strings."
          },
          "Attempted or successful access/modification of security-sensitive registry keys (e.g., Winlogon, Image File Execution Options) by installer processes with elevated privileges.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 (with appropriate SACLs on sensitive registry keys like HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon, HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options, HKLM\\SOFTWARE\\Policies) for access or modification attempts by installer processes (e.g., msiexec.exe) operating with elevated privileges. Filter for events indicating write or delete operations. Use time series analysis to correlate these events with installer execution events and identify unusual timing or patterns of access to these critical registry locations not expected during standard software installation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]