[
  {
    "Is the adversary maintaining persistence using AppCert DLLs? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.009 - AppCert DLLs": {
          "Unexpected modification of the AppCertDLLs Registry value.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 events targeting HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs. Identify the process and user account making the modification. Compare modifications against change management records or known software installations. Flag any unauthorized changes."
          },
          "Unrecognized DLL loaded into processes via AppCertDLLs.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 events for processes created. Analyze command line and parent process relationships for anomalies potentially indicative of triggering AppCert DLL loads. Investigate subsequent suspicious behavior (e.g., unexpected network connections via Zeek conn.log) from these processes using correlation analysis."
          },
          "Creation of processes with an unusual parent-child relationship or command line arguments, potentially indicative of API calls triggering AppCert DLLs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Analyze process creation events for unusual parent-child relationships (e.g., unexpected processes launching system utilities or command shells) or suspicious command line arguments, especially for processes known to trigger AppCert DLLs (like CreateProcess, WinExec). Establish baselines of normal process execution patterns per user/system and flag deviations using frequency analysis."
          },
          "Network connections to suspicious or unknown external destinations originating from processes that are known to trigger AppCert DLLs or have loaded an unusual DLL.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with Windows Event ID 4688 (Process Creation) and Windows Event ID 5156 (Network Connection) events. Identify network connections originating from processes known to trigger AppCert DLLs (or flagged as unusual process creations) to external or unusual destinations. Cross-reference destination IPs against threat intelligence feeds. Use correlation analysis to link specific process executions with outbound C2-like traffic patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary escalated privileges using AppCert DLLs? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.009 - AppCert DLLs": {
          "Modification of AppCertDLLs Registry value by a low-privilege process.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 events targeting HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs. Identify events where the modifying process or user account has lower privileges than SYSTEM or Administrator. Use process lineage (via Event ID 4688) to trace the source of the modification."
          },
          "Unrecognized DLL loaded into elevated processes via AppCertDLLs.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events for processes created with elevated privileges (e.g., running as SYSTEM, Administrator). Look for unusual network connections originating from these elevated processes using Zeek conn.log. Use correlation analysis to link suspicious process creation events with unexpected network activity."
          },
          "Write actions performed by an elevated process to protected system directories (e.g., C:\\Windows\\System32) that are not typical for that process.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on protected system directories (e.g., %SystemRoot%\\System32, %SystemRoot%\\SysWOW64) to log object access events. Monitor Windows Event ID 4663 events targeting these directories where the Accesses field includes 'WriteData' or 'AppendData'. Filter these events by the accessing process and user. Identify processes running with elevated privileges (e.g., SYSTEM, Administrator) performing unusual write actions based on frequency analysis compared to baseline behavior."
          },
          "Access or attempted access to sensitive system files (e.g., SAM, SYSTEM hives) by an elevated process.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on sensitive system files like %SystemRoot%\\System32\\config\\SAM and %SystemRoot%\\System32\\config\\SYSTEM to log access (e.g., ReadData, WriteData). Monitor Windows Event ID 4663 events targeting these files. Filter events by the accessing process and user. Flag any access by processes running with unexpected elevated privileges or by accounts not normally authorized for such access. Use statistical analysis to identify deviations from expected access patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]