[
  {
    "Is the adversary establishing or maintaining persistence by creating or modifying system processes? (TA0003 - Persistence)": {
      "Indicators": {
        "T1543 - Create or Modify System Process": {
          "Creation or modification of system services (Windows Services, Linux Daemons, macOS Launch Daemons/Agents) not associated with known software installations or system updates.": {
            "Data": "Windows Event ID 4697; Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697, 7045, and 4688 for service creation/modification events. Correlate events with known system update/software installation schedules. Identify outliers by comparing new service names, executable paths, and configurations against a baseline of approved services using difference analysis or clustering on service properties."
          },
          "Unusual child processes spawned by legitimate system services or daemons.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify processes spawned by known legitimate services (based on parent process ID and executable path). Analyze the command line and executable path of child processes. Use correlation analysis to identify child processes that make suspicious network connections (using Zeek conn.log) or execute known malicious commands."
          },
          "Changes to executable files or configuration files associated with legitimate system services or daemons outside of scheduled maintenance.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access, Write) targeting executable files (.exe, .dll, .so) and configuration files (e.g., .xml, .conf) associated with known legitimate system services or daemons. Establish a baseline of typical file modifications during patches or software updates. Use time series analysis or frequency analysis to flag changes outside maintenance windows or with unusual frequencies."
          },
          "Execution of service control commands (e.g., sc.exe, systemctl) from unusual directories or by unexpected parent processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of service control utilities (sc.exe, systemctl, launchctl). Extract process path, command line arguments, and parent process information. Identify execution of these tools from temporary directories, user profile directories, or by non-standard parent processes. Use frequency analysis to establish baseline usage patterns of these utilities per host or user and flag outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges by creating or modifying system processes? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1543 - Create or Modify System Process": {
          "Creation or modification of system services configured to run under SYSTEM/root privileges by an unprivileged or non-standard account.": {
            "Data": "Windows Event ID 4697; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697 and 7045. Extract the Service Account Name and Privileges information. Flag events where a service is created/modified to run as SYSTEM/root but the account performing the creation/modification is not a standard administrative account. Analyze entropy of creating account names or login sessions if needed."
          },
          "Execution of command-line tools (e.g., sc.exe, systemctl, launchctl) used to create, modify, or start system services or daemons, particularly when invoked by suspicious processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation, specifically filtering for command-line arguments containing service control commands or executables like 'sc.exe', 'systemctl', 'launchctl'. Analyze the parent process of these commands. Flag execution of these tools by processes not typically associated with system administration or software deployment. Use time series analysis to detect unusual frequency or timing of these commands."
          },
          "Successful creation or modification of a system service configured to run as SYSTEM/root, where the creating process did not have explicit administrator/SYSTEM privileges.": {
            "Data": "Windows Event ID 4697; Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event IDs 4697 (Service Install) or 7045 (Service Install - older systems) or service modification events with the process creation event (Windows Event ID 4688) that initiated it. Analyze the token or integrity level of the creating process in Event 4688. Flag instances where a service configured to run as SYSTEM/root is created/modified by a process running at a lower integrity level or without explicit administrative privileges. This requires advanced correlation or data enrichment."
          },
          "Legitimate system services spawning child processes with higher privilege levels or suspicious executables/command lines.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify child processes created by known legitimate system services (e.g., svchost.exe, services.exe) by analyzing ParentProcessId and ParentProcess Name/CommandLine. Analyze the CommandLine and IntegrityLevel of the child process. Flag child processes with elevated integrity levels, suspicious executable paths (e.g., temp directories), or suspicious command-line arguments that are not part of the service's normal operation. Use correlation analysis to identify sequences where a service spawns a suspicious, higher-privilege process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]