[
    {
        "information_requirement": "Is the adversary maintaining persistence using TFTP boot on network devices?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1542.005",
                "name": "TFTP Boot",
                "evidence": [
                    {
                        "description": "TFTP transfer of a file whose hash matches a known malicious network device OS image or configuration script, or connections to/from a known malicious TFTP server IP.",
                        "data_sources": [
                            "Zeek file.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Extract file hashes from TFTP transfers captured in Zeek file.log and compare them against a threat intelligence feed of known malicious file hashes specific to network OS images or persistence scripts. Concurrently, monitor Zeek conn.log for TFTP connections where the source or destination IP matches a CTI feed of known malicious infrastructure. Alert on any matches."
                    },
                    {
                        "description": "TFTP transfer of files with names or extensions commonly used by persistence toolkits or malicious scripts (e.g., `persistence.sh`, `backdoor.cfg`).",
                        "data_sources": [
                            "Zeek file.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek file.log for TFTP transfers involving network devices. Use regular expressions to search for filenames matching known malicious patterns or suspicious extensions (e.g., `.sh`, `.py`, `.elf`) not typically associated with standard OS images or configs. Maintain and regularly update a list of suspicious filename patterns associated with network device malware and persistence techniques."
                    },
                    {
                        "description": "A network device makes an outbound TFTP connection to an unauthorized internal or any external IP address, indicating a configuration to fetch a boot image from a malicious server.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and maintain an explicit allowlist of authorized internal TFTP servers for network management. Monitor Zeek conn.log for all TFTP (UDP port 69) traffic originating from network device IP ranges. Alert on any connection where the destination IP is not on the allowlist, especially if the destination is an external, internet-routable IP address. Use linear regression to identify any increasing trend of such unauthorized connections over time."
                    },
                    {
                        "description": "Anomalous TFTP transfer activity involving a network device, characterized by unusual timing, frequency, or source/destination, deviating from established management baselines.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek file.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal TFTP activity (source/destination IPs, time-of-day, frequency, file names/sizes) for network device management, focusing on scheduled maintenance windows. Monitor Zeek conn.log and file.log for TFTP traffic. Use time series analysis to detect activity at unusual times and statistical methods (e.g., Inter-Quartile Range (IQR) on file sizes, Z-score on transfer frequency) to flag transfers from/to rare IPs or of anomalous size. A sudden spike in TFTP activity from an unexpected management host is a strong indicator."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary evading defenses using TFTP boot on network devices?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense-Evasion",
        "indicators": [
            {
                "technique_id": "T1542.005",
                "name": "TFTP Boot",
                "evidence": [
                    {
                        "description": "A network device boots using a file transferred via TFTP whose hash is known to belong to a modified/backdoored OS image or a defense evasion toolkit.",
                        "data_sources": [
                            "Zeek file.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor Zeek file.log for all files transferred via TFTP to network devices. Calculate the hash (e.g., SHA256) of every transferred file. Compare these hashes against a high-confidence threat intelligence database of file hashes for known malicious network device firmware, bootloaders, and configuration files. An alert on a hash match is a high-fidelity indicator of defense evasion."
                    },
                    {
                        "description": "A sequence of events matching a pattern of malicious TFTP boot: a TFTP transfer, a device reboot, and subsequent communication using a known covert C2 protocol.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek file.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a sequence-based rule that triggers on: 1) A TFTP file transfer to a network device (from Zeek file.log). 2) A device reboot (inferred from loss/resumption of management traffic like SNMP, or syslog messages). 3) New, post-reboot outbound connections from the device (from Zeek conn.log) that match patterns of known C2 protocols (e.g., DNS tunneling, ICMP C2) or connect to destinations with known malicious JA3 hashes. Correlate these events by device IP over a defined time window (e.g., 15 minutes)."
                    },
                    {
                        "description": "A network device exhibits a significant change in its network communication profile immediately following a TFTP file transfer and subsequent reboot.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each critical network device, establish a detailed baseline of its normal network behavior (protocols used, destination IPs, data volume, connection frequency). Monitor Zeek conn.log for any TFTP activity involving these devices. If TFTP activity is detected, flag the device and perform an immediate, intensive comparison of its post-TFTP network traffic against its historical baseline. Use statistical tests (e.g., chi-squared test for protocol distribution changes, t-test for traffic volume changes) to quantify the deviation and alert on significant changes."
                    },
                    {
                        "description": "Inbound TFTP traffic is observed from an external IP or an internal host not authorized for network management, indicating an attempt to load a malicious image to evade on-device security controls.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Strictly enforce a policy of denying all inbound TFTP (UDP port 69) traffic at the network perimeter and log violations. Internally, monitor Zeek conn.log for any host not on the network management allowlist initiating a TFTP connection to a network device. Use frequency analysis on source IPs; a single attempt from an unauthorized source is highly suspicious. Correlate any successful unauthorized TFTP transfer with subsequent device behavior."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
