[
  {
    "Is the adversary maintaining persistence using Systemd services? (TA0003 - Persistence)": {
      "Indicators": {
        "T1543.002 - Systemd Service": {
          "Creation or modification of Systemd service unit files (.service) in system or user directories, especially in unexpected locations or with suspicious content.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) for writes/modifications to files in standard systemd service directories (/etc/systemd/system, /usr/lib/systemd/system, user directories) and Windows Event ID 4688 for processes creating/modifying these files. Filter for uncommon process names or modifications by non-root/non-system users."
          },
          "Suspicious processes spawned with a parent process ID of 1 (systemd), particularly if running unusual executables or scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) events. Identify processes spawned with Parent Process ID (PPID) of 1 (analogous to systemd's behavior). Filter for unusual executables, scripts, or command-line arguments initiated this way. Use frequency analysis on process names/command lines associated with PPID 1."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges using Systemd services? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1543.002 - Systemd Service": {
          "Systemd service unit files (.service) with modified `Exec*` directives or `User` directives configured to run as privileged users for non-standard services.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4688 for processes with PPID 1. Compare the command lines or executable paths against a baseline of known legitimate services. Flag services running unusual executables or services configured to run with elevated privileges or as unexpected users."
          },
          "Execution of `systemctl` or `/usr/sbin/service` commands with parameters indicative of creating, enabling, starting, or modifying suspicious services.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of `systemctl` or `/usr/sbin/service` (or their Windows equivalents like `sc.exe` or `powershell` commands managing services, interpreted based on the Linux tool names provided). Analyze command line arguments for actions like `enable`, `start`, `install`, or modifications to service configurations that are not part of standard system updates or administration scripts. Use correlation analysis to link suspicious command executions to other host or network activity."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]