```json
[
  {
    "Is the adversary maintaining persistence using shortcut modification? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.009 - Shortcut Modification": {
          "Creation of a shortcut (.lnk) file whose target path points to a known malicious executable (by hash) or connects to a known malicious domain/IP address.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor for file modification (Event ID 4663) or process creation (Event ID 4688) involving '.lnk' files in persistence locations (e.g., Startup folders). Extract the target path from the LNK file or command line. Hash the target executable and inner join with a CTI feed of malicious file hashes. For LNKs targeting network resources, extract the domain/IP and inner join with CTI feeds of known C2 infrastructure. Correlate processes spawned by LNKs with network connections (Zeek conn.log) to known malicious destinations."
          },
          "Creation or modification of a shortcut (.lnk) in a startup folder that targets a living-off-the-land binary (LOLBAS) with suspicious command-line arguments.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for '.lnk' file modifications (Event ID 4663) and executions (Event ID 4688) in startup directories. Analyze the LNK target or process command line. Use regular expression matching to flag instances where the target is a known LOLBAS (e.g., powershell.exe, mshta.exe, rundll32.exe, cscript.exe) and the arguments contain patterns indicative of malicious activity, such as '-e' (encoded command), '-nop' (NoProfile), '-w hidden', or references to remote scripts (.hta, .js, .vbs). Use correlation analysis to find rare or high-entropy argument combinations."
          },
          "Anomalous creation of a shortcut (.lnk) file in a user or system startup folder, followed by suspicious process or network behavior upon execution.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal LNK file creation/modification activity in startup folders (%APPDATA%\\...\\Startup, %PROGRAMDATA%\\...\\Startup), noting typical sources (e.g., installer processes). Monitor for deviations using time series analysis to detect unusual bursts of activity. When a new/modified startup LNK is executed (Event ID 4688), correlate the spawned process with subsequent network activity (Zeek conn.log). Use descriptive statistics and outlier detection (e.g., IQR, box-plots) to flag anomalous connection patterns (e.g., unusual destination port, high data upload, long duration) not seen from other startup processes."
          },
          "A shortcut (.lnk) file is created with properties designed to evade detection, such as a large file size, an icon that masquerades as a legitimate application, or a hidden file attribute.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon detection of a new or modified LNK file (Event ID 4663), analyze its metadata. Flag LNK files with unusual sizes (e.g., > 1MB, which may indicate padding with junk data). Identify LNKs with a mismatch between the icon path (e.g., pointing to explorer.exe) and the actual target path (e.g., pointing to powershell.exe). Monitor for the creation of LNKs with the 'hidden' attribute set in persistence locations. Use frequency analysis to determine the rarity of these properties across the environment and alert on outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary modified shortcuts for privilege escalation? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.009 - Shortcut Modification": {
          "Modification of a shortcut (.lnk) in a privileged or system-wide location to point to a target executable with a known malicious file hash.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for file modification events (Event ID 4663) on '.lnk' files in privileged locations (e.g., 'C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs', Public Desktop folders). Upon modification, parse the LNK file to extract the new target executable path. Hash the target executable file and compare the hash against a CTI feed of known malicious file hashes. Alert on any match and investigate for privilege escalation intent."
          },
          "Modification of a trusted system shortcut to prepend or replace the target path with a command that executes malicious code via a LOLBAS before running the legitimate application.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline the target paths of legitimate LNK files in privileged locations (e.g., 'Administrative Tools'). Monitor for modifications (Event ID 4663) where the new target path begins with a LOLBAS (e.g., 'cmd.exe /c', 'powershell.exe -c') and includes the original path as an argument. Use regular expression matching to detect this specific hijacking pattern. Correlate with process execution events (Event ID 4688) to analyze the full command line for this pattern and identify the spawned malicious and legitimate processes."
          },
          "A process launched by a shortcut in a privileged context (e.g., run by a high-privilege user or system account) creates child processes or network connections inconsistent with the shortcut's original purpose.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline the normal process execution chain and network behavior for privileged shortcuts. Monitor for executions of these LNKs (identified by user context and command line in Event ID 4688) that result in anomalous child processes (e.g., powershell.exe, net.exe, whoami.exe) or any network connections to external addresses (Zeek conn.log). Use parent-child process relationship analysis and correlation analysis to detect deviations from the established baseline. Flag any network activity from processes spawned by privileged LNKs that are expected to operate offline."
          },
          "A shortcut file in a privileged location is modified, and its subsequent execution results in the creation of a new logon session or the assignment of special privileges to a process.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4672",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection rule that correlates a '.lnk' file modification event (Event ID 4663) in a privileged directory with a subsequent process creation from that LNK (Event ID 4688). Further correlate this sequence with either a new logon event (Event ID 4624, especially Type 2 Interactive or Type 5 Service initiated by the LNK process) or a special privilege assignment event (Event ID 4672) for the newly created process within a short time window (e.g., 1-2 seconds). Use time series and correlation analysis to link this specific sequence of events, which is a strong indicator of successful privilege escalation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```