[
  {
    "Is the adversary maintaining persistence via malicious kernel modules/extensions? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.006 - Kernel Modules and Extensions": {
          "Network traffic patterns consistent with C2 activity originating from a potentially compromised host, potentially related to kernel module backdoors.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn, http, dns) for connections from internal hosts to known malicious C2 IPs or domains. Use correlation analysis to identify hosts exhibiting connection patterns consistent with C2 (e.g., beaconing). Look for connections on unusual ports or protocols originating from systems or users not typically involved in external communications. Investigate outlier connections using descriptive statistics on port/protocol usage."
          },
          "Anomalous process creation or file modifications potentially associated with kernel module installation or malicious tooling.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving compilation tools (e.g., 'cl.exe', 'nmake') or attempts to execute unusual file types (e.g., '.sys' with unusual properties) in sensitive directories (e.g., C:\\Windows\\System32\\drivers). Monitor Windows Event ID 4657 for modifications to critical system files or service configurations that could indicate persistence mechanisms (requires appropriate SACLs). Use time series analysis to detect sudden bursts of activity or changes outside normal maintenance windows."
          },
          "Installation or persistent running of unsigned or newly registered kernel-mode services/drivers.": {
            "Data": "Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7045 for new services created with 'ServiceType' 1 (Kernel Driver) or 2 (File System Driver). Correlate these events with Windows Event ID 4688 events on the same host to identify processes that created or copied the associated driver file (.sys). Check if the installed driver file is unsigned or has unusual properties (e.g., not in a standard system location, unexpected hash). Use frequency analysis to identify newly appearing or rarely seen driver names/hashes."
          },
          "Modification of critical registry keys related to system boot, driver loading, or service configuration by unusual processes or users.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs to audit modifications (Windows Event ID 4657) to sensitive registry keys involved in kernel module/driver loading or system startup (e.g., 'HKLM\\SYSTEM\\CurrentControlSet\\Services', 'HKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager'). Filter for modifications made by processes not typically involved in system configuration or by non-privileged users. Analyze patterns of modifications using time series analysis or frequency analysis to detect bursts of activity or unusual values being set."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary achieved privilege escalation using malicious kernel modules/extensions? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.006 - Kernel Modules and Extensions": {
          "Execution of commands or processes potentially involved in attempting to load or manage kernel modules or related tooling.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event ID 4688 (Process Creation). Search for command-line arguments or process names potentially related to loading kernel modules or drivers ('sc.exe' followed by 'create' or 'start' commands for services with type 'kernel' or 'filesystem', compilation tools like 'cl.exe', or system information commands like 'systeminfo') potentially executed by low-privilege users. Use frequency analysis to identify rare commands or execution patterns by user and process path."
          },
          "New network connections or elevated process activity originating from a process or user after potential kernel module manipulation attempts.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with Windows Event ID 4688 on the same host, focusing on activity shortly after suspicious process creation events (e.g., 'sc.exe', compilation tools) or driver installation events (Event ID 7045) identified in related persistence/escalation detections. Look for new outgoing connections from processes that previously had no network activity, or from users who gained elevated privileges. Use correlation analysis to link unusual network sessions with specific process executions and identify outliers in network connection patterns using descriptive statistics or box plots."
          },
          "Attempted execution of system-level commands (e.g., sc.exe, compilation tools, system info) by users without administrative privileges.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for executions of commands like 'sc.exe' (Service Control Manager), compilation tools ('cl.exe', 'nmake'), or system information tools ('systeminfo', 'ver') where the 'SubjectUserSid' corresponds to a non-administrator account. Use frequency analysis to identify users attempting to run these commands unusually frequently or at all, especially if they lack the necessary privileges. Correlate with Windows Event ID 4624/4625 (logon events) to understand the context of the user session."
          },
          "Network connections to external hosts or internal repositories immediately preceding or following the suspected loading of a malicious kernel module/driver.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for connections originating from potential target hosts shortly before or after detection of suspicious kernel module/driver related activity (e.g., Event ID 7045, 4688). Look for connections to external IPs, unusual download sizes (especially via HTTP), or DNS requests for uncommon domains, potentially related to fetching driver components or contacting C2 after successful privilege escalation. Use time series analysis to correlate network activity with host events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]