[
  {
    "Is the adversary maintaining persistence using shortcut modification? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.009 - Shortcut Modification": {
          "Creation or modification of shortcut (.lnk) files in user or system startup folders.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 for '.lnk' file creation/modification events in user or system startup directories (e.g., 'AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup', 'ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'). Identify events not correlated with software installation or updates. Use time series analysis or frequency analysis to detect bursts of shortcut modifications."
          },
          "Shortcut (.lnk) files with unusual properties (e.g., Zone Identifier > 1, suspicious target path, masqueraded icon/name) being created or modified.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze properties of newly created/modified '.lnk' files identified via file system events (Windows Event 4656/4663). Check for specific indicators like a Zone Identifier greater than 1 or unusual target paths pointing to suspicious executables/locations. Correlate with process creation events (Event ID 4688) originating from suspicious LNK execution."
          }
        }
      }
    }
  },
  {
    "Has the adversary modified shortcuts for privilege escalation? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.009 - Shortcut Modification": {
          "Modification of existing shortcuts pointing to legitimate system programs to execute adversary code before or instead of the original program.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 for modifications to '.lnk' files located in protected directories or those commonly used to launch system tools. Compare the modified target path against the original or expected path. Flag changes pointing to non-standard or suspicious executable locations using correlation analysis between baseline file properties and current state."
          },
          "Execution of a modified shortcut followed by process creation with elevated privileges or access attempts to restricted resources.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624, Windows Event ID 4672, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) events where the parent process is explorer.exe or a login process (indicating startup execution) with subsequent process creation (Event ID 4688) where the new process attempts privileged actions (Event ID 4672) or spawns network connections (Zeek conn.log). Look for deviations from baseline process relationships and network activity using correlation analysis."
          }
        }
      }
    }
  }
]