[
  {
    "Is the adversary establishing persistence via Netsh Helper DLL? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.007 - Netsh Helper DLL": {
          "Detection of unusual child processes spawned by netsh.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where 'ParentProcessName' is 'netsh.exe'. Identify child processes and their command lines. Use frequency analysis or outlier detection to flag child processes that rarely or never occur in the environment under normal circumstances."
          },
          "Suspicious modifications to the HKLM\\SOFTWARE\\Microsoft\\Netsh registry key.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for 'ObjectName' matching 'HKLM\\\\SOFTWARE\\\\Microsoft\\\\Netsh'. Baseline common modifications or additions by known software installers. Flag changes that add new DLL paths, especially to unusual locations, or changes not associated with known system updates or software installs."
          },
          "Frequent or unusual execution of netsh.exe processes, especially from unexpected parent processes or user accounts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'NewProcessName' being 'netsh.exe'. Analyze the frequency and timing of netsh.exe executions per host and user. Use time series analysis or frequency distribution to identify unusual spikes in execution or executions occurring outside normal baseline patterns. Investigate parent processes ('ParentProcessName') that commonly launch netsh.exe and flag executions from unusual parents (e.g., not system services, standard user processes, or known VPN clients)."
          },
          "Correlation of a suspicious HKLM\\SOFTWARE\\Microsoft\\Netsh registry modification with subsequent netsh.exe execution and child process activity.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4657 events showing modifications to 'HKLM\\\\SOFTWARE\\\\Microsoft\\\\Netsh' with Windows Event ID 4688 events showing netsh.exe execution on the same host occurring shortly after the modification. Analyze any child processes spawned by netsh.exe in these correlated events for suspicious activity. Use time-based correlation and filter events based on the registry modification timestamp."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges via Netsh Helper DLL? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.007 - Netsh Helper DLL": {
          "Execution of system utilities or commands with elevated privileges as a child process of netsh.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs where netsh.exe is the parent. Examine child process command lines for execution of administrative tools (e.g., PowerShell, cmd, net) with commands indicative of privilege escalation (e.g., modifying services, creating users, accessing restricted files). Correlate with process integrity levels."
          },
          "Addition of new, untrusted helper DLL paths to HKLM\\SOFTWARE\\Microsoft\\Netsh.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4657 events targeting 'HKLM\\\\SOFTWARE\\\\Microsoft\\\\Netsh'. Extract the 'NewValue' data. Compare the added DLL path against a list of known legitimate helper DLLs. Flag additions that point to unusual or temporary directories, or to DLLs with unknown file hashes. Use correlation analysis to link registry modifications to specific parent processes (if available) or user sessions."
          },
          "Execution of netsh.exe processes with elevated integrity levels, especially when followed by child process creation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for 'NewProcessName' being 'netsh.exe'. Analyze the 'TokenElevationType' or 'ProcessIntegrityLevel' field. Flag executions of netsh.exe with elevated integrity levels (e.g., 'High' or 'System') when not associated with known administrative tasks or installers. Correlate these elevated netsh executions with any subsequent child process creations."
          },
          "Outbound network connections originating from netsh.exe or its child processes to unusual or external destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events for netsh.exe and its child processes with Windows Event ID 5156 events (Windows Filtering Platform Connection) or Zeek conn.log entries showing outbound network connections originating from these processes/hosts. Flag connections to external or unusual destinations, especially if the process integrity level was elevated. Use correlation analysis to link network activity back to the specific process and parent."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]