[
  {
    "Is the adversary maintaining persistence using the Emond service? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.014 - Emond": {
          "Creation or modification of suspicious Emond rule files in '/etc/emond.d/rules/' or queue files in '/private/var/db/emondClients'.": {
            "Data": "Required data (macOS file system events, process execution logs) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS endpoints for file creation or modification events in '/etc/emond.d/rules/' and '/private/var/db/emondClients'. Identify rules that trigger on system startup or user authentication events. Investigate the contents of newly created or modified plist files for execution actions. Baseline typical file activity in these directories and use time series analysis to detect anomalies."
          },
          "Execution of unexpected processes or commands initiated by the Emond service (sbin/emond).": {
            "Data": "Required data (macOS process execution logs) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS endpoints for processes spawned directly by 'sbin/emond'. Create a baseline of expected child processes. Use process monitoring logs to identify execution of unusual or malicious commands by Emond. Analyze command line arguments and target paths for suspicious activity. Correlate process execution with Emond rule file modifications."
          },
          "Logging indicating attempted unauthorized file modification or creation events in Emond rule/queue directories that deviate from baseline activity.": {
            "Data": "Required data (macOS file system events) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor endpoint logs for file system events targeting '/etc/emond.d/rules/' or '/private/var/db/emondClients'. Identify creation, modification, or deletion events by unexpected users or processes. Baseline typical file activity using frequency analysis and identify deviations by analyzing percentiles or IQR."
          },
          "Logging indicating suspicious process execution attempts initiated by the main Emond executable (sbin/emond) at times outside of normal system maintenance.": {
            "Data": "Required data (macOS process execution logs) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor endpoint process execution logs for child processes spawned by 'sbin/emond'. Identify processes with suspicious command lines or targeting sensitive system paths. Use time series analysis on process creation timestamps to detect execution outside normal system activity windows or during periods of user inactivity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to escalate privileges via the Emond service? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.014 - Emond": {
          "Emond rule files attempting to execute commands with root privileges that perform sensitive system modifications or access protected resources.": {
            "Data": "Required data (macOS file system events, process execution logs, configuration file content) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Emond rule files for actions that execute system commands (e.g., 'RunCommand') with root privileges. Examine the commands being executed for suspicious operations like modifying system binaries, accessing sensitive data paths, or creating new privileged accounts. Use correlation analysis to link rule content to observed process execution."
          },
          "Successful execution of privileged commands by processes parented by 'sbin/emond' that deviate significantly from normal system behavior.": {
            "Data": "Required data (macOS process execution logs, command monitoring) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS endpoint process execution for commands run by 'sbin/emond' with elevated privileges. Baseline typical commands executed by Emond (if any) and flag rare or previously unseen commands using frequency analysis. Analyze command arguments and targeted files/directories for indicators of privilege escalation attempts, such as modifying '/etc/sudoers' or installing Launch Daemons/Agents."
          },
          "Logging indicating the content of newly created or modified Emond rule files containing 'RunCommand' actions targeting sensitive files or executing known malicious commands.": {
            "Data": "Required data (macOS file content logging) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze logs capturing the content of files created/modified in '/etc/emond.d/rules/'. Search for 'RunCommand' keys within plist structures. Use string matching or pattern analysis to identify commands that modify system configuration files, escalate privileges (e.g., `sudo`), or execute known malicious binaries."
          },
          "Logging indicating successful execution of commands with root privileges that were potentially initiated by Emond and result in the creation of new persistence mechanisms or accounts.": {
            "Data": "Required data (macOS privileged process execution logging, audit logs) is not available from specified sources (Windows Event IDs, Zeek logs).",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor endpoint logs for processes running with root privileges that are not part of normal system operation and are potentially linked to Emond execution times. Identify follow-on actions such as the creation of new users (e.g., by analyzing user creation events), installation of new Launch Daemons/Agents (file system events in relevant directories), or modification of authentication configurations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]