[
  {
    "Is the adversary maintaining persistence using modified network device firmware? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.004 - ROMMONkit": {
          "Suspicious network traffic patterns (e.g., TFTP transfers) originating from internal sources to network devices at unusual times or with unusual sizes, potentially indicating firmware modification attempts.": {
            "Data": "Zeek conn.log, Zeek tftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, tftp.log) for outbound connections to network devices on ports used for firmware updates (e.g., TFTP 69). Analyze timing and data volume using time series analysis or anomaly detection to identify transfers outside of scheduled maintenance windows or of unexpected size."
          },
          "Unscheduled or frequent network device restarts or configuration changes without corresponding administrative tickets, potentially related to firmware updates or activation of modified firmware.": {
            "Data": "Network Device Syslogs, Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze network device syslog data for unexpected reboot events or configuration change notifications. Correlate events with change management records to identify unauthorized actions. Use frequency analysis to spot unusually high numbers of restarts or config changes."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using modified network device firmware? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542.004 - ROMMONkit": {
          "Lack of standard logging or monitoring data indicating firmware integrity, requiring vendor-specific diagnostics to identify potential ROMMON modification.": {
            "Data": "N/A (Indicates absence of specific log data)",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Recognize that standard host and network logs may not contain direct evidence of ROMMON modification. Initiate vendor-specific diagnostics or contact vendor support if other indicators suggest potential device compromise."
          },
          "Observed network device behavior that deviates significantly from baseline (e.g., unusual routing, dropped packets for specific traffic types, altered logging behavior) suggesting potential firmware tampering for defense evasion.": {
            "Data": "Zeek conn.log, Zeek dns.log, Zeek http.log, Network Device Syslogs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline network device behavior metrics from Zeek logs (conn.log, dns.log, http.log) and device syslogs (e.g., traffic volume by port/protocol, DNS query patterns, successful connection rates). Use anomaly detection techniques (e.g., clustering, statistical thresholds) on time-series data to identify significant deviations indicative of potentially malicious manipulation."
          }
        }
      }
    }
  }
]