[
  {
    "Is the adversary maintaining persistence using modified network device firmware? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.004 - ROMMONkit": {
          "Suspicious network traffic patterns (e.g., TFTP transfers) originating from internal sources to network devices at unusual times or with unusual sizes, potentially indicating firmware modification attempts.": {
            "Data": "Zeek conn.log; Zeek tftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, tftp.log) for outbound connections to network devices on ports used for firmware updates (e.g., TFTP 69). Analyze timing and data volume using time series analysis or anomaly detection to identify transfers outside of scheduled maintenance windows or of unexpected size."
          },
          "Unscheduled or frequent network device restarts or configuration changes without corresponding administrative tickets, potentially related to firmware updates or activation of modified firmware.": {
            "Data": "Network Device Syslogs; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze network device syslog data for unexpected reboot events or configuration change notifications. Correlate events with change management records to identify unauthorized actions. Use frequency analysis to spot unusually high numbers of restarts or config changes."
          },
          "Successful TFTP transfers to network devices involving unusual file names, sizes, or from unauthorized internal hosts, potentially indicating a staged or uploaded malicious ROMMON image.": {
            "Data": "Zeek tftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek tftp.log for transfers with network devices as destinations. Filter for unusual filenames (not matching standard vendor firmware update names), unexpected file sizes (compared to known ROMMON image sizes), or source IPs not authorized to perform firmware updates. Use frequency analysis on source IPs and filenames to identify rare occurrences."
          },
          "Detection of unexpected or unusual network connections originating from a network device immediately after a reboot, potentially initiated by a malicious ROMMON image.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from network devices. Correlate connections with network device reboot events (from syslogs, if available). Use correlation analysis to identify connections occurring shortly after reboots that are not part of standard device boot-up procedures (e.g., NTP, DNS, syslog). Flag connections to unusual external IPs or non-standard ports."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using modified network device firmware? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542.004 - ROMMONkit": {
          "Lack of standard logging or monitoring data indicating firmware integrity, requiring vendor-specific diagnostics to identify potential ROMMON modification.": {
            "Data": "N/A (Indicates absence of specific log data)",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Recognize that standard host and network logs may not contain direct evidence of ROMMON modification. Initiate vendor-specific diagnostics or contact vendor support if other indicators suggest potential device compromise."
          },
          "Observed network device behavior that deviates significantly from baseline (e.g., unusual routing, dropped packets for specific traffic types, altered logging behavior) suggesting potential firmware tampering for defense evasion.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Network Device Syslogs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline network device behavior metrics from Zeek logs (conn.log, dns.log, http.log) and device syslogs (e.g., traffic volume by port/protocol, DNS query patterns, successful connection rates). Use anomaly detection techniques (e.g., clustering, statistical thresholds) on time-series data to identify significant deviations indicative of potentially malicious manipulation."
          },
          "Absence or significant reduction in expected outbound network connections from a device for standard services (e.g., syslog, NTP, DNS) following a suspected compromise event or reboot, indicating potential malicious modification of device behavior.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline connection patterns for network devices in Zeek conn.log, specifically for standard outbound services like syslog, NTP, DNS. Use time series analysis on connection counts for these services per device. Detect significant drops or prolonged absence of these standard connections following device reboots or suspected adversary activity, which could indicate modified firmware suppressing expected behavior."
          },
          "Observed network traffic flow patterns that deviate significantly from the established baseline passing through the device, suggesting potential malicious rerouting or filtering by modified firmware.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline network traffic volume, source/destination pairs, and protocol distribution traversing critical network devices using Zeek conn.log. Use correlation analysis, flow analytics, or clustering techniques on time-series data to identify significant and persistent deviations from the baseline flow patterns (e.g., sudden rerouting of traffic, unexpected filtering, altered volume between segments) that cannot be explained by legitimate configuration changes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]