[
  {
    "Is the adversary using Launch Daemons for persistence? (TA0003 - Persistence)": {
      "Indicators": {
        "T1543.004 - Launch Daemon": {
          "Creation or modification of new or existing plist files in /Library/LaunchDaemons/.": {
            "Data": "macOS File System Events",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for file creation/modification events in /Library/LaunchDaemons/. Analyze file properties (creation time, size, content). Calculate frequency of file changes in this directory over time and flag deviations using time series analysis. Examine plist content for suspicious Program or ProgramArguments pointing to unexpected locations or unsigned binaries."
          },
          "Execution of unsigned or unusual executables launched via Launch Daemons.": {
            "Data": "macOS Process Creation Events, macOS Unified Logging",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events where the parent process is launchd and the executable path is listed in a Launch Daemon plist. Check executable code signing status. Correlate process launches with suspicious plist file activity. Identify processes launched from /Library/LaunchDaemons/ that are not part of known legitimate software or have unusual network connections (cross-referencing with network logs)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary achieved privilege escalation via Launch Daemons? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1543.004 - Launch Daemon": {
          "Execution of a process from /Library/LaunchDaemons/ with elevated privileges performing suspicious actions (e.g., modifying system files, creating privileged accounts).": {
            "Data": "macOS Process Execution Logs, macOS Audit Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor processes launched by launchd from user-writeable Launch Daemon locations (/Library/LaunchDaemons/) that subsequently perform privileged operations (e.g., modifications to /etc, user additions, loading kernel extensions). Use correlation analysis to link the process launch event to subsequent suspicious system calls or file modifications."
          },
          "Discovery of Launch Daemon plists configured to run malicious or unsigned code with RunAtLoad=true.": {
            "Data": "macOS File System Content, Configuration Audit Results",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Periodically audit or monitor for changes to Launch Daemon plist files in /Library/LaunchDaemons/. Parse plist files to identify RunAtLoad=true configurations. For such configurations, examine the Program or ProgramArguments paths. Flag plists pointing to non-standard locations or executables that are unsigned or do not match expected hashes. Compare current configurations to known good baselines using diff analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]