[
  {
    "Is the adversary maintaining persistence using modified Security Support Providers? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.005 - Security Support Provider": {
          "Modification of Windows Registry keys associated with Security Support Providers (Lsa\\Security Packages or Lsa\\OSConfig\\Security Packages).": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to Registry keys HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Security Packages and HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\OSConfig\\Security Packages. Alert on any changes to these keys, especially additions or modifications of DLL paths. Use correlation analysis to identify changes originating from unusual processes or users."
          },
          "Suspicious DLL loaded into the Local Security Authority Subsystem Service (LSASS) process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of the LSASS.exe process. While standard events don't log DLL loads directly, use descriptive statistics (e.g., count of LSASS process starts/stops, timing) to identify deviations from baseline behavior. Investigate any unusual LSASS process activity or parent/child relationships."
          },
          "Outbound network connections originating from the LSASS process shortly after system boot or LSASS activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with system boot events (e.g., Windows Event ID 1102, 6005/6006) or LSASS restarts to identify unexpected outbound connections originating from the LSASS process ID (PID) shortly after these events. Flag connections to external or unusual internal destinations. Use time series analysis to detect recurring connections from LSASS on specific hosts."
          },
          "Execution of processes or commands commonly associated with credential dumping shortly after system boot or LSASS process activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events occurring shortly after system boot (within 5-10 minutes). Identify and flag execution of known credential dumping tools or commands (e.g., `mimikatz`, accessing specific registry hives like SYSTEM or SAM) running with high privileges or from unusual locations. Use correlation analysis to link these processes to system boot events and identify patterns across multiple hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation by abusing Security Support Providers? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.005 - Security Support Provider": {
          "Modification of Windows Registry keys associated with Security Support Providers (Lsa\\Security Packages or Lsa\\OSConfig\\Security Packages).": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to Registry keys HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Security Packages and HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\OSConfig\\Security Packages. Alert on any changes to these keys, especially additions or modifications of DLL paths. Use correlation analysis to identify changes originating from unusual processes or users, particularly on target systems for privilege escalation (e.g., domain controllers, critical servers)."
          },
          "Suspicious DLL loaded into the Local Security Authority Subsystem Service (LSASS) process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of the LSASS.exe process. While standard events don't log DLL loads directly, focus on process activity on potential escalation targets. Use descriptive statistics to identify deviations from baseline LSASS behavior. Investigate any unusual LSASS process activity or parent/child relationships, prioritizing critical assets."
          },
          "Outbound network connections originating from the LSASS process shortly after system boot or LSASS activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with system boot events to identify unexpected outbound connections originating from the LSASS process ID (PID) shortly after boot. Flag connections to external destinations, particularly on critical servers (e.g., domain controllers) where credential dumping could occur. Use time series analysis to detect recurring connections from LSASS on these high-value targets."
          },
          "Execution of processes or commands commonly associated with credential dumping shortly after system boot or LSASS process activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events occurring shortly after system boot (within 5-10 minutes). Identify and flag execution of known credential dumping tools or commands (e.g., `mimikatz`, accessing specific registry hives like SYSTEM or SAM) running with high privileges or from unusual locations. Prioritize investigation on server OS endpoints and systems holding valuable credentials, as these are primary targets for privilege escalation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]