[
  {
    "Is the adversary maintaining persistence using TFTP boot on network devices? (TA0003 - Persistence)": {
      "Indicators": {
        "T1542.005 - TFTP Boot": {
          "Unauthorized changes detected in network device startup configuration (boot sequence, TFTP server setting).": {
            "Data": "Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for transfer of known network device configuration file names via TFTP (port 69). Identify transfers to or from unexpected source/destination IPs or devices. Analyze file transfer frequency using descriptive statistics to identify rare events or deviations from baseline."
          },
          "Unusual or unexpected TFTP connection activity originating from/to network devices.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections using TFTP (port 69) involving network devices. Identify connections to/from unexpected source/destination IPs or ports. Analyze connection volume and duration using descriptive statistics and identify outliers (e.g., using IQR or percentile analysis) for connections outside baseline patterns."
          },
          "Transfer of uncommon or suspicious file types via TFTP to/from network devices.": {
            "Data": "Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for file transfers using TFTP (port 69) involving network devices. Analyze file extensions or identify file types based on content (e.g., using file magic bytes if available) for types not typically associated with network device configurations or boot images (e.g., executables, scripts, compressed files). Use frequency analysis on file extensions or types transferred via TFTP to identify rare instances."
          },
          "TFTP connection attempts from network devices to external or unauthorized internal IP addresses.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound TFTP connections (port 69) originating from network devices. Compare destination IP addresses against a list of authorized internal TFTP servers. Flag connections to external IPs or unauthorized internal IPs. Use correlation analysis to link these connections to specific network devices and identify patterns over time."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using TFTP boot on network devices? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1542.005 - TFTP Boot": {
          "Network device running an unauthorized or modified system image.": {
            "Data": "Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for transfer of large files (potential OS images) via TFTP (port 69) to network devices. Analyze file transfer size, frequency, and compare against known device image file sizes/transfer patterns to identify anomalies using descriptive statistics (e.g., median file size, transfer volume per device) and compare against historical data."
          },
          "Network device boot information (image booted, startup config used) is inconsistent with expected state.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for TFTP traffic (port 69) to network devices immediately preceding or following device reboots. Correlate unusual TFTP activity with device uptime/reboot events observed through other means. Use time series analysis on TFTP traffic volume per device to identify unusual spikes potentially related to unauthorized boot processes."
          },
          "Sudden or unexpected changes in network device behavior (e.g., new connections, unusual protocols) following TFTP boot activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network devices involved in TFTP boot activity (from Zeek conn.log/file.log). Monitor Zeek conn.log for subsequent network connections originating from these devices. Compare post-boot connection patterns (protocols, destination IPs, volume) against historical baselines for that device using descriptive statistics and time series analysis. Flag deviations that suggest a change in device function or compromise."
          },
          "TFTP connection attempts or successful connections originating from external IP addresses to network devices.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for inbound TFTP connections (port 69) targeting network devices from external or unauthorized internal IP addresses. Use frequency analysis on source IPs and connection times to identify infrequent or suspicious sources. Correlate with threat intelligence feeds to identify connections from known malicious IPs. Investigate all successful connections from unauthorized IPs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]