[
  {
    "Is the adversary establishing persistence via Netsh Helper DLL? (TA0003 - Persistence)": {
      "Indicators": {
        "T1546.007 - Netsh Helper DLL": {
          "Detection of unusual child processes spawned by netsh.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where 'ParentProcessName' is 'netsh.exe'. Identify child processes and their command lines. Use frequency analysis or outlier detection to flag child processes that rarely or never occur in the environment under normal circumstances."
          },
          "Suspicious modifications to the HKLM\\SOFTWARE\\Microsoft\\Netsh registry key.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for 'ObjectName' matching 'HKLM\\\\SOFTWARE\\\\Microsoft\\\\Netsh'. Baseline common modifications or additions by known software installers. Flag changes that add new DLL paths, especially to unusual locations, or changes not associated with known system updates or software installs."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges via Netsh Helper DLL? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1546.007 - Netsh Helper DLL": {
          "Execution of system utilities or commands with elevated privileges as a child process of netsh.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs where netsh.exe is the parent. Examine child process command lines for execution of administrative tools (e.g., PowerShell, cmd, net) with commands indicative of privilege escalation (e.g., modifying services, creating users, accessing restricted files). Correlate with process integrity levels."
          },
          "Addition of new, untrusted helper DLL paths to HKLM\\SOFTWARE\\Microsoft\\Netsh.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4657 events targeting 'HKLM\\\\SOFTWARE\\\\Microsoft\\\\Netsh'. Extract the 'NewValue' data. Compare the added DLL path against a list of known legitimate helper DLLs. Flag additions that point to unusual or temporary directories, or to DLLs with unknown file hashes. Use correlation analysis to link registry modifications to specific parent processes (if available) or user sessions."
          }
        }
      }
    }
  }
]