[
  {
    "Is the adversary maintaining persistence using Windows Time Providers? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.003 - Time Providers": {
          "Unauthorized modification or creation of registry keys under HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Registry Value Set) on endpoints and servers. Filter events where the Object Name path is under `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\`. Investigate events with unusual callers (processes, users) or those targeting keys/values outside the standard configuration."
          },
          "Registration of a new, unusual, or unrecognized DLL name in the DllName value of a Time Provider registry key.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to the `DllName` value under `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\`. Analyze the DLL path and file name. Cross-reference the DLL hash/name with known legitimate system files and threat intelligence. Use frequency analysis to identify rare or newly registered DLLs."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation by abusing Windows Time Providers? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.003 - Time Providers": {
          "Failed attempts to modify or create registry keys under HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\ by non-privileged users or processes.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4663",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (failure audits) or 4663 (access attempts denied) on endpoints and servers. Filter events targeting paths under `HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\W32Time\\TimeProviders\\`. Investigate failed attempts by non-SYSTEM users or unusual processes. Use correlation analysis to link failed registry attempts to other suspicious activity."
          },
          "Execution of the W32Time service process with parameters or in a context indicative of using a modified time provider.": {
            "Data": "Windows Event ID 4688, Windows Event ID 7036",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for instances of `w32time.exe`. Correlate these events with detected registry modifications (Evidence 1 & 2 under the Persistence PIR) or unusual service start events (Event ID 7036 for W32Time). Analyze parent processes and command line arguments (if available/logged) for anomalies. Use time series analysis to detect service restarts or executions at unusual times."
          }
        }
      }
    }
  }
]