```json
[
  {
    "Is the adversary maintaining persistence using Registry Run Keys or Startup Folder items? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.001 - Registry Run Keys - Startup Folder": {
          "A file, shortcut, or registry value added to a startup location matches a known malicious hash, filename, or command-line signature from threat intelligence.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation in Startup folders (Windows Event ID 4663) and registry value modifications in Run keys (Windows Event ID 4657). Extract file hashes and registry value data (command lines). Correlate this data with process creation events (Windows Event ID 4688) originating from these locations. Compare file hashes, suspicious filenames, and command-line strings against a continuously updated CTI feed of known malware artifacts associated with persistence. Alert on any matches."
          },
          "Addition of a startup item that uses suspicious command-line patterns, such as invoking scripting engines with encoded commands, living-off-the-land binaries (LOLBAS), or pointing to executables in atypical directories (e.g., Temp, Public).": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the command-line arguments of processes started from Run keys or Startup folders (Windows Event ID 4688) and the values set in Run keys (Windows Event ID 4657). Use regular expression matching to detect common malicious patterns, such as 'powershell -enc', 'cscript', 'mshta.exe', or the use of LOLBAS (e.g., certutil.exe, bitsadmin.exe). Flag command lines that point to executables located in unusual/writable directories like C:\\Users\\Public\\, C:\\Windows\\Temp\\, or AppData subdirectories not associated with legitimate applications."
          },
          "A process executed from a Registry Run key or Startup Folder is statistically rare or new to the environment, especially if it initiates outbound network connections shortly after execution.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect all process command lines from startup locations using Windows Event ID 4688. Establish a baseline of common startup processes across the environment. Use frequency analysis and descriptive statistics (e.g., calculating percentile ranks) to identify rare or unique command lines. For any flagged rare process, correlate its execution time with Zeek conn.log to check for subsequent network activity within minutes. Use correlation analysis to link the process to any outbound connections, particularly to new or low-reputation IP addresses."
          },
          "Modification of a pre-existing, legitimate startup entry to point to a different payload, or insecure modification of permissions on startup folders or registry keys.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4670",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of known-good registry run key values and startup shortcut targets. Monitor for modifications (Windows Event ID 4657) to these known-good entries. Alert when a legitimate entry's value is changed to an unknown or suspicious path/command. Additionally, monitor for permission changes (Windows Event ID 4670) on startup folders and registry keys that grant write access to non-privileged users or groups, as this is a precursor to hijacking."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting to elevate privileges using Registry Run Keys or Startup Folder items? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1547.001 - Registry Run Keys - Startup Folder": {
          "A file written to a system-wide startup location (HKLM Run keys, All Users Startup folder) by a standard user account matches a known malicious hash or signature.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for write events (Windows Event ID 4657 for registry, 4663 for files) to HKLM Run keys or the All Users startup folder (`C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp`). Filter these events to identify those performed by a non-administrative or non-SYSTEM user account. For any such write event, hash the resulting file or registry value and compare it against a CTI feed of known malware. An alert indicates a potential privilege escalation attempt using a known malicious payload."
          },
          "A standard user account adds a startup item to a system-wide location that uses known malicious execution patterns, such as invoking a scripting engine to download and run a remote payload.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor write events (Windows Event ID 4657, 4663) to system-wide startup locations (HKLM Run keys, All Users Startup folder). Analyze the written data for patterns commonly used in privilege escalation, such as command lines invoking scripting engines (`powershell.exe`, `cscript.exe`, `mshta.exe`) with arguments to download or execute remote scripts. Flag any instance where a non-administrative user account writes such a patterned command to a location that will be executed with system or another user's privileges."
          },
          "A file or registry key is written to a startup location by one user, and the resulting process is subsequently executed under the context of a different, higher-privileged user account upon their login.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657; Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Statefully correlate write events to startup locations (Windows Event ID 4663, 4657) with subsequent process creation events (Windows Event ID 4688) originating from those locations after a new user logon (Windows Event ID 4624). Extract the user context from both events ('SubjectUserName' from the write event, user context from the process creation). Trigger an alert where the user who wrote the file/key is different from the user who executed it, particularly when the executing user has higher privileges (e.g., standard user writes, administrator executes). Use linear regression or correlation analysis to link write events to execution events across different user sessions."
          },
          "The HKLM\\System\\CurrentControlSet\\Control\\Session Manager\\BootExecute registry value is modified to include additional executables beyond the standard 'autocheck autochk *'.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a strict baseline for the `BootExecute` registry value, which should normally only contain 'autocheck autochk *'. Monitor for any modification to this specific key using Windows Event ID 4657. Alert on any change that adds or replaces entries. Correlate the modification event with the responsible process. Further investigate by analyzing early boot process creation logs (Windows Event ID 4688) to confirm the execution of the unauthorized payload during startup, which runs with SYSTEM privileges."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```