[
  {
    "Is the adversary maintaining persistence via Active Setup? (TA0003 - Persistence)": {
      "Indicators": {
        "T1547.014 - Active Setup": {
          "Creation or modification of suspicious Registry keys within the Active Setup hive (HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656, 4657, and 4663 filtering for object names/paths under HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\. Alert on any creation, deletion, or modification operations in this path, especially focusing on the 'StubPath' value. Baseline normal modifications using frequency analysis and flag deviations."
          },
          "Execution of unusual or unrecognized programs triggered by user login via Active Setup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events where the process creation is triggered by a user login and appears to originate from an 'Active Setup' context (requires correlating events/understanding execution flow). Identify processes with unusual names, command lines, or execution directories. Use frequency analysis on process names and paths launched via login events to identify rare occurrences."
          },
          "Execution of a program from Active Setup with suspicious characteristics (e.g., unusual file path, known malicious hash, lack of digital signature).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events where process creation is linked to user login and potentially Active Setup execution context. For these processes, inspect the full command line and file path. Correlate process hashes (if available from other collection, e.g. Sysmon, otherwise focus on path/command line) with threat intelligence feeds. Flag executables in unusual directories (e.g., Temp folders, user profile folders) or with suspicious names that attempt masquerading (e.g., names similar to legitimate system processes but in wrong paths). Assess presence/absence of digital signatures where possible."
          },
          "Detection of a new or statistically rare executable being launched via Active Setup context upon user login across the environment.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs on user login events across all endpoints and servers. Identify processes launched from a likely Active Setup context. Establish a baseline of common processes launched during user login using frequency analysis or clustering of process names and paths. Identify outliers (new processes, processes with significantly lower frequency) using statistical methods like IQR or percentiles and flag for investigation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges via Active Setup? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1547.014 - Active Setup": {
          "Creation or modification of Active Setup Registry keys attempting to execute code with elevated privileges or impersonating legitimate system components.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656, 4657, and 4663 filtering for object names/paths under HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\. Focus on 'StubPath' values that point to system directories (like System32) or known locations used by adversaries for privilege escalation. Use string analysis on StubPath values to identify suspicious patterns or known malicious filenames associated with escalation tools. Correlate with user account information to identify if the change was made by a potentially compromised low-privilege account."
          },
          "Detection of outlier processes originating from 'Active Setup' execution context upon user login, particularly those exhibiting elevated permissions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs from all endpoints and servers. Identify processes created shortly after user login where the parent process or context suggests Active Setup execution. Perform statistical analysis (e.g., descriptive statistics, outlier detection using IQR) on the process names, command line arguments, parent processes, and execution paths of processes launched during login compared to historical baselines. Flag processes that are statistically rare or not seen before, correlating with process integrity levels (if available/enrichable) to identify potential privilege escalation."
          },
          "Active Setup 'StubPath' Registry value pointing to a location or executable associated with known privilege escalation techniques or tools.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\*` specifically targeting the 'StubPath' value. Implement detection rules for StubPath values containing paths to sensitive system directories (e.g., `C:\\Windows\\System32`, `C:\\Windows\\SysWOW64`) when paired with suspicious or known malicious filenames, or paths pointing to scripting interpreters (e.g., `powershell.exe`, `cmd.exe`) with command arguments matching known privilege escalation methods or UAC bypass techniques. Use string matching and pattern analysis."
          },
          "A process launched via Active Setup context upon user login includes command line arguments or execution context indicative of privilege escalation attempts or UAC bypass.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 events linked to user login and potential Active Setup execution. Use correlation analysis to identify if the launched process's parent is a known system process associated with login/Active Setup. Analyze the child process's command line for suspicious arguments (e.g., `/c`, `/k`, base64 encoded commands, references to UAC bypass tools, or standard administrative commands not expected at login from this context). Calculate the frequency and statistical distribution of command line argument patterns to detect rare or anomalous usage indicative of escalation attempts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]