[
  {
    "Is the adversary bypassing host defenses using Mark-of-the-Web bypass techniques? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1553.005 - Mark-of-the-Web Bypass": {
          "Download of common container file types (e.g., .iso, .vhd, .arj, .gzip) from external sources.": {
            "Data": "Zeek http.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for file downloads with extensions .iso, .vhd, .arj, .gzip originating from external source IPs. Use frequency analysis to identify rare download types or sources. Correlate download events with subsequent host activity (e.g., mounting, extraction)."
          },
          "Execution of executable files or scripts originating from recently mounted disk images (.iso, .vhd) or extracted archives (.arj, .gzip).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Process Creation events (Windows Event ID 4688). Identify parent-child process relationships where the parent is associated with mounting/extraction utilities (e.g., explorer.exe -> mount operations, winrar.exe -> execution) and the command line indicates execution from a temporary mount point or extraction directory. Analyze execution patterns and command lines using descriptive statistics."
          },
          "Process execution associated with mounting disk images or extracting archives shortly after the container file was downloaded from an external source.": {
            "Data": "Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek http.log downloads of .iso, .vhd, .arj, .gzip from external IPs with Windows Event ID 4688 on the same host within a short timeframe (e.g., <5 minutes). Look for specific command-line arguments in 4688 indicating mounting (e.g., 'Mount-DiskImage', drive letter assignment) or extraction utilities (e.g., 'winrar.exe x', '7z.exe e'). Calculate the time difference between download and execution events and flag events with unusually short durations using percentile analysis."
          },
          "Execution of programs or scripts originating from temporary virtual disk mount points or archive extraction directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Extract the full path of the executable. Identify executions where the path corresponds to known temporary directories or virtual drive mount points (e.g., standard temp paths, typical mount letters). Use frequency analysis or statistical profiling of processes normally running from these locations. Flag executions of unusual processes or from unusual paths within these temporary locations that deviate significantly from the baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]