[
  {
    "Is the adversary executing commands or payloads using Dynamic Data Exchange (DDE)? (TA0002 - Execution)": {
      "Indicators": {
        "T1559.002 - Dynamic Data Exchange": {
          "Microsoft Office applications spawning unusual child processes (e.g., cmd.exe, powershell.exe) or loading unexpected DLLs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creation events where the parent process is a Microsoft Office application (WINWORD.EXE, EXCEL.EXE, POWERPNT.EXE, etc.) and the child process is unusual (e.g., CMD.EXE, POWERSHELL.EXE, RUNDLL32.EXE). Use statistical analysis (e.g., frequency analysis) to identify rare or never-before-seen child processes spawned by Office applications across the network. Investigate all flagged process creations."
          },
          "Activity indicating the processing (e.g., opening, transferring) of documents or files potentially containing DDE execution commands.": {
            "Data": "Zeek file.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek file.log for the transfer of common document types (docx, xlsx, pptx, csv, rtf) via HTTP, SMB, or email protocols (if available). Analyze file transfer volumes and destinations. Correlate file transfers with subsequent unusual process creation events (Windows Event ID 4688) on the destination host, specifically looking for Office applications opening files and then spawning unusual child processes, using correlation analysis."
          },
          "Files containing suspected DDE command strings ('DDEAUTO', 'DDE', '=cmd|', etc.) identified during network transfer.": {
            "Data": "Zeek file.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure Zeek's file analysis framework to perform keyword searches for DDE-related strings ('DDEAUTO', 'DDE', '=cmd|', '=powershell|', '=mshta|', etc.) within transferred documents (e.g., docx, xlsx, csv, rtf) recorded in `file.log`. Alert on files identified containing these strings. Use frequency analysis on source IPs, destination IPs, and file names to identify common sources or widely distributed malicious files. Implement alerts based on thresholds or specific string matches."
          },
          "Outbound network connections originating from Microsoft Office processes to unusual destinations or non-standard ports.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 (if configured) for outbound network connections where the originating process is a Microsoft Office application (WINWORD.EXE, EXCEL.EXE, etc.). Filter connections by destination IP (external/internal), port, and host. Use statistical profiling (e.g., frequency, clustering) to establish normal network communication patterns for Office applications and flag connections to rare destinations, non-standard ports, or those occurring outside typical work hours. Correlate flagged connections with file opening events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]