[
  {
    "Is the adversary accessing credentials stored in password managers? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1555.005 - Password Managers": {
          "Suspicious process activity or process access potentially targeting password manager memory or processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation on endpoints. Identify suspicious child processes spawned by known password manager processes or processes attempting to access password manager executables. Use correlation analysis to link password manager process activity with suspicious tool execution patterns."
          },
          "Unauthorized attempts to access or read password manager database files.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file access attempts on endpoints, specifically targeting known password manager database file extensions. Analyze access types (read) and user accounts involved. Use time series analysis to detect unusual spikes in read operations on these sensitive files."
          },
          "Execution of known process memory dumping tools targeting password manager processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints for the creation of processes with names like `procdump.exe` or other common memory dumping tools. Analyze the command line arguments (if captured) to see if known password manager process names (e.g., `KeePass.exe`, `1Password.exe`) are targeted. Use correlation analysis to identify instances where a password manager process is running shortly before or during the execution of a dumping tool."
          },
          "Unusual high volume of network connections or data transfer associated with a password manager process.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "On endpoints, monitor Windows Event ID 5156 for outbound network connections initiated by known password manager processes. In Zeek conn.log, identify connections to/from internal hosts running password managers, focusing on external destinations. Use time series analysis and descriptive statistics (e.g., calculating bytes transferred, connection count per time unit) to identify unusual spikes or sustained high volumes of network activity associated with these processes compared to established baselines. Investigate connections to suspicious or unknown external IP addresses/domains."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]