[
  {
    "Is the adversary maintaining persistence via modified network device authentication? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.004 - Network Device Authentication": {
          "Repeated successful authentication to network devices via unusual methods or protocols not typically used.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log, telnet.log, or conn.log for connections to network device administration ports. Identify sessions using unusual or unapproved protocols. Use descriptive statistics to baseline protocol usage to these ports and flag outliers using frequency analysis."
          },
          "Successful logins to network devices from unexpected source IP addresses or during unusual time periods, potentially bypassing multi-factor authentication or standard access controls.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log, telnet.log, or conn.log for successful connections to network devices. Identify source IP addresses and connection timestamps. Identify rare source IPs by frequency analysis or percentiles. Use time series analysis to detect successful logins outside normal business hours or during unexpected intervals."
          },
          "Network traffic patterns consistent with network device re-imaging or configuration updates occurring at unusual times or involving unusual source/destination IPs.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek tftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, ftp.log, tftp.log) for connections to or from network devices on ports/protocols used for image transfer or configuration (e.g., TFTP 69/UDP, SCP 22/TCP, HTTP/S 80/443 for image downloads). Use time series analysis to detect activity outside maintenance windows or during unexpected hours. Identify unusual source or destination IPs using frequency analysis or correlation analysis with known management IPs."
          },
          "Successful connections to network devices on administrative ports that do not correlate with expected authentication logs or correlate with anomalous login attempts (e.g., multiple failures followed by a non-logged success).": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful network connections to administrative ports (Zeek conn.log, dst_port 22, 23, etc.) with successful authentication events logged in Zeek ssh.log or telnet.log. Flag successful connections where no corresponding authentication success log exists within a short time window (e.g., 60 seconds). Also, identify source IPs with numerous failed authentication attempts (ssh.log, telnet.log auth_success=false) that are immediately followed by a successful connection (conn.log) but lack a successful authentication log (ssh.log, telnet.log auth_success=true). Use correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses through network device authentication modifications? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.004 - Network Device Authentication": {
          "Connections to network device administrative ports from hosts that previously had multiple failed authentication attempts.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts making multiple failed authentication attempts (Zeek ssh.log, telnet.log) to network devices. Correlate these with subsequent successful connections from the same source IP using a different method or immediately after the failures (Zeek conn.log). Use correlation analysis to link failed attempts and unexpected successes."
          },
          "Connections to network device administration interfaces (SSH, Telnet, etc.) from internal hosts that bypass standard bastion host or access list restrictions.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log, telnet.log, or conn.log for connections to network device administration ports originating from internal hosts. Compare source IPs against expected administration hosts or subnets listed in access control lists (ACLs). Use frequency analysis of source IPs connecting to admin ports to identify unusual sources."
          },
          "Connections to network device administrative ports from source IPs that should be blocked by network access control lists (ACLs).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to network device administrative ports (e.g., 22, 23, 80, 443, specific vendor ports) originating from IP addresses or subnets that are explicitly listed in network access control lists (ACLs) as denied or restricted for these ports/destinations. Compare source IPs against defined ACLs using correlation analysis to identify traffic that should have been blocked."
          },
          "Unusual network traffic originating from network devices immediately following an authenticated session on administrative ports.": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful authenticated sessions to network devices (from Zeek ssh.log, telnet.log, or inferred from conn.log for admin ports) with new or unusual outbound connections originating from the network device itself, observed in Zeek conn.log. Use correlation analysis to link sessions to subsequent device outbound activity. Use frequency analysis and time series analysis to identify outbound connections that are rare or occur outside normal patterns for that device (e.g., device initiating connections to external IPs or unexpected internal IPs)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary accessing credentials or bypassing authentication on network devices? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.004 - Network Device Authentication": {
          "Authentication attempts to network devices using invalid credentials immediately followed by successful access using a different method or with no further authentication log.": {
            "Data": "Zeek ssh.log; Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log and telnet.log for authentication events. Identify sequences where failed authentication attempts from a source IP are immediately followed by a successful authentication from the same source IP, potentially using a different username or method, or where the successful authentication log looks anomalous (e.g., unexpected user). Correlate failure events (e.g., auth_success=false) with success events (auth_success=true) within a short time window."
          },
          "Suspiciously short session durations on network devices after successful authentication, followed by connections to other internal resources.": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ssh.log, or telnet.log for sessions to network devices administrative ports. Calculate session duration. Identify sessions with unusually short durations (e.g., using IQR or percentiles to find outliers). Correlate short sessions originating from network devices with subsequent connection activity to other internal hosts (visible in Zeek conn.log) using correlation analysis."
          },
          "Multiple failed authentication attempts to network devices using valid usernames, immediately followed by successful access from the same source IP but without a corresponding successful authentication log for that user.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify sequences in Zeek ssh.log or telnet.log where multiple failed authentication attempts (auth_success=false) occur from a source IP using known valid usernames. Correlate these failures with a subsequent successful connection (Zeek conn.log) from the same IP to the same device within a short time frame, where no successful authentication log (ssh.log/telnet.log auth_success=true) for the attempted usernames is recorded for that session. Use correlation analysis."
          },
          "Connections to network device administrative ports where authentication logs show only a single or very few failed attempts from a source IP followed by a successful connection, deviating from typical successful login patterns or brute force attempts.": {
            "Data": "Zeek ssh.log; Zeek telnet.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log and telnet.log to count consecutive failed authentication attempts from a source IP to a network device. Correlate these counts with successful connections (Zeek conn.log). Establish a baseline using descriptive statistics (e.g., median number of failures before a legitimate success, if logs are available) and flag successful connections that occur after an unusually low number of reported failures from a source IP, especially if this pattern is repeated across different devices or times. Compare this pattern to normal brute-force attempt patterns using statistical divergence measures."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]