
[
  {
    "Is the adversary attempting to gain credential access via DHCP spoofing? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1557.003 - DHCP Spoofing": {
          "DHCP offer from any server containing a known malicious IP address for a DNS server, WINS server, or default gateway.": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously parse Zeek dhcp.log for all DHCP Offer/ACK messages. Extract the assigned DNS server, WINS server, and default gateway IP addresses. Inner join these IPs with a high-confidence threat intelligence feed of known malicious infrastructure, updated daily. Alert on any match and identify the receiving client and offering server."
          },
          "Detection of DHCP Offer messages originating from an IP address or MAC address not on the authoritative list of approved DHCP servers for a given network segment.": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a static list of authorized DHCP server MAC and IP addresses for each network segment. Analyze Zeek dhcp.log to identify the source MAC ('server_mac') and IP ('server_ip') of all DHCP Offer/ACK messages. Generate an alert for any Offer/ACK originating from a source not on the authoritative list, indicating a rogue server."
          },
          "Anomalous race condition behavior on the network, where multiple, distinct DHCP servers respond to a single client's DISCOVER request, indicating a conflict between legitimate and rogue servers.": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each DHCP transaction ID ('trans_id') and client MAC address ('client_mac'), aggregate all corresponding DHCP Offer messages within a short time window (e.g., 2 seconds). Count the number of unique offering server IPs ('server_ip'). Use frequency analysis to flag any transaction that receives offers from more than one server, and investigate the parameters offered by the unauthorized server."
          },
          "A sudden and anomalous spike in DHCP-related error events on the legitimate DHCP server, such as IP address pool exhaustion, indicating a potential denial-of-service precursor to a spoofing attack.": {
            "Data": "Windows Event ID 1020; Windows Event ID 1063",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows DHCP server logs for critical events, specifically Event ID 1020 (Scope full) and 1063 (DHCP Service is low on available addresses). Establish a baseline for normal DHCP lease activity and error rates. Use time series analysis to detect statistically significant spikes in these events that deviate from the established norm, which may precede a rogue DHCP server becoming active."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting to collect data via DHCP spoofing? (TA0009 - Collection)": {
      "Indicators": {
        "T1557.003 - DHCP Spoofing": {
          "Network connections from a client to a known malicious IP address or C2 domain immediately following a DHCP lease event.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek dhcp.log events with subsequent network traffic from the client MAC/IP address. For a defined window (e.g., 5 minutes) after a client receives a DHCP ACK, analyze its outbound connections (Zeek conn.log) and DNS queries (Zeek dns.log). Join destination IPs and queried domains against threat intelligence feeds. Alert on any traffic from recently leased clients to known malicious endpoints."
          },
          "Detection of authentication credentials (e.g., NTLM hashes, cleartext passwords) in unencrypted network traffic destined for an unauthorized or suspicious server.": {
            "Data": "Zeek http.log; Zeek smb_cmd.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter network protocol logs for traffic destined to IPs identified as suspicious (e.g., a rogue gateway/DNS from other evidence). Scan Zeek http.log for 'Authorization' headers containing 'Basic' authentication. Monitor Zeek smb_cmd.log for NTLM authentication exchanges with non-domain controllers or unexpected servers. Use regular expressions to search for password patterns in FTP or other cleartext protocol logs. Alert on any potential credential exposure to unauthorized systems."
          },
          "A client's network traffic being redirected to an unusual intermediary IP address that is not the authorized default gateway for its network segment.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate default gateway IPs for all network segments. For each client, monitor its outbound connections in Zeek conn.log. Identify sessions where traffic is routed to an IP that is not the authorized gateway. Use correlation analysis to identify multiple clients on the same segment suddenly routing traffic through the same, new, unauthorized gateway IP. Calculate descriptive statistics on data volume to this rogue gateway to assess the scope of data collection."
          },
          "Anomalous DNS resolution patterns from a client after receiving a DHCP lease, such as a high rate of NXDOMAIN responses or queries for services the client does not typically use.": {
            "Data": "Zeek dns.log; Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate DHCP lease events (Zeek dhcp.log) with subsequent DNS activity (Zeek dns.log) from the client. Profile baseline DNS behavior for client types or subnets (e.g., typical query volume, NXDOMAIN rate, entropy of queried TLDs). Use time series analysis and entropy measures to detect significant deviations from this baseline after a new lease is acquired. A sudden spike in NXDOMAIN errors could indicate a malicious DNS server is selectively failing requests to force fallback to other name resolution protocols (e.g., LLMNR/NBT-NS) for interception."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
