[
  {
    "Is the adversary executing code using COM? (TA0002 - Execution)": {
      "Indicators": {
        "T1559.001 - Component Object Model": {
          "Suspicious process spawning via COM, especially when the invoking user differs from the logged-on user.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs for processes spawned by svchost.exe, explorer.exe, or other common COM hosting processes that launch unexpected child processes. Correlate with Windows Event ID 4624 (Successful Logon) to identify cases where the process spawning user differs significantly from the current interactive user. Use frequency analysis to identify rare parent-child process combinations."
          },
          "Suspicious command-line patterns indicative of COM object invocation leading to execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs for command-line arguments that indicate COM object instantiation followed by execution (e.g., specific CLSIDs or ProgIDs used with tools like rundll32.exe, powershell.exe, or wscript.exe that launch other binaries). Use correlation analysis to link these command lines to unusual child processes or network connections (Zeek conn.log)."
          },
          "Network connections indicative of DCOM or other remote COM activity to unusual destinations or by unusual accounts.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections on TCP port 135 and subsequent dynamic ports characteristic of DCOM. Identify source/destination IP pairs. Correlate source IPs/users with Windows Event ID 4624 (Successful Logon) on destination servers to identify accounts involved. Baseline normal DCOM communication paths and accounts using frequency analysis. Flag connections to unusual destinations, by unusual accounts, or outside normal operational hours using correlation and time series analysis."
          },
          "Creation or modification of Windows Services or Scheduled Tasks by processes commonly hosting COM objects.": {
            "Data": "Windows Event ID 4697; Windows Event ID 4702; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4697 (Service Installed) and 4702 (Scheduled Task Updated/Created). Correlate these events with Windows Event ID 4688 (Process Creation) to identify the parent process. Flag service/task creation/modification initiated by processes known to host COM objects (like svchost.exe, explorer.exe, powershell.exe) or by unexpected user accounts. Use frequency analysis to identify rare service names or task names/configurations created by these processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]