[
  {
    "Has the adversary accessed credentials stored in Group Policy Preferences? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.006 - Group Policy Preferences": {
          "Attempts to list or search for specific XML files within the SYSVOL share, potentially using wildcard characters like '*.xml'.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Windows Event ID 5140",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4688, 4663, and 5140 on Domain Controllers and potential endpoints for activity related to the SYSVOL share. Detect process creations (4688) with command lines containing file search/list utilities (e.g., 'dir', 'findstr', 'Get-ChildItem') targeting '*.xml' or the SYSVOL path. Analyze file access (4663) and network share access (5140) events for read/list operations on SYSVOL by non-standard accounts or from unusual source systems."
          },
          "Access attempts (especially unauthorized or unusual) to the SYSVOL share or GPP XML files within it, including denied access attempts to deliberately protected files.": {
            "Data": "Windows Event ID 5140; Windows Event ID 5145; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 5140, 5145, and 4663 on Domain Controllers for access events to the SYSVOL share and files within its GroupPolicy subdirectories. Specifically look for failure audit events indicating denied access to known sensitive or 'canary' GPP XML files. Use frequency analysis and statistical outliers (e.g., z-score) to identify users or hosts with an abnormally high number of access attempts, especially denied ones, to SYSVOL or GPP files."
          },
          "Execution of known GPP decryption tools or unusual command-line parameters used with standard tools to target GPP XML files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on Domain Controllers and endpoints for process creations matching names of known GPP tools (e.g., 'Get-GPPPassword.ps1', 'gpprefdecrypt.py', 'msfconsole') or command lines containing parameters like '/s', '*.xml', 'Password', 'cpassword' targeting standard Windows utilities (e.g., powershell, cmd). Use correlation analysis to link suspicious process executions with previous SYSVOL access events."
          },
          "Unusual SMB/MSRPC network traffic patterns targeting GPP directories within SYSVOL, especially from hosts or users not typically accessing these paths.": {
            "Data": "Windows Event ID 5140; Windows Event ID 5145; Zeek smb.log; Zeek file.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 5140 and 5145 on Domain Controllers for access to the SYSVOL share, specifically targeting the 'policies' subdirectory and GPP XML files. Identify access from hosts or users outside established baselines using frequency analysis or statistical outliers. If available, analyze Zeek smb.log and file.log for connections to SYSVOL/policies paths; identify anomalous access patterns, unusual data transfer sizes ('bytes_r', 'bytes_w'), or file creations/modifications in GPP directories."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]