[
  {
    "Has the adversary attempted to collect credentials using LLMNR/NBT-NS poisoning and SMB relay? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1557.001 - LLMNR-NBT-NS Poisoning and SMB Relay": {
          "Traffic observed on LLMNR (UDP 5355) or NBT-NS (UDP 137) ports when disabled or unexpected responses.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for UDP traffic on ports 5355 and 137. Correlate with network configuration policies (e.g., if LLMNR/NBT-NS is disabled). Analyze traffic volume and source/destination IPs. Calculate frequency of traffic on these ports over time using time series analysis to detect anomalies."
          },
          "Detection of NTLMv2 hash capture attempts or suspicious SMB relay traffic.": {
            "Data": "Zeek smb.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smb.log and conn.log for SMB traffic patterns indicative of relay attempts (e.g., connections from unexpected sources, authentication attempts without prior session setup). Look for high frequency connection attempts to internal IPs from single or few sources using descriptive statistics."
          },
          "Systems receiving unexpected or multiple responses to LLMNR/NBT-NS queries from hosts not known to provide these services.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for UDP traffic on ports 137 and 5355. Identify instances where a single source IP sends responses (potentially identified by connection direction/timing heuristics) to multiple different destination IPs within a short timeframe for name resolution queries. Identify hosts sending queries and check if they receive responses from IPs other than legitimate DNS/WINS servers or known local hosts. Use frequency analysis on source IPs responding to detect unusual responders."
          },
          "Failed authentication attempts using NTLM on internal services originating from unexpected internal source IPs.": {
            "Data": "Windows Event ID 4625; Zeek smb.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 on critical servers/endpoints that receive authentication attempts. Filter for Logon Type 3 (Network) failures using NTLM authentication. Correlate failed attempts occurring in clusters from internal source IPs that have recently shown suspicious LLMNR/NBT-NS or SMB traffic patterns in Zeek logs (smb.log, conn.log). Analyze the frequency and distribution of these failed attempts across source IPs and target systems using descriptive statistics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary collecting information via LLMNR/NBT-NS poisoning and SMB relay? (TA0009 - Collection)": {
      "Indicators": {
        "T1557.001 - LLMNR-NBT-NS Poisoning and SMB Relay": {
          "Evidence of captured NTLMv2 hashes or successful authentication via relayed credentials.": {
            "Data": "Windows Event ID 4624; Zeek smb.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful network logons (Windows Event ID 4624 on target systems) with suspicious SMB traffic identified in Zeek logs (Zeek smb.log). Analyze logon source IPs and times for patterns inconsistent with normal behavior. Use correlation analysis between suspicious network events and successful logons from those sources."
          },
          "Installation of suspicious services or changes related to SMB relay tooling.": {
            "Data": "Windows Event ID 4697; Windows Event ID 7045",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4697 (Service Installation) and 7045 (Service Control Manager) on endpoints and servers. Filter for service names, file paths, or command lines associated with known LLMNR/NBT-NS poisoning or SMB relay tools. Analyze frequency of service changes across hosts using descriptive statistics to find outliers."
          },
          "Successful network logons originating from internal source IPs not typically associated with user logons, potentially followed by immediate resource access or data exfiltration attempts.": {
            "Data": "Windows Event ID 4624; Zeek files.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (Logon Type 3) on servers and endpoints. Identify successful logons where the source IP is an internal host typically used by a user, but the target account is different, or the source IP is an unusual system (e.g., a workstation connecting with administrative credentials to another workstation/server). Correlate these logons with subsequent file access (Zeek files.log), unusual outbound network connections (Zeek conn.log), or suspicious HTTP requests (Zeek http.log). Use correlation analysis to link suspicious logons to data collection/exfiltration activities."
          },
          "Suspicious SMB traffic patterns showing authentication followed by rapid file enumeration or transfer from an unexpected source IP to a target server.": {
            "Data": "Zeek smb.log; Zeek files.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smb.log for 'session_setup' events followed by file system commands (e.g., 'SMB::FILE_OPEN', 'SMB::FILE_READ', 'SMB::FILE_CLOSE') or pipe connections from unusual internal source IPs. Correlate with Zeek files.log for unexpected file access/transfers occurring over SMB from these sources. Use descriptive statistics to measure file transaction frequency and data volume per session/source IP and flag outliers compared to historical activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]