[
  {
    "Has the adversary accessed credentials via Windows Credential Manager? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1555.004 - Windows Credential Manager": {
          "Execution of vaultcmd.exe with suspicious command-line arguments related to listing credentials.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the process name is 'vaultcmd.exe'. Analyze the command line parameter field for the presence of '/listcreds' or '/list'. Flag events where '/listcreds' is used, particularly if targeting 'Windows Credentials'. Calculate frequency of vaultcmd.exe execution per host/user; flag executions deviating significantly from historical norms using descriptive statistics."
          },
          "Access or file reads to Windows Credential Locker files (.vcrd, .vpol) in user AppData directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access auditing required) for read attempts on files located in '%Systemdrive%\\Users\\*\\AppData\\Local\\Microsoft\\*\\*.vcrd' or '%Systemdrive%\\Users\\*\\AppData\\Local\\Microsoft\\*\\Policy.vpol'. Identify processes performing these read operations. Flag read attempts by unusual processes or from unexpected locations. Correlate file access events with other suspicious activity on the host."
          },
          "Execution of rundll32.exe loading keymgr.dll, especially with the KRShowKeyMgr argument.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where 'New Process Name' contains 'rundll32.exe' AND 'Command Line' contains 'keymgr.dll'. Specifically look for the argument 'KRShowKeyMgr'. Flag any such executions, as this is typically a manual user action not expected for automated processes or services. Analyze the Parent Process Name and Parent Process ID fields to understand the origin of the execution."
          },
           "Outbound network connections from a host to unusual destinations immediately following potential credential access activity (e.g., vaultcmd execution, vault file access).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate host events (Windows Event ID 4688 for vaultcmd.exe/rundll32.exe keymgr.dll execution, Windows Event ID 4663 for vault file access) with subsequent outbound network connections observed in Zeek conn.log (and potentially http.log) from the same host within a defined time window (e.g., 5-10 minutes). Establish a baseline of normal outbound connections per host/user using frequency analysis or descriptive statistics. Flag connections to rare or never-before-seen external IPs or internal hosts that don't align with the user's typical access patterns. Use correlation analysis to identify statistically significant temporal relationships between credential access events and network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]