[
  {
    "Is the adversary using alternate authentication material to bypass defense mechanisms? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550 - Use Alternate Authentication Material": {
          "Successful network authentications (e.g., via Kerberos, NTLM) without corresponding interactive logins or expected precursor events.": {
            "Data": "Windows Event ID 4624; Zeek kerberos.log; Zeek ntlm.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs, filtering for Logon Type '3' (Network) or other non-interactive types. Correlate these events with corresponding interactive logon events (Logon Type '2', '10'). Identify instances of network logins without a matching interactive login on the destination host within a reasonable time window using correlation analysis. Analyze Zeek kerberos.log and ntlm.log for anomalies in authentication flow."
          },
          "Authentication events indicating logon types or network protocols typically associated with credential reuse (e.g., Network Cleartext, RemoteInteractive).": {
            "Data": "Windows Event ID 4624; Zeek kerberos.log; Zeek ntlm.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4624 logs specifically for unusual Logon Types (e.g., 8 NetworkCleartext, 10 RemoteInteractive initiated without preceding interactive logon). Analyze Zeek kerberos.log and ntlm.log for successful authentications using protocols or methods not commonly used in the environment, potentially employing entropy analysis on authentication parameters if sufficient data variability exists."
          },
          "Remote process execution attributed to a standard user account not typically used for remote administration or service tasks.": {
            "Data": "Windows Event ID 4688; Zeek dce_rpc.log; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on remote systems (Logon Type 3, Network). Identify processes created remotely under standard user accounts (not administrators or service accounts). Correlate with Zeek dce_rpc.log or smb.log indicating remote execution (e.g., `svcctl`, `psexec`, WMI activity). Establish a baseline of typical remote process creation activities by user role/account using frequency analysis and flag deviations from this baseline."
          },
          "Simultaneous authentication events for the same user account from geographically disparate locations or across unrelated internal segments.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract successful login events (Windows Event ID 4624) and network connections (Zeek conn.log) for all users. Group events by user account and timestamp. Identify instances where the same user account appears to authenticate to multiple distinct machines/services within a short time frame from source IPs that geolocate to different countries/regions or are located in network segments not typically accessed by that user. Use correlation analysis and geographic mapping to highlight simultaneous disparate access events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using alternate authentication material for lateral movement? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550 - Use Alternate Authentication Material": {
          "The same account is successfully logging into multiple distinct machines concurrently.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract successful login events (Windows Event ID 4624) or network connection logs (Zeek conn.log) attributed to the same user/account. Group events by user and timestamp. Identify instances where the same user account appears to log in or initiate network connections to multiple distinct machines within a very short time frame (e.g., seconds). Use correlation analysis to measure the likelihood of simultaneous access for specific accounts and flag anomalies."
          },
          "Process creation or remote service execution attributed to accounts without corresponding network logon events or from unusual source machines.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4769; Zeek dce_rpc.log; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events, specifically noting the Creator Process ID/Name and the Security ID (SID) of the user the new process is running under. Correlate these process creation events with authentication logs (Event ID 4624, Zeek logs) to identify cases where a process starts remotely under an account without a corresponding interactive logon on the target host. Analyze Zeek dce_rpc.log and smb.log for activity indicative of remote command execution (e.g., PsExec, WMI) and investigate the associated user accounts and source IPs, flagging those from unusual source machines."
          },
          "Network connections or remote service execution originating from a source IP that does not correspond to a user's current known location or active legitimate session.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify active user login sessions (e.g., interactive logins Event ID 4624 Logon Type 2, VPN logs). For lateral movement attempts (e.g., Zeek conn.log to internal systems, Windows Event ID 4688 remote process creation, Zeek dce_rpc.log/smb.log remote execution), check if the source IP address corresponds to the user's currently logged-in machine or known legitimate access point (e.g., corporate VPN IP). Flag connections or remote executions originating from IPs not associated with the user's legitimate session using correlation analysis."
          },
          "Authentication or lateral movement activity by a user account during times or on days outside of the user's typical observed work schedule.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (successful logins, especially Logon Type 3/network) and Zeek conn.log for activity by user accounts. Use statistical analysis (e.g., time series analysis, percentile analysis on timestamps) on login and connection activity per user to identify significant deviations from established typical work patterns (e.g., logins consistently outside business hours or on weekends). Flag lateral movement activities occurring during these anomalous periods."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]