[
  {
    "Is the adversary establishing persistence using modified Pluggable Authentication Modules? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.003 - Pluggable Authentication Modules": {
          "Signs of unauthorized execution within an authentication context potentially enabled by modified modules.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) and network connections (Zeek conn.log) originating from user sessions or system accounts involved in authentication flows. Identify processes with low frequency of occurrence or unusual network destinations using frequency analysis and descriptive statistics. Investigate execution within contexts that should not typically launch user processes or network activity."
          },
          "Unusual successful login events or patterns that bypass standard authentication mechanisms.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze successful logon events (Windows Event ID 4624) and associated network connections (Zeek conn.log) to identify logins occurring at unusual times, from unexpected source IPs, or simultaneous logins for a single user. Compare login patterns against historical data using time series analysis and identify outliers using IQR or percentile analysis."
          },
          "Successful logins for a privileged account to a critical server from an unusual source IP or at an atypical time, not aligning with the account's established access patterns.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines of normal login activity (source IP, time, target server, logon type) for privileged accounts using Windows Event ID 4624 and Zeek conn.log. Use descriptive statistics (e.g., frequency counts for IP-user-server tuples, typical login hours per user using time series decomposition). Flag successful logins that deviate significantly from this baseline (e.g., using percentile analysis or Z-scores on login frequency from new IPs or unusual hours)."
          },
          "Multiple geographically dispersed successful logins for the same non-service account occurring in an impossible travel timeframe.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each account, analyze successful login events (Windows Event ID 4624) and geolocated source IPs (from Zeek conn.log or enrichment). Calculate time differences and distances between consecutive logins. Flag instances where the travel time required between login locations is physically impossible. Use correlation analysis to link these events for the same user ID."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by tampering with authentication modules? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.003 - Pluggable Authentication Modules": {
          "Logons bypassing expected security controls (e.g., MFA, network restrictions) without generating corresponding security events.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review successful logon events (Windows Event ID 4624) and network connections (Zeek conn.log) for accounts that should require multi-factor authentication or originate from restricted network segments. Identify successful logins that do not correlate with successful MFA events or connections originating from unauthorized external IP addresses or internal segments. Use correlation analysis to link login events with expected security control logs."
          },
          "Suspicious sequences of failed and successful login attempts potentially indicating attempts to test modified authentication paths.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of failed (Windows Event ID 4625) and successful (Windows Event ID 4624) login attempts from the same source or targeting the same user within short timeframes using time series analysis. Identify patterns inconsistent with normal user behavior, potentially indicating brute force or testing of compromised credentials or backdoor access. Use correlation analysis to link login attempts across different systems for the same account."
          },
          "Successful user authentication (Windows Event ID 4624) to multiple systems using atypical logon types (e.g., interactive logon where remote logon is expected) shortly after unannounced system modifications on authentication infrastructure.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful login events (Windows Event ID 4624), noting logon types, with any unscheduled process activity (Windows Event ID 4688) or configuration changes on authentication servers. Use frequency analysis to identify atypical logon types for users or systems. Investigate unusual logon type patterns emerging after potential modification windows on auth infrastructure."
          },
          "Anomalous process execution (Windows Event ID 4688) by a user account immediately after its first successful login from a new geographic location or unusual IP, suggesting a compromised authentication module allowed access that then initiated unexpected actions.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify first-time successful logins (Windows Event ID 4624) for user accounts from new/rare geolocations or IP ranges (identified via Zeek conn.log and IP geolocation services). Monitor subsequent process creation events (Windows Event ID 4688) by these accounts on the target systems. Flag sessions where newly accessed accounts execute processes with low frequency of occurrence across the environment or known malicious tools. Use descriptive statistics on process names/paths for the user to establish a baseline and detect deviations using anomaly detection algorithms like one-class SVM on process features."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to access credentials via compromised authentication modules? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.003 - Pluggable Authentication Modules": {
          "Execution of processes or network connections associated with credential harvesting immediately following anomalous login events.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for suspicious processes (e.g., system utilities used for dumping credentials, scripts) running in sensitive contexts or immediately after a successful login, especially if the login itself was anomalous. Analyze network connections (Zeek conn.log) initiated by these processes for exfiltration attempts. Use entropy measures or frequency analysis on command line arguments or network traffic characteristics to detect unusual patterns."
          },
          "Multiple simultaneous interactive or remote access logins for a single account across different systems.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify instances where the same account is logged in interactively or via remote services (Windows Event ID 4624, Zeek conn.log for SSH/RDP) on multiple distinct systems concurrently. Use group by user and count distinct systems to identify simultaneous logins above a normal threshold. Use descriptive statistics to determine the normal threshold and flag outliers."
          },
          "Unusual network traffic (Zeek conn.log) patterns (e.g., large outbound transfers, connections to rare external destinations) originating from authentication servers or domain controllers shortly after periods of high login activity.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network traffic (Zeek conn.log) from authentication servers or domain controllers. Correlate with periods of high successful login activity (Windows Event ID 4624 volume). Use time series analysis (e.g., ARIMA or exponential smoothing) to model normal outbound data volume and connection patterns from these servers and detect anomalous spikes or deviations. Calculate entropy of destination IPs/ports; a sudden decrease in entropy or a shift towards specific new low-frequency destinations could be suspicious."
          },
          "A cluster of login anomalies (Windows Event ID 4624, 4625) across multiple distinct user accounts (e.g., unusual times, locations, failed attempts followed by success from an unexpected IP) originating from a common source or attacking common targets within a short timeframe.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate login events (Windows Event IDs 4624, 4625) and network data (Zeek conn.log for source IPs) across all users. Use statistical methods like moving window event rate analysis or correlation analysis based on source IP, targeted system, and timestamp to identify clusters of anomalous login activities affecting multiple accounts. A sudden increase in the count of distinct accounts exhibiting anomalous login behavior from similar geolocations or IP subnets, or targeting a specific set of resources, could indicate widespread credential compromise and use. Apply graph analysis to visualize connections between anomalous logins, users, and sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]