[
  {
    "Is the adversary maintaining persistence through manipulation of hybrid identities? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Presence of unauthorized modifications to AD FS configuration files or PTA agent service executable/libraries.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access/modification attempts ('WriteData', 'AppendData') on critical AD FS configuration files (e.g., Microsoft.IdentityServer.Servicehost.exe.config) or PTA agent files (e.g., AzureADConnectAuthenticationAgentService.exe). Flag access by non-service accounts or outside maintenance windows. Use correlation analysis to link file modifications with authentication service restarts."
          },
          "Suspicious process activity associated with authentication services, including loaded unsigned DLLs or unusual child processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for process creation and loaded modules related to AD FS (Microsoft.IdentityServer.Servicehost.exe) and PTA agent (AzureADConnectAuthenticationAgentService.exe) processes. Identify instances where unsigned or unfamiliar DLLs are loaded. Use frequency analysis to identify rare DLL loads or unusual child processes spawned by these services."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by modifying hybrid identity authentication? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Unusual activity logs from on-premises AD FS servers indicating policy evaluation bypass or token signing anomalies.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze AD FS Server Event Logs (including Windows Security Event ID 4624) for successful authentication events where expected policy evaluation events (AD FS specific IDs) or multi-factor authentication events are missing or out of sequence for the same session/correlation ID. Use sequence analysis or time series analysis on correlated events to detect anomalies in the authentication flow, potentially indicating policy bypass."
          },
          "Windows Event logs showing authentication service processes loading unexpected or unsigned DLLs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 logs for the AD FS (Microsoft.IdentityServer.Servicehost.exe) and PTA agent (AzureADConnectAuthenticationAgentService.exe) processes. Identify loaded modules. Compare the list of loaded DLLs against a known baseline or a list of signed/expected modules. Flag unsigned or unexpected DLLs for investigation as they may represent injected malicious code used for defense evasion."
          }
        }
      }
    }
  },
  {
    "Is the adversary accessing credentials via manipulated hybrid identity processes? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Network traffic patterns from the on-premises PTA agent or AD FS servers to unusual external IP addresses, potentially exfiltrating harvested credentials.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for connections originating from the on-premises PTA agent or AD FS server IP addresses to external destinations not on an approved list. Use correlation analysis to link suspicious outbound network activity with authentication service process activity (Windows Event ID 4688). Use entropy measures or statistical analysis on payload data or DNS queries for signs of encoded data or C2 communication indicative of exfiltration."
          },
          "Logs showing successful authentication attempts without standard credential validation steps, potentially indicated by unusual event sequences or missing events related to token generation bypass.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs and specific AD FS Server Event Logs for successful authentication events (Account Logon). Correlate these events with other related events in the authentication chain using session/correlation IDs. Identify cases where expected credential validation events or token issuance events appear abnormal, missing, or bypass standard sequences, which could indicate a manipulated authentication process generating unauthorized tokens."
          }
        }
      }
    }
  }
]