[
  {
    "Has the adversary accessed credentials stored in cloud secrets management stores? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1555.006 - Cloud Secrets Management Stores": {
          "API calls to cloud secrets management services from unusual or unauthorized principals (users, roles, services) or unexpected source IPs.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation with command lines containing keywords related to cloud secret retrieval (e.g., 'get-secret-value', 'gcloud secrets describe', 'az key vault secret show'). Filter Zeek conn.log for outbound connections to known cloud secrets manager API endpoints. Cross-reference source processes/IPs with known authorized entities and baseline connection patterns. Flag connections/commands from unusual sources."
          },
          "High volume or unusually frequent API calls requesting secrets from cloud secrets management services.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for frequency of cloud secret retrieval commands executed by specific processes/users. Monitor Zeek conn.log for frequency and volume of connections to cloud secrets manager API endpoints from specific internal hosts. Use time series analysis or statistical process control (e.g., moving averages, standard deviation) to detect sudden spikes or sustained high volume deviating from normal baseline activity."
          },
          "Cloud secrets management API calls originating from unexpected process or user contexts.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on servers and endpoints for processes executing commands related to cloud secret retrieval (e.g., 'get-secret-value'). Correlate these events with process name, parent process, and the user account under which the process is running. Establish a baseline of authorized processes and users that typically access cloud secrets using frequency analysis. Flag commands executed by unauthorized processes, unusual parent processes, or unexpected user accounts based on deviations from the baseline."
          },
          "Outbound network connections or suspicious process activity immediately following cloud secrets retrieval.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful cloud secret retrieval events based on Windows Event ID 4688 command line analysis. Correlate these events with subsequent outbound network connection attempts (Windows Event ID 5156, Zeek conn.log) from the same host within a short timeframe (e.g., 60 seconds). Identify connections to unusual destinations (e.g., external IPs not typically associated with corporate cloud operations, C2 IPs). Use time correlation analysis to link the secret retrieval event to follow-on network activity. Also examine Windows Event ID 4688 for suspicious process creations immediately after secret retrieval."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]