[
    {
        "information_requirement": "Is the adversary maintaining persistence using a malicious network provider DLL?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1556.008",
                "name": "Network Provider DLL",
                "evidence": [
                    {
                        "description": "A DLL registered as a network provider has a file hash that matches a known malicious indicator.",
                        "data_sources": [
                            "Windows Event ID 11",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for new DLL files written to disk (Sysmon Event ID 11), especially in system directories. Calculate the hash of each new DLL and correlate it against a cyber threat intelligence (CTI) feed of known malicious file hashes. If a match is found, cross-reference with registry modifications (Event ID 4657) to the NetworkProvider keys (e.g., HKLM\\System\\CurrentControlSet\\Control\\NetworkProvider\\Order) to confirm it was registered as a network provider."
                    },
                    {
                        "description": "Modification of the NetworkProvider registry key order to include a new, non-standard, or suspiciously named provider not on an established allowlist.",
                        "data_sources": [
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor the registry value at 'HKLM\\System\\CurrentControlSet\\Control\\NetworkProvider\\Order' for modifications (Windows Event ID 4657). Maintain a baseline or allowlist of legitimate provider names (e.g., 'LanmanWorkstation', 'RDPNP', 'webclient'). Alert on the addition of any provider name that is not on the allowlist, has suspicious characteristics (e.g., random characters), or has a low frequency of occurrence across the enterprise, as identified by descriptive statistics."
                    },
                    {
                        "description": "The 'mpnotify.exe' process consistently loads a DLL from an unusual file path (e.g., user profile, temp directory) immediately following user logon events, indicating persistent execution.",
                        "data_sources": [
                            "Windows Event ID 7",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate successful user logons (Windows Event ID 4624) with subsequent image load events (Sysmon Event ID 7) by the 'mpnotify.exe' process. Establish a baseline of legitimate DLLs loaded by this process from standard locations (e.g., C:\\Windows\\System32). Flag any instance where 'mpnotify.exe' loads a DLL from a non-standard or user-writable path (e.g., %APPDATA%, C:\\Users\\Public). Use time-series analysis to confirm the DLL is loaded consistently across multiple logons, indicating a persistent mechanism."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary evading defenses by using a malicious network provider DLL?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1556.008",
                "name": "Network Provider DLL",
                "evidence": [
                    {
                        "description": "A DLL registered as a network provider is unsigned, or is signed by an untrusted or revoked digital certificate publisher.",
                        "data_sources": [
                            "Windows Event ID 11",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Upon file creation of a DLL (Sysmon Event ID 11) that is subsequently registered as a network provider (confirmed via Event ID 4657), inspect the file's digital signature properties. Alert on any DLLs that are unsigned, have an invalid signature, or are signed by publishers not on an organizational allowlist or present on a list of untrusted/revoked publishers."
                    },
                    {
                        "description": "A new network provider is registered under a name that impersonates a legitimate Microsoft or third-party provider (typosquatting).",
                        "data_sources": [
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor changes to the NetworkProvider registry keys (Event ID 4657). Compare newly added provider names against a list of legitimate provider names using fuzzy string matching or Levenshtein distance calculations to detect potential typosquatting (e.g., 'LanmanWokstation' instead of 'LanmanWorkstation', or 'RDPNP' with a non-standard character). Alert on close matches that are not exact."
                    },
                    {
                        "description": "A newly registered network provider DLL exhibits high file entropy, indicating it is likely packed or encrypted to evade static analysis from security products.",
                        "data_sources": [
                            "Windows Event ID 11",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for newly created DLL files (Sysmon Event ID 11) that are subsequently registered as network providers (Event ID 4657). For each such DLL, programmatically calculate its file entropy. Establish a baseline entropy for legitimate system DLLs (typically between 4.8 and 6.0). Alert on any new network provider DLL with an entropy value significantly higher than the baseline (e.g., > 7.0), suggesting obfuscation. Use a box-plot of entropy values for all new DLLs across the environment to identify statistical outliers."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary capturing credentials using a malicious network provider DLL?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1556.008",
                "name": "Network Provider DLL",
                "evidence": [
                    {
                        "description": "Outbound network traffic from a host with a suspect network provider DLL, where the destination IP/domain matches known credential drop zones or C2 infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Windows Event ID 7",
                            "Windows Event ID 3"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "First, identify hosts with suspect network provider DLLs using other indicators. On these hosts, correlate network connections (Sysmon Event ID 3) with the process that loaded the suspect DLL (Sysmon Event ID 7). For this specific traffic, check destination IPs/domains (from Zeek conn.log) against a CTI feed of known credential drop sites or C2 servers. Alert on any matches."
                    },
                    {
                        "description": "A process that has loaded a suspect network provider DLL (e.g., 'lsass.exe', 'winlogon.exe') creates a file with a name or extension commonly used for staged credentials (e.g., 'creds.txt', 'pass.log').",
                        "data_sources": [
                            "Windows Event ID 11",
                            "Windows Event ID 7",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a successful logon (Windows Event ID 4624) with image load events (Sysmon Event ID 7) to identify the loading of a suspect DLL by a credential-handling process (e.g., 'lsass.exe'). Within a short time window (e.g., 1-2 minutes) following the logon, monitor for that same process creating a file (Sysmon Event ID 11) with a name or extension matching a watchlist of suspicious credential-staging patterns. Use regular expressions to match patterns like 'pass*.txt', '*.log', 'key*.dat', etc."
                    },
                    {
                        "description": "An anomalous spike in outbound network traffic or creation of an unusually large file by a credential-handling process ('lsass.exe', 'winlogon.exe') immediately following a series of logon events on a single host.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 11",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On a per-host basis, establish a baseline for the typical volume of outbound network data and file write sizes for credential-handling processes. Use time-series analysis to monitor for logon events (Windows Event ID 4624). Following a logon, check for a significant deviation (e.g., >3 standard deviations from the mean) in outbound network traffic volume (from Zeek conn.log) or file write sizes (from Sysmon Event ID 11) originating from these processes. This could indicate the exfiltration of a batch of collected credentials."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
