```json
[
  {
    "Has the adversary attempted to collect credentials using LLMNR/NBT-NS poisoning and SMB relay? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1557.001 - LLMNR-NBT-NS Poisoning and SMB Relay": {
          "Process execution with command-line arguments characteristic of launching LLMNR/NBT-NS poisoning or SMB relay tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and enable command-line logging. Use regular expression matching on the command-line field to search for patterns associated with tools like Responder or Inveigh. Search for arguments such as '-I [interface]', '-w', '-f', '--lm', '--disable-ess', or script names like 'Responder.py' or 'Invoke-Inveigh'. Analyze the frequency of such command-line patterns across the environment to identify potential widespread activity."
          },
          "A single internal host sending unsolicited LLMNR or NBT-NS responses to multiple other hosts on the same network segment, often for names that do not exist.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for traffic on UDP ports 5355 (LLMNR) and 137 (NBT-NS). Identify source IPs that send responses to a high number of unique destination IPs within a short time frame (e.g., >10 hosts in 1 minute). Use descriptive statistics (count of unique destinations per source IP) to find outliers. A box-plot of response counts per source can visually highlight the attacking host. Alert if traffic is detected on these ports when they are meant to be disabled by policy."
          },
          "An internal host, potentially the same one identified as a poisoner, attempting NTLM authentication against multiple other internal systems in rapid succession, resulting in a high volume of failed logons.": {
            "Data": "Windows Event ID 4625; Zeek smb_mapping.log; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the source IP of the suspected poisoner with subsequent authentication attempts across the network. Monitor Windows Event ID 4625 (Logon Type 3) on servers for a high rate of failed NTLM authentications from a single source. Analyze Zeek smb_mapping.log for repeated session setup attempts from the same source to multiple destinations. Use time series analysis to detect a sudden spike in failed authentications network-wide originating from one or few hosts. Correlate with hosts identified as sending anomalous LLMNR/NBT-NS responses."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary collecting information via LLMNR/NBT-NS poisoning and SMB relay? (TA0009 - Collection)": {
      "Indicators": {
        "T1557.001 - LLMNR-NBT-NS Poisoning and SMB Relay": {
          "Execution of a process where the file hash matches a known LLMNR/NBT-NS poisoning or SMB relay tool.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Windows Event ID 4688 (Process Creation) with process hash logging enabled. Correlate the file hash of each new process against a threat intelligence feed or an internal, curated list of known malicious hashes for tools like Responder, Inveigh, ntlmrelayx.py, and Metasploit modules. Alert on any matches and correlate with network activity from the host."
          },
          "Installation of a new service with a name, path, or command-line arguments associated with known SMB relay or credential harvesting tools, indicating persistence of the collection capability.": {
            "Data": "Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7045 (A service was installed in the system) across all endpoints and servers. Use regular expression matching to search the 'Service Name' and 'Service File Name' fields for patterns and keywords matching tools like 'Responder', 'Inveigh', 'ntlmrelayx', or other known attack frameworks. Investigate any matches, as this could indicate an attempt to establish persistence for the collection tool."
          },
          "A successful network logon (NTLM) to a server where the source host is not the user's typical machine, indicating a successfully relayed credential.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for successful NTLM-based network logons (Windows Event ID 4624, Logon Type 3). For each logon, correlate the user account with the source hostname/IP. Maintain a dynamic baseline of typical user-to-host mappings using historical data. Flag successful logons where a user authenticates from an anomalous host (e.g., another user's workstation, a non-admin server, or a host they have never used before). Use correlation analysis to link these logons to preceding LLMNR/NBT-NS traffic (from Zeek conn.log) involving the victim or attacker host to confirm the relay chain."
          },
          "An authenticated SMB session, established via a suspected relayed credential, is immediately followed by high-volume file enumeration or access to sensitive files.": {
            "Data": "Zeek smb_files.log; Zeek files.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Following a successful suspicious logon (identified via Windows Event ID 4624), monitor the subsequent SMB activity from the attacker's host. Analyze Zeek smb_files.log for an unusually high rate of file open/read operations or access to directories known to contain sensitive data (e.g., 'Users', 'Documents', credential stores). Establish a baseline for normal file access volume per session using descriptive statistics. Use IQR or percentile analysis to detect sessions with outlier file access counts or data transfer volumes (from Zeek files.log), which could indicate active collection."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```