[
  {
    "Is the adversary establishing persistence using modified Pluggable Authentication Modules? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.003 - Pluggable Authentication Modules": {
          "Signs of unauthorized execution within an authentication context potentially enabled by modified modules.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) and network connections (Zeek conn.log) originating from user sessions or system accounts involved in authentication flows. Identify processes with low frequency of occurrence or unusual network destinations using frequency analysis and descriptive statistics. Investigate execution within contexts that should not typically launch user processes or network activity."
          },
          "Unusual successful login events or patterns that bypass standard authentication mechanisms.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze successful logon events (Windows Event ID 4624) and associated network connections (Zeek conn.log) to identify logins occurring at unusual times, from unexpected source IPs, or simultaneous logins for a single user. Compare login patterns against historical data using time series analysis and identify outliers using IQR or percentile analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by tampering with authentication modules? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.003 - Pluggable Authentication Modules": {
          "Logons bypassing expected security controls (e.g., MFA, network restrictions) without generating corresponding security events.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review successful logon events (Windows Event ID 4624) and network connections (Zeek conn.log) for accounts that should require multi-factor authentication or originate from restricted network segments. Identify successful logins that do not correlate with successful MFA events or connections originating from unauthorized external IP addresses or internal segments. Use correlation analysis to link login events with expected security control logs."
          },
          "Suspicious sequences of failed and successful login attempts potentially indicating attempts to test modified authentication paths.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4625, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze sequences of failed (Windows Event ID 4625) and successful (Windows Event ID 4624) login attempts from the same source or targeting the same user within short timeframes using time series analysis. Identify patterns inconsistent with normal user behavior, potentially indicating brute force or testing of compromised credentials or backdoor access. Use correlation analysis to link login attempts across different systems for the same account."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to access credentials via compromised authentication modules? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.003 - Pluggable Authentication Modules": {
          "Execution of processes or network connections associated with credential harvesting immediately following anomalous login events.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) for suspicious processes (e.g., system utilities used for dumping credentials, scripts) running in sensitive contexts or immediately after a successful login, especially if the login itself was anomalous. Analyze network connections (Zeek conn.log) initiated by these processes for exfiltration attempts. Use entropy measures or frequency analysis on command line arguments or network traffic characteristics to detect unusual patterns."
          },
          "Multiple simultaneous interactive or remote access logins for a single account across different systems.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify instances where the same account is logged in interactively or via remote services (Windows Event ID 4624, Zeek conn.log for SSH/RDP) on multiple distinct systems concurrently. Use group by user and count distinct systems to identify simultaneous logins above a normal threshold. Use descriptive statistics to determine the normal threshold and flag outliers."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]