
[
  {
    "Is the adversary evading defenses by installing a malicious root certificate? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1553.004 - Install Root Certificate": {
          "Presence of root certificates whose thumbprints or issuer details match known malicious threat intelligence, or do not match a pre-defined enterprise trusted root certificate baseline.": {
            "Data": "Zeek ssl.log; Windows Event ID 4697; Windows Event ID 4794",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and maintain a baseline of all approved root certificate thumbprints for the enterprise. Continuously collect certificate details from network traffic (Zeek ssl.log 'issuer', 'subject', 'validation_status') and from endpoints via certificate auditing logs (e.g., Windows Event ID 4697 for new service installation with certificate, 4794 for certificate request processing). Correlate observed certificate thumbprints against a CTI feed of known malicious certificates. Alert on any certificate that either matches a malicious list or is not present on the enterprise trusted baseline. This provides a selector-based check against known-bad and known-good lists."
          },
          "Execution of specific command-line utilities or PowerShell scripts known to install or manipulate root certificates, indicative of known malicious patterns.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for the execution of `certutil.exe`, `certreq.exe`, `makecert.exe`, and `powershell.exe`. Specifically hunt for command-line patterns such as `certutil -addstore Root`, `certutil -delstore Root`, `Install-Certificate`, or other certificate manipulation commands targeting the Root, CA, or TrustedPublisher stores. Utilize PowerShell script block logging (Event ID 4104) to capture the full content of scripts used to install certificates. Alert on any unauthorized usage of these command patterns, which represent known actor tradecraft."
          },
          "Installation of a new root certificate that is statistically rare across the enterprise, indicating a non-standard or potentially malicious certificate.": {
            "Data": "Windows Event ID 4697; Windows Event ID 4794; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect the thumbprints and issuer information of all root certificates installed on all endpoints (via auditing events) and observed in network traffic (Zeek ssl.log). Aggregate this data and perform a frequency analysis (count distinct occurrences) for each certificate across the entire fleet. Use descriptive statistics to flag certificates with very low prevalence (e.g., installed on <1% of systems or seen in <0.1% of SSL sessions), as these are likely not part of a standard configuration. Use box-plots or percentile analysis on certificate prevalence to identify statistical outliers for investigation."
          },
          "A new root certificate is installed by an unusual parent process, a non-administrative user, or outside of a designated maintenance or patching window.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate certificate installation events (e.g., command lines from Event ID 4688 or new service certificates in Event ID 4697) with contextual information. Analyze the parent process of the installation utility; installation by a user application like `winword.exe` or `chrome.exe` is highly suspicious. Check the user account associated with the event; installation by a standard user account instead of an IT administrator or SYSTEM account is a high-confidence anomaly. Use time series analysis to correlate installations with authorized change windows, flagging any that occur at unexpected times."
          },
          "Anomalous SSL/TLS traffic patterns from a host following the installation of a new root certificate, such as connections to newly observed domains or a spike in self-signed certificate validations.": {
            "Data": "Zeek ssl.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate endpoint certificate installation events (from Windows Event ID 4688 analysis) with subsequent network behavior from that host. Using Zeek ssl.log, analyze the host's SSL/TLS traffic post-installation. Look for connections to domains that have a low reputation, are newly registered, or are statistically rare across the organization. Monitor for a spike in connections where Zeek's `validation_status` indicates issues like 'self-signed certificate in certificate chain', which a malicious root CA would legitimize on the client-side but not for a network sensor. Use correlation analysis to link the installation event with the onset of suspicious network connections."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
