
[
  {
    "Has the adversary accessed credentials stored in cloud secrets management stores? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1555.006 - Cloud Secrets Management Stores": {
          "Connections to cloud secrets manager API endpoints from known malicious IP addresses or from hosts that are not authorized to perform such actions.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Zeek conn.log for outbound connections to known FQDNs and IP ranges of cloud secrets management services (e.g., AWS Secrets Manager, Azure Key Vault, GCP Secret Manager). Correlate the source IP addresses of these connections against a high-confidence, continuously updated threat intelligence feed of known malicious IPs. Alert on any matches. Additionally, maintain a list of authorized hosts and subnets and alert on any connections originating from outside this list."
          },
          "Execution of command-line syntax matching known credential harvesting tools or patterns of bulk secret enumeration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use regular expression matching to scan process creation command lines (Windows Event ID 4688) for patterns characteristic of credential harvesting tools or enumeration scripts. Focus on CLI commands for cloud providers (e.g., 'aws', 'az', 'gcloud') using flags for listing or recursively fetching secrets (e.g., 'list-secrets', 'get-secrets', 'az keyvault secret list'). Flag command sequences that indicate enumeration (a 'list' command) followed by multiple 'get' or 'show' commands in a short period from the same host/user."
          },
          "Access to cloud secrets from an anomalous context, such as by an unauthorized user, from an unexpected process, or from a host that has never accessed secrets before.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile normal access to cloud secrets by establishing baselines of authorized users, parent/child process relationships (e.g., 'terraform.exe' spawning 'aws.exe'), and source hosts that typically execute secret retrieval commands (identified via Windows Event ID 4688). Use frequency analysis and descriptive statistics to build these profiles. Generate alerts for deviations, such as secret access by a new user, from an unusual process (e.g., 'svchost.exe', 'powershell.exe' without a known script context), or from a host not on the established access baseline."
          },
          "An unusually high volume or frequency of secrets being accessed by a single principal or from a single host, indicating bulk credential harvesting.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for the number of distinct secrets accessed and the frequency of access per user/host over a given time window (e.g., per hour, per day) by analyzing command lines in Windows Event ID 4688 and connection frequency in Zeek conn.log. Use time series analysis and statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect significant spikes in activity that deviate from the established norm. A box-plot of 'secrets_accessed_per_hour' for a given user or host can help visually identify outliers indicative of enumeration and theft."
          },
          "A sequence of actions where cloud secret retrieval is immediately followed by suspicious network activity, such as data exfiltration or connections to new, untrusted external services.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlated detection rule that triggers when a secret access event (identified from Windows Event ID 4688 command line analysis) is observed from a host, and within a short time window (e.g., 1-5 minutes), that same host initiates a new external network connection (from Zeek conn.log) to an IP address with a low reputation score, a country rarely communicated with, or over a non-standard port. Use time correlation analysis based on host identifier and timestamp to link the secret retrieval event directly to the suspicious follow-on network activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
