[
  {
    "Is the adversary maintaining persistence using a malicious network provider DLL? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.008 - Network Provider DLL": {
          "Registry key modification or creation associated with registering a new network provider DLL.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications or creations in HKLM\\System\\CurrentControlSet\\Control\\NetworkProvider\\Order or HKLM\\System\\CurrentControlSet\\Services\\<NewServiceName>\\NetworkProvider. Identify unusual DLL paths or service names. Baseline normal registry changes and flag deviations using statistical methods like frequency analysis."
          },
          "Unexpected network provider DLL loaded by system processes or processes related to authentication (mpnotify.exe).": {
            "Data": "Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Sysmon Event ID 7 (Image loaded) for `mpnotify.exe` or other system processes loading DLLs not typically associated with legitimate network providers (e.g., not in System32 or with known legitimate names). Identify rare DLL loads by these processes using frequency analysis."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by using a malicious network provider DLL? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.008 - Network Provider DLL": {
          "Creation or modification of executable files (DLL) in system directories or unexpected locations, potentially associated with network providers.": {
            "Data": "Windows Event ID 11",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation events (Sysmon Event ID 11) in system directories (e.g., C:\\Windows\\System32) or user directories for new .dll files. Analyze file entropy for newly created/modified DLLs using entropy measures to identify potentially packed or obfuscated malware attempting to evade detection."
          },
          "Unexpected changes to network provider-related registry keys outside of standard software installations or updates.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor changes to the NetworkProvider registry keys (HKLM\\System\\CurrentControlSet\\Control\\NetworkProvider and subkeys) via Windows Event ID 4657. Establish a baseline of expected values and flag any deviations from known legitimate configurations, potentially identifying covert persistence or evasion mechanisms."
          }
        }
      }
    }
  },
  {
    "Is the adversary capturing credentials using a malicious network provider DLL? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.008 - Network Provider DLL": {
          "Suspicious process activity, particularly mpnotify.exe interacting with newly registered or unusual DLLs during logon events.": {
            "Data": "Windows Event ID 4688, Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation (Event ID 4688) and image load (Sysmon Event ID 7) events. Identify instances where `mpnotify.exe` loads or interacts with DLLs identified as suspicious via other indicators (registry changes, file creation). Correlate these events with logon success/failure events (Windows Event ID 4624/4625)."
          },
          "Network traffic from affected hosts potentially containing cleartext credentials or exfiltrated data patterns indicative of credential theft.": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, http.log) from hosts showing other T1556.008 indicators. Look for unusual outbound connections to external IPs, especially those transmitting data over non-standard ports or in cleartext protocols (e.g., HTTP POST). Use correlation analysis to link suspicious network flows to logon events or process activity on the host."
          }
        }
      }
    }
  }
]