[
  {
    "Is the adversary attempting to gain access to credentials via the Registry? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.002 - Credentials in Registry": {
          "Execution of suspicious commands using reg.exe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where 'New Process Name' contains 'reg.exe'. Filter for 'Parent Process Name' values that are non-standard or appear suspicious (e.g., unrelated to system management tasks). Use correlation analysis to link suspicious 'reg.exe' activity with other events on the host (e.g., network connections, file modifications) within a specific time window."
          },
          "Execution of reg.exe queries specifically searching for 'password' strings.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where 'New Process Name' contains 'reg.exe' and 'Command Line' includes parameters indicative of searching for passwords (e.g., '/f password', '/s'). Calculate frequency of such queries across endpoints and investigate statistically rare occurrences or sudden spikes using descriptive statistics and time series analysis."
          },
          "Successful network logons using potentially discovered credentials immediately following suspicious registry query activity.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events showing 'reg.exe' with command lines searching for credentials with subsequent Windows Event ID 4624 events (successful network logons, type 3) or Zeek conn.log entries originating from the same host/user within a short time window (e.g., 60 seconds). Identify logons/connections to sensitive systems or using unusual protocols for the host/user. Use correlation analysis to identify hosts exhibiting this pattern."
          },
          "Outbound network connections to sensitive services from a host immediately after suspicious registry queries for credentials.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events showing 'reg.exe' with command lines searching for credentials with subsequent Zeek conn.log entries originating from the same host within a short time window (e.g., 60 seconds) connecting to known ports for sensitive services (e.g., database ports 1433, 3306; SMB port 445; RDP port 3389; WinRM ports 5985, 5986). Use descriptive statistics to identify hosts/users making statistically unusual connections to these services after suspicious registry queries."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]