[
  {
    "Is the adversary evading defenses using stolen web session cookies? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550.004 - Web Session Cookie": {
          "Successful authentication to web services or cloud applications without expected multi-factor authentication prompts.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and ssl.log for connections to critical web services/cloud applications. Identify sessions where authentication appears successful (based on subsequent requests/response codes) but originates from an IP not associated with expected MFA flows or devices. Use time series analysis to detect unexpected session initiations from unusual sources based on login time and frequency."
          },
          "Access to sensitive cloud data or web application features by a user from an unexpected IP address or device.": {
            "Data": "Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log/ssl.log for user activity (if identifiable via headers/cookies/URLs or correlated logs) accessing sensitive paths or features within web applications from unexpected source IPs or with unusual user-agent strings. Use correlation analysis to link anomalous source IPs to specific user session activity. Use frequency analysis on source IP and user-agent strings to identify rare combinations."
          },
          "Suspicious process activity (e.g., command-line tools, scripts) interacting with browser-specific cookie storage locations on an endpoint.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process executions with command-line arguments targeting known browser cookie file paths (e.g., paths within %APPDATA% or %LOCALAPPDATA% for Chrome, Firefox, Edge profiles). Flag unusual executables (e.g., esentutl.exe, sqlite3.exe, uncommon scripting tools) accessing these locations. Use frequency analysis to identify rare process executions or command-line patterns accessing browser directories on a given endpoint."
          },
          "External web service access from an endpoint that correlates with recent suspicious activity involving browser cookie files on that same endpoint.": {
            "Data": "Zeek http.log; Zeek ssl.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek http.log/ssl.log entries showing access to sensitive web services or cloud applications from an internal IP with recent (e.g., within the last hour) Windows Event ID 4688 events on the corresponding endpoint showing suspicious interaction with browser cookie storage (as identified in the previous evidence). Use correlation analysis to link these events by time, source/target IP, and user (if available). Investigate clustered events where both types of activity occur in close proximity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary moving laterally using stolen web session cookies? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550.004 - Web Session Cookie": {
          "Concurrent access to the same web service/cloud app by the same user from geographically distant locations or from different, unusual systems.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and http.log/ssl.log entries by apparent user session (if possible via traffic analysis or correlation with internal logs). Identify sessions showing activity from multiple, geographically disparate source IPs or unusual user-agent strings within a short timeframe (e.g., minutes). Use geographic analysis and frequency analysis of source IPs and user agents to identify simultaneous or near-simultaneous anomalies indicative of session hijacking or lateral movement."
          },
          "Accessing web/cloud resources under another user's identity via session cookie, exhibiting activity inconsistent with the legitimate user's typical behavior.": {
            "Data": "Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log/ssl.log for sessions accessing web/cloud resources under a specific user's identity. Compare the pattern of accessed URLs, volume of traffic, and connection times within that session against the legitimate user's established baseline using descriptive statistics (mean, median, standard deviation) and time series analysis to identify anomalous behavior indicating potential lateral movement or misuse of the session."
          },
          "Unusual web application access patterns or actions performed by a user account on an internal system (like a server or another user's workstation) not typically used by that user, accessed using a potentially stolen session cookie.": {
            "Data": "Zeek http.log; Zeek ssl.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify user activity in Zeek http.log/ssl.log originating from internal IPs not typically used by the user (e.g., server IPs, other users' workstations). Correlate with successful network logon events (Event ID 4624, Logon Type 3) on those internal systems by the same user account. Analyze subsequent process creation events (Event ID 4688) or web access patterns (http.log/ssl.log) on the internal system, comparing them against the user's baseline activity using descriptive statistics, to detect anomalous actions consistent with lateral movement and misuse."
          },
          "Access to internal web-based services (e.g., internal wikis, admin panels) from an external IP address or unexpected internal IP via web protocols, potentially originating from a foothold system using a stolen cookie.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to internal web server IPs/ports (e.g., internal IPs on 80, 443, 8080, 8443) originating from external IPs or internal IPs not expected to access those services. Analyze the associated http.log/ssl.log for indicators of authenticated access to internal applications. Use correlation analysis to link source IPs to known external threat indicators or anomalous internal hosts. Use frequency analysis to identify rare source IPs accessing these internal services."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]