[
  {
    "Is the adversary maintaining persistence by manipulating conditional access policies? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.009 - Conditional Access Policies": {
          "Successful login events bypassing expected multi-factor authentication requirements from external locations.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 and Zeek conn.log for successful logins from external sources. Correlate with expected MFA requirements (if logged or inferable). Use time series analysis or frequency analysis to identify successful logins occurring from external IPs that should have required MFA based on baseline or policy assumptions."
          },
          "Persistent successful login activity from IP addresses not previously seen or associated with legitimate remote access, potentially enabled by added 'trusted' IP ranges.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify source IPs for successful logins in Windows Event ID 4624 and Zeek conn.log over time. Use descriptive statistics (frequency) and potentially correlation analysis (IP vs time/account) to identify persistent successful logins from IP addresses with low historical frequency or those known not to belong to standard remote access pools."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by manipulating conditional access policies? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.009 - Conditional Access Policies": {
          "Successful authentication from geographic regions or countries previously blocked or flagged as high risk.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Geolocate source IPs from Windows Event ID 4624 and Zeek conn.log. Calculate frequency distribution of source countries/regions. Identify successful logins originating from geographic locations with historically zero or very low login frequency, or locations explicitly expected to be blocked. Use percentiles to identify outliers."
          },
          "Access attempts to sensitive internal resources originating from external IPs via standard protocols (e.g., RDP, SMB over VPN/open ports) that should be restricted by policy.": {
            "Data": "Zeek conn.log, Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to sensitive internal resource IPs/ports from external source IPs that should be blocked by policy (e.g., RDP/SMB from outside VPN). Correlate Zeek logs with successful Windows Event ID 4624 logins from the same source IPs. Use simple filtering or correlation analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary facilitating credential access utilization by manipulating conditional access policies? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.009 - Conditional Access Policies": {
          "High volume of successful logins using a single compromised account from multiple disparate external IP addresses within a short timeframe, possibly due to MFA removal.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and Zeek conn.log for single user accounts authenticating successfully from multiple, geographically disparate IP addresses within a short time window. Calculate the number of unique IPs per user per time unit (e.g., hour) and flag accounts with high entropy in source IP addresses or sudden spikes using statistical thresholds."
          },
          "Successful access using compromised credentials to resources (e.g., shared drives, specific applications) from unexpected external locations, which was previously blocked by location-based policies.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 and Zeek conn.log for successful logins to specific critical assets/servers from external source IPs. Geolocate source IPs. Identify and investigate access to critical assets from geographic locations that are unexpected or outside of permitted policy locations, using frequency analysis or simple filtering."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]