
[
  {
    "Is the adversary establishing persistence by modifying account properties for reversible encryption? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.005 - Reversible Encryption": {
          "Discovery of user accounts configured with reversible password encryption during periodic configuration audits, indicating a persistent vulnerability.": {
            "Data": "Active Directory object properties; Windows Event ID 4720",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Periodically (e.g., daily) query Active Directory for all user accounts where the 'userAccountControl' attribute has the reversible encryption flag (`0x80`) set. This identifies the persistent state. Cross-reference this list with high-value or service accounts. Correlate with newly created accounts (Event ID 4720) that are immediately configured with this setting to detect adversary-created persistent accounts. This hunt identifies persistence mechanisms even if the initial change event was missed."
          },
          "A new Fine-Grained Password Policy (FGPP) is created and applied to a specific user or group, with the 'Store passwords using reversible encryption' setting enabled.": {
            "Data": "Windows Event ID 4662",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the creation of new Fine-Grained Password Policy objects (objectClass 'msDS-PasswordSettings') using Windows Event ID 4662. Inspect the attributes of the new policy, specifically 'msDS-PasswordReversibleEncryptionEnabled', for a value of 'TRUE'. This pattern reveals a more targeted method of enabling the setting for persistence on select accounts, often bypassing scrutiny of the Default Domain Policy."
          },
          "A user account with reversible password encryption enabled is used for successful authentication after a long period of dormancy, or its password is changed and then immediately used for authentication.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4723; Active Directory object properties",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify all accounts with reversible encryption enabled (via periodic AD query). For this subset of accounts, monitor for signs of use as a persistence mechanism. Use time series analysis on login events (Event ID 4624) to flag accounts logging in after a long period of inactivity (e.g., >90 days). Correlate a password change event (Event ID 4723) on one of these accounts with an immediate successful logon (Event ID 4624), which could indicate an adversary reactivating a persistent account by resetting its password and retrieving the new plaintext password."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting to evade defenses by enabling reversible password encryption? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.005 - Reversible Encryption": {
          "Modification of the Default Domain Policy or Default Domain Controllers Policy to enable reversible encryption, originating from a non-standard administrative host or via a suspicious process.": {
            "Data": "Windows Event ID 4662; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify the GUIDs for the 'Default Domain Policy' and 'Default Domain Controllers Policy'. Monitor Event ID 4662 for modifications to these specific object GUIDs. Cross-reference the source of the change (user, process name from Event ID 4688, source hostname) against a list of authorized administrative hosts and processes. An alert on a modification originating from an unauthorized source suggests an attempt to make a broad, evasive change under the guise of a default policy update."
          },
          "Execution of PowerShell or other command-line utilities with specific arguments to enable reversible password encryption, especially when obfuscated or run non-interactively.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688) and PowerShell script block logs for command lines containing patterns like 'AllowReversiblePasswordEncryption', 'Set-ADUser', and 'Set-ADAccountControl'. Flag instances using obfuscation (e.g., Base64, string concatenation). Analyze Zeek conn.log for WinRM traffic (port 5985/5986) to Domain Controllers and use regression analysis to find correlations between these remote sessions and subsequent account modifications, indicating evasive remote administration."
          },
          "Reversible password encryption is enabled by an administrator or service account that has no history of performing security policy modifications, or the change occurs outside of an authorized change management window.": {
            "Data": "Windows Event ID 4662; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal administrative behavior for accounts authorized to modify AD user properties. Profile which administrators/processes typically modify `userAccountControl` and when. Use descriptive statistics and time series analysis to detect anomalous modifications, such as a change made by a novel administrator, from an unusual source host, or at an atypical time (e.g., 3 AM on a weekend). Calculate the entropy of modifying users/hosts per day; a sudden spike indicates an anomaly and potential evasion of oversight."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting credential access by enabling reversible password encryption? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.005 - Reversible Encryption": {
          "Execution of known hacking tools or scripts, identified by name or hash, that are capable of modifying user accounts to enable reversible password encryption.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Event ID 4688) on Domain Controllers and administrative workstations. Match process names or file hashes against a threat intelligence feed of known credential access tools (e.g., specific versions of Mimikatz, PowerSploit modules, custom scripts). Alert on any matches, especially if command-line arguments indicate account modification, as this is a strong selector for a credential access attempt."
          },
          "Direct modification of an Active Directory user account's 'userAccountControl' attribute to include the 'Password is stored using reversible encryption' flag.": {
            "Data": "Windows Event ID 4662",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Active Directory audit logs (Event ID 4662) for modifications to user objects. Filter for changes to the 'userAccountControl' attribute. Analyze the new value to detect if the flag for reversible encryption (`0x80`) has been added via a bitwise OR operation. This pattern is a direct indicator of the technique being performed. Correlate this change with the source user and hostname to identify unauthorized modifications."
          },
          "An account's password settings are modified to allow reversible encryption, followed shortly by suspicious access to LSA secrets on a Domain Controller by the same initiating user or from the same source host.": {
            "Data": "Windows Event ID 4662; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a time-series correlation rule that triggers when an account is modified to allow reversible encryption (Event ID 4662). Within a short time window (e.g., 15 minutes), look for subsequent attempts by the same initiating user or source host to access LSA secrets (Event ID 4656, 4663 targeting `G$MSRADIUSCHAPKEY`) on a Domain Controller. This behavioral sequence strongly suggests a credential access attempt, linking the setup action to the payoff action."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
