[
  {
    "Is the adversary searching for or accessing unsecured credentials? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552 - Unsecured Credentials": {
          "Process execution with command-line arguments containing strings indicative of credential searching (e.g., 'password', 'credentials').": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Filter for process command-line arguments containing suspicious keywords (e.g., 'password', 'pwd', 'login', 'secure', 'credentials') or regex patterns indicative of searching. Investigate flagged process executions, analyzing parent-child relationships and user context. Use frequency analysis on command-line keyword usage across systems/users to identify outliers."
          },
          "Suspicious access patterns to credential-related files (e.g., .bash_history, known config files) or registry keys, particularly when combined with command-line search terms.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4658; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (file access) and 4656/4658 (registry access) logs. Filter for access attempts targeting known credential storage locations (e.g., specific registry paths, user dot files like .bash_history, common config file extensions). Correlate access events with Windows Event ID 4688 to identify the process and command line responsible. Analyze access patterns for unusual volume or speed (e.g., many files accessed quickly) using time series analysis or volume thresholds."
          },
          "Automated or rapid file access combined with suspicious command-line arguments indicative of bulk credential harvesting.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4663 (file access) with Windows Event ID 4688 (process creation). Filter for processes accessing multiple files (e.g., >10 files) within a short time window (e.g., 1 minute) AND whose command line (from 4688) contains suspicious credential-searching terms or regex patterns. Use volume thresholding and time-based correlation analysis."
          },
          "Execution of standard utilities (like cat, Reg.exe) with parameters targeting known credential storage locations (e.g., .bash_history, specific registry keys).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of specific utilities known to access files or registry keys (e.g., `cmd.exe`, `powershell.exe`, `bash`, `cat`, `Reg.exe`, `reg.com`, `regedt32.exe`). Analyze their command-line arguments to identify if they are targeting known sensitive files (.bash_history, configuration files) or registry paths associated with credential storage (e.g., SAM hive, LSA secrets, credential manager keys). Use pattern matching or regular expressions on command lines."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]