[
  {
    "Has the adversary attempted to gain credentials using an Evil Twin attack? (TA0006 - Credential Access)": {
      "Indicators": {
        "Network traffic showing connection to untrusted SSID followed by HTTP/S access to login-like page URIs.": {
          "Data": "Zeek http.log, Zeek ssl.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek http.log for connections originating from endpoints on public/unknown networks reaching URIs indicating login pages (e.g., containing 'login', 'signin', 'auth'). Analyze Zeek ssl.log for certificate issues on connections from these endpoints (invalid, self-signed). Identify patterns using descriptive statistics on requested URIs and domains."
        },
        "Network traffic showing credential submission attempts over insecure channels after connecting to untrusted SSID.": {
          "Data": "Zeek http.log, Zeek conn.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek http.log for POST requests to login-like pages from endpoints on public/unknown networks, especially if not using HTTPS. Analyze Zeek conn.log for connections using non-standard ports or protocols indicative of credential exfiltration or handshake attacks. Use entropy measures on destination IP/port pairs to detect anomalies."
        }
      }
    }
  },
  {
    "Has the adversary collected data using an Evil Twin attack? (TA0009 - Collection)": {
      "Indicators": {
        "Network traffic showing connection to untrusted SSID followed by unusual outbound data transfers or C2 communication.": {
          "Data": "Zeek conn.log, Zeek http.log, Zeek dns.log, Zeek files.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek conn.log for endpoints connected to public/unknown networks making connections to known C2 IPs/domains (cross-reference with threat intel). Analyze Zeek files.log for unexpected file transfers originating from these endpoints. Use correlation analysis between connection times/locations and data transfer events."
        },
        "Network traffic exhibiting unusual redirects, certificate warnings, or protocol manipulation after connecting to untrusted SSID.": {
          "Data": "Zeek http.log, Zeek ssl.log",
          "Data Platform": "Endpoints, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Examine Zeek http.log for multiple or unusual HTTP redirects (e.g., 302 responses) immediately following connection to a network. Analyze Zeek ssl.log for connections with invalid, self-signed, or unexpected certificates from endpoints on public/unknown networks. Use time series analysis to identify sudden increases in redirect or certificate warning events from specific endpoints."
        }
      }
    }
  }
]