
[
  {
    "Is the adversary using alternate authentication material to bypass defense mechanisms? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550 - Use Alternate Authentication Material": {
          "Execution of processes or access to named pipes on endpoints or servers associated with known credential theft and alternate authentication tools (e.g., Mimikatz, Rubeus).": {
            "Data": "Windows Event ID 4688; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events with names like `mimikatz.exe`, `rubeus.exe`, or other known credential dumping/use tools. Analyze command-line arguments for suspicious patterns indicative of loading authentication material. Monitor Zeek smb.log for access attempts to named pipes commonly used by these tools (e.g., `mimi_etc`, `psexesvc`). Maintain a list of these selectors and alert on any matches."
          },
          "Anomalous Kerberos event sequences, such as a service ticket request (TGS-REQ) without a recent, corresponding ticket-granting ticket request (TGT-REQ) from the same source, indicative of Pass-the-Ticket.": {
            "Data": "Windows Event ID 4769; Windows Event ID 4768; Zeek kerberos.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "On Domain Controllers, monitor for Kerberos service ticket requests (Windows Event ID 4769). For each request, perform a correlation analysis to check for a recent preceding Kerberos authentication ticket request (TGT-REQ, Event ID 4768) from the same source IP for the same user account within a defined lookback period (e.g., 10 hours). Flag instances of Event ID 4769 without a corresponding Event ID 4768 as potential Pass-the-Ticket. In parallel, analyze Zeek kerberos.log for tickets with unusually long lifetimes or strong encryption (e.g., RC4) requested by non-administrative accounts."
          },
          "Detection of unusual logon types in authentication events, such as Logon Type 9 (NewCredentials), which indicates a process is using explicit credentials different from the parent process, a pattern used in credential reuse.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 logs for successful logons with Logon Type 9 ('NewCredentials'). These are highly unusual for standard enterprise activity. Correlate these events with the process that initiated them (found in the event data) to understand the context (e.g., `runas.exe`). Use frequency analysis to establish a baseline of any legitimate administrative use and alert on all other instances, as they are strong indicators of tools like `runas /netonly` or other credential reuse techniques."
          },
          "A single user account successfully authenticating from multiple, distinct internal source systems simultaneously or in a rapid, non-sequential manner inconsistent with normal user behavior.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate successful network logon events (Windows Event ID 4624, Logon Type 3) by user account. Using a sliding time window (e.g., 5 minutes), count the number of distinct source workstations each user authenticates from. Establish a baseline for normal activity per user or role using descriptive statistics (e.g., mean, 95th percentile of distinct source IPs per window). Use box-plots or percentile analysis to flag users exhibiting an anomalous number of concurrent source systems, a behavior indicative of an adversary using stolen credentials or tokens from multiple compromised hosts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary using alternate authentication material for lateral movement? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550 - Use Alternate Authentication Material": {
          "Remote process execution using tools like PsExec or WinRM where command-line arguments or associated network traffic contain specific selectors indicative of non-interactive, credential-based authentication.": {
            "Data": "Windows Event ID 4688; Zeek dce_rpc.log; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events of tools like `powershell.exe`, `psexec.exe`, or `wmic.exe` with command-line arguments indicating remote execution against other hosts. Monitor Zeek dce_rpc.log and smb.log for activity associated with these tools (e.g., `svcctl` endpoint for service creation, `psexesvc` named pipe access). Alert on the use of these specific tool selectors for remote execution, especially when initiated by non-administrative accounts or from non-standard administrative workstations."
          },
          "A network logon event (Logon Type 3) using NTLM authentication on a target host, immediately followed by remote process or service creation by the same account, forming a high-fidelity Pass-the-Hash pattern.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection rule that correlates events on a target host. Trigger on a successful network logon (Windows Event ID 4624, Logon Type 3) where the 'Authentication Package' is 'NTLM'. Within a short time window (e.g., 2 seconds), look for either a process creation event (Event ID 4688) or a new service installation (Event ID 7045) attributed to the same 'Security ID' from the logon event. This specific, time-sensitive sequence is a high-fidelity pattern for Pass-the-Hash based lateral movement and should be investigated immediately."
          },
          "A 'chain' of network logon events across multiple hosts, where one host becomes the source of a subsequent logon to another host, revealing a tool-agnostic path of lateral movement.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Ingest and parse Windows Event ID 4624 (Logon Type 3) and Zeek conn.log data, extracting user, source host, and destination host for each logon event. Construct a time-ordered sequence of logons. Identify chains of events where `host_B` logs into `host_C` shortly after `host_A` logged into `host_B`. Use graph analysis techniques to visualize these chains and calculate metrics like chain length or centrality to identify significant lateral movement paths. Use time series analysis on the frequency of new chain formation to detect anomalous spikes in organization-wide lateral activity."
          },
          "A privileged or service account performing network logons from a workstation or at a time that deviates significantly from its established behavioral baseline, indicating credential reuse from a compromised host.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each user account (especially privileged accounts and service accounts), create a baseline profile of typical source workstations/IPs and logon times for network logons (Type 3), based on historical Windows Event ID 4624 data. This profile can be a statistical model of logon frequency from specific hosts at specific times. Continuously monitor new logons and compare them against the user's baseline. Use linear regression to forecast expected activity and flag significant deviations, or simpler percentile analysis to flag logons from rare source hosts (<5% frequency) or at unusual times. Alert on these deviations as they may indicate a stolen credential or token being used for lateral movement."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
