[
  {
    "Is the adversary subverting trust controls for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1553.003 - SIP and Trust Provider Hijacking": {
          "Unauthorized modifications to Registry keys associated with SIPs or Trust Providers.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Log for Event ID 4657 targeting Registry paths under HKLM\\SOFTWARE[\\WOW6432Node]\\Microsoft\\Cryptography\\OID and HKLM\\SOFTWARE[\\WOW6432Node]\\Microsoft\\Cryptography\\Providers\\Trust. Baseline expected values and flag unexpected modifications to 'Dll', 'FuncName', 'DLL', or 'Function' values, especially those pointing to non-standard locations or newly created files. Use frequency analysis on modified keys to identify rare changes."
          },
          "Failed code integrity checks or CAPI v2 errors indicating trust validation failures for signed binaries.": {
            "Data": "Windows Event ID 81; Windows Event ID 3033",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor CAPI v2 logging (Event ID 81) and Code Integrity logging (Event ID 3033). Analyze failed trust validation events (Event ID 81) for binaries or components attempting to execute that should have valid signatures. Correlate Code Integrity failures (Event ID 3033) with attempts to load validation components. Use correlation analysis to link failed validation events to process execution logs."
          },
          "Execution of known tools (like Regsvr32) or processes with command line arguments targeting SIP/Trust Provider Registry keys or associated directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing 'regsvr32.exe' in the command line. Also, monitor for other uncommon processes with command lines modifying Registry keys under HKLM\\SOFTWARE[\\WOW6432Node]\\Microsoft\\Cryptography\\OID or HKLM\\SOFTWARE[\\WOW6432Node]\\Microsoft\\Cryptography\\Providers\\Trust. Analyze command line arguments for signs of DLL registration/unregistration or direct Registry modification commands targeting SIP/Trust Provider configurations. Use frequency analysis on command line parameters and parent-child process relationships to identify anomalous executions."
          },
          "Successful trust validation events (CAPI v2) for binaries with suspicious characteristics (e.g., unknown publisher, unusual location) followed by network connections.": {
            "Data": "Windows Event ID 11; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor CAPI v2 logging (Event ID 11). Filter successful validation events for executable files (.exe, .dll) not signed by expected publishers (e.g., Microsoft, your organization) or located in user profile directories, temporary folders, or other non-standard system locations. Correlate these validated binaries with Zeek conn.log entries to identify subsequent external network connections initiated by the host where the validation occurred. Prioritize investigation of connections from hosts/binaries matching these suspicious criteria."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]