[
  {
    "Is the adversary attempting to gain credential access via DHCP spoofing? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1557.003 - DHCP Spoofing": {
          "Detection of hosts receiving unusual network configuration parameters (e.g., malicious DNS/Gateway IPs) via DHCP.": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dhcp.log to identify Offer/ACK pairs. Extract reported DNS server and default gateway IPs. Cross-reference these IPs against expected internal IPs and threat intelligence feeds. Flag clients receiving configuration with known malicious or unexpected external IPs. Use frequency analysis to identify anomalous configuration IPs received by multiple clients."
          },
          "High volume of DHCP requests causing IP pool exhaustion, potentially indicating a denial of service attempt or precursor to spoofing.": {
            "Data": "Windows Event ID 1341, Windows Event ID 1342, Windows Event ID 1020, Windows Event ID 1063",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 1341, 1342, 1020, 1063 on DHCP servers. Track the rate of IP address allocation requests. Detect rapid increases or sudden exhaustion of the DHCP pool. Use time series analysis to identify anomalous spikes in allocation requests compared to historical baselines."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to collect data via DHCP spoofing? (TA0009 - Collection)": {
      "Indicators": {
        "T1557.003 - DHCP Spoofing": {
          "Network traffic showing clients attempting to connect to known malicious IPs or unexpected destinations after receiving DHCP offers.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "After identifying hosts potentially receiving malicious configurations (from Zeek dhcp.log analysis), filter Zeek conn.log for traffic originating from these hosts. Analyze destination IPs and protocols. Correlate with threat intelligence feeds or identify connections to unusual external destinations, potentially indicating redirection for sniffing or C2."
          },
          "Detection of unauthorized or multiple DHCP server responses on the network segment.": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dhcp.log for Discover/Request messages followed by Offer/ACK responses from multiple distinct server IP addresses on the same network segment. Identify Offer messages providing conflicting network parameters (e.g., different DNS/Gateway IPs) for the same client request. Count the number of unique server IPs responding to client requests and flag segments with multiple responders."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]