[
  {
    "Has the adversary obtained credential access via forged Kerberos tickets? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1558.001 - Golden Ticket": {
          "Anomalous Kerberos activity detected, such as TGS requests without preceding TGT requests or malformed/blank fields in logon/logoff events.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4634; Windows Event ID 4672; Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event IDs 4624, 4634, 4672, and 4769 on Domain Controllers. Search for Event ID 4769 (TGS request) without a corresponding preceding Event ID 4768 (TGT request) for the same user and logon session, potentially using correlation analysis. Analyze fields within these events for null, malformed, or unexpected values using basic filtering."
          },
          "Kerberos TGT tickets observed with unusual lifetimes or using deprecated encryption types (e.g., RC4) for privileged accounts.": {
            "Data": "Windows Event ID 4768",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4768 on Domain Controllers. Analyze the 'Ticket Options' and 'Ticket Encryption Type' fields for TGT requests, especially for KRBTGT or other privileged accounts. Identify TGTs using RC4 encryption. Identify TGTs having lifetimes significantly longer than the default domain policy (e.g., using statistical deviation analysis on observed lifetimes for the KRBTGT account or across all TGTs)."
          },
          "Rapid successful network logons by a single account on multiple distinct systems within a short time window.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 for Logon Type 3 (Network) events on target servers. Group successful logons by 'Account Name'. For each account, calculate the number of distinct 'Target Server Name' values accessed within consecutive 5-minute windows. Identify accounts exhibiting a count significantly higher than their historical average or the average for similar accounts (using statistical methods like standard deviation or percentiles). Correlate these rapid access events with Zeek conn.log to examine associated network traffic details (protocol, byte volume, destinations)."
          },
          "Kerberos TGT or TGS ticket requests for the KRBTGT account or originating from non-Domain Controller systems.": {
            "Data": "Windows Event ID 4768; Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4768 (TGT Request) and 4769 (TGS Request) on Domain Controllers. Filter events where the 'Target Account Name' is 'krbtgt'. Alert on any such events. Additionally, examine the 'Client Address' field in 4768 and 4769 events. Maintain a list of authorized Domain Controller IPs. Identify and alert on Kerberos ticket requests originating from IPs that are not on this authorized DC list. Use frequency analysis to identify any patterns in requests from non-DC sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]