[
  {
    "Is the adversary using 'Pass the Ticket' for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550.003 - Pass the Ticket": {
          "Kerberos ticket validation failures (e.g., Golden Ticket misuse after KRBTGT reset).": {
            "Data": "Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4769 on Domain Controllers. Specifically filter for status code 0x1F indicating Kerberos ticket integrity check failure. Alert on any occurrences."
          },
          "Authentication events from systems or users not typically accessing resources with Kerberos, or at unusual times/frequencies.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4768; Windows Event ID 4769; Zeek kerberos.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event IDs 4624, 4768, 4769 and Zeek kerberos.log for successful Kerberos authentications and ticket requests. Use correlation analysis or descriptive statistics to identify users/systems authenticating to resources they haven't accessed before, or accessing resources at unusual frequencies/times compared to historical data. Flag authentications deviating significantly from baseline behavior (e.g., using IQR or percentile analysis)."
          },
          "Kerberos authentication events (TGT or Service Ticket requests/grants) originating from systems or IP addresses not historically associated with the authenticating user or account.": {
            "Data": "Windows Event ID 4768; Windows Event ID 4769; Zeek kerberos.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline normal source IP addresses and hostnames/systems associated with Kerberos authentications for each user account based on Windows Event IDs 4768/4769 and Zeek kerberos.log. Use frequency analysis or correlation analysis to identify instances where an account authenticates from a source system/IP that is statistically rare or has no prior history of use by that account. Flag IPs with a low frequency of authentication for a given account or a source IP with zero historical authentications for the account."
          },
          "Rapid sequence of TGT request followed immediately by multiple Service Ticket requests for different resources by the same account from the same source IP.": {
            "Data": "Windows Event ID 4768; Windows Event ID 4769; Zeek kerberos.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4768 (TGT request) and 4769 (Service Ticket request/grant) or Zeek kerberos.log. Correlate events by source IP and user account. Identify sequences where a TGT request is followed by a rapid succession (e.g., within seconds or a few minutes) of Service Ticket requests for multiple distinct services/systems from the same source. Calculate the time delta between events and the number of unique service requests. Use thresholding to flag sequences exceeding expected limits (e.g., >5 service tickets requested within 60 seconds)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using 'Pass the Ticket' for lateral movement? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550.003 - Pass the Ticket": {
          "Remote authentication events using Kerberos tickets followed immediately by execution of commands or transfer of files on the target system.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful network logins (Event ID 4624, Logon Type 3) on target systems with process creation events (Event ID 4688) or network connections (Zeek conn.log) originating from the authenticated session occurring within a short timeframe (e.g., <5 minutes) after the authentication. Look for execution of suspicious commands, known adversary tools, or connections to new internal/external hosts not part of typical user activity using correlation analysis."
          },
          "Requests for service tickets or TGTs that are outside of a user's normal behavior or access patterns.": {
            "Data": "Windows Event ID 4768; Windows Event ID 4769; Zeek kerberos.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event IDs 4768 and 4769 and Zeek kerberos.log for patterns of TGT or Service Ticket requests. Build a baseline of normal ticket requests per user or system (volume, timing, requested service/system). Use time series analysis or deviation analysis (e.g., IQR, Z-score) to identify requests for tickets that are unusual in volume, timing, or requested service/system compared to the established baseline."
          },
          "Successful Kerberos authentication (network logon type 3) to systems that the authenticating user account typically does not access remotely.": {
            "Data": "Windows Event ID 4624; Zeek kerberos.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 (Logon Type 3 - Network) on potential target systems and Zeek kerberos.log for successful Kerberos authentications. Create a historical baseline of which user accounts successfully authenticate to which remote systems using Kerberos. Use correlation analysis or frequency analysis to identify instances where a user account successfully authenticates to a system it has not historically accessed remotely, especially sensitive systems. Flag accounts/systems with a very low historical frequency of interaction."
          },
          "Analysis of Kerberos ticket details (e.g., flags, expiry) observed in network traffic showing unusual characteristics during authentication to resource servers.": {
            "Data": "Zeek kerberos.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek kerberos.log for successful Kerberos authentications to resource servers. Examine parsed ticket fields (e.g., flags, renew-until, endtime, ctime, authtime). Establish baseline distributions for these fields for typical user/service authentications using descriptive statistics. Use statistical methods (e.g., IQR, percentile) to identify tickets with parameters deviating significantly from the norm (e.g., abnormally long validity, unusual flag combinations like using the 'forwardable' flag when not typical), which could indicate forged or manipulated tickets."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]