[
  {
    "Is the adversary maintaining persistence by modifying host software binaries? (TA0003 - Persistence)": {
      "Indicators": {
        "T1554 - Compromise Host Software Binary": {
          "Changes to file hashes or digital signatures of legitimate system or application binaries that do not correspond to scheduled updates or patching.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of critical system or application binaries (e.g., ssh.exe, WINWORD.EXE). Maintain a baseline of expected command-line arguments and parent processes for these binaries. Flag executions with significant deviations from the baseline or unexpected child processes using correlation analysis."
          },
          "Anomalous process behavior originating from system or application binaries (e.g., unexpected network connections, child processes, or file access patterns).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process creation) logs with Zeek conn.log. Identify network connections initiated by critical system or application binaries. Analyze destinations, ports, and connection volume. Flag connections to unusual or unauthorized endpoints, or deviations in connection patterns using descriptive statistics and anomaly detection (e.g., comparing current behavior to historical data for the specific binary)."
          },
          "Execution of system or application binaries with invalid, missing, or unexpected digital signatures.": {
            "Data": "Windows Event ID 4688; Windows Event ID 3002; Windows Event ID 3034",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process execution of critical binaries. For these processes, check associated Code Integrity events (Windows Event ID 3002, 3034) for signature status and information. Flag executions where the signature is invalid, missing, or corresponds to an unexpected issuer/timestamp compared to known good versions or standard software. Correlate flagged events with scheduled patch management records to rule out legitimate updates."
          },
          "Suspicious module loads or file modifications originating from processes of critical system or application binaries.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7; Windows Event ID 11; Windows Event ID 26",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes of critical system/application binaries using Windows Event ID 4688. Monitor Sysmon Event ID 7 (Image loaded) for these processes; flag loads of unusual DLLs or modules from unexpected locations or with suspicious names. Monitor Sysmon Event ID 11 (FileCreate) and Event ID 26 (FileChange) for file write/modification activity by these processes targeting system directories or other sensitive locations. Establish a baseline of typical module loads and file write targets per binary using frequency analysis and flag deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]