[
    {
        "information_requirement": "Is the adversary evading defenses by bypassing Gatekeeper on macOS?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1553.001",
                "name": "Gatekeeper Bypass",
                "evidence": [
                    {
                        "description": "A downloaded file matches a known-bad hash, or initiates a network connection to a known malicious C2 domain associated with malware that employs Gatekeeper bypass techniques.",
                        "data_sources": [
                            "Zeek files.log",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously hash files traversing the network identified in Zeek files.log and correlate these hashes against a threat intelligence feed of known malware signatures. Additionally, monitor Zeek conn.log and dns.log for connections or DNS queries from macOS hosts to IPs/domains known to be C2 infrastructure for malware families that utilize Gatekeeper bypasses. Inner join network logs with CTI feeds and alert on any matches."
                    },
                    {
                        "description": "Direct use of command-line utilities to manipulate file attributes or create specially crafted archives designed to circumvent Gatekeeper checks.",
                        "data_sources": [
                            "macOS Audit logs",
                            "Windows Event ID 4688 (if using Sysmon for macOS)"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor endpoint logs for process execution events with full command-line logging. Create detection rules for patterns such as: 1) `/usr/bin/xattr` used with the `-d com.apple.quarantine` or `-c` flags on files in `~/Downloads` or other user-writable temporary directories. 2) The `zip` command used with the `-y` flag to create an archive from a symlink pointing to an application bundle. 3) Use of `codesign --remove-signature` on a quarantined application. Correlate any such command execution with recent file downloads or subsequent network activity from the same host."
                    },
                    {
                        "description": "A recently downloaded application executes and establishes a suspicious network connection after its quarantine attribute was removed.",
                        "data_sources": [
                            "macOS Audit logs",
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate events in sequence: 1. A file download to a macOS host (Zeek files.log). 2. A process execution of `xattr -d com.apple.quarantine` on that file (endpoint logs). 3. The execution of the file itself. 4. Subsequent new network connections from the host (Zeek conn.log). Use correlation analysis on events linked by host IP and timestamps within a short window (e.g., 5 minutes) to detect this entire behavioral chain. Analyze resulting network traffic for beaconing using time series analysis."
                    },
                    {
                        "description": "Execution of an unsigned or ad-hoc signed application that was downloaded from an external source, indicating a potential Gatekeeper logic flaw exploit.",
                        "data_sources": [
                            "macOS Audit logs"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On macOS endpoints, monitor for process execution events originating from files with the `com.apple.quarantine` attribute. For each such execution, inspect the process's code signing status. Flag and investigate any processes that are unsigned or have only ad-hoc signatures, as these should normally be blocked by Gatekeeper. Use frequency analysis to identify rare developer certificates or a high prevalence of unsigned quarantined apps running in the environment, which could indicate a widespread bypass."
                    },
                    {
                        "description": "Anomalous modification of files critical to Gatekeeper's functionality, such as the QuarantineEventsV2 database or Info.plist files, followed by untrusted code execution.",
                        "data_sources": [
                            "macOS Audit logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Implement file integrity monitoring on `~/Library/Preferences/com.apple.LaunchServices.QuarantineEventsV2`. Monitor for any unauthorized process modifying or deleting this file. Establish a baseline of normal access patterns and use statistical methods like Inter-Quartile Range (IQR) on access frequency per process to detect anomalous behavior. Correlate alerts with the subsequent execution of untrusted applications from the same user context and any follow-on suspicious network connections observed in Zeek conn.log."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
