[
  {
    "Is the adversary maintaining persistence through manipulation of hybrid identities? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Presence of unauthorized modifications to AD FS configuration files or PTA agent service executable/libraries.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access/modification attempts ('WriteData', 'AppendData') on critical AD FS configuration files (e.g., Microsoft.IdentityServer.Servicehost.exe.config) or PTA agent files (e.g., AzureADConnectAuthenticationAgentService.exe). Flag access by non-service accounts or outside maintenance windows. Use correlation analysis to link file modifications with authentication service restarts."
          },
          "Suspicious process activity associated with authentication services, including loaded unsigned DLLs or unusual child processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for process creation and loaded modules related to AD FS (Microsoft.IdentityServer.Servicehost.exe) and PTA agent (AzureADConnectAuthenticationAgentService.exe) processes. Identify instances where unsigned or unfamiliar DLLs are loaded. Use frequency analysis to identify rare DLL loads or unusual child processes spawned by these services."
          },
          "Creation or modification of unusual scheduled tasks or services linked to hybrid identity authentication components.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4700; Windows Event ID 4702; Windows Event ID 7036; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to scheduled tasks (4698, 4700, 4702) and service state changes (7036) on AD FS/PTA servers. Look for new tasks or services associated with the user context of authentication services or privileged accounts. Use frequency analysis to identify rare task names or service names compared to baseline. Correlate with process creation events (4688) showing service control commands or task executions originating from unexpected sources."
          },
          "Outbound network connections from AD FS or PTA agent process to non-standard ports or external destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for outbound connections originating from the IP addresses of AD FS/PTA servers. Identify connections on unusual ports or to destinations outside known corporate ranges or trusted cloud endpoints. Correlate Zeek logs with Windows Event ID 5156 showing outbound connections initiated by the AD FS or PTA agent process. Use baseline analysis and statistical methods (e.g., calculating frequency of destination IPs/ports) to identify connections that deviate significantly from normal behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by modifying hybrid identity authentication? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Unusual activity logs from on-premises AD FS servers indicating policy evaluation bypass or token signing anomalies.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze AD FS Server Event Logs (including Windows Security Event ID 4624) for successful authentication events where expected policy evaluation events (AD FS specific IDs) or multi-factor authentication events are missing or out of sequence for the same session/correlation ID. Use sequence analysis or time series analysis on correlated events to detect anomalies in the authentication flow, potentially indicating policy bypass."
          },
          "Windows Event logs showing authentication service processes loading unexpected or unsigned DLLs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 logs for the AD FS (Microsoft.IdentityServer.Servicehost.exe) and PTA agent (AzureADConnectAuthenticationAgentService.exe) processes. Identify loaded modules. Compare the list of loaded DLLs against a known baseline or a list of signed/expected modules. Flag unsigned or unexpected DLLs for investigation as they may represent injected malicious code used for defense evasion."
          },
          "Network traffic patterns to the AD FS/PTA servers originating from unexpected source IPs or exhibiting unusual session characteristics immediately preceding successful logins.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections terminating at AD FS/PTA servers. Correlate these connections with successful network logon events (Windows Event ID 4624, Logon Type 3) on those servers based on timestamp and source IP. Identify source IPs that are unusual (e.g., not corporate IPs, not known trusted ranges). Use time series analysis on connection duration and volume, and use frequency analysis on source IPs to detect deviations from normal patterns immediately prior to successful logons, potentially indicating a non-standard authentication flow used for evasion."
          },
          "Access or read operations on AD FS or PTA agent configuration files or secrets by accounts other than the service account or privileged administrators during unusual hours.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Accesses: ReadData, ReadAttributes, ReadControl) on critical AD FS configuration files (e.g., Microsoft.IdentityServer.Servicehost.exe.config) or PTA agent files. Flag read access attempts by non-service accounts, standard users, or administrative accounts outside normal business hours. Use frequency analysis and time boxing to identify unusual read activity patterns on these sensitive files."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary accessing credentials via manipulated hybrid identity processes? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Network traffic patterns from the on-premises PTA agent or AD FS servers to unusual external IP addresses, potentially exfiltrating harvested credentials.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for connections originating from the on-premises PTA agent or AD FS server IP addresses to external destinations not on an approved list. Use correlation analysis to link suspicious outbound network activity with authentication service process activity (Windows Event ID 4688). Use entropy measures or statistical analysis on payload data or DNS queries for signs of encoded data or C2 communication indicative of exfiltration."
          },
          "Logs showing successful authentication attempts without standard credential validation steps, potentially indicated by unusual event sequences or missing events related to token generation bypass.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs and specific AD FS Server Event Logs for successful authentication events (Account Logon, Logon Type 3). Correlate these events with other related events in the authentication chain using session/correlation IDs if available. Identify cases where expected credential validation events or token issuance events appear abnormal, missing, or bypass standard sequences, which could indicate a manipulated authentication process generating unauthorized tokens."
          },
          "Execution of command-line tools or scripts associated with credential dumping from within the AD FS or PTA agent process context.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs on AD FS/PTA servers. Filter for child processes or command lines executed by the AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA agent (AzureADConnectAuthenticationAgentService.exe) processes. Identify command lines or processes known to be used for credential dumping or accessing sensitive memory (e.g., `tasklist` followed by network activity, suspicious use of `rundll32`, PowerShell scripts accessing security contexts). Use frequency analysis to flag rare or never-before-seen child processes or command line arguments for these services."
          },
          "Outbound network connections from the AD FS or PTA agent process occurring immediately after a successful user authentication event.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries originating from AD FS/PTA server IPs with successful authentication events (Windows Event ID 4624, Logon Type 3) on those servers using timestamp (e.g., connections within a small time window, e.g., 5 seconds, of logon). Identify outbound connections to external IPs immediately following a successful authentication. Use time series analysis to identify patterns of successful logins followed by rapid outbound communication, especially if the destination is unusual or known malicious, potentially indicating harvested credential exfiltration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]