[
  {
    "Is the adversary attempting to steal credentials using ARP cache poisoning? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1557.002 - ARP Cache Poisoning": {
          "Observation of unusual ARP traffic patterns, specifically gratuitous ARP replies announcing ownership of gateway or server IPs.": {
            "Data": "Zeek arp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek arp.log for gratuitous ARP replies. Identify gratuitous ARP replies claiming ownership of critical IPs (gateways, DNS servers, etc.). Analyze the frequency and source MAC addresses of these replies. Use descriptive statistics to identify ARP source MACs sending unexpected gratuitous replies for multiple IPs."
          },
          "Endpoint ARP caches showing multiple IP addresses resolving to a single MAC address, particularly for critical infrastructure like gateways or domain controllers.": {
            "Data": "Zeek arp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek arp.log entries over time, focusing on ARP replies. Group ARP replies by claimed IP address. Identify instances where the same IP address is claimed by different MAC addresses within a short period, or where a single MAC address claims multiple IPs. Use correlation analysis to link suspicious ARP activity to other network events (e.g., spikes in traffic volume to the poisoned IP)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary collecting sensitive data using ARP cache poisoning? (TA0009 - Collection)": {
      "Indicators": {
        "T1557.002 - ARP Cache Poisoning": {
          "Observation of unusual ARP traffic patterns, specifically gratuitous ARP replies announcing ownership of IPs for devices likely to hold sensitive data.": {
            "Data": "Zeek arp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek arp.log for gratuitous ARP replies. Identify gratuitous ARP replies claiming ownership of IPs for devices known to host sensitive data or often targeted for collection. Analyze the timing and source of these replies. Use time series analysis to detect sudden occurrences of gratuitous ARPs for these specific targets."
          },
          "Endpoint ARP caches showing multiple IP addresses resolving to a single MAC address, particularly for IPs of devices frequently accessed for sensitive data.": {
            "Data": "Zeek arp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek arp.log entries over time, focusing on ARP replies. Group ARP replies by claimed IP address. Identify instances where IPs of sensitive data hosts are claimed by unexpected MAC addresses. Calculate the entropy of MAC addresses associated with sensitive IPs; low entropy might indicate a consistent, but potentially malicious, alternate MAC. Correlate suspicious ARP mapping changes with observed network traffic patterns (e.g., redirected traffic)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]