[
  {
    "Has the adversary accessed credentials via container APIs? (TA0006 - Credential-Access)": {
      "Indicators": {
        "Anomalous access attempts or successful access to Docker API endpoints for log/container inspection.": {
          "Data": "Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek http.log for connections to Docker API ports or paths. Analyze request URLs (e.g., containing 'logs', 'containers/*/json'). Identify source IPs and analyze frequency/patterns using descriptive statistics to detect anomalies compared to baseline traffic."
        },
        "Unusual API calls to Kubernetes API server related to secrets retrieval.": {
          "Data": "Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek http.log traffic to Kubernetes API server ports (e.g., 6443, 443). Filter requests with paths related to secrets or discovery. Identify source IPs/accounts and use time series analysis or anomaly detection to flag unusual activity spikes in secrets access attempts."
        },
        "Access to specific Docker API endpoints known to expose sensitive configuration or logs.": {
          "Data": "Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Filter Zeek http.log for connections to Docker API ports/paths. Specifically identify requests for `/v1.*/containers/.*/logs`, `/v1.*/info`, or other paths known to potentially leak sensitive data. Correlate with source IP and user accounts. Use frequency analysis to identify unexpected sources accessing these paths or spikes in access volume compared to baseline."
        },
        "Kubernetes API discovery calls followed by attempts to access secrets from the same source.": {
          "Data": "Zeek http.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek http.log for requests to Kubernetes API discovery paths (e.g., `/apis/`, `/api/v1/`, `/version`). For sources (IP/account) making discovery calls, look for subsequent requests (within minutes) to secrets paths (e.g., `/api/v1/secrets`, `/apis/subresources.k8s.io/v1alpha1/pods/secrets`) from the same source. Use correlation analysis to link discovery activities with sensitive data access attempts. Flag sources exhibiting this pattern, especially if the source IP or account is unusual."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]