[
  {
    "Is the adversary forging Kerberos service tickets (Silver Tickets)? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1558.002 - Silver Ticket": {
          "Anomalous Kerberos service ticket activity detected in Windows security logs.": {
            "Data": "Windows Event ID 4769; Windows Event ID 4624; Windows Event ID 4634",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4769 (Kerberos Service Ticket operation) on KDCs. Analyze events for anomalous or malformed fields (e.g., empty fields that should contain data, unusual encryption types). Correlate service ticket requests with user activity (Event ID 4624/4634) to identify unexpected service access by users or machines, potentially using correlation analysis between event types and timestamps."
          },
          "Unexpected process access to the LSASS process on endpoints or servers.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 for handle requests to the LSASS process (lsass.exe). Filter for desired access rights associated with reading process memory (e.g., '0x14' for PROCESS_VM_READ combined with PROCESS_QUERY_INFORMATION). Identify processes other than legitimate security software or system processes accessing LSASS. Use frequency analysis or outlier detection to flag rare or unusual process access patterns."
          },
          "Successful Kerberos network logon to a service server without a corresponding Kerberos service ticket request (Event ID 4769) on a KDC.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4624 (Logon Type 3) from critical service servers and Windows Event ID 4769 from KDCs. Correlate successful Kerberos network logons (4624) with user and service principal names against recorded Kerberos service ticket requests (4769) within a specific timeframe (e.g., 5-10 minutes). Identify instances where a 4624 event with Kerberos authentication lacks a preceding or contemporaneous 4769 event for the same user/service principal pair. Use correlation analysis to quantify the rate of unlinked logons and flag statistically significant deviations from the norm."
          },
          "Network logon to a critical service server using a service account from an uncharacteristic source host or outside normal operating hours.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (Logon Type 3) on critical service servers (e.g., DCs, file servers, databases). Filter for logons authenticated using service account SIDs. Baseline the typical source hosts (SourceWorkstationName/SourceNetworkAddress) and logon times for each service account using frequency analysis and descriptive statistics. Flag logons originating from hosts or IPs not in the baseline, or occurring outside established time windows using outlier detection or time series analysis on logon timestamps."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]