[
  {
    "Has the adversary obtained credentials via credential caching? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1558.005 - Ccache Files": {
          "Attempts to access or modify files matching Kerberos ccache patterns (.krb5cc_*, .krb5.ccache) over network shares or via processes logged by Windows Event IDs (if applicable in hybrid scenarios).": {
            "Data": "Windows Event ID 4663; Zeek files.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on relevant file servers/endpoints for access attempts to files with ccache naming patterns (*krb5cc_*, *.krb5.ccache). Analyze Zeek files.log for files matching ccache patterns being transferred over the network. Look for unusual accessors (users, processes) or network destinations. Use correlation analysis to link file access/transfer events with potential network exfiltration events captured in Zeek conn.log."
          },
          "Execution of known Kerberos utility names (kinit, klist, kekeo) as logged by process creation events on Windows hosts potentially involved in a hybrid attack or related network traffic.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events matching 'kinit', 'klist', 'kekeo', or variations in the command line. Correlate process execution times with Zeek logs (conn.log, http.log) to identify potential network communication initiated by these tools, particularly looking for patterns associated with Pass-the-Ticket or C2 activity. Use frequency analysis on process execution per user/host to identify anomalous spikes."
          },
          "Detection of unusual patterns of Kerberos utility execution or attempts to access common ccache file paths on a host.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events and Event ID 4663 for file access attempts containing command line arguments or file paths referencing known Kerberos utilities ('klist', 'kinit', 'kekeo') or common ccache file patterns ('*krb5cc_*', '*.krb5.ccache', '/tmp/*'). Group events by host and user. Use frequency analysis or time series analysis to identify bursts of such activity or execution by users/processes not typically associated with Kerberos ticket management utilities."
          },
          "Anomalous Kerberos network authentication attempts originating from unexpected sources or principals, indicative of potential Pass-the-Ticket usage.": {
            "Data": "Zeek conn.log; Zeek kerberos.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek kerberos.log for authentication attempts (TGT/Service Ticket requests). Correlate with Zeek conn.log for associated network sessions. Establish baselines of normal Kerberos authentication sources (IPs, hosts), originating principals (users), and requested services using descriptive statistics and frequency analysis. Flag or score authentication events deviating significantly from the baseline (e.g., authentication from a server IP as a user who never logs into that server, or requests for highly privileged service tickets from an unexpected source/user). Use correlation analysis between source IP, user, and destination service to identify suspicious combinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]