[
  {
    "Is the adversary attempting to gain credential access using Adversary-in-the-Middle? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1557 - Adversary-in-the-Middle": {
          "Detection of unencrypted or weakly encrypted sessions (e.g., HTTP instead of HTTPS, older TLS versions) where stronger encryption was expected, potentially indicative of a downgrade attack or sniffing attempt.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for connections using deprecated TLS versions (e.g., TLS 1.0, 1.1, SSLv3) or unencrypted protocols (e.g., HTTP in Zeek conn.log) to destinations that typically enforce HTTPS. Identify the frequency and percentage of such connections for specific hosts/services. Use correlation analysis between expected protocol usage (baselined) and observed usage to flag anomalies and potential downgrade attacks."
          },
          "Unauthorized or anomalous modifications to host network configurations (e.g., DNS server settings, routing tables, ARP cache).": {
            "Data": "Windows Event ID 4688; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of network configuration utilities (e.g., 'netsh interface ipv4 set dnsserver', 'route add', 'arp -s') with parameters that could alter network flow or DNS settings. Analyze Zeek dns.log for hosts resolving legitimate internal/external names to unexpected IP addresses. Use time series analysis to detect sudden bursts or changes in config modification events on endpoints or unusual DNS query/response patterns network-wide."
          },
          "Anomalous DNS queries from multiple hosts resolving common external services to the same, unexpected internal IP address, suggesting DNS poisoning or a rogue DNS server for credential interception.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for queries to popular external domains (e.g., login.microsoftonline.com, internal portals, common banking sites) that are resolved to internal IP addresses not designated as DNS proxies or legitimate internal mirrors. Calculate the frequency of such resolutions across different client IPs. A high count of diverse clients resolving common external services to the same unexpected internal IP is highly suspicious. Use descriptive statistics (count of queries, unique client IPs per resolved suspicious IP) to identify such patterns."
          },
          "High volume of LLMNR/NBT-NS responses from a non-authoritative host, or LLMNR/NBT-NS responses resolving names to unexpected IP addresses, potentially indicating spoofing for credential capture.": {
            "Data": "Zeek conn.log; Zeek notice.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for traffic to UDP ports 5355 (LLMNR) and 137 (NBT-NS). Analyze hosts that are frequently responding to LLMNR/NBT-NS queries, especially if they are not designated name servers for the queried domains. Compare resolved IPs in LLMNR/NBT-NS responses against legitimate DNS resolutions for the same hostnames. Use frequency analysis and anomaly detection (e.g., a sudden spike in responses from one host, or responses from hosts not typically engaging in name resolution) to identify potential spoofing. Check Zeek notice.log for specific notices like `LLMNR_Spoofing_Attack` or `NBTNS_Spoofing_Attack`."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary collecting sensitive data using Adversary-in-the-Middle? (TA0009 - Collection)": {
      "Indicators": {
        "T1557 - Adversary-in-the-Middle": {
          "Unexpected network traffic flows or destinations observed for internal hosts, potentially indicating traffic redirection for sniffing.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify connections originating from internal hosts to external or unexpected internal destinations that do not align with established traffic patterns or registered services. Examine Zeek dns.log for hosts querying legitimate external domains but receiving responses pointing to suspicious internal or private IP addresses. Use clustering analysis (e.g., K-means on connection features like destination IP, port, protocol) to identify atypical traffic flows diverging from normal communication clusters."
          },
          "Network traffic patterns suggesting data exfiltration over unexpected protocols or to suspicious external destinations, possibly facilitated by AiTM redirection or manipulation.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and files.log for outbound connections carrying unexpected volumes of data, using non-standard ports/protocols for common services, or communicating with known suspicious IP addresses or domains (cross-referenced with threat intelligence). Use entropy analysis on data payloads within Zeek (if available through scripts, or on captured PCAP) to detect highly compressed or encrypted data streams potentially indicative of exfiltration. Apply statistical profiling of typical data transfer sizes and frequency per host/service to flag significant outliers."
          },
          "Unexpected SSL/TLS certificate validation errors or changes for frequently visited internal or external services, observed from network monitoring, indicating potential SSL stripping or spoofing.": {
            "Data": "Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for certificate validation statuses (e.g., `validation_status` field indicating errors like 'self_signed_certificate_in_chain', 'unable_to_get_local_issuer_cert'). Monitor Zeek x509.log for new or changed certificates for known services, especially self-signed certificates or certificates from unexpected/untrusted issuers. Use time series analysis to detect sudden increases in certificate validation errors network-wide or for specific services. Correlate these events with client IP addresses and requested server names to identify affected systems and services targeted by potential AiTM."
          },
          "An internal host anomalously acting as a central communication hub or gateway for traffic between multiple other internal hosts, without a legitimate routing or proxy function, suggesting traffic interception.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for internal-to-internal traffic flows. For each internal IP, model its communication patterns by calculating metrics like the number of unique internal peers it communicates with (degree centrality) and the volume of traffic it appears to relay (sum of inbound and outbound bytes to other internal hosts). Identify internal IPs that have an anomalously high degree of communication or act as a central hub for traffic between many other internal hosts, especially if this role is not expected (e.g., it's not a known server, proxy, or router). Use percentile-based outlier detection or graph analysis visualization to detect such central nodes potentially intercepting internal traffic."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]