```json
[
  {
    "Is the adversary establishing persistence by modifying authentication processes? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Creation or loading of a file (DLL) matching the hash or name of a known malicious authentication process modifier used for persistence.": {
            "Data": "Sysmon Event ID 1; Sysmon Event ID 7; Sysmon Event ID 11",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for file creation events (Sysmon 11) and image load events (Sysmon 7) on critical systems like Domain Controllers. Compare the file hashes and names of new DLLs in system directories against a CTI feed of known malicious tools that modify authentication for persistence (e.g., malicious LSA notification packages or password filters). Alert on any direct matches."
          },
          "Modification of specific registry keys known to control authentication processes (e.g., LSA Notification Packages, Security Packages) to add an unauthorized entry pointing to a new or suspicious DLL.": {
            "Data": "Windows Event ID 4657; Sysmon Event ID 11; Sysmon Event ID 12; Sysmon Event ID 13",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate entries in critical authentication registry keys (`HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Notification Packages`, `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Security Packages`). Monitor for any modifications (Event ID 4657, Sysmon 12/13) to these keys. Use correlation analysis to link the registry modification event with the recent creation of the referenced DLL (Sysmon 11). Flag any non-standard or unauthorized DLL paths for investigation."
          },
          "Anomalous successful login activity following a suspected authentication process modification, such as logons occurring without corresponding network authentication traffic or repeated logons by previously dormant accounts.": {
            "Data": "Windows Event ID 4624; Zeek conn.log; Zeek krb5.log; Zeek ntlm.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful interactive or network logons (Event ID 4624, Logon Types 2, 3, 10) on critical systems with preceding alerts for authentication process modifications. Hunt for logons that lack corresponding network authentication traffic in Zeek logs (e.g., a successful Kerberos logon on a server without a corresponding TGS-REQ in krb5.log). Use time-series analysis to identify accounts that become active after a long dormancy period (e.g., >90 days) and now exhibit persistent logon patterns."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses by modifying authentication processes? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Modification of the `LsaCfgFlags` registry key to a value of '2', a known selector for disabling Credential Guard.": {
            "Data": "Windows Event ID 4657; Sysmon Event ID 12; Sysmon Event ID 13",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the registry key `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa` for modifications to the `LsaCfgFlags` DWORD value (Event ID 4657, Sysmon 12/13). Create a high-priority alert specifically if this value is set to `2`, which is a documented method to disable Credential Guard. Correlate this change with the source process, user context, and subsequent system reboots."
          },
          "Loading of an unsigned or unknown DLL into a critical authentication process (e.g., `lsass.exe`, `winlogon.exe`) or modification of Group Policy Objects (GPOs) to weaken authentication security (e.g., disabling NTLMv2).": {
            "Data": "Sysmon Event ID 7; Windows Event ID 5136",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for image load events (Sysmon 7) into `lsass.exe` and `winlogon.exe`. Filter for loaded DLLs that are unsigned, have low prevalence across the environment, or are not on a known-good baseline list. Separately, monitor for GPO changes (Event ID 5136) that modify security templates related to authentication protocols (e.g., `LanManServer\\Parameters`, `MSV1_0`) to less secure configurations. Use descriptive statistics to track policy changes over time and flag anomalous modifications."
          },
          "Successful logons that appear to bypass multi-factor authentication (MFA) controls, or anomalous process access to `lsass.exe` by non-standard processes.": {
            "Data": "Sysmon Event ID 10; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful logon events (Event ID 4624) with MFA provider logs. Investigate successful logons for MFA-enforced accounts that lack a corresponding MFA success event within a short time window, which may indicate a bypass. Additionally, monitor for process access events (Sysmon 10) targeting `lsass.exe`. Profile legitimate processes (e.g., `svchost.exe`, `wininit.exe`) and alert on access from unexpected sources (e.g., `powershell.exe`, unsigned binaries in user directories), particularly those with high-risk access masks like `0x1010` (PROCESS_VM_READ and PROCESS_QUERY_INFORMATION)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary gaining credentials by modifying authentication processes? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "A file hash matching a known credential-theft tool (e.g., `memssp.dll` from Mimikatz) is written to a system directory and subsequently registered as a Security or Notification Package.": {
            "Data": "Sysmon Event ID 11; Sysmon Event ID 12; Sysmon Event ID 13",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor for file creation events (Sysmon 11) in system directories (e.g., `C:\\Windows\\System32`). Hash every new DLL file and compare it against a threat intelligence feed of known malicious password filter/notification package DLLs. If a match is found, correlate with subsequent registry modifications (Sysmon 12/13) to `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\*` keys that reference the malicious file's path. Escalate this sequence of events as a high-confidence indicator of credential theft."
          },
          "Enabling 'Store password using reversible encryption' for specific user accounts or through a GPO change, a known pattern for harvesting cleartext passwords upon the next logon.": {
            "Data": "Windows Event ID 5136; Windows Event ID 4738",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Directory Service change logs (Event ID 5136) and user account change logs (Event ID 4738) for modifications to the `userAccountControl` attribute. Specifically, alert when the flag for 'Store password using reversible encryption' is enabled. Use correlation analysis to link these changes to a specific administrative session or source host, and investigate all subsequent authentications by the affected accounts."
          },
          "An unknown or low-prevalence process writes a new DLL to disk, which is then immediately registered as an LSA Notification Package or Password Filter, indicating a potential credential harvesting setup.": {
            "Data": "Sysmon Event ID 1; Sysmon Event ID 11; Sysmon Event ID 12; Sysmon Event ID 13",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a behavioral rule that correlates events in a short time window (e.g., <1 minute): 1. A process (Sysmon 1) writes a new DLL file to disk (Sysmon 11). 2. The same process, or a child process, modifies the LSA Notification Package or Password Filter registry keys (Sysmon 12/13) to load that new DLL. Investigate the parent process, the DLL's properties (e.g., signature, entropy), and any network connections made by the process. Use a box-plot on file entropy to identify suspicious DLLs."
          },
          "Anomalous authentication traffic, such as plaintext passwords or NTLMv1 hashes being sent over the network, following a suspected modification of a security provider.": {
            "Data": "Zeek conn.log; Zeek ntlm.log; Zeek dce_rpc.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "After an alert for a potential authentication process modification, increase monitoring on related network traffic. Use Zeek to inspect NTLM authentication (ntlm.log) for downgrades to NTLMv1 or other weak protocols. While cleartext passwords are rare, some protocol interactions can expose them. Use entropy measures on connection payloads in Zeek conn.log to hunt for unencrypted credential data being exfiltrated from a compromised authentication provider. Correlate with DCE-RPC activity (dce_rpc.log) that may be used to trigger or leverage the modified process."
        }
      }
    },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```