```json
[
  {
    "Is the adversary accessing credentials stored in password managers? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1555.005 - Password Managers": {
          "Execution of processes with file hashes known to be associated with credential theft tools that target password managers, or network connections from endpoint processes to known malicious exfiltration domains.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously scan process creation events (Windows Event ID 4688) for file hashes that match a cyber threat intelligence (CTI) feed of known credential theft malware (e.g., LaZagne, Mimikatz variants). Concurrently, use Zeek conn.log to monitor for and alert on any network traffic from endpoints to destinations (IP addresses or domains) that are on a high-confidence blocklist for malware command and control (C2) or data exfiltration."
          },
          "Execution of known memory dumping utilities or scripting commands specifically targeting the process memory of common password managers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for known memory dumping tools (e.g., procdump.exe, comsvcs.dll via rundll32.exe) or scripting engines (e.g., powershell.exe, cscript.exe). Analyze command-line arguments for patterns that target the process names or IDs of common password managers (e.g., KeePass.exe, 1Password.exe, LastPass.exe, bitwarden.exe). Use regular expressions to match command-line patterns like `procdump -ma KeePass.exe` and maintain an updated list of target process names and dumper tool signatures."
          },
          "Access to known password manager database files or configuration files by unauthorized processes, such as command-line shells, scripting engines, or any process other than the legitimate password manager executable.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor object access auditing (Windows Event ID 4663) on file paths where password manager databases are typically stored (e.g., directories containing *.kdbx, *.agilekeychain, *.json files for various managers). Create a pattern-based rule to alert when any process other than the legitimate, signed password manager executable (or known legitimate backup utilities) attempts to read these files. Investigate all access by processes like cmd.exe, powershell.exe, or unsigned executables."
          },
          "Anomalous process interactions where an unusual process (e.g., a web browser, terminal, or unsigned executable) spawns, injects into, or reads memory from a running password manager process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal parent-child process relationships for known password manager applications using historical Windows Event ID 4688 data. Monitor for deviations, such as cmd.exe or powershell.exe spawning from a password manager process, or an office application spawning a script that subsequently attempts to access password manager files or processes. Use correlation analysis and frequency analysis to identify rare or never-before-seen process interaction chains involving password managers."
          },
          "Anomalous network activity originating from a password manager process or a separate process that recently accessed password manager data, characterized by connections to unusual destinations or large data transfers inconsistent with normal synchronization behavior.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file access events on password manager databases (Windows Event ID 4663) with subsequent network connections by the accessing process (monitored via Windows Event ID 5156 and Zeek conn.log). Establish a baseline for normal network traffic from password manager processes (e.g., connections to official sync servers, typical data volumes). Use time series analysis and descriptive statistics (e.g., IQR, standard deviation) to detect anomalous data transfers or connection counts. Use linear regression to model expected data transfer size based on usage and flag significant residuals as potential exfiltration."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```