
[
  {
    "Is the adversary maintaining persistence through manipulation of hybrid identities? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Detection of known malicious authentication provider DLLs or specific backdoors, by file hash or name, installed on an AD FS or PTA server.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On AD FS and PTA servers, monitor process creation events (Windows Event ID 4688) with command-line logging. Compare the file hash of the main executable (e.g., Microsoft.IdentityServer.Servicehost.exe) and its loaded DLLs against a known-good baseline. Cross-reference process names and hashes against a CTI feed of known malicious authentication backdoors or related tools. Alert on any hash mismatch or the execution of a known malicious file."
          },
          "The AD FS or PTA service process loads an unsigned DLL or a DLL from a non-standard file path, indicating a potential backdoor.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for the AD FS (Microsoft.IdentityServer.Servicehost.exe) and PTA agent (AzureADConnectAuthenticationAgentService.exe) processes. Extract all loaded modules and their file paths. Check each DLL for a valid digital signature and its location. Alert on any unsigned DLLs loaded by these critical processes or any DLLs loaded from non-standard directories (e.g., C:\\Temp, C:\\Users, C:\\Windows\\Tasks)."
          },
          "Unauthorized or anomalous modifications to AD FS configuration files, PTA agent executables, or associated registry keys.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for write access (Windows Event ID 4663) or modification (Windows Event ID 4657 for registry) on critical AD FS/PTA files (e.g., Microsoft.IdentityServer.Servicehost.exe.config) and registry keys. Correlate modifications with process creation events (Windows Event ID 4688) to identify the source. Use time series analysis to baseline modification frequency and alert on activity outside of established maintenance windows or by unauthorized user/service accounts."
          },
          "Creation of unusual scheduled tasks or services on AD FS/PTA servers designed to ensure the malicious code or configuration persists.": {
            "Data": "Windows Event ID 4698; Windows Event ID 7045",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4698 (Scheduled Task Created) and 7045 (A New Service was Installed) on AD FS/PTA servers. Analyze the task/service name, executable path, and user context. Use frequency analysis to compare against a baseline of legitimate administrative activity. Alert on the creation of tasks/services with suspicious names, paths in temporary/user directories, or those configured to run with high privileges, as they may be used to reload a malicious authentication provider."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses by modifying hybrid identity authentication? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Execution of commands or tools on AD FS/PTA servers known to be used for disabling security logging or tampering with event collection.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on AD FS/PTA servers for command-line execution of tools like 'wevtutil.exe cl' (to clear logs), 'auditpol.exe' (to change audit policy), or PowerShell cmdlets like 'Clear-EventLog' or 'Set-NetFirewallRule -Enabled False'. Alert on the execution of these specific commands, especially when initiated by non-standard administrative contexts or suspicious parent processes, as this is a strong indicator of defense evasion."
          },
          "A successful authentication event is logged without corresponding Multi-Factor Authentication (MFA) or conditional access policy evaluation events that are normally expected for the user or context.": {
            "Data": "Windows Event ID 4624; AD FS Auditing Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each successful AD FS login (e.g., Windows Event ID 4624 with specific AD FS details), correlate events using the session/correlation ID. Define patterns for valid authentication sequences (e.g., login attempt -> MFA challenge -> MFA success -> token issued). Alert on sequences where a successful token issuance event occurs without a preceding MFA success event for a user who is required to use MFA. Use correlation analysis to detect these broken patterns."
          },
          "Anomalous authentication patterns, such as a sudden, statistically significant drop in MFA challenges or a spike in successful authentications from a specific source, indicating a potential bypass of security controls.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate and analyze AD FS and Azure AD authentication logs. Use time series analysis to monitor the ratio of successful logins to MFA challenges over time. Alert on a sudden, statistically significant drop in this ratio. Similarly, use time series analysis on successful authentications (Windows Event ID 4624) grouped by source IP (from Zeek conn.log or event data) to detect a sudden spike from a new or previously low-activity source, which may indicate a successful bypass of IP-based or other conditional access policies."
          },
          "Anomalous read access on AD FS or PTA agent configuration files or secrets by accounts other than the designated service account, especially outside normal maintenance windows.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for read access ('ReadData', 'ReadAttributes') on critical AD FS configuration files or PTA agent files. Baseline normal access patterns by the legitimate service accounts. Use descriptive statistics and frequency analysis to alert on read access by other accounts (e.g., standard users, unexpected admin accounts) or by service accounts at highly anomalous times, which could indicate reconnaissance for a defense evasion technique."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary accessing credentials via manipulated hybrid identity processes? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.007 - Hybrid Identity": {
          "Outbound network connections from an AD FS or PTA server to an IP address or domain known to be associated with credential theft or command and control (C2) infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and dns.log for all outbound connections and DNS queries originating from AD FS and PTA server IP addresses. Inner join the destination IPs and queried domains against a high-confidence CTI feed of known malicious infrastructure, updated at least daily. Alert on any match, as this could represent direct exfiltration of credentials or a C2 channel from a compromised authentication provider."
          },
          "The AD FS or PTA service process spawns a child process or uses command-line arguments associated with known credential dumping techniques, such as accessing LSASS memory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On AD FS/PTA servers, monitor Windows Event ID 4688 for child processes created by 'Microsoft.IdentityServer.Servicehost.exe' or 'AzureADConnectAuthenticationAgentService.exe'. Use regular expressions to search command lines for patterns indicative of credential dumping tools (e.g., 'sekurlsa::logonpasswords', 'Invoke-Mimikatz', arguments to 'rundll32.exe' targeting 'comsvcs.dll', 'procdump.exe -ma lsass.exe'). Maintain and update a list of such patterns and flag any matches for immediate investigation."
          },
          "An anomalous process accesses the memory of the AD FS or PTA service process, indicative of an attempt to steal credentials, session tokens, or cryptographic keys held in memory.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable auditing for process object access (SACL) on the AD FS ('Microsoft.IdentityServer.Servicehost.exe') and PTA ('AzureADConnectAuthenticationAgentService.exe') processes. Monitor Windows Event ID 4656 for access attempts with 'PROCESS_VM_READ' permissions. Correlate these events with process creation logs (Event ID 4688) to identify the source process. Use frequency analysis to baseline normal inter-process access (e.g., from system processes) and alert on rare or unauthorized processes (e.g., powershell.exe, cmd.exe, any non-system process) accessing the memory of these critical services."
          },
          "Anomalous outbound network traffic from an AD FS or PTA server immediately following a series of successful user authentications, potentially indicating real-time credential exfiltration.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful authentication events (Windows Event ID 4624, Logon Type 3) on AD FS/PTA servers with outbound network connections (Zeek conn.log) from those servers. Trigger an alert if an outbound connection to an unusual or low-reputation external destination occurs within a short time window (e.g., 1-10 seconds) after a successful logon. Use time series analysis and correlation to identify patterns where bursts of successful logins are followed by corresponding bursts of outbound data transfer, which could indicate batch exfiltration of harvested credentials."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
