[
  {
    "Has the adversary accessed cloud instance metadata for credentials? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.005 - Cloud Instance Metadata API": {
          "Network connections or process activity querying the Instance Metadata API IP address (169.254.169.254) from within a cloud instance.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections where destination IP is 169.254.169.254. Analyze source IPs and ports. Filter Windows Event ID 4688 (Process Creation) and potentially Sysmon Event IDs (e.g., 3, 4) on cloud instances for processes initiating connections to 169.254.169.254. Look for connections from unexpected processes, users, or instances that haven't been authorized to interact with the metadata API. Use frequency analysis to identify rare source processes or instances connecting to the API compared to typical behavior."
          },
          "Network connections or access logs showing unusual or unauthorized requests targeting public-facing services that result in internal connections to the Instance Metadata API IP.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for internal connections originating from public-facing application hosts where the destination is 169.254.169.254. Correlate these internal connections with external requests received by the public-facing service (if available and within scope of Zeek logs). Look for anomalous patterns in the external requests preceding the internal API calls (e.g., unusual query parameters, high volume from single source). Use correlation analysis to link suspicious external request characteristics to internal API calls."
          },
          "Unusual query parameters or HTTP methods used when accessing the Instance Metadata API (169.254.169.254).": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for HTTP requests where the host is 169.254.169.254. Analyze the `method` and `uri` fields of these requests. Identify and flag requests using HTTP methods other than GET (if not expected) or requests to specific sensitive URIs (e.g., `/latest/meta-data/iam/security-credentials/`, `/latest/user-data`, or `/latest/meta-data/instance-profile/`). Use frequency analysis on the `uri` paths to identify rarely accessed paths, potentially indicating exploration for sensitive data."
          },
          "Outbound network connections from the cloud instance to cloud provider API endpoints immediately following access to the Instance Metadata API, potentially using temporary credentials.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing internal connections from an instance to 169.254.169.254 with subsequent outbound connections from the same instance to known cloud provider API endpoints (e.g., identified via Zeek dns.log for domains like *.amazonaws.com, *.core.windows.net, *.googleapis.com). Monitor Windows Event ID 5156 (Windows Filtering Platform Connection) for outbound connections from the instance process. Use time series analysis to identify anomalous bursts or unexpected patterns of outbound cloud API traffic occurring shortly after metadata API access."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]