[
  {
    "Is the adversary maintaining persistence via modified network device authentication? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.004 - Network Device Authentication": {
          "Repeated successful authentication to network devices via unusual methods or protocols not typically used.": {
            "Data": "Zeek ssh.log, Zeek telnet.log, Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log, telnet.log, or conn.log for connections to network device administration ports. Identify sessions using unusual or unapproved protocols. Use descriptive statistics to baseline protocol usage to these ports and flag outliers."
          },
          "Successful logins to network devices from unexpected source IP addresses or during unusual time periods, potentially bypassing multi-factor authentication or standard access controls.": {
            "Data": "Zeek ssh.log, Zeek telnet.log, Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log, telnet.log, or conn.log for successful connections to network devices. Identify source IP addresses and connection timestamps. Identify rare source IPs by frequency analysis or percentiles. Use time series analysis to detect successful logins outside normal business hours or during unexpected intervals."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses through network device authentication modifications? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.004 - Network Device Authentication": {
          "Connections to network device administrative ports from hosts that previously had multiple failed authentication attempts.": {
            "Data": "Zeek ssh.log, Zeek telnet.log, Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts making multiple failed authentication attempts (Zeek ssh.log, telnet.log) to network devices. Correlate these with subsequent successful connections from the same source IP using a different method or immediately after the failures (Zeek conn.log). Use correlation analysis to link failed attempts and unexpected successes."
          },
          "Connections to network device administration interfaces (SSH, Telnet, etc.) from internal hosts that bypass standard bastion host or access list restrictions.": {
            "Data": "Zeek ssh.log, Zeek telnet.log, Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log, telnet.log, or conn.log for connections to network device administration ports originating from internal hosts. Compare source IPs against expected administration hosts or subnets. Use frequency analysis of source IPs connecting to admin ports to identify unusual sources."
          }
        }
      }
    }
  },
  {
    "Is the adversary accessing credentials or bypassing authentication on network devices? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.004 - Network Device Authentication": {
          "Authentication attempts to network devices using invalid credentials immediately followed by successful access using a different method or with no further authentication log.": {
            "Data": "Zeek ssh.log, Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssh.log and telnet.log for authentication events. Identify sequences where failed authentication attempts from a source IP are immediately followed by a successful authentication from the same source IP, potentially using a different username or method, or where the successful authentication log looks anomalous (e.g., unexpected user). Correlate failure events (e.g., auth_success=false) with success events (auth_success=true) within a short time window."
          },
          "Suspiciously short session durations on network devices after successful authentication, followed by connections to other internal resources.": {
            "Data": "Zeek conn.log, Zeek ssh.log, Zeek telnet.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ssh.log, or telnet.log for sessions to network devices. Calculate session duration. Identify sessions with unusually short durations (e.g., using IQR or percentiles). Correlate short sessions originating from network devices with subsequent connection activity to other internal hosts (visible in Zeek conn.log) using correlation analysis."
          }
        }
      }
    }
  }
]