[
  {
    "Is the adversary maintaining persistence on the domain controller via patched authentication? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.001 - Domain Controller Authentication": {
          "Calls to OpenProcess targeting lsass.exe on a domain controller from unusual processes or contexts.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 on domain controllers for handle requests to lsass.exe (Object Type 'Process', Object Name containing 'lsass.exe'). Identify source processes and process IDs. Analyze frequency and entropy of source processes accessing lsass. Flag requests from processes other than legitimate system processes or security software. Use frequency analysis to identify rare source processes."
          },
          "Consistent successful logins for multiple accounts from a single source or unusual times, inconsistent with normal user behavior across systems.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 on domain controllers. Group successful logons by source IP and account name. Identify source IPs associated with logons for a high diversity of accounts (using entropy of account names per source IP). Analyze logon timestamps over time for accounts/source IPs using time series analysis or percentile analysis to spot consistent out-of-hours activity or sudden changes in logon frequency/timing."
          },
          "Repeated successful interactive logons to the domain controller from accounts that do not typically perform interactive logons.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 on domain controllers for Logon Type 2 (Interactive), 7 (Unlock), or 10 (RemoteInteractive). Baseline historical logon types per account on DCs. Flag successful interactive logons by accounts with no historical interactive logon activity on DCs or with a very low frequency using descriptive statistics and frequency analysis."
          },
          "Successful network logons to multiple systems across the network originating from the domain controller itself, using non-service accounts.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 events across servers and endpoints. Filter for Logon Type 3 (Network) events where the Source Workstation/IP is a domain controller's address. Identify non-service accounts used for these network logons originating from the DC by filtering out common service account names. Use correlation analysis to identify accounts and destination systems frequently accessed this way, deviating from normal DC behavior baselines."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by patching domain controller authentication? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.001 - Domain Controller Authentication": {
          "Modification events targeting authentication-related system DLLs (cryptdll.dll, samsrv.dll) on a domain controller.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on domain controllers for write access attempts (Accesses 'WriteData (or AddFile)') targeting the file paths of cryptdll.dll and samsrv.dll. Identify the process name and user attempting the modification. Correlate with process creation events (Event ID 4688) to understand the source executable and its command line."
          },
          "Successful logins occurring for an account when the user has no physical or VPN access, or simultaneous logins from disparate locations/systems.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4624 (successful logins) on domain controllers with network connection logs (Zeek conn.log) based on timestamp, source IP, and destination IP (domain controller). Identify login events where the source IP does not correlate with expected physical presence or VPN access based on other systems/logs. Use correlation analysis to link login events on the DC to network sessions originating from potentially unauthorized sources."
          },
          "Creation of processes or execution of scripts that interact with lsass.exe memory or authentication DLLs, particularly from unusual locations or by unusual users.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on domain controllers. Analyze command lines and parent-child relationships for processes interacting with lsass.exe memory or known authentication DLL paths (e.g., via specific tools or scripts). Flag processes with suspicious command lines, unexpected parent processes, or running under unusual user accounts for such interactions. Use frequency analysis and white/blacklisting of known system processes/commands."
          },
          "Outbound network connections from authentication-related processes or injected code on a domain controller to external or unusual internal destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections originating from domain controllers to external IPs or unusual internal destinations. If available, correlate with Windows Event ID 5156 or process monitoring (Windows Event ID 4688 if command line shows network interaction) to identify the source process/PID on the DC initiating the connection. Analyze connections originating from sensitive processes (like lsass.exe) or associated with potential code injection for connections to known malicious infrastructure or unexpected endpoints. Use correlation analysis to link network sessions to specific processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary accessing credentials or accounts via patched domain controller authentication? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.001 - Domain Controller Authentication": {
          "Detection of a single account logged into multiple systems simultaneously or multiple accounts logged into the same machine simultaneously.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 events across all relevant systems (DCs, servers, endpoints). Group successful logons by account name and timestamp. Identify instances where a single account appears to logon to multiple distinct systems within a short timeframe (e.g., impossible concurrent logons based on timestamps) or where multiple distinct accounts logon to the exact same system simultaneously. Use correlation analysis to identify accounts/systems exhibiting this pattern."
          },
          "Successful logins from locations or systems geographically or logically impossible for the legitimate user to access concurrently.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 (successful logons). Extract source IP addresses and timestamp for each successful logon. Geolocate source IPs. For each account, calculate the 'travel speed' or distance required between consecutive logons from different geolocations. Flag logons requiring impossible travel speeds based on timestamps. Use descriptive statistics (min/max time between logons per account, distance between locations) and outlier analysis to identify anomalies."
          },
          "Rapid, successful logons to a large number of distinct systems using a single account within a short timeframe, especially if the account normally accesses only a limited set of resources.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 across the environment. Group successful logons by account name and timestamp. For each account, count the number of distinct destination systems logged into within a rolling time window (e.g., 1 hour). Flag accounts showing an unusually high count of distinct destination systems compared to their historical behavior. Use descriptive statistics (mean, standard deviation of systems accessed per account per time period) or percentile analysis to identify outliers."
          },
          "Authentication events to sensitive resources (e.g., domain controller shares, critical servers) using accounts that do not have administrative or legitimate access to those resources.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor successful network logons (Event ID 4624, Type 3), interactive logons (Type 10), and object access events (Event ID 4656/4663) targeting critical servers or domain controller shares. Maintain a baseline or perform analysis to understand which accounts legitimately access these resources. Flag successful authentication/access attempts by accounts outside the normal set for that resource. Use correlation analysis to link access attempts to potentially unauthorized accounts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]