[
  {
    "Has the adversary attempted to collect credentials using LLMNR/NBT-NS poisoning and SMB relay? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1557.001 - LLMNR-NBT-NS Poisoning and SMB Relay": {
          "Traffic observed on LLMNR (UDP 5355) or NBT-NS (UDP 137) ports when disabled or unexpected responses.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for UDP traffic on ports 5355 and 137. Correlate with network configuration policies (e.g., if LLMNR/NBT-NS is disabled). Analyze traffic volume and source/destination IPs. Calculate frequency of traffic on these ports over time using time series analysis to detect anomalies."
          },
          "Detection of NTLMv2 hash capture attempts or suspicious SMB relay traffic.": {
            "Data": "Zeek smb.log, Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smb.log and conn.log for SMB traffic patterns indicative of relay attempts (e.g., connections from unexpected sources, authentication attempts without prior session setup). Look for high frequency connection attempts to internal IPs from single or few sources using descriptive statistics."
          }
        }
      }
    }
  },
  {
    "Is the adversary collecting information via LLMNR/NBT-NS poisoning and SMB relay? (TA0009 - Collection)": {
      "Indicators": {
        "T1557.001 - LLMNR-NBT-NS Poisoning and SMB Relay": {
          "Evidence of captured NTLMv2 hashes or successful authentication via relayed credentials.": {
            "Data": "Windows Event ID 4624, Zeek smb.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful network logons (Windows Event ID 4624 on target systems) with suspicious SMB traffic identified in Zeek logs (Zeek smb.log). Analyze logon source IPs and times for patterns inconsistent with normal behavior. Use correlation analysis between suspicious network events and successful logons from those sources."
          },
          "Installation of suspicious services or changes related to SMB relay tooling.": {
            "Data": "Windows Event ID 4697, Windows Event ID 7045",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4697 (Service Installation) and 7045 (Service Control Manager) on endpoints and servers. Filter for service names, file paths, or command lines associated with known LLMNR/NBT-NS poisoning or SMB relay tools. Analyze frequency of service changes across hosts using descriptive statistics to find outliers."
          }
        }
      }
    }
  }
]