[
  {
    "Is the adversary evading defenses using stolen web session cookies? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550.004 - Web Session Cookie": {
          "Successful authentication to web services or cloud applications without expected multi-factor authentication prompts.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and ssl.log for connections to critical web services/cloud applications. Identify sessions where authentication appears successful (based on subsequent requests) but originates from an IP not associated with expected MFA flows or devices. Use time series analysis to detect unexpected session initiations from unusual sources."
          },
          "Access to sensitive cloud data or web application features by a user from an unexpected IP address or device.": {
            "Data": "Zeek http.log, Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log/ssl.log for user activity (if identifiable via headers/cookies/URLs) accessing sensitive paths or features within web applications from unexpected source IPs or with unusual user-agent strings. Use correlation analysis to link anomalous source IPs to specific user session activity."
          }
        }
      }
    }
  },
  {
    "Is the adversary moving laterally using stolen web session cookies? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550.004 - Web Session Cookie": {
          "Concurrent access to the same web service/cloud app by the same user from geographically distant locations or from different, unusual systems.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and http.log/ssl.log entries by apparent user session (if possible via traffic analysis or correlation with internal logs not listed). Identify sessions showing activity from multiple, geographically disparate source IPs or unusual user-agent strings within a short timeframe. Use geographic analysis and frequency analysis of user agents to identify anomalies."
          },
          "Accessing web/cloud resources under another user's identity via session cookie, exhibiting activity inconsistent with the legitimate user's typical behavior.": {
            "Data": "Zeek http.log, Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log/ssl.log for sessions accessing web/cloud resources under a specific user's identity. Compare the pattern of accessed URLs, volume of traffic, and connection times within that session against the legitimate user's established baseline using descriptive statistics and time series analysis to identify anomalous behavior indicating potential lateral movement or misuse of the session."
          }
        }
      }
    }
  }
]