[
  {
    "Is the adversary attempting to evade defenses by modifying code signing policies? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1553.006 - Code Signing Policy Modification": {
          "Execution of commands used to disable or modify code signing policies.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for specific command-line arguments associated with disabling/modifying code signing (e.g., 'bcdedit.exe -set TESTSIGNING ON', 'csrutil disable'). Identify the process, parent process, and user associated with suspicious command execution. Calculate the frequency of such commands across the environment and flag rare occurrences using descriptive statistics or percentile analysis."
          },
          "Modifications to Windows Registry keys controlling code signing policies.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (A registry value was modified) for modifications to critical registry keys related to code signing policy (e.g., HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\CI\\Policy, HKCU\\Software\\Policies\\Microsoft\\Windows NT\\Driver Signing). Identify the process and user making the modification. Analyze the rate of modifications to these specific keys across endpoints/servers over time and flag any activity using time series analysis or correlation with other security events."
          },
          "Loading of an unsigned driver or executable following a system reboot or policy modification event.": {
            "Data": "Windows Event ID 5038; Windows Event ID 4688; Windows Event ID 7045; Windows Event ID 7026",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5038 (Code Integrity checks) for validation failures or warnings related to unsigned or self-signed code. Correlate these events with system boot events (e.g., Event ID 1005 or system startup events) or detected policy modification events. Monitor Windows Event ID 4688 (Process Creation) configured to include signature status; identify execution of unsigned images. Monitor Windows Event ID 7045 (Service Installation) for driver loads and Event ID 7026 for Driver Signature Enforcement status. Use time series analysis to spot bursts of code integrity failures or unsigned code executions following system state changes."
          },
          "Execution of processes or loading of modules associated with kernel memory modification for policy bypass.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of known tools, scripts, or processes associated with kernel memory modification utilities or specific kernel exploitation techniques. Monitor Windows Event ID 7045 (Service Installation) for the loading of specific drivers known to be vulnerable and potentially used for kernel exploitation to bypass code signing enforcement (cross-reference against threat intelligence). Use correlation analysis to identify instances where a known vulnerable driver is loaded shortly before a process attempts suspicious kernel-level operations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]