```json
[
  {
    "Is the adversary evading defenses using application access tokens? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550.001 - Application Access Token": {
          "API access to cloud/SaaS services using tokens originating from IP addresses or containing User-Agents known to be associated with malicious activity or token abuse tools.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join source IP addresses and User-Agent strings from API calls observed in Zeek logs (http.log, conn.log) with high-confidence cyber threat intelligence (CTI) feeds of malicious IPs and known User-Agents of adversary tools (e.g., pacu, gds-tools, specific Python requests versions used in malware). Alert on any confirmed matches and investigate the scope of the API session."
          },
          "Execution of processes or scripts on an endpoint known to be used for stealing browser cookies or local application data that may contain access tokens.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) that indicate execution of tools known to steal tokens (e.g., Mimikatz, LaZagne, custom PowerShell scripts accessing browser SQLite databases). Correlate the execution of such tools with subsequent anomalous outbound API calls from the same host. Maintain a list of suspicious process names and command-line patterns (e.g., powershell.exe accessing Chrome 'User Data' directory, cscript.exe running token-dumping VBS scripts)."
          },
          "Anomalous API usage patterns inconsistent with a user's or application's established baseline, including access from a new or impossible-to-travel-to geolocation, use of a rare User-Agent, or access without a recent interactive login.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile normal API access for each user/service account, establishing baselines for source IP geolocation, User-Agent strings, and time-of-day using historical Zeek logs. Use statistical methods (e.g., IQR, percentile analysis on geo-locations) to detect significant deviations. Implement 'impossible travel' detection by correlating API access timestamps and geolocations. Flag API calls from a user account that has no recent preceding interactive login event (Windows Event ID 4624) from the source IP using correlation analysis."
          },
          "Anomalous interaction with cloud identity services (e.g., AWS STS, Azure AD, GCP IAM), such as an unusual frequency of temporary token requests or requests for roles with abnormally high privileges.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for requests to cloud identity service endpoints (e.g., sts.amazonaws.com, login.microsoftonline.com/oauth2/token). Establish a baseline for the frequency, source, and type of token requests per user/role. Use time series analysis to detect unusual spikes in requests (e.g., AssumeRole, GetSessionToken). Analyze requested role privileges against a baseline of normal activity for that user/role and flag requests for excessive permissions not typically associated with the user's function."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary performing lateral movement using application access tokens? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550.001 - Application Access Token": {
          "API calls made from a compromised cloud resource (e.g., EC2 instance, Azure VM) to another service using hardcoded credentials or authorization tokens matching known malicious indicators.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor east-west traffic (Zeek conn.log, http.log) between cloud resources. Correlate traffic with CTI feeds for known malicious destination IPs/domains or known-bad authorization tokens/API keys if available from threat intelligence and deep packet inspection is possible. Investigate API calls from one resource to another that are not part of an established, legitimate workflow."
          },
          "Execution of known internal reconnaissance or lateral movement tools on a host immediately following suspicious API activity or from a process spawned by a service that handles API requests.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate suspicious inbound API activity (from Zeek conn.log) to a host with subsequent process creation events (Windows Event ID 4688) on that same host. Look for the execution of reconnaissance tools (`nltest.exe`, `net.exe`, `whoami.exe`), remote access tools (`psexec.exe`), or credential dumping frameworks. Define and monitor for a specific sequence of events, such as: 1) Inbound suspicious API call to host X, followed within minutes by 2) Host X spawning `powershell.exe` which then 3) executes commands associated with PowerSploit or other lateral movement frameworks."
          },
          "A cloud resource or service account, accessed via an application token, begins accessing other internal network segments or cloud resources it has never interacted with before.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a baseline of normal network connections for key cloud resources and service accounts (e.g., which internal subnets an EC2 instance communicates with). Monitor Zeek conn.log for new 'first-time' connections from these resources to other internal IP ranges, sensitive servers (e.g., domain controllers), or different cloud services. Use graph analysis to visualize and detect anomalous edges in the communication graph. Correlate with successful network logons (Windows Event ID 4624, Logon Type 3) on the target hosts originating from the cloud resource."
          },
          "An application token associated with a specific user or application is used to perform high-privilege actions in a cloud environment that are inconsistent with its normal function, such as creating new admin accounts, modifying network security groups, or deleting logs.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Assuming API traffic is inspectable, monitor API calls (via Zeek http.log) for high-impact actions (e.g., IAM `CreateUser`, EC2 `ModifySecurityGroup`, S3 `PutBucketPolicy`, CloudTrail `DeleteTrail`). Establish a baseline of which users/roles normally perform these actions. Use entropy measures to detect an account suddenly performing a much wider variety of actions than normal. Flag any high-impact action performed by a user or service account for which this action is not typical, especially if it follows other suspicious activity identified for the same user token."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```