
[
  {
    "Is the adversary attempting to steal credentials using Kerberoasting? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1558.003 - Kerberoasting": {
          "Execution of processes with command-line arguments or process names specific to known Kerberoasting tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs across endpoints and servers. Use a regularly updated list of selectors to search for process names (e.g., `rubeus.exe`, `GetUserSPNs.py`) and command-line arguments (e.g., `kerberoast`, `-request`, `-spn`, `invoke-kerberoast`) specifically associated with known Kerberoasting tools. Alert on any exact match and treat as a high-fidelity indicator of an active attack."
          },
          "A pattern of Kerberos TGS service ticket requests (Event ID 4769) using weak RC4_HMAC_MD5 encryption (Type 0x17), a common artifact of Kerberoasting tools.": {
            "Data": "Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On Domain Controllers, filter Windows Event ID 4769 logs for events where the 'Ticket Encryption Type' field is '0x17'. While some legacy systems may use RC4, requests from user workstations are highly suspicious. Correlate the requesting 'Account Name' and 'Client Address' with user roles and expected behavior. A high volume of these requests from a single source or a source that has never made them before significantly increases suspicion. Use frequency analysis to identify rare or first-time RC4 requesters."
          },
          "Anomalous, high-volume requests for Kerberos service tickets (TGS-REQ) from a single user account or source host, indicating a potential enumeration and collection attempt.": {
            "Data": "Windows Event ID 4769; Zeek kerberos.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Kerberos ticket requests by 'Account Name' (from Event ID 4769) and 'client' IP (from Zeek kerberos.log). For each entity, establish a baseline for the count of unique Service Names requested within a time window (e.g., 5 minutes). Use statistical analysis (e.g., Inter-Quartile Range (IQR), z-score, or percentile-based thresholding) to detect significant deviations from the norm. A single account or host requesting hundreds of unique service tickets in a short period is a strong behavioral indicator of Kerberoasting. A box-plot of unique requests per account can visually identify outliers."
          },
          "An account requesting a Kerberos service ticket for a high-value or unusual Service Principal Name (SPN) inconsistent with the user's normal role-based activity.": {
            "Data": "Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a categorized list of SPNs, identifying those associated with high-value services (e.g., `MSSQLSvc`, `krbtgt`, admin accounts) or those that are rarely accessed. Profile normal access patterns by creating a user-to-SPN access graph from historical Event ID 4769 data. Use this model to flag requests where a user account attempts to access an SPN for the first time, or accesses a high-value SPN that is inconsistent with their established behavioral profile or job function. Use correlation analysis to link these anomalous requests to other suspicious user activities occurring around the same time."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
