[
  {
    "Has the adversary accessed private cryptographic keys or certificates? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.004 - Private Keys": {
          "Access or modification of known private key/certificate file extensions or directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access attempts (read/write/delete) on files matching known private key/certificate extensions (.key, .pem, .pfx, etc.) or within common key directories (~/.ssh, C:\\Users\\*\\ .ssh). Identify access by unusual user accounts or processes. Calculate baseline access frequency for these files/directories and flag deviations using statistical methods (e.g., Z-score or IQR on access count per user/host)."
          },
          "Anomalous authentication activity using keys or certificates, or network traffic consistent with key misuse.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek ssh.log; Zeek ssl.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 and 4625 logs for successful or failed logins from accounts or systems that typically use certificate-based authentication. Look for logins from unexpected source IPs or at unusual times. Analyze Zeek logs (ssh.log, ssl.log, conn.log) for connections authenticated via certificates/keys, identifying connections to unusual destinations or unusual traffic patterns (e.g., using entropy analysis on payloads or correlation analysis with other network events)."
          },
          "Execution of processes known to copy or archive files (e.g., certutil, tar, zip, copy, powershell) targeting known private key/certificate files or directories.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of processes like `certutil.exe`, `tar.exe`, `zip.exe`, `copy.exe`, `powershell.exe` with command-line arguments (`CommandLine` field in 4688) indicating interaction with files/directories matching known key/certificate patterns (.key, .pem, ~/.ssh, C:\\Users\\*\\.ssh, etc.). Correlate with Windows Event ID 4663 showing relevant access rights (e.g., `%%4416` - FILE_READ_DATA, `%%4417` - FILE_WRITE_DATA, `%%4420` - FILE_DELETE) on the targeted files/directories by the same process or user. Use correlation analysis to link process execution with file access events."
          },
          "Unusual outbound network connections (especially SSH or TLS) from systems containing private keys, potentially indicative of key exfiltration or remote access using stolen keys.": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek ssl.log",
            "Data Platform": "Network devices; Servers; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound connections from critical systems known to store private keys (e.g., servers, specific user endpoints). Filter for common remote access ports (e.g., SSH 22) or generic high-port connections. Analyze Zeek ssh.log for successful/failed SSH authentications using keys or certificates (check `auth_method`, `authentication_text`). Analyze Zeek ssl.log for outbound TLS connections with unusual certificate patterns (e.g., self-signed, unknown). Use frequency analysis to identify rare destination IPs/ports or time series analysis to detect spikes in connection volume or duration, especially from sources not typically establishing such outbound links. Use correlation analysis to link successful key-based logins (from Zeek ssh.log) to subsequent data transfer (Zeek conn.log, `resp_bytes`, `orig_bytes`)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]