```json
[
  {
    "Is the adversary using signed code to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1553.002 - Code Signing": {
          "Execution of a binary with a file hash or signing certificate thumbprint known to be associated with malicious activity.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1). For every executed binary, extract its file hash (e.g., SHA256) and its signing certificate thumbprint. Compare these values in real-time against a high-confidence threat intelligence feed of known-malicious hashes and compromised certificate thumbprints. An alert on any match represents a high-fidelity indicator of malicious activity and should be investigated immediately."
          },
          "Execution of a binary signed by a certificate authority (CA) that is not part of the standard enterprise trust store or has a subject name that mimics legitimate software.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline list of approved Certificate Authorities (CAs) and common legitimate software publishers. Monitor process execution (Sysmon Event ID 1 provides rich certificate data) and extract the 'Issuer' and 'Subject' for each signed binary. Flag any binary signed by a CA not on the approved list. Additionally, use correlation analysis with fuzzy string matching or Levenshtein distance calculations to detect certificate subjects that are slight variations of legitimate software publishers (e.g., 'Micosoft Corporation', 'Google Inc.')."
          },
          "Execution of a binary signed with an unusual, newly-issued, or self-signed certificate not associated with legitimate internal development.": {
            "Data": "Windows Event ID 4688; Windows Event ID 3002; Windows Event ID 3004; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Sysmon Event ID 1) and Code Integrity events (Windows Event IDs 3002, 3004) to extract certificate details. Establish a baseline for common certificate issuers and typical validity periods in the environment. Use descriptive statistics and frequency analysis to flag outliers, such as: certificates issued within the last 30-90 days, certificates from issuers seen for the first time, or certificates where the issuer and subject are identical (self-signed) and not on an explicit allow list for internal software."
          },
          "A signed binary executing from an atypical file path, such as a temporary directory, user profile folder, or network share.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1). For every executed signed binary, extract the full execution path. Establish a baseline of standard execution paths for legitimate software (e.g., 'C:\\Program Files\\', 'C:\\Windows\\System32\\'). Flag all signed binaries executing from user-writable directories like '%TEMP%', '%APPDATA%', '%LOCALAPPDATA%', 'C:\\Users\\Public\\', or temporary network shares. Use frequency analysis on execution paths of signed binaries to identify rare or unique locations which require investigation."
          },
          "A signed binary performing suspicious post-execution activities, such as establishing network connections to rare domains, modifying persistence mechanisms, or spawning unsigned child processes.": {
            "Data": "Sysmon Event ID 1; Sysmon Event ID 3; Sysmon Event ID 12; Sysmon Event ID 13; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate the execution of signed binaries (Sysmon EID 1) with subsequent system activities within a short time window. Analyze parent-child process relationships to detect when a signed parent launches an unsigned or suspiciously named child process. Use correlation analysis to link process execution with network connections (Sysmon EID 3, Zeek conn.log) to low-reputation or newly-registered domains. Monitor for signed processes making modifications to persistence-related registry keys (Sysmon EID 12, 13) or creating scheduled tasks."
          },
          "The same signed binary appearing across multiple, unrelated endpoints concurrently or exhibiting synchronized execution patterns, indicative of a coordinated deployment.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate process creation events (Windows Event ID 4688, Sysmon Event ID 1) from all endpoints into a central location. Group events by file hash and signing certificate thumbprint. Identify instances where the same signed binary executes on a statistically significant number of distinct endpoints within a short timeframe (e.g., >10 hosts in <5 minutes). Use time series analysis or standard deviation calculations on execution timestamps across the fleet to detect near-simultaneous execution patterns characteristic of automated deployment tools."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```