[
  {
    "Is the adversary attempting to gain credential access using Adversary-in-the-Middle? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1557 - Adversary-in-the-Middle": {
          "Detection of unencrypted or weakly encrypted sessions (e.g., HTTP instead of HTTPS, older TLS versions) where stronger encryption was expected, potentially indicative of a downgrade attack or sniffing attempt.": {
            "Data": "Zeek ssl.log, Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for connections using deprecated TLS versions or unencrypted protocols (e.g., HTTP) to destinations that typically use HTTPS. Identify the frequency and percentage of such connections for specific hosts/services. Use correlation analysis between expected protocol usage and observed usage to flag anomalies."
          },
          "Unauthorized or anomalous modifications to host network configurations (e.g., DNS server settings, routing tables, ARP cache).": {
            "Data": "Windows Event ID 4688, Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of network configuration utilities (e.g., 'netsh', 'route', 'arp') with parameters that could alter network flow or DNS settings. Analyze Zeek dns.log for hosts resolving legitimate internal/external names to unexpected IP addresses. Use time series analysis to detect sudden bursts or changes in config modification events or DNS query patterns."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary collecting sensitive data using Adversary-in-the-Middle? (TA0009 - Collection)": {
      "Indicators": {
        "T1557 - Adversary-in-the-Middle": {
          "Unexpected network traffic flows or destinations observed for internal hosts, potentially indicating traffic redirection for sniffing.": {
            "Data": "Zeek conn.log, Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify connections originating from internal hosts to external or unexpected internal destinations that do not align with expected traffic patterns or registered services. Examine Zeek dns.log for hosts querying legitimate external domains but receiving responses pointing to suspicious internal or external IPs. Use clustering analysis on connection patterns to identify atypical traffic flows."
          },
          "Network traffic patterns suggesting data exfiltration over unexpected protocols or to suspicious external destinations, possibly facilitated by AiTM redirection or manipulation.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and files.log for outbound connections carrying unexpected volumes of data, using non-standard ports/protocols, or communicating with known suspicious IP addresses or domains (cross-referenced with threat intelligence). Use entropy analysis on data streams to detect highly compressed or encrypted data being exfiltrated. Apply statistical profiling of typical data transfer sizes and frequency to flag outliers."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]