[
  {
    "Is the adversary establishing persistence by modifying authentication processes? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Suspicious modifications to authentication-related configuration files or registry keys (e.g., LSA Notification Packages, PAM configurations).": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663; Sysmon Event ID 11; Sysmon Event ID 12; Sysmon Event ID 13",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor relevant registry keys (e.g., Lsa\\Notification Packages) and PAM configuration files for modifications (Event ID 4657, Sysmon 12/13). Investigate any new or changed entries, correlating with file creation events (Sysmon 11) for referenced DLLs. Use descriptive statistics to baseline typical changes and flag outliers."
          },
          "Unusual account activity patterns inconsistent with normal user behavior (e.g., simultaneous logins from one account, logins at odd hours).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze login logs (Event ID 4624, 4625, Zeek conn.log) across multiple systems for a single account. Identify instances where an account is logged into more than one system concurrently or logs in from disparate locations/times within a short period. Use statistical correlation analysis or time series analysis to identify anomalous login sequences or concurrent sessions per account."
          },
          "Creation of new, unfamiliar DLL files on systems containing authentication processes, especially on domain controllers, that are subsequently referenced in authentication configuration.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4657; Sysmon Event ID 1; Sysmon Event ID 11; Sysmon Event ID 12; Sysmon Event ID 13",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for new file creations (Sysmon 1) or modifications (Event ID 4656) of executable files (.dll, .exe) in sensitive system directories on domain controllers (e.g., System32). Correlate these events with subsequent registry modifications (Event ID 4657, Sysmon 12/13) that reference the newly created/modified file path, specifically within authentication-related keys (e.g., Lsa\\Notification Packages). Investigate files with high entropy."
          },
          "Persistent successful logons to critical systems (e.g., domain controllers, key servers) using previously inactive or less privileged accounts, especially originating from unexpected sources.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor successful logon events (Event ID 4624) on critical servers (domain controllers, etc.). Identify logons by accounts that have been inactive for a significant period or whose typical activity doesn't involve these systems. Use time series analysis to detect persistent, recurring logons from specific source IPs (from Zeek conn.log correlation) or at unusual times (e.g., outside business hours) for these accounts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by modifying authentication processes? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Detection of unknown or suspicious DLL files loaded into critical authentication processes (e.g., lsass.exe) or referenced by authentication configuration.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 7; Sysmon Event ID 10; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process image loads (Sysmon 7) for lsass.exe. Compare loaded DLLs against a baseline of known legitimate modules. Investigate any unknown or newly loaded DLLs, especially those referenced in LSA/PAM configurations (Event ID 4657)."
          },
          "Unauthorized or suspicious changes to Group Policy or Active Directory settings related to authentication (e.g., reversible encryption enabled).": {
            "Data": "Windows Event ID 4742; Windows Event ID 4738; Windows Event ID 5136; Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Directory Service (Event ID 5136) and account/group policy changes (Event ID 4742, 4738). Specifically alert on changes to 'Store passwords using reversible encryption' or execution logs for relevant PowerShell cmdlets (Set-ADUser, Set-ADAccountControl). Use descriptive statistics or regression analysis to track historical policy changes and identify anomalous modifications."
          },
          "Execution of processes attempting to open critical authentication processes (like lsass.exe) with suspicious access rights (e.g., PROCESS_VM_READ, WRITE) from unexpected sources.": {
            "Data": "Sysmon Event ID 10; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process access events (Sysmon 10, Windows Event ID 4663) targeting lsass.exe and similar critical processes. Alert on access requests from non-standard processes or users, particularly those requesting rights like `ReadVirtualMemory`, `WriteProcessMemory`, `CreateRemoteThread`. Use frequency analysis or deviation from baseline to identify unusually high rates of access attempts from specific sources."
          },
          "Anomalous network traffic patterns to/from authentication service ports on domain controllers, potentially indicating malicious interaction or bypass attempts.": {
            "Data": "Zeek krb5.log; Zeek ldap.log; Zeek ntlm.log; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs for authentication protocols (krb5.log, ldap.log, ntlm.log) and generic connections (conn.log) to/from domain controllers on standard ports (e.g., TCP/UDP 88, 464, 389, 636, 445, 139, 3268, 3269). Use time series analysis to detect sudden spikes or changes in traffic volume, source IPs (especially external or unusual internal subnets), or authentication failures/success ratios. Analyze correlation between unusual traffic and known host/account activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary gaining credentials by modifying authentication processes? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Modifications to LSA Notification Packages or other password filter configurations referencing suspicious or unknown DLLs.": {
            "Data": "Windows Event ID 4657; Sysmon Event ID 12; Sysmon Event ID 13; Sysmon Event ID 7",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor registry modifications to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Notification Packages (Event ID 4657, Sysmon 12/13). Correlate changes with Sysmon Event ID 7 (ImageLoaded) for the DLL specified. Investigate the origin and integrity of the referenced DLL file using methods like entropy measures to assess file content randomness."
          },
          "Suspicious attempts to open or interact with critical authentication processes like lsass.exe using methods like OpenProcess.": {
            "Data": "Windows Event ID 4663; Sysmon Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process access attempts (Sysmon 10, Event ID 4663) targeting critical authentication processes like lsass.exe. Alert on suspicious access types (e.g., PROCESS_VM_READ, PROCESS_VM_WRITE) from non-standard processes or users. Use frequency analysis or statistical outliers detection to identify unusually high rates of access attempts from specific sources."
          },
          "Unauthorized enabling of 'Store passwords using reversible encryption' policy or direct modification of user account attributes allowing reversible encryption.": {
            "Data": "Windows Event ID 4742; Windows Event ID 4738; Windows Event ID 5136; Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5136 (Directory Service Changes), 4738 (User Account Changed), 4742 (Computer Account Changed) on Domain Controllers for modifications related to password settings, specifically 'msDS-SupportedEncryptionTypes' or the useraccountcontrol flags that enable reversible encryption. Alert immediately if reversible encryption is enabled for any user or via GPO (Event ID 4657 for registry equivalent). Audit user and group settings regularly, using correlation analysis to link policy changes to potential credential compromise."
          },
          "Sudden, widespread use of credentials across the network for lateral movement or access to sensitive data following a suspected authentication modification event.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor successful logon events (Event ID 4624) and network connections (Zeek conn.log) indicative of lateral movement (e.g., RDP, SMB, WinRM) across multiple systems. Use time series analysis to detect unusual spikes in successful logons or connections using specific accounts or from specific source IPs. Correlate these patterns with other alerts (e.g., file modifications on DCs, process access attempts) that might indicate an authentication modification technique was recently employed."
        }
      }
    },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]