[
  {
    "Is the adversary maintaining persistence using a malicious network provider DLL? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.008 - Network Provider DLL": {
          "Registry key modification or creation associated with registering a new network provider DLL.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications or creations in HKLM\\System\\CurrentControlSet\\Control\\NetworkProvider\\Order or HKLM\\System\\CurrentControlSet\\Services\\<NewServiceName>\\NetworkProvider. Identify unusual DLL paths or service names. Baseline normal registry changes using frequency analysis and flag deviations."
          },
          "Unexpected network provider DLL loaded by system processes or processes related to authentication (mpnotify.exe).": {
            "Data": "Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Sysmon Event ID 7 (Image loaded) for `mpnotify.exe` or other system processes loading DLLs not typically associated with legitimate network providers (e.g., not in System32 or with known legitimate names). Identify rare DLL loads by these processes using frequency analysis or entropy measures on the DLL file if available."
          },
          "Persistent network connections to suspicious external locations originating from systems targeted by T1556.008, potentially for C2 or data exfiltration.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for persistent or recurring outbound connections from hosts identified via other T1556.008 indicators (registry changes, DLL loads). Identify connections to known malicious IPs or unusual ports/protocols using correlation analysis with threat intelligence feeds. Use time series analysis to detect persistent connections established over time from these hosts."
          },
          "System processes (like mpnotify.exe) consistently loading an unusual or newly created DLL across multiple logon events on targeted systems.": {
            "Data": "Windows Event ID 7; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Sysmon Event ID 7 (Image loaded) filtered for processes `mpnotify.exe`, `lsass.exe`, `winlogon.exe`. Identify instances where these processes load DLLs located in unusual paths or having low frequency of occurrence across the network. Correlate persistent loading of specific suspicious DLLs with successful logon events (Event ID 4624) on the affected hosts using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by using a malicious network provider DLL? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.008 - Network Provider DLL": {
          "Creation or modification of executable files (DLL) in system directories or unexpected locations, potentially associated with network providers.": {
            "Data": "Windows Event ID 11",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation events (Sysmon Event ID 11) in system directories (e.g., C:\\Windows\\System32) or user directories for new .dll files. Analyze file entropy for newly created/modified DLLs using entropy measures to identify potentially packed or obfuscated malware attempting to evade detection."
          },
          "Unexpected changes to network provider-related registry keys outside of standard software installations or updates.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor changes to the NetworkProvider registry keys (HKLM\\System\\CurrentControlSet\\Control\\NetworkProvider and subkeys) via Windows Event ID 4657. Establish a baseline of expected values using descriptive statistics and flag any deviations from known legitimate configurations, potentially identifying covert persistence or evasion mechanisms."
          },
          "Executable files (DLLs) with high entropy or known malicious characteristics found in standard system directories, potentially disguised as legitimate network providers.": {
            "Data": "Windows Event ID 11",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 11 (File created) in system directories (`C:\\Windows\\System32`, etc.) for `.dll` files. Calculate file entropy for newly created DLLs using entropy measures. Flag DLLs exceeding a high entropy threshold (>0.75) or matching known malicious file hashes (IOCs) via correlation analysis. Correlate with registry changes (Event ID 4657) in NetworkProvider keys."
          },
          "Suspicious DNS queries or network connections originating from processes loading the suspected malicious network provider DLL, potentially used for C2 or exfiltration while masquerading as legitimate traffic.": {
            "Data": "Zeek dns.log; Zeek conn.log; Windows Event ID 7",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Sysmon Event ID 7 (Image loaded) for suspicious DLLs loaded by system processes (`mpnotify.exe`, `lsass.exe`) with Zeek dns.log and conn.log from the same host. Identify DNS queries for newly seen domains or known malicious domains (using frequency analysis or threat intelligence), and unusual outbound connections (non-standard ports, IPs with low reputation) via correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary capturing credentials using a malicious network provider DLL? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.008 - Network Provider DLL": {
          "Suspicious process activity, particularly mpnotify.exe interacting with newly registered or unusual DLLs during logon events.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation (Event ID 4688) and image load (Sysmon Event ID 7) events. Identify instances where `mpnotify.exe` loads or interacts with DLLs identified as suspicious via other indicators (registry changes, file creation). Correlate these events with logon success/failure events (Windows Event ID 4624/4625)."
          },
          "Network traffic from affected hosts potentially containing cleartext credentials or exfiltrated data patterns indicative of credential theft.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, http.log) from hosts showing other T1556.008 indicators. Look for unusual outbound connections to external IPs, especially those transmitting data over non-standard ports or in cleartext protocols (e.g., HTTP POST). Use correlation analysis to link suspicious network flows to logon events or process activity on the host, looking for unusual data volumes."
          },
          "Suspicious file write events or network connections initiated by the loaded network provider DLL process itself, potentially indicating credential staging or exfiltration.": {
            "Data": "Windows Event ID 11; Windows Event ID 3; Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Sysmon Event ID 7 (Image loaded) for suspicious DLLs with Sysmon Event ID 11 (File created) or Sysmon Event ID 3 (Network connection) where the suspicious DLL's process is the source. Look for credential-like file names being created (`.txt`, `.log`, `.csv`) in unusual directories or outbound network connections to suspicious destinations using correlation analysis. Focus on activities immediately following logon events (Windows Event ID 4624)."
          },
          "Clusters of successful logon events (especially administrative logons) occurring on systems where a suspicious network provider DLL has been loaded or registered.": {
            "Data": "Windows Event ID 4624; Windows Event ID 7; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts where suspicious T1556.008 activity (DLL load via Event ID 7, Registry modification via Event ID 4657) is detected. Monitor Windows Event ID 4624 on these hosts for clusters of logon events, especially those involving privileged accounts. Use time series analysis or statistical clustering to identify unusual spikes or concentrations of logons correlated in time with the suspicious DLL activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]