[
  {
    "Is the adversary maintaining persistence using a malicious password filter DLL? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.002 - Password Filter DLL": {
          "Creation of new files with DLL extensions in system directories (e.g., C:\\Windows\\System32, SysWOW64) on Servers/Domain Controllers.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on target directories (requires SACL on C:\\Windows\\System32, SysWOW64). Identify new files with .dll extension by comparing file hashes or names against known good lists. Use frequency analysis on file creation events in these directories per host to identify rare occurrences (low frequency or outliers using box-plots)."
          },
          "Registry key modification to add or change a value under HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Notification Packages.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Notification Packages. Baseline normal modifications (if any) using descriptive statistics on frequency and timestamps. Alert on deviations from the baseline and correlate with Event ID 4688 to identify the process and user account performing the modification."
          }
        }
      }
    }
  },
  {
    "Is the adversary using a malicious password filter DLL to evade detection? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.002 - Password Filter DLL": {
          "Registry key modification to Lsa\\Notification Packages originating from a process or user account not typically associated with system configuration changes.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for LSA key modifications. Correlate with Event ID 4688 to identify the process name and user account. Establish a baseline of processes/users that legitimately modify this key. Use correlation analysis to identify unusual process/user combinations modifying this key that fall outside the baseline."
          },
          "Attempted file write operations to protected system directories (e.g., System32) on Servers/Domain Controllers by non-SYSTEM accounts.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on system directories (requires SACL) on Servers/Domain Controllers. Filter for write operations. Correlate with logon events (Event ID 4624) to determine the user session. Calculate the frequency of write attempts by different user account types in these directories and identify outliers using box-plots or percentiles."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting to collect credentials using a malicious password filter DLL? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.002 - Password Filter DLL": {
          "Creation of new files with DLL extensions specifically on Domain Controllers in system directories.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on system directories on Domain Controllers (requires SACL). Identify new files with .dll extension by comparing file hashes or names against known good lists. Use frequency analysis on file creation events in these directories on DCs to identify rare occurrences (low frequency or outliers)."
          },
          "Registry key modification to Lsa\\Notification Packages specifically on Domain Controllers.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Notification Packages on Domain Controllers. Baseline normal modifications and alert on deviations. Analyze the process (via Event ID 4688 correlation) and user account performing the modification using descriptive statistics on modification timestamps and source process/user."
          }
        }
      }
    }
  }
]