[
  {
    "Is the adversary maintaining persistence by manipulating conditional access policies? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.009 - Conditional Access Policies": {
          "Successful login events bypassing expected multi-factor authentication requirements from external locations.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 and Zeek conn.log for successful logins from external sources. Correlate with expected MFA requirements (if logged or inferable). Use time series analysis or frequency analysis to identify successful logins occurring from external IPs that should have required MFA based on baseline or policy assumptions."
          },
          "Persistent successful login activity from IP addresses not previously seen or associated with legitimate remote access, potentially enabled by added 'trusted' IP ranges.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify source IPs for successful logins in Windows Event ID 4624 and Zeek conn.log over time. Use descriptive statistics (frequency) and potentially correlation analysis (IP vs time/account) to identify persistent successful logins from IP addresses with low historical frequency or those known not to belong to standard remote access pools."
          },
          "Successful logins associated with devices marked as non-compliant or untrusted, potentially bypassing device-based conditional access.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful login events (Windows Event ID 4624, Zeek conn.log) with available information about source device compliance or trust status (if logged or inferable). Identify successful logins from devices explicitly logged as non-compliant or untrusted that should have been denied access based on policy. Use correlation analysis to link login events to device status."
          },
          "Recurring successful logins from IP addresses belonging to known VPN or proxy services or unusual residential/commercial ranges for a specific user account, potentially indicating a manipulated IP range for persistence.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify source IP addresses for successful logins (Windows Event ID 4624, Zeek conn.log). Classify IPs based on type (VPN, proxy, residential, commercial) using threat intelligence feeds. Analyze specific user accounts for recurring successful logins originating from unusual or suspicious IP types (e.g., residential IP for a corporate account). Use frequency analysis per user/IP type to identify deviations from normal behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by manipulating conditional access policies? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.009 - Conditional Access Policies": {
          "Successful authentication from geographic regions or countries previously blocked or flagged as high risk.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Geolocate source IPs from Windows Event ID 4624 and Zeek conn.log. Calculate frequency distribution of source countries/regions. Identify successful logins originating from geographic locations with historically zero or very low login frequency, or locations explicitly expected to be blocked by policy. Use percentiles to identify outliers in geographic login sources."
          },
          "Access attempts to sensitive internal resources originating from external IPs via standard protocols (e.g., RDP, SMB over VPN/open ports) that should be restricted by policy.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to sensitive internal resource IPs/ports from external source IPs that should be blocked by policy (e.g., RDP/SMB from outside VPN). Correlate Zeek logs with successful Windows Event ID 4624 logins from the same source IPs on target servers. Use simple filtering or correlation analysis to identify policy violations."
          },
          "Successful logins from IP addresses or conditions (e.g., unusual timing, impossible travel) that would normally trigger risk-based access policies or require additional verification.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze successful logins (Windows Event ID 4624, Zeek conn.log). Look for login patterns indicative of high risk, such as impossible travel (successive logins from geographically distant locations in a short time, use correlation analysis on user, timestamp, geolocated IP). Flag logins with conditions that should have triggered risk-based policies based on normal behavior profiles or expected checks but resulted in access."
          },
          "Successful access or API calls to sensitive applications/resources from external or untrusted locations that should be restricted by policy.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to internal application servers or sensitive APIs from external source IPs. Correlate with Windows Event ID 4624 on target servers for successful logins or specific application logs if available. Identify successful access attempts to resources explicitly defined as restricted from external/untrusted sources in security policies using simple filtering or correlation analysis based on destination IP/port and source IP."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary facilitating credential access utilization by manipulating conditional access policies? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.009 - Conditional Access Policies": {
          "High volume of successful logins using a single compromised account from multiple disparate external IP addresses within a short timeframe, possibly due to MFA removal.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and Zeek conn.log for single user accounts authenticating successfully from multiple, geographically disparate IP addresses within a short time window. Calculate the number of unique IPs per user per time unit (e.g., hour) and flag accounts with high entropy in source IP addresses or sudden spikes using statistical thresholds."
          },
          "Successful access using compromised credentials to resources (e.g., shared drives, specific applications) from unexpected external locations, which was previously blocked by location-based policies.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4624 and Zeek conn.log for successful logins to specific critical assets/servers from external source IPs. Geolocate source IPs. Identify and investigate access to critical assets from geographic locations that are unexpected or outside of permitted policy locations, using frequency analysis or simple filtering."
          },
          "Successful logins using a compromised account from a device or location that previously consistently failed device compliance checks or geo-location restrictions.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For accounts suspected of compromise, review historical login attempts (Windows Event ID 4624, 4625, Zeek conn.log). Identify devices or source IP locations that previously resulted in access denied (4625) or required additional verification, but are now allowing successful access (4624) without those checks. Use correlation analysis based on account, source IP, and timestamps to identify policy bypasses for compromised accounts."
          },
          "Successful logins using legacy or restricted protocols (e.g., older RDP versions, specific API endpoints) from external locations, which should have been denied by policy.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for successful connections using legacy or restricted protocols (e.g., specific RDP protocol versions, NTLM authentication traffic) from external source IPs. Correlate with Windows Event ID 4624 (Logon Type) on target servers for successful network logons via these protocols. Identify successful access using protocols that are expected to be blocked from external sources based on security policy using simple filtering based on protocol/port and source IP."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]