[
  {
    "Is the adversary evading defenses using application access tokens? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550.001 - Application Access Token": {
          "Connections to SaaS/Cloud service APIs from internal or unexpected sources, potentially bypassing normal authentication flows.": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections to known SaaS/Cloud provider API endpoints. Identify connections originating from internal hosts that do not match typical user access patterns or expected service-to-service communication. Use correlation analysis to link these connections to specific hosts or users, especially if no preceding interactive authentication is observed."
          },
          "Network connections to sensitive SaaS/Cloud service APIs that do not follow typical interactive user login patterns.": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for successful connections to sensitive services. Compare connection patterns (source IP, time, protocol, user agent) against established baselines. Identify connections that occur without associated interactive login events or from IPs/user agents not typically used for interactive access, using time series analysis or outlier detection."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary performing lateral movement using application access tokens? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550.001 - Application Access Token": {
          "Unusual network connections initiated from a host/account compromised via token access, targeting internal resources.": {
            "Data": "Zeek conn.log, Windows Event ID 4624, Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Investigate Zeek conn.log for new or unusual internal network connections originating from hosts recently seen connecting to cloud/SaaS APIs. Correlate with Windows Event ID 4624/4688 on those hosts to identify processes or login activity potentially initiated via API access, using sequence analysis of events."
          },
          "Network traffic originating from hosts or network segments indicative of cloud API interaction, especially if associated with unexpected accounts or services.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to cloud provider API endpoints (e.g., AWS STS endpoints, GCP API endpoints). Identify unexpected source IPs or user agents. Monitor for connections to newly provisioned resources (visible in Zeek logs if internal hosts connect to them) and correlate with potential API calls triggering provisioning. Use frequency analysis to spot unusual volumes or types of API calls from specific sources."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]