```json
[
  {
    "Is the adversary attempting to obtain credentials from password stores? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1555 - Credentials from Password Stores": {
          "Execution of a process with a file hash matching a known credential theft tool.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (A new process has been created) across all systems. Extract the file hash of every new process. Compare these hashes against a continuously updated threat intelligence feed of file hashes for known credential theft tools (e.g., Mimikatz, LaZagne, ProcDump, etc.). Generate a high-priority alert for any match."
          },
          "Process execution with command-line arguments containing specific parameters or strings used by known credential dumping tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events and inspect the full command line text. Use regular expression matching to search for known credential dumping commands and arguments, such as 'sekurlsa::logonpasswords', 'lsadump::sam', 'vault::cred', 'kerberos::list', or references to specific browser profile paths combined with access flags. Maintain and regularly update this list of suspicious patterns based on public threat reporting."
          },
          "An unusual or non-standard process accessing file system locations known to store credentials for web browsers, applications, or the Windows Credential Manager.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable SACLs (System Access Control Lists) to generate Windows Event ID 4663 (An attempt was made to access an object) for read access on credential store locations (e.g., browser SQLite files like 'Login Data', KeePass '.kdbx' files, paths like `%APPDATA%\\Microsoft\\Credentials\\*`). Establish a baseline of legitimate processes that normally access these files (e.g., chrome.exe, firefox.exe, keepass.exe). Alert when any process not on this baseline (e.g., powershell.exe, rundll32.exe, or any unsigned/rare binary identified via frequency analysis) attempts to read these files. Correlate the 4663 event with the process creation event (4688) for the accessing process to get full context."
          },
          "A process not on an established baseline requesting memory read access to the LSASS (Local Security Authority Subsystem Service) process.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure the system audit policy to log process object access, generating Windows Event ID 4656 (A handle to an object was requested). Monitor for events where the 'Object Name' corresponds to the lsass.exe process and the 'Accesses' list includes '0x1010' (Read attributes and Read memory). Create and maintain a baseline of legitimate system processes and security tools authorized to access LSASS memory. Alert on any process requesting this access that is not on the established baseline. Use descriptive statistics on the frequency of access requests per process name to identify anomalies."
          },
          "Correlation of a read event on a credential store file with a subsequent, anomalous network connection originating from the same host, suggesting exfiltration.": {
            "Data": "Windows Event ID 4663; Zeek conn.log; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate a file read event (Windows Event ID 4663) on a known credential store file (e.g., 'logins.json', '.kdbx') with subsequent network connections from the same host within a short time window (e.g., 1-5 minutes) using Zeek conn.log data. Analyze the subsequent network connection for behavioral anomalies such as connections to rare external IP addresses (identified via frequency analysis), communication over non-standard ports, or connections to known file-sharing services. If available, inspect Zeek files.log for file transfers where the filename or size matches the accessed credential store. Use correlation analysis to link the file read event to the network transmission based on host and timestamp."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```