[
  {
    "Is the adversary attempting to bypass security controls by subverting trust mechanisms? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1553 - Subvert Trust Controls": {
          "Installation or modification of unusual or untrusted root certificates or trust providers on systems.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4670 (Permissions change) and 4663 (Object Access) for attempts to modify system certificate stores (e.g., registry paths or files) or trust provider files/registry keys. Baseline normal certificate/trust provider configurations on endpoints and servers. Use correlation analysis to link modification events to unusual processes or user accounts."
          },
          "Modification of file attributes (e.g., Zone.Identifier) or creation of anomalous entries in auto-start locations that are not signed by trusted entities.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file attribute modifications on executable files, specifically looking for changes to Zone.Identifier. Monitor Windows Event ID 4688 for process creation events originating from common autorun locations (e.g., Startup folders, Run registry keys). Baseline expected processes starting from these locations. Identify rare or never-before-seen processes using frequency analysis. Analyze process command lines and parent processes for anomalies using descriptive statistics."
          },
          "Execution of software signed with unusual or newly observed code signing certificates.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Collect and baseline the signing certificate details (Signature, SignatureStatus) for all executed processes over time. Identify processes signed by certificates that are new to the environment or have an unusual SignatureStatus (e.g., 'invalid', 'untrusted', 'expired'). Use frequency analysis to identify rare or unique certificates used for signing executables. Investigate processes signed by suspicious certificates."
          },
          "Execution of system utilities with command-line arguments targeting system certificate stores, trust providers, or relevant registry keys related to trust.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events involving system utilities known to interact with certificates or registry (e.g., `certutil.exe`, `reg.exe`, `powershell.exe`). Filter for specific command-line arguments indicative of certificate store modification (`addstore`, `delstore`, `importPFX`), trust provider manipulation, or changes to relevant registry paths (e.g., those under `HKLM\\SOFTWARE\\Microsoft\\Cryptography`). Use frequency analysis to identify uncommon argument combinations or usage patterns for these utilities. Correlate with user account information to identify unauthorized use."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]