
[
  {
    "Is the adversary attempting to gain access to credentials via the Registry? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.002 - Credentials in Registry": {
          "Execution of tools with file hashes known for registry-based credential dumping or queries for specific, hardcoded registry keys targeted by known malware.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously compare file hashes from process creation events (Windows Event ID 4688) against a threat intelligence feed of known credential dumping tools (e.g., Lazagne, Mimikatz registry module). If registry access auditing is enabled, monitor Windows Event ID 4663 for access to specific, hardcoded registry keys known to be targeted by malware for credentials (e.g., `HKCU\\Software\\Martin Prikryl\\WinSCP 2\\Sessions`, `HKCU\\Software\\SimonTatham\\PuTTY\\Sessions`). Alert on any confirmed matches."
          },
          "Execution of command-line or script-based registry queries using common utilities (reg.exe, PowerShell) to search for credential-related keywords or target known application credential storage locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process command lines (Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104) for patterns indicative of credential hunting. Use regular expressions to search for: 1) `reg.exe` or PowerShell cmdlets (`Get-ItemProperty`, `Get-ChildItem -Recurse`) combined with keywords like 'password', 'pwd', 'privatekey', 'credentials', 'api_key'. 2) Queries targeting known software registry paths for stored credentials (e.g., `VNC`, `PuTTY`, `FileZilla`, `WinSCP`, `mRemoteNG`). Calculate the frequency of such commands across the enterprise and use descriptive statistics to flag statistical outliers."
          },
          "An unusual process or user account querying registry keys known to store application credentials, deviating from established baselines.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal processes and user accounts that access common credential-related registry keys (e.g., PuTTY.exe accessing its own keys, an admin running a backup script). Monitor for process creation (Event ID 4688) or direct registry access (Event ID 4663) where the querying process or user context is anomalous. For instance, `WINWORD.EXE`, `CHROME.EXE`, or a temporary service account querying VNC or RDP credential keys is highly suspicious. Use frequency analysis and baselining to identify rare process-key or user-key interaction pairs."
          },
          "A sequence of events where a host performs suspicious registry queries for credentials, followed shortly by a successful logon or network connection using a different or privileged account.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlated alert for the following sequence: 1) A suspicious registry query event (based on the Pattern or Behavioral detections above) is logged on a host via Event ID 4688 or 4104. 2) Within a short time window (e.g., 1-15 minutes), a successful logon (Event ID 4624, Logon Type 2, 3, or 10) occurs on that same host or another host. 3) Alternatively, an outbound network connection (Zeek conn.log) is made from the host to a sensitive internal service (e.g., database, another server via RDP/WinRM). Use correlation analysis to link these events by hostname/IP and timestamp, prioritizing alerts where the subsequent logon uses a different or more privileged account than the one that performed the query."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
