[
    {
        "information_requirement": "Has the adversary attempted to gain credentials using an Evil Twin attack?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1557.004",
                "name": "Evil Twin",
                "evidence": [
                    {
                        "description": "Connection to a rogue Wi-Fi access point whose BSSID, SSID, or associated SSL certificate thumbprint matches a known malicious indicator.",
                        "data_sources": [
                            "Zeek wifi.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain and query a threat intelligence list of known malicious BSSIDs, SSIDs used in Evil Twin campaigns, and SSL certificate thumbprints associated with fake captive portals. Monitor Zeek wifi.log for device connections to these BSSIDs/SSIDs. Monitor Zeek ssl.log for certificates matching the malicious thumbprints. Alert on any match."
                    },
                    {
                        "description": "Detection of network traffic patterns or captive portal characteristics matching known Evil Twin frameworks (e.g., specific HTTP headers, URI structures, captive portal HTML content).",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek wifi.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log for HTTP requests and responses associated with captive portals. Use regular expressions to search for signatures of known Evil Twin tools (e.g., unique `Server` headers, specific URI paths like `/login.php`, hidden form fields, or JavaScript files). Correlate with Zeek wifi.log to link these patterns to newly joined, suspicious BSSIDs. Maintain a library of these tool-specific patterns."
                    },
                    {
                        "description": "A corporate device connects to a BSSID broadcasting a trusted corporate SSID that has not been previously observed or is not on an approved list for that physical location.",
                        "data_sources": [
                            "Zeek wifi.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a baseline of known, legitimate BSSIDs for each corporate SSID by physical location. Monitor Zeek wifi.log for device probe requests and associations. Alert when a device associates with a BSSID that is not on the approved list for its location but is broadcasting a trusted SSID. Use frequency analysis and descriptive statistics to identify rare BSSID-SSID-location combinations."
                    },
                    {
                        "description": "Anomalous DNS or ARP activity observed immediately after a device connects to an untrusted Wi-Fi network, suggesting traffic redirection for a Man-in-the-Middle attack.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek arp.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "After a device connects to a new or untrusted BSSID (identified via Zeek wifi.log), monitor Zeek dns.log for DNS responses that map well-known domains (e.g., office.com, corporate login pages) to unexpected, private, or suspicious IP addresses. Monitor Zeek arp.log for gratuitous ARP responses or ARP cache poisoning attempts. Use correlation analysis to link these events to subsequent connections (Zeek conn.log) to suspicious IPs posing as legitimate services."
                    },
                    {
                        "description": "A user is presented with a login portal over an unencrypted (HTTP) connection or a connection using a self-signed or invalid SSL certificate after joining a Wi-Fi network.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek http.log for traffic from recently connected devices to URIs containing keywords like 'login', 'auth', 'portal', 'signin'. Flag any such pages served over HTTP. Analyze Zeek ssl.log for connections to these portals that use self-signed certificates, certificates with mismatched common names, or certificates from untrusted CAs (using the `validation_status` field). Use descriptive statistics to find an anomalous increase in these events across the network."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Has the adversary collected data using an Evil Twin attack?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1557.004",
                "name": "Evil Twin",
                "evidence": [
                    {
                        "description": "Outbound network connections from a device on a suspicious Wi-Fi network to IP addresses or domains known to be malicious C2 servers or data exfiltration endpoints.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "After a device connects to a suspected Evil Twin AP, continuously monitor its outbound traffic. Inner join destination IPs from Zeek conn.log and queried domains from Zeek dns.log against a high-confidence CTI feed of known C2 and exfiltration points. Alert immediately on any matches."
                    },
                    {
                        "description": "Data exfiltration over DNS or HTTP using patterns consistent with known info-stealer malware or data collection tools.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log for anomalous query patterns from a device on a suspicious network, such as unusually long subdomains (indicative of DNS tunneling) or a high volume of TXT record queries. Analyze Zeek http.log for large HTTP POST requests with unusual content types or URL structures that match signatures of data exfiltration from known info-stealers. Use entropy measures on DNS query names and frequency analysis of query types to spot deviations from normal traffic."
                    },
                    {
                        "description": "A significant and anomalous volume or type of data is transferred from a device shortly after it connects to a suspicious Wi-Fi network.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline for typical outbound data transfer volume and file types for devices. After a device connects to a suspected Evil Twin network, monitor its outbound data transfers using Zeek conn.log (total bytes) and Zeek files.log (file types and sizes). Use time series analysis or statistical methods like Inter-Quartile Range (IQR) on data volume to detect anomalous spikes in traffic. Flag transfers of sensitive file types (e.g., .pst, .kdbx, archives) that are unusual for the user or device."
                    },
                    {
                        "description": "Traffic from a device on a suspicious Wi-Fi network is observed being transparently proxied or decrypted, indicated by downgraded encryption or injected content.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek ssl.log for connections from a device on a suspicious network where the SSL/TLS version is unexpectedly downgraded (e.g., from TLS 1.3 to TLS 1.2) or the cipher suite is weak. Examine Zeek http.log for unexpected content injection (e.g., JavaScript files, ads, iframes) into web pages, suggesting a transparent MitM proxy is active. Correlate these findings to identify devices whose traffic is actively being manipulated for data collection."
                    },
                    {
                        "description": "A device on a suspicious Wi-Fi network initiates broad scanning of its local network segment or attempts to connect to other devices on the same untrusted subnet.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "After a device connects to a suspected Evil Twin AP, monitor Zeek conn.log for that device initiating connections to a large number of other IPs or ports within the same subnet. This behavior can indicate the attacker is using the compromised device to collect information about other victims on the malicious network. Use frequency analysis and descriptive statistics to flag any device acting as a scanner (e.g., high connection rate, high count of distinct destination ports/IPs within the subnet)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
