[
    {
        "information_requirement": "Is the adversary bypassing host defenses using Mark-of-the-Web bypass techniques?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1553.005",
                "name": "Mark-of-the-Web Bypass",
                "evidence": [
                    {
                        "description": "Download of container files (e.g., ISO, VHD, RAR) with known malicious file hashes, or from network locations (IPs/domains) known to distribute malware.",
                        "data_sources": [
                            "Zeek files.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek files.log to compute hashes (e.g., SHA256) of all downloaded container files (.iso, .vhd, .img, .rar, .zip, .7z, .gz). Correlate these hashes against a CTI feed of known malicious file hashes. Separately, analyze Zeek http.log to correlate source IPs and hostnames of downloaded container files against CTI feeds of malicious infrastructure. Alert on any confirmed matches."
                    },
                    {
                        "description": "An office productivity application (e.g., Outlook, Word) or web browser spawning a process that subsequently mounts a disk image or extracts a container file.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) to track process lineage. Identify chains where a parent process is an Office application (winword.exe, outlook.exe, excel.exe) or browser (chrome.exe, msedge.exe) and a child or grandchild process involves mounting a disk image (e.g., `powershell.exe -c Mount-DiskImage`, `explorer.exe` mounting an ISO) or extracting an archive (e.g., `7z.exe`, `winrar.exe`). Flag this specific sequence as a high-fidelity pattern of malicious content delivery and initial execution."
                    },
                    {
                        "description": "A sequence of a container file download from the internet, followed shortly by the mounting or extraction of the file, and subsequent execution of a payload from the new mount point or directory.",
                        "data_sources": [
                            "Zeek http.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a container file download (e.g., .iso, .vhd, .zip) from an external IP in Zeek http.log with subsequent process creation events (Windows Event ID 4688) on the destination host within a short time window (e.g., < 10 minutes). Specifically look for processes mounting the image or extracting the archive, followed by another process execution from the resulting temporary path (e.g., a new drive letter or a temporary folder). Use correlation analysis on hostname/IP, filename, and timestamps. Calculate the time delta between download and execution; a short delta is highly suspicious and can be identified using percentile analysis on observed deltas across the environment."
                    },
                    {
                        "description": "Execution of an unsigned or newly-created executable file from a path associated with a temporary virtual disk mount point or a common archive extraction location.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) and analyze the executable's file path. Maintain a baseline of normal processes that execute from temporary locations (e.g., %TEMP%, %APPDATA%) and newly created drive letters. Flag process executions from new drive letters that appear shortly after a disk image mount event. Analyze the executed file's properties: check if it's unsigned, its compilation timestamp, and its prevalence in the environment. Use frequency analysis and statistical profiling (e.g., descriptive statistics on process counts per path) to identify anomalous executions from these transient locations."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
