[
  {
    "Is the adversary bypassing authentication mechanisms using stolen hashes? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550.002 - Pass the Hash": {
          "NTLM LogonType 3 authentications not associated with standard domain logins or anonymous access.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 on target systems. Filter for LogonType 3 (Network). Exclude known legitimate uses of NTLM LogonType 3 (e.g., server-to-server communication using machine accounts, specific applications). Analyze remaining events for source IPs and user accounts. Use frequency analysis to identify rare source IPs or user accounts performing LogonType 3 compared to historical data."
          },
          "Credential use events (e.g., accessing shares, running remote commands) originating from unusual or unexpected sources/contexts for the given user.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4672; Windows Event ID 5140",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze credential use events captured in Windows Event ID 4624 (LogonType 3), 4672, and 5140 on target systems. Correlate these events with the source IP and user account. Identify accounts performing actions (e.g., accessing shares, privileged operations) that deviate significantly from their historical baseline activity using descriptive statistics or profiling of user activity."
          },
          "Anomalous NTLM LogonType 3 authentications originating from source systems where no corresponding cleartext or Kerberos authentication occurred recently for the same user.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (LogonType 3) on target systems. For each such event, check recent security logs (e.g., last 10 minutes) on the source system (if available) for Windows Event ID 4624 with LogonType 2 (Interactive), 10 (RemoteInteractive), or Kerberos events (4768, 4769) for the same user. Flag LogonType 3 events where no corresponding interactive or Kerberos logon is found on the source system within the recent time window, using correlation analysis based on user, source machine, and timestamp delta."
          },
          "Network traffic patterns associated with NTLM LogonType 3 that deviate significantly from the expected traffic profile for that user or source/destination pair (e.g., unusual ports, protocols, or data volume).": {
            "Data": "Zeek conn.log; Zeek smb.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections associated with NTLM authentication (e.g., SMB ports 445/139, WinRM ports 5985/5986). Correlate with NTLM activity identified in Windows Event ID 4624 (LogonType 3). Analyze protocol usage (Zeek logs), data transfer volumes, and destination ports for connections authenticated via LogonType 3. Use baseline analysis and statistical methods (e.g., IQR, box plots) on connection data (duration, byte volume, port usage) for specific user/source/destination pairs to flag significant deviations from normal activity profiles."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary moving laterally using stolen credentials/hashes? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550.002 - Pass the Hash": {
          "Unusual remote logins (LogonType 3) originating from systems already showing signs of compromise (e.g., binary execution, failed logins, network scanning).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful remote logins (Event ID 4624 LogonType 3) from internal source IPs. Correlate these logins with process creation events (Event ID 4688) on the target system or network connection events (Zeek conn.log) from the source system occurring shortly before or after the login. Look for unusual processes or connections originating from the source system, potentially using correlation analysis between event types/timestamps and comparing against baseline activity."
          },
          "Kerberos Ticket Granting Ticket (TGT) or Service Ticket (ST) requests (Event ID 4768/4769) immediately following or preceding suspicious NTLM activity (LogonType 3) from the same source/user.": {
            "Data": "Windows Event ID 4768; Windows Event ID 4769; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Domain Controllers for Windows Event ID 4768 (TGT Request) and 4769 (ST Request). Correlate these events with Windows Event ID 4624 (LogonType 3) on target systems involving the same user and source IP within a short time window. Analyze the temporal relationship using time series analysis or simple time delta calculations to identify sequences indicative of Overpass the Hash (e.g., NTLM logon followed by Kerberos ticket request)."
          },
          "Multiple successful NTLM LogonType 3 authentications using the same account but originating from different, disparate source systems within a short timeframe.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (LogonType 3) across all systems. Aggregate successful LogonType 3 events by user account within a defined time window (e.g., 15-30 minutes). Count the number of unique source systems observed for each account within this window. Flag accounts exhibiting LogonType 3 authentications from an unusually high number of distinct source systems in a short period, potentially using frequency analysis or deviation from established baseline source counts per user via statistical methods."
          },
          "Execution of remote command/scripting tools (e.g., PsExec, WMI, RDP) via NTLM LogonType 3 authentication, particularly to multiple target systems.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek dce_rpc.log; Zeek rdp.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful NTLM LogonType 3 events (Event ID 4624) with subsequent process creation events (Event ID 4688) on the target system or related network activity captured by Zeek (e.g., dce_rpc.log for PsExec/WMI, rdp.log for RDP). Specifically look for processes associated with remote execution tools (e.g., cmd.exe, powershell.exe, wmiprvsd.exe, psexec.exe) launched after LogonType 3. Analyze command lines (in 4688) and destinations (Zeek logs) to identify lateral movement attempts, particularly targeting multiple systems from a single source NTLM session, using frequency counting of targets."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]