[
  {
    "Is the adversary attempting to steal credentials from web browsers? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1555.003 - Credentials from Web Browsers": {
          "Unauthorized process accessing web browser credential database files (e.g., Chrome Login Data, Firefox logins.json).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for read access attempts on known web browser credential files (e.g., \"*\\\\AppData\\\\Local\\\\Google\\\\Chrome\\\\User Data\\\\*\\\\Login Data\", \"*\\\\AppData\\\\Roaming\\\\Mozilla\\\\Firefox\\\\Profiles\\\\*\\\\logins.json\"). Identify and investigate processes performing these reads that are not the legitimate web browser process. Use frequency analysis to identify rare processes accessing these files."
          },
          "Suspicious process command lines or memory access patterns indicative of credential extraction tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Filter and analyze command lines for suspicious keywords related to credential dumping or memory access utilities (e.g., 'dump', 'password', 'credential', 'mimikittenz', 'sekurlsa'). Use correlation analysis to identify process creation followed by attempts to access web browser process memory (requires additional logs like Sysmon Event ID 10 for memory access). Use descriptive statistics to identify unusual command line length or complexity for processes commonly used in attacks (e.g., powershell.exe)."
          },
          "Execution of scripts or commands that target web browser process memory or files and contain keywords related to credential extraction or common web applications.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and Windows Event ID 4104 (PowerShell Script Block Logging). Filter for process executions (e.g., powershell.exe) or script blocks that include command-line arguments or script content containing keywords like 'password', 'credential', 'logins', 'chrome', 'firefox', 'edge', specific tool names, or regex patterns commonly used in credential scraping. Use frequency analysis to baseline common script execution arguments and flag deviations."
          },
          "Outbound network connections from endpoint processes associated with web browsers or credential access tools immediately following suspicious file access or process execution events.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4663 (file read on browser cred files) or Windows Event ID 4688 (cred tool execution) on endpoints with subsequent outbound network connections (Zeek conn.log, Zeek http.log) originating from the same endpoint within a short time window (e.g., 60 seconds). Look for connections to unusual external IPs, ports, or rapid outbound data transfer volumes (using descriptive statistics like sum/mean of bytes transferred) immediately after the suspicious host activity. Inner join destination IPs with threat intelligence feeds."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]