
[
  {
    "Is the adversary attempting to steal credentials from web browsers? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1555.003 - Credentials from Web Browsers": {
          "Execution of a process whose file hash matches a known credential theft utility, or network connections to C2 infrastructure associated with such tools.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for all process creation events. Calculate the file hash of the new process image and inner join it against a threat intelligence feed of known malicious file hashes for credential theft tools (e.g., LaZagne, WebBrowserPassView). Additionally, monitor Zeek conn.log for outbound connections from endpoints and correlate the destination IP/domain with a CTI feed of known C2 servers used by credential access malware. Alert on any matches."
          },
          "Execution of suspicious command lines or PowerShell script blocks containing keywords, command structures, or arguments characteristic of credential theft from browsers.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and Windows Event ID 4104 (PowerShell Script Block Logging). Apply regular expressions to filter for command lines or script content containing patterns indicative of credential theft, such as: arguments targeting browser profile paths, use of .NET methods for decryption (e.g., '[System.Security.Cryptography.ProtectedData]::Unprotect'), or specific function names from tools like 'mimikittenz' or 'Invoke-BrowserCreds'. Use correlation analysis to link suspicious script blocks to parent processes and apply entropy measures to command line arguments to detect obfuscation."
          },
          "An unauthorized or unusual process (not the browser itself) reads browser credential database files (e.g., Chrome 'Login Data', Firefox 'logins.json', Edge 'Login Data').": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Windows Event ID 4663 (Object Access Auditing) for read access attempts on critical browser credential files (e.g., '*\\AppData\\Local\\Google\\Chrome\\User Data\\*\\Login Data*', '*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*\\logins.json*', '*\\AppData\\Local\\Microsoft\\Edge\\User Data\\*\\Login Data*'). Maintain a baseline of legitimate processes (e.g., chrome.exe, firefox.exe) that access these files. Alert on any access by non-whitelisted processes (e.g., powershell.exe, cmd.exe, cscript.exe, or any unrecognized binary). Use descriptive statistics on process names accessing these files to identify rare or first-time access events."
          },
          "A process makes a copy of a browser's credential or profile database to another location before reading it, indicating an attempt to bypass file-locking mechanisms.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing file copy operations (e.g., 'copy', 'xcopy', 'robocopy', 'Copy-Item') where the source path matches a browser's profile directory and the destination is a staging location (e.g., 'C:\\Users\\Public', 'C:\\Windows\\Temp'). Correlate this copy event with a subsequent file read event (Windows Event ID 4663) on the newly created file copy by the same process or a child process within a short time window (e.g., 30 seconds)."
          },
          "A sequence of events where a process accesses browser credential data, followed immediately by an outbound network connection, indicating potential exfiltration.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection rule that correlates host-based events with network events. Trigger an alert when a process (identified via Event ID 4688/4663) accesses browser credential files, and within a short time frame (e.g., 1-5 minutes), the same host initiates an outbound network connection (Zeek conn.log) to an unusual destination (i.e., not a known-good domain, a low-reputation IP, or a destination with low frequency of access across the enterprise). Use time series analysis to baseline typical outbound traffic for a host and identify anomalous spikes in data volume or connection count following the credential access event."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
