[
  {
    "Is the adversary bypassing authentication mechanisms using stolen hashes? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550.002 - Pass the Hash": {
          "NTLM LogonType 3 authentications not associated with standard domain logins or anonymous access.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 on target systems. Filter for LogonType 3 (Network). Exclude known legitimate uses of NTLM LogonType 3 (e.g., server-to-server communication using machine accounts, specific applications). Analyze remaining events for source IPs and user accounts. Use frequency analysis to identify rare source IPs or user accounts performing LogonType 3."
          },
          "Credential use events (e.g., accessing shares, running remote commands) originating from unusual or unexpected sources/contexts for the given user.": {
            "Data": "Windows Event ID 4624, Windows Event ID 4672, Windows Event ID 5140",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze credential use events captured in Windows Event ID 4624 (LogonType 3), 4672, and 5140 on target systems. Correlate these events with the source IP and user account. Identify accounts performing actions (e.g., accessing shares, privileged operations) that deviate significantly from their historical baseline activity using descriptive statistics or profiling."
          }
        }
      }
    }
  },
  {
    "Is the adversary moving laterally using stolen credentials/hashes? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550.002 - Pass the Hash": {
          "Unusual remote logins (LogonType 3) originating from systems already showing signs of compromise (e.g., binary execution, failed logins, network scanning).": {
            "Data": "Windows Event ID 4624, Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful remote logins (Event ID 4624 LogonType 3) from internal source IPs. Correlate these logins with process creation events (Event ID 4688) on the target system or network connection events (Zeek conn.log) from the source system occurring shortly before or after the login. Look for unusual processes or connections originating from the source system, potentially using correlation analysis between event types/timestamps."
          },
          "Kerberos Ticket Granting Ticket (TGT) or Service Ticket (ST) requests (Event ID 4768/4769) immediately following or preceding suspicious NTLM activity (LogonType 3) from the same source/user.": {
            "Data": "Windows Event ID 4768, Windows Event ID 4769, Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Domain Controllers for Windows Event ID 4768 (TGT Request) and 4769 (ST Request). Correlate these events with Windows Event ID 4624 (LogonType 3) on target systems involving the same user and source IP within a short time window. Analyze the temporal relationship using time series analysis or simple time delta calculations to identify sequences indicative of Overpass the Hash (e.g., NTLM logon followed by Kerberos ticket request)."
          }
        }
      }
    }
  }
]