[
  {
    "Is the adversary establishing persistence by disabling or modifying MFA? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.006 - Multi-Factor Authentication": {
          "Changes to MFA policies (e.g., Conditional Access exclusions) for sensitive accounts or groups.": {
            "Data": "Windows Event ID 4738; Windows Event ID 4739; Windows Event ID 4767",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4738 (User Account Changed), 4739 (Domain Policy Changed), 4767 (A user account was unlocked) for changes to sensitive user accounts or groups. Identify recent changes and correlate with identity provider logs (if available) for MFA policy updates or exclusions. Flag unexpected modifications for accounts expected to be covered by MFA."
          },
          "Registration of new or unusual MFA methods for user accounts, especially administrative accounts.": {
            "Data": "Windows Event ID 4738",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4738 for changes to user objects. While not a direct MFA registration log, look for rapid changes to user attributes for multiple accounts. Correlate with authentication logs (Win Event 4624) for subsequent successful logins by these users without expected MFA validation."
          },
          "Persistent successful logins for a sensitive account that was recently excluded from MFA policies.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify sensitive accounts expected to have MFA enforced. Monitor Windows Event ID 4624 (Successful Logon) for successful logins by these accounts. Use time series analysis to identify persistent login activity without expected MFA indicators (requires external data correlation) or persistent logins outside normal operating hours for these accounts, following a suspected MFA policy change."
          },
          "Recurring network connections to unusual or unauthorized external services, potentially indicating adversary MFA methods or redirection.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 (Filtering Platform Connection) for recurring network connections from internal systems (Endpoints/Servers) to external IP addresses/domains not associated with authorized corporate services (requires lookup/baseline). Investigate recurring connections, especially those occurring after suspected MFA configuration changes, using frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by disabling or modifying MFA? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.006 - Multi-Factor Authentication": {
          "Modification of the C:\\windows\\system32\\drivers\\etc\\hosts file on systems involved in authentication.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Sysmon Event ID 11; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 (Object Access) and Sysmon Event ID 11 (FileCreate) for modifications to C:\\windows\\system32\\drivers\\etc\\hosts. Identify the process responsible using Windows Event ID 4688 (Process Creation) or Sysmon Event ID 1. Alert on any modification by unexpected processes or users."
          },
          "Modification or access to MFA-related program files or configuration settings.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Sysmon Event ID 1; Sysmon Event ID 11; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 (Object Access) and Sysmon Event IDs 1/11 (Process/File) for modifications or access attempts on known MFA-related executables or configuration files. Identify access by unusual processes or users and correlate with process execution details from Windows Event ID 4688 or Sysmon Event ID 1."
          },
          "Execution of unexpected or unsigned code attempting to modify running processes or system files associated with MFA.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1; Sysmon Event ID 6; Sysmon Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and Sysmon Event ID 1 for process creation involving known MFA executables or libraries. Monitor Sysmon Event IDs 6 (Driver Loaded) and 7 (Image Loaded) for driver/image loading by these processes or attempts to load libraries into these processes. Flag execution by unsigned code or attempts to load unsigned libraries into signed MFA processes using correlation analysis."
          },
          "Unexpected changes in network traffic patterns towards internal authentication/MFA servers, potentially indicating redirection or blocking.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline network traffic patterns (e.g., connection volumes, destination ports) from internal systems to known internal authentication/MFA servers using Zeek logs (conn.log, dns.log, http.log if applicable). Use time series analysis or statistical profiling (e.g., IQR) to detect significant deviations (e.g., sudden drops in expected traffic volume, connections to unusual ports/IPs) that could indicate traffic redirection or blocking preventing MFA validation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary accessing credentials by disabling or modifying MFA? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.006 - Multi-Factor Authentication": {
          "Successful authentication events for accounts where MFA should be enforced, but was not prompted or validated.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 (Successful Login) for accounts that are expected to have MFA enforced. Identify successful logins lacking typical MFA logs (requires external IdP log correlation). Use time series analysis or statistical profiling (e.g., identifying logins significantly outside normal user activity windows) to flag suspicious successful logins for these accounts."
          },
          "Logins to accounts that previously required MFA but no longer do, following policy or configuration changes.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify accounts where user/group modifications (as per TA0003 evidence) potentially resulted in MFA being disabled. Monitor Windows Event ID 4624 for subsequent successful logins by these accounts. Use descriptive statistics or time series analysis to compare login frequency/patterns before and after the suspected MFA change."
          },
          "Access to resources using a sensitive account that typically requires MFA, from an unusual source IP or location, occurring shortly after MFA is suspected to be disabled.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4624 (Successful Logon) and Zeek conn.log for sensitive accounts known to have MFA enabled. Track the source IP address and geographic location for successful logons. Use correlation analysis to identify successful logons from unusual or previously unseen source IPs/locations that occur shortly after suspected MFA policy changes or observed MFA bypass attempts. Use frequency analysis or percentile analysis to identify rare source locations."
          },
          "Bulk access or data transfer activity immediately following a successful login to a sensitive account where MFA appears to have been bypassed.": {
            "Data": "Windows Event ID 4624; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 for successful logins by sensitive accounts where MFA validation is absent (requires correlation). Correlate these logins with subsequent network connection events (Windows Event ID 5156 - Filtering Platform Connection) and Zeek conn.log entries originating from the authenticated session. Use descriptive statistics (e.g., bytes transferred, connection count) to identify unusually high volumes of network activity or connections to multiple unusual destinations shortly after such logins, indicative of data exfiltration or further access."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]