[
    {
        "information_requirement": "Has the adversary obtained credential access via forged Kerberos tickets?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1558.001",
                "name": "Golden Ticket",
                "evidence": [
                    {
                        "description": "Execution of a process on a Domain Controller with an executable hash matching known credential dumping or ticket forging tools (e.g., Mimikatz).",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On all Domain Controllers, monitor process creation events (Windows Event ID 4688 with command-line auditing enabled). Correlate the hashes of created process executables against a frequently updated CTI feed of hashes for known malicious tools like Mimikatz, Rubeus, etc. A match represents a high-confidence indicator of compromise and precursor to Golden Ticket creation. Alert immediately on any match."
                    },
                    {
                        "description": "Kerberos ticket requests containing artifacts of forgery tools, such as the use of RC4 encryption or specific anomalous ticket options, especially for privileged accounts.",
                        "data_sources": [
                            "Windows Event ID 4768",
                            "Windows Event ID 4769"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On Domain Controllers, monitor Kerberos TGT (Event ID 4768) and TGS (Event ID 4769) requests. Create high-fidelity alerts for any tickets requested for privileged accounts (e.g., members of Domain Admins, Enterprise Admins) using the deprecated RC4_HMAC_MD5 encryption type (Ticket Encryption Type '0x17'). Additionally, flag tickets with suspicious 'Ticket Options' values commonly associated with Mimikatz (e.g., '0x40810010'), as this is a strong pattern-based indicator of forgery."
                    },
                    {
                        "description": "A Kerberos service ticket (TGS) request (Event ID 4769) is observed for a user session that lacks a corresponding, recent Kerberos authentication ticket (TGT) request (Event ID 4768) from the same client.",
                        "data_sources": [
                            "Windows Event ID 4768",
                            "Windows Event ID 4769"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On Domain Controllers, build a stateful analysis model. For every TGS request (Event ID 4769), correlate the 'Client Address' and 'Target User SID' back to a recent TGT request (Event ID 4768) from the same source within the configured TGT lifetime. Use correlation analysis based on these fields and timestamps. An absence of a valid preceding TGT request is a strong behavioral indicator that a forged ticket (Golden or Silver) is being used."
                    },
                    {
                        "description": "The lifetime of a requested Kerberos authentication ticket (TGT) significantly exceeds the domain's maximum ticket lifetime policy, such as a ticket with a 10-year lifetime.",
                        "data_sources": [
                            "Windows Event ID 4768"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On Domain Controllers, parse the 'Ticket Options' field in every TGT request (Event ID 4768) to determine the requested ticket lifetime. Compare this value against the domain's configured maximum ticket lifetime policy. Generate a high-priority alert for any ticket requested with a lifetime that exceeds the policy by a significant margin (e.g., > 1 day) or matches the common forged lifetime of 10 years. Use descriptive statistics on observed lifetimes to spot anomalies."
                    },
                    {
                        "description": "A single account conducts an anomalously high number of successful network logons (Logon Type 3) to distinct systems in a short period, indicating rapid lateral movement inconsistent with baseline user behavior.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate successful network logon events (Windows Event ID 4624, Logon Type 3) across all servers. For each user account, establish a baseline of normal lateral movement by calculating the mean and standard deviation of distinct hosts accessed per hour. Continuously monitor for accounts whose activity significantly exceeds their baseline (e.g., > 3 standard deviations, or in the 99th percentile of activity). Use time series analysis to detect sudden spikes in an account's lateral movement rate, a common behavior after successfully using a Golden Ticket."
                    },
                    {
                        "description": "A Kerberos service ticket is granted where authorization is based on a high-privilege SID (e.g., Enterprise Admins) present in the SID-History of the user's ticket.",
                        "data_sources": [
                            "Windows Event ID 4769"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On Domain Controllers, enable and monitor the 'Transited Services' field within Kerberos service ticket request events (Event ID 4769). The presence of SIDs in this field indicates that SID-History was used for authorization. Create a high-priority alert when the SID-History includes SIDs for high-privilege groups (e.g., Enterprise Admins S-1-5-21-...-519) that are not native to the account's own group memberships. This is a strong behavioral indicator of a Golden Ticket designed for privilege escalation."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
