[
  {
    "Has the adversary accessed credentials stored in files? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1552.001 - Credentials In Files": {
          "Process execution activity indicating search for or access to files potentially containing credentials.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command-line arguments containing keywords like 'password', 'pwd', 'login', 'secure', 'credentials', or regex patterns matching credential file names/paths. Monitor Windows Event ID 4663 for read access attempts on known credential files or common locations (e.g., config files, scripts, browser profiles). Perform statistical analysis (e.g., frequency analysis) on file access patterns by user/process to identify outliers."
          },
          "Use of potentially compromised credentials (from files) for authentication attempts.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and 4625 and Zeek conn.log for authentication attempts using user accounts or service accounts whose credentials might have been stored in files. Correlate login attempts with unusual source IPs, times, or target systems. Use time series analysis on authentication logs for specific accounts potentially compromised via credentials in files to detect persistent deviations from normal activity."
          },
          "Suspicious file access patterns indicative of searching for or harvesting credential files on local systems or network shares.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for read access attempts on files with suspicious names (*password*, *cred*, *secret*) or extensions (.config, .json, .yml, .sh, .ps1) in user profiles, application data folders, or network shares. Correlate with Windows Event ID 4688 to identify the process and command line. Analyze sequences of file access events for a single process/user using descriptive statistics (count, unique files) and time series analysis (rate of access) to detect rapid file enumeration or access to an unusual number of potentially sensitive files."
          },
          "Access to specific system configuration files known to contain credentials, such as Group Policy Preferences XML or container configuration files.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for read/write access to known file paths like GPP XML files (*.xml in SYSVOL) or common container credential/config files (~/.docker/config.json, Kubernetes config). Use Windows Event ID 4688 to identify the process and user. Monitor Zeek conn.log for connections to ports associated with file shares (SMB 445) or container APIs (Docker 2375/2376, Kubernetes 6443/443, Kubelet 10250) targeting systems hosting these files, especially if the connection originates from an unexpected source or process (correlated via host logs). Flag access by non-standard processes or users compared to baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]