[
  {
    "Is the adversary evading macOS security controls? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1553.001 - Gatekeeper Bypass": {
          "Network connections initiated by recently downloaded and executed applications that bypassed Gatekeeper.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, http.log) for new connections originating from hosts where recently downloaded files have initiated network activity. Analyze connection patterns with application execution events (if correlating with host data) or look for highly unusual destination IPs/ports using entropy or frequency analysis. Correlate downloads identified in http.log with subsequent outbound connections in conn.log."
          },
          "Download of executable file types from untrusted or low-reputation sources potentially associated with Gatekeeper bypass.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and files.log for downloads of executable file types (.dmg, .app, .zip containing executables, .dylib, etc.). Filter for sources known to be untrusted or with low reputation scores from threat intelligence feeds. Use statistical analysis (e.g., frequency analysis) to identify uncommon download sources or types. Investigate immediate network activity from hosts downloading such files."
          },
          "Execution of macOS xattr utility attempting to remove or modify the com.apple.quarantine extended attribute on downloaded files.": {
            "Data": "macOS Audit logs (process execution); Zeek files.log; Zeek conn.log",
            "Data Platform": "Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS host logs (e.g., auditd, EDR) for executions of the `/usr/bin/xattr` command. Specifically look for arguments containing `-d com.apple.quarantine` or similar modifications on paths within user download directories (`~/Downloads`) or temporary locations. Correlate suspicious `xattr` usage with recent file downloads identified in Zeek files.log or immediate outbound network connections in Zeek conn.log from the affected host."
          },
          "Modification or unusual access patterns on the QuarantineEvents database or application Info.plist files related to quarantine flags.": {
            "Data": "macOS Audit logs (file access/modification); Zeek conn.log",
            "Data Platform": "Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS host logs (e.g., auditd, EDR) for access to or modification of `~/Library/Preferences/com.apple.LaunchServices.QuarantineEventsV2` database file or `Info.plist` files within application bundles, specifically looking for writes or deletes on quarantine-related entries/files. Use time series analysis to detect unusual frequency or timing of access to these files. Correlate such activity with network connections in Zeek conn.log that might indicate data exfiltration or C2."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]