[
  {
    "Is the adversary attempting to gain access to credentials using AS-REP Roasting? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1558.004 - AS-REP Roasting": {
          "Kerberos TGT requests for accounts with pre-authentication disabled (Kerberos Event ID 4768 where ticket_options contain '0x40000000').": {
            "Data": "Windows Event ID 4768",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4768 logs on Domain Controllers. Filter events where ticket_options contain '0x40000000' (pre-authentication not required). Analyze volume and frequency of such requests over time using time series analysis or simple counting and thresholds to detect abnormal spikes. Investigate accounts frequently targeted."
          },
          "Kerberos TGT requests using weak encryption types, specifically RC4 (Kerberos Event ID 4768 where ticket_encryption_type is '0x17').": {
            "Data": "Windows Event ID 4768",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4768 logs on Domain Controllers. Filter events where ticket_encryption_type is '0x17' (RC4). Use descriptive statistics and percentile analysis to identify accounts requesting TGTs primarily with RC4 encryption or exhibiting an unusual increase in RC4 requests."
          },
          "Abnormally high volume or frequency of Kerberos TGT requests (Event ID 4768) originating from a single source host, especially targeting accounts with pre-authentication disabled.": {
            "Data": "Windows Event ID 4768",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4768 logs on Domain Controllers. Group events by source IP address (or workstation name) and time window (e.g., 5 minutes). Calculate the rate of requests per source. Use statistical outlier detection methods (e.g., Z-score, IQR) to flag sources exhibiting a rate significantly higher than their historical baseline or the network average, specifically when targeting accounts with pre-authentication disabled ('0x40000000')."
          },
          "Abnormal volume of Kerberos AS-REP network responses containing weak RC4 encryption (cipher type 3) from the Domain Controller to a specific client IP within a short time frame.": {
            "Data": "Zeek kerberos.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek kerberos.log for KRB_AS_REP messages (`request_type=11`) where the encryption cipher is RC4 (`cipher=3`). Group these events by the client IP (`client` field) and count the number of such events within a rolling time window (e.g., 1 minute). Use statistical methods (e.g., counting, rate calculation) to identify client IPs receiving an abnormally high volume of RC4 AS-REPs. Investigate the source IP and the targeted accounts (`from` field in preceding AS-REQ if available) for high-volume RC4 AS-REP traffic."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]