[
  {
    "Is the adversary establishing persistence by disabling or modifying MFA? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.006 - Multi-Factor Authentication": {
          "Changes to MFA policies (e.g., Conditional Access exclusions) for sensitive accounts or groups.": {
            "Data": "Windows Event ID 4738, Windows Event ID 4739, Windows Event ID 4767",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4738, 4739, 4767 for changes to sensitive user accounts or groups. Identify recent changes and correlate with identity provider logs (if available) for MFA policy updates or exclusions. Flag unexpected modifications for accounts expected to be covered by MFA."
          },
          "Registration of new or unusual MFA methods for user accounts, especially administrative accounts.": {
            "Data": "Windows Event ID 4738",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4738 for changes to user objects. While not a direct MFA registration log, look for rapid changes to user attributes for multiple accounts. Correlate with authentication logs (Win Event 4624) for subsequent successful logins by these users."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by disabling or modifying MFA? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.006 - Multi-Factor Authentication": {
          "Modification of the C:\\windows\\system32\\drivers\\etc\\hosts file on systems involved in authentication.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Sysmon Event ID 11, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 (Object Access) and Sysmon Event ID 11 (FileCreate) for modifications to C:\\windows\\system32\\drivers\\etc\\hosts. Identify the process responsible using Windows Event ID 4688 or Sysmon Event ID 1. Alert on any modification by unexpected processes or users."
          },
          "Modification or access to MFA-related program files or configuration settings.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Sysmon Event ID 1, Sysmon Event ID 11, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 (Object Access) and Sysmon Event IDs 1/11 (Process/File) for modifications or access attempts on known MFA-related executables or configuration files. Identify access by unusual processes or users."
          }
        }
      }
    }
  },
  {
    "Is the adversary accessing credentials by disabling or modifying MFA? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.006 - Multi-Factor Authentication": {
          "Successful authentication events for accounts where MFA should be enforced, but was not prompted or validated.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 (Successful Login) for accounts that are expected to have MFA enforced. Identify successful logins lacking typical MFA logs (requires external IdP log correlation). Use time series analysis or statistical profiling (e.g., identifying logins significantly outside normal user activity windows) to flag suspicious successful logins for these accounts."
          },
          "Logins to accounts that previously required MFA but no longer do, following policy or configuration changes.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify accounts where user/group modifications (Evidence 1/2) potentially resulted in MFA being disabled. Monitor Windows Event ID 4624 for subsequent successful logins by these accounts. Use descriptive statistics or time series analysis to compare login frequency/patterns before and after the suspected MFA change."
          }
        }
      }
    }
  }
]