```json
[
  {
    "Has the adversary attempted to access credentials from securityd process memory on a macOS endpoint? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1555.002 - Securityd Memory": {
          "Execution of known macOS credential dumping tools that target securityd memory, identified by file hash or process name.": {
            "Data": "macOS Endpoint Security Framework (ESF) process events; Zeek files.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor ESF process execution events for file hashes or process names matching a threat intelligence list of known macOS credential theft tools (e.g., ChainJett, LaZagne, custom scripts). Correlate hashes of executable files transferred over the network (from Zeek files.log) against the same list. Alert on any confirmed selector match."
          },
          "Use of system utilities (e.g., `grep`, `strings`, `gdb`, `lldb`) with command-line arguments targeting the securityd process for memory inspection.": {
            "Data": "macOS Endpoint Security Framework (ESF) process events",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and maintain a list of system utilities that can be abused for memory inspection. Monitor ESF process execution events for any of these utilities being run with command-line arguments that contain the string 'securityd' or the dynamically resolved PID of the securityd process. Use regular expression matching on command lines to find patterns such as `gdb -p $(pgrep securityd)` or `strings /proc/<pid>/mem`. Correlate findings with the parent process to identify suspicious scripts or interactive user activity."
          },
          "An unauthorized or non-standard process attempting to read the memory of the securityd process.": {
            "Data": "macOS Endpoint Security Framework (ESF) memory access events",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate processes that are expected to interact with the securityd process (e.g., core system processes, web browsers, mail clients during normal operation). Monitor for any process not on this allowlist that attempts a memory read operation (e.g., via `task_for_pid` or `mach_vm_read` APIs) targeting the securityd process. Use frequency analysis and correlation to identify rare parent processes performing this action, as this is a high-fidelity behavioral indicator of a credential access attempt."
          },
          "A sequence of reconnaissance, memory access, and exfiltration, where a process first identifies the securityd PID, then attempts to read its memory, and subsequently initiates an external network connection.": {
            "Data": "macOS Endpoint Security Framework (ESF) process, memory, and network events; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a stateful detection rule to identify a specific chain of events from a single parent process within a short time window (e.g., 2 minutes): 1. Execution of a discovery command like `pgrep securityd` or `ps aux | grep securityd`. 2. A subsequent memory read attempt against the identified securityd PID. 3. A new external network connection (observed via ESF network events or Zeek conn.log) originating from the same process or a child. Use correlation analysis on process IDs, user context, and timestamps to link these discrete events into a single high-confidence alert for this malicious behavior pattern."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```