[
  {
    "Has the adversary stolen or forged Kerberos tickets? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1558 - Steal or Forge Kerberos Tickets": {
          "Anomalous Kerberos ticket activity, such as malformed/blank fields, RC4 encryption in TGTs, or TGS requests without preceding TGTs.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4634; Windows Event ID 4672; Windows Event ID 4769",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event IDs 4624, 4634, 4672, and 4769 from Domain Controllers and relevant endpoints. Analyze Event ID 4624, 4634, 4672 for malformed/blank fields. Analyze Event ID 4769 for 'Ticket Options' field indicating RC4_HMAC_MD5 encryption (0x40800000) and TGS requests without corresponding TGT requests. Identify accounts making a high volume of 4769 requests in a short timeframe using frequency analysis and outlier detection (e.g., using IQR)."
          },
          "Unusual processes attempting to access LSASS memory or secrets files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 (Process Creation) from endpoints and servers. Monitor for suspicious process names or command lines known to dump credentials (e.g., mimikatz variants, suspicious powershell scripts) spawned. Identify patterns of process execution correlated with potential attempts to access sensitive processes like lsass.exe by analyzing parent/child process relationships and command line arguments. Use baselining to detect unusual process executions accessing memory."
          },
          "Kerberos TGT tickets with unusually long lifetimes or accounts making an excessive number of Kerberos service ticket requests (Event ID 4769).": {
            "Data": "Windows Event ID 4768; Windows Event ID 4769",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event IDs 4768 and 4769 from Domain Controllers. For Event ID 4768, monitor the 'Ticket Options' and 'Ticket Expiration Time' fields to identify tickets with lifetimes exceeding the default domain policy or unusual flags (e.g., 'forwardable'). For Event ID 4769, aggregate requests by Account Name and time. Identify accounts making an unusually high volume of TGS requests in a short timeframe (e.g., using percentile analysis or thresholding) and correlate with the 'Ticket Options' field for RC4 usage (0x40800000)."
          },
          "Execution of the klist utility by non-standard processes or users.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 from endpoints and servers. Filter for 'klist.exe' execution in the New Process Name or CommandLine fields. Identify executions initiated by unusual parent processes or user accounts. Use frequency analysis or baselining to detect execution patterns that deviate from expected administrative or system activity for specific users or hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]