[
  {
    "Has the adversary attempted to access credentials? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1555.002 - Securityd Memory": {
          "Unusual process execution or command-line activity related to searching for credentials or accessing process memory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations with suspicious command-line arguments or process names related to memory dumping or credential access tools. Use frequency analysis or entropy measures on command-line strings to identify unusual patterns."
          },
          "Execution of known credential dumping tools targeting memory.": {
            "Data": "Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify execution of known credential dumping tools by monitoring Windows Event ID 4688. Cross-reference executed file hashes from Event 4688 and Zeek files.log with threat intelligence feeds. Monitor Zeek files.log for delivery of these tools."
          },
          "Process access to LSASS memory.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure auditing for handle requests on 'lsass.exe' (Object Type 'Process', Access Mask for Read/Duplicate Handle). Monitor Windows Event ID 4656 for events where Object Name is 'lsass.exe'. Correlate with Windows Event ID 4688 using Process ID to identify the calling process. Flag any non-standard or suspicious processes attempting to access LSASS memory. Use frequency analysis to baseline normal LSASS access from system processes."
          },
          "Creation of files containing dumped credentials or memory dumps.": {
            "Data": "Windows Event ID 4663; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure auditing for file writes (Event ID 4663) in sensitive locations (e.g., Temp folders, user directories) or for files with suspicious names/extensions (e.g., .dmp, .klist, .txt often used by dumpers). Monitor Zeek files.log for file names and types matching common credential dump formats being transferred out of the network segment. Correlate Event 4663 and Zeek files.log events by timestamp and filename/hash. Use statistical analysis (e.g., file size distribution for type '.txt') to identify unusual outputs compared to baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]