[
  {
    "Is the adversary establishing persistence by modifying authentication processes? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Suspicious modifications to authentication-related configuration files or registry keys (e.g., LSA Notification Packages, PAM configurations).": {
            "Data": "Windows Event ID 4657, Windows Event ID 4663, Sysmon Event ID 11, Sysmon Event ID 12, Sysmon Event ID 13",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor relevant registry keys (e.g., Lsa\\Notification Packages) and PAM configuration files for modifications (Event ID 4657, Sysmon 12/13). Investigate any new or changed entries, correlating with file creation events (Sysmon 11) for referenced DLLs. Use descriptive statistics to baseline typical changes and flag outliers."
          },
          "Unusual account activity patterns inconsistent with normal user behavior (e.g., simultaneous logins from one account, logins at odd hours).": {
            "Data": "Windows Event ID 4624, Windows Event ID 4625, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze login logs (Event ID 4624, 4625, Zeek conn.log) across multiple systems for a single account. Identify instances where an account is logged into more than one system concurrently or logs in from disparate locations/times within a short period. Use statistical correlation analysis or time series analysis to identify anomalous login sequences or concurrent sessions per account."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by modifying authentication processes? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Detection of unknown or suspicious DLL files loaded into critical authentication processes (e.g., lsass.exe) or referenced by authentication configuration.": {
            "Data": "Windows Event ID 4688, Sysmon Event ID 7, Sysmon Event ID 10, Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process image loads (Sysmon 7) for lsass.exe. Compare loaded DLLs against a baseline of known legitimate modules. Investigate any unknown or newly loaded DLLs, especially those referenced in LSA/PAM configurations (Event ID 4657)."
          },
          "Unauthorized or suspicious changes to Group Policy or Active Directory settings related to authentication (e.g., reversible encryption enabled).": {
            "Data": "Windows Event ID 4742, Windows Event ID 4738, Windows Event ID 5136, Windows Event ID 4657",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Directory Service (Event ID 5136) and account/group policy changes (Event ID 4742, 4738). Specifically alert on changes to 'Store passwords using reversible encryption' or execution logs for relevant PowerShell cmdlets (Set-ADUser, Set-ADAccountControl). Use descriptive statistics or regression analysis to track historical policy changes and identify anomalous modifications."
          }
        }
      }
    }
  },
  {
    "Is the adversary gaining credentials by modifying authentication processes? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556 - Modify Authentication Process": {
          "Modifications to LSA Notification Packages or other password filter configurations referencing suspicious or unknown DLLs.": {
            "Data": "Windows Event ID 4657, Sysmon Event ID 12, Sysmon Event ID 13, Sysmon Event ID 7",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor registry modifications to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Notification Packages (Event ID 4657, Sysmon 12/13). Correlate changes with Sysmon Event ID 7 (ImageLoaded) for the DLL specified. Investigate the origin and integrity of the referenced DLL file using methods like entropy measures to assess file content randomness."
          },
          "Suspicious attempts to open or interact with critical authentication processes like lsass.exe using methods like OpenProcess.": {
            "Data": "Windows Event ID 4663, Sysmon Event ID 10",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process access attempts (Sysmon 10, Event ID 4663) targeting critical authentication processes like lsass.exe. Alert on suspicious access types (e.g., PROCESS_VM_READ, PROCESS_VM_WRITE) from non-standard processes or users. Use frequency analysis or statistical outliers detection to identify unusually high rates of access attempts from specific sources."
          }
        }
      }
    }
  }
]