
[
  {
    "Is the adversary searching for or accessing unsecured credentials? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552 - Unsecured Credentials": {
          "Network connections to known malicious C2 servers immediately following suspicious file access or credential-searching activity on a host.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate host-based credential searching activity (identified via Windows Event IDs 4688 for command-line analysis and 4663 for file access) with subsequent network connections (Zeek conn.log) from the same host. Inner join the destination IP addresses from Zeek conn.log with a high-confidence cyber threat intelligence (CTI) feed of known malicious C2 IPs. Alert if a host performing credential searching connects to a known C2 address within a short time window (e.g., 5-10 minutes)."
          },
          "Execution of common system utilities (e.g., findstr, grep, PowerShell, reg.exe) with command-line parameters indicative of searching for credentials or accessing known plaintext credential stores.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process command lines (Windows Event ID 4688). Use regular expressions to detect patterns such as: 1) Searching utilities (`findstr`, `grep`, `Select-String`) combined with keywords like `password`, `private_key`, `api_key`, `connection_string`, `secret`. 2) File access utilities (`type`, `cat`, `Get-Content`) targeting common configuration files (`web.config`, `id_rsa`, `.aws/credentials`, `.bash_history`, `shadow`). 3) Registry utilities (`reg.exe query`) targeting hives known to store credentials (e.g., `HKCU\\Software\\SimonTatham\\PuTTY\\Sessions`, `HKLM\\SECURITY\\Policy\\Secrets`). Maintain and regularly update a list of these sensitive file names, keywords, and registry paths. Use correlation analysis to check the parent process for context (e.g., script vs. interactive shell)."
          },
          "A single process rapidly accessing an unusually large number of distinct files, especially configuration files or documents, which is characteristic of automated credential harvesting scripts.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file access events (Windows Event ID 4663) by the Process ID of the executing process (from Windows Event ID 4688). For each process, count the number of unique files accessed within a short time window (e.g., 1 minute). Establish a baseline for normal file access rates for common processes. Use statistical methods like Inter-Quartile Range (IQR) or calculating the Z-score to flag processes with an anomalously high number of file accesses. Weight the alert score higher if accessed files have extensions like `.config`, `.xml`, `.yml`, `.txt`, `.ini`, or reside in user profile or source code directories."
          },
          "Anomalous network activity, such as transferring files with credential-related names or connecting to rare external destinations, immediately following widespread local file access.": {
            "Data": "Windows Event ID 4663; Zeek conn.log; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify hosts exhibiting high-volume file access behavior (from Windows Event ID 4663). Then, monitor subsequent network traffic from these hosts using Zeek logs. In Zeek conn.log, look for connections to rare or newly observed external IP addresses or domains. Analyze Zeek files.log for metadata of transferred files, flagging suspicious names (e.g., 'creds.zip', 'passwords.txt', 'backup.zip'). Use time series analysis to correlate a spike in local file access with the onset of anomalous data transfer. Calculate the entropy of destination ports or IPs from a host to detect erratic exfiltration patterns."
          },
          "An unusual process chain where a process spawned from a web server or document-handling application (e.g., Office, Adobe Reader) executes command-line searches for credentials.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process lineage using parent and child process IDs from Windows Event ID 4688. Establish a baseline of normal process chains in the environment. Alert on the creation of high-risk chains where a process commonly associated with initial access vectors (e.g., `winword.exe`, `w3wp.exe`, `powershell.exe`) spawns a shell (`cmd.exe`, `pwsh.exe`) which in turn executes credential-searching commands (e.g., `findstr`, `grep`, `Select-String`). Use a correlation model to identify low-frequency or known-bad process trees, indicating a post-exploitation attempt to find credentials for lateral movement."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
