
[
  {
    "Is the adversary attempting to bypass security controls by subverting trust mechanisms? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1553 - Subvert Trust Controls": {
          "Execution of a binary signed by a known malicious code-signing certificate, or installation of a root certificate matching a known malicious thumbprint or issuer.": {
            "Data": "Windows Event ID 4688; Zeek x509.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Windows Event ID 4688) and network certificate data (Zeek x509.log). Extract code-signing certificate details (issuer, serial number, thumbprint) from executed binaries and newly observed certificates. Compare these atomic indicators against a high-confidence threat intelligence feed of known malicious certificates. Generate a high-priority alert on any match."
          },
          "Execution of system utilities (e.g., certutil.exe, reg.exe, PowerShell) with command-line arguments or script content matching known patterns for installing malicious certificates or disabling trust controls.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for specific command-line patterns. Maintain and use a library of regular expressions to detect known malicious usage, such as `certutil.exe -addstore -f root <malicious_cert.cer>`, `reg.exe add 'HKLM\\SOFTWARE\\Microsoft\\SystemCertificates\\Root\\Certificates'`, or PowerShell cmdlets like `Import-Certificate`. Use correlation analysis to link this activity to preceding network downloads or suspicious parent processes."
          },
          "A process downloads a certificate file from an external source, which is then immediately installed into a system's root or trusted publisher certificate store by the same or a child process.": {
            "Data": "Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network data with host events by identifying certificate file downloads (e.g., .cer, .crt, .p7b) using Zeek files.log. Within a short time window (e.g., 5 minutes), search for a process creation event (Windows Event ID 4688) on the destination host that uses a utility like `certutil.exe` to install a certificate. Correlate the filename from the download with the command-line argument of the installation command. Use time series analysis to flag spikes in certificate installations across the environment."
          },
          "Execution of executables signed with a newly observed or statistically rare code-signing certificate, especially if the certificate is self-signed or has low-reputation attributes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "From process creation events (Windows Event ID 4688), build and maintain a baseline of all code-signing certificates (by thumbprint and issuer) observed in the environment over a rolling period (e.g., 30-60 days). Flag the execution of any binary signed by a certificate not present in the baseline. Use frequency analysis and descriptive statistics to enrich findings, prioritizing certificates seen on only one or a few hosts. A box-plot of certificate age or prevalence can identify outliers."
          },
          "An unsigned or untrusted executable is written to disk and subsequently executed after its 'Mark-of-the-Web' (MOTW) attribute is removed or was never applied, bypassing built-in Windows security warnings.": {
            "Data": "Zeek files.log; Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for downloaded executables (.exe, .dll, .ps1) from external sources. On the host, correlate this with process creation events (Windows Event ID 4688) for the same file. Investigate instances where a downloaded executable runs without a corresponding user security prompt, which may indicate MOTW bypass. Monitor for direct manipulation of the Zone.Identifier Alternate Data Stream (ADS) using file system activity monitoring (Windows Event ID 4663) or by looking for utilities like `streams.exe` or PowerShell cmdlets (`Remove-Item -Stream`) in command-line logs."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
