[
  {
    "Is the adversary attempting to gain credential access via DHCP spoofing? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1557.003 - DHCP Spoofing": {
          "Detection of hosts receiving unusual network configuration parameters (e.g., malicious DNS/Gateway IPs) via DHCP.": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dhcp.log to identify Offer/ACK pairs. Extract reported DNS server and default gateway IPs. Cross-reference these IPs against expected internal IPs and threat intelligence feeds. Flag clients receiving configuration with known malicious or unexpected external IPs. Use frequency analysis to identify anomalous configuration IPs received by multiple clients."
          },
          "High volume of DHCP requests causing IP pool exhaustion, potentially indicating a denial of service attempt or precursor to spoofing.": {
            "Data": "Windows Event ID 1341; Windows Event ID 1342; Windows Event ID 1020; Windows Event ID 1063",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 1341, 1342, 1020, 1063 on DHCP servers. Track the rate of IP address allocation requests. Detect rapid increases or sudden exhaustion of the DHCP pool. Use time series analysis to identify anomalous spikes in allocation requests compared to historical baselines."
          },
          "Detection of DHCP Offer messages from unauthorized source MAC addresses or IPs, or Offer messages received without a preceding client broadcast (DISCOVER).": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dhcp.log. Identify all unique 'server_mac' and 'server_ip' addresses observed in DHCP Offer messages. Compare these against a list of authorized DHCP servers/MACs. Flag Offers from unauthorized sources. Additionally, correlate Offer messages with preceding client Discover broadcasts (using the 'client_mac' and transaction ID). Flag Offer messages that do not have a corresponding recent Discover message from the same client MAC address on the same network segment within a short timeframe."
          },
          "Changes in DNS server configuration on hosts coinciding with DHCP lease renewals, or detection of DHCPv6 INFORMATION-REQUEST responses from unauthorized servers.": {
            "Data": "Windows Event ID 1014; Zeek dhcp.log",
            "Data Platform": "Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 1014 (Microsoft-Windows-DNS Client Events) on endpoints, which logs changes to the DNS server list. Correlate these changes with DHCP lease renewal events. Identify instances where the DNS server changes to an unexpected or known malicious IP. Additionally, analyze Zeek dhcp.log for DHCPv6 messages (type 11 - INFORMATION-REQUEST) and identify the source IPs of responses. Flag responses from unauthorized DHCPv6 servers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to collect data via DHCP spoofing? (TA0009 - Collection)": {
      "Indicators": {
        "T1557.003 - DHCP Spoofing": {
          "Network traffic showing clients attempting to connect to known malicious IPs or unexpected destinations after receiving DHCP offers.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "After identifying hosts potentially receiving malicious configurations (from Zeek dhcp.log analysis), filter Zeek conn.log for traffic originating from these hosts. Analyze destination IPs and protocols. Correlate with threat intelligence feeds or identify connections to unusual external destinations, potentially indicating redirection for sniffing or C2."
          },
          "Detection of unauthorized or multiple DHCP server responses on the network segment.": {
            "Data": "Zeek dhcp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dhcp.log for Discover/Request messages followed by Offer/ACK responses from multiple distinct server IP addresses on the same network segment. Identify Offer messages providing conflicting network parameters (e.g., different DNS/Gateway IPs) for the same client request. Count the number of unique server IPs responding to client requests per segment and flag segments with multiple responders using frequency analysis."
          },
          "Detection of client network traffic being redirected to unusual or unauthorized intermediary systems, especially unencrypted protocols (e.g., HTTP, SMB, FTP) after receiving a DHCP lease.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek smb_cmd.log; Zeek ftp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections originating from clients potentially affected by DHCP spoofing (identified by other evidence). Identify traffic flows where the destination IP or next hop deviates from expected routing paths using correlation analysis with network topology. Specifically, analyze unencrypted protocol logs (http.log, smb_cmd.log, ftp.log) for connections to unexpected intermediary IPs. Use descriptive statistics on bytes transferred to identify anomalous data collection volumes."
          },
          "Detection of credential harvesting attempts or successful credential capture in network traffic logs following a potential DHCP spoofing event.": {
            "Data": "Zeek conn.log; Zeek smb_cmd.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to suspicious IPs (identified via DHCP spoofing evidence). Specifically examine Zeek smb_cmd.log and http.log for signs of NTLM authentication attempts or cleartext credentials being sent to unusual destinations. Use pattern matching or regex to identify potential credential exfiltration attempts within traffic flows linked to potential AiTM positions. Correlate with other security alerts and identify sessions involving credentials."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]