[
  {
    "Has the adversary accessed credentials via command history? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1552.003 - Bash History": {
          "Network transfer of configuration or history files from sensitive systems.": {
            "Data": "Zeek filetrans.log; Zeek http.log; Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (filetrans.log, http.log, ssh.log) for transfer of known configuration or history file names (e.g., '.bash_history', '.ssh/', '/etc/shadow') originating from internal systems to external destinations. Use correlation analysis to identify unusual spikes in file transfer volume or transfers involving sensitive file names."
          },
          "Suspicious login attempts using credentials potentially obtained from host systems.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event IDs 4624/4625 and Zeek conn.log for failed/successful logins to critical systems or services using newly observed user accounts or patterns (e.g., logins from unusual IPs, logins immediately following suspected host compromise). Correlate these logins with potential compromise timings based on other indicators using time series analysis."
          },
          "Execution of command-line utilities targeting known bash history file paths on relevant systems.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations. Filter for command lines containing keywords like '.bash_history' and executable names commonly used to read files (`cat`, `more`, `less`, `grep`) or invoke bash/WSL (`bash`, `wsl`). Analyze frequency of such events per host/user. Identify sudden spikes or executions by unusual users/processes using frequency analysis or time series analysis."
          },
          "Network connections following command execution containing credentials potentially sourced from history.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing potential credentials (e.g., `-p<password>`, `password=` parameters). Use regular expressions to identify credential patterns. Correlate these command execution events with Zeek conn.log entries showing network connections (e.g., SSH, FTP, database traffic) originating from the same host/user shortly after the command execution. Use correlation analysis to link potential credential exposure events to subsequent authentication attempts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]