[
  {
    "Is the adversary maintaining persistence on the domain controller via patched authentication? (TA0003 - Persistence)": {
      "Indicators": {
        "T1556.001 - Domain Controller Authentication": {
          "Calls to OpenProcess targeting lsass.exe on a domain controller from unusual processes or contexts.": {
            "Data": "Windows Event ID 4656",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656 on domain controllers for handle requests to lsass.exe (Object Type 'Process', Object Name containing 'lsass.exe'). Identify source processes and process IDs. Analyze frequency and entropy of source processes accessing lsass. Flag requests from processes other than legitimate system processes or security software."
          },
          "Consistent successful logins for multiple accounts from a single source or unusual times, inconsistent with normal user behavior across systems.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 on domain controllers. Group successful logins by source IP and account name. Identify source IPs associated with logins for a high diversity of accounts (using entropy). Analyze login timestamps over time for accounts/source IPs using time series analysis to spot consistent out-of-hours activity or sudden changes in frequency/timing."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by patching domain controller authentication? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1556.001 - Domain Controller Authentication": {
          "Modification events targeting authentication-related system DLLs (cryptdll.dll, samsrv.dll) on a domain controller.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on domain controllers for write access attempts (Accesses 'WriteData (or AddFile)') targeting the file paths of cryptdll.dll and samsrv.dll. Identify the process and user attempting the modification. Correlate with process creation events (Event ID 4688) to understand the source executable."
          },
          "Successful logins occurring for an account when the user has no physical or VPN access, or simultaneous logins from disparate locations/systems.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4624 (successful logins) with network connection logs (Zeek conn.log) based on timestamp, source IP, and destination IP (domain controller). Identify login events where the source IP does not correlate with expected physical or VPN access based on other systems/logs. Use correlation analysis to link login events on the DC to the network session originating from a potentially unauthorized source."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary accessing credentials or accounts via patched domain controller authentication? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1556.001 - Domain Controller Authentication": {
          "Detection of a single account logged into multiple systems simultaneously or multiple accounts logged into the same machine simultaneously.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 events across all relevant systems (DCs, servers, endpoints). Group successful logins by account name and timestamp. Identify instances where a single account appears to log into multiple distinct systems within a short timeframe (e.g., impossible concurrent logins) or where multiple distinct accounts log into the exact same system simultaneously (high overlap of AccountName/TargetSystem/Timestamp). Use correlation analysis to identify accounts/systems exhibiting this pattern."
          },
          "Successful logins from locations or systems geographically or logically impossible for the legitimate user to access concurrently.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 (successful logins). Extract source IP addresses and timestamp for each successful login. Geolocate source IPs. For each account, calculate the 'travel speed' required between consecutive logins from different geolocations. Flag logins requiring impossible travel speeds between locations based on timestamps. Use descriptive statistics (min/max time between logins per account, distance between locations) to identify outliers."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]