[
  {
    "Is the adversary using alternate authentication material to bypass defense mechanisms? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1550 - Use Alternate Authentication Material": {
          "Successful network authentications (e.g., via Kerberos, NTLM) without corresponding interactive logins or expected precursor events.": {
            "Data": "Windows Event ID 4624, Zeek kerberos.log, Zeek ntlm.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4624 logs, filtering for Logon Type '3' (Network) or other non-interactive types. Correlate these events with corresponding interactive logon events (Logon Type '2', '10'). Identify instances of network logins without a matching interactive login on the destination host within a reasonable time window. Analyze Zeek kerberos.log and ntlm.log for anomalies in authentication flow."
          },
          "Authentication events indicating logon types or network protocols typically associated with credential reuse (e.g., Network Cleartext, RemoteInteractive).": {
            "Data": "Windows Event ID 4624, Zeek kerberos.log, Zeek ntlm.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Windows Event ID 4624 logs specifically for unusual Logon Types (e.g., 8 NetworkCleartext, 10 RemoteInteractive initiated without preceding interactive logon). Analyze Zeek kerberos.log and ntlm.log for successful authentications using protocols or methods not commonly used in the environment, potentially employing entropy analysis on authentication parameters if sufficient data variability exists."
          }
        }
      }
    }
  },
  {
    "Is the adversary using alternate authentication material for lateral movement? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1550 - Use Alternate Authentication Material": {
          "The same account is successfully logging into multiple distinct machines concurrently.": {
            "Data": "Windows Event ID 4624, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract successful login events (Windows Event ID 4624) or network connection logs (Zeek conn.log) attributed to the same user/account. Group events by user and timestamp. Identify instances where the same user account appears to log in or initiate network connections to multiple distinct machines within a very short time frame (e.g., seconds). Use correlation analysis to measure the likelihood of simultaneous access for specific accounts."
          },
          "Process creation or remote service execution attributed to accounts without corresponding network logon events or from unusual source machines.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4769, Zeek dce_rpc.log, Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events, specifically noting the Creator Process ID/Name and the Security ID (SID) of the user the new process is running under. Correlate these process creation events with authentication logs (Event ID 4624, Zeek logs) to identify cases where a process starts remotely under an account without a corresponding interactive logon on the target host. Analyze Zeek dce_rpc.log and smb.log for activity indicative of remote command execution (e.g., PsExec, WMI) and investigate the associated user accounts and source IPs."
          }
        }
      }
    }
  }
]