
[
  {
    "Has the adversary accessed credentials via container APIs? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.007 - Container API": {
          "Container API access from known malicious IP addresses or using User-Agent strings associated with known hacking or scanning tools.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join the source IP addresses from Zeek conn.log and http.log traffic targeting container API ports (e.g., Docker 2375/2376, K8s 6443/443, kubelet 10250) with a continuously updated threat intelligence feed of malicious IPs. Separately, scan Zeek http.log for User-Agent strings associated with container exploitation tools or scanners and alert on any matches."
          },
          "Direct access attempts to sensitive API endpoints or paths known to expose secrets, credentials, or allow command execution within containers.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and monitor a watchlist of sensitive API paths for Kubernetes (e.g., `/api/v1/secrets`, `/api/v1/namespaces/.*/pods/.*/exec`) and Docker (e.g., `/containers/.*/logs`, `/containers/.*/json`, `/exec/.*/start`). Filter Zeek http.log for HTTP GET/POST requests to these URI patterns. Alert on any access from unauthorized sources or any access at all to highly sensitive paths like 'exec'. Use frequency analysis on access to these paths to spot unusual patterns from specific sources."
          },
          "A sequence of API calls from a single source involving broad discovery followed by targeted access to Kubernetes secrets or pod execution commands.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "In Zeek http.log, monitor for sources (IP/account) making broad discovery calls (e.g., accessing `/api`, `/apis`). Correlate these sources with subsequent requests within a short time window (e.g., 5-15 minutes) to sensitive endpoints like `/api/v1/secrets` or paths containing `/pods/exec`. Use correlation analysis to link the discovery and access phases. Calculate the entropy of API paths accessed by a single source; a pattern of low entropy (broad discovery) followed by high-entropy, targeted access can be suspicious."
          },
          "Anomalous volume, frequency, or timing of API calls to container management endpoints that deviate from established baselines for a given source or the overall environment.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal API interaction for container management services, including request rates, data transfer volumes, and types of API calls per source. Use time series analysis on Zeek http.log and conn.log data to detect significant spikes or deviations in API call volume or data transfer size from specific sources. Use descriptive statistics (mean, stddev, IQR) on the number of unique endpoints accessed per source per session; flag outliers that access an unusually high number of resources."
          },
          "High-volume retrieval of container logs from a single source, potentially indicating an attempt to find credentials or sensitive information printed to logs.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests to container log endpoints (e.g., Docker's `/containers/.*/logs`, Kubernetes' `/api/v1/namespaces/.*/pods/.*/log`). Establish a baseline for normal log retrieval volume (bytes) and frequency per user/source. Use descriptive statistics and outlier detection (e.g., Z-score, IQR) to flag sources that retrieve an anomalously large volume of logs from one or multiple containers in a short period. This is especially suspicious if the source is an external IP or a non-administrative user account."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
