[
    {
        "information_requirement": "Is the adversary attempting to gain access to credentials using AS-REP Roasting?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1558.004",
                "name": "AS-REP Roasting",
                "evidence": [
                    {
                        "description": "AS-REP Roasting attempts originating from a source hostname or IP address on a watchlist or associated with previously compromised systems.",
                        "data_sources": [
                            "Windows Event ID 4768",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4768 and Zeek kerberos.log for any AS-REP Roasting indicators (e.g., requests for accounts with pre-auth disabled). Correlate the source workstation name ('Client Name' in 4768) or IP address ('Client Address' in 4768, 'client' in kerberos.log) against a CTI feed of malicious IPs and an internal watchlist of suspicious/compromised systems. Generate a high-priority alert on any match."
                    },
                    {
                        "description": "Execution of common AS-REP Roasting tools or scripts identified by process name or specific command-line arguments.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) with command-line auditing enabled across the environment. Create detection rules using regular expressions to match known AS-REP Roasting tool names (e.g., 'Rubeus.exe', 'GetUserSPNs.py') or specific command-line parameters (e.g., 'asreproast', 'Get-NetUser -ASRepRoast'). Investigate any matching process execution."
                    },
                    {
                        "description": "Kerberos TGT requests specifically targeting user accounts where Kerberos pre-authentication is disabled.",
                        "data_sources": [
                            "Windows Event ID 4768"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Windows Event ID 4768 logs on Domain Controllers for events where the 'Ticket Options' field has the '0x40000000' (DONT_REQ_PREAUTH) flag set (this can be checked with a bitwise AND operation). While some requests may be legitimate, any such request should be scrutinized. Correlate the target account with a list of accounts that are authorized to have this flag set. A high volume of these requests or requests targeting sensitive accounts should be investigated immediately."
                    },
                    {
                        "description": "A single source host generating an anomalously high volume of Kerberos TGT requests, especially when targeting multiple distinct user accounts with pre-authentication disabled.",
                        "data_sources": [
                            "Windows Event ID 4768"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On Domain Controllers, aggregate Windows Event ID 4768 events by 'Client Address' over short time windows (e.g., 5-10 minutes). Establish a baseline for TGT request rates and the number of distinct target accounts per source. Use statistical outlier detection (e.g., Z-score, IQR on request counts) to flag sources with unusually high request rates or those targeting an abnormally high number of distinct accounts. Heavily weight alerts for sources primarily making requests where the 'Ticket Options' field indicates pre-authentication is disabled."
                    },
                    {
                        "description": "Anomalous increase in requests for weak RC4-HMAC encryption for Kerberos tickets, deviating from established baselines for users or the environment, confirmed via both host and network logs.",
                        "data_sources": [
                            "Windows Event ID 4768",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal Kerberos ticket encryption types used in the environment. Monitor Windows Event ID 4768 for 'Ticket Encryption Type' of '0x17' (RC4) and Zeek kerberos.log for AS-REP messages with 'cipher=3' (RC4). Use time series analysis to detect sudden spikes or shifts toward RC4 usage from specific hosts or for specific users. Correlate host and network events. A significant, unexplained increase in RC4-based requests, especially from a single source or targeting accounts with pre-auth disabled, is a strong indicator of enumeration and potential AS-REP Roasting."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
