
[
  {
    "Has the adversary accessed private cryptographic keys or certificates? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.004 - Private Keys": {
          "Execution of a process with a file hash known to be associated with credential theft tools that target private keys.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Windows Event ID 4688). Compute or retrieve the hash of the executable file for each new process and correlate it against a high-confidence threat intelligence feed of known malicious tool hashes (e.g., specific versions of Mimikatz, LaZagne, SharpDPAPI) that are known to perform private key theft. Alert immediately on any matches."
          },
          "Execution of common system utilities (e.g., find, grep, PowerShell, certutil) with command-line arguments explicitly searching for, copying, or exporting private key files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688). Use regular expression matching on the `CommandLine` field to detect patterns indicative of searching for or exporting private keys. Examples include `find / -name '*.key'`, `grep -r 'PRIVATE KEY'`, `powershell -c 'gci -Recurse -Include *.pem,*.key'`, or `certutil -exportPFX`. This targets the specific command pattern, which is more resilient than searching for a single tool artifact."
          },
          "Direct read access on sensitive private key files (e.g., *.key, *.pem, *.pfx) or directories (e.g., ~/.ssh/, C:\\ProgramData\\Microsoft\\Crypto\\) by non-standard processes.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure and monitor System Access Control Lists (SACLs) to generate Windows Event ID 4663 for read access on sensitive files and directories known to store private keys. Correlate access events with the process that initiated them (`ProcessName` in Event ID 4663). Establish a baseline of legitimate processes (e.g., web servers, specific applications) and alert on access from unexpected processes such as `powershell.exe`, `cmd.exe`, `rundll32.exe`, or other living-off-the-land binaries."
          },
          "A user or process accessing an unusually high number of private key files or accessing them at anomalous times, deviating from established baselines.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For legitimate processes and users that require key access, establish a baseline of normal activity (e.g., frequency of access, time of day, typical number of files accessed per session) using historical Windows Event ID 4663 data. Continuously monitor for significant deviations using statistical methods like Inter-Quartile Range (IQR) or Z-scores. Flag events such as a user who typically accesses one key file per day suddenly accessing dozens, or access occurring at 3 AM from an account that only works during standard business hours."
          },
          "Anomalous certificate-based authentication, such as logins from geographically unusual locations, new devices, or systems not historically associated with the key's legitimate owner.": {
            "Data": "Windows Event ID 4624; Zeek ssh.log; Zeek ssl.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful certificate-based logins (Windows Event ID 4624 Logon Type 3 with certificate info; Zeek ssh.log successful publickey authentication) with the associated user account and source IP address. Compare the source IP's geolocation and historical access patterns for that user's certificate. Use descriptive statistics and frequency analysis to flag 'impossible travel' scenarios or logins from source systems or subnets that have never used that certificate before. Investigate any such anomalous successful authentications."
          },
          "A sequence of actions indicating key aggregation and staging for exfiltration, such as mass-reading of key files followed by archival and an anomalous outbound network connection.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and hunt for a sequence of events across data sources: 1. A process (e.g., `powershell.exe`, `tar.exe`) reads multiple private key files in a short time window (detected via Windows Event ID 4663). 2. The same process creates an archive file (e.g., `.zip`, `.tar.gz`) (detected via Windows Event ID 4688 command-line arguments). 3. An anomalous outbound network connection (e.g., to a rare external IP, over a non-standard port) originates from the host shortly thereafter, potentially transferring a file of a similar size to the created archive (detected via Zeek conn.log `orig_bytes` field). Use correlation analysis to link these events by hostname, process ID, and timestamp within a defined time window (e.g., 15 minutes)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
