```json
[
  {
    "Is the adversary attempting to gain credential access using Adversary-in-the-Middle? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1557 - Adversary-in-the-Middle": {
          "Detection of SSL/TLS certificates known to be associated with Adversary-in-the-Middle (AiTM) phishing kits or malicious infrastructure when clients access sensitive services.": {
            "Data": "Zeek x509.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and regularly update a list of known malicious SSL/TLS certificate fingerprints (SHA1/SHA256), issuer details, or subject names associated with AiTM campaigns. Monitor Zeek x509.log for all observed server certificates. Compare certificate attributes against the malicious list. Alert on any matches. Additionally, monitor Zeek ssl.log for `server_name` (SNI) values resolving to IP addresses known to host AiTM infrastructure, cross-referencing with threat intelligence feeds."
          },
          "Detection of specific network protocol anomalies or tool-specific artifacts indicative of AiTM techniques like ARP spoofing, DNS manipulation, or LLMNR/NBT-NS poisoning using known attack patterns.": {
            "Data": "Zeek conn.log; Zeek notice.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusual ARP/NDP traffic patterns (e.g., gratuitous ARPs unexpectedly changing MAC address for critical gateways, frequent ARP replies from a non-authoritative source for the same IP). Analyze Zeek notice.log for specific AiTM-related notices (e.g., `ARP_Spoofing`, `DNS_Spoofing_Attack`, `LLMNR_Spoofing_Attack`, `NBTNS_Spoofing_Attack`). On endpoints, monitor Windows Event ID 4688 for execution of known AiTM tools (e.g., Responder, Ettercap, Bettercap) by correlating process names or command-line arguments with known tool signatures/patterns. Define patterns for high-frequency LLMNR/NBT-NS responses from a single host claiming multiple unresolved names."
          },
          "Widespread or targeted detection of unencrypted or weakly encrypted sessions (e.g., HTTP instead of HTTPS, older TLS versions like TLS 1.0/1.1, weak ciphers) to services that typically enforce strong encryption, suggesting active downgrade attacks for credential interception.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for connections using deprecated TLS versions (TLS 1.0, 1.1, SSLv3) or weak cipher suites (e.g., those vulnerable to EXPORT ciphers). Monitor Zeek conn.log for HTTP traffic to known HTTPS-only services. Establish baselines for expected TLS versions and cipher strength for critical internal and external services. Use time-series analysis on the proportion of weak/unencrypted sessions to detect anomalous increases. Correlate hosts initiating or accepting downgraded connections with other suspicious activities to identify potential AiTM targets."
          },
          "Multiple internal hosts anomalously resolving common external services (e.g., SSO portals, financial sites, cloud services) to the same unexpected internal or non-corporate IP address, indicative of DNS poisoning aimed at credential interception.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously analyze Zeek dns.log. Identify DNS queries for high-value external domains (e.g., login.microsoftonline.com, company SSO portal, major banking sites) that resolve to internal IP addresses not designated as legitimate DNS forwarders/resolvers or to external IP addresses not matching known legitimate records for those services. Calculate the frequency of such resolutions and the number of unique client IPs resolving to the same suspicious IP. Use descriptive statistics (count of queries, unique client IPs per resolved suspicious IP) and anomaly detection algorithms (e.g., a sudden surge in clients resolving a critical service to a new, unverified IP) to identify DNS poisoning events."
          },
          "Anomalous patterns of credential submissions, such as repeated submissions to different domains from the same host after a suspected AiTM event, or submission of corporate credentials to domains with suspicious characteristics (e.g., typosquatted, non-standard TLDs, recently registered) potentially served via AiTM.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "If AiTM is suspected (e.g., due to DNS anomalies from Zeek dns.log or SSL certificate issues from Zeek ssl.log), scrutinize subsequent Zeek http.log POST requests from affected client IPs. Look for submissions to login forms on domains that are typosquatted, use unusual TLDs, or present suspicious SSL certificates (e.g., self-signed, short validity, mismatched common name). Correlate patterns of multiple login attempts by a user to different suspicious sites in a short timeframe. Use entropy measures or regular expressions to heuristically identify credential-like data structures in POST bodies to these destinations, focusing on deviations from baseline submission patterns."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary collecting sensitive data using Adversary-in-the-Middle? (TA0009 - Collection)": {
      "Indicators": {
        "T1557 - Adversary-in-the-Middle": {
          "Network traffic containing specific sensitive keywords, data structures (e.g., regular expressions for credit card numbers, social security numbers, internal project codenames), or known sensitive file hashes being routed through or to an unauthorized AiTM node.": {
            "Data": "Zeek conn.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "If an AiTM node is suspected or identified (e.g., through ARP spoofing alerts, anomalous DNS responses), monitor network traffic flowing through or destined to it using Zeek conn.log. Employ Zeek scripts or integrate with IDS/DLP capabilities to inspect payloads (where feasible and permissible) for predefined sensitive keywords, regular expressions matching PII/financial data, or internal project codenames. Monitor Zeek files.log for transmission of files with known sensitive hashes or specific file types (e.g., .pst, .kdbx) to/through the AiTM node. Alert on confirmed data leakage matching these selectors."
          },
          "Detection of specific data manipulation patterns, such as content injection (e.g., malicious iframes, scripts into HTTP traffic) or modification of downloaded files, characteristic of known AiTM tools or techniques used for further collection or persistence.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for unexpected content modifications in HTTP responses from legitimate servers when an AiTM is suspected. Look for injection of unauthorized JavaScript, iframes pointing to malicious sites, or modification of HTTP security headers (e.g., removing CSP). Monitor Zeek files.log for discrepancies in file hashes or content of executables/documents downloaded through a suspected AiTM channel when compared to known good versions or expected checksums. Maintain and update a list of patterns associated with known AiTM tool injection or file modification techniques."
          },
          "Significant deviations in network traffic flows from internal hosts, such as routing through an unexpected intermediary node or connecting to unusual destinations, observed after other AiTM indicators (e.g., ARP spoofing, DNS anomalies) have been detected.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline network traffic patterns for internal hosts and network segments (e.g., common communication peers, destinations, protocols, data volumes). Monitor Zeek conn.log for internal traffic being unexpectedly routed via a new internal 'choke point' or for connections to external/internal destinations not aligning with established patterns, especially after other AiTM indicators are observed. Use clustering analysis (e.g., K-means on connection features like destination IP, port, protocol, byte counts) to identify atypical traffic flows. Employ graph analysis to visualize new, unexpected communication paths or intermediary nodes. Correlate with Zeek dns.log to check if anomalous DNS responses are directing traffic to these intermediary nodes."
          },
          "A sudden increase in SSL/TLS certificate validation errors across multiple clients, or frequent presentation of self-signed or unexpectedly changed certificates for internal or external services, potentially enabling traffic interception for data collection.": {
            "Data": "Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for certificate validation statuses (e.g., `validation_status` field indicating errors like 'self_signed_certificate_in_chain', 'unable_to_get_local_issuer_cert', 'host_name_mismatch'). Monitor Zeek x509.log for newly observed or unexpectedly changed certificates for known sensitive internal or external services, especially the appearance of self-signed certificates, certificates from unexpected/untrusted Certificate Authorities (CAs), or certificates with very short validity periods. Use time series analysis on the rate of certificate validation errors or changes network-wide or for specific critical services. High entropy in certificate issuers or subjects for a specific service accessed by multiple clients can indicate AiTM. Correlate these events with client IP addresses and requested server names."
          },
          "An internal host, not authorized as a network gateway or proxy, observed acting as a significant intermediary or collection point for traffic between multiple other internal systems, indicating potential widespread data collection via AiTM.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for internal-to-internal traffic flows. For each internal IP address, calculate network centrality metrics (e.g., degree centrality, betweenness centrality using source/destination pairs) and total relayed traffic volume (bytes in vs. bytes out to other internal peers). Establish baselines for these metrics for all internal hosts. Use statistical methods (e.g., percentile-based outlier detection, Inter-Quartile Range) or graph-based anomaly detection to identify internal hosts that suddenly or consistently exhibit characteristics of a central communication hub or data aggregator without legitimate cause (i.e., not a known server, router, or authorized proxy). Investigate such nodes for AiTM activity facilitating data collection."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```