[
  {
    "Has the adversary collected credentials via chat messages? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1552.008 - Chat Messages": {
          "Presence of adversary tools or suspicious process activity related to accessing chat application data on endpoints or servers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on endpoints and servers that host chat applications or user profiles. Correlate suspicious process names (known adversary tools, scripting engines accessing chat directories) with network connections (via Zeek logs). Use frequency analysis on process names or command-line arguments to identify rare or unusual executions."
          },
          "Suspicious network traffic patterns or API calls related to chat services, potentially indicating unauthorized data extraction.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and ssl.log for connections to known chat service domains/IPs. Identify unusual data transfer volumes (using descriptive statistics, IQR outliers) associated with these connections, especially from internal hosts to external chat services. Analyze HTTP requests (http.log) for suspicious API endpoints or large data exfiltration patterns. Use time series analysis to detect spikes in chat-related network activity."
          },
          "Access attempts by unusual processes to chat application data files or directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs to log read access to common chat application data directories (e.g., %APPDATA%\\Slack, %APPDATA%\\Microsoft Teams, Jira/Trello local data stores). Monitor Windows Event ID 4663 for access attempts on these directories/files by processes other than the legitimate chat application process or known system processes. Use frequency analysis on the accessing process name and target file paths to identify rare or anomalous accesses."
          },
          "High volume or unusual sequence of API interactions with chat services from an internal host.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for requests to known chat service API endpoints (e.g., api.slack.com, graph.microsoft.com, api.trello.com) originating from internal hosts. Identify hosts exhibiting a significantly higher frequency or burst of API requests compared to their historical baseline or peer groups using time series analysis or statistical process control methods. Look for sequences of API calls indicative of searching messages or exporting data. Correlate these observations with Zeek conn.log for associated data transfer volumes to detect potential exfiltration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]