[
  {
    "Is the adversary attempting to evade defenses by creating hidden user accounts? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.002 - Hidden Users": {
          "Modification of Windows Registry key \"SpecialAccounts\\UserList\" to hide a user account.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (Registry Value Set) and 4688 (Process Creation) on Endpoints and Servers. Filter for modifications to the key `HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList`. Investigate any entries created or modified with a value of `0`. Analyze the process that made the change (Event ID 4688) for anomalous behavior."
          },
          "Command execution or file modification to hide a user account on macOS or Linux systems (e.g., dscl command, plist modification, gsettings).": {
            "Data": "Windows Event ID 4688; Zeek fileinfo.log; Zeek command.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Process Creation logs (Windows Event ID 4688, or equivalent forwarded events) and file modification/command logs (Zeek fileinfo.log, Zeek command.log, or equivalent forwarded events). Look for execution of commands like `dscl`, `chflags`, `gsettings`. Monitor file modifications to `/Library/Preferences/com.apple.loginwindow.plist` looking for `Hide500Users` set to TRUE or changes to files/directories indicating hidden flags. Use correlation analysis between process execution and file modifications."
          },
          "Authentication or system activity attributed to a user account that is not listed on the login screen or in standard user lists.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4672; Zeek conn.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Regularly compare user accounts observed in authentication logs (Windows Event ID 4624), special logon logs (Windows Event ID 4672), or system activity logs (like Zeek conn.log user association if available) against the list of users displayed on login screens or standard user management interfaces. Identify user SIDs/names appearing in logs but absent from standard user lists or `SpecialAccounts\\UserList` where value is not 0. Use frequency analysis to identify users with low overall activity but specific high-privilege actions."
          },
          "Creation of a new user account immediately followed by commands or registry modifications associated with hiding user accounts or setting a userID below 500 (macOS).": {
            "Data": "Windows Event ID 4720; Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate user account creation events (Windows Event ID 4720) with subsequent process creation events (Windows Event ID 4688) or registry modifications (Windows Event ID 4657) occurring within a short timeframe (e.g., 1 minute) on the same host. Look for process command lines indicative of hiding actions (`dscl . create -u <user> IsHidden 1`, `gsettings`, `chflags hidden`) or registry edits to `SpecialAccounts\UserList`. For macOS, identify new users created with UserIDs < 500 and correlate with plist modifications (`/Library/Preferences/com.apple.loginwindow.plist`). Use time series analysis to detect the near-simultaneous occurrence of user creation and hiding activities."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]