```json
[
  {
    "Has the adversary collected data using custom archiving methods? (TA0009 - Collection)": {
      "Indicators": {
        "T1560.003 - Archive via Custom Method": {
          "Execution of processes with command-line arguments, or process image names/hashes, matching known indicators of tools or scripts that perform custom data archiving (e.g., XOR encryption, custom compression routines).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs. Compare process image names, full path, and hashes against a threat intelligence list of known malware or utilities that implement custom archiving. Scrutinize command-line arguments for patterns indicative of custom scripting (e.g., `powershell.exe -nop -w hidden -enc ...`, `cscript.exe //Nologo ...`, calls to `rundll32.exe` with unusual DLLs/functions) that might be used to invoke custom archiving logic. Maintain and regularly update this list of selectors based on threat intelligence."
          },
          "A non-standard process exhibiting a pattern of operations involving extensive file reads from diverse sensitive locations followed by writes to a consolidated output file in a common staging area, without using known archiving utility names.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) for high-volume file read operations (e.g., >100 distinct files accessed by a single process within 5 minutes) from multiple directories (e.g., User Documents, Desktop, AppData folders) followed by file write operations to a single or few files in staging locations (%TEMP%, C:\\Users\\Public\\, %APPDATA%). Correlate these activities with the parent process (from Windows Event ID 4688) and filter out known legitimate backup/archiving software using an allowlist. Use descriptive statistics to establish baselines for file read/write counts per process and identify outliers using percentile analysis or Inter-Quartile Range (IQR)."
          },
          "Network egress traffic with payload characteristics suggestive of custom encryption or compression (e.g., high byte entropy, lack of common protocol signatures) following suspicious host-based collection activities.": {
            "Data": "Zeek conn.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For outbound Zeek conn.log flows originating from hosts flagged by host-based collection patterns, analyze payload characteristics if partial/full capture is available (e.g., via Zeek's file extraction capabilities in files.log or integrated PCAP analysis). Calculate byte entropy on payloads; consistently high entropy (e.g., >7.5 bits/byte over a significant data segment) in traffic not matching known encrypted protocols (TLS, SSH) can indicate custom encryption. Look for absence of clear-text protocol markers or known file headers. This may require offline analysis or specialized tools integrated with Zeek. Correlate high entropy flows with connections to unusual ports or non-categorized domains identified via Zeek dns.log."
          },
          "Anomalous process behavior, such as a legitimate process spawning unusual child processes or a rarely used utility initiating significant data access and manipulation, potentially indicative of custom archiving script execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for unusual parent-child process relationships (e.g., an Office application spawning cmd.exe or powershell.exe which then accesses many files via Event ID 4663, or a common utility like a system binary initiating unexpected file reads). Establish baselines for typical process chains and file access patterns for common processes using descriptive statistics. Use graph analysis or correlation rules to detect deviations, such as a process suddenly accessing an unusually large number of files or file types it doesn't normally interact with. Flag outliers based on frequency of process chains or volume of data accessed."
          },
          "Creation of large, single files in atypical staging locations (e.g., %TEMP%, C:\\Windows\\Tasks, Recycle Bin) by processes not authorized for such activity, followed by outbound network connections from the same host.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation ('WriteData' or 'CreateFile') events, particularly for large files (e.g., >10MB, threshold adjustable based on environment) in common staging directories or unusual locations by processes identified via Event ID 4688 that are not standard backup/archiving tools. Use frequency analysis and process whitelisting for these locations. Correlate such file creation events (timestamp, host) with subsequent anomalous outbound network connections (unusual destination, port, data volume) from the same host using Zeek conn.log. Use time series analysis to correlate spikes in file staging activity with spikes in data egress."
          },
          "Anomalous outbound network traffic characterized by unusually large data volumes, sustained transfer durations, connections to unknown or suspicious destinations, or atypical communication frequencies, especially from hosts with prior suspected collection activity.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound connections from hosts exhibiting suspicious staging or process behaviors. Profile typical outbound traffic per host/subnet (bytes transferred, connection duration, common destinations, ports) using historical data. Use statistical methods (e.g., IQR or standard deviation from mean for flow sizes and durations, potentially box-plots for visualization; linear regression to detect trend changes in data volumes over time) to identify significant deviations. Monitor Zeek dns.log for queries to newly registered domains or dynamic DNS services from these hosts prior to or during large outbound transfers. Use entropy measures on destination FQDNs or IP addresses accessed by a host to detect scattershot exfiltration attempts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```