[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by using downgraded system features?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1562.010",
                "name": "Downgrade Attack",
                "evidence": [
                    {
                        "description": "Loading of known vulnerable drivers or execution of tools with specific file hashes known to facilitate security feature downgrade attacks.",
                        "data_sources": [
                            "Windows Event ID 7045",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for the creation of new services (Windows Event ID 7045) or process execution (Windows Event ID 4688) involving files whose names or hashes match a maintained list of known vulnerable drivers (e.g., from the LOLDrivers project) or tools used for downgrade attacks. Inner join observed file hashes against a threat intelligence feed of malicious hashes. Alert on any match and investigate the parent process and subsequent activity."
                    },
                    {
                        "description": "Execution of PowerShell with a legacy version argument (e.g., v2) to bypass modern security controls like AMSI and extensive logging.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events where the command line includes 'powershell.exe -v 2' or 'powershell.exe -version 2'. Correlate this with a lack of corresponding script block logs (Windows Event ID 4104), which are disabled in v2. Use frequency analysis to identify hosts where this command is rare or has never been seen before. This pattern is highly indicative of intentional defense evasion."
                    },
                    {
                        "description": "Direct modification of specific registry keys to change security configurations to a less secure, known-vulnerable state, such as disabling virtualization-based security or weakening TLS protocols.",
                        "data_sources": [
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 (A registry value was modified) for changes to critical security configuration keys. Create high-fidelity alerts for specific downgrade patterns, such as `HKLM\\SYSTEM\\CurrentControlSet\\Control\\DeviceGuard\\Scenarios\\HypervisorEnforcedCodeIntegrity\\Enabled` being set to `0`, `HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\DisableAntiSpyware` being set to `1`, or modifications under `HKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\SCHANNEL\\Protocols` to disable TLS 1.2+. Correlate these changes with the parent process responsible for the modification."
                    },
                    {
                        "description": "Anomalous downgrade of network connection security, such as SSL/TLS stripping or the observed use of deprecated cryptographic protocols for sensitive communications.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for traffic on traditionally encrypted ports (e.g., 443, 993, 995) using unencrypted protocols like HTTP, IMAP, or POP3. Analyze Zeek ssl.log for the negotiation of deprecated TLS versions (e.g., SSLv3, TLS 1.0/1.1) or weak cipher suites, especially for connections to high-value internal or external services. Use time series analysis to detect sudden increases in weak protocol usage across the network, and use correlation analysis to link these events to specific internal hosts, which may indicate a local Man-in-the-Middle attack."
                    },
                    {
                        "description": "A sequence of actions where a process or script attempts to disable multiple security features (e.g., AV/EDR, logging, code integrity) before executing a payload.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate multiple security tampering commands (e.g., `Set-MpPreference`, `net stop <service>`, `bcdedit /set`, registry edits via `reg.exe`) originating from the same parent process or script within a short time window (e.g., 1-5 minutes). Use sequence analysis to detect a behavioral pattern of 'disable-then-execute,' where a cluster of defense evasion commands is immediately followed by the execution of an unsigned binary or suspicious script. Calculate the entropy of system commands run by a script; a high number of diverse, security-related commands is a strong indicator of malicious intent."
                    },
                    {
                        "description": "Unauthorized modifications to Boot Configuration Data (BCD) or the EFI System Partition, indicating behavioral attempts to disable Secure Boot or load an untrusted operating system or hypervisor.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of legitimate modifications to boot configuration (e.g., during Windows Updates). Monitor for unauthorized write access (Windows Event ID 4663) to critical boot files (e.g., `bootmgr`, `winload.efi`, files in `\\EFI\\Microsoft\\Boot\\`). Monitor for command-line execution (Windows Event ID 4688) of `bcdedit.exe` with arguments that disable security features (e.g., `/set testsigning on`, `/set nointegritychecks on`). Correlate these with registry modifications (Windows Event ID 4657) to BCD keys (under `HKLM:\\BCD00000000`) outside of authorized maintenance windows. Use linear regression to identify if a host's reboot events are correlated with prior suspicious activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
