[
  {
    "Has the adversary exfiltrated sensitive data using text storage sites? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1567.003 - Exfiltration to Text Storage Sites": {
          "Network connections from internal systems to known text storage sites (e.g., pastebin.com).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections where the destination hostname matches known text storage sites (e.g., pastebin.com). Use frequency analysis to identify systems with an unusually high number of connections to these sites."
          },
          "Unusually large data uploads or uploads of sensitive file types from internal systems to text storage sites.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for upload activity (e.g., POST requests via HTTP, large bytes_out in conn.log) directed towards known text storage sites. Calculate descriptive statistics (mean, median, standard deviation) for upload sizes per host and identify outliers using IQR or standard deviation methods."
          },
          "Network connections to text storage sites originating from unusual or suspicious processes on internal systems.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing connections to text storage sites with Windows Event ID 4688 (Process Creation) on the source host (endpoint/server). Identify the process name and command line that initiated the connection. Flag connections originating from unusual processes (e.g., scripting engines, command prompts, or custom executables) or those not typically associated with internet browsing or development tasks using frequency analysis of process names connecting to these sites."
          },
          "Unusual file access or read events on sensitive files immediately preceding outbound network connections to text storage sites from the same host.": {
            "Data": "Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4663 (attempted access/read of sensitive files, e.g., based on path or extension) with outbound network connections in Zeek conn.log to text storage sites originating from the same host within a short time window (e.g., 60 seconds). Use time series analysis to identify the sequence of events (file read -> network connection). Investigate hosts where sensitive file reads are immediately followed by connections to text storage sites, especially if the file type or path is unusual or if multiple such events occur in succession."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]