[
  {
    "Is the adversary communicating with command and control infrastructure using fast flux DNS? (TA0011 - Command And Control)": {
      "Indicators": {
        "T1568.001 - Fast Flux DNS": {
          "Multiple, distinct IP addresses observed resolving from a single domain name within a short time frame, potentially with very low DNS TTL values.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log. Group DNS queries by domain name. For each domain, track the set of resolved IP addresses over time. Identify domains resolving to a large number of distinct IPs or having consistently low TTL values (e.g., < 300 seconds). Use correlation analysis to identify domains with a high number of associated IPs relative to typical domains, or time series analysis to detect the rapid cycling of IPs."
          },
          "Observation of a domain's Name Server (NS) records changing frequently or having very low TTL values (indicating double flux).": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for NS record lookups. Track the set of Name Servers returned for specific domains. Identify domains where the list of associated Name Servers changes rapidly or contains a high number of different servers with low TTLs."
          },
          "Unusually high frequency of DNS queries for a single domain name originating from an internal host.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log to identify internal source IPs (\"id.orig_h\") and the domain names (\"query\") they query. For each internal source IP, calculate the rate of queries for individual domain names over sliding time windows (e.g., 1-minute, 5-minute). Use frequency analysis and statistical methods (e.g., Z-score or percentile compared to baseline) to flag internal hosts with query rates for specific domains significantly higher than their historical average or the system-wide average for that domain."
          },
          "Internal host observed connecting to multiple different external IP addresses resolved from the same domain within a short time period.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek dns.log and Zeek conn.log. Join \"dns.log\" records on \"id.orig_h\" and \"query\" with \"conn.log\" records on \"id.orig_h\" and \"id.resp_h\", where \"id.resp_h\" is one of the IPs listed in the \"answers\" field of the DNS query. Filter for connections from internal hosts to external destinations. Group results by internal source IP and domain name. Identify internal hosts that connect to a diverse set of IPs recently resolved from the same domain name within a defined time window (e.g., 5-10 minutes). Quantify the number of distinct destination IPs observed per domain per unit of time. Flag hosts/domains exhibiting a rapid turnover of connected IPs relative to typical behavior, using correlation analysis between DNS resolutions and connection attempts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]