
[
  {
    "Is the adversary attempting to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.012 - File-Path Exclusions": {
          "Detection of known malicious file hashes or specific suspicious file names associated with malware being written to or executed from security software exclusion paths.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an updated list of all known security software exclusion paths (default and custom derived from endpoint configurations). Monitor file write events (Windows Event ID 4663 enabling 'Audit File System' and 'Audit Handle Manipulation' with specific SACLs on exclusion paths) and process creation events (Windows Event ID 4688) occurring within these designated paths. Calculate and compare file hashes of newly written or executed files against a high-fidelity threat intelligence feed of known malware hashes (updated daily). Alert immediately on any matches. Additionally, scan for specific filenames or naming patterns (e.g., randomly generated names, names of known hacking tools) frequently used by malware when dropped into exclusion zones using regular expression matching."
          },
          "Execution of specific command-line patterns known for discovering AV/EDR exclusion settings or for directly writing/moving malicious files into these exclusion paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for specific command-line arguments and utilities. Focus on patterns indicative of AV/EDR exclusion discovery (e.g., `reg query \"HKLM\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\Paths\" /s`, `Get-MpPreference | Select-Object -ExpandProperty ExclusionPath`, `fltmc instances`) or direct file manipulation into exclusion paths using built-in utilities (e.g., `copy payload.exe %PROGRAMDATA%\\DefenderExclude\\`, `powershell -c \"Invoke-WebRequest ... -OutFile C:\\Vendor\\ExclusionDir\\mal.exe\"`, `move temp.dat C:\\AV_Exclusion_Path\\`). Maintain and regularly update a list of such indicative command patterns and utilities. Correlate positive hits with the reputation of the parent process and user account."
          },
          "Creation or execution of atypical files (e.g., unsigned executables, scripts, binaries with high entropy) or anomalous processes originating from known security software exclusion paths, deviating from established baselines of activity in those locations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify all default and custom security software (AV/EDR) file/folder exclusion paths. Establish a baseline of typical file types (extensions, magic numbers), file names, process names, and parent processes observed within these paths during normal operations. Monitor Windows Event ID 4663 (File write) and Windows Event ID 4688 (Process creation) for any activity within these exclusion paths. Use descriptive statistics (e.g., frequency analysis of file extensions, process names) and anomaly detection techniques. Specifically, flag files that are unsigned, have unusually high entropy (using Shannon entropy calculation on file content, indicative of packing or encryption), or are of a type not commonly found in that exclusion (e.g., .ps1, .bat, .exe in a data-only exclusion). Use inter-quartile range (IQR) or box-plots to identify outliers in file sizes or counts of specific activities within these paths."
          },
          "Network download activity of executable or script files immediately followed by file creation of similar content in a known security software exclusion path by the same process or its child.": {
            "Data": "Zeek conn.log; Zeek files.log; Windows Event ID 4663; Windows Event ID 5156; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection logs (Zeek conn.log, Windows Event ID 5156 showing process permitting network connection) and file download logs (Zeek files.log capturing MIME types, filenames, and hashes of transferred files) indicating downloads of executable or script files from external IP addresses with subsequent file creation events (Windows Event ID 4663) in known AV/EDR exclusion paths. Ensure correlation is based on the process responsible for the network activity (PID from Event ID 5156 linked to PID in Event ID 4688 and 4663) or its children, within a short time window (e.g., 1-5 minutes). Analyze the source of downloads (IP reputation, ASN using GeoIP lookup and threat intel) and compare file characteristics (e.g., downloaded file hash from Zeek files.log vs. written file hash if available from EDR). Use time series analysis on the frequency of such correlated events to detect unusual spikes."
          },
          "Observed sequence of security software exclusion discovery activity followed by file write operations or process executions within those identified exclusion paths by the same user session or process lineage.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) that execute commands or scripts known to query, enumerate, or list AV/EDR exclusion settings (as detailed in the 'Pattern' detection). Correlate such discovery activities on a host with subsequent file write (Windows Event ID 4663) or process execution (Windows Event ID 4688) events involving files located within the discovered or common default exclusion paths. This correlation should consider events initiated by the same user (User SID) or process lineage (Parent PID to child PID chain) within a behaviorally relevant timeframe (e.g., minutes to a few hours). Establish a baseline for legitimate queries to these settings (if any from administrative scripts) and alert on deviations, especially when discovery is closely followed by suspicious file operations within the identified paths. Employ linear regression to check if discovery events are a predictor for writes to exclusion zones."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
