```json
[
  {
    "Has the adversary gained initial access to the network via spearphishing attachments? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.001 - Spearphishing Attachment": {
          "Email attachment with a file hash, sender IP address, or sender domain matching known malicious indicators.": {
            "Data": "Zeek files.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously analyze attachments traversing the network using Zeek files.log. Compute file hashes (e.g., SHA256) for all detected attachments and cross-reference them against a high-confidence threat intelligence feed of known malicious file hashes (updated at least daily). Similarly, extract sender IP addresses and domains from Zeek smtp.log and correlate them against CTI feeds for known malicious senders. Alert on any confirmed matches."
          },
          "Execution of files with disguised extensions, unusual file types for attachments, or from common temporary directories used by email clients.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the 'New Process Name' includes double extensions (e.g., .pdf.exe, .doc.vbs), has an executable extension but is masquerading as a document, or originates from common temporary directories (e.g., %TEMP%, %APPDATA%\\Local\\Temp, or Outlook's 'Content.Outlook' folder). Use regular expressions to detect these patterns. Use frequency analysis on process names and originating directories to identify rare or first-seen executions."
          },
          "Suspicious command-line arguments or script content executed by processes spawned from email attachments, matching patterns used by known malware droppers.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command-line arguments in Windows Event ID 4688 for processes spawned by Office applications or script hosts (e.g., wscript.exe, powershell.exe). Hunt for patterns such as base64 encoded commands, use of 'IEX (New-Object Net.WebClient).DownloadString', 'mshta.exe' with remote URLs, or other command structures associated with common malware families (e.g., Emotet, Qakbot, IcedID). Maintain and use a library of regular expressions to detect these malicious patterns and alert on matches."
          },
          "An office application (e.g., Word, Excel, Outlook) spawns a command shell or scripting engine, a common behavior for macro-based attacks.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation chains where a parent process is a common office application (winword.exe, excel.exe, outlook.exe, powerpnt.exe) and the child process is a shell or script interpreter (cmd.exe, powershell.exe, wscript.exe, cscript.exe, mshta.exe). Correlate these host-based process creation events with any subsequent outbound network connections (Zeek conn.log) from the spawned process within a short time window (e.g., 1-5 minutes). Use correlation analysis to link the host-based event to the network behavior and flag the entire sequence."
          },
          "An internal host initiates an unusual network connection to an external destination shortly after receiving an email from an external source, indicating a potential callback from a malicious attachment.": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate email receipt events (Zeek smtp.log) with network connection events (Zeek conn.log) based on the recipient's internal IP and a defined time window (e.g., within 5 minutes of email delivery). Identify instances where a host initiates an outbound connection to a new or rare external IP/domain shortly after receiving an email. Use time series analysis to baseline normal post-email network behavior per host or group and detect anomalous spikes or connections. Use linear regression to test if email receipt from new or untrusted domains predicts an increase in anomalous outbound connections."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```