[
  {
    "Is the adversary exfiltrating sensitive data via code repositories? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1567.001 - Exfiltration to Code Repository": {
          "Unusual volume of outbound data from internal hosts to known code repository services (e.g., exceeding typical push volumes or demonstrating asymmetric data flow).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for outbound connections to known code repository domains/IPs. Calculate outbound vs. inbound byte ratios for these connections. Flag sessions or hosts with significantly asymmetric outbound data volume, especially exceeding baselines established using historical data or statistical methods like IQR on daily outbound data volume to code repos."
          },
          "Network connections to code repository services originating from processes or users not typically associated with software development or code management activities.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connections (Zeek conn.log) to code repository services with process creation events (Windows Event ID 4688) on source hosts. Identify connections originating from processes or users not typically associated with software development roles or code repository interaction based on established baselines using frequency analysis. Use correlation analysis between process names/users and connection destinations/times to identify unusual pairings."
          },
          "Connections to code repository services originating from processes with no prior history of network communication or newly observed processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation (Windows Event ID 4688) and network connections (Windows Event ID 5156, Zeek conn.log). Maintain a baseline of network-communicating processes per host/user using historical data. Flag connections to code repository services originating from processes that are newly observed (low frequency in historical data) or have no prior history of outbound network connections. Use frequency analysis to establish baselines and identify rare process-connection events."
          },
          "Frequent or unusual 'push' or commit-like activity to code repositories from accounts or systems not typically associated with development roles.": {
            "Data": "Zeek http.log; Zeek ssl.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and ssl.log for connections to code repository API endpoints (e.g., api.github.com, gitlab.com/api) from internal hosts. Correlate with Windows Event ID 4624 (Logon) to identify the user context on the source system. Analyze the frequency and timing of these API interactions (e.g., using time series analysis or simple counts per user/host per time period). Flag accounts or hosts exhibiting sudden spikes or unusual patterns of code repository API interaction (e.g., high frequency of POST requests to /api/vX/repos/.../git/pushes), especially outside normal working hours or from non-developer systems using descriptive statistics and thresholding."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]