[
  {
    "Is the adversary executing commands via system services? (TA0002 - Execution)": {
      "Indicators": {
        "T1569 - System Services": {
          "Command-line activity indicative of modifying existing system services or creating new ones (e.g., using sc.exe, powershell New-Service).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command-line arguments containing 'sc.exe' or 'New-Service' (PowerShell) targeting service modification/creation verbs ('create', 'config', 'delete'). Correlate these events with Windows Event ID 4697 (Service Creation) and 7045 (Service Creation). Analyze frequency and timing of these events, flagging occurrences outside of scheduled maintenance windows using time series analysis and correlation analysis with change management records."
          },
          "Unusual service startup events or changes to service executable files that don't correlate with normal system administration or patching.": {
            "Data": "Windows Event ID 7036; Windows Event ID 4697; Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7036 (Service Started) and correlate with Windows Event ID 4697 (Service Creation) or 7045 (Service Creation) for services with unusual names or executables. Monitor Windows Event ID 4688 for processes associated with service executables starting from unusual locations or with unusual parent processes. Use descriptive statistics (e.g., frequency, duration) to identify services with abnormal start frequencies or run durations compared to baseline."
          },
          "Network connections initiated by service host processes (e.g., svchost.exe) to unusual or external destinations, especially following a service start or modification event.": {
            "Data": "Zeek conn.log; Windows Event ID 7036; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 7036 (Service Started) or other service modification events with Zeek conn.log entries where the source process name identified (potentially via correlated host logs like 4688 if available) is a standard service host (like svchost.exe) but the destination IP/port is unusual or external. Use frequency analysis or correlation analysis (e.g., joining logs by time and host/process identifier) to identify rare or unsanctioned network connections originating from service processes."
          },
          "Modifications to Windows Registry keys associated with service configuration (ImagePath, DependOnService) without corresponding system updates or administration tasks.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (A Registry Value Was Modified) for changes to critical service registry keys (e.g., `HKLM\System\CurrentControlSet\Services\*`). Filter for modifications to `ImagePath` or `DependOnService` values. Correlate with user logon events (Windows Event ID 4624) to identify the account performing the change. Flag changes occurring outside of scheduled maintenance or known administrative tasks using time series analysis and correlation with change management records."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]