
[
  {
    "Has the adversary manipulated sensitive data or critical system files? (TA0040 - Impact)": {
      "Indicators": {
        "T1565 - Data Manipulation": {
          "A file is created or modified that matches the hash of a known data wiping tool, ransomware payload, or other malicious data manipulation utility.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor file creation and modification events (Windows Event ID 4663) in critical directories. For each event, trigger an on-access scan or hash calculation of the new/modified file. Cross-reference the resulting file hash against a high-confidence cyber threat intelligence (CTI) feed of known malicious file hashes, particularly those associated with wipers and ransomware. Alert immediately on any match and trigger an automated host isolation response."
          },
          "Execution of native system utilities or scripting engines with command-line arguments or script content characteristic of destructive data manipulation or wiping.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) with full command line logging enabled. Use regular expression matching to detect the execution of utilities like `cipher.exe`, `sdelete.exe`, or `fsutil.exe` with arguments used for overwriting data (e.g., `cipher /w:`, `sdelete -p`, `fsutil file setzerodata`). Also, scan for PowerShell or other script execution containing commands that overwrite, corrupt, or delete file content in bulk (e.g., `Set-Content`, `Get-ChildItem | Remove-Item -Force`). Alert on command patterns indicative of widespread or targeted data destruction."
          },
          "An anomalous spike in file deletion or modification activity targeting sensitive data repositories or critical system files, originating from an unusual user account or process.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal file modification and deletion rates (events per hour/day) for critical file paths and servers using Windows Event ID 4663. Use time series analysis (e.g., moving averages, exponential smoothing) to detect statistically significant spikes in this activity. Correlate spikes with the responsible process (via Event ID 4688) and user account. Use frequency analysis and entropy measures to flag activity from processes or users not typically associated with file management in those locations."
          },
          "Suspicious sequence of file I/O and network operations indicative of data corruption or transposition, such as a process reading a file, connecting to an external network source, and immediately overwriting the original file.": {
            "Data": "Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate events within a short time window for a specific process: 1. A read access event on a sensitive file (Windows Event ID 4663). 2. A network connection event from the same host (Zeek conn.log) to an external or unusual internal destination. 3. A write access event to the same sensitive file by the same process (Windows Event ID 4663). This sequence may indicate the file's content is being replaced with externally sourced data. Use correlation analysis to link these events by hostname and timestamp. Profile file sizes before and after modification; large, unexpected changes can also be a key indicator."
          },
          "Mass file renaming or extension changing activity in directories containing sensitive data, potentially indicating an attempt to disrupt data availability or hide data before destruction.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for high-frequency file rename operations (identified in Windows Event ID 4663 details) originating from a single process within a short timeframe. Establish a baseline for normal rename activity. Use descriptive statistics (e.g., count of renames per process per minute) and percentile analysis or IQR to detect outliers. Investigate processes that rename large numbers of files, especially if the new extensions are random, meaningless, or uniform across all files, a behavior common in ransomware variants prior to encryption."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
