[
  {
    "Is the adversary attempting to evade defenses by using downgraded system features? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1562.010 - Downgrade Attack": {
          "Execution of PowerShell with an older version specified (e.g., v2) or execution of scripting interpreters from unexpected locations/versions.": {
            "Data": "Windows Event ID 4688; Windows Event ID 400",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the command line includes 'powershell -v 2' or similar version arguments. Monitor Windows Event ID 400 (PowerShell Engine) specifically for the 'EngineVersion' field to identify unexpected older versions. Use frequency analysis to identify rare process execution patterns or versions based on baseline activity."
          },
          "Observation of unencrypted network traffic (HTTP) instead of expected encrypted traffic (HTTPS) or modifications to system boot/security-related registry settings indicative of downgrade.": {
            "Data": "Zeek http.log; Zeek ssl.log; Windows Event ID 4657",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and ssl.log for connections from internal hosts to external destinations where HTTP is observed on standard HTTPS ports (443) or where HTTPS is expected but HTTP is seen (e.g., SSL stripping attempt). Use correlation analysis to link unexpected HTTP traffic to specific internal hosts or user activity. Monitor Windows Event ID 4657 for changes to critical security-related registry keys (e.g., related to HVCI, Defender policies) and correlate with recent adversary activity or known attack patterns."
          },
          "Execution of commands or scripts attempting to disable or tamper with security software or features (e.g., Bitlocker, Defender, HVCI) using deprecated or less secure methods.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events with command-line arguments containing keywords associated with disabling or modifying security software or features (e.g., 'DisableKeyProtectors', commands modifying security service configurations, 'Set-MpPreference'). Correlate with Windows Event ID 4657 for changes to relevant security-related registry keys (e.g., HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows Defender, HVCI settings). Use keyword matching and statistical analysis (e.g., frequency of such events per host/user) to flag suspicious activity."
          },
          "Modification of boot configuration or files related to Secure Boot or boot managers to potentially enable insecure boot modes.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to Boot Configuration Data (BCD) registry keys (e.g., paths under HKLM:\\BCD00000000) or other registry keys controlling boot behavior. Configure SACLs and monitor Windows Event ID 4663 for attempted modifications (write access) to critical boot files (e.g., bootmgr, winload.efi) in the EFI System Partition or System32 directory. Establish a baseline of authorized changes (e.g., from system updates) and flag unauthorized or anomalous modifications using detection rules or anomaly detection based on user/process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]