[
  {
    "Has the adversary attempted to evade defenses by modifying cloud firewalls? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.007 - Disable or Modify Cloud Firewall": {
          "Modification of existing cloud security group or firewall rules, especially allowing wider access or new protocols.": {
            "Data": "AWS CloudTrail Logs, Azure Activity Logs, GCP Audit Logs, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs (AWS CloudTrail, Azure Activity, GCP Audit) for events indicating modification of security groups or firewall rules (e.g., AuthorizeSecurityGroupIngress, RevokeSecurityGroupIngress). Filter for rule changes that broaden access (e.g., allowing '0.0.0.0/0' or unexpected ports/protocols). Correlate these changes with anomalous traffic patterns in Zeek conn.log occurring shortly after the modification using time series analysis on traffic volume or entropy on port usage."
          },
          "Creation of new cloud security groups or firewall rules, especially allowing wider access or new protocols.": {
            "Data": "AWS CloudTrail Logs, Azure Activity Logs, GCP Audit Logs, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs (AWS CloudTrail, Azure Activity, GCP Audit) for events indicating creation of new security groups or firewall rules (e.g., CreateSecurityGroup, CreateFirewallPolicy). Filter for new rules/groups that grant wide or unexpected access. Analyze Zeek conn.log for new or increased traffic flows matching the newly allowed rules, potentially using statistical anomaly detection (e.g., time series analysis on connection volume or correlation analysis with the creation timestamp)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]