[
  {
    "Is the adversary disabling or modifying security tools to evade detection? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1562.001 - Disable or Modify Tools": {
          "Security tool processes or services being unexpectedly terminated or stopped.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4688 and 7036. Identify security service names and common process names of security tools. Look for unexpected stop events (7036) or commands (4688) targeting these processes/services. Use correlation analysis to link process termination events with suspicious parent processes or sequences of events. Use frequency analysis to identify unusually high rates of security process terminations on a host."
          },
          "Registry keys, configuration files, or log sources associated with security tools being modified or disappearing.": {
            "Data": "Windows Event ID 4657; Windows Event ID 1102; Windows Event ID 104; Windows Event ID 1104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4657 for modifications to known security tool registry keys (e.g., service configurations, startup entries, update settings). Monitor Event IDs 1102, 104, 1104 for security/system log clearing events. Identify baseline frequency of these events per host. Flag unexpected spikes in registry modifications or log clearing events (e.g., using time series analysis on event counts or deviation from baseline)."
          },
          "Modification of security tool configuration files or registry keys related to updates, exclusions, or logging settings.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4657 for changes to known registry paths used by security tools (e.g., update servers, exclusion lists, logging levels, anti-tampering settings). Monitor Event ID 4663 for write access attempts on known security tool configuration files or directories (e.g., `.conf`, `.xml`, exclusion lists). Create a baseline of expected modifications by user/process and flag deviations using frequency analysis or correlation with authorized change management events."
          },
          "Cessation or significant reduction in the expected volume of specific security-related Windows Event IDs (e.g., Sysmon events) from a host.": {
            "Data": "Windows Event IDs relevant to security monitoring (e.g., 4688, 5156, 1102, Sysmon Event IDs); Windows Event ID 1100; Windows Event ID 1105",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for the expected daily/hourly volume of key security-related Windows Event IDs (e.g., 4688, 5156, common Sysmon events) from endpoints and servers using time series analysis. Monitor the ingested log volume and flag hosts showing a statistically significant drop (e.g., percentage decrease or deviation from baseline using standard deviation or IQR) in the volume of these specific events. Also, explicitly alert on the occurrence of Windows Event IDs 1100 (Event logging service shut down) or 1105 (Event log cleared by service) on critical systems."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]