[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by blocking indicators?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1562.006",
                "name": "Indicator Blocking",
                "evidence": [
                    {
                        "description": "Execution of tools or scripts identified by file hash as being known malware or hacking tools used for disabling security monitoring.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Sysmon Event ID 1"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously compare file hashes of all newly created processes (from Sysmon Event ID 1 or Windows Event ID 4688 with Process Creation auditing enabled) against a high-confidence CTI feed of known malicious hashes. Specifically tag and alert on hashes associated with tools known to perform indicator blocking or security software removal (e.g., PCHunter, PowerTool, GMER). Investigate any host executing a process with a matching hash."
                    },
                    {
                        "description": "Execution of specific command-line utilities or PowerShell cmdlets known to be used for tampering with security logging and monitoring components.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Sysmon Event ID 1"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688, Sysmon EID 1) for command-line arguments containing patterns used to tamper with security tools. This includes: `wevtutil cl` or `Clear-EventLog` to clear logs; `reg.exe` or `Set-ItemProperty` targeting EventLog or ETW registry keys (e.g., `HKLM\\SYSTEM\\CurrentControlSet\\Services\\EventLog`); `netsh advfirewall` to block logging traffic; and `sc stop`, `taskkill`, or `Stop-Service` targeting known security service names (e.g., Sysmon64, WinCollect, SplunkForwarder). Use regular expression matching and correlation rules to detect these specific patterns, especially when executed by unusual parent processes."
                    },
                    {
                        "description": "Generation of high-fidelity system events that directly indicate tampering with security configurations or logs.",
                        "data_sources": [
                            "Sysmon Event ID 16",
                            "Windows Event ID 1102",
                            "Windows Event ID 2004"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create high-priority alerts for specific event IDs that are strong indicators of direct tampering. These include: Sysmon Event ID 16 (Sysmon configuration change), Windows Event ID 1102 (The audit log was cleared), and Windows Event ID 2004 (A firewall rule was added). Due to their high-fidelity nature, these events should trigger immediate investigation. Use descriptive statistics to identify any hosts generating these events with unusual frequency."
                    },
                    {
                        "description": "A statistically significant and unexplained decrease or complete cessation of expected telemetry (e.g., Windows Events, Sysmon logs) from a host that remains active on the network.",
                        "data_sources": [
                            "Zeek conn.log",
                            "All host-based log sources"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline for the volume and rate of all critical log sources per host or host group. Use time series analysis (e.g., moving averages, exponential smoothing with confidence intervals) to monitor for sudden, significant drops in log volume. Correlate a 'logs stopped' alert from a host with network data from Zeek conn.log to confirm the host is still active on the network (i.e., sending traffic to other destinations but not to log collectors/SIEMs). A host that is network-active but silent from a logging perspective is a high-confidence indicator of tampering."
                    },
                    {
                        "description": "A sequence of actions on a host involving reconnaissance of security tools followed by attempts to disable or remove them.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Sysmon Event ID 1"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a behavioral rule that detects a sequence of suspicious activities within a short time window (e.g., 5-15 minutes) on a single host. The sequence is defined as: 1) Execution of discovery commands to enumerate security products (e.g., `tasklist /svc`, `sc query`, `Get-Process`, `fltmc.exe filters`). 2) Followed by commands aimed at stopping or disabling services or processes identified in step 1 (e.g., `sc stop <servicename>`, `taskkill /IM <processname>.exe`). Use correlation analysis on process creation events keyed by hostname and user session to detect this specific TTP, indicating a deliberate attempt to dismantle defenses."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
