[
  {
    "Has the adversary disabled or modified cloud logging to evade detection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.008 - Disable or Modify Cloud Logs": {
          "Detection of unusual outbound network traffic or command execution related to cloud API calls that disable or modify logging.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections to known cloud provider API endpoints (AWS, GCP, Azure management APIs). Filter for traffic originating from systems/users not typically authorized for management actions. Identify processes initiating these connections (Windows Event ID 4688 if available). Use correlation analysis to link outbound API traffic with suspicious command execution or user activity."
          },
          "Errors or alerts on internal log collection systems indicating a failure to receive expected cloud logs.": {
            "Data": "Windows Event ID; Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event logs on central log collection servers for errors or warnings related to receiving logs from cloud sources. Establish baseline ingestion rates for cloud logs over time using time series analysis. Detect statistically significant drops or cessations in log volume (e.g., using standard deviation or moving averages)."
          },
          "Detection of specific cloud provider API endpoint access patterns in network logs associated with disabling or modifying logging configurations.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests to known cloud provider API endpoints containing URI patterns indicative of logging configuration changes (e.g., patterns matching \"StopLogging\", \"DeleteTrail\", \"UpdateSink\", \"diagnostic-settings\"). Correlate with Zeek conn.log for source/destination details. Flag access originating from unusual sources or occurring outside of established change control windows. Use frequency analysis or anomaly detection to identify rare or unusual access patterns to these sensitive endpoints by specific source IPs or assets."
          },
          "Detection of suspicious host activity on systems or by accounts with permissions to modify logging, occurring shortly after potential logging modification attempts or immediately preceding a loss of logs.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Windows Event ID 5140",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify host activity logs (Windows Event ID 4688 for process creation, 4663 for file access, 5140 for share access) on systems or initiated by user accounts known to have permissions to modify cloud logging. Correlate timestamps of this activity with potential logging modification events (detected via other evidence) or observed log cessation from affected cloud assets. Use time series analysis or sequence analysis to detect suspicious sequences of events or patterns occurring shortly before or after logging changes. Establish baselines for activity on these privileged systems/accounts and flag statistically significant deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]