[
  {
    "Has the adversary gained initial access via spearphishing through third-party services? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.003 - Spearphishing via Service": {
          "Network traffic to/from known social media, webmail, or other suspicious third-party services followed by suspicious activity on endpoints.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections involving known popular social media, webmail, or messaging service domains/IPs. Identify users/endpoints frequently accessing these services followed by alerts or suspicious activity indicators from endpoint security. Use correlation analysis to link network traffic patterns (e.g., session duration, bytes transferred) with endpoint events."
          },
          "Execution of potentially malicious files or processes spawned by applications commonly used for opening documents/files received via messaging services (e.g., Word, PDF reader) with subsequent network connections.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs. Look for unusual child processes spawned by applications like winword.exe, excel.exe, acrobat.exe, or web browsers (e.g., powershell.exe, cmd.exe, script interpreters). Correlate these process creations with subsequent network connections in Zeek conn.log (using Windows Event ID 5156 or similar for network connection logs). Use frequency analysis or entropy measures on spawned processes to identify rare parent-child process combinations or statistically unusual network connections originating from office/reader applications."
          },
          "Repeated connections or unusual communication patterns to known third-party services from an endpoint potentially indicating payload delivery or troubleshooting.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for endpoints exhibiting multiple connections or unusual session durations to known social media, webmail, or messaging service domains/IPs within a short timeframe or outside normal usage patterns. Use time series analysis (e.g., looking for bursty activity) or frequency analysis to identify statistically unusual communication persistence or patterns with these services for specific endpoints, especially when deviating from historical norms for that endpoint."
          },
          "Detection of suspicious file transfers (by type or pattern) or suspicious URL patterns associated with network traffic to/from known third-party communication services.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for suspicious URL patterns (e.g., unusual file extensions in path, query strings, redirectors) and Zeek files.log for file transfers originating from known social media, webmail, or messaging service domains/IPs. Flag transfers of executable files (.exe, .dll), script files (.ps1, .vbs, .js), or office documents with macros (.docm, .xlsm) from these sources. Calculate average file sizes and standard deviation for files transferred from these services per user/endpoint and flag significant deviations (e.g., >2 standard deviations from the mean)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]