[
  {
    "Has the adversary collected data by archiving it? (TA0009 - Collection)": {
      "Indicators": {
        "T1560.002 - Archive via Library": {
          "Suspicious process activity interacting with known archiving library files or executing archiving utilities.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments related to archiving utilities (e.g., 'zip', 'tar', 'rar') or scripting languages (Python, Perl) executing with archiving library calls in the command line. Analyze process ancestry to identify suspicious parent processes. Use frequency analysis on process names and command lines to detect rare occurrences of these utilities/scripts."
          },
          "Creation or modification of files with archiving/compression-related file extensions or headers in unusual locations.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for 'WRITE_DATA' operations creating files with common archive extensions (.zip, .rar, .7z, .tar.gz, .bz2, etc.) in sensitive directories or user profile locations, especially when created by unusual processes. Use descriptive statistics to identify file sizes and creation times deviating significantly from typical system activity."
          },
          "Scripting language processes or uncommon binaries executed with command-line arguments indicative of library-based archiving operations targeting sensitive data directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes like 'python.exe', 'perl.exe', or other uncommon executables executing with command-line arguments that contain keywords related to archiving libraries (e.g., 'zipfile', 'tarfile', 'rarfile', 'zlib') or specify archive utility options, particularly when the command line also references paths to sensitive data directories (e.g., user profiles, document folders, database directories). Use keyword search and regular expressions on the command line (`New-Process CommandLine` in 4688) to identify suspicious patterns. Use frequency analysis to identify uncommon script executions or arguments associated with archiving."
          },
          "Outbound network connections established by processes or hosts immediately after the creation or modification of suspicious archive files.": {
            "Data": "Windows Event ID 4663; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4663 (file creation/modification) events for suspicious archive files (.zip, .rar, .7z, etc.) with subsequent Windows Event ID 5156 (Network Connection) events from the same process (if PID/Process Name is available and persists) or with Zeek conn.log entries originating from the source host IP within a short time window (e.g., 60 seconds). Investigate network connections to external destinations or unusual internal destinations that occur immediately after the suspected archiving activity. Analyze destination IPs, ports, and data transfer volume (from Zeek conn.log) for known C2 or data exfiltration patterns. Use time series analysis or join operations to link file events to network events based on time and host."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]