[
  {
    "Has the adversary attempted to disable or modify the Linux audit system? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1562.012 - Disable or Modify Linux Audit System": {
          "Absence of expected audit logs or sudden stop of the auditd service process on Linux servers.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 4688 from relevant servers. While not directly detecting Linux auditd state, analyze time series data of overall log volume received from these systems via central logging or look for indicators of process termination commands (Windows Event ID 4688) that might precede a drop in logs. Identify significant decreases in log frequency or volume that correlate with suspicious network activity."
          },
          "Unauthorized modifications to Linux audit configuration files (audit.rules, audit.conf) or unexpected commands run modifying audit settings.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Search Windows Event ID 4688 for process creation events on target servers involving commands related to editing files (e.g., vi, nano) or package managers used to modify system configurations. Correlate these events with unusual network connections (Zeek conn.log). Use descriptive statistics on file modification events (if available through other means, conceptually mapped here) to identify outliers in timing or frequency."
          },
          "Network traffic patterns consistent with remote administration tools targeting Linux servers, immediately preceding or coinciding with a loss of expected log volume from those servers.": {
            "Data": "Zeek conn.log; Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to standard remote administration ports (e.g., SSH TCP 22) targeting Linux servers. Analyze Zeek ssh.log for command execution if available, looking for commands related to `auditctl`, `systemctl`, `auditd`, `kill`. Correlate remote access activity with a significant drop in expected syslog or audit log volume received from the target Linux server via central logging (requires integrating with log volume monitoring). Use time series analysis on log volume and correlation with remote access sessions."
          },
          "Execution of remote command execution tools or file transfer commands on Windows management servers or jump boxes targeting Linux servers, potentially related to modifying audit configurations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek ftp.log; Zeek smb.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on Windows servers known to manage Linux systems for execution of remote execution commands (e.g., `ssh`, `plink`, `pscp`, `scp`, `winscp`, custom scripts) with command-line arguments related to `auditctl`, `systemctl`, `/etc/audit/audit.rules`. Correlate with Zeek logs (conn.log, ftp.log, smb.log) showing connections or file transfers between the Windows host and Linux targets, looking for transfers of audit configuration files or unusual executable files. Use correlation analysis to link command execution events to network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]