[
  {
    "Has the adversary gained initial access to the network via spearphishing attachments? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.001 - Spearphishing Attachment": {
          "Zeek logs showing suspicious SMTP activity or connections related to potential malicious email content (e.g., connections to external IPs shortly after email receipt).": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log for metadata anomalies (sender/recipient patterns) and Zeek conn.log for connections from internal hosts shortly after receiving emails that bypassed initial defenses. Use statistical methods (e.g., time series analysis) to identify hosts initiating connections to rare or known malicious IPs soon after receiving emails, or bursts of connections following email delivery."
          },
          "Suspicious process creation (e.g., office applications spawning shell processes) or anomalous network connections initiated by user-executed files.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where parent processes are common user applications (e.g., winword.exe, excel.exe, powerpnt.exe, outlook.exe) and child processes are command shells (cmd.exe, powershell.exe) or scripting engines (wscript.exe, cscript.exe). Correlate these events with Zeek conn.log to identify network connections originating from these suspicious processes, potentially using statistical analysis to identify rare destination IPs or ports accessed by these processes."
          },
          "Execution of potentially malicious files with disguised extensions or from unusual temporary directories via user execution.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `New Process Name` containing suspicious patterns like double extensions (`.doc.exe`, `.pdf.vbs`, `.txt.cmd`) or execution originating from temporary directories (e.g., `%TEMP%`, `%APPDATA%\Local\Temp`) commonly used by email clients or browsers for downloaded attachments. Analyze command-line arguments for signs of obfuscation or unusual parameters. Use frequency analysis on process names and originating directories to identify rare executions."
          },
          "Outbound network connections from user processes to uncommon destinations or ports, potentially indicative of C2 or data exfiltration after attachment execution.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection events (Zeek conn.log, Windows Event ID 5156) originating from processes related to user-executed files (identified via Event ID 4688 correlation or temporal proximity to email receipt/file download) with destination IPs and ports. Filter for connections to uncommon ports or protocols (e.g., non-standard web ports, raw TCP/UDP). Calculate frequency of destination IP/port pairs and flag low-frequency occurrences. Correlate against threat intelligence feeds for known malicious destinations. Use time series analysis to detect bursts of network activity shortly after file execution."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]