```json
[
  {
    "Has the adversary exfiltrated sensitive data using text storage sites? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1567.003 - Exfiltration to Text Storage Sites": {
          "Network traffic to hostnames or IP addresses of known text storage sites.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and use a continuously updated, categorized list of text storage site hostnames and IP addresses from a cyber threat intelligence feed. Scan Zeek http.log host headers, Zeek ssl.log SNI fields, and Zeek conn.log destination IPs for matches against this list. Alert on any connection to a categorized site, prioritizing hosts with no prior history of such connections."
          },
          "Use of common command-line utilities (e.g., cURL, PowerShell) with syntax patterns indicative of posting data to text storage sites.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Windows Event ID 4688 (Process Creation with Command Line Logging). Use regular expression matching on the command line arguments to detect patterns associated with exfiltration to web services. Look for processes like 'curl.exe', 'powershell.exe', or 'bitsadmin.exe' combined with arguments for POST/PUT requests, data payloads (e.g., '-d @filename', '-Body $variable'), and URLs containing hostnames of text storage sites. Investigate any matches for malicious activity."
          },
          "Anomalous data volume or connection frequency to text storage sites, deviating from established baselines for a host or user.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each host, establish a baseline of normal data upload volume (e.g., POST request sizes in http.log, 'orig_bytes' in conn.log) and connection frequency to the category of text storage sites. Use statistical methods to detect significant deviations from this baseline. Employ time series analysis to spot sudden spikes in activity and use the Inter-Quartile Range (IQR) or Z-score calculations on upload sizes and connection counts per hour/day to identify outliers for investigation."
          },
          "Network connections to text storage sites originating from non-interactive, system, or command-line processes not associated with typical user web browsing.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connections to text storage sites (from Zeek conn.log) with the originating process on the source host (from Windows Event ID 4688). Establish a baseline of legitimate browser and application processes (e.g., 'chrome.exe', 'firefox.exe'). Flag and investigate all connections to these sites that originate from non-standard processes, such as 'cmd.exe', 'powershell.exe', 'cscript.exe', 'svchost.exe', or any unrecognized executables, especially those running from temporary or user-writable directories."
          },
          "A sequence of events on a host involving reading sensitive data, followed immediately by an outbound connection to a text storage site.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlated detection rule that looks for a specific sequence of events within a short time window (e.g., < 2 minutes). The sequence should be: 1) A process accesses one or more sensitive files, identified by Windows Event ID 4663 (Object Access) on pre-defined critical file paths or types. 2) The same process (or a child process, tracked via Event ID 4688) initiates an outbound network connection. 3) The destination of this connection, identified in Zeek conn.log, is a known text storage site. Investigate any host triggering this correlated sequence."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```