[
  {
    "Is the adversary attempting to evade defenses by concealing activity? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.003 - Hidden Window": {
          "Process creation events with command-line arguments indicating hidden window styles (e.g., powershell.exe -WindowStyle Hidden).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Sysmon Event ID 1 if enabled) for process creation with command-line arguments containing 'WindowStyle Hidden' or similar parameters used for hiding windows. Perform statistical analysis (e.g., frequency analysis) on command line arguments to identify unusual patterns."
          },
          "Registry modifications or plist file changes indicative of hiding application windows.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4658; Host File System logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 and 4658 for modifications to Registry keys associated with window position or style (e.g., HKEY_CURRENT_USER\\Console\\*). Monitor macOS file system events for modifications to application plist files containing 'apple.awt.UIElement' or similar tags. Correlate modifications with known process activity."
          },
          "Creation of a new desktop session or unusual network connections originating from an explorer.exe process not tied to the primary user session.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 for logon types indicative of new or unusual sessions (e.g., Logon Type 10 for RemoteInteractive without corresponding RDP). Correlate with Windows Event ID 4688 to identify 'explorer.exe' processes created in these sessions. Use process tree analysis to identify 'explorer.exe' processes not originating from a standard interactive logon. Monitor Zeek conn.log for external network connections originating from such anomalous 'explorer.exe' processes. Use time series analysis to detect persistent connections from these processes."
          },
          "Unexpected background processes (no visible window/UI) with active network connections, especially if they are signed executables running from unusual paths or exhibiting anomalous behavior.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes running with command-line arguments or parent-child relationships suggesting hidden execution. Correlate these processes with Windows Event ID 5156 and Zeek conn.log to identify active network connections. Use frequency analysis and correlation analysis to identify processes exhibiting network connections without typical interactive UI activity, running from unusual directories (calculate path entropy), or exhibiting anomalous connection patterns (e.g., persistently low connection entropy to a specific external IP)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]