```json
[
  {
    "Has the adversary exfiltrated sensitive data using cloud storage services? (TA010 - Exfiltration)": {
      "Indicators": {
        "T1567.002 - Exfiltration to Cloud Storage": {
          "Network connections from internal hosts to domains or IP addresses on threat intelligence lists known for malicious hosting on cloud infrastructure or to unsanctioned, high-risk cloud storage providers.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously inner join destination IP addresses from Zeek conn.log and Server Name Indication (SNI) values from Zeek ssl.log against a CTI feed of known malicious domains/IPs used for exfiltration staging. Maintain and check against a separate organizational list of unsanctioned or high-risk cloud storage providers not approved for corporate use. Alert on any matches and investigate the source host and data involved."
          },
          "Execution of command-line utilities (e.g., PowerShell, curl, rclone) with specific syntax known to be used for exfiltrating data to cloud storage services, or the presence of distinctive network artifacts from these tools.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines containing specific patterns associated with exfiltration tools, such as 'rclone copy', 'curl --upload-file', or PowerShell's 'Invoke-WebRequest' and 'Write-S3Object' targeting cloud storage URLs. Concurrently, inspect Zeek http.log for specific User-Agent strings or API call patterns characteristic of these tools. Use regular expression matching on command lines and HTTP headers against a maintained list of known malicious patterns."
          },
          "Anomalous creation of large compressed or encrypted files (e.g., .zip, .rar, .7z) on a host, immediately followed by a large data upload from that same host to a cloud storage service.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for the execution of archiving utilities (e.g., 7z.exe, WinRAR.exe, zip.exe) or command-line arguments that create large archive files. Correlate these process creation events by host and timestamp with subsequent large outbound network flows (identified by high 'orig_bytes' in Zeek conn.log) to cloud storage destinations within a short time window (e.g., < 15 minutes). This sequence of 'compress -> upload' is a strong behavioral indicator of data staging for exfiltration."
          },
          "Anomalously large data upload volumes or highly asymmetric network traffic (high sent-to-received byte ratio) from internal hosts to sanctioned or unsanctioned cloud storage provider domains.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for traffic to IP ranges/domains of known cloud storage providers. For each internal source host, calculate total bytes sent and the ratio of sent-to-received bytes over a sliding time window (e.g., hourly, daily). Use percentile analysis or box plots to establish a baseline for each host or user group. Flag hosts exhibiting upload volumes or send/receive ratios that are statistical outliers (e.g., in the 99th percentile) for further investigation."
          },
          "Data uploads to cloud storage services initiated by non-interactive processes, system accounts, or applications not typically associated with user-driven file sharing (e.g., svchost.exe, scheduled tasks, web server processes).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate outbound connections to cloud storage services (from Zeek conn.log) with the parent process context on the source host (from Windows Event ID 4688). Establish a baseline of normal processes that interact with cloud storage (e.g., OneDrive.exe, Dropbox.exe). Use frequency analysis to identify and alert on rare process-to-destination pairings, especially connections initiated by server-side scripts, system services, or processes running under high-privilege system accounts (e.g., NT AUTHORITY\\SYSTEM) that have no legitimate business reason to upload data to cloud storage."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```