[
  {
    "Has the adversary executed commands using systemctl? (TA0002 - Execution)": {
      "Indicators": {
        "T1569.003 - Systemctl": {
          "Execution of \"systemctl start\" or \"systemctl enable\" for newly created or modified service units.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing 'systemctl start' or 'systemctl enable' in the command line. Identify executions starting newly created or recently modified service files. Perform correlation analysis between 'systemctl' execution events and network connections captured in Zeek conn.log originating from the same host shortly after, looking for unusual or high-volume connections."
          },
          "Detection of \"systemctl\" command execution via suspicious parent processes or shell activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations containing 'systemctl' in the command line. Analyze parent process relationships (using process trees) to identify suspicious parent processes (e.g., unexpected shells, scripts from unusual locations) executing 'systemctl'. Use frequency analysis (descriptive statistics) of 'systemctl' command arguments and usage patterns per host to identify deviations from baseline norms."
          },
          "Execution of 'systemctl stop' or 'systemctl disable' for critical services, potentially followed by unusual network activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events with 'systemctl stop' or 'systemctl disable' in the command line, targeting known critical services (e.g., security agents, logging, networking). Correlate these events with subsequent network connections from the same host captured in Zeek conn.log, looking for new or unusual outbound connections that might indicate C2 or exfiltration after service disruption. Use frequency analysis to identify abnormal rates of service stop/disable commands per host or user."
          },
          "Execution of `systemctl` commands (e.g., `status`, `list-units`) from suspicious processes, scripts, or unusual locations, potentially in bursts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing 'systemctl' used for reconnaissance (e.g., 'status', 'list-units', 'list-timers'). Analyze the parent process name, working directory, and command line arguments. Identify executions originating from temporary directories, suspicious script names, or unexpected parent processes. Use time series analysis or burst detection algorithms to identify rapid, sequential executions of `systemctl` commands on a single host within a short period, which can indicate automated reconnaissance."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]