
[
  {
    "Is the adversary evading detection by hiding data in NTFS Alternate Data Streams? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.004 - NTFS Alternate Data Streams": {
          "An Alternate Data Stream (ADS) is created containing content whose hash matches a known malicious file.": {
            "Data": "Sysmon Event ID 15",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Sysmon Event ID 15 (FileCreateStreamHash) events across all monitored systems. Extract the hash (e.g., SHA256, IMPHASH) of the content written to all created streams. Inner join these collected hashes with a high-confidence threat intelligence feed of known malware hashes, updated at least daily. Generate a high-severity alert for any match and immediately investigate the parent file and the process that created the stream."
          },
          "Use of command-line syntax or specific utilities known to create, write to, or execute from an NTFS Alternate Data Stream.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) for command lines containing syntax indicative of ADS manipulation. Use regular expressions to search for patterns such as 'type .* > .*:.*', 'powershell.*Get-Content.*-Stream', 'wmic process call create \".*:.*\"', or 'certutil -urlcache .*:.*'. Use frequency analysis to identify rare command line patterns. Flag commands executed by common utilities (cmd.exe, powershell.exe, wmic.exe, certutil.exe) that include this syntax and analyze the parent process and user context for anomalous behavior."
          },
          "A process is launched directly from an Alternate Data Stream, or an ADS path is passed as an argument to a loader or scripting engine.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Windows Event ID 4688, Sysmon Event ID 1) where the 'ProcessName', 'Image', or 'CommandLine' field contains the ':' character in the file path, indicating potential execution from a stream (e.g., 'C:\\Users\\user\\doc.txt:payload.exe'). This behavior is highly anomalous. Use descriptive statistics to find low-frequency execution paths containing the stream syntax. Scrutinize any occurrence immediately, investigating the parent process and associated user activity."
          },
          "An executable file stream is created and attached to a seemingly benign parent file type (e.g., text, image), or a downloaded file immediately has a stream attached by another process.": {
            "Data": "Sysmon Event ID 15; Sysmon Event ID 11; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 15 to detect the creation of any new ADS. Profile the parent file names and types, and flag instances where a stream is attached to common document or image files (.txt, .docx, .pdf, .jpg, .png). Correlate Zeek files.log (file downloads over network) with subsequent Sysmon Event ID 11/15 events on the destination host to detect when a downloaded file immediately has an ADS written to it by a separate process. Use correlation analysis based on filename and a short time window (e.g., within 60 seconds of download) to link the events."
          },
          "Anomalous network connection initiated by a process that was launched from an Alternate Data Stream or by a loader process known to execute from streams.": {
            "Data": "Zeek conn.log; Sysmon Event ID 1; Sysmon Event ID 3",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "First, identify processes executing from an ADS using command line monitoring (Sysmon Event ID 1). Then, using Sysmon Event ID 3 (Network Connection), identify any network connections made by these suspicious processes. Correlate this host data with Zeek conn.log based on timestamp and source/destination IPs. Use linear regression to identify if a statistical correlation exists between ADS creation events on a host and a subsequent increase in anomalous outbound network traffic. Flag any external communication from a process running from an ADS for immediate investigation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
