[
  {
    "Is the adversary attempting to wipe or corrupt data to impact availability? (TA0040 - Impact)": {
      "Indicators": {
        "T1561 - Disk Wipe": {
          "Attempts to access or write to sensitive disk locations (MBR, boot sector) or raw disk devices using kernel-level access or special notation (e.g., \\\\.\\).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (e.g., Event ID 4656, 4663, requiring advanced audit policy) for access attempts to raw disk devices (e.g., \\\\.\\PhysicalDriveX) or sensitive system files related to the boot process. Analyze the process and user associated with these events. Identify sudden spikes in low-level write operations using time series analysis or frequency counts."
          },
          "Installation of unusual kernel drivers or attempts to gain high-level privileges required for raw disk access.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (Event ID 4697) for suspicious service installations, particularly those marked as kernel drivers. Correlate driver installations with processes attempting privileged actions (Event ID 4688). Analyze the entropy of newly created or modified files in system directories associated with drivers to detect potentially packed or obfuscated malicious code."
          },
          "High volume of network connections to administrative shares or remote services (like SMB, WinRM) from a host suspected of disk wiping activity.": {
            "Data": "Zeek smb_mapping.log; Zeek conn.log; Windows Event ID 5140; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts exhibiting evidence of disk wiping attempts (from other evidence). Correlate activity on these hosts with Zeek logs (conn.log for volume, smb_mapping.log for share access) and Windows Event IDs (5140 for share access, 4624 type 3 for network logon) showing high frequency connections originating from these hosts to other internal systems via administrative shares (e.g., C$, Admin$) or remote services. Use frequency analysis and statistical process control to identify anomalous spikes in lateral connectivity volume from the source host compared to historical data."
          },
          "Execution of destructive commands (`erase`, `delete` with specific arguments) on network device command lines.": {
            "Data": "Zeek syslog.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network device logs (Zeek syslog.log if configured to capture this) for command execution events. Filter for commands like `erase`, `delete`, `write erase`, `format` followed by arguments targeting configuration files, flash memory, or persistent storage. Identify sudden or unauthorized execution of such commands. Analyze the frequency and source of these commands using time series analysis to detect unusual bursts of activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]