[
  {
    "Has the adversary attempted to impair command history logging? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1562.003 - Impair Command History Logging": {
          "Modification or unsetting of command history environment variables (HISTFILE, HISTSIZE, HISTCONTROL) on systems running bash or similar shells.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688 capturing command line) for commands attempting to modify or unset shell history environment variables (e.g., `unset HISTFILE`, `export HISTSIZE=0`, `export HISTCONTROL=ignorespace`) when executed via Windows processes. Correlate with user and parent process to detect unexpected execution using frequency analysis."
          },
          "Execution of PowerShell commands to disable history logging or change history file path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688 capturing command line) for PowerShell command lines containing `Set-PSReadLineOption -HistorySaveStyle SaveNothing` or `Set-PSReadLineOption -HistorySavePath`. Identify the user executing the command and analyze for anomalous or unauthorized activity using frequency analysis on user and command arguments."
          },
          "Deletion or modification of PowerShell history files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688 capturing command line) for commands attempting to delete, clear, or rename PowerShell history files (e.g., `del *ConsoleHost_history.txt*`, `erase *ConsoleHost_history.txt*`, `Set-Content *ConsoleHost_history.txt* -Value \"\"`). Use frequency analysis to identify unexpected deletion/modification attempts on these specific file paths."
          },
          "Execution of commands used to impair history logging by anomalous users or from unusual process contexts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for command lines matching known patterns for disabling history (`unset HISTFILE`, `export HISTSIZE=0`, `Set-PSReadLineOption`). Analyze the user account executing the command and the parent process (ParentProcessId, ParentProcessName fields). Use statistical analysis (e.g., frequency, correlation) to identify execution by accounts that do not typically run such commands, or execution from parent processes that are unusual for system administration tasks."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]