[
  {
    "Is the adversary attempting to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.012 - File-Path Exclusions": {
          "Creation of unusual files or executables within directories typically excluded from security scanning.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify default and custom security software (AV/EDR) file/folder exclusion paths across endpoints and servers. Monitor Windows Event ID 4663 (File write) and 4688 (Process creation) for events occurring within these identified paths. Apply filtering to identify file types or names that are not typically found or expected in these exclusion directories. Use frequency analysis to spot rare or unique file writes in these paths."
          },
          "Execution or modification activity originating from files located in known security exclusion paths.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify default and custom security software (AV/EDR) file/folder exclusion paths. Monitor Windows Event ID 4688 for process creations where the parent process path is within an exclusion directory or the process image path is within an exclusion directory. Monitor Windows Event ID 4663 for read/write/modify operations on files within exclusion paths by unexpected processes. Use correlation analysis to link process activity (4688) with file access events (4663) within the exclusion zones."
          },
          "Network download activity immediately followed by file creation in a known security software exclusion path.": {
            "Data": "Zeek conn.log; Windows Event ID 4663; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network connection logs (Zeek conn.log from network devices, Windows Event ID 5156 from endpoints/servers) showing downloads from external IP addresses with subsequent file creation events (Windows Event ID 4663) in known AV/EDR exclusion paths within a short time window (e.g., 1-5 minutes). Analyze the source of downloads (IP reputation, ASN) and file characteristics (e.g., file type, hash). Use time series analysis to identify unusual spikes in file creations within excluded paths that are temporally linked to network download events."
          },
          "Discovery commands querying for AV/EDR exclusion paths followed by file operations within those paths.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) executing commands known to query or list AV/EDR exclusion settings (e.g., `reg query \"HKLM\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\Paths\"`, `Get-MpPreference`). Correlate such discovery activities on a host with subsequent file write (Windows Event ID 4663) or process execution (Windows Event ID 4688) events involving files located within the discovered or default exclusion paths by the same user or process lineage. Establish a baseline for legitimate queries to these paths and alert on deviations or when correlated with suspicious subsequent activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]