[
  {
    "Has the adversary attempted to evade defenses by modifying cloud firewalls? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.007 - Disable or Modify Cloud Firewall": {
          "Modification of existing cloud security group or firewall rules, especially allowing wider access or new protocols.": {
            "Data": "AWS CloudTrail Logs; Azure Activity Logs; GCP Audit Logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs (AWS CloudTrail, Azure Activity, GCP Audit) for events indicating modification of security groups or firewall rules (e.g., AuthorizeSecurityGroupIngress, RevokeSecurityGroupIngress). Filter for rule changes that broaden access (e.g., allowing '0.0.0.0/0' or unexpected ports/protocols). Correlate these changes with anomalous traffic patterns in Zeek conn.log occurring shortly after the modification using time series analysis on traffic volume or entropy on port usage."
          },
          "Creation of new cloud security groups or firewall rules, especially allowing wider access or new protocols.": {
            "Data": "AWS CloudTrail Logs; Azure Activity Logs; GCP Audit Logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs (AWS CloudTrail, Azure Activity, GCP Audit) for events indicating creation of new security groups or firewall rules (e.g., CreateSecurityGroup, CreateFirewallPolicy). Filter for new rules/groups that grant wide or unexpected access. Analyze Zeek conn.log for new or increased traffic flows matching the newly allowed rules, potentially using statistical anomaly detection (e.g., time series analysis on connection volume or correlation analysis with the creation timestamp)."
          },
          "Sudden increase or appearance of network traffic on ports/protocols previously blocked by cloud firewall rules, observed via network flow logs (Zeek).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify baseline network traffic patterns (ports, protocols, volume) using Zeek conn.log for cloud-hosted resources. Detect sudden deviations from this baseline (e.g., using statistical process control or time series anomaly detection) specifically for traffic that would have been blocked by previous firewall rules. Correlate these traffic anomalies with recent cloud audit log entries indicating firewall rule modifications or creations using correlation analysis."
          },
          "Appearance of successful or failed login attempts or service connections to cloud-hosted instances originating from new or unusual external IP addresses shortly after a cloud firewall rule modification.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud-hosted instances from external IPs on ports/protocols enabled by recent firewall changes. Correlate these connections with Windows Event IDs 4624 (successful logon) and 4625 (failed logon) on target servers. Analyze the source IP addresses of these login attempts using frequency analysis or geolocation to identify new or unusual sources compared to historical data. Use correlation analysis to link login attempts/connections to the timestamp of the cloud firewall rule change."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]