```json
[
  {
    "Is the adversary attempting to manipulate stored data to impact operations or hide activity? (TA0040 - Impact)": {
      "Indicators": {
        "T1565.001 - Stored Data Manipulation": {
          "Execution of known data wiper or manipulation tools identified by file hash or specific process artifacts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) with process names or file hashes that match a maintained threat intelligence list of known data wiper/manipulation tools (e.g., WhisperGate, NotPetya components). Correlate these process creation events with subsequent high-volume file modification/deletion events (Windows Event ID 4663) originating from that process. Alert on any hash or name match from a high-confidence CTI source."
          },
          "Use of legitimate system utilities with command-line arguments indicative of widespread data overwriting or deletion.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor process creation events with Command Line Auditing (Windows Event ID 4688). Create detection rules that flag the use of common system utilities with specific argument patterns indicative of data destruction, such as `cipher.exe /w:`, `sdelete.exe -p`, or `format.com /p:`. Use regular expression matching on the command line field. Correlate these command patterns with the executing user and parent process to distinguish from legitimate administrative activity. Use frequency analysis to detect rare or first-time usage of these command patterns in the environment."
          },
          "Violation of file integrity for critical system or application files, detected by a mismatch with a known-good hash baseline.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a secure baseline of file hashes (e.g., SHA-256) for critical operating system files, application binaries, and key configuration files. Configure file system auditing (SACLs) on these assets to generate Windows Event ID 4663 (attempted write/delete). Upon detection of a modification event, trigger a process to re-calculate the file's hash and compare it against the known-good baseline. Alert immediately on any hash mismatch, which signifies unauthorized modification. Investigate the process and user account responsible for the change as recorded in the event log."
          },
          "Anomalous high-volume file modification or deletion activity in critical data stores, deviating significantly from established operational baselines.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4659; Windows Event ID 4660",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal file system activity (modifications, deletions, creations) for critical directories (e.g., database storage, file shares) on a per-host and per-user basis. Monitor Windows Event IDs 4663 (object access), 4659 (handle to object requested with delete access), and 4660 (object deleted). Use time series analysis or statistical methods (e.g., Z-score, Inter-Quartile Range) on the volume of these events over short time windows to detect sudden, anomalous spikes in activity. Alert when the rate of deletions/modifications exceeds a dynamic threshold (e.g., >3 standard deviations from the mean)."
          },
          "Widespread, rapid file renaming to a common extension, characteristic of ransomware, correlated with anomalous preceding network activity.": {
            "Data": "Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for a high volume of file modification or creation events (Windows Event ID 4663) where the file name is changed to include a new, common extension across numerous files (e.g., .locked, .encrypted). Calculate the entropy of filenames in a directory; a sudden decrease may indicate a common extension is being appended. Correlate this file system activity with preceding network connections from the affected host to unusual external destinations or known C2 servers (from Zeek conn.log) within a 30-minute window. Trigger a high-severity alert on this combined behavioral pattern."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```