[
  {
    "Has the adversary gained initial access to the network via spearphishing link? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.002 - Spearphishing Link": {
          "Network connections or DNS requests to known malicious or anomalous URLs associated with spearphishing links.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, dns.log, and http.log for connections or DNS queries to URLs/IPs present in threat intelligence feeds for phishing or malicious domains. Identify domains with high entropy or unusual character combinations (IDN homograph-like) using entropy calculations on domain names. Look for connections to URLs with unusual structures (@ symbol abuse, integer-based hostnames). Correlate network activity with potential email delivery events if possible."
          },
          "Unusual process creation, file downloads, or authentication events following a user clicking a suspected spearphishing link.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify process creation events (Windows Event ID 4688) originating from web browsers (chrome.exe, firefox.exe, msedge.exe) that result in the execution of unusual child processes (e.g., scripting engines, installers, common malware names). Monitor Zeek http.log for file downloads immediately following web browser activity. Look for authentication events (Windows Event ID 4624, 4625) associated with browser activity or potentially malicious OAuth/device code flows, especially if the target resource or authentication method is unusual. Use correlation analysis to link browser process activity with network connections and subsequent file/process events."
          },
          "Network connections initiated by a user's system shortly after receiving an email with characteristics of sender spoofing or suspicious headers.": {
            "Data": "Zeek conn.log; Zeek smtp.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log to identify emails with suspicious sender characteristics (e.g., SPF/DKIM failures detected by mail server, mismatched 'From' and 'MailFrom' addresses). Correlate these emails with Zeek conn.log entries showing new outbound connections originating from the recipient user's system within a short time window (e.g., 60 seconds) of the email delivery timestamp. Identify connections to unusual domains or IPs using frequency analysis of destinations visited post-email receipt."
          },
          "Network connections to domains/URLs exhibiting patterns consistent with OAuth or device code phishing flows, particularly involving unusual TLDs or query parameters.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and conn.log for connections to URLs containing specific query parameters or paths indicative of OAuth/SAML/device authorization requests (e.g., 'client_id=', 'redirect_uri=', 'scope=', 'device_code', '/authorize'). Filter for connections to domains using unusual or recently registered TLDs (using dns.log or external domain reputation). Analyze the correlation between the URL structure and the destination domain/IP address. Use frequency analysis to identify recurring suspicious URL patterns or connections to specific unusual domains from multiple users."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]