[
    {
        "information_requirement": "Is the adversary exfiltrating data over webhook?",
        "tactic_id": "TA0010",
        "tactic_name": "Exfiltration",
        "indicators": [
            {
                "technique_id": "T1567.004",
                "name": "Exfiltration Over Webhook",
                "evidence": [
                    {
                        "description": "Outbound HTTP/S POST requests to external URLs or IP addresses that match known malicious webhook endpoints used by C2 frameworks or malware.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate the `host` and `uri` fields from Zeek http.log and destination IPs from Zeek conn.log against a high-confidence cyber threat intelligence (CTI) feed of known malicious webhook URLs, domains, and IP addresses. This feed should be updated daily. Alert on any exact matches and investigate the source host and nature of the data."
                    },
                    {
                        "description": "Execution of command-line utilities (e.g., curl, Invoke-WebRequest) with arguments characteristic of data exfiltration to a webhook, such as POSTing a file or piped data.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events of common data transfer utilities (`curl.exe`, `powershell.exe`, `wget.exe`). Analyze command-line arguments for patterns such as `-X POST`, `-d @filename`, `Invoke-RestMethod -Method Post -InFile`, or piped input (`cat secrets.txt | curl ...`). Use correlation analysis to link these process events with corresponding outbound POST requests in Zeek http.log based on source host and timestamp. Investigate the full command line and the destination URL."
                    },
                    {
                        "description": "Presence of sensitive data structures or file types (e.g., compressed archives, database dumps, base64 encoded data) within the body of HTTP POST requests to webhook services.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log for POST requests targeting potential webhook URLs. Inspect the `Content-Type` header for suspicious types like `application/zip`, `application/x-7z-compressed`, or `application/octet-stream`. If payload inspection is available, scan for base64 encoded data patterns or file magic numbers. Use Zeek files.log to identify files transferred via HTTP, analyzing their type, size, and source. Use frequency analysis to flag rare `Content-Type` headers being POSTed from the environment."
                    },
                    {
                        "description": "Anomalous volume, size, or frequency of outbound HTTP/S POST requests from an internal host, particularly to domains associated with webhook or collaboration services (e.g., Discord, Slack).",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal outbound POST request activity for each internal host or user group, considering destination domains, data volume (`orig_bytes` in Zeek conn.log), and frequency. Use time series analysis to detect sudden spikes in the number or volume of POST requests from a host. For POSTs to known webhook/collaboration platforms, use percentile analysis or the Inter-Quartile Range (IQR) method on the request size to identify significant outliers that could represent large data archives being exfiltrated. A linear regression model could identify hosts with a sustained, increasing trend of outbound data."
                    },
                    {
                        "description": "A sequence of internal data aggregation on a host followed immediately by an outbound POST request to a newly observed external domain.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and monitor for a behavioral sequence. Step 1: Detect internal data staging behavior on a host, such as the creation of large archive files (`.zip`, `.rar`, `.7z`) via command-line utilities (`7z.exe`, `tar`, `zip`) logged in Windows Event ID 4688. Step 2: Within a short time window (e.g., 5 minutes), correlate that host's activity with a subsequent outbound connection (Zeek conn.log) to a low-prevalence or newly seen external domain, specifically via an HTTP POST request (Zeek http.log). This sequence strongly indicates data staging followed by exfiltration over a covert channel."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
