
[
  {
    "Is the adversary evading defenses by using NTFS file attributes? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1564.004 - NTFS File Attributes": {
          "Execution of command lines containing specific, hardcoded file paths and stream names used by known malware families to hide payloads in Alternate Data Streams (ADS).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Process Creation logs (Windows Event ID 4688) with command-line logging enabled. Maintain a list of exact command-line strings and highly specific regular expressions derived from threat intelligence reports on malware that uses ADS (e.g., 'type malware.exe > C:\\Windows\\system.ini:payload.exe'). Use this list to scan command-line arguments for exact matches. Alert on any hits, as these represent high-confidence indicators of specific threats."
          },
          "Use of generic ADS syntax (e.g., 'filename:streamname') in process command lines or file access events, especially by processes not typically associated with ADS usage.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Process Creation (4688) and File Access (4663, requires SACL) logs. Use a general regular expression to search all process command lines and file access object names for the ADS syntax (e.g., `\\w+\\.\\w+:\\w+`). Create an exclusion list for known benign processes that use ADS (e.g., browsers writing 'Zone.Identifier'). Analyze the frequency of ADS-related activity by process name and user account using descriptive statistics to flag rare or suspicious usage patterns."
          },
          "A file is written to an Alternate Data Stream, followed by a process execution event originating from that same ADS, indicating a 'write-then-execute' sequence.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable detailed file auditing (SACLs) on critical directories to log write access (Event ID 4663). Monitor for write events to ADS streams where the object name contains the ':' syntax. Correlate these write events with subsequent process creation events (Event ID 4688) where the 'ProcessName' or image path points to the same ADS stream. Use correlation analysis based on the file path, host, and a short time window (e.g., within 5 minutes) to detect this highly suspicious behavioral sequence."
          },
          "An unusual parent process (e.g., an Office application, web server process) creates or modifies an Alternate Data Stream, especially on a system file.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file access (4663) and process creation (4688) logs for any ADS manipulation. For each event, analyze the parent process. Establish a baseline of normal parent processes that interact with ADS (e.g., explorer.exe, chrome.exe). Use frequency analysis (e.g., count of parent-child process pairs involving ADS) to identify and alert on rare or anomalous parent processes, such as WINWORD.EXE, powershell.exe spawned from a document, or w3wp.exe, writing to an ADS, particularly on files in system directories."
          },
          "An outbound network connection is initiated by a process running directly from an Alternate Data Stream.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Event ID 4688) with network connection events (Event ID 5156 or Zeek conn.log) by Process ID and hostname within a short time window. Filter for processes whose image path (from Event ID 4688) contains the ADS ':' syntax. Any resulting network connection is highly suspicious. Use time series analysis on the volume of network traffic from such processes to identify patterns like beaconing or large data transfers, which could indicate C2 communication or exfiltration."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
