
[
  {
    "Has the adversary gained initial access to the network via spearphishing voice? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.004 - Spearphishing Voice": {
          "A user's endpoint initiates a network connection to a URL, domain, or IP address known to be malicious and associated with vishing campaigns.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join network logs (Zeek http.log, dns.log, conn.log) against a high-confidence, continuously updated threat intelligence feed containing URLs, domains, and IPs specifically associated with vishing or social engineering campaigns. Generate an immediate alert upon any match and investigate the user and endpoint activity preceding and following the connection."
          },
          "A process associated with a known remote access tool (e.g., AnyDesk, TeamViewer, GoToAssist) is created on an endpoint, especially if it was not installed via standard enterprise software deployment.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events matching a list of common, unauthorized remote access tool executables. Use descriptive statistics (frequency analysis) to identify processes that are rare across the enterprise. Correlate process creation with the absence of a corresponding legitimate software installation event to distinguish from sanctioned deployments. Flag any user-initiated installation or execution of these tools for review."
          },
          "Execution of command-line scripts (e.g., PowerShell, cscript) containing suspicious patterns such as download cradles, base64 encoded commands, or direct manipulation of security settings.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation command-line arguments (Windows Event ID 4688) for suspicious patterns indicative of malicious scripts often delivered via social engineering. Use regular expression matching for patterns like 'IEX(New-Object Net.WebClient).DownloadString', '-enc' (for encoded PowerShell), or commands that modify security configurations (e.g., Set-MpPreference -DisableRealtimeMonitoring). Correlate findings with parent processes; execution by non-standard parent processes (e.g., winword.exe, outlook.exe) increases suspicion."
          },
          "A user initiates a sequence of anomalous actions within a short time frame, such as visiting a new or low-reputation website, downloading an executable file, and then executing that file from a temporary or downloads directory.": {
            "Data": "Zeek http.log; Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a correlated detection rule that triggers on a specific sequence of events: 1) Zeek http.log shows a user visit to a domain with no organizational history or a poor reputation score. 2) Zeek files.log shows the download of a specific file type (e.g., 'application/x-dosexec', '.zip') from that domain. 3) Windows Event ID 4688 on the user's host shows the execution of a process with the downloaded filename from a user-writable location (e.g., C:\\Users\\*\\Downloads). Use correlation analysis on hostname/IP and timestamps within a narrow time window (e.g., 5 minutes) to link the events."
          },
          "An unusual pattern of Multi-Factor Authentication (MFA) activity for a user account, such as multiple push notifications in a short period followed by a successful approval, indicating a potential MFA fatigue attack.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate MFA provider log events and Windows Event ID 4624 (successful logon) per user. Use time series analysis or simple thresholding to detect a spike in MFA prompts for a single user (e.g., >3 prompts in 2 minutes) that is immediately followed by a successful authentication. Use a box-plot or Inter-Quartile Range (IQR) on the distribution of MFA prompts per user per hour to identify outlier events. Correlate the source IP of the successful login with the user's typical login geolocations to identify further anomalies."
          },
          "A user's endpoint establishes an outbound connection to a newly observed external destination, especially if followed by a significant data transfer or a long-lived connection, inconsistent with the user's baseline network behavior.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of typical external destinations (IPs, domains, ASNs) and connection characteristics (duration, data volume) for each user or user group using historical Zeek conn.log and dns.log data. Monitor for connections to destinations not present in the established baseline ('first-seen' destinations). Analyze connection characteristics: flag long durations or high byte counts that deviate significantly from the user's normal activity profile using statistical methods like Z-scores or percentile ranks. Calculate the entropy of destination ports for a user over time; a sudden increase may indicate unusual scanning or C2 activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
