[
  {
    "Has the adversary gained initial access to the network via spearphishing voice? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.004 - Spearphishing Voice": {
          "Detection of user accessing known malicious URLs or downloading suspicious files shortly after receiving potential vishing communication.": {
            "Data": "Zeek http.log; Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek http.log for connections to known malicious URLs from threat intel feeds or unusual/newly visited domains with Zeek file.log for associated downloads. Analyze Windows Event ID 4688 for process creation events related to browser downloads or execution of downloaded files. Use time series analysis on user browsing/download activity to identify anomalies following reported or suspected vishing incidents."
          },
          "Installation or execution of unauthorized remote access tools on user endpoints, or unusual/unsolicited multi-factor authentication approvals for user accounts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for the creation of processes associated with common remote access tools (AnyDesk, TeamViewer, Splashtop, etc.). Correlate process creation events with successful logins (Event ID 4624) or network connections (Zeek conn.log) originating from the endpoint shortly after. Monitor authentication/MFA system logs for unsolicited or unusual MFA approval events for high-value accounts and correlate with login attempts. Use frequency analysis to identify rare process executions or login attempts per user."
          },
          "Outbound network connections from user endpoints to suspicious or unusual external destinations shortly after suspected vishing interactions.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections from endpoints to external IPs/domains not typically visited by the user or organization, especially on unusual ports. Correlate with Zeek dns.log to resolve destination domains. Use frequency analysis or correlation analysis to identify rare destination IPs/domains or bursts of connections to new destinations occurring within a timeframe (e.g., 1 hour) of a reported vishing incident or observed suspicious activity. Compare connection patterns to established baselines for user groups using descriptive statistics."
          },
          "Execution of command-line interpreters or suspicious executables from user endpoints with unusual arguments or locations shortly after suspected vishing interactions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on user endpoints for the creation of processes like cmd.exe, powershell.exe, or other executables run from temporary directories (%TEMP%, Downloads). Analyze command-line arguments for suspicious patterns (e.g., encoded commands, external downloads). Use descriptive statistics to identify processes/command lines with low frequency across endpoints or processes executed from unusual parent processes or locations compared to typical user behavior baselines. Flag executions occurring shortly after reported vishing incidents."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]