[
  {
    "Is the adversary moving laterally through RDP session hijacking? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1563.002 - RDP Hijacking": {
          "Execution of tscon.exe with parameters indicative of session hijacking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for `tscon.exe`. Specifically look for command lines containing session identifiers (`[session number to be stolen]`) or arguments like `/dest`. Use correlation analysis to link `tscon.exe` execution to preceding RDP activity (Windows Event ID 4624) on the same host to identify potential hijacking events."
          },
          "Anomalous RDP session activity, such as connections from unexpected sources to active sessions or usage of cmd.exe in RDP sessions.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Zeek rdp.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze RDP session login (Windows Event ID 4624, Zeek rdp.log) and logoff events (Windows Event ID 4634, 4647). Look for RDP connections where the session is already active (not a new session ID). Monitor process creation events (Windows Event ID 4688) within RDP sessions for suspicious processes like `cmd.exe` used in conjunction with session manipulation commands or anomalous post-login activity (e.g., execution of discovery commands not typical for the user or host). Use time series analysis to identify deviations from baseline RDP session lengths or frequency for specific users/hosts."
          },
          "Service creation or modification utilizing cmd.exe /c or /k with command line arguments potentially related to session manipulation or execution.": {
            "Data": "Windows Event ID 4697; Windows Event ID 4703; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697 (Service Install) and 4703 (Service Changed) for service creation or modification. Specifically, examine the `ServiceName` and `ImagePath` fields for paths involving `cmd.exe` and arguments like `/c` or `/k`. Further analyze corresponding Windows Event ID 4688 events for the spawned `cmd.exe` process to inspect its full command line for session manipulation commands (e.g., `query session`, `tscon`). Use frequency analysis to identify rare or unauthorized service modifications involving `cmd.exe`."
          },
          "Execution of system discovery, enumeration, or credential access tools by a legitimate user account immediately following an RDP logon, especially on a host not typically accessed by that user.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate RDP successful logon events (Windows Event ID 4624, Logon Type 10) with subsequent process creation events (Windows Event ID 4688) on the same host within a short time window (e.g., 5-10 minutes). Flag executions of known discovery tools (`whoami`, `ipconfig`, `net.exe`, `systeminfo`, etc.) or credential access related processes by the logged-on user. Establish a baseline of normal RDP access patterns (user-to-host connections and typical post-login processes) using correlation analysis over time. Identify and investigate instances where a user logs in via RDP to a host they do not normally access and executes suspicious commands."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]