[
  {
    "Is the adversary attempting to evade defenses by modifying system firewalls? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.004 - Disable or Modify System Firewall": {
          "Execution of commands or processes that disable or modify firewall rules.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) on endpoints and servers. Filter for process command lines containing firewall modification tools/commands like 'netsh firewall', 'Set-NetFirewallRule', 'New-NetFirewallRule', 'Remove-NetFirewallRule', or 'esxcli network firewall'. Flag any execution by non-standard users or from unusual directories. Use frequency analysis to identify unusual volume of firewall command executions on a single host."
          },
          "Modifications to Windows Registry keys associated with firewall configuration.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (A registry value was modified) on endpoints and servers. Filter for changes to known firewall-related Registry keys (e.g., SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy). Investigate any modifications to these keys, especially those that disable the firewall or open new ports. Use correlation analysis to link Registry modifications with preceding or subsequent network activity."
          },
          "New or increased network traffic on ports or protocols that were previously blocked or uncommon for a host, appearing shortly after a reported firewall modification.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify hosts reporting firewall modifications (Windows Event ID 4688 for commands, 4657 for registry changes). Monitor Zeek conn.log for connections involving these hosts originating or terminating on ports/protocols that were previously blocked or have low historical frequency for that host (using historical frequency analysis or percentile analysis on port usage). Correlate timestamps to identify new or increased traffic immediately after a reported firewall change."
          },
          "External or internal network connections to non-standard or high-numbered ports on internal hosts that typically do not host services on those ports.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections (especially external-to-internal or internal-to-internal lateral movement attempts) targeting non-standard ports (e.g., ports outside common ranges or high-numbered ports). Use frequency analysis per internal host/service to identify ports with unusually low historical connection counts now receiving traffic. Flag connections targeting high-numbered or uncommon ports on hosts not expected to offer services on those ports. Use descriptive statistics to establish baseline port usage."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]