[
  {
    "Is the adversary exfiltrating data using web services? (TA0010 - Exfiltration)": {
      "Indicators": {
        "T1567 - Exfiltration Over Web Service": {
          "Observation of network sessions with significantly higher outbound data volume than inbound volume to common external web services (e.g., cloud storage, social media, webmail).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log to identify sessions with significantly higher 'orig_bytes' than 'resp_bytes' connecting to common web service ports (80, 443). Calculate the ratio of outbound to inbound bytes for sessions over a certain size threshold. Use descriptive statistics and outlier detection (e.g., IQR, box plots) on the byte ratio distribution per destination domain/IP and user to flag unusual data asymmetry."
          },
          "Network connections originating from unusual processes or communicating with external web service destinations not typically accessed by that host or user, especially involving large data transfers.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log data with Windows Event ID 4688 logs (collected from endpoints/servers) to identify the process associated with outbound web service connections. Identify connections to destinations not commonly seen for that host/user. Use frequency analysis or time series analysis to detect new or unusual connections and processes making large outbound transfers to web services."
          },
          "Identification of PUT or POST requests with unusually large request body sizes to external web services from internal hosts.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for PUT/POST requests to external web services (ports 80/443). Extract 'request_body_len' for these requests. Use descriptive statistics (mean, median, max, standard deviation) and percentile analysis on 'request_body_len' per destination host/domain or source host/user to identify outliers (unusually large transfers). Flag sessions exceeding a predefined size threshold or statistical deviation from the norm."
          },
          "Frequent or unusual timed outbound connections to sanctioned external web services from specific users or hosts, deviating from their established baselines.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline typical connection frequency and timing patterns for outbound web service traffic (ports 80/443) per user and host using Zeek conn.log. Use time series analysis or statistical process control methods to identify significant deviations from these baselines (e.g., sudden increase in connection volume, connections occurring consistently outside of normal working hours/days). Correlate with Windows Event ID 4624 logon times to understand the context of user activity and identify connections occurring outside of logon sessions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]