[
  {
    "Has the adversary moved laterally using SSH Hijacking? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1563.001 - SSH Hijacking": {
          "SSH sessions originating from a user account to a system they would not normally access, or rapid SSH connections to multiple systems by a single user.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for SSH traffic (port 22). Correlate connections with user login events (Windows Event ID 4624/4625 if available or SSH logs on Linux/macOS). Identify sequences of successful SSH connections from a single source user/host to multiple destination hosts in a short time frame. Use correlation analysis to link user activity across different hosts and identify deviations from normal connection patterns per user by establishing baselines (descriptive statistics) and detecting outliers (percentiles)."
          },
          "Detection of an SSH agent socket file being accessed or used by a different user process than the legitimate owner.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for processes accessing paths or files matching common SSH agent socket patterns or related SSH process activity on Windows. Identify instances where the process accessing potentially sensitive SSH-related resources (like agent sockets or private key files) is not the expected legitimate process or user. Look for entropy changes in command line arguments or process execution relative to baselines for standard SSH client/agent processes."
          },
          "Execution of suspicious commands or lateral movement tools on a system shortly after an SSH session starts.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful SSH connections (Zeek conn.log) to a host with process creation events (Windows Event ID 4688) occurring on that host within a short time window after the connection is established. Analyze command line arguments and process names in Event ID 4688 for indicators of lateral movement (e.g., remote service execution, file transfers to network shares using uncommon methods) or other suspicious activity. Use frequency analysis to identify commands rarely executed by the connecting user or rarely seen on the target host."
          },
          "Unusual outbound SSH connections originating from internal systems typically not used to initiate SSH sessions.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify all SSH connections (dport 22). Create a baseline of internal IP addresses that commonly initiate outbound SSH connections. Flag outbound SSH connections originating from internal IPs that are not in this baseline or show a sudden increase in outbound SSH activity using time series analysis. Use descriptive statistics (frequency) and percentile analysis on the volume and frequency of outbound SSH connections per internal source IP to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]