[
  {
    "Is the adversary attempting to manipulate stored data to impact operations or hide activity? (TA0040 - Impact)": {
      "Indicators": {
        "T1565.001 - Stored Data Manipulation": {
          "Detection of unexpected modifications, deletions, or creations of sensitive files on servers or endpoints.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 on critical servers/endpoints for modifications, deletions, or new file creations in sensitive directories. Identify deviations from baseline file activity patterns (e.g., using time series analysis on file modification counts) or changes to files with known hashes/attributes. Alert on modifications to critical system or configuration files."
          },
          "Manipulation of data within critical databases or application-specific data files.": {
            "Data": "Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4663 targeting database files (.mdf, .ldf, etc.) on database servers. Correlate with Zeek conn.log to identify connections to database servers from unusual sources or at unusual times. Use statistical analysis (e.g., frequency analysis, time series) on database connection logs to detect anomalies in access patterns preceding data manipulation."
          },
          "Unauthorized changes to critical system or application configuration files (e.g., registry keys, config files) that could facilitate impact or hiding.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on critical system/application files and registry keys (e.g., security software configs, critical service binaries, web server configs) to generate Event IDs 4656/4663 on modification/write access. Filter logs for these events targeting sensitive objects. Correlate with process creation (Event ID 4688) to identify the process performing the modification. Alert on modifications from unauthorized users or processes, or at unusual times. Use frequency analysis to identify spikes in change attempts."
          },
          "Network connections to unusual ports or services on systems hosting critical data, immediately preceding or following file modification/access events.": {
            "Data": "Zeek conn.log; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network connections (Zeek conn.log) targeting servers/endpoints known to host critical data. Correlate these connections with Windows Event IDs 4656/4663 showing access or modification attempts on sensitive files/objects on those same hosts, occurring within a specific time window. Look for connections using non-standard ports or protocols accessing systems hosting critical data. Use time series analysis on connection counts and data volume to identify anomalous bursts of activity around data stores."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]