[
  {
    "Is the adversary attempting to evade defenses by spoofing security alerts? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.011 - Spoof Security Alerting": {
          "System logs showing security software reporting 'healthy' status despite other indicators of compromise or disabled services.": {
            "Data": "Windows Event ID 7036; Windows Event Logs; Application Logs; Security Logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (e.g., Event IDs 7036, relevant Application/Security logs) for status messages from security software. Correlate 'healthy' status reports with other endpoint or network indicators of compromise (e.g., file modifications, network connections to suspicious IPs, process anomalies). Use correlation analysis to identify instances where a 'healthy' status coincides with activity that should trigger an alert."
          },
          "Unexpected processes or executables generating security-related pop-ups, messages, or log entries.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697; Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs. Look for processes not associated with legitimate security software that generate security-related messages, pop-ups, or log entries. Use entropy measures or frequency analysis on process names or command lines associated with security-related terms to identify low-occurrence or unusual executables attempting to mimic security tools. Correlate with Windows Event ID 4697 (Service Installation) or 4698 (Scheduled Task Creation) to identify how the rogue process might have been established."
          },
          "Network connections originating from processes impersonating security tools, especially to unusual or external destinations.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 5156 (filtered for outbound connections) with Zeek conn.log, identifying connections originating from processes whose names resemble legitimate security tools (e.g., `defender.exe`, `msmpeng.exe`). Analyze destination IPs and ports. Compare destinations against known internal/external baselines and threat intelligence feeds using correlation analysis. Flag connections to unusual or malicious destinations from processes impersonating security tools."
          },
          "Security status reports or alerts from security tools showing abnormal frequency, timing, or message content characteristics.": {
            "Data": "Windows Event Logs (Security, Application, System)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect security-related events from Windows Event Logs (Security, Application, System) generated by known security software. Analyze the frequency and timestamps of 'healthy' status reports or alerts. Establish baseline reporting patterns using time series analysis (e.g., seasonal decomposition) or descriptive statistics (e.g., mean interval, standard deviation). Flag deviations using statistical methods like IQR or z-scores. Additionally, look for generic or malformed message content if log details are available."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]