[
  {
    "Is the adversary using dynamic resolution for Command and Control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1568 - Dynamic Resolution": {
          "Network connections to destinations identified as algorithmically generated domains (DGA).": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for queries to domains exhibiting characteristics of DGA (high entropy, low dictionary word proportion, unusual character patterns). Calculate entropy and other statistical measures for queried domain names. Flag and investigate connections (Zeek conn.log) to domains identified as potentially algorithmically generated."
          },
          "Network connections to recently registered or rarely visited domains.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries to external domains. Enrich domain data with registration age and global visit frequency data from external sources. Flag connections (Zeek conn.log) to domains that are recently registered (e.g., <30 days) or have very low global visitation counts using threshold analysis."
          },
          "Network connections from internal hosts exhibiting rapid switching between multiple external IP addresses or ports over a short period.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify internal hosts making connections to multiple distinct external IP addresses or ports within a specified timeframe (e.g., 60 seconds). Calculate the number of unique external IPs and ports contacted per internal host per minute using frequency analysis. Flag internal hosts with high rates of connection to distinct external destinations, especially if the destination ports/IPs are uncommon or vary rapidly. Use statistical outliers detection to identify unusual patterns compared to baseline behavior."
          },
          "Network connections to domains flagged as potentially algorithmically generated or recently registered, using common C2 ports or unusual ports.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Perform DGA detection analysis and domain age/frequency checks using Zeek dns.log. Correlate results with Zeek conn.log, specifically filtering for connections to common C2 ports (e.g., 443, 80, 53, 8080, or non-standard ports). Flag connections to domains identified as suspicious by the domain analysis methods (entropy, age, rarity) that utilize these specific ports. Calculate the frequency of connections to these suspicious domains on specific ports and identify outliers compared to normal network traffic patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]