
[
  {
    "Is the adversary disabling or modifying security tools to evade detection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.001 - Disable or Modify Tools": {
          "Execution of known malicious tools or scripts specifically designed to disable security software, identified by file hash or name.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor for process creation events (Windows Event ID 4688). Compare the file hash and process name of newly created processes against a continuously updated cyber threat intelligence (CTI) feed of known security tool disablers (e.g., PCHunter, GMER, PowerTool, Defeat-Defender scripts). Alert immediately on any confirmed hash or file name match and investigate the parent process and subsequent activity."
          },
          "Use of specific commands or command-line arguments known to terminate, uninstall, or modify common security tools (e.g., Windows Defender, Sysmon, EDR agents).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for command lines containing suspicious patterns targeting security tools. Use regular expressions to detect commands like `net stop <service_name>`, `sc config <service_name> start= disabled`, `taskkill /IM <process.exe>`, `fltmc unload <driver>`, or PowerShell cmdlets such as `Set-MpPreference -DisableRealtimeMonitoring $true`, `Remove-MpThreat`, or commands modifying known security registry keys via `reg.exe`. Correlate these commands with execution by non-administrative or unexpected parent processes (e.g., `explorer.exe`, `winword.exe`)."
          },
          "A sequence of events where a suspicious process is created, followed shortly by the termination of a known security tool's process or the stopping of its associated service.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate events within a short time window (e.g., 1-5 minutes) on a single host. Define a rule that triggers when a suspicious process creation event (Windows Event ID 4688 from a non-standard location, unsigned binary, or suspicious parent) is followed by a service stop event for a security tool (Windows Event ID 7036 for services like 'WinDefend' or 'Sysmon') or a process termination event (another Windows Event ID 4688 for `taskkill.exe`, etc.) targeting a known security process. Analyze the parent-child process relationships to confirm the suspicious process initiated the termination."
          },
          "Anomalous modification or deletion of registry keys, configuration files, or directories associated with security tools, particularly those controlling anti-tampering, logging, or exclusion settings.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal access patterns to critical security tool configuration files (e.g., .xml, .conf) and registry keys. Monitor for modifications or deletion attempts (Windows Event IDs 4663 and 4657) originating from unauthorized processes or users (e.g., any process other than the security tool's own updater or configuration manager). Use correlation analysis to link these modifications to a preceding suspicious process execution. Flag any modification to anti-tampering keys or the addition of broad exclusion paths (e.g., `C:\\`, `C:\\Windows\\Temp`) as high-priority alerts."
          },
          "A statistically significant and unexplained reduction in the volume of security event logs being generated by a host, or the complete clearing of a security event log.": {
            "Data": "Windows Event ID 1102; Windows Event IDs relevant to security monitoring (e.g., 4688, 5156)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each host, establish a baseline of expected log volume per hour/day for critical security event IDs using time series analysis (e.g., ARIMA or simple moving averages). Alert when a host's log volume drops below a statistically significant threshold (e.g., >3 standard deviations from the mean, or drops to near-zero for an extended period). Additionally, create a high-severity, non-suppressible alert for the occurrence of Windows Event ID 1102 (The audit log was cleared), and investigate the responsible user and process immediately. Use linear regression to predict expected log volumes and flag significant negative residuals."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
