[
  {
    "Is the adversary attempting to evade defenses by hiding files or directories? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1564.001 - Hidden Files and Directories": {
          "File creation or modification where filename starts with '.' character.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs. Search for process creations with command lines creating or manipulating files whose names start with '.' (e.g., commands involving '>> .' or creating files starting with '.'). Investigate unusual instances or users performing these actions. Use frequency analysis to identify rare command line patterns or users executing such commands."
          },
          "Execution of the attrib.exe command with the +h flag.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 logs. Filter for process creations where the command image is 'attrib.exe' and the command line contains '+h'. Investigate execution by unexpected users or in unusual directories. Use descriptive statistics to baseline normal `attrib` usage in the environment (e.g., frequency, typical users/paths) and identify outliers or sudden increases in usage."
          },
          "File system object attribute change where the hidden attribute is set.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4663 logs with file system object access auditing enabled for attribute changes. Filter events where the 'Attributes' field or equivalent indicates the addition of the hidden attribute (e.g., flag '0x2'). Identify the Subject, Process ID, and Object Name (file path). Flag instances where this occurs for critical system files or user files by non-standard applications. Use frequency analysis to identify programs or users that rarely or never set the hidden attribute, highlighting deviations."
          },
          "Network connection initiated by a process with an unusual path or name, potentially indicating execution from a hidden location.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation (Windows Event ID 4688) and network connection allowed (Windows Event ID 5156) logs with Zeek conn.log data by timestamp and potentially source IP/port. Focus on identifying network connections originating from processes with image paths containing unusual patterns (e.g., starting with '.', residing in typically temporary or hidden directories). Analyze command line arguments (4688) and destination network endpoints (5156, Zeek). Use entropy analysis on the distribution of process image paths initiating outbound connections or frequency analysis on the occurrence of specific suspicious paths to flag rare events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]