[
  {
    "Is the adversary using resource forking to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.009 - Resource Forking": {
          "Identification of files with 'com.apple.ResourceFork' extended attribute containing unusually large data amounts or execution attempts from resource forks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for command-line execution of utilities or scripts potentially used to inspect, modify, or execute from extended attributes or file streams (e.g., tools that interact with Alternate Data Streams on Windows as an analogy, if resource forks were transferred cross-platform). Filter for commands targeting sensitive directories or file types. Analyze command arguments and frequency using descriptive statistics and time series analysis to identify anomalous or rare occurrences."
          },
          "Command-line execution attempting to access or move data within resource forks, followed by suspicious network connections or process creation.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for command-line patterns potentially indicative of interacting with hidden data streams or unusual file execution methods. Correlate suspicious command executions with subsequent network connection attempts seen in Zeek conn.log. Use correlation analysis to identify statistically significant links between specific command-line activities and outbound connections, especially to unknown or low-reputation endpoints."
          },
          "Execution of binaries or scripts directly from temporary file paths or Windows Alternate Data Streams, potentially dropped or invoked by hidden code.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation where the image path or command line arguments contain specific indicators of execution from temporary directories (e.g., %TEMP%, C:\\Windows\\Temp) or from Alternate Data Streams (using :<stream_name> syntax). Use frequency analysis on process paths and command lines to identify uncommon execution patterns from these locations, which may indicate dropped or invoked hidden code."
          },
          "Outbound network connections exhibiting unusual statistical properties characteristic of obfuscated C2, potentially from code executed via hidden means.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn, http, ssl, dns) for outbound connections from internal systems. Calculate statistical properties of the traffic (e.g., entropy of byte sequences in conn/http logs) or analyze patterns in DNS/HTTP requests (e.g., domain generation algorithm detection). Use time series analysis to identify statistically significant deviations from baseline network traffic for specific internal hosts, potentially indicating obfuscated C2 resulting from hidden code execution."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]