[
  {
    "Is the adversary impairing defenses to evade detection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562 - Impair Defenses": {
          "Sudden decrease or cessation of logs from security tools or logging services.": {
            "Data": "Windows Event ID 1102; Windows Event ID 7036; Windows Event ID 7045; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor event logs (e.g., Windows Event Log, security service logs) and log aggregation platforms for sudden drops in log volume or complete cessation of logs from critical security tools (e.g., EDR, AV, Sysmon) or system logging services (e.g., Windows Event Log). Use time series analysis to detect statistically significant anomalies in log rate (e.g., using standard deviation or moving averages over time periods) compared to historical baseline."
          },
          "Unauthorized modifications to Windows Registry keys or system configurations related to security tools, services, or logging.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to critical Registry keys associated with security software auto-start, service configuration, or logging settings (e.g., keys under HKLM\\SYSTEM\\CurrentControlSet\\Services, HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run, HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows\\EventLog). Analyze command-line arguments in Windows Event ID 4688 for suspicious processes attempting to modify these keys or disable services (e.g., `sc stop`, `net stop`, `reg delete`). Correlate modifications with suspicious process activity and user context. Use frequency analysis to identify rare or unique registry modifications."
          },
          "Execution of commands or processes designed to stop or disable security services or critical logging processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036; Windows Event ID 7045",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments containing service control commands (`sc stop`, `net stop`), taskkill (`taskkill /f /im`), or suspicious scripts/executables associated with stopping services or processes commonly used by security tools or logging. Correlate with Windows Event ID 7036 (Service State Change - Stopped) to confirm services were stopped, and Windows Event ID 7045 (New Service Installed) which could indicate installation of malicious tools. Use frequency analysis on observed command lines and process names to identify outliers."
          },
          "Network connections targeting internal logging or security infrastructure that cease abruptly or exhibit patterns indicative of disruption attempts.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from internal hosts targeting logging servers, security consoles, or network defense infrastructure (e.g., SIEM, central AV server). Correlate these connection attempts with the cessation of logs from the source host. Analyze Windows Event ID 5156 logs on endpoints/servers for outbound connections to logging/security servers being blocked, indicating local firewall rule changes. Use time series analysis on connection logs to logging/security infrastructure to detect sudden drops or changes in connection frequency or volume from specific internal sources using methods like moving averages or IQR."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]