
[
  {
    "Is the adversary attempting to evade defenses by hiding files or directories? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1564.001 - Hidden Files and Directories": {
          "Creation of a hidden file or directory with a name or path known to be used by specific malware or threat actors.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation command lines (Event ID 4688) and file system attribute changes (Event ID 4663) for the creation of hidden files/directories. Correlate the resulting file paths against a threat intelligence list of known malicious filenames and directory paths used by malware for hiding artifacts. Use regular expression matching for known malicious patterns (e.g., specific temp file naming conventions in hidden paths). Alert on any matches."
          },
          "Use of built-in system utilities (e.g., attrib.exe, PowerShell) to programmatically set the 'hidden' attribute on a file or directory.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Event ID 4688) for command lines containing `attrib.exe` with a `+h` argument, or PowerShell commands like `Set-ItemProperty -Path ... -Name IsHidden -Value $true`. Also, monitor file system audit logs (Event ID 4663) for the direct result where the hidden attribute ('0x2') is set. Use frequency analysis to baseline normal usage and flag executions by unusual parent processes (e.g., `WINWORD.EXE`, `OUTLOOK.EXE`) or in sensitive directories (e.g., System32, user profiles)."
          },
          "Creation or modification of a file or directory where the name begins with a '.' (dot), mimicking a Unix-style hidden file on Windows.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect process creation logs (Event ID 4688) and search command line arguments for the creation or manipulation of files/directories whose names start with a dot character (e.g., using regex). Since this is uncommon on Windows, any occurrence is suspicious. Use descriptive statistics to identify processes or users that perform this action and correlate with other suspicious activity."
          },
          "A process executing from a hidden file path or a directory with the hidden attribute initiates an outbound network connection.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation logs (Event ID 4688) with network connection logs (Windows Event ID 5156 and Zeek conn.log). Identify the full image path of all processes initiating network connections. Flag any process whose path is hidden (e.g., contains a `/./` or `\\.\\` component) or has the hidden attribute set (requires cross-referencing with file system state or prior Event ID 4663). Use correlation analysis to link the hiding event with the subsequent network connection from that file path to determine adversary intent."
          },
          "An observed sequence of 'file create -> file hide -> file execute' for the same file path within a short time window.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlated detection rule that triggers on a specific sequence of events for the same file path within a short time window (e.g., 5-10 minutes): 1. A file attribute change to 'hidden' is logged (Windows Event ID 4663); 2. A process execution event is logged where the process image is the newly hidden file (Windows Event ID 4688). The rarity of this complete sequence makes it a high-fidelity indicator of defense evasion. Use correlation analysis based on the 'Object Name' (file path) to link these disparate events."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
