[
  {
    "Is the adversary attempting to evade defenses using VBA stomping? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.007 - VBA Stomping": {
          "Detection of discrepancies between VBA source code and compiled p-code in an MS Office document.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek file.log for Office documents transferred over the network. Monitor Windows Event ID 4688 on endpoints for the creation of Office application processes. Search Windows Event logs or network logs (Zeek) for custom event IDs/signatures generated by security tools indicating VBA source/p-code mismatch detected during file transfer or execution. Correlate file events with detection alerts using common fields."
          },
          "Detection of modifications to the PROJECT stream in an MS Office document designed to hide VBA source code viewing.": {
            "Data": "Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek file.log for Office documents. Monitor Windows Event ID 4688 for Office process launches on endpoints. Search Windows Event logs or network logs (Zeek) for custom event IDs/signatures generated by security tools indicating detection of modified VBA PROJECT streams designed to obscure content. Use correlation analysis to link file activity with detection alerts."
          },
          "Office application processes creating suspicious child processes or loading unusual modules/libraries.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations where the parent process is an Office application (winword.exe, excel.exe, powerpnt.exe). Identify child processes that are typically used for malicious activity (e.g., powershell.exe, cmd.exe, wscript.exe, mshta.exe) and examine command line arguments for suspicious patterns (e.g., encoded commands, external downloads). Additionally, review Windows Event ID 7 logs (Sysmon) for unusual DLL loads by Office processes (e.g., unexpected network or process manipulation libraries). Use frequency analysis or baselining to identify statistically anomalous process creations or library loads."
          },
          "Office application processes initiating suspicious outbound network connections.": {
            "Data": "Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5156 and Zeek conn.log for outbound network connections where the initiating process is an Office application (winword.exe, excel.exe, powerpnt.exe). Filter for connections to unusual destinations (e.g., public IP addresses not associated with legitimate services, dynamic DNS domains, known malicious IPs from threat intelligence feeds). Use baselining (descriptive statistics, frequency analysis) to identify connections that deviate significantly from normal Office application network behavior (e.g., connections on non-standard ports, connections to unusual countries)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]