[
  {
    "Has the adversary gained initial access via spearphishing through third-party services? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.003 - Spearphishing via Service": {
          "Network traffic to/from known social media, webmail, or other suspicious third-party services followed by suspicious activity on endpoints.": {
            "Data": "Zeek conn.log, Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections involving known popular social media, webmail, or messaging service domains/IPs. Identify users/endpoints frequently accessing these services followed by alerts or suspicious activity indicators from endpoint security. Use correlation analysis to link network traffic patterns with endpoint events."
          },
          "Execution of potentially malicious files or processes spawned by applications commonly used for opening documents/files received via messaging services (e.g., Word, PDF reader) with subsequent network connections.": {
            "Data": "Windows Event ID 4688, Windows Event ID 5156, Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs. Look for unusual child processes spawned by applications like winword.exe, excel.exe, acrobat.exe, or web browsers (e.g., powershell.exe, cmd.exe, script interpreters). Correlate these process creations with subsequent network connections in Zeek conn.log (using Windows Event ID 5156 or similar for network connection logs) to identify potentially malicious outbound traffic. Use frequency analysis to identify rare parent-child process combinations or statistically unusual network connections originating from office/reader applications."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]