```json
[
  {
    "Is the adversary attempting to impact system or network availability via disk wiping? (TA0040 - Impact)": {
      "Indicators": {
        "T1561.001 - Disk Content Wipe": {
          "Execution of a process with a file hash matching a known wiper malware sample or creation of files with known malicious names.": {
            "Data": "Windows Event ID 4688; Windows Event ID (Sysmon Event ID 11)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously calculate the hash (e.g., SHA256) of every new process executed (from Process Creation events like Windows Event ID 4688) and correlate against a high-confidence threat intelligence feed of known wiper malware file hashes. Also, monitor for the creation of files (Sysmon Event ID 11) with specific names or in specific directories known to be used by wipers. Alert immediately on any match and initiate incident response protocols."
          },
          "Execution of legitimate system utilities with specific command-line arguments, sequences, or commands on network devices known to be used for disk wiping.": {
            "Data": "Windows Event ID 4688; Network device logs",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for specific command-line patterns indicative of disk wiping, such as `vssadmin.exe delete shadows /all /quiet` followed shortly by the execution of `sdelete.exe -z`, `cipher.exe /w:`, or `format.com`. Use correlation analysis to detect this sequence occurring within a short time window (e.g., 1-5 minutes) on the same host. On network infrastructure, monitor administrative logs for execution of `erase` or `write erase` commands outside of planned maintenance windows. Investigate any system or device that exhibits these command patterns."
          },
          "An unauthorized process attempts to read from or write to raw disk sectors or physical drive objects, bypassing the standard file system.": {
            "Data": "Windows Event ID (Sysmon Event ID 9); Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of legitimate processes (e.g., system, chkdsk.exe, backup software) that perform raw disk access (Sysmon Event ID 9 for RawAccessRead) or request handles to physical drive objects like `\\\\.\\PhysicalDrive*` (Event IDs 4656/4663). Monitor for and alert on any process outside this baseline attempting such access. Use correlation analysis to link these low-level disk access events to preceding suspicious process creation events (Windows Event ID 4688) to provide context."
          },
          "A statistically significant and anomalous spike in file deletion or modification operations, indicating a mass-wiping event.": {
            "Data": "Windows Event ID (Sysmon Event ID 11); Windows Event ID (Sysmon Event ID 23)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation (Sysmon Event ID 11, for overwriting) and file deletion (Sysmon Event ID 23) events. Establish a baseline for normal file I/O rates per host. Use time series analysis or a sliding window count to detect a statistically significant spike in file deletion or modification events. Calculate the entropy of file extensions being modified/deleted; a sudden drop in entropy might indicate indiscriminate wiping of all file types. Alert when the rate exceeds a dynamic threshold (e.g., > 3 standard deviations above the mean) and investigate the responsible process."
          },
          "Rapid and widespread SMB connections targeting administrative shares across numerous hosts, consistent with wiper propagation.": {
            "Data": "Zeek conn.log; Zeek smb_files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs for SMB traffic, specifically connections to administrative shares (e.g., C$, ADMIN$) using `smb_files.log` and `conn.log`. Create a baseline of normal SMB administrative share access patterns. Use descriptive statistics and frequency analysis to detect a sudden, widespread increase in connections or file write operations originating from one or a few hosts and targeting many others. Calculate the rate of new host-to-host SMB connections per minute; a sharp increase is a strong indicator of worm-like propagation used by wipers. Use linear regression to identify an accelerating trend in propagation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```