[
  {
    "Is the adversary evading defenses by using NTFS file attributes? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.004 - NTFS File Attributes": {
          "Execution of utilities or API calls known to interact with NTFS Alternate Data Streams (ADS) or Extended Attributes (EA).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Process Creation logs (Windows Event ID 4688) with command-line logging enabled. Identify processes executing known utilities capable of interacting with ADS/EA (e.g., streams.exe, specific PowerShell commands with '-stream' parameter). Analyze frequency of execution for these utilities across endpoints/servers and flag rare or unusual usage via frequency analysis or outlier detection."
          },
          "Process command-line arguments or file paths containing colon characters, indicative of ADS manipulation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Process Creation logs (Windows Event ID 4688) with command-line logging enabled. Search command-line arguments for the presence of the colon character (':') within file paths using string matching or regex, indicative of potential ADS usage (e.g., 'file.txt:hiddenstream'). Correlate detected occurrences with known suspicious processes, parent processes, or file paths."
          },
          "File access or modification events specifically referencing the Alternate Data Stream syntax (using ':').": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on critical directories/files to log read/write access (Event ID 4663) and handle requests (Event ID 4656). Filter these logs for file paths that explicitly contain the colon character (':'). Investigate occurrences, correlating with the accessing process and user. Use frequency analysis to identify rare file paths or access patterns involving the ADS syntax relative to a baseline."
          },
           "Outbound network connections initiated by processes known or suspected to interact with NTFS attributes, especially when originating from unusual directories.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Process Creation events (Windows Event ID 4688) for processes potentially interacting with NTFS attributes (e.g., command shells, scripting engines, development tools, or processes flagged by other analytics) with outbound network connections (Windows Event ID 5156 or Zeek conn.log) initiated by the same process or PID. Analyze the source executable path from Event ID 4688 and flag connections originating from unusual or temporary directories. Use correlation analysis to find statistically significant associations between the execution of such processes and subsequent network connections within a specific time window."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]