[
    {
        "information_requirement": "Has the adversary moved laterally using SSH Hijacking?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1563.001",
                "name": "SSH Hijacking",
                "evidence": [
                    {
                        "description": "Lateral movement via SSH to or from an internal host previously flagged for suspicious activity or known to be compromised.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain an internal dynamic watchlist of IP addresses and hostnames that have been associated with security alerts or confirmed compromises. Continuously inner join this watchlist with source and destination IPs from SSH connection logs (Zeek conn.log where destination port is 22). Alert on any SSH traffic involving a host on the watchlist and investigate for lateral movement."
                    },
                    {
                        "description": "Execution of the SSH client with specific command-line arguments indicative of connection sharing or multiplexing, such as those used to specify a control socket.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for the execution of ssh.exe or similar SSH clients. Analyze command-line arguments for patterns related to connection multiplexing (e.g., flags such as -M, -S, or arguments like ControlMaster, ControlPath). As these are key enablers for hijacking and uncommon in typical interactive use, use frequency analysis to establish a baseline of normal SSH command-line usage and alert on the rare occurrence of these flags."
                    },
                    {
                        "description": "Anomalous SSH connection patterns, such as a user account establishing multiple concurrent or rapid-fire sessions to different destinations, or connecting to hosts outside their typical access scope.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log (port 22) and Windows Event ID 4624 (for user context) to model user-to-host SSH connection graphs. For each user, establish a baseline of normal destination hosts and connection frequency. Use correlation analysis to identify a single source user establishing rapid, successive SSH connections to multiple distinct destinations ('fan-out' behavior) within a short time window. Use descriptive statistics and percentile analysis to flag users connecting to an anomalously high number of distinct hosts or to hosts they have a very low historical probability of connecting to."
                    },
                    {
                        "description": "Anomalous process activity initiated from a parent process associated with an active SSH session, such as discovery commands, credential dumping tools, or the execution of other lateral movement tools.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate incoming SSH sessions (identified in Zeek conn.log) with process creation events (Windows Event ID 4688) on the destination host by IP and timestamp. Filter for processes spawned by the SSH daemon process (e.g., sshd.exe). Analyze the command lines of these child processes for enumeration commands (e.g., whoami, ipconfig, net user, quser), credential access tools, or execution of remote administration tools (e.g., psexec.exe, wmic.exe). Measure the entropy of commands executed within a single session; a sudden increase in command diversity may indicate interactive exploration by an attacker. Use linear regression to test if the rate of suspicious commands increases after a new SSH connection pattern is observed."
                    },
                    {
                        "description": "An SSH connection originating from an unusual internal source, such as a client workstation connecting to another workstation, or a server initiating an outbound SSH connection where it typically only receives them.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile all internal-to-internal SSH traffic (Zeek conn.log, port 22). Classify internal hosts as SSH clients, servers, or both based on historical connection directionality and volume. Create a baseline of expected SSH traffic flows (e.g., admin workstations to servers). Alert on significant deviations from this baseline, such as servers initiating a high volume of SSH connections (especially to other servers or workstations) or workstation-to-workstation SSH traffic. Use time series analysis to detect sudden changes in a host's SSH behavior (e.g., a host that was purely a server suddenly initiating many outbound SSH connections)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
