[
  {
    "Is the adversary executing commands or programs using launchctl? (TA0002 - Execution)": {
      "Indicators": {
        "T1569.001 - Launchctl": {
          "Recently created or modified launchd plist files (.plist) in standard Launch Agent or Daemon directories.": {
            "Data": "macOS endpoint logs (file system monitoring)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file system events on macOS endpoints for creation or modification of files ending in '.plist' within standard Launch Agent/Daemon directories (/Library/LaunchAgents, /Library/LaunchDaemons, ~/Library/LaunchAgents). Analyze the content or hash of new/modified files for known suspicious patterns or executable paths (e.g., /tmp, /Shared). Use time series analysis to identify bursts of plist file modifications."
          },
          "Execution of the 'launchctl' command followed immediately by anomalous network connections or execution of suspicious binaries.": {
            "Data": "macOS endpoint logs (process execution); Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS process execution logs for command lines containing 'launchctl' followed by 'load', 'start', or 'unload'. Identify the PID of the process executing 'launchctl'. Correlate this PID with network connections captured in Zeek conn.log occurring immediately after the 'launchctl' execution using correlation analysis. Analyze destination IPs and ports for connections to known malicious C2 or unusual destinations. Also correlate with subsequent process execution events originating from the loaded/started service."
          },
          "Execution of 'launchctl load' or 'launchctl start' commands specifying plist files or executables located in temporary or unusual directories.": {
            "Data": "macOS endpoint logs (process execution)",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS process execution logs for command lines containing 'launchctl load' or 'launchctl start'. Parse the command line arguments to identify the path to the plist file or executable being loaded/started. Flag executions where the path points to suspicious directories (e.g., /tmp, /var/tmp, /Shared, hidden directories) or user-writable locations outside of standard Library folders. Use frequency analysis on paths to identify rare or unique loading locations."
          },
          "Outbound network connections originating from a process recently loaded or started via 'launchctl' to unusual or known malicious destinations.": {
            "Data": "macOS endpoint logs (process execution; network connections); Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor macOS process execution logs for 'launchctl' commands ('load', 'start'). Identify the executable path and PID of the service being executed by 'launchd' based on the plist content or 'launchctl' arguments. Monitor macOS network connection logs (or Zeek conn.log filtered by source IP of the endpoint) for outbound connections from this PID or executable path occurring within a short time window (e.g., 60 seconds). Correlate with Threat Intelligence feeds for known malicious IPs/domains using inner joins. Use descriptive statistics on connection volume or bytes transferred to flag anomalous network behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]