[
  {
    "Is the adversary moving laterally through the network using remote service session hijacking? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1563 - Remote Service Session Hijacking": {
          "Remote service sessions established by users on systems they don't normally access or rapid access to multiple systems.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (Logon Type 10 or 3) and Zeek conn.log for remote service connections (e.g., RDP, SSH ports). Establish baseline access patterns per user/group to systems they normally access using frequency analysis or descriptive statistics. Identify users accessing systems outside their normal set or accessing an unusually high number of distinct systems in a short time period (e.g., using correlation analysis between user/system pairs or time series analysis for login volume)."
          },
          "Execution of specific processes or commands associated with session hijacking tools or techniques.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Look for specific commands or process names known to be used in session hijacking (e.g., tscon.exe, rdpclip.exe with unusual parameters) running with unusual parent processes or user contexts. Use pattern matching and potentially entropy measures on command lines to detect obfuscation attempts."
          },
          "Suspicious activity (process creation, network connections) originating from a remote service session (RDP, SSH) immediately following connection or at unusual times for the user.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate remote logons (Event ID 4624 Type 10 or 3) with subsequent process creation (Event ID 4688) or network connections (Event ID 5156, Zeek conn.log) originating from the remote session's source within a short time window (e.g., 5 minutes) or during atypical hours for the user. Analyze command lines (4688) and network destinations (5156, Zeek conn.log) for suspicious patterns (e.g., data staging commands, connections to unusual IPs). Use time series analysis or correlation to identify anomalous activity bursts post-login."
          },
          "Events indicating session state changes (disconnect, connect, lock, unlock) coupled with unusual subsequent activity or logins from different sources.": {
            "Data": "Windows Event ID 4778; Windows Event ID 4779; Windows Event ID 4800; Windows Event ID 4801; Windows Event ID 4624",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs for session state changes (4778-Disconnected, 4779-Reconnected, 4800-Locked, 4801-Unlocked) and remote logons (4624 Type 10). Look for sequences where a session is disconnected/locked and then reconnected/unlocked from a different source IP, or where suspicious activity (Event ID 4688, 5156) occurs immediately after a reconnect/unlock, particularly if the reconnect source IP is unusual. Use correlation analysis to link these state change and activity events by Session ID, User, and timestamp."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]