
[
  {
    "Is the adversary using defense evasion techniques, specifically bind mounts, to hide activity? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1564.013 - Bind Mounts": {
          "Network connections from a host, where bind mount activity was previously detected, to IP addresses or domains known to be associated with command and control (C2).": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon receiving an alert for potential bind mount activity on a Linux host (from pattern or behavioral detections), enrich the host's network activity from Zeek logs. Inner join the destination IP addresses and domains (from Zeek conn.log, dns.log, and Zeek ssl.log's SNI field) against a high-confidence, continuously updated threat intelligence feed. Prioritize investigation of hosts that exhibit bind mount patterns AND communicate with known malicious infrastructure."
          },
          "Direct execution of the 'mount' command using specific bind options ('--bind', '-o bind', or '-B') to overlay a directory, especially targeting sensitive locations like '/proc'.": {
            "Data": "Linux auditd logs; Windows Event ID 4688 (for WSL)",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "On Linux hosts, monitor 'execve' system calls via auditd for command lines containing '/bin/mount' and arguments matching '--bind', '-o bind', or '-B'. On Windows hosts with Windows Subsystem for Linux (WSL), monitor process creation events (Event ID 4688) for similar command line patterns. Create a high-fidelity alert for any usage, and assign critical priority for mounts that target '/proc' or other log directories (e.g., '/var/log'). Use frequency analysis to identify hosts where this command is anomalous."
          },
          "A sequence of events where a user or process creates a bind mount, followed by suspicious network beaconing or data transfer from the same host, suggesting a hidden malicious process is active.": {
            "Data": "Linux auditd logs; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a time-series correlation rule. The rule should trigger when a bind mount command is detected on a host via auditd logs. In the subsequent time window (e.g., 5-60 minutes), analyze the host's network traffic in Zeek conn.log for patterns indicative of C2: regular, timed connections (beaconing), connections to unusual ports, or anomalous data upload volumes. Use time series analysis on connection intervals and data volume to spot the regularity of automated C2 activity and correlate it with the bind mount event."
          },
          "Discrepancy observed between process lists generated by enumerating the '/proc' filesystem versus a lower-level, syscall-based process enumeration method on the same host.": {
            "Data": "EDR sensor data; Custom audit scripts",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "On critical Linux servers, periodically execute a validation script that performs two types of process enumeration. First, list all directories in '/proc' that are named with digits (e.g., by parsing the output of 'ls /proc'). Second, use a tool like 'ps' with options that leverage syscalls or query the kernel directly. Use correlation analysis to compare the two lists. Generate a high-priority alert for any process ID that appears in the syscall-based list but is absent from the '/proc' filesystem enumeration, as this is a strong behavioral indicator of a process hidden via a bind mount."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
