[
  {
    "Is the adversary attempting to hide their activity to evade detection? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1564 - Hide Artifacts": {
          "Creation or modification of files or directories with hidden attributes or within unusual/hidden locations (e.g., Alternate Data Streams, hidden directories).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where command-line arguments indicate file or directory hiding (e.g., 'attrib +h +s', usage of `makecab` or similar for unusual archives). Analyze Windows Event ID 4663 logs for access attempts (especially read/write) to known or suspected hidden file paths or Alternate Data Streams ($DATA suffix). Use frequency analysis to identify rare command line arguments or file access patterns used for hiding."
          },
          "Execution of commands or processes attempting to hide themselves or their artifacts (e.g., execution from hidden paths, using hidden windows, manipulating process attributes).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events with suspicious parent-child relationships (e.g., unexpected parent for cmd/powershell), execution from unusual/hidden directories (paths starting with '.' or in temporary/recycle bin folders), or command-line arguments attempting to obscure execution (e.g., minimized windows, base64 encoded commands). Use correlation analysis to link unusual process execution patterns with subsequent activities."
          },
          "Creation or modification of user accounts or scheduled tasks with names or attributes designed to appear inconspicuous or hidden.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4724; Windows Event ID 4738; Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs related to user account creation/modification (4720, 4724, 4738) and scheduled tasks (4698, 4702). Identify accounts or tasks with obfuscated names (e.g., long strings of random characters, names similar to legitimate system accounts but slightly different, leading/trailing spaces or non-printable characters). Use descriptive statistics or frequency analysis to identify rarely used account names or task names being created or modified, especially if they lack standard descriptions or owners."
          },
          "Network connections originating from processes with hidden attributes, executed from unusual paths, or launched by suspicious scheduled tasks/services.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156; Windows Event ID 4698",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with Windows Event ID 5156 (Network Connection) to identify source processes and ports. Cross-reference process IDs with Windows Event ID 4688 (Process Creation) to check execution path, parent process, and command line for indicators of hiding (e.g., hidden window, unusual path, parent process). Further correlate with Windows Event ID 4698 (Scheduled Task Created/Changed) if the source process is initiated by a scheduled task. Use frequency analysis on source process names and paths initiating external connections; flag rare instances. Use correlation analysis to link suspicious host activity (unusual processes/paths/tasks) with specific network sessions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]