[
  {
    "Is the adversary communicating with C2 infrastructure using DNS calculation? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1568.003 - DNS Calculation": {
          "Network connections to unusual ports immediately following DNS lookups for suspicious or known malicious domains.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries. For each successful DNS response, examine subsequent Zeek conn.log entries from the requesting host. Identify connections to destinations using the resolved IP address but on ports not typically associated with standard services (e.g., high or unusual port numbers). Look for correlations (e.g., using correlation analysis) between specific DNS queries and unusual subsequent connection ports."
          },
          "Repeated DNS queries for the same domain or a series of related domains that exhibit low reputation or are associated with known malicious activity.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for query patterns. Identify domains being queried repeatedly by internal hosts. Cross-reference these domains against threat intelligence feeds. Use descriptive statistics on query frequency per host/domain and identify outliers (high frequency queries for low-reputation domains)."
          },
          "Internal host initiates network connections to the resolved IP address of a DNS query but on a port that is not a standard service port for that IP, shortly after the DNS resolution.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Join Zeek dns.log events (qname, rcode=0, resolved_ips) with Zeek conn.log events (id.orig_h, id.resp_h, id.resp_p, timestamp) where id.orig_h matches dns.log's id.orig_h, id.resp_h is one of the resolved_ips, and the conn.log timestamp is shortly after the dns.log timestamp (e.g., within 60 seconds). Filter for id.resp_p values that fall outside a list of common/standard ports (e.g., not 80, 443, 22, 3389, etc.) or common ephemeral port ranges. Use frequency analysis on connection ports for specific resolved IPs to identify rarely used destination ports."
          },
          "Consistent, low-volume, potentially encrypted traffic patterns over non-standard ports to a resolved IP address following a DNS query from an internal host.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek dns.log with Zeek conn.log for connections on non-standard or unusual ports to resolved IPs. Analyze the traffic volume (orig_bytes, resp_bytes), connection duration, and periodicity (use time series analysis) for these connections. Look for connections that are consistently low-volume and potentially encrypted (correlate with Zeek ssl.log for handshake details if possible, or consider using entropy measures on raw payload if available). Identify resolved destinations receiving multiple such connections over time exhibiting these characteristics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]