
[
  {
    "Is the adversary attempting to evade defenses by modifying system firewalls? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.004 - Disable or Modify System Firewall": {
          "Execution of a process known to be a malicious tool or script that modifies firewall settings, identified by its file hash.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for all process creation events. Extract the file hash (e.g., SHA256) of the executable that is created. Correlate these hashes against a high-confidence cyber threat intelligence (CTI) feed of known malicious file hashes, particularly those associated with malware families known to perform defense evasion by modifying firewalls. Alert on any match and isolate the host for further investigation."
          },
          "Execution of specific command-line arguments or scripts known to disable or create permissive rules in the system firewall using native system utilities.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process command lines. Use regular expressions to detect the execution of firewall modification utilities (e.g., `netsh.exe`, `powershell.exe`) with specific, high-risk arguments such as 'advfirewall set allprofiles state off', 'Set-NetFirewallProfile -Enabled False', or 'New-NetFirewallRule -Action Allow -Direction Inbound'. Correlate executions with the parent process; execution by non-standard parents (e.g., Microsoft Office applications, web browsers) is highly suspicious. Use frequency analysis to identify hosts with an abnormally high rate of firewall modifications."
          },
          "Direct modification of firewall configuration in the Windows Registry or the disabling of the Windows Defender Firewall service itself.": {
            "Data": "Windows Event ID 4657; Windows Event ID 7040; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (A registry value was modified) for any changes to `HKLM\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy`. Additionally, monitor for the Windows Defender Firewall service (`mpssvc`) being stopped (Event ID 7036) or its startup type being changed to 'Disabled' (Event ID 7040). Investigate any modifications that disable the firewall, create broad 'allow' rules, or stop the service, especially if not associated with a known change control process or authorized software installation."
          },
          "A behavioral sequence where a process modifies the system firewall, followed shortly by new inbound or outbound network connections on a previously unused or blocked port.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657; Windows Event ID 7036; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate firewall modification events (from Windows Event IDs 4688, 4657, 7036) on a host with subsequent network connection logs (Zeek conn.log) involving that same host. Establish a baseline of normally used ports for each host. Flag sequences where a firewall modification is followed within a short time window (e.g., 5 minutes) by new network traffic on a port that is statistically rare for that host (e.g., outside the 95th percentile of common ports). Use time series correlation analysis to programmatically link these events and alert on the sequence."
          },
          "An anomalous increase in the variety of listening ports or successful inbound connections on a host, deviating from its established network profile and indicating a potential 'allow all' rule or firewall deactivation.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each server and critical endpoint, create a baseline profile of its typical network behavior from Zeek conn.log, including the number of distinct destination ports it communicates on and the number of distinct external sources that connect to it per hour/day. Monitor for significant deviations from this baseline. Use time series analysis and statistical methods like Z-scores or IQR to detect a sudden and sustained increase in the variety of successful inbound connections. Calculate the entropy of destination ports per host; a sharp increase in entropy can indicate the firewall was opened or disabled, exposing numerous services."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
