[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by disabling logging?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense-Evasion",
        "indicators": [
            {
                "technique_id": "T1562.002",
                "name": "Disable Windows Event Logging",
                "evidence": [
                    {
                        "description": "Execution of known malicious log-clearing utilities identified by file hash or name, or specific command-line arguments unique to a malware family.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor process creation events (Windows Event ID 4688). Correlate the 'ProcessName' or calculated file hash against a cyber threat intelligence (CTI) feed of known log-tampering tools. Use regular expression matching on command-line arguments to find highly specific strings tied to known malware families' log clearing functions. Investigate any matches for further malicious activity."
                    },
                    {
                        "description": "Use of built-in Windows utilities (e.g., auditpol, sc, wevtutil) or direct registry modifications to clear logs, disable event logging services, or reduce audit policy verbosity.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4657",
                            "Windows Event ID 4719",
                            "Windows Event ID 1102",
                            "Windows Event ID 104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for patterns of known log tampering methods: 1) Process creation events (Event ID 4688) with command lines like 'wevtutil cl', 'auditpol /clear', 'sc stop EventLog', or 'sc config EventLog start= disabled'. 2) High-fidelity log clearing events (Event ID 1102 for Security, 104 for System). 3) Audit policy changes (Event ID 4719) that disable critical logging categories. 4) Registry modifications (Event ID 4657) to the 'HKLM\\SYSTEM\\CurrentControlSet\\Services\\EventLog\\Start' value or the creation of the 'MiniNT' key. Correlate these events with other suspicious activity on the host."
                    },
                    {
                        "description": "An unexpected and sustained cessation or significant drop in event log generation from an endpoint, detected by monitoring log flow and volume from a central location.",
                        "data_sources": [
                            "Windows Security Log",
                            "Windows System Log",
                            "Windows Application Log"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "In a central log aggregator, establish a time series baseline for log volume per hour for each critical endpoint. Monitor for hosts where the log flow stops entirely or drops below a statistically significant threshold (e.g., >3 standard deviations below the mean) for a sustained period (e.g., >15 minutes) without a corresponding shutdown event (e.g., Event ID 1074). Use time series analysis to identify anomalous drops, and maintain a dashboard of 'silent hosts' for investigation."
                    },
                    {
                        "description": "A behavioral sequence where a suspicious process is executed, followed immediately by log tampering activity, and then by further malicious commands, indicating an attempt to hide a specific part of an attack chain.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 1102",
                            "Windows Event ID 7035",
                            "Windows Event ID 4719"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlation rule that detects a specific sequence of events on a single host within a short time window (e.g., 5 minutes): [1] Execution of a suspicious or unsigned process (Event ID 4688), followed by [2] a log tampering/clearing event (e.g., Event ID 1102, Event ID 7035 for EventLog service stop, or a command line for 'wevtutil cl'), followed by [3] another suspicious process execution (Event ID 4688). This sequence-based detection focuses on the behavioral TTP of hiding actions, irrespective of the specific tools used."
                    },
                    {
                        "description": "Detection of significant and unexplained gaps in event record IDs within a specific log on an endpoint, suggesting logs were deleted at the source.",
                        "data_sources": [
                            "Windows Security Log",
                            "Windows System Log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "During log ingestion or via a scheduled query, parse the 'RecordNumber' for each event from a given host and log type. Calculate the difference between consecutive record numbers for each host. Flag any host where the gap exceeds a defined threshold (e.g., >100 records missing), excluding known gaps caused by host reboots. Use linear regression or a simple moving average on record numbers to predict the next expected ID and alert when the actual ID deviates significantly, indicating a potential unlogged deletion."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
