[
  {
    "Has the adversary collected data using custom archiving methods? (TA0009 - Collection)": {
      "Indicators": {
        "T1560.003 - Archive via Custom Method": {
          "Unusual process activity involving data manipulation (e.g., reading large volumes of files, unexpected process relationships) preceding potential exfiltration attempts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious process creation patterns. Analyze process relationships (parent-child). Monitor Windows Event ID 4663 for access to sensitive file paths or large volumes of files by unusual processes. Correlate process activity with known collection/archiving tools or scripts. Use descriptive statistics to baseline normal file access volumes per process/user and flag significant deviations using standard deviation or percentile analysis."
          },
          "Outbound network connections with unusual data sizes, timing, or patterns originating from systems involved in suspicious data collection.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for outbound connections originating from potential target systems. Examine connection sizes (orig_bytes, resp_bytes), duration, and frequency. Use time series analysis and statistical profiling (e.g., flow size distribution, inter-arrival times) to identify anomalous network flows that may represent encrypted/compressed data exfiltration compared to baseline."
          },
          "Creation or modification of new files in temporary or unusual locations by processes not typically associated with such actions.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation. Filter Windows Event ID 4663 (Object Access) for 'WriteData', 'AppendData', or 'CreateFile' access rights targeting temporary directories (%TEMP%, /tmp), user profile directories (%USERPROFILE%), or other unusual locations. Correlate file modification/creation events with processes identified in 4688. Use frequency analysis to identify processes creating/modifying a high volume of files or creating files in locations not typically used by that process."
          },
          "Detection of network flows exhibiting characteristics of custom encryption or encoding, such as uniform byte distribution or lack of recognizable protocol headers, especially to unexpected destinations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log flows originating from potential collection systems. While direct byte distribution analysis isn't standard in conn.log, analyze connection patterns such as uniform flow sizes, unusual port usage, or connections to external IPs not in typical communication patterns. Use statistical measures like flow size distribution and correlation analysis with other events (e.g., file modification) to identify anomalous flows potentially containing custom-archived data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]