[
  {
    "Has the adversary manipulated sensitive data or critical system files? (TA0040 - Impact)": {
      "Indicators": {
        "T1565 - Data Manipulation": {
          "Deletion of sensitive documents or critical configuration files.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 and 4656 for file deletion events on sensitive files or critical system paths. Identify events where the 'Accesses' field indicates DELETE (4663) or the Access Mask includes DELETE (4656). Use correlation analysis to link deletion events to preceding suspicious activity (e.g., process creation, network connections). Analyze event frequency using time series analysis to detect spikes in deletion activity."
          },
          "Suspicious modification activity on sensitive data files or system files.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write access (WriteData/AppendData) to sensitive files or system configuration files. Filter for writes originating from unexpected processes or user accounts. Use descriptive statistics and entropy measures on process names/paths associated with file writes to identify rare or unusual activity."
          },
          "Creation or renaming of files in critical system directories or directories containing sensitive data by unusual processes.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (handle requested with create/write) and 4663 (Rename/Write) for operations on critical directories (e.g., system folders, application data directories) or directories known to contain sensitive data. Correlate these events with Windows Event ID 4688 to identify the process initiating the action. Establish baselines of normal file operations in these directories by process and user using frequency analysis and identify statistically rare or never-before-seen process/user combinations performing these actions."
          },
          "Creation of files with suspicious names or in unusual locations related to critical systems or sensitive data.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (handle requested with create) and 4663 (Create/Write) for file creation events. Filter events occurring in locations outside of typical user document paths or program file directories, or within critical directories but with unusual names. Analyze file names for suspicious patterns (e.g., typosquatting on legitimate names, hidden file attributes). Correlate file creation events with the process that created them (Event ID 4688). Use frequency analysis to identify processes, locations, or names that rarely appear in creation events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]