[
  {
    "Has the adversary archived collected data prior to exfiltration? (TA0009 - Collection)": {
      "Indicators": {
        "T1560 - Archive Collected Data": {
          "Execution of common archival/compression utilities or suspicious process activity.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for processes matching known archival utilities (e.g., rar.exe, 7z.exe, zip.exe, tar.exe, gzip.exe) or command-line arguments indicative of compression/encryption ('a', '-m', '-p', '-c'). Identify parent-child process relationships that are unusual (e.g., archival utility spawned by a non-standard process). Use frequency analysis to identify rare process executions or command-line patterns."
          },
          "Creation or modification of files with extensions or headers associated with compressed or encrypted formats in unusual locations or by unusual processes.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 (Object Access) for file write events creating files with extensions like .zip, .rar, .7z, .tar.gz, .aes, .gpg, .enc, .gz, .bz2, .lz. Examine file header signatures if available via logging enrichment. Analyze file size distributions (using descriptive statistics or box plots) for unusually large files being created or modified by non-standard processes in temporary directories or user profile locations."
          },
          "Process loading crypt32.dll in an unusual context or by a suspicious process.": {
            "Data": "Windows Sysmon Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Sysmon Event ID 7 (Image loaded) for processes loading 'crypt32.dll'. Filter for processes that are not typically expected to perform encryption (e.g., common user applications, services). Correlate loading events with parent process activity (Event ID 1) and network connections (Event ID 3 or Windows Event ID 5156) from the same host within a short time frame to identify potential collection/exfiltration activity following encryption. Calculate the frequency of crypt32.dll loading per process name and flag outliers using standard deviation or percentile analysis."
          },
          "Outbound network connections carrying large volumes of data originating from a host where file creation or process activity related to archiving/encryption was detected.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log; Zeek ssl.log; Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek logs (conn.log, http.log, dns.log, ssl.log) showing outbound connections with host events (Windows Event ID 4656/4663 - file access, Windows Event ID 4688 - process creation) indicating file creation, modification, or process execution of archival utilities on the source host within a relevant time window (e.g., 30 minutes prior to connection). Use descriptive statistics (e.g., sum of bytes transferred per connection, per destination IP, or per source host) on Zeek conn.log to identify outbound connections with unusually large data volumes. Use correlation analysis to assess the temporal relationship between host archival events and high-volume outbound network flows."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]