[
  {
    "Is the adversary employing defense evasion techniques involving hidden file systems? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.005 - Hidden File System": {
          "Anomalous or unexpected registry modifications related to file system drivers, boot configurations, or low-level disk access.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to critical registry keys related to file systems (e.g., HKLM\\SYSTEM\\CurrentControlSet\\Services, HKLM\\SYSTEM\\MountedDevices, HKLM\\SYSTEM\\CurrentControlSet\\Control\\FileSystem). Identify modifications originating from unusual processes or users. Use correlation analysis to link suspicious registry changes with other host activity (e.g., process creation, module loads)."
          },
          "Unusual process interaction with raw disk devices, partitions, or attempts to mount non-standard file formats as volumes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes interacting with disk management utilities (e.g., `diskpart`, `mountvol`) or raw disk devices/paths. Monitor Windows Event ID 4656 for suspicious handle requests to physical disk objects or volumes. Identify processes with low frequency of occurrence or unusual command-line parameters interacting with disk resources."
          },
          "Suspicious file I/O patterns or access attempts targeting non-standard file paths or raw disk devices indicative of hidden file system interaction.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 (handle requested) and 4663 (object access) for file paths corresponding to raw disk devices (e.g., `\\.\PhysicalDriveX`, `\\.\C:`) or files in unusual/hidden locations being accessed with suspicious flags (e.g., direct write access, access without standard file system API). Use frequency analysis and outlier detection on the volume and type of file/device access per process to identify anomalous behavior."
          },
          "Modification or unusual access attempts to critical boot sector regions (MBR/VBR) or kernel-level disk drivers.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for write access attempts to raw disk paths associated with boot sectors (e.g., `\\.\PhysicalDriveX` offsets) or critical system files/devices. Monitor Windows Event ID 4657 for modifications to registry keys controlling boot drivers or file system drivers. Correlate these events with process information (Event ID 4688 parent/child) and module loads to identify suspicious processes or unsigned code attempting these modifications."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]