[
  {
    "Is the adversary attempting to impact system availability by wiping disk structures? (TA0040 - Impact)": {
      "Indicators": {
        "T1561.002 - Disk Structure Wipe": {
          "Attempts to access or write to sensitive disk structures (e.g., MBR, partition table) using direct access notation.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access) for read/write attempts targeting disk objects (e.g., PhysicalDrive\\*, bootmgr, bootsect.bak). Configure SACLs to log access to relevant disk paths/objects. Analyze process paths associated with these events to identify suspicious executables or scripts attempting direct disk access."
          },
          "Execution of file system format commands on network devices via CLI.": {
            "Data": "Network Device AAA Logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Network Device AAA logs for command execution events. Filter for commands containing keywords like 'format', 'erase', 'destroy', or 'wipe' targeting file systems or boot structures. Identify the user account, source IP, and device involved. Correlate with successful authentication events and look for unusual patterns or times of execution."
          },
          "Detection of unsigned or newly installed kernel drivers associated with disk access or low-level system manipulation.": {
            "Data": "Windows Event ID 4697; Windows Event ID 5038; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697 (Service Install), 5038 (Code Integrity), and 4688 (Process Creation) for suspicious driver activity. Filter Event ID 5038 for blocked unsigned drivers. Use frequency analysis on service names in Event ID 4697 to identify rare or new services. Correlate with process creation (4688) that might install or modify drivers (e.g., sc.exe, installutil.exe used suspiciously). Investigate driver installations outside of standard patch management or software deployment processes."
          },
          "Sudden anomalous increase in outbound network traffic from an endpoint/server immediately preceding system unavailability.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log (bytes_orig/resp), http.log (resp_body_len), and files.log (total_bytes) for endpoints or servers identified as potential wipe targets or becoming unavailable. Use time series analysis or statistical methods (e.g., Z-score, IQR) on outbound byte counts to detect sudden, significant increases in data transfer volume from specific hosts. Correlate these spikes with host-based system health indicators (e.g., reboots, crashes, high CPU/disk usage if available) or observed outages."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]