[
  {
    "Is the adversary manipulating data at runtime? (TA0040 - Impact)": {
      "Indicators": {
        "T1565.003 - Runtime Data Manipulation": {
          "Suspicious modification or replacement of critical application binaries or files associated with data processing/display.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (Access to object) and 4656 (Handle to Object was requested) for write/modify operations on critical application binaries/data files. Establish baseline file hashes or expected file sizes/timestamps for these critical files. Alert on or investigate deviations (e.g., correlation of file modification events with unexpected hashes or changes outside of patching/maintenance windows)."
          },
          "Unusual process execution interacting with critical data files or application binaries.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for process creation events. Identify processes interacting with known critical data files or binaries (based on command line or parent process). Use descriptive statistics to identify rare process names, unusual command line arguments, or processes running from atypical directories interacting with these critical resources. Apply correlation analysis to link suspicious process activity with file modification events."
          },
          "Unexpected network connections or resource access initiated by processes responsible for displaying or processing critical data.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes responsible for displaying or processing critical data based on Windows Event ID 4688. Monitor Zeek conn.log and Windows Event ID 5156 (Windows Filtering Platform) for network connections initiated by these processes. Establish a baseline of normal network activity for these processes (e.g., specific internal servers, expected external services). Flag connections to unusual external IPs, suspicious ports, or patterns inconsistent with baseline behavior using frequency analysis or correlation analysis."
          },
          "Anomalous read/write activity patterns on critical data files by processes or users, inconsistent with normal business operations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Zeek conn.log",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 and 4656 for read/write operations on critical data files. Group events by process name, user, and target file. Use time series analysis and descriptive statistics (e.g., bytes read/written per unit time) to identify spikes in activity, unusual file access patterns (e.g., sequential reading of large data chunks by an unexpected process), or activity occurring outside normal working hours or patterns. Correlate with Zeek conn.log to identify potential associated data exfiltration events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]