```json
[
  {
    "Has the adversary gained initial access via spearphishing through third-party services? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566.003 - Spearphishing via Service": {
          "Files downloaded or URLs accessed via third-party services matching known malicious indicators such as file hashes, domains, or IP addresses from threat intelligence feeds.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously scan network traffic logs for indicators. Inner join the MD5/SHA hashes of files from Zeek files.log and the domains/IPs from Zeek http.log against high-confidence threat intelligence feeds (updated hourly/daily) for known malicious indicators associated with phishing campaigns. Alert immediately on any matches originating from social media, webmail, or messaging platforms."
          },
          "An office application or document reader spawning a suspicious child process, such as a command shell or scripting engine, shortly after a file is downloaded from a third-party service.": {
            "Data": "Windows Event ID 4688; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file downloads from third-party services (identified in Zeek files.log by source domain) with subsequent process creation events (Windows Event ID 4688) on the destination endpoint within a short time window (e.g., < 2 minutes). Alert on known malicious parent-child process relationships, such as winword.exe, excel.exe, or acrobat.exe spawning cmd.exe, powershell.exe, wscript.exe, or cscript.exe. Use frequency analysis to identify statistically rare parent-child process chains originating post-download."
          },
          "Detection of high-risk file types (e.g., executables, scripts, macro-enabled documents) or files with obfuscated extensions (e.g., double extensions like 'invoice.pdf.exe') being transferred from third-party communication services.": {
            "Data": "Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for file transfers originating from social media, webmail, or messaging service domains. Create high-priority alerts for files with high-risk extensions such as .exe, .dll, .ps1, .vbs, .js, .hta, .lnk, .docm, or .xlsm. Implement regular expression pattern matching on filenames to detect obfuscation techniques like double extensions. Investigate any endpoint that downloads such files from these services."
          },
          "A user downloads a file from a third-party service, followed by the host initiating a new, anomalous external network connection to a low-reputation or previously unseen domain.": {
            "Data": "Zeek files.log; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define a sequence-based rule: 1. A user's host downloads a file from a third-party service (Zeek files.log). 2. Within minutes, the same host IP initiates an outbound connection (Zeek conn.log) to a destination domain that is newly registered (from Zeek dns.log or external feeds), has a low reputation score, or is not on an organizational allowlist. Use correlation analysis to link the file download event with the subsequent suspicious outbound beaconing activity. Flag the sequence for investigation."
          },
          "A statistically significant increase in users across the organization accessing a specific third-party communication service or downloading a particular file type from it, indicating a potential coordinated phishing campaign.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish an organizational baseline of normal access rates (connections per hour) and file download types/volumes from various third-party services (e.g., LinkedIn, Dropbox, Gmail). Use time series analysis (e.g., ARIMA, exponential smoothing) on Zeek http.log and files.log data to monitor for sudden spikes in connections to a specific service or an anomalous increase in a specific file type being downloaded (e.g., a surge in .zip files from a specific social media site). Flag deviations that exceed a statistical threshold (e.g., >3 standard deviations from the mean) for situational awareness of a potential widespread campaign."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```