[
  {
    "Is the adversary using virtualization to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.006 - Run Virtual Instance": {
          "Execution of virtualization binaries or command-line arguments indicative of silent/headless VM creation/running.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (or Sysmon Event ID 1) for creation of processes associated with common virtualization software binaries (VirtualBox, VMWare Player/Workstation, QEMU, Hyper-V executables). Analyze command-line arguments for keywords like '-silent', '-ignore-reboot', 'headless', 'setextradata'. Use frequency analysis or entropy measures on process names/arguments to identify rare or suspicious executions."
          },
          "Creation or modification of Windows Services or Registry entries related to virtualization software, or unusual network adapter configurations/network traffic patterns suggesting a hidden VM.": {
            "Data": "Windows Event ID 4697; Windows Event ID 4657; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4697 for service creation where the service name or binary path relates to virtualization software. Monitor Windows Event ID 4657 for modifications to Registry keys associated with virtualization software configurations or Windows services. Monitor Zeek conn.log for network traffic from unexpected virtual adapter MAC addresses or unusual IP addresses/hostnames that don't map to known assets, potentially using correlation analysis between IP/MAC addresses and known asset inventories."
          },
          "Creation or presence of unusual virtual machine files (.vmx, .vdi, .vmdk, etc.) or executable files associated with non-standard virtualization software on endpoints/servers.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Windows Event ID 5140",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for creation/modification of files with virtualization extensions (.vmx, .vdi, .vmdk, .vhd, .vhdx, etc.) in unusual locations (e.g., outside standard VM directories). Monitor Windows Event ID 4688 for command-line activity indicating creation/copying of these files (e.g., via `copy`, `move`, `xcopy`, `powershell` commands). Maintain a baseline inventory of expected virtualization software and VM files; flag creation/presence of unknown file types or executables. Use descriptive statistics to track VM file sizes and flag unusually small virtual disk files, though this might require additional data sources beyond standard event logs."
          },
          "Detection of network traffic originating from unknown or anomalous MAC addresses/IP addresses/hostnames on the internal network, potentially indicating a virtual network adapter.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4720",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and Windows Event ID 5156 for network connections originating from MAC addresses or IP addresses not present in known asset inventories. Correlate observed hostnames (from DHCP or DNS logs if available) with known asset hostnames. Flag traffic from sources with virtual machine MAC address prefixes (e.g., VMware, VirtualBox OUI ranges) if not expected. Monitor Windows Event ID 4720 for the creation of unusual user accounts associated with virtualization services (e.g., DefaultAccount, VM Management Accounts on Hyper-V hosts). Use correlation analysis to link unknown network sources to potential host systems."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]