[
    {
        "information_requirement": "Is the adversary manipulating data at runtime?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1565.003",
                "name": "Runtime Data Manipulation",
                "evidence": [
                    {
                        "description": "Detection of known malicious files or binaries replacing or co-located with critical application or data processing files.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously scan critical application directories for file hashes matching a CTI feed of known malware associated with data manipulation or ransomware. Correlate file write events (Windows Event ID 4663) in these directories with the hash of the newly written file. When a process (identified via Windows Event ID 4688) writes a file with a known malicious hash, generate a high-severity alert for immediate investigation."
                    },
                    {
                        "description": "Execution of processes or command-line arguments known to be associated with data manipulation, disk wiping, or ransomware tools on critical data systems.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) on servers and endpoints hosting critical data or applications. Maintain and apply a list of regular expressions to match against process names and command-line arguments. This list should include known data wipers (e.g., sdelete.exe), disk manipulation utilities used maliciously (e.g., diskpart with destructive commands), or command-line patterns used by specific ransomware families to encrypt files. Alert on any matches."
                    },
                    {
                        "description": "Evidence of process injection or API hooking targeting legitimate applications that handle or display critical data, suggesting in-memory manipulation.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for process creation events (Windows Event ID 4688) that indicate process injection, such as a non-standard source process creating a remote thread in a critical application process. Correlate the source process and target process. Alert when a non-standard source process (e.g., powershell.exe, an unknown binary) targets a critical application process (e.g., database clients, SCADA HMI software, financial applications). Use frequency analysis to baseline normal inter-process activity and identify rare source/target process pairs."
                    },
                    {
                        "description": "Anomalous modification of critical application binaries or data files, indicated by changes occurring outside of established maintenance windows or initiated by unauthorized user accounts or processes.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable auditing for write/modify operations (Windows Event ID 4663) on directories containing critical application binaries and data files. Establish a baseline of authorized processes (e.g., patch_manager.exe, msiexec.exe) and authorized time windows. Correlate file modification events with the parent process (Windows Event ID 4688) and user account. Use correlation analysis to alert when a critical file is modified by a non-standard process or at an anomalous time. Use descriptive statistics on modification frequency per host to spot unusual spikes."
                    },
                    {
                        "description": "A legitimate process exhibiting anomalous data access patterns, such as reading/writing unusually large volumes of data, accessing data in a non-standard sequence, or interacting with files outside its normal scope.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4656"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile the normal file access behavior of critical applications using Windows Event IDs 4663 and 4656. For each critical process, establish a baseline of files it typically accesses and the typical volume of data read/written per unit of time. Use time series analysis to detect sudden spikes in I/O operations. Use correlation analysis to identify processes accessing an unusually high number of distinct files within a short time frame, which may indicate mass encryption or corruption. Calculate the entropy of file extensions accessed by a process; a sudden increase can indicate indiscriminate data manipulation."
                    },
                    {
                        "description": "A critical data processing application initiating unexpected network connections, potentially to exfiltrate manipulated data or receive malicious commands.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 5156",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify critical applications using Windows Event ID 4688 and their normal network behavior. Monitor network connections from these applications using Windows Event ID 5156 and Zeek conn.log. Establish a baseline of legitimate destination IPs, domains, and ports. Use correlation analysis to flag connections to new or rare external destinations, non-standard ports, or connections to known malicious IPs from CTI feeds. Use linear regression to model expected data transfer volumes and flag significant positive residuals as potential data staging or exfiltration of manipulated data."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
