```json
[
  {
    "Has the adversary gained initial access to the network via phishing? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1566 - Phishing": {
          "Receipt of emails containing known malicious indicators, such as URLs, domains, IP addresses, or file attachment hashes from threat intelligence feeds.": {
            "Data": "Zeek files.log; Zeek smtp.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously ingest high-confidence Cyber Threat Intelligence (CTI) feeds of malicious URLs, domains, IP addresses, and file hashes. Create a process to inner join this CTI data with network logs. Correlate Zeek smtp.log data (sender IP, URLs in body), Zeek http.log data (visited URLs/domains), Zeek conn.log (connections to known malicious IPs), and Zeek files.log (MD5/SHA1 hashes of email attachments) against the CTI feeds. Generate an alert for any match."
          },
          "Emails matching known phishing campaign templates, containing common malicious attachment names or types, or exhibiting specific header manipulation patterns.": {
            "Data": "Zeek smtp.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use regular expressions to scan Zeek smtp.log subjects and bodies for patterns common to known phishing campaigns (e.g., 'Urgent - Invoice Overdue', 'Password Reset Confirmation'). Monitor Zeek files.log for suspicious attachment filenames (e.g., '*.pdf.exe', 'invoice_*.zip', double extensions). Analyze SMTP headers for specific patterns like a mismatch between 'From:' and 'Reply-To:' fields or the presence of unusual 'X-' headers commonly used by phishing kits."
          },
          "Anomalous process execution chain originating from an email client or browser, such as an Office application spawning a shell or scripting interpreter.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for parent-child process relationships. Flag suspicious chains commonly associated with phishing payloads, such as an email client (e.g., outlook.exe) or browser spawning an Office application (e.g., winword.exe), which in turn spawns a command shell (cmd.exe), scripting interpreter (powershell.exe, wscript.exe, cscript.exe), or living-off-the-land binary (mshta.exe, rundll32.exe). Establish a baseline of normal parent-child process relationships and use correlation analysis to identify and alert on rare or known-bad deviations."
          },
          "A user clicks a link in an email followed by network traffic to a newly registered or low-reputation domain and subsequent submission of data via HTTP POST.": {
            "Data": "Zeek smtp.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate email receipt (Zeek smtp.log) with subsequent DNS queries (Zeek dns.log) for domains found in email bodies. Check domain age (via WHOIS data enrichment) and reputation against threat intelligence. If a user browses to a new or suspicious site (Zeek http.log), monitor for an HTTP POST request, especially if the Content-Type is 'application/x-www-form-urlencoded', which may indicate credential submission to a phishing page. Use time series analysis on DNS logs to identify spikes in queries to previously unseen domains across the enterprise."
          },
          "Emails originating from domains with no prior history of communication or those exhibiting anomalous sending patterns compared to established baselines.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal email flow by analyzing historical Zeek smtp.log data to map sender-recipient relationships and typical email volume/frequency. Use descriptive statistics and time series analysis to identify a sudden spike in emails from a new external domain or a sudden change in sending patterns from a previously trusted domain. Calculate the entropy of sender domains on a per-user or per-organization basis; a sudden increase can indicate a targeted phishing wave. Flag emails from domains that impersonate the organization's domain but fail SPF/DKIM/DMARC checks."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```