[
  {
    "Is the adversary evading defenses by spoofing process arguments? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1564.010 - Process Argument Spoofing": {
          "Process creation with command-line arguments followed by suspicious network activity from that process that does not align with the logged arguments.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations, logging command line arguments. Correlate process creations (by Process ID, Parent Process ID) with Zeek conn.log entries originating from the host shortly after process creation. Analyze the correlation between the logged command line arguments (Event ID 4688) and the characteristics of the network connections (Zeek) to identify instances where the network activity is highly unusual or malicious given the benign logged command line. Use correlation analysis to identify statistically significant relationships between process creation events and subsequent network flows."
          },
          "Process network or file activity patterns that significantly deviate from the typical behavior associated with the reported command-line arguments.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 to log process command lines. Monitor process network activity using Zeek conn.log. Establish a baseline of expected network behavior (e.g., destination IPs, ports, volume) for processes based on their command lines using descriptive statistics or time series analysis. Identify processes where the observed network behavior significantly deviates from the established baseline, potentially using inter-quartile range (IQR) or standard deviation analysis."
          },
          "Process created with benign command-line arguments (Event ID 4688) that quickly initiates network connections (Zeek) to known malicious infrastructure.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations, logging command lines. For processes with common or benign command lines, correlate their Process ID and Creation Time with subsequent Zeek conn.log entries (e.g., within 60 seconds). Filter Zeek logs for connections to known C2 IP addresses or domains using threat intelligence feeds. Flag instances where a process with benign initial arguments connects to malicious infrastructure. Use correlation analysis to identify patterns between specific benign command lines and subsequent malicious connections."
          },
          "A process created with benign command-line arguments (Event ID 4688) that initiates outbound network connections (Zeek) to destinations or ports not typically accessed by that specific executable.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations, logging process paths and command lines. For each unique process path and command line combination, build a baseline of typical outbound network destinations (IPs, ports) observed in Zeek conn.log using frequency analysis or descriptive statistics. Flag instances where a process with benign arguments attempts connections outside its established baseline. Use statistical methods like IQR or percentile analysis on destination ports/IPs to identify outliers from the baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]