[
  {
    "Has the adversary executed code via Windows service manipulation? (TA0002 - Execution)": {
      "Indicators": {
        "T1569.002 - Service Execution": {
          "Creation or modification of Windows services using suspicious command-line parameters or non-standard executables.": {
            "Data": "Windows Event ID 4697; Windows Event ID 7045; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4697 and 7045 for new service installations and Event ID 4688 for process creations involving 'sc.exe' or other service control utilities with 'create' or 'config' commands. Analyze command lines and service executable paths for suspicious characteristics (e.g., short, random names, unusual locations, mismatched descriptions). Correlate service creation events with known system administration activities using time series analysis to identify outliers or unexpected patterns."
          },
          "Execution of tools like sc.exe or PsExec with remote service manipulation arguments.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the process image name is 'sc.exe' or 'PsExec.exe'. Parse command-line arguments to identify service manipulation commands ('create', 'config', 'start', 'stop') and target hostnames/IP addresses, especially those targeting remote systems. Monitor Zeek conn.log for connections on ports associated with PsExec (e.g., 445 SMB) originating from suspicious sources or targeting multiple systems; analyze connection frequency and volume using descriptive statistics to spot anomalous activity."
          },
          "Rapid creation and deletion/restoration of Windows services, potentially associated with remote execution (e.g., PsExec).": {
            "Data": "Windows Event ID 7045; Windows Event ID 7036; Windows Event ID 7034; Windows Event ID 4697; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 7045/4697 (creation) and 7036/7034 (state changes/deletion indicators). Identify services created and then stopped, crashed, or rapidly reconfigured/deleted within a short time window (e.g., < 5 minutes). Correlate these events with process creation events (4688) for service control tools like sc.exe or PsExec. Calculate the time duration between service creation and termination/change using timestamps to identify unusually short-lived services compared to historical averages or percentiles."
          },
          "Execution of suspicious processes or scripts by a newly created or modified Windows service.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7045; Windows Event ID 4697; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 7045/4697 for new service creations and Event ID 4688 for process creation. Identify the executable path specified for newly created or modified services. Monitor subsequent process creation events (4688) where the parent process matches the service executable path. Analyze the child process command line and executable path for suspicious indicators (e.g., execution from temporary directories, unusual file extensions, common malware tools). Use frequency analysis to identify services that execute processes not normally associated with them based on established baselines."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]