[
  {
    "Is the adversary attempting to evade defenses by blocking indicators? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1562.006 - Indicator Blocking": {
          "Sudden decrease or cessation of expected host telemetry (e.g., Windows Events, Sysmon logs) from endpoints or servers.": {
            "Data": "Windows Event ID 1101; Windows Event ID 1102; Windows Event ID 1104; Windows Event ID 16; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor volume and rate of Windows Event Logs (Security, System, Application, etc.) and Sysmon logs from all systems. Use time series analysis or moving averages to identify sudden, statistically significant drops in log volume from a specific host or group of hosts compared to their historical baseline. Analyze Windows Event IDs related to log clearing, service state changes, or registry modifications in security-critical keys using descriptive statistics."
          },
          "Host-based firewall rule changes blocking traffic to SIEM/log aggregation systems, or unexpected termination of log forwarding processes.": {
            "Data": "Windows Event ID 2004; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 2004 (Firewall rule changes) and 4688 (Process creation) on endpoints/servers for commands related to firewall modification ('netsh advfirewall') or service/process termination ('sc stop', 'taskkill') targeting security software or log forwarding agents. Analyze Zeek conn.log to identify hosts that have stopped making expected outbound connections to known SIEM or log aggregation IP addresses, potentially using correlation analysis between host status/logs and network traffic patterns."
          },
          "Modifications to Windows Event Log configuration registry keys or ETW provider registry keys.": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 12; Sysmon Event ID 13; Sysmon Event ID 14",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for `reg.exe` or PowerShell commands (`Set-ItemProperty`, `New-ItemProperty`, `Remove-ItemProperty`) targeting critical event log or ETW registry paths (e.g., `*SYSTEM\\CurrentControlSet\\Services\\EventLog\\*`, `*SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\*`). Correlate with Sysmon Event IDs 12/13/14 monitoring modifications to these specific registry paths. Use simple filtering and alerting on matching command lines or registry paths."
          },
          "Modification of security agent configurations or logging that indicate tampering (e.g., Sysmon config change, ETW provider removal).": {
            "Data": "Sysmon Event ID 16; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Alert on Sysmon Event ID 16 (Sysmon configuration change detected). Monitor process creation logs (Windows Event ID 4688) for commands (`sc.exe`, `taskkill.exe`, `wmic`, PowerShell `Stop-Process`, `Stop-Service`) targeting known security agents or logging services (e.g., Sysmon, Splunk Forwarder, specific EDR agents). Use filtering and alerting on these specific event IDs and command line patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]