[
  {
    "Is the adversary attempting to evade defenses by disabling logging? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1562.002 - Disable Windows Event Logging": {
          "Detection of commands or registry modifications used to stop/disable the EventLog service or clear audit policies.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657; Windows Event ID 7035",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command-line arguments containing 'sc stop EventLog', 'sc config eventlog start=disabled', 'Set-Service -Name EventLog -Status Stopped', 'auditpol /clear', 'auditpol /remove', or 'auditpol /set /category...'. Monitor Windows Event ID 4657 (A registry value was modified) for modifications to HKLM\\SYSTEM\\CurrentControlSet\\Services\\EventLog\\Start or HKLM\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\...Start. Monitor Windows Event ID 7035 (Service Control Manager) for EventLog service termination events."
          },
          "Presence of Windows Event IDs indicating log clearing or significant gaps in log sequences.": {
            "Data": "Windows Event ID 1102; Windows Event ID 104",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 1102 (Security log cleared) and Windows Event ID 104 (System log cleared) for log clearing events. Analyze sequential Event Record IDs within Security and System logs over time to identify sudden jumps or significant gaps, indicating potential log deletion or tampering. Use time series analysis to plot log volume over time and identify sudden drops or flatlining."
          },
          "Modification of system audit policies to disable logging for specific categories (e.g., Account Logon, Process Creation).": {
            "Data": "Windows Event ID 4719",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4719 (System audit policy was changed). Parse the event details to identify which audit subcategories have had their auditing (success or failure) disabled. Flag events where auditing is disabled for critical subcategories such as Process Creation (4688), Command Line Process Auditing (4688), Security State Change (4719), Account Logon (4624/4625), or Object Access (4656/4663 for registry/file auditing). Analyze frequency of policy changes; sudden or numerous changes may be suspicious."
          },
          "Creation or modification of the MiniNT registry key to disable Event Viewer functionality.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 (A registry value was modified) for TargetObjectName matching `*\\SYSTEM\\CurrentControlSet\\Control\\MiniNT`. Investigate any creation or modification of this key or its values, as this is highly unusual outside of Windows installation/setup and can indicate attempts to disable the Event Viewer GUI or other logging-related features."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]