[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by hiding malicious processes from the user's view?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1564.003",
                "name": "Hidden Window",
                "evidence": [
                    {
                        "description": "Execution of processes with file hashes known to be associated with malware families that utilize hidden window techniques.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for all process creation events. Extract the file hash (e.g., SHA256) of the executed image file. Correlate these hashes against a high-confidence threat intelligence feed of known malware hashes, specifically flagging those associated with tools or malware families known to use T1564.003 for defense evasion. Update the hash list daily."
                    },
                    {
                        "description": "Process creation events using specific command-line arguments or script interpreters known to hide application windows.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 process creation events and their full command lines. Use regular expression matching to search for known hiding parameters, such as 'powershell.exe -WindowStyle Hidden', 'cscript.exe //B', 'wscript.exe //B', or specific arguments passed to 'rundll32.exe'. Maintain and regularly update a list of these patterns associated with different interpreters and system utilities. Use frequency analysis to identify rare or new command-line arguments used with common system binaries that might indicate novel hiding techniques."
                    },
                    {
                        "description": "A process that typically requires user interaction (e.g., browser, document reader) is observed running without a parent process or under a non-interactive parent (e.g., services.exe), while also initiating network connections.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal parent-child relationships for common interactive applications (e.g., chrome.exe, acrobat.exe, powershell.exe). Monitor Windows Event ID 4688 for instances where these processes are launched with an anomalous parent (e.g., services.exe, svchost.exe) or no parent process. Correlate these 'orphaned' interactive processes with network connection logs (Zeek conn.log) originating from that host around the same time. Use correlation analysis to investigate; for example, a process like 'iexplore.exe' running under 'services.exe' and making external connections is highly suspicious and indicative of hidden execution."
                    },
                    {
                        "description": "Creation of alternate or virtual desktops followed by process execution within that non-interactive desktop, designed to hide activity from the user's view.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for the execution of processes associated with creating new desktops (e.g., via the CreateDesktop API call, which can be monitored via EDR or API monitoring tools). Correlate the creation of a new desktop with subsequent process creation events (Windows Event ID 4688) that specify the newly created desktop in their process parameters. Analyze the process tree to identify parent processes creating hidden desktops and child processes running within them. This behavior is highly anomalous for non-specialized software and warrants immediate investigation."
                    },
                    {
                        "description": "Anomalous network activity originating from explorer.exe processes, especially those not associated with the primary interactive user session.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify all running explorer.exe processes via Windows Event ID 4688. Correlate each process with its logon session ID using information from Event ID 4624. Baseline the normal network behavior of explorer.exe in standard interactive user sessions. Monitor Zeek conn.log for any network connections where explorer.exe is the source process, especially C2-like beaconing (periodic, low-volume connections) or connections to unusual ports or IP geolocations. Prioritize alerts for explorer.exe processes running in non-standard sessions (e.g., Logon Type 10 without a corresponding RDP session) that are making external network connections. Use time series analysis to detect persistent or periodic connections from these anomalous processes."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
