[
  {
    "Has the adversary collected and prepared data for exfiltration using archiving utilities? (TA0009 - Collection)": {
      "Indicators": {
        "T1560.001 - Archive via Utility": {
          "Execution of archiving/compression utilities (e.g., 7z.exe, WinRAR.exe, tar, zip, makecab.exe) with command-line arguments indicating file archiving or compression.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for execution of known archiving utilities (7z.exe, winrar.exe, zip.exe, tar.exe, makecab.exe, diantz.exe, xcopy.exe) and their common command-line arguments for archiving/encoding (e.g., 'a', '-m', '/c', '/d', '-r'). Use correlation analysis to link these process executions to potentially suspicious parent processes or network connections occurring shortly after."
          },
          "Creation of files with compressed or encrypted file extensions (.zip, .rar, .7z, .cab, .tar.gz, etc.) in unusual locations or by unusual processes.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access - File Write) for creation of files with extensions like .zip, .rar, .7z, .cab, .tar.gz, .tar.bz2. Identify the process creating the file and the file path. Calculate entropy of the created files to detect potential encryption or highly compressed data. Flag files created in unusual directories (e.g., user profile directories, temporary folders) or by unexpected processes using frequency analysis of file creation locations per process."
          },
          "Suspicious use of `certutil.exe` for encoding files, or `diantz.exe` for remote data staging and compression.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for `certutil.exe` executions with command-line arguments like `-encode`, `-urlcache -split -f`. Also monitor for `diantz.exe` (or `makecab.exe` with similar staging patterns) usage involving remote paths or unusual output file names/locations. Correlate these process executions with preceding file access events (Windows Event ID 4663) to sensitive directories or subsequent network connections (Zeek conn.log) from the host. Use descriptive statistics to baseline normal usage of these utilities and flag deviations in argument patterns or frequency."
          },
          "Detection of network traffic transferring files with common archive file headers/magic numbers to external destinations.": {
            "Data": "Zeek files.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inspect Zeek files.log for entries where `mime_type` indicates an archive (e.g., `application/zip`, `application/x-rar-compressed`, `application/x-7z-compressed`, `application/gzip`, `application/x-tar`) or where file signatures (magic numbers) match known archive formats. Correlate these file transfer events with Zeek conn.log using the `fuid` (file unique ID) to identify sessions transferring these files to external IP addresses. Calculate frequency, total bytes, and destination prevalence for such transfers. Use anomaly detection techniques (e.g., IQR for transfer sizes, time series analysis for volume, low frequency for destinations) to identify suspicious exfiltration of archived data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]