```json
[
  {
    "Is the adversary evading defenses by modifying cloud compute configurations? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1578.005 - Modify Cloud Compute Configurations": {
          "Execution of cloud management scripts with known malicious file hashes, or network traffic from cloud CLI processes to known malicious C2 infrastructure.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Join Windows Event ID 4688 events that show execution of cloud CLIs ('az', 'aws', 'gcloud') or related scripts with Zeek conn.log based on host IP and timestamp. Correlate destination IP addresses and domains from this traffic against a high-confidence CTI feed of known malicious infrastructure, updated daily. Additionally, if process creation logs include file hashes for the scripts being executed, compare these hashes against a known malware hash database. Alert on any matches."
          },
          "Cloud CLI command-line arguments and execution sequences matching the known syntax or operational flow of specific offensive cloud security tools (e.g., Pacu, PowerZure).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a library of regular expressions and command sequences associated with known cloud attack tools. Scan Windows Event ID 4688 command-line data for these patterns (e.g., Pacu module execution syntax like '--whoami', '--regions', 'iam__enum_users'). Use correlation analysis to detect suspicious sequences, such as a series of reconnaissance commands ('list', 'describe', 'get') followed by a modification or creation command ('set', 'modify', 'put-policy', 'create-instance') from the same user or host within a defined time window (e.g., 15 minutes). Flag command chains that match known TTPs for cloud exploitation."
          },
          "Cloud configuration modifications (e.g., changing quotas, policies, or network security group rules) initiated by a user account or from a host that does not typically perform cloud administration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of which users and hosts normally execute cloud CLI commands by analyzing historical Windows Event ID 4688 data. Profile the types of commands typically run by authorized administrators. Use descriptive statistics and frequency analysis to detect outliers. Alert when a user or host with a low or zero historical frequency of running cloud CLIs executes a modification command (e.g., containing keywords like 'set', 'modify', 'update', 'put-policy', 'authorize-security-group-ingress'). Calculate the entropy of commands per user; a sudden spike for a non-administrative user is highly suspicious."
          },
          "Anomalous network traffic patterns, such as a sudden spike in resource provisioning API calls or unusual data transfer volumes, that are temporally correlated with cloud configuration changes made at unusual times.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate cloud CLI modification events from Windows Event ID 4688 with subsequent network traffic from Zeek conn.log. Use time series analysis on Zeek data (monitoring connection counts and byte volumes in 'orig_bytes' and 'resp_bytes' fields) to detect significant increases in traffic to cloud provider API endpoints (e.g., *.compute.amazonaws.com, management.azure.com) immediately following a configuration change event. Further refine this by analyzing the timestamp of the modification event; changes occurring outside of standard business hours that are followed by resource spikes are highly suspicious. Use linear regression to model and predict expected traffic volumes, flagging significant positive deviations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```