```json
[
  {
    "Is the adversary maintaining persistence using path interception? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "Detection of a known malicious executable (by hash or specific filename) placed in a directory that could intercept a service's unquoted path.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation events (Windows Event ID 4663) and process creation events (Windows Event ID 4688) for files with known malicious hashes or names. Correlate their location with directories that could be exploited via unquoted service paths (e.g., C:\\, C:\\Program Files). Maintain and inner join against a CTI list of hashes and filenames known to be used in this technique."
          },
          "Creation of any executable file in a directory that is part of a known, unquoted service path on the system.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively identify all services with unquoted paths containing spaces via regular scans of the registry (`HKLM\\SYSTEM\\CurrentControlSet\\Services\\*\\ImagePath`). Create a watch list of the vulnerable parent directories (e.g., 'C:\\Program Files\\', 'C:\\Some Folder\\'). Monitor Windows Event ID 4663 for any executable file creation (.exe, .dll, .bat, .ps1) in these specific, high-risk directories. Alert on any such creation for manual review."
          },
          "A file is created in a potential interception path, followed by the corresponding service starting/restarting and executing the malicious file, which then establishes network communications.": {
            "Data": "Windows Event ID 4663; Windows Event ID 7036; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate a sequence of events: 1. A file creation (Event ID 4663) in a vulnerable path (e.g., C:\\Program.exe). 2. A legitimate service stop/start event (Event ID 7036 for the service with the unquoted path C:\\Program Files\\...). 3. A process creation (Event ID 4688) for the unexpected executable (C:\\Program.exe) with NT AUTHORITY\\SYSTEM privileges. 4. Subsequent network connections (Zeek conn.log) from the host. Use time series analysis to correlate these events within a short window (e.g., 1-15 minutes)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Has the adversary escalated privileges using path interception? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "Detection of a known malicious executable (by hash) placed by a low-privileged user into a directory that could intercept a high-privileged service's unquoted path.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation events (Windows Event ID 4663) and compare the new file's hash against a list of known malware. For any match, check the `SubjectUserName` to verify it is a low-privileged user and that the file path (e.g., C:\\Program.exe) could intercept a known service that runs as SYSTEM or Administrator. Alert on this combination of factors."
          },
          "A low-privileged user account writes an executable file to a directory that is part of a pre-identified, unquoted service path for a high-privileged service.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively identify all high-privileged services (running as SYSTEM, etc.) with unquoted paths. Create a specific watch list of the vulnerable directories. Monitor Windows Event ID 4663 for executable file creation in these directories. Flag any write event where the `SubjectUserName` is not a privileged account (e.g., not SYSTEM, Administrator). Use descriptive statistics to establish a baseline of normal user write activity in parent directories like C:\\ to reduce noise."
          },
          "A file is created in a vulnerable path by a low-privileged user, followed shortly by a high-privileged service starting and executing that trojanized file, running it with elevated privileges.": {
            "Data": "Windows Event ID 4663; Windows Event ID 7036; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a detection that correlates three events in sequence: 1. File creation (Event ID 4663) of an executable by a low-privileged user in a vulnerable path. 2. A service start/restart event (Event ID 7036) for a high-privileged service whose path is intercepted. 3. A process creation event (Event ID 4688) for the new executable where the `SubjectLogonId` or user context is now a high-privileged account (e.g., SYSTEM). Use correlation analysis on `ProcessId` and `SubjectUserName` across a defined time window to link the events."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using path interception? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "Detection of a known malicious executable (by hash) placed in a directory designed to intercept the unquoted path of a known security product (e.g., AV, EDR).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation events (Windows Event ID 4663) and compare file hashes against a CTI feed. For any match, correlate the file path with a predefined list of paths that could intercept known security tool services (e.g., C:\\Program.exe if an EDR agent runs from C:\\Program Files\\EDR\\agent.exe). This provides a high-confidence alert that a known malware is attempting to disable a specific defense mechanism."
          },
          "Creation of any executable file in a path that could intercept a known-vulnerable unquoted service path belonging to a security product (e.g., AV, EDR, logging agent).": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively audit and create a definitive list of all security tools and their service `ImagePath` configurations from the registry. Identify any that use unquoted paths. Establish high-priority monitoring on the vulnerable directories for those specific services. Alert on any executable file creation (Windows Event ID 4663) in those paths, as no legitimate software should be placed there."
          },
          "A security or monitoring service stops, crashes, or fails to report telemetry, preceded by a file creation event in a directory that could intercept its unquoted service path.": {
            "Data": "Windows Event ID 4663; Windows Event ID 7036; Windows Event ID 7034",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for security service failures, such as unexpected stop events (Event ID 7036 - 'stopped' state) or crash events (Event ID 7034 - 'terminated unexpectedly'). Correlate these service failure events with any recent file creation events (Event ID 4663) in a path that could intercept that service's legitimate executable. Use time series analysis to flag when a file creation event is followed by a service failure within a short time window (e.g., 5-10 minutes)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```