[
  {
    "Is the adversary maintaining persistence using path interception? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "Creation of executable files (.exe, .dll, etc.) in system directories that are not commonly user-writable (e.g., C:\\, Program Files root) and match partial names of legitimate programs in deeper directories.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation events in system directories (e.g., C:\\, Program Files root). Filter for executable file types (.exe, .dll, .com, .bat, .ps1). Compare file names with legitimate program names expected in deeper subdirectories of potentially unquoted paths. Flag creations by non-standard users or processes. Calculate frequency of file creations in these directories and identify outliers using descriptive statistics."
          },
          "Process execution where the process path corresponds to a partial directory name (e.g., 'C:\\Program.exe' running when the expected path is 'C:\\Program Files\\Application\\Program.exe').": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Extract the full process command line and image path. Identify process paths that are short names residing in higher-level directories (e.g., 'C:\\program.exe' or 'C:\\path\\service.exe' when the original service path is longer and unquoted like 'C:\\path with space\\service.exe'). Correlate with service configuration data (e.g., registry keys for service paths) to identify vulnerable services."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Has the adversary escalated privileges using path interception? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "File creation or modification in system directories by a low-privileged user account, specifically targeting paths known to contain unquoted service paths.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file modification/creation events targeting known directories used by services with unquoted paths. Identify the SubjectUserName from the event. Flag events where a low-privileged user account created or modified an executable file in such a path. Use correlation analysis to link these file events to process executions (Event 4688)."
          },
          "High-privileged process (like a service or a process running as System) executing a file located in a higher-level directory that matches a partial name in a known unquoted path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify processes executing from higher-level directories (as in Evidence 2 for TA0003). Check the SubjectUserName or SubjectDomainId to see if the process was started by a high-privileged account (e.g., SYSTEM, LocalService, Administrator). Correlate with Zeek conn.log for subsequent network connections from the executing process."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses using path interception? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "Creation of executable files named after common Windows commands (e.g., 'net.exe', 'findstr.exe') in directories outside of system paths (System32, SysWOW64).": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 and 4688 for file creation events outside standard system paths (System32, SysWOW64). Filter for file names matching common Windows commands (net.exe, findstr.exe, python.exe, etc.). Flag creation events by non-system accounts or in unusual directories. Use frequency analysis to identify rare occurrences of these files appearing in unexpected locations."
          },
          "Execution of processes where the executable name is a common Windows command, but the process path is from a non-standard system directory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Filter for NewProcessName matching common Windows commands (net.exe, findstr.exe, python.exe, etc.). Check the full CommandLine and NewProcessId path. Flag executions where the path is outside standard system directories. Use correlation analysis to link these executions to preceding file creation events (Event 4663) or subsequent network activity (Zeek conn.log)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]