[
  {
    "Is the adversary maintaining persistence by hijacking execution flow? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574 - Hijack Execution Flow": {
          "Creation, modification, or renaming of executable files or libraries (DLLs) in system or application directories.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 and 4656 for write/modify operations on executable (.exe, .dll) files in system directories (e.g., %SystemRoot%\\System32, %SystemRoot%\\SysWOW64). Filter for unexpected processes performing these actions. Calculate file hashes and compare against known good baselines (if hash available in logs or can be retrieved). Use frequency analysis to identify rare file modifications."
          },
          "Modification of Windows Service configuration, specifically binary paths or failure actions.": {
            "Data": "Windows Event ID 4657, Windows Event ID 7040, Windows Event ID 7045, Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to Service control manager registry keys (e.g., SYSTEM\\CurrentControlSet\\Services\\...). Specifically track changes to 'ImagePath' and 'FailureActions'. Compare new values against historical norms for that service. Flag changes that do not correlate with approved software updates."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary elevating privileges by hijacking execution flow? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574 - Hijack Execution Flow": {
          "Process execution with unusual command lines or network activity originating from unexpected processes.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for newly created processes. Identify processes with unusual parent-child relationships (e.g., svchost.exe spawning cmd.exe). Monitor Zeek conn.log and correlate with process IDs/names from Event ID 4688 to identify processes making network connections that historically did not, using baseline statistics or outlier detection on connection counts/destinations per process."
          },
          "Unusual parent-child process relationships or command-line arguments indicating environment manipulation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs. Extract parent process ID, child process name, and command line arguments. Build a model of common parent-child relationships and command-line argument patterns. Use graph analysis (on parent-child) or clustering (on command lines) to identify unusual or outlier process executions potentially indicative of environment variable manipulation or execution hijacking."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by hijacking execution flow? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574 - Hijack Execution Flow": {
          "Execution of processes or loading of modules from non-standard or temporary directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Extract process names and command lines. Identify processes executing from temporary directories (%TEMP%, \\Windows\\Temp) or non-standard user-writable locations. Filter for system processes (like svchost.exe, explorer.exe) executing from such locations, which is highly anomalous. Use frequency analysis to identify rare execution paths for common processes."
          },
          "Execution of unusual or previously unseen processes as Windows Services.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4697, Windows Event ID 7045",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4697 and 7045 for new service installations. Correlate newly installed services with subsequent process creation events (Event ID 4688 where ParentProcessName is 'services.exe'). Compare the executable path of the new service process against a baseline of known/approved service executables. Flag previously unseen service executable paths as outliers."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]