[
  {
    "Is the adversary maintaining persistence by modifying service binaries? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.010 - Services File Permissions Weakness": {
          "Modification (write/rename/move) of a service executable file outside of scheduled software updates.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for write/modify access attempts targeting known service executable paths. Baseline typical write activity during patch cycles. Alert on writes outside of scheduled maintenance windows or from unexpected processes/users. Use time series analysis on write events for a given service binary path to identify anomalous activity."
          },
          "Service process spawning child processes with atypical command lines or execution paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Identify service processes (e.g., based on parent process or service name metadata). Analyze child process creation events from these service processes. Use correlation analysis to identify child processes with command lines or file paths that deviate significantly from normal service behavior or that match known malicious patterns."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting to elevate privileges by modifying service binaries? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.010 - Services File Permissions Weakness": {
          "Creation or modification of an executable file at a path matching a known service binary path, potentially without associated software installation events.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4656, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663/4656 for write attempts to service executable paths. Correlate these events with software installation logs or expected system updates. Flag write events to service paths that lack corresponding legitimate installation/update activity."
          },
          "Execution of system discovery or other potentially malicious commands originating from a service process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command line arguments and file paths in Windows Event ID 4688 events where the parent process is a service. Identify command lines containing suspicious keywords (e.g., 'whoami', 'net', 'ipconfig', powershell execution targeting discovery) or execution of known malicious binaries/scripts. Use frequency analysis to identify rare command lines executed by service processes."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by modifying service binaries? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.010 - Services File Permissions Weakness": {
          "Hash change detected for a service executable file.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for modifications to service executable files. Trigger an alert upon detection of modification, prompting a manual or automated check of the file hash against a known good baseline."
          },
          "A service process initiating network connections or accessing sensitive resources typically restricted to higher privilege levels.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound network connections originating from processes identified as services. Analyze Windows Event ID 4688 to determine the integrity level/user of service processes initiating connections. Use correlation analysis to link service process activity (e.g., execution of tools) with network connections to potentially sensitive internal systems or external destinations not typical for that service."
          }
        }
      }
    }
  }
]