
[
  {
    "Is the adversary maintaining persistence by modifying service binaries? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.010 - Services File Permissions Weakness": {
          "A service binary is modified, and its new hash matches a known malicious file from a threat intelligence database.": {
            "Data": "Windows Event ID 4663; File Integrity Monitoring (FIM) logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon detecting a write access event (Windows Event ID 4663) or a file modification alert from FIM on a known service executable path, automatically calculate the new file hash. Correlate this hash by inner joining it with a CTI database of known malicious file hashes (updated daily). An immediate, high-priority alert should be generated on any match."
          },
          "A service binary is modified by a process whose name, path, or signature matches known malicious droppers or installers.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate file write events (Windows Event ID 4663) on service binaries with the parent process that performed the write (identified via event data or process creation logs like Windows Event ID 4688). Compare the name, path, and digital signature of the writing process against a maintained list of patterns associated with known malware droppers or hacking tools that employ service hijacking for persistence."
          },
          "A sequence of events is observed: anomalous permission changes on a service file, modification of the file outside a maintenance window, and a subsequent service restart.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4663; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a composite alert by correlating events in a specific sequence within a short time window (e.g., 10 minutes): 1. A permission change granting write access on a service file/directory (Event ID 4670) by a non-standard account. 2. A file write event to that service binary (Event ID 4663). 3. The same service entering a 'running' state (Event ID 7036). Use correlation analysis to link these events by file path and service name. This sequence is a strong behavioral indicator of hijacking for persistence."
          },
          "A service binary is modified by an unauthorized user or process, or outside of an established patch management window.": {
            "Data": "Windows Event ID 4663; FIM logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline normal modification activity for service executables, correlating it with patch management schedules and authorized installer processes. Monitor for file modifications (Windows Event ID 4663, FIM) to service binaries. Use time series analysis on modification events for specific paths to detect activity at anomalous times. Flag any modifications performed by user accounts or processes not on an established allowlist for software installation/updates."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary attempting to elevate privileges by modifying service binaries? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1574.010 - Services File Permissions Weakness": {
          "A service binary running as SYSTEM is replaced with a file whose hash matches a known privilege escalation tool.": {
            "Data": "Windows Event ID 4663; FIM logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify all services configured to run with high privileges (e.g., NT AUTHORITY\\SYSTEM). Monitor their associated binary paths for modification (via FIM or Windows Event ID 4663). Upon modification, compute the file's hash and check it against a CTI database, specifically flagging matches to known privilege escalation tools or implants (e.g., variants of Cobalt Strike beacons, Metasploit payloads)."
          },
          "A high-privilege service process spawns a child process with command-line arguments indicative of creating a new administrative user or altering security groups.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor service start events (Windows Event ID 7036). Correlate these with subsequent child process creations (Windows Event ID 4688) originating from that service process. Scan command-line arguments for patterns matching user creation (`net user /add`), group modification (`net localgroup administrators /add`), or other suspicious commands not typical for the parent service. Use regular expressions to find these patterns and alert on any matches."
          },
          "A user account with standard privileges successfully modifies permissions on a high-privilege service binary and subsequently writes to the file.": {
            "Data": "Windows Event ID 4670; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify services running as SYSTEM and monitor their binary file paths and parent directories for permission changes (Windows Event ID 4670). Alert when permissions are modified by a user or process not running as SYSTEM or a member of Administrators. Correlate this permission change event with a subsequent file write event (Windows Event ID 4663) to the same path by the same low-privilege subject. This sequence is a strong behavioral indicator of a privilege escalation attempt."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses by modifying service binaries? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1574.010 - Services File Permissions Weakness": {
          "A trusted, signed service binary (e.g., security agent, Microsoft binary) is modified, and the new file's digital signature is invalid, missing, or from an untrusted publisher.": {
            "Data": "Windows Event ID 4663; FIM logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of critical, trusted service binaries (e.g., EDR agents, AV services, core Windows services). Upon a file modification event (Windows Event ID 4663, FIM alert) for any binary on this list, trigger an automated check of the file's digital signature. Alert immediately if the signature is missing, invalid, or issued by an untrusted publisher, especially when the original was known to be validly signed."
          },
          "A legitimate service process initiates network connections using protocols or to destinations that are uncharacteristic for that service but match known C2 patterns.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline the normal network behavior of trusted service processes (e.g., svchost.exe, EDR agents). Monitor for anomalous network activity from these processes using Zeek logs correlated with endpoint process data. Flag connections to low-reputation IPs, communication over non-standard ports, or traffic matching C2 patterns (e.g., unusual user-agents in Zeek http.log, JA3/SNI hashes associated with C2 frameworks in Zeek ssl.log). Use correlation analysis to link the process start time with the anomalous network flow."
          },
          "A typically benign service process spawns unexpected child processes, particularly command shells, scripting engines, or known Living-off-the-Land Binaries (LoLBins).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each critical service process, build a baseline of its legitimate and expected child processes. Monitor process creation events (Windows Event ID 4688) and alert when a monitored service process spawns a child process not on its allowlist. Pay special attention to the spawning of `cmd.exe`, `powershell.exe`, `wscript.exe`, `cscript.exe`, or known LoLBins (`bitsadmin.exe`, `certutil.exe`, etc.). Use entropy measures on command-line arguments to detect obfuscation and flag high-entropy commands from service parents."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
