[
  {
    "Is the adversary establishing persistence using dynamic linker hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "Modification of dynamic linker environment variables (e.g., LD_PRELOAD) on critical servers or endpoints.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on critical systems for processes executing commands that modify environment variables like LD_PRELOAD, DYLD_INSERT_LIBRARIES. Flag changes originating from unusual parent processes or user accounts."
          },
          "Unusual network connections or file access patterns observed in legitimate processes that typically do not exhibit such behavior.": {
            "Data": "Zeek conn.log, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile baseline Zeek conn.log and Windows Event ID 4663 (File Access) activity for common system processes. Use statistical methods (e.g., anomaly detection based on connection count, destination IPs, file access frequency/type) to identify deviations from the baseline."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges via dynamic linker hijacking? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "Modification of dynamic linker environment variables (e.g., LD_PRELOAD) by a low-privilege process or user.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for environment variable modifications (LD_PRELOAD, etc.). Identify the user context and parent process. Flag modifications initiated by processes running under standard or low-privilege user accounts on systems where such changes are unexpected."
          },
          "Process exhibiting elevated activity (e.g., creating services, accessing sensitive files) after suspicious linker variable modification.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious commands (e.g., service creation, modifying registry run keys) executed by processes immediately following detected environment variable modification. Analyze Windows Event ID 4663 for access to sensitive system files by processes with recently modified linker variables. Look for correlation between variable changes and subsequent privileged actions."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using dynamic linker hijacking? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "Modification of dynamic linker environment variables (e.g., LD_PRELOAD) associated with security monitoring agents or critical system processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for processes modifying dynamic linker environment variables specifically for known security agents, monitoring tools, or critical system binaries. Investigate any such modifications as potential defense evasion."
          },
          "Execution of commands or scripts designed to modify system environment variables related to dynamic linking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Specifically search Windows Event ID 4688 for commands or scripts using system utilities (set, export, reg.exe, PowerShell equivalents) or custom code to modify environment variables known to influence dynamic linking (LD_PRELOAD, DYLD_INSERT_LIBRARIES, etc.). Flag executions from unexpected sources or locations."
          }
        }
      }
    }
  }
]