[
  {
    "Is the adversary evading defenses by modifying cloud compute configurations? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1578.005 - Modify Cloud Compute Configurations": {
          "Changes to cloud service quotas or resource limits.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for cloud CLI execution (e.g., 'az', 'aws', 'gcloud') on endpoints and servers. Analyze command line arguments for keywords related to resource quotas or limits (e.g., 'quota', 'limit', 'increase', 'set'). Correlate with outbound connections in Zeek conn.log from the same host/user to cloud provider API endpoints. Identify anomalous execution times or users using descriptive statistics."
          },
          "Modifications to cloud tenant policies affecting resource deployment (e.g., allowed regions, VM sizes).": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for cloud CLI execution on endpoints and servers. Analyze command line arguments for keywords related to policies, regional settings, or VM sizes (e.g., 'policy', 'region', 'sku', 'size'). Correlate with outbound connections in Zeek conn.log from the same host/user to cloud provider API endpoints. Identify anomalous commands or users executing these configuration changes."
          },
          "Network traffic patterns indicating attempts to provision significant new cloud resources or unusual data transfer volumes immediately following configuration changes.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for traffic to cloud provider API endpoints (e.g., EC2, S3, Azure Compute, Blob Storage) from internal hosts, especially servers. Use time series analysis to detect sudden increases in connection volume or bytes transferred ('orig_bytes', 'resp_bytes' fields) to provisioning/storage endpoints following cloud configuration modification events. Compare current usage statistics (mean, sum, standard deviation) to historical baselines to flag anomalous resource consumption patterns."
          },
          "Repeated failed attempts to modify cloud compute configurations or quotas from a specific host or user.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for cloud CLI execution (`powershell.exe` or `cmd.exe` launching cloud CLIs) with command line arguments related to quota or policy modification. Correlate with Zeek conn.log for connection attempts to cloud API endpoints. Use descriptive statistics (frequency count) to track failed modification attempts per user, host, and command string based on command output (if logged in 4688) or lack of expected follow-up events. Flag sources with a high frequency of failed modification commands."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]