```json
[
  {
    "Is the adversary establishing persistence using dynamic linker hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "Presence of shared object files (.so) with hashes matching known malicious libraries in paths specified by dynamic linker configurations.": {
            "Data": "File system monitoring logs (e.g., Auditd); On-demand file scans",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously scan file systems, especially standard library paths (`/lib`, `/usr/lib`) and user-writable locations, for shared object files. Correlate the hashes of these files against a CTI feed of known malicious libraries. Monitor file creation events in these paths and perform immediate hash lookups to detect the placement of malicious shared objects used for persistence."
          },
          "Execution of specific shell commands known to modify dynamic linker configuration files like `/etc/ld.so.preload` or add malicious paths to `/etc/ld.so.conf.d/`.": {
            "Data": "Shell command logs (e.g., Auditd execve records); Sysmon for Linux Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events for shell commands (`bash`, `sh`, `zsh`, etc.) with command-line arguments that modify linker configurations. Use regular expression matching to search for patterns such as `echo '...' >> /etc/ld.so.preload`, `ln -s ... /etc/ld.so.conf.d/`, or the execution of scripts that perform these actions. Flag any such commands executed by non-administrative users or originating from unusual parent processes."
          },
          "Modification of dynamic linker environment variables (e.g., LD_PRELOAD, DYLD_INSERT_LIBRARIES) within user-specific startup files to ensure a malicious library is loaded on login.": {
            "Data": "File integrity monitoring logs (e.g., Auditd); Process execution logs (e.g., Auditd execve records)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor user startup files (`~/.bashrc`, `~/.profile`, `~/.zshrc`, etc.) for any modifications that add or alter the `LD_PRELOAD` or `DYLD_INSERT_LIBRARIES` environment variables. Use file integrity monitoring to detect changes. Correlate file write events on these startup scripts with subsequent login events or process executions by the user that set these malicious environment variables for persistence."
          },
          "A legitimate system process (e.g., `cron`, `sshd`, `systemd`) making unusual outbound network connections, potentially due to a hijacked library initiating C2 communication.": {
            "Data": "Zeek conn.log; Process execution logs (e.g., Auditd)",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal network activity for critical system processes on Linux/macOS servers. Correlate process start times (from Auditd) with network connection logs (Zeek conn.log). Use time series analysis and correlation to flag instances where a typically non-networked or locally-communicating process initiates external connections, especially shortly after a system boot or process restart. Investigate the parent process and any recently modified libraries it may have loaded."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary escalating privileges via dynamic linker hijacking? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "A known malicious shared object file (.so) is created in a location that a SUID/SGID binary searches for libraries.": {
            "Data": "File system monitoring logs (e.g., Auditd); File attribute logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify all SUID/SGID binaries on the system and determine their library search paths (e.g., using `ldd`). Monitor these specific paths for file creation events by low-privilege users. Cross-reference the hash of any created `.so` file with a CTI feed of known malicious library hashes. Alert if a known malicious library is placed in a hijackable path for a privileged binary."
          },
          "A low-privilege user sets the `LD_PRELOAD` environment variable immediately before executing a SUID/SGID binary in a misconfigured environment.": {
            "Data": "Shell command logs (e.g., Auditd execve records); Sysmon for Linux Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (e.g., Auditd `execve` syscall records) to find sequences where a user process sets `LD_PRELOAD` (e.g., via `export` or directly on the command line: `LD_PRELOAD=...`) and immediately follows it with the execution of a SUID/SGID binary. While modern linkers often sanitize this variable for SUID binaries, misconfigurations can make this attack possible. Flag any such sequence as a high-confidence privilege escalation attempt."
          },
          "A SUID/SGID binary exhibits anomalous behavior inconsistent with its intended function, such as spawning a shell, modifying system files, or initiating network connections.": {
            "Data": "Process execution logs (e.g., Auditd); Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Baseline the normal behavior of SUID/SGID binaries, including typical child processes and system calls. Monitor for anomalous child processes (e.g., `/bin/sh`, `/bin/bash` spawned from `/usr/bin/passwd`), file modifications in protected locations like `/etc` or `/root`, or any network connections (using Zeek conn.log). Use correlation analysis to link these anomalous actions with the execution of a SUID binary, indicating its library may have been hijacked."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  },
  {
    "Is the adversary evading defenses using dynamic linker hijacking? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "A shared object file with a function name that matches an exported function from a legitimate library used by a security tool (e.g., `open`, `read`, `connect`) is created and has a known malicious hash.": {
            "Data": "File system monitoring logs (e.g., Auditd); On-demand file scans",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify shared libraries used by security agents or logging tools on the system. Maintain a list of known malicious library hashes that are designed to impersonate legitimate system libraries by hooking common functions. Scan the file system and monitor file creation events (Auditd) for any `.so` files that match these malicious hashes, especially if placed in paths that could be hijacked by a security tool to blind it."
          },
          "The `LD_PRELOAD` environment variable is set for a known security agent or system utility process, pointing to a non-standard or user-writable library path.": {
            "Data": "Process execution logs (e.g., Auditd execve records); Sysmon for Linux Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events for executions of known security tools (e.g., `auditd`, `osqueryd`, commercial EDR agent binaries). Inspect the environment variables of these processes at launch time. Alert if `LD_PRELOAD` or `DYLD_INSERT_LIBRARIES` is set and points to a library in a suspicious location like `/tmp`, `/var/tmp`, or a user's home directory. This is a strong pattern indicating an attempt to subvert the tool's functionality."
          },
          "A legitimate process frequently used for system administration or monitoring (e.g., `ps`, `ls`, `netstat`, `lsof`) is executed with `LD_PRELOAD` set, indicating a potential rootkit attempting to hide its artifacts.": {
            "Data": "Process execution logs (e.g., Auditd execve records, shell history)",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events for common system inspection utilities (`ps`, `ls`, `top`, `netstat`, `ss`, `lsof`, etc.). Flag any execution of these utilities where the `LD_PRELOAD` environment variable is set, as this is a classic technique used by rootkits to hook functions (e.g., `readdir`, `write`) to hide malicious files, processes, or network connections from administrators. Investigate the source of the execution and the library being preloaded."
          },
          "A critical application or security tool, after a restart, exhibits a significant and unexplained drop in its logging volume or network traffic.": {
            "Data": "Application logs; Zeek conn.log; Process execution logs (e.g., Auditd)",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for logging volume and network traffic for critical applications and security tools using historical data. Employ time series analysis to monitor for significant, unexplained drops in log output or network connections from these processes. Correlate these behavioral shifts with process restart events (from Auditd) to identify if the change occurred after a restart where hijacking could have been initiated to blind the tool."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```