[
  {
    "Is the adversary establishing persistence by manipulating environment variables? (TA0003 - Persistence)": {
      "Indicators": {
        "Execution of processes named like common system binaries but originating from non-standard directories listed in the PATH.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for process creations. Analyze 'New Process Name' or 'Image' field. Identify processes where the name matches a common system binary (e.g., net.exe, findstr.exe) but the full path is not a standard system directory (e.g., System32, SysWOW64). Compare the observed path against known legitimate system binary paths and identify deviations. Look for execution from user profile directories or temporary folders. Use correlation analysis with parent process information (Event ID 4688 'Parent Process Name') to identify suspicious execution chains."
        },
        "Modification of the system or user PATH environment variable to include suspicious directories.": {
          "Data": "Windows Event ID 4657",
          "Data Platform": "Servers, Endpoints",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4657 for registry value modifications targeting 'HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager\\Environment\\PATH' and 'HKEY_CURRENT_USER\\Environment\\PATH'. Alert on any changes that prepend a new directory to the existing path or add directories not explicitly allowed by policy. Correlate modification events with the process that performed the change (Event ID 4657 'ProcessId')."
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges by manipulating environment variables? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "Execution of system processes (like net.exe, findstr.exe) from a path that is not a standard system directory.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for process creations of known system binaries (e.g., 'net.exe', 'findstr.exe', 'python.exe'). Analyze the 'Image' field. Identify instances where such a process is executed from a path that is not 'C:\\Windows\\System32' or 'C:\\Windows\\SysWOW64'. Flag execution from user-writable directories. Use statistical analysis (frequency) to identify rare execution paths for common binaries, potentially indicating execution of a hijacked binary with system privileges."
        },
        "A privileged process executing a child process whose path indicates PATH hijacking (e.g., child binary from user-writable path).": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688. Identify child processes spawned by privileged processes (e.g., processes running as SYSTEM, Administrators). Analyze the 'Image' path of the child process. Compare the child process path to the potential PATH environment variable contents. Flag instances where the child process path is a user-writable location (like a user profile temp directory) and the binary name matches a system binary name, suggesting the privileged parent process was tricked via PATH hijacking into executing a malicious child."
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by manipulating environment variables? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "Execution of processes named like common system binaries from suspicious directories listed in the PATH.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 for process creations. Identify processes where the 'New Process Name' matches or closely resembles legitimate Windows system binaries ('net.exe', 'findstr.exe', etc.). Analyze the 'Image' path. If the path is a non-standard, user-writable, or otherwise suspicious directory listed in the PATH, alert on this execution as potential defense evasion via PATH hijacking. Use entropy measures on the path string combined with directory path frequency analysis to identify highly unusual execution locations."
        },
        "Process execution resulting from a pathless command (relying on PATH) where the resulting process image path is from a non-standard location.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Endpoints, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688. Filter events where the 'Command Line' field executes a binary name without a full path (e.g., starts with 'net', 'findstr', etc., but not 'C:\\...'). Compare this with the 'Image' path field. If the 'Image' path points to a non-standard or user-writable directory instead of the expected system directory for that binary name, flag this as suspicious PATH hijacking used for defense evasion. Correlate with recent PATH environment variable modifications (Event ID 4657) if available."
        }
      }
    }
  }
]