
[
  {
    "Is the adversary communicating with command and control infrastructure using symmetric cryptography? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1573.001 - Symmetric Cryptography": {
          "Network connections to IP addresses or domains known to be C2 servers for malware families that utilize symmetric cryptography.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log against a high-confidence cyber threat intelligence (CTI) feed of known C2 infrastructure (updated daily). Specifically tag and prioritize matches associated with malware families known to use symmetric key C2 protocols. Alert on any confirmed matches and investigate the source host for further compromise."
          },
          "Execution of a process from an unusual file path or with a name known to be associated with specific malware families that use symmetric key C2.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for executable names or file paths matching known patterns for malware using symmetric C2 (e.g., svchost.exe running from a non-system directory, randomly named executables in %APPDATA% or %TEMP%). Use a maintained list of regular expressions for matching. Correlate positive matches with subsequent outbound network connections from the same host in Zeek conn.log to identify the potential C2 channel."
          },
          "Network traffic on standard or non-standard ports exhibiting high payload entropy combined with mismatched protocol behavior.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify connections on common ports (e.g., 80, 443, 53) and unusual high-numbered ports. For traffic on port 443, use Zeek ssl.log to flag connections that do not complete a valid TLS handshake. For traffic on other ports (like 80), check for the absence of valid protocol markers. On these mismatched connections, calculate payload entropy. Use time series analysis and descriptive statistics (mean, std dev) to establish baseline entropy for various ports and alert on significant positive deviations, which suggest custom encrypted C2."
          },
          "Anomalous data transfer characteristics, such as highly asymmetric data flows or periodic 'heartbeat' communication, indicative of C2 activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for long-lived connections or clusters of short connections. For each host-destination pair, calculate the ratio of originated bytes to responded bytes over time. Use descriptive statistics (e.g., IQR, percentiles) to flag connections with highly asymmetric ratios inconsistent with the port's expected protocol. Additionally, use time series analysis (e.g., Fourier transform or autocorrelation) to detect periodic connections (heartbeats) between an internal host and an external IP, identified by consistent time intervals and similar data volumes per connection."
          },
          "An unusual or newly observed process initiating network connections that exhibit a combination of behavioral indicators of symmetric C2 (e.g., high entropy, anomalous data flow, protocol mismatch).": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 to identify process creations from unusual paths (e.g., Temp, AppData), with unsigned binaries, or with names masquerading as legitimate system processes. Correlate the process start time and host IP with outbound connections in Zeek conn.log. For these specific connections, apply a series of behavioral checks: protocol mismatch (e.g., non-TLS on 443 via Zeek ssl.log), payload entropy, and data flow ratios. Use correlation analysis to build a composite risk score for a process based on the presence of multiple such behavioral indicators in its network traffic."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
