[
  {
    "Is the adversary maintaining persistence by hijacking application search order? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.008 - Path Interception by Search Order Hijacking": {
          "Suspicious file creation (e.g., .exe, .com) with names of common system utilities or partial paths in non-standard directories (especially user-writable).": {
            "Data": "Windows Event ID 4663, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file writes in user-writable directories or application directories. Filter for executable file extensions (.exe, .com) and file names matching common system utilities (net, findstr, cmd, etc.). Use frequency analysis on file paths to identify outliers."
          },
          "Processes executing from unexpected paths that match the names of common system utilities or relative/partial paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify processes where the 'New Process Name' field contains only a file name (no path) or a relative path, especially when launched from application directories. Correlate with the 'Parent Process Name' to identify potentially vulnerable parent applications. Use correlation analysis to find parent-child process pairs with suspicious path interactions."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary escalating privileges by hijacking application search order? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1574.008 - Path Interception by Search Order Hijacking": {
          "Creation of executable files matching system utility names in directories typically requiring elevated write permissions.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file writes in critical system directories (e.g., System32, application install directories) that typically require elevated privileges. Filter for executable files (.exe, .com) with names of system utilities. Flag writes occurring outside of standard patching or installation windows."
          },
          "High-privilege parent processes launching child processes from unusual paths (e.g., parent directory) using system utility names.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Filter for processes launched by high-privilege parents (e.g., SYSTEM, Administrators) where the child process path is not the standard system directory (e.g., c:\\windows\\system32) and the child process name matches a system utility. Look for deviations from established baseline parent-child relationships for high-privilege processes."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by hijacking application search order? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1574.008 - Path Interception by Search Order Hijacking": {
          "Creation of files named identically to Windows system executables in non-system locations.": {
            "Data": "Windows Event ID 4663, Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for creation of files with names exactly matching Windows system utilities (.exe, .com) in non-system directories (user profiles, temporary folders, application paths). Use pattern matching for known system executable names and statistically identify outlier creation locations compared to normal file activity."
          },
          "Legitimate applications launching child processes with names of system utilities from non-standard system directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify instances where common applications launch child processes using names of system utilities and the child process path is not the standard system directory (e.g., c:\\windows\\system32). Build a baseline of normal parent-child process execution paths for common applications and flag deviations using anomaly detection techniques."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]