[
  {
    "Is the adversary establishing persistence using executable installer file permissions weakness? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.005 - Executable Installer File Permissions Weakness": {
          "Modification of executable binaries used by scheduled tasks or services under weak directory/file permissions.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for write operations to executable files in directories with weak permissions (e.g., 'Authenticated Users' write). Correlate write events on scheduled task or service binaries with unexpected source processes. Use frequency analysis to identify unusual modification patterns on critical binaries."
          },
          "Unusual writes or modifications to executable files (e.g., .exe, .dll) within temporary directories during installer execution.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for write operations to executable files (.exe, .dll, etc.) within user %TEMP% directories. Filter for writes occurring concurrently with known installer process activity. Use frequency analysis or time series analysis on write events in %TEMP% to identify anomalous spikes or patterns."
          },
          "Creation, renaming, or movement of executable files into system directories where scheduled tasks or services binaries reside, followed by execution.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688; Windows Event ID 4656; Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Event IDs 4663 and 4656 for writes/handle requests on executable files in system directories (e.g., System32, Program Files). Look for rename/move operations using Event ID 4663 (if auditing is configured for Object Handle). Correlate these events with subsequent process creation (4688) or service installation (4697) involving those file paths. Use correlation analysis to link file modifications to execution events."
          },
          "Execution of suspicious child processes or network connections originating from installer or service host processes that have been potentially hijacked for persistence.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Event ID 4688 for child processes spawned by known installer/service host processes that are running persistently. Analyze command lines for unusual parameters or execution of common adversary tools. Correlate with Zeek conn.log to identify outbound connections from these processes. Use descriptive statistics on process execution counts and network connection volume to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary elevating privileges using executable installer file permissions weakness? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1574.005 - Executable Installer File Permissions Weakness": {
          "Execution of unexpected child processes with elevated privileges spawned by installer or service host processes after potential binary modification.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4696",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation and Windows Event ID 4696 for elevated token assignments. Identify processes spawned by installer or service host processes (e.g., svchost.exe) that are assigned elevated tokens and have unexpected command lines or image paths. Analyze parent-child process relationships to identify abnormal process trees."
          },
          "Installer processes spawning child processes with unusual command lines or network connections not typical for that installer.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation by installer or service host processes. Analyze spawned child processes for unusual command line arguments or executable names. Correlate suspicious child processes with Zeek conn.log to identify unexpected outbound network connections originating from these processes. Use frequency analysis on command lines and network connections to identify rare events."
          },
          "Elevated execution (SYSTEM, Administrator) of binaries located in temporary directories, especially if following installer execution.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4696",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Event ID 4688 for process creation where the Image Path is located within user %TEMP% directories or other temporary locations. Filter for processes assigned elevated tokens (identified via Event ID 4696). Correlate elevated process execution from temp directories with recent installer activity or scheduled tasks running with elevated privileges. Calculate the frequency of elevated execution from temp paths to identify rare occurrences."
          },
          "Service host or installer processes spawning child processes with elevated privileges that deviate from established normal process execution trees.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4696",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline parent-child process relationships for common service host processes (e.g., svchost.exe, services.exe) and standard installers using Event ID 4688. Monitor for deviations where these parent processes spawn children that are assigned elevated tokens (Event ID 4696) and are not part of the normal baseline. Flag unexpected elevated child processes using correlation analysis between 4688 and 4696 and comparing against baseline process trees using frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using executable installer file permissions weakness? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1574.005 - Executable Installer File Permissions Weakness": {
          "Modification of legitimate system or application binaries commonly targeted by installers.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for write operations to common system or application executable paths. Correlate with expected software update events. Identify write events to these critical files that occur outside of scheduled updates or by unexpected processes. Use frequency analysis to identify abnormal file modification events on critical binaries."
          },
          "Installer or service host processes loading or executing unsigned or untrusted executable files from unexpected locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Analyze the image path and command line of processes spawned by installers or service host processes. Filter for executable files that are not signed, located in unusual directories, or have names/paths that do not match the expected behavior of the parent process. Use frequency analysis on image paths/command lines to identify rare occurrences."
          },
          "Comparison of file hashes for critical system/application binaries against a known good baseline, indicating unauthorized modification.": {
            "Data": "Windows Event ID 4663; Endpoint detection agent file integrity monitoring logs",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of cryptographic hashes for critical system and application binaries potentially targeted by installers (e.g., services EXEs, common DLLs). Monitor Event ID 4663 for write operations to these files. Periodically re-compute hashes of these files and compare against the baseline. Flag any discrepancies as potential binary hijacking using correlation analysis between file write events and hash changes."
          },
          "Creation or presence of suspicious executable files (low reputation, unsigned, unusual name) within temporary directories, particularly if followed by execution.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Event IDs 4656/4663 for file creation or write operations involving executable file extensions (.exe, .dll, .bat, .ps1, etc.) within temporary directories (%TEMP%). Correlate these events with process creation (4688) where the image path is one of these newly created/modified files. Analyze the file properties (digital signature, vendor, reputation) and file names for suspicious indicators. Use frequency analysis on file names created in temp directories to identify rare or suspicious names."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]