
[
  {
    "Is the adversary moving tools laterally within the network? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1570 - Lateral Tool Transfer": {
          "Transfer of files with known malicious hashes or names associated with adversary tools across the network.": {
            "Data": "Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for all files transferred via supported protocols (SMB, HTTP, FTP). Compute the hash (MD5, SHA1, SHA256) for each transferred file. Compare these hashes against a high-confidence threat intelligence feed of known malicious tool hashes. Additionally, monitor Windows Event ID 4688 for process creations whose image file hash matches the malicious list. Alert on any matches."
          },
          "Transfer of files with suspicious names (e.g., 'mimikatz.exe', 'ps.exe') or to non-standard or sensitive directories (e.g., C:\\Windows\\Temp, RECYCLER) via network file sharing protocols.": {
            "Data": "Zeek smb.log; Zeek ftp.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek's smb.log and ftp.log, as well as Windows Event ID 4663, for filenames being transferred between internal hosts. Use regular expressions to match against a list of known adversary tool names, commonly misspelled legitimate tool names, or generic suspicious patterns (e.g., random-looking names like 'asdf123.exe'). Also, flag transfers targeting unusual directories like Public user folders, Temp directories, or system directories that users typically do not write to. Use frequency analysis to identify rare file names or destination paths."
          },
          "File transfer activity (e.g., via SMB, WinRM) initiated by an anomalous source process on a host, such as a web server or an Office application.": {
            "Data": "Windows Event ID 4688; Zeek smb.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network file transfer events (Zeek smb.log, or Zeek conn.log for WinRM on ports 5985/5986) with process creation events (Windows Event ID 4688) on the source host. Establish a baseline of normal processes that initiate file transfers (e.g., explorer.exe, cmd.exe in interactive sessions). Use statistical analysis (frequency, percentile) to detect transfers initiated by rare or unexpected parent processes, such as svchost.exe, winword.exe, or w3wp.exe. Alert when a low-frequency source process initiates a lateral file transfer."
          },
          "A single file (identified by hash or name) is transferred to an anomalously large number of hosts within a short time frame, indicating staged deployment of a tool.": {
            "Data": "Zeek files.log; Zeek smb.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "From Zeek files.log or smb.log, extract file hashes and names and the destination host for each transfer. Group transfers by file hash over a rolling time window (e.g., 1 hour). Count the number of unique destination hosts for each file hash. Use descriptive statistics (mean, median, standard deviation) to establish a baseline for how widely files are typically distributed. Use outlier detection methods like Inter-Quartile Range (IQR) or Z-score to flag any file transferred to a statistically significant number of hosts above the baseline."
          },
          "Anomalous network traffic patterns between internal hosts, such as the use of non-standard file transfer protocols or a significant deviation in data volume or frequency from established peer-to-peer baselines.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal peer-to-peer traffic between internal workstations and servers, including typical protocols, ports, and data volume. Monitor Zeek conn.log for deviations. Use time series analysis on the volume of data transferred between host pairs to detect spikes. Use frequency analysis to detect the use of rare protocols or ports for communication between internal hosts (e.g., FTP, SCP, or custom ports) that could be used for tool transfer. Use correlation analysis to check if a spike in traffic from host A to B is followed by suspicious process execution on host B."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
