[
  {
    "Is the adversary maintaining persistence by manipulating service registry entries? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.011 - Services Registry Permissions Weakness": {
          "Registry value `ImagePath` or `binPath` for a service under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` is modified to point to an unusual or unknown executable path.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*\\ImagePath` or `binPath`. Identify the process responsible (from Event ID 4688, correlating by time/user). Compare the new path to known legitimate paths for the service. Flag changes where the new path is not signed, is in a temporary directory, or deviates significantly from historical values. Use frequency analysis on modified services/paths."
          },
          "Unusual creation or modification of `Performance` or `Parameters` subkeys, or addition of `ServiceDll` value under a service's Registry key.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for creation/modification of subkeys like `Performance` or `Parameters` or values like `ServiceDll` under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. Identify the creating/modifying process (from Event ID 4688). Flag any creation of these keys under services that did not previously have them, or modification by non-standard processes. Use historical data to identify services that typically contain these keys."
          },
          "A service is started, and the process launched is observed making persistent or repeated external network connections to unusual destinations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events where `services.exe` is the parent process with Zeek conn.log entries for the resulting process's network connections. Identify processes launched by `services.exe` making external connections, especially those to unusual ports, protocols, or destinations not part of normal system operations. Use time series analysis on connection frequency and duration to detect persistent communication channels. Correlate destination IPs/domains with threat intelligence feeds."
          },
          "Creation of a new service or registry entry for a service that points to an executable in a suspicious location (e.g., user profile, temporary directory, unsusual system folders).": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for new Registry keys created under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\`. Identify the creating process (Event ID 4688 correlation). Flag new services where the `ImagePath` or `binPath` points to user profile directories, temporary folders, or system directories commonly abused by malware. Use frequency analysis to detect rare service names or paths. Use descriptive statistics to identify common legitimate write locations for services and flag deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to escalate privileges by manipulating service registry entries? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.011 - Services Registry Permissions Weakness": {
          "Registry value `FailureCommand` for a service under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` is modified to execute a suspicious command or executable.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*\\FailureCommand`. Identify the modifying process (from Event ID 4688). Analyze the command/path in the `FailureCommand` for suspicious executables or commands, especially if pointing to temporary directories or unknown binaries. Flag any modification of this key where it was previously empty or different."
          },
          "A service configured via Registry manipulation is observed executing a suspicious binary with SYSTEM or elevated privileges.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation with parent process being `services.exe`. Analyze the user/context (e.g., SYSTEM). If registry modifications (Event ID 4657) for a service precede an unexpected process creation with elevated privileges associated with that service's startup, correlate the events. Use correlation analysis between registry changes and subsequent elevated process launches."
          },
          "Registry permissions for a service key under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` are modified to grant excessive write/modify access to non-administrator accounts.": {
            "Data": "Windows Event ID 4670",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4670 for permission changes to Registry keys under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. Analyze the event details to identify which user/group was granted permissions and the type of access (e.g., WRITE_DAC, WRITE_OWNER, SET_VALUE, CREATE_SUB_KEY). Flag modifications that grant write or create permissions to standard users or groups not typically needing administrative control over services. Establish and baseline typical service key permissions and use statistical analysis (e.g., frequency) to identify outliers."
          },
          "A process known to exploit privilege escalation weaknesses modifies service registry entries with elevated privileges.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. Identify the modifying process and its command line (Event ID 4688). Correlate these events with processes executing with elevated privileges (e.g., `runas`, specific `sc.exe` or `reg.exe` commands with unusual parameters, processes elevated via UAC bypass). Flag registry modifications by processes known to be used in privilege escalation attempts or those executing with unexpected elevated privileges when modifying service keys. Use frequency analysis to identify rare processes modifying service keys."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to evade defenses by manipulating service registry entries? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.011 - Services Registry Permissions Weakness": {
          "A service process is initiated using an executable path that is not associated with the legitimate service or known software.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched by `services.exe`. Extract the `NewProcessName` (full path) and `CommandLine`. Compare the process path/command line to known legitimate values for the service. Flag outliers using frequency analysis or comparing against a baseline of allowed service executables."
          },
          "Registry modifications under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` are performed by a process not typically associated with service or system configuration management.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for registry modifications under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. Identify the process that initiated the modification (from Event ID 4688, correlating by time/user). Use frequency analysis and baselining to identify processes that are unusually performing these modifications (e.g., non-system tools, remote access tools, or standard user processes)."
          },
          "Service `ImagePath` or `binPath` is modified to reference a standard Windows utility (e.g., `svchost.exe`, `rundll32.exe`) but with unusual or suspicious command-line arguments that point to a malicious DLL or script.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `ImagePath` or `binPath` under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. If the path points to a standard utility (`svchost.exe`, `rundll32.exe`, etc.), correlate with Windows Event ID 4688 to get the full command line when the service process is created. Analyze command line arguments for suspicious DLL paths (non-system directories), encoded commands, or paths pointing to user-writable locations. Use frequency analysis and baselining of legitimate command lines for services using these standard utilities."
          },
          "Registry entries for security-related services are modified to disable them or change their startup type.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*` keys associated with known security products or critical system services (e.g., Antivirus, Firewall, Auditing). Specifically look for changes to the `Start` value (should be 2 for automatic, 3 for manual, 4 for disabled). Flag any changes that disable or change the startup type of these critical services, especially if modified by non-standard processes (correlated via Event ID 4688). Maintain a list of critical services and their expected `Start` values and use frequency analysis on changes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]