[
  {
    "Is the adversary maintaining persistence using dylib hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.004 - Dylib Hijacking": {
          "Creation or modification of executable files (like dylibs or DLLs) in unexpected system or application directories, followed by network communication from the process or host.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for creation/modification of executable files (.dll or similar) in system/application directories not typical for user-initiated writes. Correlate these events with subsequent outgoing network connections in Zeek conn.log. Use time series analysis to detect anomalies in file modification frequency followed by network spikes from the affected host."
          },
          "A legitimate process initiating unusual network connections or spawning child processes with unexpected command lines, consistent with persistent unauthorized code execution via library hijacking.": {
            "Data": "Windows Event ID 4688, Zeek conn.log, Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for legitimate parent processes (e.g., common applications) spawning unusual child processes or executing commands that access network resources. Correlate with Zeek conn.log and dns.log for connections made by these processes to unusual or malicious destinations. Use correlation analysis between process name (if available via other means and correlated) and network destination/port."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation via dylib hijacking? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.004 - Dylib Hijacking": {
          "A low-privilege process accessing or modifying files or registry keys typically associated with dynamic library loading or execution in protected system areas.": {
            "Data": "Windows Event ID 4656, Windows Event ID 4663, Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for file access or modification, and 4657 for registry modification, specifically targeting paths or keys known to influence dynamic library loading or process execution (e.g., App Paths registry key, system DLL directories), originating from low-privilege user accounts. Use descriptive statistics to identify users/processes accessing these resources infrequently or outside normal patterns."
          },
          "A process running under a standard user account spawning a child process with elevated privileges or accessing resources it shouldn't normally access, following file modification events.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for parent/child process relationships where a standard user process spawns a child process with elevated privileges or flags indicating administrative rights, especially if preceded by file modification events (4656/4663) targeting system locations. Use graphing or correlation to visualize process ancestry and privilege levels."
          }
        }
      }
    }
  },
  {
    "Is the adversary using dylib hijacking for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.004 - Dylib Hijacking": {
          "Network traffic patterns (e.g., C2 communication) originating from processes that typically do not initiate external connections (e.g., standard system utilities, less common applications) and are potentially vulnerable to library hijacking.": {
            "Data": "Zeek conn.log, Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log. Identify network connections (especially to external or uncommon destinations) originating from host IPs where potentially vulnerable processes are known to run. Use entropy calculations on destination domains/IPs or port/protocol combinations to identify potentially algorithmically generated or unusual C2 infrastructure attempting to blend in via hijacked processes."
          },
          "Unexpected process creation or module loading events associated with processes known to be targeted by dylib hijacking, potentially masked by legitimate process names or paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creations or changes in command-line arguments/loaded modules (if available via extended logging or correlation) for processes known to be potentially vulnerable or targeted by dynamic library loading abuses. Establish a baseline of normal process creation arguments and frequency using descriptive statistics and flag outliers or deviations."
          }
        }
      }
    }
  }
]