[
  {
    "Is the adversary creating new cloud instances to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1578.002 - Create Cloud Instance": {
          "Detection of cloud instance creation by unusual or newly created user accounts.": {
            "Data": "AWS CloudTrail RunInstances; Azure Activity Logs Microsoft.Compute/virtualMachines/write; Google Cloud Admin Activity audit logs gcloud compute instances create",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs (CloudTrail, Azure Activity, Google Cloud Audit) for instance creation events (RunInstances, Microsoft.Compute/virtualMachines/write, gcloud compute instances create). Identify the user/principal initiating the event. Compare initiating user/principal against a list of approved users/principals for instance creation. Calculate the frequency of instance creation by specific users over time. Flag creation events initiated by newly created accounts or accounts with no prior history of instance creation using descriptive statistics (e.g., frequency counts per user) or percentile analysis."
          },
          "Cloud instance creation events correlated with preceding or subsequent volume snapshot creation/mounting or data access activities.": {
            "Data": "AWS CloudTrail RunInstances; AWS CloudTrail CreateSnapshot; AWS CloudTrail AttachVolume; Azure Activity Logs Microsoft.Compute/virtualMachines/write; Azure Activity Logs Microsoft.Compute/snapshots/write; Azure Activity Logs Microsoft.Compute/virtualMachines/write/action; Google Cloud Admin Activity audit logs gcloud compute instances create; Google Cloud Admin Activity audit logs gcloud compute snapshots create; Google Cloud Admin Activity audit logs gcloud compute instances attach-disk",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for instance creation events. Correlate instance creation events (e.g., by Instance ID, Volume IDs) with preceding volume snapshot creation events (CreateSnapshot, Microsoft.Compute/snapshots/write, gcloud compute snapshots create) or subsequent volume attachment events (AttachVolume, Microsoft.Compute/virtualMachines/write/action, gcloud compute instances attach-disk). Analyze the timeline between these events using time series analysis or correlation analysis to identify unusual patterns (e.g., snapshot creation immediately followed by instance creation mounting the snapshot)."
          },
          "Creation of cloud instances with configurations (e.g., region, size, image type) unusual for the organization's standard practices.": {
            "Data": "AWS CloudTrail RunInstances; Azure Activity Logs Microsoft.Compute/virtualMachines/write; Google Cloud Admin Activity audit logs gcloud compute instances create",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for instance creation events. Extract instance configuration details (e.g., region, instance type/size, source image AMI/ID). Establish a baseline profile of typical instance configurations created in the environment using descriptive statistics (frequency counts, common values for attributes). Flag instance creations that deviate significantly from the established baseline using frequency analysis or outlier detection methods."
          },
          "Rapid sequence of volume snapshot creation followed by the creation of a new instance mounting that specific volume snapshot.": {
            "Data": "AWS CloudTrail CreateSnapshot; AWS CloudTrail RunInstances; Azure Activity Logs Microsoft.Compute/snapshots/write; Azure Activity Logs Microsoft.Compute/virtualMachines/write; Azure Activity Logs Microsoft.Compute/virtualMachines/write/action; Google Cloud Admin Activity audit logs gcloud compute snapshots create; Google Cloud Admin Activity audit logs gcloud compute instances create; Google Cloud Admin Activity audit logs gcloud compute instances attach-disk",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor cloud audit logs for snapshot creation events and instance creation events. Correlate snapshot creation events with subsequent instance creation events that reference the newly created snapshot ID/ARN for volume attachment. Analyze the time difference between these correlated events. Flag sequences where a snapshot is created and then attached to a new instance within an unusually short time frame (e.g., <15 minutes) using time series analysis or simple time delta calculations, particularly if originating from unusual accounts or IPs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]