
[
  {
    "Is the adversary communicating with Command and Control infrastructure using asymmetric cryptography? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1573.002 - Asymmetric Cryptography": {
          "Outbound encrypted connections to known malicious C2 IP addresses/domains, or involving TLS certificates with known malicious fingerprints (serial numbers, thumbprints) or JA3/JA3S hashes.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously inner join destination IPs from Zeek conn.log and Server Name Indication (SNI) fields from Zeek ssl.log against a high-confidence CTI feed of known malicious C2 infrastructure. Concurrently, compare certificate serial numbers/thumbprints from Zeek x509.log and JA3/JA3S client/server hashes from Zeek ssl.log against lists of specific indicators from known malware campaigns or C2 frameworks. Generate a high-priority alert for any confirmed matches."
          },
          "Encrypted traffic exhibiting common malicious patterns, such as using self-signed certificates, certificates with default/generic subject information, SSL/TLS on non-standard ports, or JA3/JA3S hashes frequently associated with malware families.": {
            "Data": "Zeek ssl.log; Zeek x509.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek x509.log for self-signed certificates or certificates with generic, default, or suspicious subject fields (e.g., CN='localhost', O='ACME'). Analyze Zeek conn.log to identify SSL/TLS traffic (correlated via UID from Zeek ssl.log) on non-standard ports (i.e., not 443, 8443, etc.). Use frequency analysis on JA3/JA3S hashes from Zeek ssl.log to identify hashes that are rare in the environment but are publicly known to be associated with specific malware or C2 frameworks (e.g., Cobalt Strike, Metasploit). Correlate these findings to build a risk score for suspicious connections."
          },
          "Anomalous statistical characteristics in encrypted traffic flows, such as unusual data transfer ratios (e.g., high upload volume), long-lived connections, or periodic 'heartbeat' patterns indicative of C2 communication.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for outbound encrypted connections per host and network segment, focusing on metrics like connection duration, bytes sent vs. received, and traffic periodicity. Use time series analysis to detect regular, low-volume 'beaconing' traffic characterized by consistent time intervals and packet sizes. Apply statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect outliers in session duration or data volume ratios (e.g., upload/download ratio > 1 without clear business reason). Use linear regression to model expected traffic volumes and flag significant deviations from the prediction."
          },
          "A process not typically associated with network communication (e.g., svchost.exe without proper service context, powershell.exe, rundll32.exe) initiating an outbound encrypted connection, especially if the process has a suspicious parent or command line.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network flow data (Zeek conn.log destination IP/port) with Windows Firewall connection logs (Event ID 5156) to identify the Process ID that initiated an outbound encrypted connection. Enrich this with process creation data (Event ID 4688) to obtain the process name, full path, command line, and parent process. Establish a baseline of legitimate processes that make outbound encrypted connections. Flag connections from unexpected processes (e.g., non-browser applications), processes running from unusual file paths (e.g., %TEMP%, C:\\Users\\Public\\), or those with suspicious parent-child relationships (e.g., an Office application spawning PowerShell which then makes a TLS connection)."
          },
          "High entropy observed in network traffic metadata associated with encrypted C2, such as randomly generated subdomains for domain fronting or a high rate of change in destination IPs for a single host.": {
            "Data": "Zeek ssl.log; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze DNS queries (Zeek dns.log) for patterns of algorithmically generated domain names (DGA), characterized by high character entropy, unusual n-gram distribution, and low linguistic sense. Correlate these DNS queries with subsequent outbound SSL/TLS connections to the resolved IPs (Zeek ssl.log). Separately, monitor the diversity of destination IPs (from Zeek conn.log) a single host connects to over encrypted channels; calculate the entropy of destination IPs per host over a rolling time window to identify hosts connecting to an unusually large and diverse set of external endpoints, which can indicate C2 infrastructure rotation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
