[
  {
    "Is the adversary communicating with Command and Control infrastructure using asymmetric cryptography? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1573.002 - Asymmetric Cryptography": {
          "Detection of unusual network traffic patterns (e.g., high outbound data volume from internal endpoints to external IPs, persistent connections to uncommon ports) indicative of C2 using encrypted channels.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify persistent outbound connections, connections to uncommon ports, or connections with unusual data volume ratios (e.g., large client-to-server ratios) to external IP addresses. Use descriptive statistics and box-plots to profile normal network traffic patterns (connection duration, byte ratios, port usage) per host/segment and flag significant outliers."
          },
          "Identification of non-standard or anomalous protocol behavior detected within encrypted network sessions (e.g., SSL/TLS sessions on non-standard ports, unexpected certificate usage, non-HTTP traffic over port 80/443 within an SSL/TLS tunnel).": {
            "Data": "Zeek conn.log, Zeek ssl.log, Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log and Zeek x509.log for connections utilizing SSL/TLS on non-standard ports or using unusual/self-signed certificates. Where SSL/TLS inspection is possible, analyze inner protocol logs (e.g., Zeek http.log for tunneled traffic) to detect non-HTTP traffic over ports 80/443 within encrypted sessions. Use frequency analysis to identify rare certificate issuers or serial numbers and correlation analysis to link anomalous SSL/TLS events with suspicious connection patterns."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]