[
  {
    "Is the adversary establishing persistence using AppDomainManager hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.014 - AppDomainManager": {
          "Unauthorized modification of .config files associated with .NET applications.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes modifying known .config files (e.g., associated with web servers, applications) or creating new config files in suspicious locations. Analyze parent process and command line for anomalies and use time series analysis to identify changes outside of maintenance windows."
          },
          "Creation or modification of system/user environment variables related to .NET runtime settings.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes setting environment variables related to .NET (e.g., COMPLUS_...). Monitor Windows Event ID 4657 for changes to registry keys controlling .NET runtime behavior or assembly loading. Use descriptive statistics to identify accounts or processes exhibiting unusual frequency of such modifications."
          },
          "A legitimate .NET process initiating unexpected network connections or file modifications after potentially loading a malicious assembly.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify baseline network connections (Zeek conn.log, Win Event 5156) and file modifications (Win Event 4663) for critical .NET processes (e.g., IIS w3wp.exe, application services). Flag instances where these processes exhibit network or file activity deviating significantly from baseline patterns using correlation analysis between process IDs and activity logs, and time series analysis on connection frequency/volume."
          },
          "Creation or modification of scheduled tasks or startup items by a legitimate .NET process.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702; Windows Event ID 4657; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4698 (Scheduled Task Creation), 4702 (Scheduled Task Updated), and 4657 (Registry Value Modified for Run/RunOnce keys). Correlate these events with the process ID and parent process (from Event ID 4688 logs if possible). Flag instances where these persistence changes are initiated by legitimate .NET processes that do not typically perform such actions. Use frequency analysis to identify legitimate processes exhibiting unusual persistence-related activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation using AppDomainManager hijacking? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.014 - AppDomainManager": {
          "Process creation with unusual command-line arguments related to .NET assembly loading or unexpected processes spawned by a .NET application process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious command line arguments in .NET process creation events (e.g., csc.exe, vbc.exe, powershell.exe) indicating dynamic assembly loading. Identify processes spawned by legitimate .NET applications that deviate from baseline behavior using correlation analysis between parent and child processes and frequency analysis."
          },
          "A legitimate, high-privilege .NET process exhibiting activity consistent with loading or executing unauthorized code.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of known high-privilege .NET applications (e.g., services, IIS processes). Correlate these process start events with subsequent suspicious child processes (Event ID 4688) or unexpected network connections (Zeek conn.log, Event ID 5156). Use time series analysis and correlation analysis to identify anomalous behavior."
          },
          "A legitimate, high-privilege .NET process accessing protected resources or attempting actions (e.g., creating new user accounts, modifying system files) not part of its normal function.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4720; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs to log access to sensitive files/registry keys (Event ID 4663) by high-privilege processes. Monitor Event ID 4720 for user creation and Event ID 4688 for commands targeting system configuration. Correlate these events with the process ID/name of the originating process. Flag high-privilege .NET processes exhibiting this activity if it deviates from their established baseline behavior using correlation analysis and frequency analysis."
          },
          "Impersonation or privilege assignment activity originating from a legitimate .NET process.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4672; Windows Event ID 4648",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (Logon Type 8, 10), 4672 (Special Privileges), and 4648 (Explicit Credentials) for activity originating from legitimate .NET process IDs. Filter for successful events where a standard .NET process is involved in impersonation or privilege assignment that is outside its normal function. Use correlation analysis to link process IDs to these security events and frequency analysis to spot anomalies in privilege-related actions by unexpected processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using AppDomainManager hijacking? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.014 - AppDomainManager": {
          "A .NET process loading an assembly from an unusual location or with a suspicious name that bypasses standard security checks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688, analyzing command lines for .NET processes attempting to load assemblies from non-standard directories (e.g., temporary folders, user directories not typical for executables). Use frequency analysis to identify rare source paths for loaded assemblies and correlation analysis with parent processes."
          },
          "Changes to system configuration (registry, files) that alter how .NET applications load assemblies, potentially enabling code execution in a hidden manner.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to .NET-related registry keys or configuration files. Correlate these changes with subsequent unusual process creation (Event ID 4688), unexpected network activity (Zeek conn.log), or file modifications by the affected .NET processes using correlation and time series analysis."
          },
          "Unexpected network connections to suspicious or unclassified external destinations originating from a legitimate .NET process.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and Windows Event ID 5156 for outbound network connections originating from legitimate .NET process IDs (e.g., w3wp.exe, svchost.exe hosting .NET services). Compare destination IPs/domains against known good lists, threat intelligence feeds, and internal resource ranges. Flag connections to suspicious destinations or those not part of the process's normal communication patterns. Use correlation analysis between process ID and connection events, and frequency/time series analysis to identify unusual communication volume or timing."
          },
          "A legitimate .NET process attempting to interact with or modify security software processes or configurations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for legitimate .NET processes spawning suspicious child processes that target security tools (e.g., `taskkill`, `sc stop`). Monitor Event IDs 4657 (Registry modifications) and potentially 4663 (Object access with SACLs) for legitimate .NET processes attempting to modify registry keys or files belonging to security software. Flag instances that deviate from normal behavior using correlation analysis between the .NET process ID and the target process/key/file, and frequency analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]