[
  {
    "Is the adversary maintaining persistence using dylib hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.004 - Dylib Hijacking": {
          "Creation or modification of executable files (like dylibs or DLLs) in unexpected system or application directories, followed by network communication from the process or host.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for creation/modification of executable files (.dll or similar) in system/application directories not typical for user-initiated writes. Correlate these events with subsequent outgoing network connections in Zeek conn.log. Use time series analysis to detect anomalies in file modification frequency followed by network spikes from the affected host."
          },
          "A legitimate process initiating unusual network connections or spawning child processes with unexpected command lines, consistent with persistent unauthorized code execution via library hijacking.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for legitimate parent processes (e.g., common applications) spawning unusual child processes or executing commands that access network resources. Correlate with Zeek conn.log and dns.log for connections made by these processes to unusual or malicious destinations. Use correlation analysis between process name (if available via other means and correlated) and network destination/port."
          },
          "Access or modification of standard dynamic library files by unexpected processes or user accounts, or the creation of files with typical dynamic library extensions in non-standard locations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (Access) and 4656 (Handle Operation) for read/write/delete operations on files with `.dll` or `.dylib` extensions in known system or application library paths (e.g., System32, Program Files directories) by processes or users not typically associated with system updates or software installations. Also monitor Windows Event ID 4688 for creation of processes that immediately access or load libraries from non-standard locations. Use descriptive statistics to baseline normal file access patterns for libraries and flag deviations."
          },
          "Outbound network connections to suspicious or unbaselined destinations originating from processes known to be targeted by library hijacking, occurring shortly after the process starts.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log and dns.log. Identify connections originating from hosts where processes known to be potential targets for library hijacking have recently started. Filter network connections by process start time (if available or inferred) and identify destinations that are not part of established communication baselines. Use frequency analysis and correlation analysis between process names (if possible) and destination IPs/domains/ports to identify unusual patterns characteristic of C2."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting privilege escalation via dylib hijacking? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.004 - Dylib Hijacking": {
          "A low-privilege process accessing or modifying files or registry keys typically associated with dynamic library loading or execution in protected system areas.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for file access or modification, and 4657 for registry modification, specifically targeting paths or keys known to influence dynamic library loading or process execution (e.g., App Paths registry key, system DLL directories), originating from low-privilege user accounts. Use descriptive statistics to identify users/processes accessing these resources infrequently or outside normal patterns."
          },
          "A process running under a standard user account spawning a child process with elevated privileges or accessing resources it shouldn't normally access, following file modification events.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for parent/child process relationships where a standard user process spawns a child process with elevated privileges or flags indicating administrative rights, especially if preceded by file modification events (4656/4663) targeting system locations. Use graphing or correlation to visualize process ancestry and privilege levels."
          },
          "Unauthorized modification of registry keys controlling dynamic library search order or 'App Paths' by processes running with insufficient privileges.": {
            "Data": "Windows Event ID 4657; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4657 (Registry Value Set) and 4663 (Registry Object Access) for modifications or access attempts on registry keys known to influence dynamic library loading search order, such as `HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Svchost` or keys under `HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths`. Filter these events for source processes or user accounts that typically lack administrative privileges. Flag any successful modifications and investigate the process/user involved."
          },
          "Creation or modification of dynamic library files in user-writable directories immediately followed by a high-privilege process starting on the same host.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656/4663 for creation/modification of `.dll` or `.dylib` files in user-writable directories (e.g., C:\\Users\\*\\AppData\\Local\\Temp). Correlate these file events with subsequent Windows Event ID 4688 events on the same host where a new process starts running with elevated privileges (e.g., System, Administrator SID if available). Calculate the time difference between the file event and process start; investigate processes starting shortly after file creation/modification in these locations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using dylib hijacking for defense evasion? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.004 - Dylib Hijacking": {
          "Network traffic patterns (e.g., C2 communication) originating from processes that typically do not initiate external connections (e.g., standard system utilities, less common applications) and are potentially vulnerable to library hijacking.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log. Identify network connections (especially to external or uncommon destinations) originating from host IPs where potentially vulnerable processes are known to run. Use entropy calculations on destination domains/IPs or port/protocol combinations to identify potentially algorithmically generated or unusual C2 infrastructure attempting to blend in via hijacked processes."
          },
          "Unexpected process creation or module loading events associated with processes known to be targeted by dylib hijacking, potentially masked by legitimate process names or paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new process creations or changes in command-line arguments/loaded modules (if available via extended logging or correlation) for processes known to be potentially vulnerable or targeted by dynamic library loading abuses. Establish a baseline of normal process creation arguments and frequency using descriptive statistics and flag outliers or deviations."
          },
          "Execution of processes associated with known vulnerable applications that exhibit unusual network behavior or load unexpected modules.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of applications known to be vulnerable to dylib hijacking (e.g., via vulnerability scans or public reports). Monitor Windows Event ID 4688 for the execution of processes corresponding to these applications. Correlate their activity with Zeek conn.log and dns.log. Flag network connections from these processes that are unusual based on historical patterns or destination analysis. Use correlation analysis to link vulnerable process starts with unusual network activity."
          },
          "Access attempts by legitimate processes to files with unusual extensions or names located within standard dynamic library search directories.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4663 (Access) and 4656 (Handle Operation) for read attempts by known legitimate processes (potential hijacking targets) on files located in standard library search directories (e.g., C:\\Windows\\System32, application installation directories) that do NOT have standard executable/library extensions like `.exe`, `.dll`, `.sys`. Investigate instances where a legitimate process attempts to open/read a file with an unexpected extension in a library path using process name and file path correlation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]