[
  {
    "Is the adversary maintaining persistence using COR_PROFILER? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.012 - COR_PROFILER": {
          "Creation or modification of COR_ENABLE_PROFILING, COR_PROFILER, or COR_PROFILER_PATH Registry keys.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Environment\\*COR_PROFILER* or HKEY_CURRENT_USER\\Environment\\*COR_PROFILER*. Identify processes making these changes (from Event 4688 via CorrelationId). Analyze the frequency of these changes across the environment and flag rare or unauthorized modifications using frequency analysis or anomaly detection."
          },
          "Process creation with COR_PROFILER or COR_PROFILER_PATH environment variables set.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for new processes. Extract command-line arguments and environment variables from the event data. Filter for processes where COR_PROFILER or COR_PROFILER_PATH environment variables are explicitly set. Correlate these events with subsequent process behavior (e.g., network connections from Zeek logs, new processes spawned from Event 4688) and flag unusual patterns using correlation analysis."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges using COR_PROFILER? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.012 - COR_PROFILER": {
          "Creation or modification of COR_PROFILER Registry keys by processes executing with high privileges.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to COR_PROFILER registry keys. Correlate these events with the integrity level or user context (e.g., SYSTEM, Administrator) of the process recorded in Windows Event ID 4688 (using CorrelationId). Prioritize investigation of changes made by processes running at higher integrity levels that are not part of standard OS updates or software installations."
          },
          "Process creation of a high-privilege .NET process with COR_PROFILER or COR_PROFILER_PATH environment variables set.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes started with high integrity levels (e.g., IntegrityLevel='System', 'High'). Check if COR_PROFILER or COR_PROFILER_PATH environment variables are present in the process creation event data. Flag high-integrity processes launched with these environment variables unless correlated with known legitimate software installers or updates."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using COR_PROFILER? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.012 - COR_PROFILER": {
          "Creation or modification of COR_PROFILER Registry keys targeting specific security software processes/paths.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for changes to COR_PROFILER registry keys. Examine the new value data (e.g., DLL path, CLSID) and correlate with process names (from Event 4688) targeting known security software paths or executable names. Flag changes that attempt to inject a profiler into security processes."
          },
          "Process creation of a security software .NET process with COR_PROFILER or COR_PROFILER_PATH environment variables set.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes whose executable path or name matches known security software (e.g., 'MsMpEng.exe', 'SophosEDR.exe'). Check if COR_PROFILER or COR_PROFILER_PATH environment variables are present in the process creation event data for these security processes. Flag security processes started with these profiling environment variables."
          }
        }
      }
    }
  }
]