[
  {
    "Is the adversary maintaining persistence using path interception? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "Creation of executable files (.exe, .dll, etc.) in system directories that are not commonly user-writable (e.g., C:\\, Program Files root) and match partial names of legitimate programs in deeper directories.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation events in system directories (e.g., C:\\, Program Files root). Filter for executable file types (.exe, .dll, .com, .bat, .ps1). Compare file names with legitimate program names expected in deeper subdirectories of potentially unquoted paths. Flag creations by non-standard users or processes. Calculate frequency of file creations in these directories and identify outliers using descriptive statistics."
          },
          "Process execution where the process path corresponds to a partial directory name (e.g., 'C:\\Program.exe' running when the expected path is 'C:\\Program Files\\Application\\Program.exe').": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Extract the full process command line and image path. Identify process paths that are short names residing in higher-level directories (e.g., 'C:\\program.exe' or 'C:\\path\\service.exe' when the original service path is longer and unquoted like 'C:\\path with space\\service.exe'). Correlate with service configuration data (e.g., registry keys for service paths) to identify vulnerable services."
          },
          "Modification of Windows Registry keys that specify service executable paths, particularly changing unquoted paths or referencing newly created executables in higher-level directories.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to Registry keys under `HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services`. Filter for ValueName `ImagePath`. Analyze the `NewValue` for unquoted paths containing spaces or paths referencing executables in unexpected locations (e.g., root of drive, user profile directories). Correlate with file creation events (Event ID 4663) and process creation events (Event ID 4688) involving the `NewValue` path."
          },
          "Network connections initiated by a process executing from a path corresponding to a potential path interception vulnerability.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process execution events (Windows Event ID 4688) where the `NewProcessName` path matches a potential path interception vulnerability (short path in high-level directory) with subsequent network connection events (Windows Event ID 5156 or Zeek conn.log). Analyze destination IPs/ports and frequency of connections. Flag connections to external, suspicious, or C2-like destinations. Use correlation analysis to identify patterns between specific hijacked processes and network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Has the adversary escalated privileges using path interception? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "File creation or modification in system directories by a low-privileged user account, specifically targeting paths known to contain unquoted service paths.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file modification/creation events targeting known directories used by services with unquoted paths. Identify the SubjectUserName from the event. Flag events where a low-privileged user account created or modified an executable file in such a path. Use correlation analysis to link these file events to process executions (Event 4688)."
          },
          "High-privileged process (like a service or a process running as System) executing a file located in a higher-level directory that matches a partial name in a known unquoted path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Identify processes executing from higher-level directories (as in Evidence 2 for TA0003). Check the SubjectUserName or SubjectDomainId to see if the process was started by a high-privileged account (e.g., SYSTEM, LocalService, Administrator). Correlate with Zeek conn.log for subsequent network connections from the executing process."
          },
          "File creation or modification in a service's unquoted path directory by a low-privileged user account shortly before the corresponding service starts or restarts.": {
            "Data": "Windows Event ID 4663; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file creation/modification in directories vulnerable to unquoted path interception (e.g., root directories, 'Program Files'). Identify the `SubjectUserName`. Correlate with Windows Event ID 7036 indicating service stop/start events for services known to use unquoted paths traversing the modified directory. Flag instances where a low-priv user modifies a file in a vulnerable path shortly before a high-priv service starts/restarts, especially if the file name matches the potential interception."
          },
          "High-privileged process running from a path corresponding to a potential path interception vulnerability performing actions typically requiring elevated privileges (e.g., modifying system files, accessing protected resources, creating new services).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for high-privileged processes (System, Administrator, etc.) executing from paths vulnerable to unquoted path interception. Analyze subsequent events by this process ID (using `NewProcessId`) such as file modifications (Event ID 4663) to sensitive system locations (e.g., System32), registry modifications (Event ID 4657) to critical keys (e.g., Run keys, Service configuration), or creation of new services. Use correlation analysis to link the suspicious process execution to these high-privilege actions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using path interception? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.009 - Path Interception by Unquoted Path": {
          "Creation of executable files named after common Windows commands (e.g., 'net.exe', 'findstr.exe') in directories outside of system paths (System32, SysWOW64).": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 and 4688 for file creation events outside standard system paths (System32, SysWOW64). Filter for file names matching common Windows commands (net.exe, findstr.exe, python.exe, etc.). Flag creation events by non-system accounts or in unusual directories. Use frequency analysis to identify rare occurrences of these files appearing in unexpected locations."
          },
          "Execution of processes where the executable name is a common Windows command, but the process path is from a non-standard system directory.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Filter for NewProcessName matching common Windows commands (net.exe, findstr.exe, python.exe, etc.). Check the full CommandLine and NewProcessId path. Flag executions where the path is outside standard system directories. Use correlation analysis to link these executions to preceding file creation events (Event 4663) or subsequent network activity (Zeek conn.log)."
          },
          "Creation of executable files named after common Windows commands in non-system directories by a process with a suspicious or non-standard parent process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the `NewProcessName` is a common Windows command (net.exe, findstr.exe, etc.) but the `Image` path is outside standard system directories. Analyze the `ParentProcessName` and `ParentCommandLine`. Flag executions where the parent process is suspicious (e.g., originating from a temporary directory, script interpreter, or an uncommon legitimate program) or if the command line arguments are unusual for that command. Build a baseline of normal parent processes for common commands using frequency analysis."
          },
          "Network connections initiated by processes running from non-standard paths with names that masquerade as common Windows commands or services.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes whose `NewProcessName` matches common Windows commands or service names but whose `Image` path is outside standard system directories. Correlate these processes with Zeek conn.log to identify subsequent network connections. Analyze connection destinations and patterns. Flag connections to external IPs, unusual ports, or destinations not typical for the legitimate version of the masqueraded process. Use correlation analysis to link suspicious processes to network activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]