[
  {
    "Is the adversary communicating with Command and Control infrastructure using asymmetric cryptography? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1573.002 - Asymmetric Cryptography": {
          "Detection of unusual network traffic patterns (e.g., high outbound data volume from internal endpoints to external IPs, persistent connections to uncommon ports) indicative of C2 using encrypted channels.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify persistent outbound connections, connections to uncommon ports, or connections with unusual data volume ratios (e.g., large client-to-server ratios) to external IP addresses. Use descriptive statistics and box-plots to profile normal network traffic patterns (connection duration, byte ratios, port usage) per host/segment and flag significant outliers."
          },
          "Identification of non-standard or anomalous protocol behavior detected within encrypted network sessions (e.g., SSL/TLS sessions on non-standard ports, unexpected certificate usage, non-HTTP traffic over port 80/443 within an SSL/TLS tunnel).": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log and Zeek x509.log for connections utilizing SSL/TLS on non-standard ports or using unusual/self-signed certificates. Where SSL/TLS inspection is possible, analyze inner protocol logs (e.g., Zeek http.log for tunneled traffic) to detect non-HTTP traffic over ports 80/443 within encrypted sessions. Use frequency analysis to identify rare certificate issuers or serial numbers and correlation analysis to link anomalous SSL/TLS events with suspicious connection patterns."
          },
          "Identification of processes initiating outbound encrypted connections (SSL/TLS) that are not typically associated with network communication or have not been seen previously establishing such connections from a host.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and ssl.log entries showing outbound SSL/TLS connections with Windows Event ID 5156 on the source endpoint to identify the process ID. Use Windows Event ID 4688 to get details (process name, path, command line) for the identified process ID. Maintain a baseline of processes typically making outbound SSL/TLS connections per host/user using frequency analysis. Flag connections initiated by processes not in the baseline or those with unusual command lines. Analyze process parent-child relationships from Event 4688 for suspicious execution chains."
          },
          "Detection of encrypted network sessions (SSL/TLS) utilizing certificates with suspicious properties (e.g., missing common fields like Organization/Country, short validity periods, specific serial numbers/issuers associated with known malware) or lacking standard validation paths.": {
            "Data": "Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek x509.log for details of certificates presented during SSL/TLS sessions (captured via Zeek ssl.log). Filter for certificates missing standard X.509 fields (e.g., O, C, L, ST), having unusually short validity periods (<90 days), or specific serial numbers or issuers known from threat intelligence feeds. Check if certificates are self-signed or fail standard validation paths. Use frequency analysis to identify rare certificate properties (e.g., issuer, subject common name) or correlation analysis to link suspicious certificates with anomalous connection patterns (duration, byte counts)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]