[
  {
    "Is the adversary communicating with command and control infrastructure using non-standard ports? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1571 - Non-Standard Port": {
          "Network traffic showing protocol/port mismatches (e.g., HTTPS over port 8088, RDP over non-standard port).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek dce_rpc.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and protocol-specific logs (e.g., http.log, ssl.log, dce_rpc.log) to identify connections where the detected protocol does not match the standard port. Use entropy analysis on packet payloads or header information for sessions on non-standard ports to flag potential protocol mismatches. Compare protocol identification results across Zeek logs (e.g., conn log service field vs. protocol logs) to find discrepancies."
          },
          "Unusual network data flow patterns (e.g., significant data upload from client to server, unexpected network connections from processes).": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify sessions with highly asymmetric byte counts (e.g., client sending significantly more data than receiving), especially on non-standard ports. Identify the process associated with the connection by correlating connection times and destination IPs/ports with process creation logs (Windows Event ID 4688) and network connection logs (Windows Event ID 5156). Flag processes initiating network connections over non-standard ports or with unusual data flows, particularly if the process is unexpected or rare (e.g., using frequency analysis or outlier detection on process name/path)."
          },
          "Processes communicating on non-standard ports where such communication is not typical for that process or host.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) logs to identify processes initiating external network connections. Correlate these events with Zeek conn.log data showing the destination port used by the process. Establish a baseline of common processes and their expected destination ports using frequency analysis per host or group. Flag connections made by processes on ports that are non-standard for that process or host, especially for processes with low frequency of network communication or those never seen making external connections before."
          },
          "Zeek protocol analysis flags or errors indicating unexpected behavior on common C2-associated ports (e.g., TLS/SSL errors, unusual data within expected protocol sessions).": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek http.log; Zeek x509.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for connections on any port showing SSL/TLS errors, self-signed certificates, or unexpected certificate details (correlating with x509.log), especially when communicating with external IPs. Examine Zeek http.log for unusual HTTP methods, user agents, request sizes, or patterns on non-standard ports, or non-HTTP traffic on standard web ports. Monitor Zeek weird.log for connections on any port flagged as 'weird' or exhibiting protocol anomalies. Correlate findings with Zeek conn.log to identify associated sessions and byte counts. Use frequency analysis and outlier detection to identify rare or never-before-seen certificate details (x509.log) or HTTP patterns on unexpected ports."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]