[
  {
    "Is the adversary establishing persistence using AppDomainManager hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.014 - AppDomainManager": {
          "Unauthorized modification of .config files associated with .NET applications.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes modifying known .config files (e.g., associated with web servers, applications) or creating new config files in suspicious locations. Analyze parent process and command line for anomalies and use time series analysis to identify changes outside of maintenance windows."
          },
          "Creation or modification of system/user environment variables related to .NET runtime settings.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4657",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes setting environment variables related to .NET (e.g., COMPLUS_...). Monitor Windows Event ID 4657 for changes to registry keys controlling .NET runtime behavior or assembly loading. Use descriptive statistics to identify accounts or processes exhibiting unusual frequency of such modifications."
          }
        }
      }
    }
  },
  {
    "Is the adversary attempting privilege escalation using AppDomainManager hijacking? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.014 - AppDomainManager": {
          "Process creation with unusual command-line arguments related to .NET assembly loading or unexpected processes spawned by a .NET application process.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious command line arguments in .NET process creation events (e.g., csc.exe, vbc.exe, powershell.exe) indicating dynamic assembly loading. Identify processes spawned by legitimate .NET applications that deviate from baseline behavior using correlation analysis between parent and child processes."
          },
          "A legitimate, high-privilege .NET process exhibiting activity consistent with loading or executing unauthorized code.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of known high-privilege .NET applications (e.g., services, IIS processes). Correlate these process start events with subsequent suspicious child processes or unexpected network connections (Zeek conn.log) using time series analysis and correlation analysis."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses using AppDomainManager hijacking? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.014 - AppDomainManager": {
          "A .NET process loading an assembly from an unusual location or with a suspicious name that bypasses standard security checks.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688, analyzing command lines for .NET processes attempting to load assemblies from non-standard directories (e.g., temporary folders, user directories not typical for executables). Use frequency analysis to identify rare source paths for loaded assemblies."
          },
          "Changes to system configuration (registry, files) that alter how .NET applications load assemblies, potentially enabling code execution in a hidden manner.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to .NET-related registry keys. Correlate these changes with subsequent unusual process creation (Event ID 4688) or unexpected network activity (Zeek conn.log) originating from .NET processes using correlation and time series analysis."
          }
        }
      }
    }
  }
]