[
  {
    "Is the adversary moving tools laterally within the network? (TA0008 - Lateral Movement)": {
      "Indicators": {
        "T1570 - Lateral Tool Transfer": {
          "Unusual file creation or transfer activity detected via standard protocols like SMB/CIFS or FTP between internal hosts.": {
            "Data": "Zeek smb.log; Zeek ftp.log; Windows Event ID 5140; Windows Event ID 5145; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smb.log, ftp.log, and Windows Event IDs (5140, 5145, 4663) for file access/transfer events between internal hosts. Extract file names or hashes transferred where available. Use correlation analysis to find identical files appearing on multiple hosts within a short timeframe. Calculate baseline file transfer volume between host pairs using descriptive statistics or time series analysis and flag significant deviations."
          },
          "Suspicious processes executing file transfer utilities (scp, rsync, curl) or unexpected external connections for file transfer (e.g., cloud storage services) on internal hosts.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log; Zeek ssh.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of processes associated with file transfer utilities (scp, rsync, curl, sftp, ftp.exe, etc.) originating from unusual parent processes or with suspicious command line arguments. Analyze Zeek logs (conn.log, http.log, ssh.log) for connections from internal hosts to known cloud storage service domains or unexpected external IPs on ports used by file transfer protocols (e.g., 20, 21, 22, 5985, 5986). Use frequency analysis to identify rare process executions or connection destinations."
          },
          "File creation via SMB on a remote host initiated by an unusual or non-standard process on the source host.": {
            "Data": "Windows Event ID 4688; Zeek smb.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) on source hosts with Zeek smb.log entries showing file creation (command=SMB::FILE_WRITE or similar) on remote target hosts originating from the source host IP and within a relevant time window (e.g., 60 seconds). Identify source processes and command lines from 4688. Establish a baseline of common processes initiating SMB file transfers using frequency analysis. Flag file creations originating from rare or unknown processes using percentile analysis or defining a threshold."
          },
          "Identification of identical or near-identical files (based on hash or name characteristics) created on multiple internal hosts within a short period.": {
            "Data": "Windows Event ID 4663; Zeek smb.log; Zeek ftp.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect file creation/write events (Windows Event ID 4663) and file transfer logs (Zeek smb.log, Zeek ftp.log), extracting file hashes or filenames where available. Group events by file hash or characteristic filename patterns. Use correlation analysis to identify the same file hash or pattern appearing on multiple distinct internal hosts within a defined timeframe (e.g., 24 hours). Flag hashes/filenames appearing on a statistically unusual number of hosts using descriptive statistics or outlier detection."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]