```json
[
  {
    "Is the adversary attempting to evade defenses by modifying cloud compute infrastructure? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1578 - Modify Cloud Compute Infrastructure": {
          "Execution of known malicious scripts (identified by name or hash) or tools on hosts that are designed to interact with cloud provider APIs for unauthorized infrastructure modification.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Match process names, command-line arguments, or associated file hashes (if captured and enriched via EDR integration) against a curated list of known malicious scripts or tools specifically designed for cloud environment exploitation (e.g., malware utilizing cloud SDKs, credential harvesting scripts targeting cloud credentials). Correlate positive matches with any observed network connections (Zeek conn.log) from the same host to cloud provider API endpoints."
          },
          "Network connections from internal hosts to cloud provider API endpoints using User-Agent strings known to be associated with malicious tools or unauthorized/outdated cloud management utilities.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inspect Zeek http.log for User-Agent strings in HTTP/S connections destined for known cloud provider API endpoints. Maintain and update a list of User-Agent strings associated with malicious cloud tools, unauthorized SDK versions, or deprecated libraries known to have vulnerabilities. Alert on matches. Use frequency analysis (descriptive statistics) to identify rare or newly observed User-Agents making cloud API calls, which may warrant further investigation."
          },
          "Specific sequences or combinations of cloud CLI commands executed on a host, indicative of known malicious patterns for defense evasion or data exfiltration via infrastructure modification (e.g., creating a snapshot, making it public, then copying it to an external account).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for cloud CLI command executions (e.g., `aws ec2 create-snapshot`, `aws ec2 modify-snapshot-attribute --attribute createVolumePermission --operation add ...`, `aws ec2 copy-snapshot ...`, and equivalents for Azure/GCP). Define and search for sequences of these commands occurring within a short timeframe (e.g., 5-30 minutes) on the same host or by the same user context, that match documented malicious TTPs for snapshot manipulation or unauthorized resource sharing. Use correlation analysis based on host, user, and time proximity for sequenced events."
          },
          "Execution of cloud CLI commands that directly configure overly permissive settings or disable security features, such as creating public snapshots, overly broad security group rules, or attempting to halt logging services via CLI.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse command-line arguments from Windows Event ID 4688 for cloud CLI tools (e.g., `aws ec2 authorize-security-group-ingress --protocol all --port all --cidr 0.0.0.0/0`, `aws ec2 modify-snapshot-attribute --group-name all --attribute createVolumePermission`, `gcloud compute snapshots add-iam-policy-binding ... --member allUsers`, `az security auto-provisioning-setting delete`). Maintain a list of command patterns known to create high-risk configurations or disable security controls. Alert on the execution of such commands, particularly if performed by unexpected user accounts or outside of established change management procedures. Use descriptive statistics to track the frequency of such risky command executions."
          },
          "Anomalous execution of cloud infrastructure modification commands from an endpoint or server, characterized by unusual timing, frequency, source host, or user context when compared to established operational baselines.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for cloud CLI tool usage (e.g., `aws`, `az`, `gcloud` commands relating to compute, storage, or network modifications) per user, host, and typical operational hours using historical Windows Event ID 4688 data. Monitor for executions that significantly deviate from these baselines (e.g., first-time execution of a modification command by a specific user, execution at 3 AM, execution from a non-administrative workstation). Correlate these anomalous command executions with network traffic volume and patterns to cloud APIs (Zeek conn.log) using time series analysis to detect unusual spikes in API interaction. Utilize Inter-Quartile Range (IQR) or percentile analysis on command frequency or data transfer volumes to identify statistical outliers."
          },
          "A sudden and significant increase in the creation or deletion of multiple cloud compute resources (inferred from a high frequency of related CLI commands like instance/snapshot/volume creation/deletion) originating from a single host or by a single user account in a condensed timeframe.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for commands related to creating or deleting cloud compute resources (e.g., 'aws ec2 run-instances', 'aws ec2 terminate-instances', 'aws ec2 create-snapshot', 'aws ec2 delete-snapshot', 'az vm create', 'az vm delete', 'gcloud compute instances create', 'gcloud compute instances delete'). Count the frequency of such commands per source host/user within short, rolling time windows (e.g., 10 minutes, 1 hour). Employ time series analysis or statistical process control methods (e.g., CUSUM charts, moving averages with standard deviation bands) to detect unusual bursts of creation/deletion activity significantly above established baseline levels. Such bursts may indicate automated malicious scripts or attempts to rapidly alter infrastructure to hide activity or deploy rogue resources."
          },
          "Network traffic patterns to cloud provider APIs indicative of data exfiltration attempts facilitated by modified compute infrastructure, such as large outbound data transfers immediately following snapshot creation commands or VM deployments in unusual geographic regions.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek files.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate cloud infrastructure modification commands (identified from Windows Event ID 4688, e.g., creating snapshots, new VMs, storage buckets in specific regions) with subsequent network traffic activity (Zeek conn.log, Zeek files.log). Look for behavioral patterns such as: 1. Snapshot creation command followed by significant data upload from an internal host to a new or unusual cloud storage endpoint or IP address range. 2. VM creation command targeting an unusual cloud region followed by sustained, high-volume outbound connections from the internal network to the IP address of that newly created VM. Utilize correlation analysis of event timestamps and data volumes (e.g., linear regression to see if modification events predict data spikes). Monitor Zeek files.log for large or numerous file transfers to cloud destinations shortly after infrastructure modification events."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```