[
  {
    "Is the adversary establishing persistence via DLL hijacking or sideloading? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.001 - DLL": {
          "Unusual DLL loading by legitimate processes from non-standard directories.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes (Event ID 4688) and their loaded modules/accessed files (Event ID 4663 on DLL files). For known legitimate processes, identify instances where they load DLLs from non-standard system or application directories (e.g., Temp, user directories). Use frequency analysis to identify rare process-DLL path combinations."
          },
          "Creation or modification of DLL files in system directories or application paths that do not correlate with software updates.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation/modification events (Event ID 4663) for files ending in .dll in system directories (System32, SysWOW64) or common application installation paths. Investigate creation/modification events that do not correlate with scheduled patching or software installations."
          }
        }
      }
    }
  },
  {
    "Is the adversary escalating privileges by abusing DLL loading? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.001 - DLL": {
          "Process spawning or file creation by a process that loaded a suspicious DLL from a non-standard path, particularly if the parent process runs with elevated privileges.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Event ID 4688). Identify child processes spawned by parent processes running with high integrity levels. Correlate this with the loading of suspicious DLLs from non-standard paths (identified via Event ID 4663 on DLL files). Use correlation analysis between suspicious DLL loading in high-privilege processes and subsequent actions (process creation, file modification)."
          },
          "Modifications to .manifest or .local redirection files in application directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation/modification events (Event ID 4663) for files named *.manifest or *.local in application directories. Flag new or modified files that do not align with software updates. Analyze changes for patterns indicative of search order redirection abuse for privilege escalation."
          }
        }
      }
    }
  },
  {
    "Is the adversary evading defenses by abusing DLLs? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.001 - DLL": {
          "Legitimate, trusted processes loading DLLs with suspicious properties (e.g., unusual size, timestamp, or path) from unexpected locations.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes (Event ID 4688). For trusted, legitimate processes, analyze the properties (size, timestamp) of DLLs accessed/loaded from unexpected paths (Event ID 4663 on DLL files). Compare properties to known good system DLLs. Correlate with Zeek logs (conn.log) for subsequent suspicious network connections originating from the process."
          },
          "DLLs loaded with the same name as system DLLs but from different, non-system paths.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes loading DLLs (Event ID 4688, potentially correlated with Event ID 4663 on DLL files). Filter for DLLs with names matching common system DLLs (e.g., kernel32.dll, ntdll.dll). Analyze the file path; flag instances where the path is not the standard system directory. Use frequency analysis to identify anomalous occurrences per process and path."
          }
        }
      }
    }
  }
]