[
  {
    "Is the adversary maintaining persistence by hijacking application search order? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.008 - Path Interception by Search Order Hijacking": {
          "Suspicious file creation (e.g., .exe, .com) with names of common system utilities or partial paths in non-standard directories (especially user-writable).": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file writes in user-writable directories or application directories. Filter for executable file extensions (.exe, .com, .bat, .cmd, .vbs, .js) and file names matching common system utilities (net, findstr, cmd, python, etc.). Use frequency analysis on file paths to identify outliers."
          },
          "Processes executing from unexpected paths that match the names of common system utilities or relative/partial paths.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify processes where the 'New Process Name' field contains only a file name (no path) or a relative path, especially when launched from application directories. Correlate with the 'Parent Process Name' to identify potentially vulnerable parent applications. Use correlation analysis to find parent-child process pairs with suspicious path interactions."
          },
          "Creation of executable files (.com, .bat, .cmd, .vbs, .js) with names of common system utilities in application directories or user-writable paths, leveraging PATHEXT search order.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file writes in common application directories or user profile paths. Filter for file names matching system utilities (e.g., net, findstr, cmd) and extensions (.com, .bat, .cmd, .vbs, .js) that are prioritized in PATHEXT over .exe. Use frequency analysis on file paths and names to identify creation events that are rare or outside normal software installation."
          },
          "Network connections initiated by processes executing from non-standard or user-writable directories with names matching system utilities.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 5156 (Network Connection) and Zeek conn.log. Identify processes where the executable path is unusual or in a user-writable directory and the process name matches a system utility. Investigate network connections (Event ID 5156, Zeek conn.log) initiated by these suspicious processes. Cross-reference destination IPs/domains with Threat Intelligence feeds and look for connections to unusual ports or protocols potentially used for persistence C2 channels."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges by hijacking application search order? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1574.008 - Path Interception by Search Order Hijacking": {
          "Creation of executable files matching system utility names in directories typically requiring elevated write permissions.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for file writes in critical system directories (e.g., System32, Program Files) that typically require elevated privileges. Filter for executable files (.exe, .com) with names of system utilities. Flag writes occurring outside of standard patching or installation windows."
          },
          "High-privilege parent processes launching child processes from unusual paths (e.g., parent directory) using system utility names.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Filter for processes launched by high-privilege parents (e.g., SYSTEM, TrustedInstaller) where the child process path is not the standard system directory (e.g., c:\\windows\\system32) and the child process name matches a system utility. Look for deviations from established baseline parent-child relationships for high-privilege processes."
          },
          "Specific high-privilege parent processes known or suspected to be vulnerable to search order hijacking launching child processes with names matching system utilities from non-standard directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Compile a list of high-privilege applications known or suspected to be vulnerable to search order hijacking. Monitor Windows Event ID 4688, specifically looking for these vulnerable processes as the 'Parent Process Name'. Analyze their child processes ('New Process Name') for names matching system utilities where the 'New Process Path' is non-standard or user-writable. Use correlation analysis to link vulnerable parents to suspicious child process executions."
          },
          "Executable files with names matching system utilities created or modified recently in system or application directories requiring elevated write permissions, inconsistent with patching or installation schedules.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (File Write) and 4656 (Handle Request) in system-critical directories (e.g., Program Files, System32). Filter for executable files (.exe, .com, etc.) with names matching system utilities. Analyze the timestamp of these events. Flag creation or modification events that occur outside scheduled maintenance windows or are inconsistent with software installation/patching history using time series analysis and statistical outliers detection on timestamps."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by hijacking application search order? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1574.008 - Path Interception by Search Order Hijacking": {
          "Creation of files named identically to Windows system executables in non-system locations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for creation of files with names exactly matching Windows system utilities (.exe, .com) in non-system directories (user profiles, temporary folders, application paths). Use pattern matching for known system executable names and statistically identify outlier creation locations compared to normal file activity (e.g., frequency distribution)."
          },
          "Legitimate applications launching child processes with names of system utilities from non-standard system directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Identify instances where common legitimate applications launch child processes using names of system utilities and the child process path is not the standard system directory (e.g., c:\\windows\\system32). Build a baseline of normal parent-child process execution paths for common applications and flag deviations using anomaly detection techniques or statistical methods on path frequency."
          },
          "Executable files with names matching system utilities created in user-writable or non-system directories and subsequently executed from that location.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4663 (File Write) for executable files (.exe, .com, etc.) in non-system or user-writable directories with subsequent Windows Event ID 4688 (Process Creation) where the 'New Process Name' matches the file name and the 'New Process Path' matches the directory from the 4663 event. Look for sequences where a suspicious file is written and then immediately executed from that non-standard location using correlation analysis on event timestamps and file/process paths."
          },
          "Processes executing from non-standard directories with names matching system utilities, possessing command-line arguments typical of the legitimate system utility.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation). Filter for processes where the 'New Process Name' matches a system utility and the 'New Process Path' is a non-standard or user-writable directory. Examine the 'Command Line' field for arguments typically used with the legitimate system utility (e.g., net user, findstr /s, cmd /C). This indicates the intent was likely to hijack the call to the legitimate tool. Use pattern matching and correlation analysis on command-line arguments."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]