[
  {
    "Is the adversary maintaining persistence by manipulating service registry entries? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.011 - Services Registry Permissions Weakness": {
          "Registry value `ImagePath` or `binPath` for a service under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` is modified to point to an unusual or unknown executable path.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*\\ImagePath` or `binPath`. Identify the process responsible (from Event ID 4688, correlating by time/user). Compare the new path to known legitimate paths for the service. Flag changes where the new path is not signed, is in a temporary directory, or deviates significantly from historical values. Use frequency analysis on modified services/paths."
          },
          "Unusual creation or modification of `Performance` or `Parameters` subkeys, or addition of `ServiceDll` value under a service's Registry key.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for creation/modification of subkeys like `Performance` or `Parameters` or values like `ServiceDll` under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. Identify the creating/modifying process (from Event ID 4688). Flag any creation of these keys under services that did not previously have them, or modification by non-standard processes. Use historical data to identify services that typically contain these keys."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to escalate privileges by manipulating service registry entries? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.011 - Services Registry Permissions Weakness": {
          "Registry value `FailureCommand` for a service under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` is modified to execute a suspicious command or executable.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*\\FailureCommand`. Identify the modifying process (from Event ID 4688). Analyze the command/path in the `FailureCommand` for suspicious executables or commands, especially if pointing to temporary directories or unknown binaries. Flag any modification of this key where it was previously empty or different."
          },
          "A service configured via Registry manipulation is observed executing a suspicious binary with SYSTEM or elevated privileges.": {
            "Data": "Windows Event ID 4688, Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation with parent process being `services.exe`. Analyze the user/context (e.g., SYSTEM). If registry modifications (Event ID 4657) for a service precede an unexpected process creation with elevated privileges associated with that service's startup, correlate the events. Use correlation analysis between registry changes and subsequent elevated process launches."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary attempting to evade defenses by manipulating service registry entries? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.011 - Services Registry Permissions Weakness": {
          "A service process is initiated using an executable path that is not associated with the legitimate service or known software.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched by `services.exe`. Extract the `NewProcessName` (full path) and `CommandLine`. Compare the process path/command line to known legitimate values for the service. Flag outliers using frequency analysis or comparing against a baseline of allowed service executables."
          },
          "Registry modifications under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\` are performed by a process not typically associated with service or system configuration management.": {
            "Data": "Windows Event ID 4657, Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for registry modifications under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. Identify the process that initiated the modification (from Event ID 4688, correlating by time/user). Use frequency analysis and baselining to identify processes that are unusually performing these modifications (e.g., non-system tools, remote access tools, or standard user processes)."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]