[
  {
    "Is the adversary maintaining persistence by hijacking execution flow? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574 - Hijack Execution Flow": {
          "Creation, modification, or renaming of executable files or libraries (DLLs) in system or application directories.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 and 4656 for write/modify operations on executable (.exe, .dll) files in system directories (e.g., %SystemRoot%\\System32, %SystemRoot%\\SysWOW64) or application directories (e.g., Program Files). Filter for unexpected processes performing these actions. Calculate file hashes and compare against known good baselines (if hash available in logs or can be retrieved). Use frequency analysis to identify rare file modifications."
          },
          "Modification of Windows Service configuration, specifically binary paths or failure actions.": {
            "Data": "Windows Event ID 4657; Windows Event ID 7040; Windows Event ID 7045; Windows Event ID 4697",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 for modifications to Service control manager registry keys (e.g., SYSTEM\\CurrentControlSet\\Services\\...). Specifically track changes to 'ImagePath' and 'FailureActions'. Compare new values against historical norms for that service. Flag changes that do not correlate with approved software updates using baseline comparison and frequency analysis of modifications."
          },
          "Creation or modification of .manifest or .local redirection files in application directories.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 for creation (AccessMask 0x2) or modification (AccessMask 0x2) of files ending in '.manifest' or '.local' in application installation directories (e.g., Program Files). Filter for actions not initiated by known update processes. Use frequency analysis to identify rare file creations/modifications with these extensions in sensitive directories."
          },
          "Loading of unexpected DLLs into legitimate process memory space.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5136",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (if configured to capture loaded modules) to identify DLLs loaded by common processes (e.g., explorer.exe, svchost.exe). Build a baseline of commonly loaded DLLs per process/user/system. Flag deviations using statistical methods (e.g., set difference from baseline, frequency analysis of uncommon DLLs). Additionally, monitor Windows Event ID 5136 for changes to the 'AppInit_DLLs' Registry key which forces DLL loading."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary elevating privileges by hijacking execution flow? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574 - Hijack Execution Flow": {
          "Process execution with unusual command lines or network activity originating from unexpected processes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for newly created processes. Identify processes with unusual parent-child relationships (e.g., svchost.exe spawning cmd.exe). Monitor Zeek conn.log and correlate with process IDs/names from Event ID 4688 to identify processes making network connections that historically did not, using baseline statistics or outlier detection on connection counts/destinations per process."
          },
          "Unusual parent-child process relationships or command-line arguments indicating environment manipulation.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs. Extract parent process ID, child process name, and command line arguments. Build a model of common parent-child relationships and command-line argument patterns. Use graph analysis (on parent-child) or clustering (on command lines) to identify unusual or outlier process executions potentially indicative of environment variable manipulation or execution hijacking."
          },
          "Modification of Registry keys associated with COM hijacking or other execution-related registry entries (e.g., IFEO Debugger, Shell Folder modifications).": {
            "Data": "Windows Event ID 4657; Windows Event ID 5136",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4657 or 5136 for modifications to sensitive Registry keys used for execution hijacking (e.g., HKCU/HKLM\\Software\\Classes\\CLSID\\..., IFEO Debugger under HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\..., HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Shell Folders). Alert on any modification, especially if the new value points to an unusual executable path. Baseline normal modifications and flag outliers using frequency analysis."
          },
          "Modification of system or user environment variables (e.g., PATH) via process execution or registry changes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5136",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for commands that modify environment variables (e.g., `setx`, `reg add ... /v PATH`). Analyze command lines and parent processes for suspicious activity. Additionally, monitor Windows Event ID 5136 for changes to Registry keys storing environment variables (e.g., HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Environment, HKEY_USERS\\...\\Environment). Baseline typical changes and flag deviations or changes initiated by unusual processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by hijacking execution flow? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574 - Hijack Execution Flow": {
          "Execution of processes or loading of modules from non-standard or temporary directories.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688. Extract process names and command lines. Identify processes executing from temporary directories (%TEMP%, \\Windows\\Temp) or non-standard user-writable locations. Filter for system processes (like svchost.exe, explorer.exe) executing from such locations, which is highly anomalous. Use frequency analysis to identify rare execution paths for common processes."
          },
          "Execution of unusual or previously unseen processes as Windows Services.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4697; Windows Event ID 7045",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4697 and 7045 for new service installations. Correlate newly installed services with subsequent process creation events (Event ID 4688 where ParentProcessName is 'services.exe'). Compare the executable path of the new service process against a baseline of known/approved service executables. Flag previously unseen service executable paths as outliers using frequency analysis and baseline comparison."
          },
          "Modification or replacement of legitimate operating system binaries or applications (e.g., DLLs, EXEs) in trusted locations.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 (Object Access - Write) for writes to known legitimate system executables or DLLs in trusted paths (%SystemRoot%\\System32, Program Files). Correlate with Windows Event ID 4688 to capture the process performing the write. Calculate and compare new file hashes against known good hashes for those files (if available). Flag any modification or hash mismatch not tied to approved patching/updates using hash comparison and frequency analysis of modification events."
          },
          "Creation of common library (.dll) files in directories where a legitimate application might search before system directories (DLL Search Order Hijacking).": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4656/4663 for creation or write operations on files ending in '.dll' in application directories (e.g., within Program Files subdirectories) that share names with commonly hijacked DLLs (e.g., `version.dll`, `ws2_32.dll`, `dbghelp.dll`). Use frequency analysis to identify rare DLL creations in these directories, especially by unusual processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]