[
  {
    "Is the adversary establishing persistence using dynamic linker hijacking? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "Modification of dynamic linker environment variables (e.g., LD_PRELOAD) on critical servers or endpoints.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on critical systems for processes executing commands that modify environment variables like LD_PRELOAD, DYLD_INSERT_LIBRARIES. Flag changes originating from unusual parent processes or user accounts."
          },
          "Unusual network connections or file access patterns observed in legitimate processes that typically do not exhibit such behavior.": {
            "Data": "Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile baseline Zeek conn.log and Windows Event ID 4663 (File Access) activity for common system processes. Use statistical methods (e.g., anomaly detection based on connection count, destination IPs, file access frequency/type) to identify deviations from the baseline for processes potentially affected by linker hijacking."
          },
          "Repeated or scheduled modification of dynamic linker environment variables or configuration files (e.g., ld.so.preload on Linux, or related Windows mechanisms)": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file access logs (Event ID 4663) for modifications to known dynamic linker configuration files or files used in startup scripts. Monitor process creation logs (Event ID 4688) for commands setting dynamic linker environment variables in user/system startup scripts or modifying relevant registry keys. Use time series analysis or simple frequency counts to detect recurring modifications to establish persistence."
          },
          "New or unexpected child processes spawned by critical system services, potentially launched by a hijacked linker.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal parent-child process relationships for critical system services (e.g., svchost.exe, lsass.exe) using Windows Event ID 4688. Flag instances where these services spawn child processes that are unusual in name, path, or command line, especially if the parent service was potentially targeted by linker hijacking attempts (e.g., via detected env var modifications or unusual process starts)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges via dynamic linker hijacking? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "Modification of dynamic linker environment variables (e.g., LD_PRELOAD) by a low-privilege process or user.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs for environment variable modifications (LD_PRELOAD, etc.). Identify the user context and parent process. Flag modifications initiated by processes running under standard or low-privilege user accounts on systems where such changes are unexpected, indicating potential privilege escalation setup."
          },
          "Process exhibiting elevated activity (e.g., creating services, accessing sensitive files) after suspicious linker variable modification.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for suspicious commands (e.g., service creation, modifying registry run keys) executed by processes immediately following detected environment variable modification. Analyze Windows Event ID 4663 for access to sensitive system files by processes with recently modified linker variables. Look for correlation between variable changes and subsequent privileged actions."
          },
          "A process with elevated privileges (e.g., running as SYSTEM or Administrator) being executed from a user-writable directory or an unusual system path.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes starting with high integrity levels or running as SYSTEM/Administrator. Analyze the executable path of the parent process. Flag instances where a privileged process executable resides in or is being executed from a user-writable directory (e.g., user profile folder, AppData, Downloads) as this could indicate an attempt to hijack a privileged process by placing it or a supporting library in an insecure location."
          },
          "Network connections or command execution activity originating from a previously low-privilege process that now exhibits signs of elevated privileges.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes that previously ran with low privileges or within restricted network/execution contexts using Event ID 4688 (capturing user/integrity level and command line). Correlate these processes with later Zeek conn.log entries showing connections to internal network resources or external C2, or with later Event ID 4688 entries showing the execution of administrative commands (e.g., `net`, `sc`, `wmic`) or the creation of new services, indicating potential privilege escalation via hijacking."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses using dynamic linker hijacking? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.006 - Dynamic Linker Hijacking": {
          "Modification of dynamic linker environment variables (e.g., LD_PRELOAD) associated with security monitoring agents or critical system processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for processes modifying dynamic linker environment variables specifically for known security agents, monitoring tools, or critical system binaries that might be targeted for defense evasion. Investigate any such modifications as potential attempts to disable or bypass security controls."
          },
          "Execution of commands or scripts designed to modify system environment variables related to dynamic linking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Specifically search Windows Event ID 4688 for commands or scripts using system utilities (set, export, reg.exe, PowerShell equivalents) or custom code to modify environment variables known to influence dynamic linking (LD_PRELOAD, DYLD_INSERT_LIBRARIES, etc.). Flag executions from unexpected sources or locations that could be used for defense evasion."
          },
          "Processes exhibiting suspicious file modification or registry access patterns immediately following suspected dynamic linker hijacking, targeting security-related configurations.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate suspected linker hijacking events (e.g., detected env var modifications from other evidence) with subsequent file modification events (Event ID 4663) targeting security-related files (e.g., security logs, monitoring agent configuration files, firewall rules) or registry value set events (Event ID 4657) modifying security-related registry keys. Flag suspicious access or modification by processes that may have been compromised via linker hijacking for defense evasion."
          },
          "Processes attempting to identify or disable security agents, logging mechanisms, or firewall rules using standard utilities.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing keywords or arguments associated with identifying (e.g., `tasklist`, `get-process`, `sc query`) or disabling (e.g., `sc stop`, `net stop`, `netsh advfirewall firewall delete rule`, `Set-NetFirewallRule`) security agents, logging, or firewall rules. Flag such commands, especially if executed by unusual processes or users, as this indicates an adversary potentially attempting defense evasion after gaining initial access or escalating privileges via linker hijacking."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]