[
  {
    "Is the adversary communicating with command and control infrastructure using symmetric cryptography? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1573.001 - Symmetric Cryptography": {
          "Network traffic on standard ports (e.g., 80, 443) that does not adhere to expected protocol behavior or contains undecipherable encrypted data.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn.log, ssl.log, http.log) for connections on common ports (80, 443, etc.) exhibiting non-standard byte patterns or lacking expected protocol headers/structures (e.g., using entropy analysis on packet payloads or identifying connections with no SSL/TLS negotiation on port 443). Use correlation analysis between conn.log and protocol-specific logs to find anomalies."
          },
          "Unusual data flow patterns, such as clients sending significantly more data than receiving, or connections to/from unexpected processes.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to calculate data volume ratios (bytes sent vs. bytes received) per connection/host pair. Identify connections with high or unusual ratios (e.g., client-to-server > 10:1 on standard C2 ports) using descriptive statistics and IQR. Identify processes making unusual network connections by analyzing correlations between connection data and host process logs (Windows Event ID 4688 where available), flagging processes with connections deviating significantly from baseline network behavior using time series analysis on connection frequency or volume per process."
          },
          "Network traffic on standard application ports (e.g., 80, 53) exhibiting high entropy, suggesting encrypted or obfuscated payload data not conforming to standard protocol.": {
            "Data": "Zeek conn.log; Zeek packet_filter.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs for connections on common application ports (80, 53, etc.). For connections on these ports, calculate the entropy of the packet payload data (requires appropriate Zeek configurations like packet_filter). Flag connections with entropy scores exceeding a baseline threshold for that port/protocol, indicating potentially encrypted or obfuscated data. Compare entropy distribution over time using descriptive statistics."
          },
          "Newly observed or unusual process initiating network connections exhibiting characteristics of encrypted symmetric C2 traffic (e.g., high entropy, unusual data flow patterns).": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) to identify new or infrequent processes initiating outbound network connections. Correlate these process activities with Zeek conn.log entries for the corresponding host and connection times. Analyze the correlated network connections for characteristics like high entropy payload (if available in Zeek logs), unusual data flow ratios (re-using previous analysis), or connections to known suspicious IPs. Flag connections originating from unusual processes exhibiting these communication patterns using frequency analysis for processes and correlation analysis for combining host and network data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]