[
  {
    "Is the adversary attempting to evade defenses by reverting cloud instances? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1578.004 - Revert Cloud Instance": {
          "Unexpected system shutdown/restart events occurring on a host shortly after suspicious activity.": {
            "Data": "Windows Event ID 1074; Windows Event ID 6005; Windows Event ID 6006",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 1074, 6005, 6006 on critical servers. Establish a baseline for scheduled restarts/shutdowns. Identify unscheduled or anomalous shutdown/restart events using time series analysis and correlation with prior security alerts on the same host."
          },
          "Abrupt termination and subsequent re-establishment of network connections from a host, especially if observed shortly after other suspicious events.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for sudden drops in active connections or abrupt connection termination events originating from specific hosts. Correlate these events with subsequent connection re-establishment from the same host. Use time series analysis to identify anomalous connection lifecycle patterns."
          },
          "Presence of suspicious network activity in Zeek logs attributed to a host, followed by host restart/shutdown events, where corresponding detailed activity is subsequently missing from the host's Windows Event Logs after it comes back online.": {
            "Data": "Zeek conn.log; Windows Event ID 1074; Windows Event ID 6005; Windows Event ID 6006; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate suspicious network patterns (e.g., C2 communication, data exfiltration) in Zeek conn.log with specific hosts. Monitor these hosts for subsequent unexpected shutdown/restart events (Windows Event IDs 1074, 6005, 6006). After the host is back online, attempt to find corroborating Windows Event Logs (e.g., process creation 4688, network connections via Event ID 5156) for the period of suspicious Zeek activity. A lack of such host logs, despite strong network evidence, could indicate a revert or targeted log deletion. Use time series analysis to align Zeek events with host event log timelines."
          },
          "System time changed significantly (Windows Event ID 4616) on a host, particularly backwards, followed by or coinciding with restart events, potentially indicating restoration from an older snapshot.": {
            "Data": "Windows Event ID 4616; Windows Event ID 1074; Windows Event ID 6005; Windows Event ID 6006",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for Windows Event ID 4616 (System time was changed). Correlate occurrences of significant time changes, especially backward jumps, with system restart/shutdown events (1074, 6005, 6006). Analyze the 'PreviousTime' and 'NewTime' fields in Event ID 4616. Flag instances where time moves backward by more than a typical NTP sync adjustment (e.g., several minutes or hours), as this could indicate a revert to an older snapshot's system time. Use descriptive statistics on time change magnitudes (differences between NewTime and PreviousTime) to identify outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]