[
  {
    "Is the adversary attempting to evade defenses by modifying cloud compute infrastructure? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1578 - Modify Cloud Compute Infrastructure": {
          "Network connections to cloud provider management API endpoints from unusual hosts or exhibiting anomalous traffic patterns.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections to known cloud provider API endpoints (e.g., specific AWS/Azure/GCP API URLs/IPs). Identify source hosts/IPs initiating these connections. Analyze connection frequency, duration, and data transfer volume using time series analysis to detect deviations from baseline."
          },
          "Execution of scripts or commands on hosts potentially interacting with cloud APIs or management tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints and servers for execution of command-line tools or scripts associated with cloud interaction (e.g., 'aws', 'az', 'gcloud', PowerShell cmdlets like 'New-AzVM'). Use descriptive statistics on command frequency per user/host. Correlate execution events with network traffic to cloud APIs and other host activity."
          },
          "Execution of command-line tools or scripts with arguments indicating modification of cloud compute instances, snapshots, or networking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing cloud provider CLI tools (e.g., 'aws', 'az', 'gcloud', related PowerShell cmdlets) followed by arguments indicative of modification actions (e.g., 'run-instances', 'create-snapshot', 'delete-volume', 'authorize-security-group-ingress', 'New-AzVM', 'Remove-AzSnapshot', 'Add-AzNetworkSecurityGroupRule'). Use frequency analysis to identify anomalous spikes in such command executions or execution by unusual users/hosts. Correlate executions with user logon information and network connections to cloud APIs (Zeek conn.log)."
          },
          "High frequency or volume of network connections to cloud provider compute/storage API endpoints from a single host or user account.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and http.log for connections targeting known cloud provider API endpoints related to compute and storage services (e.g., EC2, S3, Azure Compute, Blob Storage APIs). Group connections by source IP/host and analyze frequency and total bytes transferred within a time window. Use time series analysis and correlation analysis to detect significant increases in connection volume or data transfer to these APIs by specific sources, potentially correlating with suspicious host activity (Windows Event ID 4688)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]