```json
[
  {
    "Has the adversary attempted to evade detection or remove evidence by deleting cloud instances? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1578.003 - Delete Cloud Instance": {
          "Cloud instance deletion event originating from a known malicious IP address or an IP address outside of expected administrative geolocations.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Cloud Platform",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse cloud audit logs for instance deletion API calls (e.g., AWS 'TerminateInstances', Azure 'Delete Virtual Machine'). Extract the source IP address for each event. Inner join these source IPs with a CTI feed of known malicious IPs or TOR exit nodes. Separately, baseline the normal geographic locations of administrative users and use frequency analysis to flag deletions from rare or new source countries/regions. Alert on any high-confidence matches."
          },
          "Cloud instance deletion performed using a suspicious User-Agent string or via a method not associated with approved Infrastructure-as-Code (IaC) or management tools.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Cloud Platform",
            "NAI": "Insert site-specific NAI here",
            "Action": "From cloud audit logs, extract the User-Agent for all instance deletion events. Compare the User-Agent against a deny-list of known malicious tools or an allow-list of approved User-Agents (e.g., 'Management Console', 'Terraform', 'Ansible'). Flag any deletions originating from User-Agents that are not on the allow-list, such as default SDK libraries (e.g., 'Boto3', 'Python-Requests'), which may indicate unauthorized manual script usage. Use correlation analysis to link these events to specific users or roles."
          },
          "Rapid creation and subsequent deletion of a cloud instance by the same actor, suggesting temporary use for malicious activity followed by cleanup.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Cloud Platform",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Cloud Audit Logs for instance creation (e.g., 'RunInstances') and deletion (e.g., 'TerminateInstances') events. Correlate these events by instance ID and actor identity. Calculate the time delta between creation and deletion for all instances. Use descriptive statistics (mean, median, standard deviation) to baseline normal instance lifecycles and use Inter-Quartile Range (IQR) or percentile analysis to flag instances with an anomalously short lifespan (e.g., under 1 hour) as potential cleanup of attacker infrastructure."
          },
          "Deletion of critical or long-running cloud instances outside of scheduled maintenance windows or by an unauthorized user account.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Cloud Platform",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an inventory of critical cloud instances based on tags, names, or configuration. Monitor Cloud Audit Logs for their deletion events. Correlate deletion event timestamps with authorized change management windows. Maintain an allow-list of user accounts and roles authorized to delete critical infrastructure. Alert on any deletion of a critical instance that occurs outside an approved window OR is performed by an unauthorized identity. Use descriptive statistics on instance uptime prior to deletion to identify outliers that represent unexpected removal of long-lived assets."
          },
          "Anomalous bulk deletion of multiple cloud instances by a single user or programmatic account in a short timeframe, indicative of destructive or widespread cleanup activity.": {
            "Data": "Cloud Audit Logs",
            "Data Platform": "Cloud Platform",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate cloud instance deletion events from audit logs by actor identity (user/role) within a sliding time window (e.g., 5-15 minutes). Count the number of distinct instances deleted by each actor. Use time series analysis to establish a baseline for normal deletion rates per actor and flag any significant spikes. Apply statistical methods like Z-score or percentile-based thresholds on the count of deleted instances to identify anomalous bulk deletion activity. Use box-plots to visualize deletion counts per user and identify outliers."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```