[
  {
    "Is the adversary using snapshots to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1578.001 - Create Snapshot": {
          "Host or network activity indicative of initiating snapshot creation via cloud APIs.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations of cloud CLI tools (e.g., 'aws.exe', 'az.cmd', 'gcloud.cmd') or scripts executing these tools. Filter for commands containing keywords like 'snapshot create', 'create-snapshot', 'createDisk'. Correlate with Zeek http.log for outbound connections to cloud provider API endpoints with POST/PUT requests potentially containing snapshot creation parameters. Use frequency analysis to identify unusual occurrences of these commands/connections by user or host compared to baseline."
          },
          "Host or network activity indicative of initiating snapshot restoration or mounting via cloud APIs.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations of cloud CLI tools or scripts executing them. Filter for commands containing keywords like 'restore-volume', 'createDisk --sourceSnapshot', 'start-instance from-snapshot', AWS Backup restore commands. Correlate with Zeek http.log for outbound connections to cloud provider API endpoints with requests potentially related to restoration or mounting. Use correlation analysis to link the user/host performing these actions to other suspicious activity observed on that host or network segment."
          },
          "Network connections from internal hosts to cloud provider storage service endpoints immediately following or preceding activity indicative of cloud API interaction related to snapshot creation.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries to cloud storage domains (e.g., *.blob.core.windows.net, *.s3.amazonaws.com, *.storage.googleapis.com). Correlate these queries and subsequent connections in Zeek conn.log to hosts that also exhibit activity related to cloud CLI tool execution (based on Event ID 4688 or Zeek http.log to API endpoints). Use time series analysis to identify sudden increases or unusual timing of connections to storage endpoints from specific hosts, particularly those lacking a prior history of such connections."
          },
          "Execution of scripting interpreters or uncommon utilities making outbound connections to cloud provider API endpoints with cloud-related command line arguments.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes like powershell.exe, python.exe, cscript.exe, wscript.exe, cmd.exe with command lines containing cloud CLI commands or API interaction keywords (e.g., 'aws ec2', 'az vm', 'gcloud compute'). Correlate process execution (Event ID 4688) and subsequent network connections (Event ID 5156 or Zeek conn.log) originating from these processes to known cloud provider API IP ranges or domains. Baseline common script execution patterns by user and host using frequency analysis and flag statistically significant deviations as potential outliers."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]