[
  {
    "Is the adversary communicating with C2 infrastructure using protocol tunneling? (TA0011 - Command and Control)": {
      "Indicators": {
        "T1572 - Protocol Tunneling": {
          "External connections using ports/protocols commonly associated with tunneling (e.g., SSH on non-standard ports) or processes known for tunneling (e.g., Plink, OpenSSH client) establishing outbound connections.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections to common tunneling ports (e.g., 22) or ports not typically used for expected services. Monitor Windows Event ID 4688 for creation of processes like 'plink.exe' or 'ssh.exe' making external connections. Analyze connections to high-entropy destinations or those lacking typical service banners. Correlate process execution with network connections."
          },
          "Network traffic exhibiting uncommon data flows (e.g., high client-to-server data volume for protocols typically server-to-client) or anomalous packet contents.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for sessions with asymmetric data flows (e.g., calculating client-to-server byte ratio and flagging significant deviations from historical averages or expected protocol behavior using descriptive statistics). Analyze Zeek http.log and dns.log for DoH traffic, correlating with known suspicious domains or IPs. Use entropy measures on flow metadata (e.g., byte distribution) to identify potentially encrypted or obfuscated traffic within expected plaintext protocols."
          },
          "Outbound network connections from processes not typically associated with network communication, potentially on unusual ports or protocols.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) on endpoints and servers to identify processes initiating external network connections. Compare observed network-communicating processes against a baseline of expected processes for each host or host type using frequency analysis. Flag connections from processes with no prior network activity or from suspicious process names/paths. Correlate with Zeek conn.log to identify connection details (destination IP/port, volume) and destination reputation."
          },
          "Detection of application layer protocols (e.g., SMB, RDP) encapsulated within unexpected transport protocols or identified as potentially encrypted/obfuscated within standard protocols.": {
            "Data": "Zeek conn.log; Zeek dce_rpc.log; Zeek rdp.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections carrying unexpected application layer protocols on non-standard ports (e.g., SMB on port 443 or 80). Use Zeek dce_rpc.log and rdp.log to identify actual SMB/RDP activity. Use Zeek ssl.log to identify encrypted connections (like DoH or other encrypted tunnels). For suspicious connections (e.g., encrypted traffic on unusual ports, unexpected protocols), examine packet contents (if available) or metadata (e.g., high entropy of flow data, unusual JA3/JA3S hashes) for signs of tunneling or obfuscation."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]