[
  {
    "Is the adversary establishing persistence via DLL hijacking or sideloading? (TA0003 - Persistence)": {
      "Indicators": {
        "T1574.001 - DLL": {
          "Unusual DLL loading by legitimate processes from non-standard directories.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes (Event ID 4688) and their loaded modules/accessed files (Event ID 4663 on DLL files read). For known legitimate processes, identify instances where they load DLLs from non-standard system or application directories (e.g., Temp, user directories). Use frequency analysis to identify rare process-DLL path combinations."
          },
          "Creation or modification of DLL files in system directories or application paths that do not correlate with software updates.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation/modification events (Event ID 4663 indicating write/create) for files ending in .dll in system directories (System32, SysWOW64) or common application installation paths. Investigate creation/modification events that do not correlate with scheduled patching or software installations."
          },
          "Legitimate processes loading newly created or recently modified DLL files from unexpected locations on disk.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation (Event ID 4688) or file access (Event ID 4663 indicating file read) for DLL files with file modification/creation events (Event ID 4663 indicating write/create) on those same DLL files. Identify instances where a legitimate process loads a DLL that was recently created or modified in a non-standard directory. Use time series analysis to identify loads occurring shortly after modification/creation."
          },
          "Network connections to remote shares (SMB/WebDAV) immediately preceding or accompanying the loading of DLLs by local processes.": {
            "Data": "Zeek smb.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek smb.log and http.log entries showing connections to remote shares (SMB, WebDAV) from endpoints/servers with process creation events (Event ID 4688) or file access events (Event ID 4663 on DLLs) occurring on those systems. Identify processes loading DLLs from remote paths (e.g., `\\\\remote_host\\share\\malicious.dll`). Use time series analysis to identify clustered network connections and DLL loads."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary escalating privileges by abusing DLL loading? (TA0004 - Privilege-Escalation)": {
      "Indicators": {
        "T1574.001 - DLL": {
          "Process spawning or file creation by a process that loaded a suspicious DLL from a non-standard path, particularly if the parent process runs with elevated privileges.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze process creation events (Event ID 4688). Identify child processes spawned by parent processes running with high integrity levels. Correlate this with the loading of suspicious DLLs from non-standard paths (identified via Event ID 4663 on DLL files read). Use correlation analysis between suspicious DLL loading in high-privilege processes and subsequent actions (process creation, file modification)."
          },
          "Modifications to .manifest or .local redirection files in application directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file creation/modification events (Event ID 4663 indicating write/create) for files named *.manifest or *.local in application directories. Flag new or modified files that do not align with software updates. Analyze changes for patterns indicative of search order redirection abuse for privilege escalation."
          },
          "High-integrity processes loading DLLs from user-writable directories or common DLL hijacking locations.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event ID 4688 for processes running with 'High' or 'System' integrity levels. Analyze the process path or command line for indications of loading DLLs from user-writable paths (e.g., user's Temp, Downloads folders) or common DLL hijacking locations. Maintain a baseline of expected DLL load paths for high-integrity processes and flag deviations using frequency analysis."
          },
          "Modification or replacement of legitimate system DLLs in standard, protected Windows directories.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for write or delete operations targeting DLL files in standard system directories (e.g., C:\\Windows\\System32, C:\\Windows\\SysWOW64) by processes other than trusted installers or updaters. Use time series analysis to identify suspicious file modification patterns on critical system files."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by abusing DLLs? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1574.001 - DLL": {
          "Legitimate, trusted processes loading DLLs with suspicious properties (e.g., unusual size, timestamp, or path) from unexpected locations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes (Event ID 4688). For trusted, legitimate processes, analyze the properties (inferred from file access/read events like Event ID 4663 if configured, or by comparing file metadata post-collection) of DLLs accessed/loaded from unexpected paths (Event ID 4663 on DLL files read). Compare properties to known good system DLLs using pre-computed hashes/sizes. Correlate with Zeek logs (conn.log) for subsequent suspicious network connections originating from the process."
          },
          "DLLs loaded with the same name as system DLLs but from different, non-system paths.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify processes loading DLLs (Event ID 4688, correlated with Event ID 4663 on DLL files read). Filter for DLLs with names matching common system DLLs (e.g., kernel32.dll, ntdll.dll). Analyze the file path; flag instances where the path is not the standard system directory. Use frequency analysis to identify anomalous occurrences per process and path."
          },
          "Network connections to suspicious external destinations or execution of unusual child processes originating from a legitimate process that loaded a DLL from a non-standard path.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation (Event ID 4688) or network connection events (Zeek conn.log) where the originating process is a legitimate system process that was previously observed loading a DLL from a non-standard path (cross-reference with findings from other evidence). Identify connections to known malicious IPs/domains (Threat Intel join) or the creation of unusual child processes (e.g., command shell, script interpreter) that deviate from the process's normal behavior baseline. Use correlation analysis between suspicious DLL loads and subsequent network/process activity."
          },
          "Unexpected increase in the number or frequency of DLLs loaded from non-standard paths by legitimate processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For known legitimate processes, identify instances where the process is associated with loading DLLs from non-standard directories (via Event ID 4688 process path or correlated Event ID 4663 read events). Calculate the baseline frequency and count of such non-standard DLL loads per process over time. Use statistical methods (e.g., Z-score, IQR) or time series analysis to detect statistically significant increases in the rate or count of non-standard DLL loads for a given process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]