
[
  {
    "Is the adversary attempting to gather information about the organization? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1589.002 - Email Addresses": {
          "Network connections to public-facing services from IP addresses known to be part of reconnaissance infrastructure, malicious scanning services, or anonymizing proxies.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses from logs of public-facing web and authentication services (Zeek conn.log, http.log) against a high-confidence, continuously updated CTI feed of known reconnaissance platforms, malicious scanners, TOR exit nodes, and bulletproof hosting providers. Alert on connections originating from these flagged sources, prioritizing those exhibiting high-volume or systematic connection patterns."
          },
          "HTTP requests to public-facing web services containing User-Agent strings or request patterns characteristic of known email harvesting or OSINT tools.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for HTTP User-Agent strings associated with known reconnaissance and email harvesting tools (e.g., 'theHarvester', 'hunter.io', 'Email-Harvester', 'Recon-ng', 'sqlmap', 'Nmap Scripting Engine'). Maintain and regularly update a list of these tool-specific signatures. Use regular expression matching to identify these agents in incoming requests to web servers and alert on matches, especially when correlated with high request volumes or enumeration-like behavior."
          },
          "An anomalously high rate of failed authentication attempts against a public-facing service (e.g., OWA, VPN, M365) from a single external source or subnet, indicating a potential username/email enumeration attack.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 for logon failures (especially Type 3 for network logon) on public-facing authentication servers. Aggregate failure events by source IP and target username over short time windows (e.g., 5-15 minutes). Use descriptive statistics and outlier detection methods (e.g., IQR, standard deviation) to flag source IPs with an anomalously high count of unique target usernames or total failed attempts. A high ratio of distinct failed usernames to a single source IP is a strong indicator of enumeration. Correlate with Zeek conn.log to verify the connections are external and targeting the correct service ports."
          },
          "Web traffic patterns from a single external source indicative of automated scraping for email addresses, such as high-frequency requests, systematic traversal of directory paths, or an unusually large number of requests to profile/contact pages.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log for external sources exhibiting scraping behavior. Establish a baseline for normal user browsing (e.g., request rate, page views per session, URL path entropy). Use statistical methods to identify significant outliers. Flag source IPs that exhibit: 1) A request rate exceeding 3 standard deviations from the mean; 2) A high count of requests to user-related URL paths (e.g., '/contact', '/about/staff', '/profiles/*'); 3) Linear traversal of resource IDs in URLs. Calculate the entropy of URL paths requested by a source IP over a session; very low entropy can indicate systematic scraping of a specific directory."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
