[
  {
    "Is the adversary developing resources using cloud accounts? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1585.003 - Cloud Accounts": {
          "Network connections from internal systems to known cloud provider account registration or management URLs that are not typical for the organization.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and conn.log for connections to known cloud provider API/management URLs or IPs. Identify connections originating from internal IPs. Analyze the frequency of these connections over time per source IP/user. Use descriptive statistics and time series analysis to identify anomalous spikes or consistent low-level activity to these destinations from unexpected internal sources."
          },
          "Outbound network traffic patterns suggesting potential use of cloud storage services by non-sanctioned accounts.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for large outbound data transfers (check 'orig_bytes'/'resp_bytes' in conn.log or transfer sizes in http.log if available/configured) to known cloud storage endpoints (e.g., s3.amazonaws.com, storage.googleapis.com, dropbox.com). Analyze traffic volume using descriptive statistics (e.g., max bytes transferred per connection/session) and compare against baseline/percentiles to flag unusual activity size."
          },
          "Unusual DNS queries or connections from internal systems to cloud provider domains associated with account creation or management services.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries to known cloud provider account/resource creation domains (e.g., related to AWS IAM, Azure portal, Google Cloud console, DigitalOcean API). Correlate with Zeek conn.log to identify successful connections. Filter for sources that are not authorized cloud administrators or designated cloud infrastructure management systems. Use frequency analysis or outlier detection (e.g., Z-score) to identify rare instances of such queries/connections from unexpected sources."
          },
          "Accessing web pages or APIs on cloud provider domains specifically associated with account sign-up, billing, or API key generation from unauthorized internal systems or user accounts.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests to URLs containing paths or parameters related to cloud account creation, billing, user management, or infrastructure setup on known cloud provider domains (e.g., '/signup', '/billing', '/iam', '/v1/instances', '/v2/keys'). Filter out activity from authorized cloud administrators or automation systems. Use correlation analysis to identify sequences of requests that match account creation workflows. Flag activity from unexpected source IPs or user agents."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]