[
  {
    "Is the adversary developing resources using email accounts? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1585.002 - Email Accounts": {
          "Inbound email traffic exhibiting characteristics of phishing attempts originating from newly created or unusual email domains/addresses.": {
            "Data": "Zeek smtp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log for emails with suspicious characteristics (e.g., unusual sender domains, high volume to multiple recipients, presence of links/attachments). Correlate with Zeek http.log for connections resulting from email links. Use entropy measures on sender domain strings to identify potentially randomly generated domains that have low historical interaction."
          },
          "Outbound network connections to free/disposable email services or suspicious domains potentially registered using such accounts.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log and conn.log for connections to known disposable email domains or free service providers. Analyze connection patterns and volume to identify attempts to register or access infrastructure. Use frequency analysis to identify newly contacted domains or services that have low historical interaction."
          },
          "Outbound network connections from internal endpoints to services commonly used for infrastructure registration or free trials, potentially linked to automated signup activity.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections from internal IPs to known IP ranges or domains associated with hosting providers, domain registrars, or cloud service free trials not typically accessed by users. Analyze Zeek http.log for high volume of requests to signup pages or API endpoints on these services. Use frequency analysis or clustering of internal source IPs/users to identify potential automation or bulk account creation activity."
          },
          "Process execution or network connections on an endpoint immediately following interaction with known disposable email service domains.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and dns.log entries showing access from internal endpoints to known disposable email domains with subsequent Windows Event ID 4688 (Process Creation) or 5156 (Network Connection) events on the same endpoint within a short time frame (e.g., 60 seconds). Analyze newly created processes or network connections for suspicious activity (e.g., launching uncommon utilities, connecting to unexpected external IPs). Use time series analysis to identify temporal correlation between accessing disposable services and subsequent endpoint activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]