[
  {
    "Is the adversary developing resources (e.g., botnets) for future attacks against our organization? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583.005 - Botnet": {
          "High volume of connection attempts from geographically dispersed IP addresses matching known botnet/malicious source lists, potentially indicative of DDoS or mass scanning/phishing attempts.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect network connection logs (Zeek conn.log). Correlate source IP addresses with threat intelligence feeds identifying known malicious or botnet IPs. Analyze patterns of connection attempts from these IPs, focusing on volume and distribution. Use statistical methods (e.g., frequency analysis, entropy of source IPs) to identify unusually high volumes or dispersed sources targeting specific services or IPs within the network boundary."
          },
          "Outbound connections from internal systems to IP addresses or domains associated with known botnet infrastructure or proxy services commonly used by adversaries.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect network connection and DNS logs (Zeek conn.log, dns.log). Monitor outbound connections from internal hosts. Correlate destination IP addresses and domains with threat intelligence feeds for known C2 infrastructure, proxy services, or IPs associated with botnets. Identify hosts initiating connections to these suspicious destinations and analyze the connection patterns (e.g., frequency, duration, data volume) using time series analysis."
          },
          "Large volume of low-intensity probes or scans from geographically diverse IPs (consistent with botnet activity) targeting internet-facing services.": {
            "Data": "Zeek conn.log; Zeek scan.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Zeek conn.log (and scan.log if available) on internet-facing network segments. Analyze inbound connection patterns for distributed scanning or probing behavior across multiple ports/services over time, originating from a high number of distinct source IPs. Use statistical methods (e.g., source IP count per destination port/service, frequency of scans from individual IPs, entropy of source IPs per targeted host/port) to identify patterns indicative of a distributed scan by a botnet rather than typical internet noise or targeted attacks from single/few sources."
          },
          "Internal systems exhibiting connection patterns consistent with participating in a botnet (e.g., receiving commands on unusual ports, mass scanning outbound, connecting to a large number of diverse external IPs).": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for internal hosts making connections to a high volume of disparate external IPs or receiving connections on non-standard ports from external sources. Correlate these network events with Windows Event ID 5156 (Network Connection) to identify the process initiating suspicious outbound connections or Windows Event ID 4688 (Process Creation) for processes listening on unusual ports or executing suspicious network utilities. Use statistical analysis (e.g., correlation of internal host IPs with high external connection counts, analysis of destination port/IP diversity using entropy) to identify outlier hosts with connection patterns inconsistent with normal behavior."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]