
[
  {
    "Is the adversary acquiring resources, specifically code signing certificates, for use in operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1588.003 - Code Signing Certificates": {
          "Execution of code signed with a certificate whose thumbprint, serial number, or issuer is on a threat intelligence list of known malicious certificates.": {
            "Data": "Windows Event ID 4688; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor process creation events (Windows Event ID 4688 with command line auditing enabled) and network SSL/TLS handshakes (Zeek ssl.log). Extract certificate details (thumbprint, serial number, issuer, subject) from all signed executables and network sessions. Inner join these extracted details against a high-confidence, continuously updated threat intelligence feed of known malicious certificate artifacts. Trigger an alert for any match and investigate the associated process and network activity."
          },
          "Execution of code signed with a certificate exhibiting a pattern of deceptive characteristics, such as a subject name that typosquats a legitimate company or an issuer from an unusual Certificate Authority for a common software vendor.": {
            "Data": "Windows Event ID 4688; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "From process creation events (Windows Event ID 4688) and network logs (Zeek ssl.log), extract certificate subject and issuer strings. Use regular expressions and pattern matching to detect common deception techniques, such as typosquatting in subject names (e.g., 'Mircosoft Inc', 'Adobe Flash Payer'). Maintain a list of legitimate software publishers and their expected Certificate Authorities (CAs); flag binaries where the publisher name is common but the CA is unusual (e.g., a Microsoft-named binary signed by a free or non-standard CA). Correlate findings to identify executables fitting these deceptive patterns."
          },
          "Execution of code signed by a statistically rare certificate issuer or subject, or a certificate with an unusually short validity period, when compared to an environmental baseline.": {
            "Data": "Windows Event ID 4688; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect certificate data from all signed processes (Windows Event ID 4688) and TLS sessions (Zeek ssl.log) over a 30-90 day period to establish a baseline of normal certificate issuers and subjects. Calculate the frequency distribution for all issuers and subjects. Flag the execution of any binary signed by an issuer or subject that falls into a low percentile (e.g., seen less than 1% of the time). Additionally, analyze certificate validity periods; use descriptive statistics (mean, median, IQR) to profile normal durations and flag certificates with unusually short validity periods (e.g., < 90 days) that do not originate from expected short-term CAs like Let's Encrypt."
          },
          "Addition of a new root or trusted publisher certificate to a system's certificate store, especially by an unusual process or user.": {
            "Data": "Windows Security Event ID 4688; Windows Security Event ID 4673; Windows Security Event ID 5038",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for events indicating modification of trusted certificate stores, such as the installation of a root certificate (Event ID 5038 on newer Windows versions). Correlate these events with the process responsible (Event ID 4688) and the user context. Establish a baseline of legitimate processes that modify certificate stores (e.g., system processes, legitimate installers, gpupdate.exe). Alert when a certificate is added by an unexpected process (e.g., powershell.exe, cmd.exe, rundll32.exe, or any executable running from a temporary or user-writable directory). Correlate with sensitive privilege use events (Event ID 4673) to add context."
          },
          "Anomalous network traffic to Certificate Revocation List (CRL) or Online Certificate Status Protocol (OCSP) endpoints that are rare, untrusted, or do not correspond to the certificate authorities expected within the enterprise.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "From Zeek dns.log and conn.log, profile all destination domains and IPs for CRL and OCSP traffic (typically on port 80). Establish a baseline of common and expected validation endpoints based on frequency and the CAs used by the organization. Use time series analysis or frequency analysis (e.g., identifying domains in the lowest 1st percentile of requests) to flag connections to new or rare validation endpoints. Correlate these network events with hosts that have recently executed newly observed signed binaries (from host logs) to identify potential validation attempts for maliciously acquired certificates."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
