[
  {
    "Is the adversary developing resources related to digital certificates for operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1587.003 - Digital Certificates": {
          "Identification of self-signed or unusually configured digital certificates used by external infrastructure communicating with the network.": {
            "Data": "Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Zeek ssl.log. Analyze certificates for self-signed properties, unusual subject/issuer fields, or short validity periods. Compare certificate hashes or serial numbers against threat intelligence feeds for known adversarial certificates."
          },
          "Network traffic encrypted with certificates exhibiting characteristics of adversarial self-signing or linked to known suspicious infrastructure.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for encrypted traffic (e.g., port 443/HTTPS). Correlate connections with Zeek ssl.log data. Identify connections using certificates flagged as suspicious based on characteristics or threat intelligence lookups. Use correlation analysis between source/destination IPs and certificate properties to identify clusters of suspicious activity."
          },
          "Identification of digital certificates used in network communication exhibiting statistical anomalies in fields such as subject common name length, organizational unit randomness, or validity period.": {
            "Data": "Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and parse Zeek ssl.log. Use descriptive statistics to analyze the characteristics of certificates observed (e.g., length of common name, number of organizational units, validity period in days). Calculate distributions, means, and standard deviations. Identify certificates whose characteristics fall outside several standard deviations from the norm or are statistically unusual compared to common public CA practices (e.g., extremely short validity, random-looking fields). Use correlation analysis to group similar certificates seen across different connections/time periods."
          },
          "Detection of the same self-signed or statistically similar certificate used across multiple distinct external IP addresses or domains communicating with the network.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and parse Zeek ssl.log. Identify self-signed certificates or group statistically similar certificates (e.g., based on partial hash matches, specific field values). For each distinct certificate/group, identify all associated destination IP addresses and domain names from correlated Zeek conn.log entries. Flag certificates/groups used across a minimum threshold of distinct, seemingly unrelated external IPs or domains as potential adversary infrastructure development/staging. Use frequency analysis to count the number of unique external hosts associated with a given certificate."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]