[
  {
    "Is the adversary developing resources for network access or persistence? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1584.003 - Virtual Private Server": {
          "Outbound network connections from internal systems to IP addresses identified as potentially compromised Virtual Private Servers or associated with known adversary C2 infrastructure hosted on VPS providers.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Join Zeek conn.log or http.log with Threat Intelligence feeds containing known malicious IP addresses, specifically those associated with compromised or adversary-controlled infrastructure hosted on VPS providers. Identify internal hosts initiating connections to these external IPs. Investigate the nature of the traffic (ports, protocols, volume)."
          },
          "Unusual outbound traffic patterns (volume, frequency, destination ports) from internal hosts consistent with C2 activity directed towards IPs associated with VPS providers.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for outbound connections to IP addresses resolving from DNS queries for suspicious domains or to IPs belonging to known VPS provider ranges, using ports and protocols often associated with C2 (e.g., unusual ports, frequent small transfers). Use time series analysis on connection volume and frequency per internal host to detect deviations from baseline."
          },
          "Execution of command-line tools or scripts on internal systems associated with cloud provider APIs or services targeting external infrastructure not part of standard internal operations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for execution of specific command-line interfaces (CLIs) like `aws`, `az`, `gcloud`, `docker`, `kubectl` on systems not authorized for cloud management. Analyze the command line arguments for interactions with external endpoints (e.g., using correlation analysis with known cloud API endpoints). Correlate with Zeek conn.log to identify outbound connections made by these processes to IP ranges associated with major cloud/VPS providers. Establish baseline usage of such CLIs and flag anomalous executions or destinations using frequency analysis."
          },
          "Unusual large outbound data transfers from internal systems to IP addresses associated with known VPS provider ranges, particularly from systems not typically involved in large external transfers.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, filtering for outbound connections to IP ranges belonging to major VPS/cloud providers. For these connections, aggregate data volume (bytes transferred) per internal source IP and destination IP over time. Use statistical methods (e.g., Inter-quartile range, percentile analysis) to identify outbound connections with data transfer volumes significantly exceeding the baseline for that specific internal host or for typical traffic to VPS ranges. Investigate sources of large, anomalous outbound transfers to potential VPS infrastructure."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]