[
  {
    "Is the adversary compromising external accounts to support targeting or operations? (TA0042 - Resource-Development)": {
      "Indicators": {
        "T1586 - Compromise Accounts": {
          "Inbound emails originating from external accounts previously identified as compromised or exhibiting characteristics of phishing attempts.": {
            "Data": "Zeek smtp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log for incoming emails. Identify sender domains/addresses. Compare sender addresses against known lists of compromised accounts or public breach data. Analyze subject lines and body content entropy and word frequency for phishing characteristics. Flag emails with low entropy, high frequency of suspicious terms, or from compromised accounts identified via threat intelligence feeds."
          },
          "Failed or successful login attempts to internal services using credentials known to have been part of external breaches or associated with compromised external accounts.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 and 4625 (Successful and Failed Logons) and Zeek conn.log for connections to internal services on typical login ports (e.g., 3389, 22, 443/VPN). Compare source IP addresses and account names against publicly available credential dumps or known compromised external accounts. Flag logins using credentials found in dumps or associated with previously identified compromised external accounts. Analyze login patterns using correlation analysis between failed/successful attempts and source IPs and credentials."
          },
          "Attempted credential validation against public-facing organization services (e.g., OWA, web portals) from external sources, especially those matching known breach patterns or threat intelligence.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log for connections to public-facing services accepting credentials. Extract source IP addresses and attempt to identify potential usernames from request data (if available). Compare IPs and potential usernames against threat intelligence feeds identifying sources of credential stuffing/brute force or known compromised accounts/credentials from breaches. Use time series analysis on login attempt frequency per source IP or per target account to detect credential stuffing or brute force attacks. Identify IP addresses or usernames with significantly higher login attempt rates than baseline using statistical outliers (e.g., Z-score, IQR)."
          },
          "Internal host activity involving the storage, processing, or transfer of large lists of potential credentials.": {
            "Data": "Windows Event ID 4688; Zeek files.log; Zeek conn.log",
            "Data Platform": "Endpoints; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes known to handle large text files or lists (e.g., scripting engines, text processors, archive utilities) or unusual command-line arguments related to credential processing. Monitor Zeek files.log for detection of files matching patterns of credential dumps being transferred internally or externally. Use descriptive statistics (file size, line counts if possible) and frequency analysis of command usage/file transfer types to identify activity outside of normal baselines. Correlate process execution with network connections in Zeek conn.log using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]