```json
[
  {
    "Is the adversary gathering credentials for reconnaissance purposes? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1589.001 - Credentials": {
          "Inbound network traffic or emails containing selectors (domains, IPs, file hashes) associated with known credential phishing infrastructure or campaigns.": {
            "Data": "Zeek smtp.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate domains, IPs, and URLs observed in Zeek smtp.log and http.log against high-confidence threat intelligence feeds for phishing. Analyze files transferred over HTTP (via Zeek files.log), calculate their hashes, and match them against known malicious file databases. Alert on any confirmed selector match and investigate all associated traffic and recipients."
          },
          "A high volume of inbound emails exhibiting structural similarities characteristic of a widespread phishing campaign, such as common sender patterns, subject lines, or link structures from newly registered domains.": {
            "Data": "Zeek smtp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log and http.log to extract and aggregate email metadata (sender, subject, mail-from domain, embedded links). Use descriptive statistics and clustering algorithms to group emails with similar features. Identify campaigns by finding a high frequency of emails with matching subject line keywords, similar sender top-level domains (TLDs), or URLs from newly registered or typo-squatted domains. Use correlation analysis to link these patterns across a large number of internal recipients, indicating a targeted campaign pattern."
          },
          "A significant spike in authentication failures across numerous user accounts on a public-facing service, originating from one or more external IP addresses, indicating credential stuffing or password spraying.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4625 (failed login) events from public-facing authentication servers (e.g., ADFS, VPN gateways), enriching with external source IP data from Zeek conn.log. Apply time series analysis to the overall failed login rate to detect anomalous spikes. For IPs generating high failure counts, calculate the ratio of unique accounts targeted per IP. A high ratio (e.g., >10 accounts from one IP in an hour) is characteristic of password spraying. Use box-plots or the Inter-Quartile Range (IQR) method to identify outlier IPs based on the number of accounts they target."
          },
          "Anomalous enumeration activity against public-facing login portals or authentication APIs, suggesting an adversary is attempting to validate a list of potential email addresses or usernames.": {
            "Data": "Zeek http.log; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for HTTP POST requests to known login endpoints. Identify external source IPs that generate a high volume of requests that result in varied server responses which could differentiate between valid and invalid usernames. Correlate these web requests with backend authentication failures (Windows Event ID 4625), specifically looking for a high rate of failures with status codes indicating 'user does not exist'. Calculate the entropy of usernames being tested from a single IP; a high entropy may suggest testing a diverse list. Alert on IPs exhibiting high rates of this probing behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```