
[
  {
    "Is the adversary developing resources, such as acquiring tools, for targeting? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1588.002 - Tool": {
          "Network connections to known tool hosting sites, or execution of processes with names/hashes matching known adversary tools.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate destination IPs/domains from Zeek conn.log with high-confidence threat intelligence feeds of sites known for hosting adversary tools (e.g., specific GitHub repositories, C2 distribution points) and alert on matches. Concurrently, monitor Windows Event ID 4688 for created process names that match a list of known malicious tool executables (e.g., mimikatz.exe, procdump.exe, psexec.exe). If file hashing is available (e.g., via Sysmon integration), compare process hashes against a repository of known malicious tool hashes."
          },
          "Execution of commands or scripts with argument patterns characteristic of specific offensive security tools or frameworks (e.g., Cobalt Strike, Metasploit, PowerSploit).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Utilize regular expressions to scan the command-line argument field in Windows Event ID 4688 logs for patterns uniquely associated with known offensive tools. Examples include: PowerShell commands using `IEX (New-Object Net.WebClient).DownloadString`, specific argument structures for tools like AdFind, or base64-encoded commands frequently used by frameworks like Cobalt Strike or Empire. Maintain and regularly update a library of these tool-specific command-line signatures. Use correlation analysis to link multiple related command executions into a single incident."
          },
          "A sequence of actions indicating tool staging, such as a file download followed by execution from a non-standard or temporary location.": {
            "Data": "Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network and host data to detect tool staging behavior. Monitor Zeek files.log for executable files downloaded from the internet, noting the destination host. On that host, monitor Windows Event ID 4688 for process creation events. Flag sequences where: 1) An executable is downloaded; 2) A process is subsequently created from a temporary or uncommon directory (e.g., C:\\Users\\Public, %TEMP%, C:\\Perflogs); 3) The process name is rare or has low prevalence across the environment. Use time series analysis to correlate these events within a short window (e.g., 1-5 minutes)."
          },
          "Anomalous use of legitimate administrative protocols (e.g., SMB, WinRM, RDP) by non-administrative users or from non-standard workstations, indicating tool-driven remote execution or lateral movement.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal administrative traffic by mapping which users and hosts typically use protocols like SMB, WinRM, and RDP, and their common destinations. Monitor Zeek conn.log (for connections on ports 445, 5985, 5986, 3389) and Windows Event ID 4624 (Logon Types 3 for network and 10 for RDP) for deviations. Flag events such as a marketing department workstation using WinRM to connect to a server, or a standard user account making an unusually high number of RDP connections to different hosts. Use descriptive statistics and percentile analysis on connection counts and source-destination pairings to identify outliers. A linear regression model can help predict expected traffic patterns and flag significant deviations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
