
[
  {
    "Is the adversary developing resources like malicious domains for targeting or operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1584.001 - Domains": {
          "DNS queries or network connections involving domains present on high-confidence threat intelligence feeds for malicious activity, hijacking, or being newly registered for suspicious purposes.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate all queried domains from Zeek dns.log and server names from Zeek conn.log (via SNI) against multiple threat intelligence feeds. Prioritize feeds that specifically track newly registered domains (NRDs), typosquatted domains, and domains associated with known malicious infrastructure or hijacking events. Alert on any matches and investigate the nature of the internal traffic to these destinations."
          },
          "DNS queries for domains that structurally mimic legitimate company or partner domains, indicative of typosquatting, homograph attacks, or combosquatting.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of legitimate company and key partner domains. For every unique domain queried in Zeek dns.log, perform pattern matching to detect potential abuse. Use fuzzy string matching (e.g., calculate Levenshtein distance) to identify typosquats (e.g., 'microsft' vs 'microsoft'). Use regular expressions to detect combosquats (e.g., 'yourcompany-login', 'support-yourcompany'). Alert on domains that fall below a similarity threshold or match known malicious patterns."
          },
          "Anomalous DNS queries for newly observed or syntactically suspicious subdomains under a legitimate, but potentially compromised, corporate domain, indicating potential domain shadowing.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish and maintain a historical baseline of all known-good, legitimate subdomains for company-owned domains. Monitor Zeek dns.log in real-time to identify any query for a previously unobserved subdomain of a legitimate domain. Analyze the structure of new subdomains using entropy calculations to flag random-looking strings (e.g., 'k4f9z1.yourcompany.com'). Correlate the appearance of a new suspicious subdomain with multiple internal hosts querying it within a short timeframe, which may indicate active use."
          },
          "DNS responses for legitimate internal or external company domains resolving to unexpected or recently changed IP addresses outside of known corporate or trusted cloud infrastructure, indicating potential DNS hijacking.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an authoritative allow-list of IP ranges (CIDR blocks) for all company-owned domains and trusted services. Monitor Zeek dns.log for all A/AAAA responses for these domains. Alert immediately if a response resolves a company domain to an IP address outside the established allow-list. Use time series analysis on resolved IPs per domain to detect sudden, widespread changes, which could indicate a successful hijacking event affecting multiple users."
          },
          "Internal network connections to domains exhibiting characteristics of being newly created for malicious purposes, such as very recent SSL certificate issuance or unusually low DNS record TTLs.": {
            "Data": "Zeek dns.log; Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For domains newly observed in Zeek dns.log, correlate with data from Zeek ssl.log. Flag domains using SSL certificates issued within a very recent timeframe (e.g., last 3 days), especially those from free Certificate Authorities. Analyze TTL values in DNS responses from Zeek dns.log; unusually low TTLs (e.g., < 300 seconds) can be a sign of fast-flux or newly setup infrastructure designed for evasion. Use correlation analysis to score and alert on domains exhibiting multiple of these characteristics (e.g., newly seen domain + newly issued certificate + low TTL)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
