[
  {
    "Does the adversary possess compromised email accounts that could be used to target the organization? (TA0042 - Resource Development)": {
      "Indicators": {
        "Receipt of emails originating from external accounts previously identified as compromised, containing malicious links or attachments.": {
          "Data": "Zeek dns.log; Zeek http.log; Windows Event ID 4688",
          "Data Platform": "Network devices, Endpoints",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek dns.log, http.log, and Windows Event ID 4688 logs for activity originating from user systems (Endpoints) or servers (Servers) triggered by interaction with incoming emails from external sources. Correlate destination domains/IPs and process names against lists of known malicious indicators (Threat Intelligence). Use clustering or anomaly detection on connection patterns to identify unusual traffic volumes or destinations associated with email interaction (e.g., unexpected process creating outbound network connections after opening a document)."
        },
        "Unusual external-to-internal email traffic volume or patterns to key personnel or departments known to be targets.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek conn.log for SMTP (port 25/587) connections from external IPs to internal mail servers or clients. Use time series analysis to identify unusual spikes in connection volume or connection attempts targeting specific internal users or groups, potentially indicating large-scale campaigns. Employ statistical methods (e.g., descriptive statistics, outlier detection using IQR) on source IPs, connection frequency, and target recipients to identify anomalous email traffic patterns potentially indicative of campaigns using compromised accounts."
        },
        "Unusual outbound SMTP traffic originating from internal hosts not typically configured for sending external email.": {
          "Data": "Zeek smtp.log; Windows Event ID 4688; Windows Event ID 5156",
          "Data Platform": "Network devices, Endpoints",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek smtp.log for outbound connections originating from internal source IPs not typically associated with sending external email. Correlate with Windows Event ID 4688 (Process Creation) and 5156 (Network Connection) on endpoints to identify processes initiating these connections. Establish a baseline of normal outbound email sending hosts and volumes using frequency analysis and identify deviations or spikes. Investigate traffic spikes or sending from unapproved hosts, potentially indicating compromise or misuse of internal systems facilitated by compromised external accounts."
        },
        "Attempted or successful logons to internal services (e.g., OWA, VPN, internal applications) using usernames matching known or suspected compromised external email accounts.": {
          "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
          "Data Platform": "Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event IDs 4624 (Successful Logon) and 4625 (Failed Logon) on servers hosting internal services (OWA, VPN gateways, application servers) for logon attempts using usernames that match known or suspected compromised external email accounts (e.g., from threat intelligence feeds, previous incidents). Correlate with Zeek conn.log to identify source IPs and connection details. Use correlation analysis to link failed/successful attempts to specific usernames and source IPs over time. Alert on any internal logon attempts using usernames associated with known external compromises."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]