[
  {
    "Is the adversary gathering credentials for reconnaissance purposes? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1589.001 - Credentials": {
          "Analysis of email gateway logs showing emails with characteristics of credential phishing (e.g., specific keywords, embedded links to known malicious domains, high volume targeting).": {
            "Data": "Zeek smtp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log and http.log for emails containing links to domains with low reputation or known malicious activity, or embedded login forms. Identify high-volume campaigns targeting multiple internal users. Use statistical analysis (e.g., frequency distribution) of sender domains, subject lines, and link patterns to identify outliers characteristic of phishing campaigns."
          },
          "Multiple failed authentication attempts or successful logins from unusual source IPs or locations using valid internal accounts on public-facing services (e.g., OWA, VPN, remote access portals).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (successful) and 4625 (failed) on authentication servers (AD, remote access gateways). Correlate login events with source IPs from Zeek conn.log for public-facing services. Analyze failed/successful login rates per user/IP. Use time series analysis or IQR to detect unusual login volumes or times for specific accounts, especially from external IPs identified via conn.log or associated with known malicious activity."
          },
          "Repeated authentication attempts against public-facing services (e.g., VPN, OWA) originating from a limited set of external IPs, potentially sourced from credential dumps or lists.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify external source IP addresses attempting authentication against public-facing services (VPN, OWA) by filtering Zeek conn.log and correlating with Windows Event ID 4625 on authentication servers. Cluster source IPs showing a high volume of failed attempts targeting multiple distinct user accounts within a short timeframe. Calculate the ratio of unique users targeted per source IP to identify IPs testing credential lists. Flag source IPs exceeding a threshold for failed attempts or targeting a high number of unique users."
          },
          "Internal systems connecting to external websites or services known to host publicly available data dumps, credential lists, or public code repositories often used for credential gathering.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and http.log for connections originating from internal network segments to domains or IP addresses on a watchlist of known data dump sites, credential markets, or specific public code repository URLs often abused for leaks (e.g., Pastebin, GitHub gist). Use frequency analysis to identify repeated connections to these sites. Correlate with user activity logs if available to determine the user responsible for the connection. Investigate internal systems making connections to these external resources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]