```json
[
  {
    "Is the adversary acquiring resources, such as vulnerabilities, to support operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1588.006 - Vulnerabilities": {
          "External network scanning originating from IP addresses or infrastructure known to be associated with malicious actors, vulnerability scanning services, or specific threat groups.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses from all inbound connection attempts recorded in Zeek conn.log against high-confidence cyber threat intelligence (CTI) feeds of known malicious scanners, botnets, and threat actor infrastructure (updated hourly/daily). Maintain an allow-list for legitimate, authorized external scanners and alert on all other correlated scanning activity from malicious sources."
          },
          "Inbound network traffic matching signatures or patterns of common vulnerability scanning tools or specific exploit payloads used for non-destructive discovery.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log records for patterns in URI, headers (especially User-Agent), and request bodies that are characteristic of common vulnerability scanning tools (e.g., Nmap, Nikto, Acunetix, Burp Suite). Monitor for traffic patterns indicative of specific vulnerability checks (e.g., requests for '.env' files, Log4j JNDI strings, Heartbleed probes). Use regular expressions against a maintained signature set for matching. Alert on traffic matching these patterns from unauthorized external sources."
          },
          "A single external source exhibiting anomalous scanning behavior, such as connecting to an unusually high number of ports or hosts, or targeting low-frequency services across the network perimeter.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Zeek conn.log data by source IP over short time windows (e.g., 5-15 minutes). For each source IP, calculate descriptive statistics such as the count of distinct destination ports and the count of distinct destination hosts. Establish baselines for these metrics and use percentile analysis or standard deviation thresholds (e.g., > 3 standard deviations above the mean) to flag sources exhibiting horizontal (many hosts, one port) or vertical (one host, many ports) scanning behavior. Use box-plots to visualize distributions and identify outliers. Prioritize alerts for sources probing ports that receive very little legitimate traffic."
          },
          "A widespread, low-and-slow external scanning campaign from multiple disparate sources targeting a specific, potentially vulnerable service across many organizational assets.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate connection attempts by destination port and service across all external source IPs over a longer period (e.g., 24-48 hours). Use time series analysis to identify a statistically significant increase in connection attempts to a specific service, especially one with a recently disclosed vulnerability (n-day). Correlate the timing of the traffic surge with public vulnerability disclosure dates. This can indicate that adversaries are actively searching for unpatched systems to exploit."
          },
          "An internal host, especially a non-administrative workstation, executing reconnaissance commands or connecting to multiple internal systems in a pattern indicative of vulnerability discovery for lateral movement.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation (Windows Event ID 4688) involving network scanning tools (nmap.exe, nessus.exe) or native discovery utilities (`nltest`, `Test-NetConnection`) on hosts not associated with IT administration roles. Correlate such process execution with subsequent network traffic (Zeek conn.log) from that host to a high number of internal IPs or ports. Establish baselines for normal network behavior per host/role and use Inter-Quartile Range (IQR) or correlation analysis to detect outlier hosts acting as internal scanners, which may indicate an adversary is developing resources for lateral movement."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```