
[
  {
    "Does the adversary possess compromised email accounts that could be used to target the organization? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1586.002 - Email Accounts": {
          "Receipt of emails containing known malicious indicators, such as senders from a list of compromised accounts, or links and attachments matching threat intelligence feeds.": {
            "Data": "Zeek dns.log; Zeek http.log; Zeek files.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate metadata from inbound emails against high-confidence threat intelligence feeds. Inner join sender addresses from Zeek smtp.log against lists of known compromised accounts. Inner join destination domains/IPs from Zeek dns.log and http.log (from email links) and file hashes from Zeek files.log (from attachments) against lists of known malicious indicators. Alert on any confirmed match."
          },
          "Receipt of emails containing structural patterns common to phishing campaigns, such as the use of dynamic DNS domains, URL shorteners, or high-risk attachment types.": {
            "Data": "Zeek http.log; Zeek files.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze email content flowing through the network for common phishing patterns. Use regular expressions and curated lists to detect links using known dynamic DNS provider domains (e.g., *.ddns.net, *.duckdns.org) or common URL shorteners in Zeek http.log. Scan Zeek files.log to identify and flag high-risk attachment types (e.g., .iso, .vhd, .lnk, password-protected .zip files) frequently used in modern phishing campaigns. Correlate multiple weak indicators (e.g., new sender + risky attachment type) to increase alert fidelity."
          },
          "Anomalous inbound email traffic patterns, such as a sudden spike in volume from new or low-reputation external domains targeting a specific department or set of individuals.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal SMTP traffic volume and sender-recipient relationships using historical Zeek conn.log and smtp.log data. Employ time series analysis to detect anomalous spikes in email volume from external sources. Use frequency analysis to identify sender domains or IPs with no prior history that suddenly begin sending email to targeted internal groups (e.g., Finance, HR). Use correlation analysis to link low-reputation senders with high-volume, targeted email campaigns, and investigate for phishing activity."
          },
          "Attempted or successful credential stuffing attacks against internal services using usernames that match publicly available lists of breached email accounts.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a curated list of usernames/emails from public data breaches relevant to the organization's user base. Monitor Windows Event IDs 4625 (Failed Logon) and 4624 (Successful Logon) on internet-facing authentication services (e.g., OWA, VPN, cloud portals). Correlate the username field in these events against the list of breached accounts. Use descriptive statistics to flag a high rate of failures for a listed account from a single source IP, followed by a success, which strongly indicates a successful credential stuffing attack."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
