[
  {
    "Is the adversary developing resources using compromised cloud accounts? (TA0042 - Resource-Development)": {
      "Indicators": {
        "T1586.003 - Cloud Accounts": {
          "Unusual volume of network traffic or connections to known cloud storage providers (e.g., Dropbox, OneDrive, S3) from internal hosts, particularly those not typically involved in such activity.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections and data transfer volume to IPs/domains of major cloud storage providers. Use Zeek dns.log to identify cloud storage domains being resolved internally. Calculate baseline traffic volume using time series analysis for specific internal hosts/segments. Alert on statistically significant deviations (e.g., using standard deviation or IQR) from typical upload/download patterns from unexpected sources."
          },
          "Anomalous authentication attempts or sessions initiated from internal systems targeting cloud service APIs or management interfaces.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections from internal hosts to known IP ranges or domains associated with cloud service APIs/management interfaces. Use Zeek dns.log to track lookups for these services. Identify source hosts/users exhibiting connection patterns inconsistent with their role (e.g., using correlation analysis to find unusual co-occurrence of internal host activity and cloud management connections). Look for unusual ports or protocols used for access."
          },
          "Outbound network connections from internal hosts to domains or IP ranges associated with cloud messaging or bulk email service providers.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and dns.log for outbound connections and DNS lookups to domains/IPs associated with cloud messaging/bulk email services (e.g., SendGrid, Twilio, AWS SES/SNS). Maintain a baseline of approved services and typical usage. Flag connections to unapproved services or from internal hosts/users not typically involved in sending bulk communications using frequency analysis. Identify and investigate high volumes of connections from unusual sources."
          },
          "Internal hosts making connections to multiple distinct categories of cloud services (e.g., storage, compute, messaging, management APIs) within a limited timeframe.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log to identify internal source IPs/hosts connecting to various cloud provider domains/IPs. Categorize cloud connections by service type (e.g., storage, compute, messaging, management). Group connections by source host and time window (e.g., 1 hour). Flag hosts exhibiting connections to multiple distinct cloud service categories within the timeframe using correlation analysis. Investigate such co-occurring connections from unusual hosts or patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]