[
  {
    "Is the adversary developing resources for operations, specifically DNS infrastructure? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583.002 - DNS Server": {
          "Outbound DNS queries from internal systems to non-corporate, external DNS servers.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Zeek dns.log. Filter for outbound DNS queries originating from internal subnets destined for public IP addresses (not known corporate/approved DNS servers). Identify destinations by IP and requested domain. Use frequency analysis and correlation with threat intel feeds to flag unusual or malicious external DNS destinations."
          },
          "High volume of short, anomalous DNS queries to unusual external destinations, potentially indicative of DNS tunneling or C2 via adversary-controlled DNS.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Zeek dns.log. Analyze query volume and characteristics (e.g., query name length, query type, frequency per host) for external destinations. Use time series analysis, entropy measures on query names, or frequency analysis to identify patterns consistent with DNS tunneling or high-frequency C2 lookups to non-standard external IPs."
          },
          "Internal systems attempting to use an external IP address as their DNS resolver, bypassing standard corporate DNS servers.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections originating from internal systems destined for TCP/UDP port 53 on IP addresses that are NOT designated corporate DNS servers. Identify source internal IPs and destination external IPs. Flag internal hosts attempting to use non-standard external DNS resolvers. Calculate the frequency of such attempts by source host and external IP; identify persistent attempts using time series analysis."
          },
          "Internal systems querying domains with characteristics often associated with malicious infrastructure (e.g., very young domains, low reputation, randomized strings) that resolve via external DNS.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log, focusing on queries resolved by non-corporate external DNS servers (identified via other means or by filtering for responses from external IPs). For these queries, evaluate the requested domain names. Use frequency analysis, entropy measures on domain name strings, and correlation with domain reputation services or lists of newly registered domains (<90 days old) to identify suspicious patterns. Flag internal hosts querying domains matching these characteristics via external DNS."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]