
[
  {
    "Is the adversary compromising external accounts to support targeting or operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1586 - Compromise Accounts": {
          "Login attempts to internal or public-facing services using credentials (usernames, passwords) or originating from source IPs known to be part of credential breach dumps or CTI feeds for credential abuse.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate usernames from login events (Windows Event IDs 4624, 4625) and source IPs (from Zeek conn.log/http.log) against a frequently updated database of breached credentials and a CTI feed of IPs known for credential stuffing. To protect privacy, check usernames against breach lists and alert on matches for high-privilege accounts. Alert on any login attempt, successful or failed, originating from a source IP with a poor reputation for credential abuse. Investigate all associated activity."
          },
          "Login attempts using common password spraying lists or exhibiting tool-specific artifacts, such as distinctive User-Agent strings or request sequences from known credential attack frameworks.": {
            "Data": "Windows Event ID 4625; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for password spraying patterns by identifying a high volume of failed logins (Windows Event ID 4625) across many different user accounts originating from a small set of IPs, where the password is suspected to be static. In parallel, analyze Zeek http.log for User-Agent strings or specific HTTP header patterns associated with credential attack tools like Hydra, Medusa, or other offensive security frameworks. Maintain and update a list of these tool signatures and common spray passwords for pattern matching."
          },
          "A high rate of failed login attempts from a single or distributed set of source IPs against single or multiple accounts, characteristic of credential stuffing or brute-force attacks.": {
            "Data": "Windows Event ID 4625; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each public-facing login service, establish a baseline for the rate of failed logins (Windows Event ID 4625) per hour. Use time series analysis to detect statistically significant spikes in failures. Generate descriptive statistics for failed login counts grouped by source IP and by target username over short time windows (e.g., 5 minutes). Use Inter-Quartile Range (IQR) or Z-scores to identify outlier IPs (brute-forcing one account) or outlier usernames (being targeted by many IPs in a credential stuffing attack)."
          },
          "A successful login that occurs immediately after a series of failures from the same source, or a successful login that creates an 'impossible travel' scenario, suggesting a compromised credential was just validated or is being used from an anomalous location.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful logins (Windows Event ID 4624) with preceding failed logins (Windows Event ID 4625) from the same source IP for the same account within a short time frame (e.g., 15 minutes). Separately, track the geolocation of successful logins for each user over time using Zeek conn.log source IPs. Use correlation analysis on login timestamp and geolocation pairs to detect impossible travel scenarios (e.g., login from one continent followed minutes later by a login from another). Build a baseline of normal locations for each user and alert on logins from new or rare countries/regions."
          },
          "Inbound emails originating from trusted external partner domains that exhibit unusual linguistic patterns, mismatched sender-header information, or contain links to newly registered domains, suggesting a partner's email account was compromised.": {
            "Data": "Zeek smtp.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log metadata for emails from known trusted external domains (e.g., partners, clients). Flag emails that fail SPF/DKIM/DMARC checks, as this can indicate spoofing or a compromised mail server. For passed emails, analyze message characteristics for anomalies compared to a sender's baseline, such as sudden changes in language complexity (entropy), topic, or inclusion of urgent financial requests. Correlate domains found in email links with Zeek dns.log data to identify recently created domains (e.g., registered within the last 30 days) that are more likely to be malicious."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
