[
  {
    "Is the adversary developing resources (acquiring infrastructure) for targeting? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583 - Acquire Infrastructure": {
          "Internal connection attempts to newly registered, suspicious domains potentially acquired by the adversary.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for queries to domains and Zeek conn.log for outbound connections to these domains that were registered within the last 30-90 days (requires external WHOIS data integration or feed). Prioritize domains with privacy-protected WHOIS, or those hosted on recently provisioned IP addresses. Use statistical analysis (e.g., frequency of access, volume of data) to identify unusual connection patterns to these new domains from internal assets."
          },
          "Network traffic patterns originating from external IPs identified in threat intelligence feeds as associated with adversary scanning or C2 infrastructure.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses in Zeek conn.log connecting to organization assets with threat intelligence feeds containing known scanning IPs or adversary C2 infrastructure IPs. Identify connection patterns (e.g., entropy of destination ports/services accessed from a single source IP, connection frequency, duration) indicative of reconnaissance or initial probing from acquired infrastructure."
          },
          "Outbound network connections to cloud service IP ranges featuring newly observed or self-signed SSL/TLS certificates, or services with unusual client/server TLS fingerprints (JA3/JA3S).": {
            "Data": "Zeek ssl.log; Zeek conn.log; Zeek x509.log; Windows Event ID 5156; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log and x509.log for outbound connections to known cloud provider IP address ranges. Identify connections using certificates with recent `not_valid_before` dates (e.g., created in the last 7-30 days), self-signed issuers, or unusually short validity periods. Monitor for new or rare JA3/JA3S hashes in Zeek ssl.log for these connections compared to an established baseline. Correlate suspicious TLS sessions (from Zeek data) with network connection events (Windows Event ID 5156) and process creation events (Windows Event ID 4688) on source Endpoints/Servers to identify the initiating process and its command line."
          },
          "Internal systems making outbound connections to IP addresses or domains associated with known anonymization services (e.g., TOR, unapproved commercial VPNs, residential proxies) or recently identified botnet C2 infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries to domains associated with known anonymization services (TOR, unapproved VPNs, residential proxies) or botnet C2s, using curated threat intelligence feeds. Analyze Zeek conn.log for outbound connections to IP addresses resolved from these domains or directly to IPs listed in such feeds. Use time series analysis to detect spikes in such connections. Correlate these network activities with process creation data (Windows Event ID 4688) on involved Endpoints to identify the responsible processes and assess legitimacy by comparing against approved software and user roles."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]