[
  {
    "Is the adversary developing resources for targeting or operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583.001 - Domains": {
          "Internal network traffic communicating with newly registered domains that are similar to organization domains or common services (typosquatting, homoglyphs).": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Obtain a list of newly registered domains similar to organizational domains or common services using external sources (WHOIS, passive DNS). Query Zeek dns.log and conn.log for internal lookups and connections to these domains. Use correlation analysis to identify endpoints/users frequently interacting with suspicious similar domains."
          },
          "Internal network traffic communicating with domains identified by threat intelligence or passive DNS as newly registered, potentially used for C2, phishing, or malware delivery.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Obtain a list of newly registered domains with low reputation or flagged by Threat Intelligence feeds/passive DNS. Query Zeek dns.log and conn.log for internal lookups and connections to these domains. Use descriptive statistics on connection volume and duration for these domains to identify unusual patterns (e.g., high volume, persistent connections indicative of C2)."
          },
          "Domains resolved or contacted by internal hosts exhibiting anomalous behavior based on frequency or timing analysis.": {
            "Data": "Zeek dns.log; Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For hosts/users flagged by other behavioral anomalies (identified via Windows Event IDs or other means), analyze their historical Zeek dns.log and conn.log activity. Use time series analysis to identify communication with domains that deviate significantly from their established baseline frequency, volume, or timing patterns. Flag interactions with domains occurring outside of normal business hours or during periods of inactivity."
          },
          "Domains exhibiting Fast Flux characteristics (rapidly changing IP addresses) or contacted over non-standard ports/protocols.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log to monitor the number of unique IP addresses a domain resolves to over time. Use statistical methods (e.g., calculating the number of unique IPs per domain per hour) to identify domains resolving to an unusually high number of IPs within a short timeframe (Fast Flux). Additionally, examine Zeek conn.log for connections to resolved domains occurring on ports or protocols not commonly associated with standard services (e.g., ports > 1024), using frequency analysis to identify rare port usage for domains."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]