[
  {
    "Is the adversary developing resources for attack, such as a botnet? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1584.005 - Botnet": {
          "Internal systems exhibiting suspicious outgoing connections or communication patterns consistent with botnet C2 activity.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for connections or DNS requests from internal hosts to known or suspicious C2 infrastructure IPs/domains using threat intelligence feeds. Analyze Windows Event ID 4688 and 5156 for unusual outgoing connections from endpoints/servers, particularly from executables with low prevalence or unsigned binaries. Use correlation analysis to link suspicious network activity with process execution."
          },
          "Increased volume of network traffic or suspicious connection attempts against public-facing services consistent with attack activity from multiple sources.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for anomalous traffic volume from external sources targeting public-facing services. Analyze connection sources and destinations for patterns indicative of coordinated activity from diverse origins. Use time series analysis to detect sudden surges in traffic volume or connection attempts that deviate significantly from baseline levels, potentially indicative of DDoS activity."
          },
          "Execution of suspicious processes on internal systems exhibiting network communication patterns characteristic of botnet activity (e.g., rapid sequential connections, beaconing).": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for execution of processes with low prevalence, unsigned binaries, or suspicious parent-child relationships. Correlate suspicious process executions with network connection events (Windows Event ID 5156) and Zeek conn.log/dns.log. Look for patterns like fixed-interval connections (beaconing - time series analysis), rapid connection attempts to multiple external IPs (scanning/spreading), or connections to known malicious infrastructure. Use frequency analysis to identify processes with unusual outbound connection counts or rates."
          },
          "Detection of large volumes of potentially malicious emails or spam originating from a diverse set of external sources, potentially indicative of a botnet being used for spamming/phishing campaigns.": {
            "Data": "Zeek smtp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smtp.log for a sudden increase in inbound email volume, particularly emails with similar subjects, bodies, attachments, or links, originating from a large number of distinct external IP addresses. Analyze source IP entropy for inbound email campaigns to identify low entropy (coordinated sources). Extract URLs from emails (`smtp.log`) and analyze subsequent connections (`http.log`) to check against threat intelligence feeds for phishing/malicious sites. Use clustering techniques on email content and source IPs to identify large-scale campaigns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]