[
  {
    "Is the adversary developing resources, such as acquiring tools, for targeting? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1588.002 - Tool": {
          "Network connections to known tool hosting sites, malware repositories, or C2 servers associated with specific tools (e.g., Cobalt Strike) prior to observed adversary activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log with threat intelligence feeds containing known URLs/IPs for tool hosting, distribution, or C2 infrastructure associated with specific adversary tools (e.g., Cobalt Strike, Metasploit modules). Identify unique destination IPs/domains seen in connection logs that match TI feeds. Analyze temporal correlation with other suspicious network activity."
          },
          "Presence or execution of known adversarial tools (e.g., PsExec, licensed penetration testing tools) identified via host process creation or network traffic patterns characteristic of the tool.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events related to known adversarial tools (e.g., psexec.exe, powershell.exe with specific command line arguments characteristic of tools, names of cracked commercial tools). Correlate host activity with Zeek logs for characteristic tool traffic patterns (e.g., specific C2 protocols, high frequency beacons). Use frequency analysis and anomaly detection on process names/command lines to identify rare or unusual occurrences."
          },
          "Execution of processes with command-line arguments indicative of tool setup, licensing attempts, or configuration, not aligned with standard software deployment.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) on endpoints and servers for process names and command line arguments that match known patterns for tool installation/setup (e.g., specific file paths, arguments referencing license files or activation, unpacking utilities) or processes with low prevalence across the environment. Use frequency analysis of command line arguments/hashes to identify rare occurrences."
          },
          "Network traffic patterns using common administrative protocols (e.g., SMB, WinRM, RDP) originating from systems or user accounts not typically involved in such administrative activity or exhibiting anomalous connection frequencies/destinations potentially indicating tool use.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections using administrative ports (e.g., SMB 445, WinRM 5985/5986, RDP 3389). Correlate with Windows Event ID 4624 (network/RDP logons - Type 3, 10) to identify the originating user/system, and Windows Event ID 4688 to see originating process. Analyze the frequency, duration, and source/destination pairs of these connections. Use correlation analysis to identify administrative connections originating from unexpected sources or times based on baseline behavior. Use statistical methods (e.g., descriptive statistics) to profile normal administrative traffic and identify deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]