[
  {
    "Is the adversary developing resources or capabilities to support their attack? (TA0042 - Resource-Development)": {
      "Indicators": {
        "T1587 - Develop Capabilities": {
          "Observation of network traffic patterns or host process execution consistent with the initial delivery or execution of a custom developed tool or malware.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and potential file logs for suspicious file transfers (e.g., unusual extensions, sizes, destinations) or initial C2 beaconing patterns. Analyze Windows Event ID 4688 for process creation events where the process name or path is unusual or combined with suspicious network connections identified in Zeek logs. Use frequency analysis and clustering on file hashes (if available in Zeek) or process names to identify rare occurrences."
          },
          "Network connections involving digital certificates or infrastructure known to be newly associated with the adversary's operations, potentially indicating new developed capabilities.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for connections presenting self-signed or recently issued certificates to unfamiliar domains. Correlate certificate serial numbers and issuer information with threat intelligence feeds. Use frequency analysis on certificate issuers and serial numbers to identify rare or unique certificates observed in network traffic. Investigate connections (Zeek conn.log) utilizing these flagged certificates."
          },
          "Unusual network protocol/port combinations or process execution characteristics not previously observed, potentially indicating a newly deployed custom capability.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baseline network traffic by protocol and port using Zeek conn.log. Identify connections using statistically rare protocol/port combinations or destination ports not commonly used (frequency analysis). Monitor Windows Event ID 4688 for process creation with rare process names, paths, or command-line arguments (frequency analysis across the environment). Use correlation analysis to link rare processes with unusual network connections identified via Zeek logs."
          },
          "Connections to external IP addresses or domains that are newly observed in the environment, exhibiting characteristics of C2 or data transfer.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track all external destination IP addresses and queried domains observed in Zeek conn.log and dns.log. Maintain a history of previously observed external destinations per host or network segment. Flag connections to destinations that are statistically rare or newly observed across the network (frequency analysis, time series analysis for first seen timestamp). Analyze these connections for C2 or data transfer patterns (e.g., beaconing frequency, data volume using descriptive statistics on bytes sent/received). Correlate with Windows Event ID 5156 or 4688 to identify the source process."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]