[
  {
    "Is the adversary developing resources, such as Virtual Private Servers, for use in operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583.003 - Virtual Private Server": {
          "Threat intelligence feeds identifying VPS infrastructure characteristics matching known adversary patterns.": {
            "Data": "Threat Intelligence Feed",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Ingest threat intelligence feeds containing indicators (IPs, domains, certificate hashes, service banners) associated with adversary-acquired VPS infrastructure. Cross-reference historical and current internal network logs (e.g., Zeek conn.log, Zeek ssl.log) against these indicators."
          },
          "Outbound connections from the organization's network to IP addresses or domains associated with known or newly identified suspicious VPS infrastructure.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and ssl.log for outbound connections to IP addresses or domains identified in threat intelligence feeds or exhibiting unusual characteristics (e.g., connections to rare ports, short-lived connections to newly registered domains). Use frequency analysis or outlier detection on destination IPs/domains and ports to identify anomalous connections."
          },
          "Outbound network traffic exhibiting patterns consistent with C2 communication (e.g., unusual ports, periodic connections, low volume) directed towards IP addresses or domains newly observed or lacking reputation.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn, dns, http, ssl) for outbound connections. Identify connections on unusual ports (frequency analysis), with fixed periodic timings (time series analysis), low data volume (descriptive statistics from conn.log), or to domains with low DNS reputation or recent registration dates (correlate dns.log with external lookups). Compare connection characteristics against a baseline of normal traffic patterns using outlier detection or correlation analysis."
          },
          "Outbound connections exhibiting suspicious SSL/TLS certificate properties (e.g., self-signed, invalid, newly created) or distinct service banners associated with known C2 frameworks.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek ssl.log and x509.log for outbound TLS/SSL connections. Extract certificate details and check for suspicious properties like self-signed, expired/invalid, or very recent issuance dates. Analyze Zeek conn.log for specific service banners on non-standard ports. Compare identified certificate properties or banners against threat intelligence feeds and known C2 framework signatures. Use frequency analysis on certificate issuers, subjects, or validity periods to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]