[
  {
    "Is the adversary acquiring resources, such as vulnerabilities, to support operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1588.006 - Vulnerabilities": {
          "Observation of external scanning activity targeting known vulnerabilities on public-facing infrastructure.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log from public-facing devices. Identify connections targeting unusual ports or paths, or patterns indicative of scanning tools. Correlate source IPs with known scanners or threat intel feeds. Use frequency analysis or time series analysis to identify spikes in connection attempts to vulnerable services."
          },
          "Unusual internal reconnaissance activity or testing behavior targeting specific software/hardware potentially vulnerable.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for execution of known vulnerability scanning or testing tools. Monitor Windows Event ID 4663 and Zeek logs for unusual access attempts or connection patterns to specific internal systems, services, or files potentially targeted based on acquired vulnerability information. Use correlation analysis to link internal scanning activity to external recon or prior access events."
          },
          "Network traffic attempting connections to known vulnerable services or ports, especially targeting specific versions identified as vulnerable.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to ports commonly associated with vulnerable services (e.g., outdated RDP, SMB, web server versions). Analyze Zeek http.log for requests attempting to access known vulnerable paths or using specific HTTP headers/methods associated with exploits. Analyze Zeek ssl.log for client/server hellos potentially revealing software versions. Use correlation analysis to link connection attempts to known vulnerable services or versions identified through external vulnerability scanning data or intel feeds. Use frequency analysis on destination ports/services to identify unusual targeting patterns."
          },
          "Anomalous process execution or network connections on hosts known to run specific software versions with publicly disclosed vulnerabilities.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify internal hosts running software versions with known, recent vulnerabilities (requires external vulnerability data). Monitor these specific hosts for unusual process execution (Windows Event ID 4688) or network connections (Windows Event ID 5156, Zeek conn.log) originating from or targeting processes associated with the vulnerable software. Use correlation analysis to link these host activities to prior external scanning or internal reconnaissance detected in network logs. Use time series analysis to identify bursts of activity or repeated connection attempts targeting these vulnerable hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]