[
  {
    "Is the adversary developing or obtaining capabilities to support their operation? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1588 - Obtain Capabilities": {
          "Observation of specific malware samples or exploit code in the environment with characteristics known to be associated with third-party providers or criminal marketplaces (e.g., specific compiler signatures, watermarks).": {
            "Data": "Windows Event ID 4688; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) and file activity (Zeek file.log) for known malicious file hashes or names. Upload suspect files to malware analysis platforms for analysis (e.g., identify compiler characteristics, embedded strings, watermarks) and compare findings against known third-party malware/exploit provider patterns or malware repository data using similarity scoring."
          },
          "Use of SSL/TLS or code-signing certificates within network traffic or on systems that are newly issued or known to be associated with malicious infrastructure or previous breaches.": {
            "Data": "Zeek ssl.log; Zeek x509.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ssl.log and x509.log for new or unusual SSL/TLS certificates observed in network traffic. Extract certificate details (serial number, issuer, subject). Correlate observed certificates against publicly available certificate transparency logs, threat intelligence feeds, or historical data using correlation analysis to identify certificates associated with known malicious infrastructure or patterns (e.g., default self-signed certificates from common C2 frameworks)."
          },
          "Network connections to known software/tool hosting sites, criminal forums, or C2 infrastructure used for staging or downloading acquired capabilities.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to IP addresses or domains identified in threat intelligence feeds as associated with criminal marketplaces, malware/tool hosting sites, or known C2 infrastructure. Use correlation analysis to link these connections to internal source IPs or users. Identify unusual patterns in connection frequency or data volume (e.g., using descriptive statistics) from internal systems to these external destinations."
          },
          "Process creation events indicating the execution of non-standard software or known adversarial tools with command-line parameters suggestive of staging or initial setup.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for execution of processes with suspicious names, paths (e.g., temp directories), or command-line arguments, especially those known to be associated with adversary tools (e.g., Cobalt Strike, Metasploit). Use frequency analysis or baselining to identify rare process executions within the environment. Analyze command-line parameters for patterns indicating unpacking, staging, or establishing persistence."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]