[
  {
    "Is the adversary developing resources using compromised network devices? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1584.008 - Network Devices": {
          "Internal systems connecting to known or suspected compromised third-party network devices (e.g., SOHO routers) for non-standard purposes (hosting payloads, C2 proxy).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify IP addresses associated with known/suspected compromised third-party network devices from Threat Intelligence feeds. Filter Zeek conn.log and http.log for connections originating from or destined to these IPs. Analyze http.log for unusual User Agents, GET/POST requests, or payloads downloaded/uploaded. Use correlation analysis to identify internal systems communicating frequently with these suspect external IPs."
          },
          "Connections or scanning activity originating from IP addresses associated with known or suspected compromised third-party network devices targeting our network infrastructure.": {
            "Data": "Zeek conn.log; Zeek scan.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Ingest Threat Intelligence feeds listing IP addresses of known/suspected compromised network devices. Filter Zeek conn.log and scan.log for connection attempts or scanning activity originating from these listed IPs targeting our network. Analyze connection patterns and frequency using descriptive statistics or time series analysis to identify abnormal reconnaissance or connection attempts."
          },
          "Requests made by internal systems to external, known/suspected compromised network devices for file downloads or unusual web content.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for connections where the destination IP is on a list of known/suspected compromised network devices. Identify HTTP GET requests for executable files, archives, or other potentially malicious content types. Analyze HTTP response codes, file sizes, and compare requested URLs against known phishing lures or hosted malicious payloads using correlation analysis with threat intelligence feeds. Flag internal source IPs initiating these requests."
          },
          "Internal systems connecting to known/suspected compromised network devices using unusual ports or protocols, or exhibiting proxy-like traffic patterns.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections from internal systems to known/suspected compromised network devices. Analyze connection patterns (port usage, duration, frequency) for deviations from expected behavior (e.g., connections to high/unusual ports, long-duration connections). Look for entries in Zeek weird.log indicating unexpected protocol behavior or anomalies during connections to these IPs. Use frequency analysis or descriptive statistics to identify outlier internal systems or connection characteristics to these suspicious destinations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]