```json
[
  {
    "Is the adversary developing resources using compromised cloud accounts? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1586.003 - Cloud Accounts": {
          "Outbound connections from internal hosts to domains or IP addresses of cloud providers known to be frequently abused for malicious resource development or associated with known adversary infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate outbound connections and DNS queries from internal hosts (from Zeek conn.log and dns.log) against a cyber threat intelligence (CTI) feed of domains/IPs for cloud providers known to have lax registration policies or that are frequently used by threat actors for malicious hosting. Alert on any connections to these blacklisted services and investigate the source host for compromise."
          },
          "Network traffic patterns or process activity consistent with known cloud management command-line tools (e.g., AWS CLI, Azure CLI, gcloud CLI) originating from hosts or user accounts not authorized for cloud administration.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for User-Agent strings characteristic of cloud CLI tools (e.g., 'aws-cli/...', 'Boto3/...', 'Azure-CLI/...'). Correlate these network events with process creation logs (Windows Event ID 4688) on the source host to confirm the execution of `aws.exe`, `az.cmd`, etc. Establish a baseline of authorized users/hosts for cloud management and use frequency analysis to alert on any hosts or users newly exhibiting this activity."
          },
          "An internal host exhibiting a sudden and sustained increase in connections or data volume to cloud service provider IP ranges, particularly for compute or storage services, inconsistent with the host's baseline activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of network traffic (connection count, bytes_out, bytes_in) from internal hosts to known cloud provider IP ranges using historical Zeek conn.log data. Use time series analysis (e.g., ARIMA, Holt-Winters) to model normal behavior and alert on statistically significant positive deviations (e.g., spikes exceeding 3 standard deviations) in activity, especially towards compute (e.g., EC2, Azure VMs) or object storage (e.g., S3, Blob Storage) services from non-server hosts."
          },
          "Anomalous interactive sessions or API access patterns to cloud management interfaces from unexpected internal hosts, indicating potential misuse of a compromised host for resource management.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for long-duration connections to cloud management endpoints (e.g., console.aws.amazon.com, portal.azure.com). Profile typical session lengths and source hosts. Use percentile analysis (e.g., flag sessions > 95th percentile duration) to find unusually long sessions that might indicate interactive use. Correlate with unusual DNS lookups (Zeek dns.log) for various cloud service APIs (e.g., `ec2.*.amazonaws.com`, `management.azure.com`) from a single host within a short timeframe. Calculate the entropy of subdomains queried per host to find unusual exploration of cloud services."
          },
          "An internal host connecting to a diverse and unusual combination of cloud services (e.g., compute, storage, DNS management, identity services) in a pattern indicative of building new infrastructure from scratch.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a categorized list of cloud service domains/endpoints (e.g., Compute, Storage, Networking, IAM, DNS). Monitor Zeek dns.log and conn.log to track which categories each internal host connects to. Establish a profile of normal service combinations for different host types (e.g., developer workstation vs. finance PC). Use correlation analysis to identify rare or suspicious combinations of cloud service interactions originating from a single host within a given timeframe (e.g., connecting to EC2 instance creation APIs, then Route53 for DNS, then IAM for user creation)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```