[
  {
    "Is the adversary developing resources using code signing certificates? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1587.002 - Code Signing Certificates": {
          "Execution of binaries or scripts signed with an untrusted or newly observed self-signed certificate.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) configured to include signing information for binaries or scripts. Extract certificate details (issuer, subject, thumbprint, validity). Compare issuer against known trusted authorities. Identify processes signed by untrusted or self-signed certificates. Analyze frequency distribution of new or unusual certificate signers across endpoints using descriptive statistics."
          },
          "Installation of new or untrusted root certificates on hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for execution of utilities like certutil.exe, powershell.exe, or similar, with parameters used for adding certificates to trusted root stores (e.g., 'addstore Root'). Analyze the temporal correlation of certutil execution or similar activity with other suspicious activities on the host using time series analysis."
          },
          "Detection of binaries signed with self-signed certificates exhibiting unusual or suspicious metadata (e.g., generic or misleading common name, short validity period, specific algorithms/key sizes associated with known malware).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4688 with command line and process signing information enabled. Extract certificate details (Common Name, Issuer, Validity Period, Signature Algorithm) for executed processes. Filter for self-signed certificates (e.g., Issuer = Subject). Flag self-signed certificates with suspicious features such as generic Common Names (e.g., 'localhost', 'test'), short validity periods (e.g., < 90 days), or cryptographic parameters (algorithms/key sizes) known to be favored by adversaries. Use frequency analysis to identify certificates with identical suspicious metadata used across multiple hosts or over time."
          },
          "Network traffic (e.g., TLS/SSL connections) presenting a self-signed certificate with features matching those observed in executed malicious binaries or known adversary infrastructure.": {
            "Data": "Zeek ssl.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Zeek ssl.log and Windows Event ID 4688. From Zeek ssl.log, identify TLS connections using self-signed certificates (where issuer subject matches certificate subject). Extract certificate details (Common Name, Issuer, Fingerprint/SHA-1, Validity Period). Correlate these certificate details with certificate details extracted from suspicious executed processes (Windows Event ID 4688) and with Threat Intelligence feeds for known adversary certificate fingerprints or common names. Flag network connections where the self-signed certificate matches details found in suspicious executed files or known adversary resources using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]