[
  {
    "Is the adversary conducting reconnaissance to gather information about the organization's employees? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "Anomalous login attempts using what appear to be valid employee names in combination with common or breached passwords.": {
          "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log; Zeek http.log",
          "Data Platform": "Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event IDs 4624 and 4625 and Zeek logs for login attempts to services (e.g., VPN, OWA, web portals). Analyze source IP addresses and attempted usernames. Look for patterns of failed login attempts across multiple valid-looking usernames followed by a successful login (password spraying). Use frequency analysis on attempted usernames and correlation analysis between failed and successful login attempts."
        },
        "Suspicious inbound communications (e.g., emails) specifically targeting employees with personalized content suggesting prior knowledge of their name or role.": {
          "Data": "Email Gateway Logs; Zeek smtp.log; Zeek http.log",
          "Data Platform": "Network devices, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor inbound email traffic logs (e.g., Zeek smtp.log, Email Gateway logs). Identify emails using personalized salutations with employee names not typically used in automated or mass emails. Analyze subject lines and content for highly specific references (social engineering cues). Perform correlation analysis between targeted employees and suspicious communication patterns or identified threat actor TTPs."
        },
        "Unusual volume or patterns of DNS requests or web traffic originating from within the network towards public-facing resources (e.g., LinkedIn, corporate website career pages) suggesting potential insider reconnaissance or automated enumeration." : {
            "Data": "Zeek dns.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log and http.log for high volume or unusual sequences of requests originating from internal IPs towards public websites known to list employee information (e.g., LinkedIn, specific job portals, 'About Us' sections of corporate sites). Use frequency analysis on destination domains/IPs and temporal analysis (time series) to detect automated scraping patterns. Correlate with Zeek conn.log for connection details and identify unusual users or systems performing this activity."
        },
        "Suspicious interactions originating from external sources with publicly accessible file shares, databases, or web forms that could expose internal employee lists or directories." : {
            "Data": "Zeek smb.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smb.log, http.log, and conn.log for external connections to publicly accessible file shares or web servers potentially hosting employee data. Look for unusual file access patterns (e.g., downloading large directories, accessing known directory names like '/employees', '/hr', '/staff') or querying web forms/databases that might return employee details. Use descriptive statistics on file sizes/counts and correlation with known data leakage patterns to identify potential reconnaissance activity targeting sensitive information."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]