```json
[
  {
    "Are internal systems communicating with external infrastructure that has been compromised by an adversary for operational use (e.g., C2, staging)? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1584 - Compromise Infrastructure": {
          "Network connections from internal systems to external IP addresses, domains, or URLs identified by threat intelligence as known compromised infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously ingest high-confidence threat intelligence feeds for malicious IPs, domains, and URLs associated with C2, staging, or watering hole attacks. Create a selector list and inner join it with real-time network logs (Zeek conn.log, dns.log, http.log) to identify any internal host communicating with this known compromised infrastructure. Alert on any matches for immediate investigation."
          },
          "Use of SSL/TLS certificates known to be associated with malicious actors or adversary-controlled infrastructure.": {
            "Data": "Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract certificate identifiers (SHA1 hash, serial number, issuer) from all external TLS connections recorded in Zeek ssl.log. Correlate these certificate identifiers against a threat intelligence feed of known malicious certificates. Alert on any connection using a flagged certificate and investigate the associated host and traffic."
          },
          "Connections to external infrastructure using non-standard ports or exhibiting protocol patterns (e.g., JA3/JA3S hashes, specific HTTP headers) characteristic of known malware or C2 frameworks.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for traffic using common protocols on non-standard ports (e.g., HTTPS on a port other than 443). Analyze Zeek ssl.log for JA3/JA3S hashes that match signatures of known C2 frameworks. Scan Zeek http.log for specific User-Agent strings, server headers, or URI structures associated with adversary tools. Maintain and update lists of these patterns from CTI and open-source research and alert on matches."
          },
          "Communication with newly registered domains (NRDs) or domains with characteristics typical of Domain Generation Algorithms (DGA), often used for disposable adversary infrastructure.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log to identify queries for domains registered within the last 30-60 days by integrating a WHOIS data source or NRD intelligence feed. Additionally, calculate the character entropy and n-gram frequency of queried domain names to flag those with high randomness characteristic of DGAs. Correlate positive hits with actual connection attempts in Zeek conn.log and prioritize investigation for hosts connecting to NRDs or DGA-like domains."
          },
          "Anomalous network traffic patterns to external destinations, such as periodic 'heartbeat' connections, unusually large or long-lived data transfers, or connections at atypical hours.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each internal host, establish a baseline of normal external communication patterns (destination IPs, ports, data volume, connection duration, frequency). Use time series analysis to detect periodic, fixed-interval connections (beaconing) indicative of C2 heartbeats. Employ statistical methods, such as Inter-Quartile Range (IQR) or Z-scores, to flag outliers in data transfer volume (both upload and download) or connection duration. Correlate these anomalies with the reputation of the destination IP and the typical role of the source host."
          },
          "An internal host suddenly communicating with a large number of disparate external domains or IP addresses with no prior history, indicating potential scanning or connection to a distributed adversary network.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile the number of unique external destinations (IPs, domains) each internal host communicates with over a rolling time window (e.g., hourly, daily). Use descriptive statistics (mean, median, standard deviation) to establish a baseline for each host or host group. Flag any host that exhibits a sudden, significant spike in the number of unique destinations it connects to, especially if those destinations have low reputation or are newly seen in the environment. Use box-plots or percentile analysis to visually identify and alert on these outlier hosts."
          },
          "Connections to common file sharing or code repository services (e.g., Pastebin, GitHub, cloud storage) from an unusual internal source (e.g., a server) or involving suspicious file types, suggesting use as a staging platform on compromised legitimate infrastructure.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify connections to well-known public file sharing, pastebin, or code repository services using Zeek http.log and conn.log. Profile which internal systems typically access these services and alert on connections from unusual sources, such as production servers, that have no business reason to connect. Analyze Zeek files.log for file transfers to/from these services, flagging executable files, scripts, or encrypted archives. Use linear regression to test if connections to these services by a host correlate with other suspicious alerts for that same host."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```