```json
[
  {
    "Is the adversary developing resources using code signing certificates? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1587.002 - Code Signing Certificates": {
          "Execution of binaries or network communication using certificates with thumbprints known to be associated with malware or adversary campaigns.": {
            "Data": "Windows Event ID 4688; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously collect certificate thumbprints (SHA1/SHA256) from all executed binaries (via Windows Event ID 4688 with signing information enabled) and TLS network connections (via Zeek ssl.log). Inner join this list of observed thumbprints with a high-confidence cyber threat intelligence (CTI) feed of known malicious certificate thumbprints. Alert on any match and immediately investigate the associated process or network connection."
          },
          "Use of command-line utilities to install a new, untrusted certificate into the system's root or trusted publisher certificate stores.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for the execution of `certutil.exe`, `powershell.exe` (e.g., `Import-Certificate`), or other certificate management tools. Create a high-fidelity alert for any command-line usage that includes parameters for adding a certificate to the 'Root' or 'TrustedPublisher' stores (e.g., `certutil -addstore Root`, `certutil -addstore TrustedPublisher`). Correlate such events with subsequent network connections or process executions from the same host to identify follow-on activity."
          },
          "Presence of executed binaries signed with certificates that match known patterns of malicious certificate generation, such as specific subject/issuer formats or cryptographic parameters used by known malware families.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For certificates extracted from executed processes (Windows Event ID 4688), analyze metadata against a maintained list of known malicious patterns. Use regular expressions and rule-based logic to detect certificates with specific issuer/subject strings (e.g., `CN=evilcorp`), unusual validity periods (e.g., exactly 1 year from a known malware compile date), or combinations of weak cryptographic algorithms that are characteristic of specific malware toolkits. Maintain and update this list of patterns based on threat intelligence reporting."
          },
          "Execution of binaries signed with a newly observed, low-prevalence, or self-signed certificate, especially if the certificate has suspicious metadata such as a generic subject name or short validity period.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of all known certificate issuers and subjects seen in the environment. Monitor process creation events (Windows Event ID 4688) and flag executions of any binary signed by a certificate issuer or with a subject seen for the first time or with very low frequency across the enterprise. Further risk-score these events if the certificate is self-signed (Issuer == Subject) or has heuristic red flags like a generic Common Name ('Test Cert', 'Developer'), a very short or very long validity period, or an empty subject field. Use descriptive statistics and frequency analysis (e.g., identifying values below the 5th percentile) to identify rare occurrences."
          },
          "A statistically significant spike in the number of unique self-signed certificates observed on a single host or across the enterprise in a short time frame.": {
            "Data": "Windows Event ID 4688; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate unique certificate thumbprints from process executions (Windows Event ID 4688) and network traffic (Zeek ssl.log), filtering for those that are self-signed. Establish a baseline for the rate of new self-signed certificates appearing in the environment per day or week. Use time series analysis to monitor for statistically significant spikes in the count of unique self-signed certificate thumbprints. A sudden increase could indicate a widespread malware campaign where each sample uses a uniquely generated self-signed certificate to evade hash-based detections."
          },
          "Anomalous correlation between certificates used for signing local binaries and certificates presented in network connections, indicating an adversary is using the same certificate infrastructure for both implants and C2.": {
            "Data": "Windows Event ID 4688; Zeek ssl.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract certificate details (thumbprint, subject, issuer) from both executed processes (Windows Event ID 4688) and network TLS sessions (Zeek ssl.log). Create a baseline of legitimate software that makes network connections using its own embedded certificate. Use correlation analysis to identify instances where a newly observed executable's signing certificate (or a self-signed certificate from an unsigned binary) matches a certificate seen in a network connection to an external, non-whitelisted IP address. This behavioral correlation is a strong indicator of adversary-controlled infrastructure."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```