[
  {
    "Is the adversary developing resources (e.g., servers) for use in operations against us? (TA0042 - Resource-Development)": {
      "Indicators": {
        "T1583.004 - Server": {
          "Identification of adversary-owned or controlled servers via external internet scanning intelligence.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Compare destination IPs from Zeek conn.log against lists of suspicious IPs identified by external internet scanning efforts or threat intelligence feeds associated with adversary infrastructure development. Use correlation analysis to find connections between internal hosts and suspected adversary infrastructure IPs."
          },
          "Identification of adversary-owned or controlled servers exhibiting patterns (e.g., services, certificates, response artifacts) associated with known C2 software.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and ssl.log for connections to external IPs. Look for external IPs identified by threat intelligence as exhibiting patterns (services, certificates) associated with known adversary C2 frameworks. Use filtering and correlation to identify internal hosts communicating with these IPs."
          },
          "First observed internal connections to external IP addresses or domains with no prior connection history, especially if associated with suspicious services or protocols.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of internal hosts and the external IPs/domains they communicate with using Zeek conn.log and dns.log. Identify internal connections to external IPs/domains that have not been observed communicating with that internal host or any internal host within a defined historical period (e.g., 90 days). Filter for suspicious ports (e.g., high ports, common C2 ports) or lack of DNS resolution. Use statistical methods (e.g., frequency analysis, set difference) to find rare or novel connections."
          },
          "Suspicious command execution or outbound network connections from unusual processes or user accounts, targeting external IP addresses or domains.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) and 5156 (outbound connection) logs with Zeek conn.log and dns.log. Identify outbound network connections initiated by processes or user accounts that are unusual for the system or user (e.g., executable path is not standard, user account connecting from an unexpected machine). Investigate connections to external IPs/domains identified as novel or associated with suspicious ports/protocols. Use frequency analysis on process names and user accounts seen initiating external connections to identify rare occurrences and correlate with external connection data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]