
[
  {
    "What evidence indicates adversaries are leveraging malvertising infrastructure against our environment or users? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583.008 - Malvertising": {
          "Network connections from internal systems to domains, IPs, or URLs known to be part of active malvertising campaigns or serving as malicious ad redirectors/landing pages, based on current threat intelligence.": {
            "Data": "Zeek dns.log; Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously ingest high-confidence threat intelligence feeds (updated at least daily) identifying infrastructure (domains, IPs, URLs) associated with malvertising campaigns (e.g., ad servers, redirectors, payload domains). Correlate Zeek dns.log queries, Zeek conn.log connections (destination IP/port), and Zeek http.log GET requests (host header, URI) against this intelligence. Alert on any matches originating from internal IP addresses. Use descriptive statistics to track hit counts per indicator and per internal user/system to identify widespread campaigns or targeted users."
          },
          "Web traffic exhibiting patterns typical of malvertising redirects, such as chains of HTTP redirects involving known ad network domains followed by suspicious or newly registered domains, or specific URL query parameters known to be used in malvertising.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for HTTP 30x redirect chains. Identify chains starting from legitimate sites (inferred from referer), passing through known ad network domains, and culminating in connections to newly registered domains (NRDs) or domains with low reputation scores (cross-reference with Zeek dns.log and external reputation services). Search for specific URL query parameter patterns commonly used in malvertising (e.g., campaign IDs, click tracking tokens, fingerprinting parameters). Maintain and update a list of suspicious ad network redirect patterns and known malvertising URL structures for pattern matching. Use correlation analysis to link NRD DNS queries with preceding ad-related HTTP traffic."
          },
          "A user session involving clicks on advertisements (inferred from HTTP referers from ad networks or search engine ad links) leading to drive-by download attempts or landing pages with high-risk indicators like obfuscated JavaScript or known exploit kit delivery patterns.": {
            "Data": "Zeek http.log; Zeek files.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for referer URLs indicating clicks originating from ad platforms or search engine advertisements. For subsequent HTTP GET/POST requests and responses within that user session, analyze downloaded content using Zeek files.log (filter for MIME types like 'application/x-msdownload', 'application/octet-stream', 'application/javascript', 'application/x-shockwave-flash'). Scrutinize JavaScript content for high entropy levels (indicative of obfuscation) or signatures of known browser exploit kits. Correlate these events with Zeek conn.log data for connections to IPs with poor reputation. Use time series analysis on the frequency of ad-click-initiated suspicious downloads to detect emerging campaigns."
          },
          "Suspicious process execution on an endpoint (e.g., scripting engines like PowerShell, LoLBins) immediately following web browsing activity involving known ad networks or domains recently associated with malvertising indicators.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (Process Creation) logs from endpoints with network logs (Zeek http.log for URLs and referers, Zeek conn.log for connection details) from the same timeframe for that specific endpoint. Prioritize alerts for processes such as `powershell.exe`, `cscript.exe`, `wscript.exe`, `mshta.exe`, or any unsigned executable launched by a browser process (or with a browser as a parent process). Focus on instances where the preceding web activity (within 1-5 minutes) involved HTTP referers from known ad networks or connections to domains flagged by other malvertising detection rules (selectors/patterns). Use correlation analysis on timestamps and endpoint identifiers to link the network event to the host event."
          },
          "Anomalous increase in network traffic to multiple newly observed or low-reputation domains from various internal hosts, where referer information suggests ad-driven traffic, potentially indicating a widespread malvertising campaign affecting the organization.": {
            "Data": "Zeek dns.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normally accessed domains and their typical reputation profiles (e.g., domain age, WHOIS information diversity, historical threat intelligence association). Monitor Zeek dns.log and Zeek http.log (specifically referer headers) for a statistically significant increase in requests to newly registered domains (NRDs) or domains with historically low/poor reputation scores, particularly if referer information points to ad networks or common content hosting sites that serve advertisements. Use statistical methods like Inter-Quartile Range (IQR) or percentile-based alerting on the count of unique NRDs accessed per hour/day across the enterprise. Analyze the entropy of destination domains linked to ad referers; a sudden spike in entropy or volume could indicate a broad, dynamically generated malvertising campaign."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
