[
  {
    "Is the adversary gathering victim identity information during reconnaissance? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1589 - Gather Victim Identity Information": {
          "Suspicious network traffic patterns indicative of probing for user information (e.g., large volumes of authentication requests from unusual sources).": {
            "Data": "Windows Event ID 4625; Zeek conn.log; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 (Audit Failure - Logon) and Zeek conn.log for connection attempts to authentication services (e.g., RDP, SSH, OWA, VPN ports) and Zeek http.log for web authentication attempts. Identify source IPs with high rates of failed login attempts against multiple user accounts. Calculate the frequency and rate of failed logins per source IP and target service. Flag IPs with statistically significant high failure rates compared to normal baseline using methods like descriptive statistics or outlier detection (e.g., IQR or percentile analysis)."
          },
          "Anomalous external access or scraping activity targeting public-facing services potentially revealing user details or exhibiting high request volume indicative of data gathering.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and Zeek conn.log (for traffic to web server ports) for external requests targeting public-facing web applications or APIs (e.g., employee portals, login forms, directory services). Look for patterns indicative of scraping or enumeration, such as high request volume from a single source IP/User-Agent, unusual request sequences, or attempts to access known user enumeration endpoints. Use time series analysis or statistical anomaly detection on request volume/rate per source/endpoint to identify anomalies."
          },
          "Repeated authentication attempts from a single source cycling through multiple usernames indicative of username enumeration.": {
            "Data": "Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4625 (Audit Failure - Logon) logs on authentication servers (e.g., Domain Controllers, application servers) for attempts to services like RDP, SSH, or other network authentication points. Group failed login attempts by source IP address. Identify source IPs that attempt logins with a high number of distinct target usernames within a defined short timeframe (e.g., >10 distinct usernames in 5 minutes). Use frequency analysis to establish baseline counts of distinct usernames attempted per source IP and flag statistically significant outliers."
          },
          "External HTTP/S requests to sensitive paths or authentication endpoints exhibiting unusual User-Agent strings or referrer patterns associated with automated tools or reconnaissance activity.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for requests targeting web paths commonly associated with authentication, user profiles, or sensitive data (e.g., /login, /api/user, /admin, password reset pages). Analyze User-Agent strings and Referer headers in these requests. Flag requests using User-Agents known to be associated with scanning tools, web scrapers, or exhibiting unusual formatting/composition compared to established baselines using frequency analysis. Correlate with referrer headers to identify suspicious origins or lack of expected referrers for the path accessed."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]