
[
  {
    "Is the adversary developing resources for targeting or operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583.001 - Domains": {
          "Internal network communication with domains explicitly flagged as malicious (e.g., C2, malware distribution, phishing) by high-confidence threat intelligence feeds.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously ingest a high-confidence threat intelligence feed of malicious domains. Perform a near-real-time inner join of this list with internal DNS queries (Zeek dns.log) and connection logs (Zeek conn.log). Block and alert on any matches, and investigate the source endpoint for signs of compromise or policy violation."
          },
          "Identification of newly registered domains that are visually or typographically similar to the organization's domains, its partners, or common online services (typosquatting, homoglyphs).": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively monitor domain registration data using commercial or open-source services to generate a list of potential typosquatted or homoglyph domains related to corporate assets. Correlate this generated list against internal network traffic (Zeek dns.log and conn.log) to detect any internal interaction with these high-risk domains. Use correlation analysis to identify endpoints or users frequently interacting with such domains."
          },
          "Identification of domains with a collection of suspicious registration or hosting attributes, such as recent registration date, use of privacy-protected WHOIS, or association with known malicious SSL/TLS certificates.": {
            "Data": "Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze passive DNS and certificate transparency logs (e.g., via Zeek dns.log and ssl.log data). Develop a risk score for domains based on a combination of weighted factors: domain age (newly registered domains are higher risk), WHOIS privacy status, registrar reputation, ASN reputation, and the use of free or historically abused SSL certificate issuers. Use a simple linear regression or weighted model to score and prioritize domains for investigation when they are accessed from the internal network."
          },
          "Internal endpoints making DNS queries for a high volume of algorithmically generated, non-existent domains (NXDOMAIN), often followed by a successful query to a live C2 domain.": {
            "Data": "Zeek dns.log; Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for a high rate of NXDOMAIN responses originating from a single internal host. Calculate the character entropy of queried domain names per host; a high entropy can indicate Domain Generation Algorithm (DGA) activity. Correlate high NXDOMAIN bursts with a subsequent successful connection (Zeek conn.log) to a newly registered or low-reputation domain. On the endpoint, correlate this network activity with the parent process (Windows Event ID 4688) that initiated the queries to identify the responsible malware."
          },
          "Network connections to a domain exhibiting unusual communication characteristics like 'heartbeat' beaconing, non-standard port usage, or anomalous data transfer volumes.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For connections to external domains, analyze Zeek conn.log to detect periodic, fixed-interval connections indicative of C2 beaconing using time series analysis. Identify connections on non-standard ports by comparing the 'service' field to the destination port. Model typical data transfer volumes (hist_bytes) for common services and use descriptive statistics (e.g., Inter-Quartile Range, Z-score) to detect significant outliers in data sent or received. Flag domains that resolve to a large number of IPs in a short time (Fast Flux) by analyzing Zeek dns.log."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
