```json
[
  {
    "Is the adversary conducting reconnaissance to gather information about the organization's employees? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1589.003 - Employee Names": {
          "External network scanning or web crawling activity originating from IP addresses or using User-Agents known to be associated with reconnaissance services or malicious actors.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join source IP addresses and User-Agent strings from Zeek conn.log and http.log (for traffic targeting public-facing web servers) with a cyber threat intelligence feed of known malicious actors, scanners (e.g., Shodan, Censys), and criminal reconnaissance services. Prioritize alerts for traffic targeting pages likely to contain employee data (e.g., 'about us', 'team', login portals, API endpoints)."
          },
          "Automated enumeration attempts against public-facing applications, such as login portals or directory search functions, using sequential, dictionary-based, or name-permutation patterns for usernames.": {
            "Data": "Zeek http.log; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for a high rate of HTTP POST requests to login pages or GET requests to search/API endpoints from a single source IP. Analyze usernames being attempted for alphabetical/sequential patterns (e.g., 'asmith', 'bsmith') or patterns matching a common corporate naming convention (e.g., 'firstname.lastname'). Correlate with a high volume of Windows Event ID 4625 (failed logins) on the backend server. Use frequency analysis and string similarity algorithms on attempted usernames from a single source to detect enumeration patterns."
          },
          "A password spraying attack pattern characterized by a low-and-slow rate of failed login attempts from one or more external IP addresses across a large number of valid or likely-valid usernames.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Windows Event ID 4625 (failed login) and 4624 (successful login) over an extended time window (e.g., 60-120 minutes). Group by source IP address. Alert when a source IP generates failed logins for a high number of distinct usernames (e.g., >20) but a low number of failures per username (e.g., <3). Use descriptive statistics to identify source IPs with a high unique-user-failure-count and a low average-failure-count-per-user, which is characteristic of password spraying."
          },
          "Anomalous scraping or crawling behavior from external sources targeting the organization's public-facing websites or APIs that could reveal employee names, roles, or contact information.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for sessions from a single external IP that exhibit characteristics of scraping: high request rate, systematically traversing directories (e.g., /team/1, /team/2), or making an unusual number of requests to employee directory pages or APIs. Use time series analysis to detect abnormal spikes in traffic to these specific pages. Create connection profiles based on request frequency and data transfer size per session; use a box-plot or IQR method to identify outlier sessions indicative of scraping."
          },
          "Anomalous internal user activity involving high-volume access to internal resources containing employee data, such as the intranet, internal directories, or HR application front-ends, inconsistent with the user's role or typical behavior.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal access patterns for internal employee directories and HR systems per user or department. Monitor Zeek http.log for internal IPs making an unusually high number of requests to these resources. On file servers hosting such data, monitor Windows Event ID 4663 (Object Access, requires auditing) for users accessing sensitive directories or files at a high rate. Use correlation analysis to link network and host data, and employ statistical profiling (e.g., peer group analysis) to identify significant deviations in user behavior."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```