[
  {
    "Is the adversary developing resources like malicious domains for targeting or operations? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1584.001 - Domains": {
          "Network traffic communicating with known or suspected malicious domains or subdomains created via hijacking or shadowing.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify domain names in Zeek conn.log and dns.log. Cross-reference these domain names against threat intelligence feeds containing known malicious domains, including those associated with recent hijacking or shadowing activity. Prioritize investigation of connections to domains with high confidence threat scores or recent TI updates. Use frequency analysis to identify rare or newly observed domains."
          },
          "Anomalous DNS queries from internal hosts for suspicious subdomains or domains not typically accessed.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries to subdomains of known legitimate company domains that appear unusual or syntactically suspicious (e.g., random strings as subdomains). Calculate entropy of subdomain names to detect potentially algorithmically generated or randomized names. Use time series analysis to detect sudden spikes in queries for a new or unusual domain/subdomain."
          },
          "Internal DNS resolution of legitimate company domain names resolving to IP addresses outside the organization's expected infrastructure.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for A or AAAA records resolving legitimate internal or corporate domain names (including expected subdomains). Cross-reference resolved IP addresses against a list of known internal/partner IP ranges. Flag resolutions for internal domain names that resolve to external, unexpected IP addresses using set difference or comparison analysis. Use frequency analysis to identify domains/subdomains that suddenly begin resolving to new, unexpected IPs."
          },
          "Appearance of new, previously unseen subdomains under legitimate corporate domains in internal DNS queries.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a historical list of observed subdomains queried for legitimate corporate domains in Zeek dns.log. Use frequency analysis or set-based comparison to identify newly observed subdomains. Flag new subdomains, especially those with unusual naming conventions (high entropy, random strings) or those queried by multiple internal hosts shortly after appearing."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]