[
  {
    "Is the adversary developing resources related to digital certificates? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1588.004 - Digital Certificates": {
          "Network traffic using SSL/TLS certificates that are newly issued or have suspicious characteristics (e.g., short validity period, unusual issuer, associated with known malicious infrastructure).": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ssl.log for certificate details in network sessions. Extract certificate issue dates, validity periods, issuers, and subject names. Compare issue dates against observed network activity dates. Use statistical analysis (e.g., frequency distribution) on issuers and subject names to identify anomalies. Correlate suspicious certificates with connections in Zeek conn.log to external IPs."
          },
          "Network connections leveraging SSL/TLS certificates with known default values used by adversary tools or specific threat groups.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ssl.log for certificate details. Compare extracted certificate hashes or specific fields (e.g., subject, issuer) against a curated list of known default or malicious certificates from threat intelligence. Investigate connections in Zeek conn.log using matching certificates."
          },
          "Network traffic using SSL/TLS certificates associated with domains recently registered or domains known to be associated with malicious activity or typosquatting.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ssl.log for certificate subject names (domains). Correlate these domains with external domain registration databases (e.g., WHOIS, Passive DNS) to identify domains with very recent registration dates (e.g., < 30 days old). Cross-reference the certificate subject name domains and destination IPs from Zeek conn.log with threat intelligence feeds and domain reputation services. Flag connections using certificates for newly registered or low-reputation domains."
          },
          "Network traffic using self-signed or invalid SSL/TLS certificates connecting to external or internal hosts.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek ssl.log for certificate validation status (ssl.validation_status), issuer, and subject names. Identify sessions where certificates are self-signed, have validation errors, or are issued by untrusted Certificate Authorities. Correlate these sessions with destination IPs and ports from Zeek conn.log. Use frequency analysis to identify internal hosts or external endpoints that are outliers in terms of connections using self-signed/invalid certificates. Investigate these connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]