[
  {
    "Is the adversary developing resources by compromising external servers? (TA0042 - Resource-Development)": {
      "Indicators": {
        "T1584.004 - Server": {
          "Network traffic from internal systems communicating with external servers exhibiting characteristics of known adversary C2 infrastructure (e.g., unusual SSL/TLS negotiation patterns, specific port usage, suspicious response artifacts).": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ssl.log, and x509.log for connections to external servers. Filter for suspicious ports or protocols. Look for anomalies in SSL/TLS certificate usage, negotiation parameters, and handshake details. Compare connection patterns to known C2 fingerprinting efforts using correlation analysis. Use descriptive statistics on connection properties to identify deviations from baseline."
          },
          "Connections from internal systems to external servers identified as compromised for phishing or watering hole campaigns, especially if preceded by phishing emails or visits to known legitimate-but-compromised sites.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and conn.log for outbound connections to external servers flagged by threat intelligence as compromised for phishing or watering holes. Analyze referrer headers in http.log for potential watering hole sites. Correlate network connections with email logs (if available externally) for users who received phishing attempts. Use descriptive statistics on connection frequencies and sizes to identify unusual interactions with these servers."
          },
          "Unusual outbound communication patterns (e.g., unexpected service ports, regular timing, abnormal data volumes) from internal systems to external servers potentially used by adversaries.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections. Analyze connection records for unusual destination ports/protocols not typically seen communicating externally. Use time series analysis on connection timestamps, durations, and bytes transferred to identify periodic connections or abnormal data volumes to external IPs. Flag internal hosts exhibiting communication patterns inconsistent with established baselines using descriptive statistics."
          },
          "Suspicious host activity (process execution, network connections) on internal systems following communication with external servers suspected of being adversary infrastructure.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries showing outbound connections from internal hosts to external IPs flagged as suspicious (e.g., based on threat intelligence, unusual patterns) with subsequent Windows Event ID 4688 (Process Creation) or 5156 (Network Connection) events on the source internal host within a defined time window (e.g., 60 seconds). Analyze command lines in 4688 and destination IPs/ports in 5156 for known malicious indicators or deviations from baseline behavior using descriptive statistics."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]