```json
[
  {
    "Is the adversary attempting to discover cloud infrastructure? (TA0007 - Discovery)": {
      "Indicators": {
        "T1580 - Cloud Infrastructure Discovery": {
          "Outbound connections to cloud provider API endpoints originating from IP addresses known to be malicious or part of anonymous proxy networks (e.g., TOR).": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously filter Zeek conn.log and ssl.log for connections to known cloud provider API endpoints (e.g., *.amazonaws.com, management.azure.com, *.googleapis.com, identified by IP range or more reliably via SNI in ssl.log). Inner join the external source IP addresses of these connections with a high-confidence, frequently updated threat intelligence feed of known malicious IPs and anonymous proxy/TOR exit nodes. Alert on any matches and investigate the associated host and activity."
          },
          "Execution of cloud CLI commands with specific argument patterns or filenames characteristic of known open-source or malicious cloud discovery tools (e.g., Pacu, CloudMapper, ScoutSuite).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation with Command Line) for process names like 'python.exe', 'powershell.exe', 'bash.exe' or the cloud CLIs ('aws', 'az', 'gcloud'). Analyze command line arguments using regular expressions to match signatures of known discovery tools, such as specific module names ('--module ec2__enum_unauthenticated'), script names ('pacu.py', 'cloudmapper.py'), or unique flag combinations. Maintain and update a library of these patterns based on public threat research."
          },
          "Cloud infrastructure discovery commands executed by user accounts or from hosts not typically associated with cloud administration or DevOps functions.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of user accounts and hostnames that legitimately perform cloud discovery tasks by analyzing historical Windows Event ID 4688 logs for cloud CLI usage. Create an 'allow list' or statistical model of normal activity. Alert on any execution of discovery commands (e.g., 'aws describe-*', 'az vm list', 'gcloud compute instances list') by users or from hosts outside this baseline. Use frequency analysis to identify users/hosts that rarely or never perform these actions."
          },
          "An unusually high volume, frequency, or atypical sequence of cloud discovery commands executed by a single entity within a short time frame, indicating automated enumeration.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate cloud CLI discovery commands from Windows Event ID 4688 by source host and user. Analyze the rate and timing of these commands. Use time series analysis to detect significant bursts of activity that deviate from normal operational tempo. Calculate the entropy of commands used by an entity in a given time window; a rapid succession of many different 'list' or 'describe' commands may have higher entropy than normal and indicate a broad discovery sweep. Correlate with Zeek conn.log to measure the rate of connections to API endpoints from the source host."
          },
          "Cloud discovery activity targeting an unusually broad range of resource types or geographic regions, especially when initiated by an identity with historically narrow access patterns.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse command line arguments from Windows Event ID 4688 to identify the specific cloud resource types and regions being targeted by discovery commands. For each user, build a historical profile of their typical discovery scope. Use statistical methods (e.g., calculating standard deviation or variance of the number of unique services/regions accessed per day) to detect significant and anomalous expansion of a user's discovery scope. Flag users who suddenly query all available regions ('--region *') or enumerate a wide variety of services they have not previously interacted with."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```