
[
  {
    "Is the adversary developing resources using external web services? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1583.006 - Web Services": {
          "Network traffic from internal systems communicating with specific URLs, domains, or IP addresses hosted on legitimate web services that are known to be malicious.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate outbound network logs (Zeek dns.log for queries, http.log for URLs, conn.log for IPs) against a high-confidence cyber threat intelligence (CTI) feed of known malicious URLs, domains, and IP addresses hosted on legitimate web services (e.g., GitHub, Pastebin, Google Drive). An inner join between network logs and the intelligence feed should trigger an alert for immediate investigation."
          },
          "Network connections to URLs on legitimate web services that match known structural patterns for command and control (C2) or malware staging.": {
            "Data": "Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use regular expressions to scan Zeek http.log URIs for patterns commonly associated with malware staging or C2 on legitimate services. Examples include requests to `raw.githubusercontent.com` for executable or script files, `pastebin.com/raw/{id}` for stager retrieval, or specific API endpoints on services like Discord or Slack. Correlate with Zeek ssl.log to hunt for known malicious JA3/JA3S hashes used by C2 frameworks that abuse these services. Maintain and regularly update a list of these structural patterns from CTI reporting."
          },
          "Anomalous internal user browsing activity directed at legitimate web services, such as unusual focus on account creation, API key generation, or repository setup pages.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for HTTP requests to legitimate web services often abused for resource development (e.g., GitHub, GitLab, Pastebin, code-sharing sites, social media). Analyze URL paths for keywords like `/signup`, `/join`, `/create`, `/new`, or `/settings/keys`. Establish a baseline of such activity and use frequency analysis and descriptive statistics to identify users or hosts with an unusually high rate of this behavior. Use outlier detection methods like Inter-Quartile Range (IQR) or Z-scores on the counts of these activities per user to flag potential resource development from a compromised host or an insider."
          },
          "Anomalous data transfers to legitimate web services, characterized by unusual volume, frequency, or data characteristics, potentially indicating staging of tools or data.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For connections to known file sharing or code repository web services, establish baselines of normal data transfer sizes (request/response body lengths from Zeek http.log or total bytes from Zeek conn.log) per user or host. Use time series analysis and percentile analysis to flag significant deviations (e.g., uploads > 95th percentile). Additionally, analyze the entropy of transferred data within payloads (if available); persistently high or low entropy compared to text/binary baselines may suggest encoded or encrypted data being staged. Correlate unusually large uploads with subsequent suspicious activity from the same host."
          },
          "Internal hosts initiating connections to newly-observed or low-reputation resources hosted on legitimate web services, potentially indicating testing of newly developed infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a historical baseline of all subdomains and full URLs on legitimate web services (e.g., `*.github.io`, `*.pastebin.com`, `*.googleusercontent.com`) that internal hosts have connected to. Monitor Zeek dns.log and http.log for connections to resources on these services that are 'first seen' in the environment. Analyze the frequency of access; a low number of hosts connecting to a new resource is more suspicious. Use linear regression to model and predict normal growth of connections to new resources and flag outliers that may represent targeted testing of C2 infrastructure."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
