```json
[
  {
    "Is the adversary establishing resources (accounts/personas) for use in targeting? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1585 - Establish Accounts": {
          "Inbound communication from external domains or IP addresses known to be associated with malicious infrastructure or prior phishing campaigns.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously inner join sender IP addresses and domains from Zeek conn.log and Zeek smtp.log with high-confidence, up-to-date cyber threat intelligence (CTI) feeds that list known malicious infrastructure. Alert on any matches and investigate all associated communications for further malicious activity."
          },
          "Inbound emails originating from domains exhibiting patterns of impersonation (e.g., typosquatting, homoglyphs) or from newly registered domains (NRDs).": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract all unique sender domains from Zeek smtp.log. Compare these against a programmatically generated list of typosquatted and homoglyphic variations of the organization's own domains and its key partners. Additionally, perform automated WHOIS or passive DNS lookups to determine the registration date of sender domains. Flag all communications from domains matching impersonation patterns or those registered within the last 30-90 days for further scrutiny. Use descriptive statistics to baseline the age of typical communicating domains to identify outliers."
          },
          "Anomalous, low-volume 'probing' communication from a new external source to a diverse set of internal email addresses, potentially to validate established accounts before a larger campaign.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log to identify external sender domains that have not previously communicated with the organization. Track the initial interactions of these new domains, flagging those that send a very small number of emails (e.g., 1-5) to a scattered set of recipients across different departments without receiving replies. Use correlation analysis or graph-based clustering to identify these sparse, targeted communication patterns that may represent an adversary testing their newly established accounts."
          },
          "A sudden change in the volume or network behavior of communication involving external domains from free webmail, dynamic DNS, or low-reputation cloud service providers.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal communication volume and connection patterns (e.g., frequency, duration, data transfer size) with common free webmail providers (e.g., Gmail, Outlook.com), dynamic DNS services, and other public hosting providers. Use time series analysis (e.g., ARIMA, exponential smoothing) on Zeek smtp.log and Zeek conn.log data, grouped by external provider, to detect significant deviations from the baseline. Calculate the entropy of internal recipients communicating with a single external source; a sudden change in entropy can indicate a new campaign using established accounts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```