[
  {
    "Is the adversary conducting reconnaissance on our business relationships? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1591.002 - Business Relationships": {
          "Targeted emails or messages to employees containing keywords related to known business partners or supply chain vendors, potentially leading to suspicious link clicks or attachments.": {
            "Data": "Zeek http.log; Zeek file.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for connections initiated by internal users clicking links in suspected targeted emails containing keywords related to business partners. Monitor Zeek file.log and Windows Event ID 4663 on endpoints/servers for files associated with suspected targeted emails. Use keyword analysis on relevant logs. Use entropy analysis on file content to identify potentially malicious payloads."
          },
          "Unusual or anomalous network traffic patterns originating from IP ranges or domains associated with known business partners.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network traffic (Zeek conn.log) originating from known IP ranges or domains of business partners using Zeek dns.log lookups. Analyze traffic volume, ports, protocols, and destination internal assets. Use descriptive statistics and time series analysis to establish baseline traffic patterns from these partners and identify deviations (sudden spikes, connections to unusual ports/services). Use correlation analysis between connection attempts and internal asset types."
          },
          "Internal user accounts with established business partner relationships exhibiting unusual access patterns to sensitive internal systems or documents containing partner information.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4663; Zeek http.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify user accounts known to interact frequently with business partners. Monitor Windows Event IDs 4624 (Successful Logon Type 3, 10) and 4663 (An object's access was requested) for these users accessing internal systems or sensitive documents (e.g., specific network shares, databases, internal web applications) related to partners. Use descriptive statistics (frequency, duration) and time series analysis on access times, volume, and accessed resource types to establish baselines and detect anomalous activity (e.g., accessing large volumes of data, accessing resources outside normal working hours/locations, accessing a high entropy of distinct resources). Consider correlation analysis between user activity and known partner communication periods."
          },
          "External scanning or targeted probing of network services specifically configured for interaction with known business partners.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network services (ports, protocols, internal IPs/ranges) primarily used for communication or data exchange with known business partners (e.g., dedicated SFTP servers, partner VPN endpoints). Monitor Zeek conn.log for external connection attempts to these specific services/ports from untrusted IP ranges. Analyze Zeek weird.log for unusual or malformed connection attempts targeting these services. Use frequency analysis on source IPs and connection attempts to identify widespread scanning vs. targeted probing from a limited set of IPs. Use correlation analysis to identify whether probing attempts align with known partner maintenance windows or communication schedules."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]