[
  {
    "Is the adversary performing reconnaissance to gather network topology information? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.004 - Network Topology": {
          "High volume of external network scans (port sweeps, vulnerability scans) targeting organizational external IP ranges.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for source IPs initiating connections to a large number of distinct destination ports or IP addresses within the organization's external range. Identify outliers using frequency analysis or connection-to-port/IP ratio metrics. Investigate sources exhibiting patterns consistent with scanning."
          },
          "Unusual or low-frequency external network probes targeting administrative or network device ports (e.g., SNMP, RDP, SSH) on external interfaces.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for external source IPs attempting connections to known administrative/infrastructure ports (e.g., 22, 23, 161, 3389) on external interfaces. Identify unusual sources or connections that deviate from established baselines using descriptive statistics on connection counts or source IP rarity."
          },
          "Internal network connections or logon attempts from a single source demonstrating probing or scanning behavior (e.g., attempting connections to multiple internal IPs/ports).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze internal Zeek conn.log for source IPs attempting connections to a high number of distinct internal destination IPs or ports within a short timeframe. Correlate with Windows Event IDs 4624 (successful logon), 4625 (failed logon), and 5156 (filtered connection) on target endpoints/servers showing activity from these source IPs. Use frequency analysis on destination IPs/ports per source IP to identify internal scanning behavior, potentially using a box-plot to visualize distributions and outliers."
          },
          "Failed or successful internal network connections to common file sharing (SMB) or administrative service (RPC, WMI) ports across multiple distinct internal destination IP addresses from a single source IP.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter internal Zeek conn.log for connections targeting common SMB (445), RPC (135), or WMI (135, 49152-65535) ports across multiple distinct internal destination IPs from a single source IP. Correlate with Windows Event IDs 4624/4625/5156 on target systems showing successful/failed logons (4624/4625 Logon Type 3 - Network) or filtering (5156) associated with these connection attempts. Use correlation analysis to link source IPs with connection attempts to multiple hosts/services, and frequency analysis to identify sources attempting to access an unusual number of targets."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]