[
  {
    "Is the adversary gathering information about the victim organization? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1591 - Gather Victim Org Information": {
          "Suspicious inbound communication (e.g., emails, connections) attempting to elicit organizational information.": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smtp.log for suspicious email metadata (unusual senders, subjects, attachment types) potentially attempting elicitation. Analyze Zeek conn.log for connections to known suspicious web domains mentioned in potential elicitation attempts. Use correlation analysis to link suspicious inbound communications to specific internal recipients."
          },
          "Network traffic involving suspicious domains or IPs potentially linked to adversary reconnaissance infrastructure.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for lookups of suspicious or newly registered domains potentially used for reconnaissance infrastructure. Correlate Zeek conn.log for connections originating from or destined to IP addresses known to be associated with scanning activity or threat intelligence feeds related to reconnaissance tools. Use statistical methods (e.g., frequency analysis) to identify anomalous lookup patterns or connection volumes to external, unknown domains."
          },
          "External network connections or scanning attempts targeting servers or services commonly associated with hosting organizational directories, employee data, or internal documentation (e.g., SharePoint, HR portals, file shares if misconfigured).": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for external connection attempts to ports and IPs associated with internal servers or services known to host organizational data (e.g., servers hosting internal websites, document repositories, or potentially misconfigured file shares). Use frequency analysis and clustering of source IPs to identify external entities probing these resources. Compare external connection patterns to internal access patterns using correlation analysis to highlight unusual external interest."
          },
          "External HTTP requests attempting to access specific file paths or content types associated with organizational charts, employee lists, or internal process documents on public-facing web servers.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for requests originating from external IPs that target URIs or file extensions commonly associated with sensitive organizational information (e.g., '/aboutus/employees/list.xlsx', '/internal/orgchart.pdf', paths containing keywords like 'employee', 'org', 'hr', 'policy'). Use string matching or regex on the 'uri' field. Flag repeated attempts from the same source or attempts against multiple potentially sensitive paths. Use frequency analysis on requested URIs to identify unusual patterns of access to less common content."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]