
[
  {
    "Is the adversary conducting reconnaissance using open technical databases? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596 - Search Open Technical Databases": {
          "Network connections or probes originating from IP addresses known to be associated with public scanning services or known malicious reconnaissance infrastructure.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and continuously update a list of IP addresses used by common internet scanning services (e.g., Shodan, Censys, ZoomEye) and from CTI feeds identifying malicious reconnaissance infrastructure. Inner join this list with source IPs from Zeek conn.log. While some scanning is benign research, a sudden increase in scans from these sources, or scans targeting non-public or sensitive ports, should be investigated as potential targeted reconnaissance."
          },
          "Network traffic containing specific User-Agent strings, request headers, or URI patterns characteristic of common internet scanning tools or vulnerability scanners.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan Zeek http.log data for HTTP requests containing User-Agent strings or other header values (e.g., 'X-Censys-Scanner') known to be used by internet-wide scanners. Monitor for specific URI patterns used by these tools to fingerprint web applications or known vulnerabilities (e.g., requests for '/favicon.ico' to identify platforms, or paths from tools like Nuclei). Use regular expression matching on a curated list of these patterns and signatures."
          },
          "Widespread, low-and-slow scanning activity from a single or distributed set of external IP addresses across the organization's public IP space, particularly targeting non-standard ports or services.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Zeek conn.log data over time (e.g., 24 hours). Identify external source IPs that connect to an unusually high number of unique destination hosts or unique destination ports within the organization's network space, especially if the connection rate per host is low to evade simple thresholds. Use statistical analysis, such as calculating the entropy of destination ports per source IP or using box-plots to find outliers in the number of unique hosts contacted, to identify scanning behavior. Correlate targeted ports with those known to be indexed by services like Shodan for your organization's assets."
          },
          "A sudden increase in authentication failures or successes using usernames derived from publicly available information, such as WHOIS contacts, names in certificate details, or emails from data breaches.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively compile a list of usernames and email addresses associated with the organization from public sources (e.g., WHOIS, certificate transparency logs, known data breach corpuses). Monitor Windows Event IDs 4625 (failure) and 4624 (success) on external services (e.g., VPN, OWA, RDP gateways). Use time series analysis to detect a statistically significant increase in login attempts using these publicly-sourced identities. A spike may indicate the start of a password spraying campaign based on gathered reconnaissance."
          },
          "Anomalous external DNS queries for obscure or legacy subdomains documented in passive DNS or certificate transparency databases, especially when followed by connection attempts to those hosts.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of commonly queried subdomains from external sources. Monitor Zeek dns.log for a spike in external queries for rare, old, or non-advertised subdomains. Use frequency analysis or percentile rankings to identify these rare queries. Correlate the source IP of the anomalous DNS query with subsequent connection attempts (from Zeek conn.log) to the resolved IP address. This sequence (external query for rare subdomain -> connection attempt from same source) is a strong behavioral indicator of an adversary using information from public technical databases."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
