```json
[
  {
    "Is the adversary conducting reconnaissance by scanning our public-facing IP blocks? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1595.001 - Scanning IP Blocks": {
          "Inbound connection attempts or probes originating from IP addresses on threat intelligence lists known for malicious scanning, hosting C2 servers, or belonging to anonymizer services.": {
            "Data": "Zeek conn.log; Zeek icmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate all inbound source IP addresses from Zeek conn.log and icmp.log against multiple high-confidence, frequently updated cyber threat intelligence (CTI) feeds. Specifically check against lists of known malicious scanners, botnet command and control (C2) nodes, TOR exit nodes, and abused or suspicious hosting providers. An inner join between connection logs and CTI lists should trigger an immediate alert for investigation."
          },
          "Inbound network traffic exhibiting protocol-level artifacts or request patterns characteristic of common reconnaissance and scanning tools (e.g., Nmap, Masscan, ZMap).": {
            "Data": "Zeek http.log; Zeek conn.log; Zeek software.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create and apply rules to detect signatures of scanning tools. For web traffic, scan Zeek http.log for specific User-Agent strings (e.g., 'Nmap Scripting Engine', 'masscan', 'zmap'). For other protocols, analyze Zeek conn.log for distinctive probe sequences or TCP flag combinations used by tools like Nmap (e.g., FIN, NULL, XMAS scans). Also, monitor Zeek software.log, which may identify scanning tools based on protocol banners. Use regular expression matching on User-Agents and stateful sequence detection on connection logs to identify these patterns."
          },
          "An external source attempting to connect to a single or few specific ports across a wide range of hosts within our public-facing IP blocks, indicative of a horizontal scan.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for a single source IP connecting to the same destination port(s) (e.g., 443, 22, 3389) across a high number of unique destination IPs within owned network blocks. Calculate the entropy of destination IPs per source IP and destination port pair over a defined time window. Use descriptive statistics to flag source IPs with an unusually high count of distinct hosts contacted (e.g., exceeding 3 standard deviations from the mean, or a raw count >50 hosts in 5 minutes)."
          },
          "An external source attempting to connect to a wide range of sequential or non-sequential ports on a single or few specific public-facing hosts, indicative of a vertical or port scan.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for a single source IP generating connections to a large number of unique destination ports on one or a few of our public-facing destination IPs. Calculate the entropy of destination ports per source IP and destination IP pair. Flag source IPs exhibiting high port entropy. Additionally, use time series analysis on the rate of new port connections from a source to detect scanning behavior. A high ratio of TCP connections with a 'RST' state (connection reset) from our host is a strong indicator of a scan against closed ports."
          },
          "An external source sending ICMP echo requests or TCP/UDP probes to a sequential range of IP addresses within our public-facing IP blocks, indicative of a network sweep.": {
            "Data": "Zeek conn.log; Zeek icmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and icmp.log for inbound traffic. Group traffic by source IP address. For each source, analyze the numerical sequence and distribution of the destination IP addresses it contacted. Use correlation analysis or check for linear progressions in the contacted IP addresses to identify sequential scanning patterns. Flag source IPs that connect to a high percentage of hosts within a given subnet (e.g., a /24 or /16) in a systematic (sequential or pseudo-random) order within a short timeframe."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```