
[
  {
    "Is the adversary using network address translation traversal for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1599.001 - Network Address Translation Traversal": {
          "Communication with external IP addresses known to be malicious STUN, TURN, or other NAT traversal proxy servers.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate destination IP addresses in Zeek conn.log, especially those communicating over standard NAT traversal ports (UDP/TCP 3478, 5349), against a high-confidence cyber threat intelligence (CTI) feed of known malicious or suspicious NAT traversal infrastructure. Alert on any confirmed matches and investigate the associated internal host."
          },
          "Use of STUN or TURN protocols on standard or non-standard ports, identified by protocol-specific artifacts.": {
            "Data": "Zeek conn.log; Zeek stun.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and monitor Zeek's stun.log for explicit STUN/TURN requests and responses. If stun.log is unavailable, create a signature to search UDP payloads in Zeek conn.log for the STUN magic cookie (0x2112A442), particularly on standard ports (3478, 5349) and unusual high-numbered UDP ports. Establish a baseline for legitimate STUN/TURN usage (e.g., by VoIP or WebRTC applications) and alert on deviations, such as usage from servers or by non-approved applications."
          },
          "Use of Universal Plug and Play (UPnP) from internal hosts to create unauthorized port mappings on network gateways.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for UPnP/SSDP traffic (multicast/unicast to UDP port 1900; SOAP requests over TCP to gateway devices) originating from internal hosts, especially those not expected to perform such actions (e.g., servers, critical endpoints). Create alerts for any successful UPnP port-mapping request from unauthorized or unexpected internal sources. Correlate UPnP activity with subsequent inbound connections to the newly mapped port."
          },
          "An internal host establishing a direct, long-lived peer-to-peer connection with an external host immediately following STUN/TURN activity, suggesting a covert C2 channel.": {
            "Data": "Zeek conn.log; Zeek stun.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate STUN/TURN protocol usage (identified via Zeek stun.log or pattern matching) from an internal host with a subsequent, long-lived TCP or UDP connection between that same host and an external IP. Use time series analysis and correlation to link the initial NAT traversal attempt with the established P2P session. Profile typical connection durations and data volumes for legitimate P2P applications and use Inter-Quartile Range (IQR) or Z-score methods to identify anomalous sessions that could represent a C2 channel."
          },
          "Anomalous internal traffic routing patterns where hosts bypass established network gateways or proxies to communicate externally.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and maintain a baseline of legitimate network traffic paths (e.g., all web traffic from user subnets goes via proxy A; database servers do not communicate externally). Monitor Zeek conn.log in real-time for connections that violate these established policies, such as a server in a restricted subnet making a direct external connection. Use graph analysis of connection logs to visualize and detect unexpected communication paths. Alert on any policy violations, as this may indicate successful NAT traversal or routing manipulation."
          },
          "A high volume or high entropy of connections to various high-numbered UDP ports from a single internal host, indicative of a UDP hole punching attempt.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each internal source host, monitor the rate and diversity of outbound UDP connection attempts in Zeek conn.log. Calculate the entropy of destination IPs and destination ports over a defined time window (e.g., 1 minute). A high entropy value compared to an established baseline for that host or host-type can indicate a UDP hole punching algorithm attempting to establish a direct connection. Use descriptive statistics (connection counts, unique ports) and flag outliers using percentile analysis or a dynamic threshold."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
