[
  {
    "Is the adversary conducting reconnaissance on our network or services? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.005 - IP Addresses": {
          "Suspicious scanning activity targeting our external IP ranges.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connection attempts to multiple IPs within owned external ranges from a single source IP over a short period. Identify source IPs with a high number of failed connections or connections to a wide range of ports. Use frequency analysis and thresholding to identify potential scanning sources."
          },
          "Network probes or unusual traffic patterns targeting specific services or ports on external-facing IPs, indicative of fingerprinting or validation.": {
            "Data": "Zeek conn.log; Zeek dpd.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dpd.log for unusual connection patterns or protocol detections on external-facing IPs. Identify connections attempting unexpected protocols on standard service ports or connections to less common ports within the external range. Use statistical analysis (e.g., entropy) on destination port distribution per source IP to identify reconnaissance probes vs. legitimate traffic."
          },
          "Attempted connections to non-standard ports or protocols on external-facing IPs, indicating broad port scanning or service discovery.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connection attempts from external IPs to ports outside the range of standard enterprise services (e.g., beyond 80, 443, 25, 53, 110, 143, etc.) on external-facing hosts. Group attempts by source IP and destination port. Flag source IPs attempting to connect to a wide variety of low/high/non-standard ports using frequency distribution and percentile analysis on destination ports per source IP to identify outliers exhibiting broad scanning behavior."
          },
          "External DNS queries attempting to resolve internal or non-public hostnames associated with our organization.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries received by external DNS servers from external sources. Filter queries for internal-looking domain names or hostnames specific to the organization (e.g., internal FQDNs, hostnames matching known internal naming schemes). Use correlation analysis to identify external IPs performing multiple such queries or querying sequences of internal-sounding names (e.g., `host1.internal.corp.com`, `host2.internal.corp.com`). Flag source IPs conducting high-volume or patterned queries for internal names."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]