[
  {
    "Is the adversary conducting reconnaissance to gather information about our domain properties? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.001 - Domain Properties": {
          "Network traffic patterns consistent with active querying of domain properties (e.g., numerous DNS queries for subdomains, attempts to access cloud service APIs like GetUserRealm from external IPs).": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for unusual volumes of DNS queries originating from external IPs targeting internal domains/subdomains. Analyze Zeek conn.log for connections from external IPs to known cloud provider API endpoints associated with user/domain enumeration. Identify external sources conducting rapid enumeration attempts using rate-limiting analysis or statistical profiling of query/connection frequency (e.g., standard deviation, IQR)."
          },
          "Attempts to enumerate users or domains via cloud service APIs (e.g., Office 365 GetUserRealm/autodiscover) visible at network edge.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from external IPs destined for known cloud provider authentication/API endpoints (e.g., login.microsoftonline.com, specific O365 API endpoints). Analyze connection frequency and volume from single source IPs to these endpoints. Use statistical analysis (e.g., frequency analysis, entropy) to identify sources exhibiting patterns consistent with automated enumeration attempts rather than normal user logins."
          },
          "Internal system queries to public domain information services (e.g., WHOIS servers, DNS information websites/APIs).": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor egress Zeek conn.log for connections from internal IPs to known WHOIS server ports (43) or IPs/domains associated with public DNS/domain information services (e.g., dnsdumpster.com). Analyze Zeek dns.log for internal queries to these domains. If applicable, monitor Windows Event ID 4688 on critical systems for processes executing command-line WHOIS or DNS query tools. Use frequency analysis or correlation analysis to detect unusual internal systems querying these external services."
          },
          "Scanning activity detected targeting externally exposed services frequently used for user or domain enumeration (e.g., SMTP, specific cloud service ports).": {
            "Data": "Zeek conn.log; Zeek portscan.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and portscan.log for scanning patterns originating from external IPs targeting services like SMTP (port 25) on externally accessible mail servers or other services/ports associated with cloud endpoints or potentially exposed internal infrastructure. Use statistical methods like standard deviation or IQR on connection/scan volume per source IP to identify IPs conducting unusual scanning activity compared to baseline."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]