[
    {
        "information_requirement": "Is the adversary performing reconnaissance using wordlist scanning?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1595.003",
                "name": "Wordlist Scanning",
                "evidence": [
                    {
                        "description": "Wordlist scanning activity originating from IP addresses present on threat intelligence feeds as malicious, part of botnets, or known scanning sources.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate source IP addresses from Zeek http.log and conn.log against a high-confidence, up-to-date threat intelligence feed of known malicious IPs, TOR exit nodes, botnets, and anonymous proxies. Prioritize investigating IPs that are present on these feeds and also exhibit scanning behaviors (e.g., high rate of HTTP 404 errors). Inner join connection logs with the CTI feed and alert on any confirmed matches."
                    },
                    {
                        "description": "HTTP requests containing User-Agent strings or other headers that are characteristic of well-known wordlist scanning and directory enumeration tools (e.g., dirb, gobuster, ffuf, nikto).",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan the `user_agent` field in Zeek http.log for patterns matching a maintained list of common scanning tools. Use regular expression matching to identify tool names and versions. Calculate the frequency of different User-Agents observed across the enterprise; a sudden spike in a scanning tool's User-Agent string, especially one not seen before, can indicate a new targeted campaign."
                    },
                    {
                        "description": "A high rate of requests for non-existent web pages (e.g., HTTP 404 errors) or a high volume of unique URI requests from a single external source, indicating directory or file enumeration.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate Zeek http.log data by source IP over short time windows (e.g., 5 minutes). For each IP, calculate the ratio of HTTP 404/403 status codes to total requests and the count of unique URIs requested. Establish a dynamic baseline for these metrics using a moving average and standard deviation. Use statistical methods like the Inter-Quartile Range (IQR) or Z-score to flag source IPs that are outliers. A high error ratio combined with a high unique URI count is a strong indicator of scanning."
                    },
                    {
                        "description": "A large number of connection attempts or requests from a single external source targeting cloud storage services (e.g., AWS S3, Azure Blob, GCP Storage) with sequential or dictionary-based naming patterns.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log for a high volume of queries for cloud storage hostnames (e.g., *.s3.amazonaws.com) from a single client. Correlate with Zeek conn.log and http.log data to analyze requested bucket/object names for patterns like common dictionary words, permutations of the organization's name, or sequential naming (e.g., 'bucket-01', 'bucket-02'). Calculate the entropy of requested resource names from a single IP; low entropy can indicate sequential scanning, while unusually high entropy may indicate dictionary attacks. Correlate sequences of failed attempts (e.g., 403 Forbidden, 404 Not Found) followed by a successful access from the same source."
                    },
                    {
                        "description": "A high volume of requests to a single valid URI but with numerous variations in URL parameters, indicating scanning for hidden or vulnerable parameters.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each unique URI (path only), aggregate requests by source IP and analyze the query string portion of the URI. Use time series analysis to detect a sudden spike in the number of unique parameter names or values submitted to a specific endpoint from a single source. Calculate the entropy of parameter names for a given URI per source IP; a high entropy may indicate fuzzing or scanning for hidden parameters. Flag source IPs that generate a high number of unique parameters for a single endpoint compared to the baseline."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
