[
  {
    "Is the adversary bypassing network defenses through network boundary bridging? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1599 - Network Boundary Bridging": {
          "Detection of network traffic crossing network boundaries that should be prohibited by existing security policies.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log collected near network boundary devices. Define expected and prohibited traffic patterns based on documented network security policies (e.g., specific IP ranges, protocols, ports). Identify and alert on connections traversing boundaries (between defined internal/external or segmented IP ranges) that match prohibited protocols, ports, or source/destination pairs. Use frequency analysis or outlier detection (e.g., percentiles) to identify rare or anomalous traffic types crossing boundaries."
          },
          "Unauthorized or anomalous configuration changes detected on network boundary devices (firewalls, routers).": {
            "Data": "Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusual connections to network device management interfaces (e.g., SSH, HTTPS management ports) from unexpected sources or during unusual times. Analyze Windows Event ID 4663 (Object Access auditing) on management servers or jump boxes configured to audit access to network device configuration files. Look for access patterns inconsistent with authorized administrators (e.g., access at unusual times, from unexpected hosts). Correlate network traffic to management interfaces with host-based audit events."
          },
          "Unusual or increased network traffic originating from a network boundary device.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log focusing on traffic sourced from network boundary devices' internal interfaces. Profile normal traffic volume, protocols, and destination ports/IPs using descriptive statistics (mean, median volume per unit time, frequency distribution of ports/protocols). Use time series analysis or outlier detection (e.g., IQR) to flag significant increases in volume or deviations from the baseline traffic patterns sourced from these devices towards internal or external destinations."
          },
          "Security policy violations observed in network traffic following detected configuration changes on boundary devices.": {
            "Data": "Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 on management servers for write/modify access to network boundary device configuration files. Upon detection of modification events, perform correlation analysis by reviewing Zeek conn.log entries from the subsequent time period traversing the affected boundary. Specifically search for traffic that matches previously identified prohibited patterns (based on documented policy or historical analysis) but is now successfully traversing the boundary. Flag policy-violating traffic observed shortly after configuration changes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]