[
  {
    "Is the adversary performing reconnaissance by purchasing technical data? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1597.002 - Purchase Technical Data": {
          "Unusual external connection attempts to specific internal services matching potentially purchased infrastructure details.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connection attempts from external IPs to internal hosts/ports that are not typically exposed or are unexpected based on known infrastructure mapping. Compare observed external host/port targets against documented internal network services. Use frequency analysis to identify rare connection attempts to these targets or cluster IPs exhibiting this behavior."
          },
          "Anomalous successful or failed login attempts using credentials potentially obtained via data purchase.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4624 (successful login) and 4625 (failed login) for patterns indicative of credential stuffing or spraying (e.g., rapid succession of failed logins from multiple IPs for a single user, or attempts against a list of users). Identify successful logins from new, geographically unusual, or suspicious source IPs using Zeek conn.log for source IP context. Use correlation analysis to link failed attempts to subsequent successes or identify patterns across multiple accounts."
          },
          "Targeted scanning or exploitation attempts against specific services or vulnerabilities that are not widely known or are unique to the organization's less-public infrastructure, potentially leveraging purchased technical data.": {
            "Data": "Zeek conn.log; Windows Event ID (Application Log for service errors/crashes)",
            "Data Platform": "Network devices; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for focused scanning (e.g., low volume, specific ports) or exploit signatures targeting non-public services from external IPs. Correlate these attempts temporally with intelligence regarding potential data sales. Analyze Windows Application event logs on potentially targeted servers for unusual errors or crash events that might indicate exploit attempts. Use correlation analysis to link Zeek observed attempts with server-side impacts."
          },
          "Anomalous access patterns to cloud services or external enterprise applications using credentials potentially sourced from purchased data breaches, observed from internal networks or federated identity logs.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices; Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections from internal endpoints to known cloud provider APIs or critical external enterprise applications. Filter for sessions showing successful authentication followed by anomalous behavior (e.g., unusual API calls, large data transfers). Correlate with Windows Event ID 4624 (especially Logon Type 9 if ADFS involved or other relevant logon types) on identity providers or relevant application servers, looking for successful logons using potentially compromised accounts from unusual internal sources. Establish baselines for user/application access patterns and use descriptive statistics or time series analysis to detect deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]