[
  {
    "Is the adversary collecting information about the organization using publicly available sources? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1593.002 - Search Engines": {
          "Presence of sensitive organizational data (credentials, network diagrams, internal documents) indexed by public search engines.": {
            "Data": "Public Search Engine Results",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Formulate Dorking-style search queries targeting known organization domains and keywords related to sensitive information (e.g., 'password', 'confidential', 'internal'). Systematically execute queries across major search engines. Categorize findings and use frequency analysis to identify common types of sensitive data exposed. Prioritize findings based on sensitivity."
          },
          "Identification of potentially exploitable information (employee lists, technology stacks, organizational structure) indexed by public search engines.": {
            "Data": "Public Search Engine Results",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Formulate search queries targeting organization names, employee names (from public sources like LinkedIn), technology names (from job postings, websites), and structural terms ('organizational chart'). Execute queries across major search engines. Categorize findings and use descriptive statistics (e.g., count by data type, count by source) to understand the scope of publicly available information."
          },
          "Outbound network connections from internal systems to publicly indexed URLs or file paths associated with sensitive organizational data.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of URLs/file paths identified as publicly indexed sensitive data via external monitoring (dorking). Monitor Zeek http.log and conn.log for outbound connections from internal IPs to these specific URLs or domains. Use correlation analysis to identify internal hosts accessing these resources. Investigate any internal access to known publicly indexed sensitive data."
          },
          "Execution of command-line tools or processes associated with downloading files from external sources potentially found via search engines, particularly on non-standard hosts.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line executions of tools like `curl`, `wget`, PowerShell `Invoke-WebRequest` or `Invoke-RestMethod` downloading files from external URLs. Filter for destinations matching patterns of publicly indexed sites or specific URLs identified via external recon monitoring. Correlate with Windows Event ID 5156 to confirm outbound connections. Use frequency analysis or baselining to flag unusual downloads by specific users or hosts, especially servers or atypical endpoints."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]