[
  {
    "Has the adversary gathered reconnaissance information via private threat intelligence sources that enables subsequent attacks? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1597.001 - Threat Intel Vendors": {
          "Successful logins using potentially compromised credentials or exploitation attempts targeting services known to be vulnerable based on recent threat intelligence reports.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 for logins using accounts previously reported as compromised or found in public/private breach data. Analyze login patterns (time, source IP, login type) for anomalies using time series analysis or descriptive statistics. Monitor Zeek logs (http, ssl, conn) for connections originating from external IPs targeting known vulnerable services/ports, especially after intelligence reports about new exploits become available. Correlate login/connection attempts with source IPs mentioned in relevant threat intelligence feeds."
          },
          "Network connections or communication attempts originating from external IPs/domains that are known to be associated with threat intelligence feeds or observed scanning our perimeter.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and other relevant logs (dns, http) for connections originating from or attempting to resolve external IPs/domains present in threat intelligence feeds related to reconnaissance or initial access campaigns. Analyze connection patterns (ports scanned, volume of requests, duration) using statistical analysis (e.g., calculating unique ports scanned per source IP, entropy of destination ports). Flag sources exhibiting widespread scanning behavior or targeting high-value services."
          },
          "Exploitation attempts targeting vulnerabilities on public-facing assets that were recently published or highlighted in threat intelligence feeds.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of vulnerabilities recently highlighted in relevant threat intelligence feeds (e.g., CISA Known Exploited Vulnerabilities, vendor-specific intel). Monitor Zeek conn.log, http.log, ssl.log, and weird.log for connections and requests targeting public-facing assets. Correlate traffic patterns (e.g., specific URLs, headers, payloads known to trigger exploits) with the list of recently reported vulnerabilities. Use statistical analysis (e.g., sudden increase in scans/attempts targeting a specific port/path) to identify opportunistic exploitation attempts shortly after vulnerability disclosure in intelligence feeds."
          },
          "Targeted scanning or enumeration activity originating from external IPs/infrastructure linked to recent threat intelligence reporting.": {
            "Data": "Zeek conn.log; Zeek scan.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Cross-reference source IP addresses and domain names observed in Zeek conn.log (especially connection attempts to multiple ports), scan.log (if enabled), http.log, and dns.log with threat intelligence feeds containing indicators associated with reconnaissance campaigns or specific threat groups. Use statistical analysis (e.g., calculating the number of unique destination ports/hosts scanned by a single source IP, analyzing request patterns in http.log) to identify targeted reconnaissance efforts from flagged sources. Prioritize investigation of sources mentioned in recent, relevant threat intel."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]