[
  {
    "Is the adversary conducting reconnaissance using open technical databases? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596 - Search Open Technical Databases": {
          "Evidence of connections to internal services using credentials or information likely derived from public domain or certificate registration databases.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze successful and failed login attempts (Windows Event ID 4624, 4625, Zeek conn.log). Correlate login attempts with known external information sources (e.g., publicly listed email addresses in WHOIS, hostnames from certs). Look for unusual patterns or login attempts to systems or services not typically accessed by external users. Use descriptive statistics to summarize login attempts per source IP, user, and destination service."
          },
          "Network connection attempts or probes targeting internal systems using hostnames or IP addresses that appear to correlate with publicly exposed network data (e.g., Shodan scans, passive DNS).": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connection attempts (especially on unusual ports or to less-common services) from external IPs. Correlate destination hostnames/IPs from conn.log and dns.log with publicly available network scan data or passive DNS records. Identify connection attempts to internal systems using hostnames or IPs that appear listed in such external sources. Use frequency analysis or anomaly detection to flag rare destination IPs or hostnames receiving external connection attempts."
          },
          "Connection attempts from external IPs targeting specific service ports or using request patterns associated with reconnaissance or exploitation of services publicly listed or identified (e.g., via Shodan).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections from external IPs to known or unusual service ports (e.g., RDP 3389, SSH 22, common web ports 80, 443). Analyze Zeek http.log for suspicious GET/POST requests, headers, or paths targeting web services, particularly those whose details (like version, specific paths) might be indexed by public scanners like Shodan. Use frequency analysis to identify rare destination ports or URL paths accessed from external sources and correlate with known vulnerability scan patterns."
          },
          "Authentication attempts using user accounts or hostnames found in publicly available technical databases (e.g., old certificate logs, WHOIS contact emails, passive DNS records).": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (successful logon) and 4625 (failed logon) on public-facing or accessible servers. Compare attempted usernames or hostnames against lists compiled from public technical databases (e.g., emails from WHOIS, hostnames from historical certificate transparency logs or passive DNS dumps). Flag authentication attempts using accounts or hostnames not present in internal directories or standard naming schemes but found in public data. Use correlation analysis to link multiple attempts across different systems using similar names from public sources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]