[
  {
    "Is the adversary conducting reconnaissance on target firmware? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592.003 - Firmware": {
          "Suspicious network scans or queries potentially attempting to enumerate firmware versions from internal or public-facing devices.": {
            "Data": "Zeek conn.log; Zeek dce_rpc.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for scans (high volume to multiple destinations/ports) or specific queries (Zeek dce_rpc.log, weird.log) originating from external IPs. Use descriptive statistics (e.g., connection frequency by source IP/port) to identify outliers."
          },
          "Unusual connection patterns or requests to services known to expose system/firmware details.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to ports/services potentially exposing system details. Analyze Zeek http.log or ssl.log for requests/certificates that might reveal server/firmware versions. Use correlation analysis to link suspicious connections to known reconnaissance tools or patterns."
          },
          "Network traffic patterns indicative of automated searching or scraping of public websites and technical databases known to contain technology/firmware information.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs for connections to known reconnaissance platforms (Shodan, Censys) or vendor/technical sites from external IPs. Analyze http.log for search queries or automated access patterns (user agents, request volume). Use frequency analysis and time series analysis to identify external IPs exhibiting unusual volume or patterns of requests to multiple potential information sources. Correlate with dns.log for suspicious domain lookups."
          },
          "Targeted connections or specific protocol interactions with devices/ports known to sometimes expose firmware version details from external sources.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek snmp.log; Zeek dcerpc.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for traffic to specific ports/services potentially exposing version info (e.g., SNMP ports 161/162, common web server ports 80/443 with requests for banners, specific industrial control ports). Analyze related protocol logs (snmp.log, http.log for banners, dcerpc.log, weird.log) for queries or responses containing identifiable version strings. Use frequency analysis and correlation to identify external source IPs repeatedly probing such services across multiple internal hosts."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]