
[
  {
    "Is the adversary conducting reconnaissance on target firmware? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592.003 - Firmware": {
          "Network connections originating from IP addresses known to be part of public scanning services (e.g., Shodan, Censys) or associated with known malicious reconnaissance activity.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses from all incoming connections in Zeek conn.log against a continuously updated list of IPs belonging to known internet-wide scanning platforms (e.g., Shodan, Censys, ZoomEye) and high-confidence CTI feeds of malicious reconnaissance actors. Alert on all matches, and prioritize investigation of those targeting ports known to expose firmware information (e.g., HTTP/S, SNMP, Telnet, specific IoT/OT ports)."
          },
          "Use of specific scanner User-Agent strings, tools, or request patterns known to be used for firmware enumeration targeting externally-facing services.": {
            "Data": "Zeek http.log; Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for User-Agent strings associated with common reconnaissance tools (e.g., Nmap, ZGrab, Nuclei, Nikto). Scan HTTP requests for patterns attempting to elicit version information or banners from web servers. Analyze Zeek ssl.log for self-signed or unusual certificates commonly used by scanning tools. For non-HTTP traffic, use Zeek conn.log combined with IDS signatures to identify patterns of known reconnaissance tools. Maintain and regularly update a list of these tool-specific patterns, signatures, and User-Agents for matching."
          },
          "An external source IP conducting broad, systematic, or unusually slow network sweeps across multiple hosts or ports, especially those associated with firmware information disclosure.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to detect scanning behavior from a single external IP. Identify sources connecting to an unusually high number of hosts ('horizontal scan') or a high number of ports on a single host ('vertical scan') within a defined time window. Use descriptive statistics (e.g., connection counts per source IP) and percentile analysis to find outliers. Employ time series analysis on connection logs to detect 'low-and-slow' scans, where the time delta between connection attempts from a source IP is consistently large to evade simple rate-based detection. Flag IPs exhibiting such behaviors."
          },
          "Targeted and repeated connections from an external source to specific services (e.g., SNMP, UPnP, device management interfaces) that often reveal firmware versions, possibly involving malformed or unusual protocol interactions.": {
            "Data": "Zeek conn.log; Zeek weird.log; Zeek snmp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek logs for traffic to services known to leak firmware data (e.g., SNMP on ports 161/162, UPnP on 1900, IPMI on 623, common web admin panels on 80/443/8080). Monitor Zeek snmp.log for get-request or get-next-request queries targeting OIDs related to system description (sysDescr) or version strings. Analyze Zeek http.log for requests to specific paths known to expose firmware versions on IoT/network devices (e.g., /firmware.bin, /version.asp). Examine Zeek weird.log for unusual or malformed traffic to these services that might indicate non-standard enumeration attempts. Use frequency analysis to flag external IPs that repeatedly probe these specific services across one or more hosts."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
