[
  {
    "Is the adversary performing reconnaissance using digital certificates? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596.003 - Digital Certificates": {
          "External connections probing standard HTTPS ports on public-facing infrastructure.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for external source IPs initiating connections to public-facing hosts on standard HTTPS ports (443). Identify source IPs exhibiting scanning behavior (connections to multiple hosts or ports). Use time series analysis on connection attempts per source IP to detect bursts characteristic of scanning."
          },
          "Anomalous login attempts on external remote services potentially using information derived from digital certificates.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (successful) and 4625 (failed) for login attempts to external remote access infrastructure (VPN, etc.). Analyze login attempts for use of specific hostnames or domains potentially extracted from public certificates. While direct hostname correlation in logs is difficult, identify login attempts associated with unusual user accounts, times, or source IPs that align with known recon activity timelines. Use correlation analysis to link suspicious login attempts with known external scanning events or other observed suspicious network behavior."
          },
          "High volume of SSL/TLS handshake initiations or distinct server name indications (SNIs) from a single external IP address across multiple public-facing services.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connection counts from external IPs to port 443 on public-facing servers. Analyze Zeek ssl.log for `server_name` (SNI) fields associated with these connections. Calculate the frequency of unique SNIs requested per source IP over a defined time window. Flag external IPs exhibiting a high count of unique SNI requests or connections to a high number of distinct internal hosts on port 443. Use descriptive statistics (e.g., percentiles) to define 'high count' thresholds based on historical data."
          },
          "Anomalous or high-volume DNS queries from internal hosts to domains associated with certificate transparency (CT) logs or public certificate search services.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of known domains for certificate transparency (CT) logs (e.g., *.ct.googleapis.com, ct.izenpe.com, ct.sectigo.com) and public certificate search tools. Monitor Zeek dns.log for queries to these domains originating from internal IP addresses. Establish a baseline for such queries per host or host group. Alert on internal hosts making an unusually high volume of these queries or queries from hosts/subnets not expected to perform such lookups (e.g., standard user workstations vs. security team tools). Use frequency analysis and deviation from baseline (e.g., 3 standard deviations above mean)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]