```json
[
  {
    "Is the adversary performing reconnaissance to gather network topology information? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.004 - Network Topology": {
          "Network scanning activity originating from IP addresses known to be malicious, part of scanning-as-a-service platforms, or associated with anonymizing proxies.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses from Zeek conn.log, particularly those exhibiting scanning behavior, against multiple CTI feeds identifying known malicious IPs, vulnerability scanners, TOR exit nodes, and other anonymizing services. Maintain an allowlist of trusted partner/service IPs to reduce false positives. Generate a high-priority alert for any connection attempts from a confirmed malicious source."
          },
          "Use of specific reconnaissance tool signatures, such as common scanner User-Agents or distinctive TCP/IP probe sequences, targeting external assets.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log data for User-Agent strings associated with common network scanners (e.g., Nmap, ZMap, Masscan, Nessus). Monitor Zeek conn.log for connection patterns characteristic of specific tools, such as TCP NULL, FIN, or Xmas scans, or unusual combinations of TCP flags and options used for OS fingerprinting. Use regular expression matching and a continuously updated list of tool signatures."
          },
          "High-volume, horizontal or vertical network scans originating from a single external source targeting the organization's external IP ranges.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify external source IPs initiating connections to a high number of distinct destination IPs (horizontal scan) or a high number of distinct ports on a single destination IP (vertical scan) within a short time frame. Calculate the ratio of distinct destinations to total connection attempts for each source. Use descriptive statistics and percentile analysis (e.g., flag sources in the 99th percentile) or box-plots to identify significant outliers representing scanning activity."
          },
          "Anomalous or low-and-slow network probes from an external source targeting high-value or non-standard ports on external-facing assets.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for external connection attempts to sensitive or uncommon ports (e.g., administrative ports like SSH, RDP, Telnet, SNMP, or organization-specific application ports). Establish a baseline of normal traffic patterns for these ports. Use time series analysis to detect unusual spikes in connection attempts, even if small. Use frequency analysis to identify source IPs that are rare or have no history of legitimate interaction but are seen probing these specific ports over an extended period."
          },
          "Systematic probing patterns across an entire subnet or IP range from an external source, potentially using ICMP or TCP/UDP probes to enumerate live hosts and infer firewall rule sets.": {
            "Data": "Zeek conn.log; Zeek icmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and icmp.log for external sources sending packets (e.g., TCP SYN to various ports, ICMP Echo Requests) sequentially or systematically across contiguous IP addresses in the organization's allocated network ranges. Correlate connection states in Zeek conn.log (e.g., 'REJ' for firewall rejections, 'RSTO' for closed port on live host, 'S1' for open port) to infer firewall presence and ACLs. Use correlation analysis to link a single source IP to a sweeping pattern across a /24 or /16 network block, indicating a systematic attempt to map network topology."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```