```json
[
  {
    "Is the adversary performing reconnaissance using spearphishing services? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1598.001 - Spearphishing Service": {
          "Incoming emails from domains, IP addresses, or with SMTP headers known to be associated with phishing or reconnaissance campaigns.": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate metadata from incoming emails (sender domain/IP from Zeek smtp.log and conn.log) against high-confidence cyber threat intelligence (CTI) feeds specializing in phishing infrastructure. Also, match SMTP HELO strings from Zeek smtp.log against lists of known-bad or suspicious values. Alert on any positive matches for immediate investigation."
          },
          "Incoming emails that impersonate key personnel (e.g., CEO, CFO, HR) or departments but originate from common webmail providers (e.g., gmail.com, outlook.com, protonmail.com).": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the 'from' field in Zeek smtp.log. Maintain a list of display names for key internal personnel and departments. Use regular expressions to identify emails where the display name matches an entity on the list, but the sender's actual email domain is a generic, public provider. Assign a higher risk score to emails matching this pattern and flag for review."
          },
          "Incoming emails with subject lines containing keywords or phrases commonly used in reconnaissance phishing (e.g., 'Urgent Directory Update', 'Confirm Your Details', 'Organizational Chart Request').": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan the 'subject' field in Zeek smtp.log for a curated list of suspicious keywords and phrases associated with information-gathering attempts. Use correlation analysis to identify campaigns where multiple users receive emails with the same or similar reconnaissance-themed subjects from a single external source or domain within a short time frame. Track the frequency of these subject patterns to identify emerging campaigns."
          },
          "A sudden, anomalous increase in email volume from a single, new, or low-reputation external domain to multiple employees, especially if the emails share similar characteristics.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile incoming email traffic using Zeek smtp.log to establish a baseline of volume and frequency for sending domains. Use time series analysis (e.g., ARIMA, moving averages) to detect statistically significant spikes in email volume from a specific sender domain or IP address. Cross-reference sending domains with WHOIS data to check for recent registration dates. Use clustering algorithms to group emails sent to multiple recipients based on sender, subject similarity, and other metadata to identify targeted campaigns originating from new or untrusted domains."
          },
          "Multiple employees concurrently initiating browser processes that connect to the same unusual or newly-registered domain, potentially in response to a spearphishing link.": {
            "Data": "Zeek http.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Windows Event ID 4688) for browser executions (e.g., chrome.exe, firefox.exe, msedge.exe). Correlate these events with subsequent network requests from the same host in Zeek http.log and dns.log. Use correlation analysis to identify external domains that are accessed by multiple distinct internal hosts within a short time window (e.g., 5-30 minutes). Prioritize domains with low reputation scores or recent registration dates. A time-based cluster of browser launches followed by traffic to the same new domain across multiple endpoints is a strong behavioral indicator of a coordinated phishing campaign."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```