
[
  {
    "Is the adversary gathering information about organizational roles? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1591.004 - Identify Roles": {
          "External network scanning or connection attempts originating from IP addresses or domains known to be associated with reconnaissance campaigns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from all inbound connection attempts recorded in Zeek conn.log against a high-confidence, frequently updated cyber threat intelligence (CTI) feed of IPs known for scanning, hosting malicious reconnaissance tools, or associated with recon-focused threat actors. Alert on any matches and investigate the scope and targets of their activity."
          },
          "Web traffic to public-facing assets containing User-Agent strings, HTTP headers, or request patterns characteristic of automated reconnaissance and scraping tools.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor inbound Zeek http.log requests for User-Agent strings and other HTTP headers associated with common scanning/scraping tools (e.g., Nmap, Nikto, Feroxbuster, sqlmap, Python-requests, Scrapy). Use regular expression matching to detect these patterns. Also, analyze for request patterns like rapid traversal of web directories or sequential enumeration of potential API endpoints. Maintain and update a list of such signatures."
          },
          "Systematic probing or scanning from a single external source across a range of network services that could indicate an attempt to map out role-specific access points.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate Zeek conn.log data by external source IP address over short time windows (e.g., 5-15 minutes). Identify sources connecting to an unusually high number of distinct destination ports, especially those associated with role-specific access (e.g., RDP 3389, SSH 22, VPN ports 500/4500, Citrix 443/1494/2598, WinRM 5985/5986). Use frequency analysis and descriptive statistics (e.g., count of distinct ports per IP) or IQR to flag outlier IPs exhibiting scanning behavior."
          },
          "Anomalously high rates of failed authentication attempts against external-facing login portals using a dictionary of potential usernames that align with common organizational roles.": {
            "Data": "Windows Event ID 4625; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 (failed logon) logs from exposed servers (e.g., ADFS, Exchange) for high-volume failures from a single source IP. Analyze the target usernames for patterns suggesting enumeration (e.g., 'admin', 'administrator', 'dev', 'finance', 'hr', 'test'). For web portals, analyze Zeek http.log for repeated POST requests to login pages with varying username parameters. Use entropy measures on the set of attempted usernames from a single source IP to detect dictionary-based enumeration."
          },
          "Anomalous external connections to or downloads from public-facing infrastructure that may inadvertently leak organizational role information via misconfigured files or APIs.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for external requests that result in HTTP status codes indicative of information discovery (e.g., 200 OK for requests to `.git/config`, `web.config`, `.env`, or API endpoints that return user lists). Analyze Zeek files.log for unusual downloads of documents (e.g., org charts, employee lists) from unexpected web directories. Use correlation analysis to link these events with other reconnaissance indicators from the same source IP. Establish a baseline of normal file downloads and use outlier detection to identify anomalous activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
