[
  {
    "Is the adversary gathering information about our network infrastructure? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590 - Gather Victim Network Information": {
          "Network traffic indicating external scanning activity (e.g., port scans, host sweeps) targeting organizational IP ranges.": {
            "Data": "Zeek conn.log; Zeek scan.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and scan.log for rapid sequences of connections to different ports on the same host or different hosts on the same port from external sources (port scan/host sweep). Use clustering algorithms or density-based methods to group scan-like activity. Calculate the entropy of destination ports/IPs per source IP to identify scan patterns. Flag source IPs exhibiting high entropy or rapid connection rates."
          },
          "External DNS queries for internal or unusual subdomains from suspicious sources.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for incoming external queries. Identify queries for internal domains or subdomains not typically exposed externally. Calculate the frequency of queries per external source IP and requested domain. Use descriptive statistics and percentile analysis to identify external sources making an unusually high number of queries or querying rare internal/unusual hostnames."
          },
          "Anomalous or high-volume external requests to public-facing web servers for files or paths commonly associated with network information disclosure or misconfigurations.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for external GET/POST requests to URIs like `robots.txt`, `sitemap.xml`, known backup file extensions (e.g., `.bak`, `.old`), directory traversal patterns (`../`), or paths related to version control systems (e.g., `/.git/`, `/.svn/`). Analyze HTTP status codes (e.g., 200 for sensitive files, 403s, 404s that might reveal paths, 500s that leak info). Use frequency analysis on requested URIs and source IPs. Flag source IPs with high request rates for such files or those that generate a high number of error responses indicative of probing. Correlate with User-Agent strings known to be used by scanners."
          },
          "External connection attempts exhibiting characteristics of service enumeration or banner grabbing tools (e.g., unusual protocol handshakes, specific payloads to known service ports, or triggering security tool alerts).": {
            "Data": "Zeek conn.log; Zeek notice.log; Zeek software.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for patterns of short-lived connections or incomplete handshakes from external IPs to multiple service ports (e.g., FTP, SSH, Telnet, SMTP, specific application ports). Monitor Zeek notice.log for alerts like `Scan::Address_Scan`, `SSL::Invalid_Server_Cert`, or custom notices for reconnaissance tools. Check Zeek software.log for unexpected software versions being reported by internal services if banner grabbing attempts elicit version responses. Apply descriptive statistics on connection durations and states per source IP. Use correlation analysis between conn.log patterns and notice.log alerts from the same source IP."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]