[
  {
    "Is the adversary gathering information about our host hardware during reconnaissance? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592.001 - Hardware": {
          "External probes or scans attempting to elicit hardware/version information from network services (e.g., banner grabbing attempts).": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and ssl.log for connections originating from external IPs targeting common service ports (e.g., 22, 80, 443, 3389). Look for unusual patterns in user agents (http.log), SSL client details (ssl.log), or rapid connection attempts (conn.log) characteristic of scanning tools. Use frequency analysis to identify source IPs conducting widespread probes and time series analysis to detect scanning patterns."
          },
          "Attempts to enumerate system information (including hardware details) using standard system commands or tools on hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events associated with commands used to query system hardware information (e.g., 'wmic computersystem get model,manufacturer', 'systeminfo', 'Get-ComputerInfo'). Filter for processes initiated by unusual users or running in unexpected contexts. Use correlation analysis to link these events with other suspicious activities on the host."
          },
          "Anomalous network traffic patterns targeting specific ports or services known to sometimes reveal hardware details (e.g., SNMP, NetBIOS/SMB) from external or unusual internal IPs.": {
            "Data": "Zeek conn.log; Zeek smb.log; Zeek dce_rpc.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek logs (conn.log, smb.log, dce_rpc.log) for connections to ports associated with protocols like SNMP (161/UDP/TCP), NetBIOS/SMB (137/138/139/445). Analyze source IPs (especially external or unusual internal ones) and connection patterns. Look for repeated enumeration attempts or connections from unexpected sources. Use frequency analysis to identify rare source IPs and time series analysis to spot unusual spikes in activity towards these services."
          },
          "Execution of legitimate system information gathering tools followed immediately by network connections to external or unusual internal destinations.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events for processes like 'systeminfo', 'wmic', 'powershell' (when used for system info) with subsequent Windows Event ID 5156 events or Zeek conn.log entries showing outbound network connections from the same host shortly after the information gathering command executed. Flag connections to external IPs or internal IPs not typically accessed by the host. Use time-based correlation to identify suspicious sequences of events indicating data transfer after reconnaissance."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]