```json
[
  {
    "Is the adversary conducting reconnaissance to identify network trust dependencies? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.003 - Network Trust Dependencies": {
          "Network connections or DNS queries originating from or targeting IP addresses/domains known to be associated with reconnaissance campaigns or malicious actors.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source/destination IP addresses in Zeek conn.log and domains queried in Zeek dns.log against a high-confidence cyber threat intelligence (CTI) feed specializing in reconnaissance infrastructure (e.g., known public scanners, actor-controlled VPSs, malicious DNS servers). Alert on any matches, especially those interacting with network segments or services associated with trusted third parties."
          },
          "Execution of reconnaissance-specific commands or use of reconnaissance tool signatures on internal systems by accounts associated with a trusted partner network.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Servers, Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation with Command Line) on servers accessible by trusted partners. Filter for processes initiated by partner accounts or from partner IP ranges. Alert on a watchlist of specific reconnaissance commands (e.g., `nltest`, `net group`, `nmap`, `whoami /all`). Additionally, monitor Zeek http.log for User-Agent strings associated with common reconnaissance tools (e.g., 'Nmap Scripting Engine', 'masscan') in traffic originating from partner networks."
          },
          "Anomalous network scanning activity from external or partner networks, identified by a high ratio of connections to unique ports or hosts compared to established baselines.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections originating from external or trusted partner IP ranges. For each source IP, calculate the number of unique destination IPs and unique destination ports contacted within a time window (e.g., 5 minutes). Establish a baseline for these metrics. Use statistical methods like the Inter-Quartile Range (IQR) or Z-scores to identify sources with an anomalously high number of unique destinations, indicating network or port scanning. Correlate findings with a high ratio of failed connection states (e.g., 'S0', 'REJ') which are common in scans."
          },
          "Anomalous DNS query patterns, such as zone transfer attempts or an unusually high volume or entropy of queries for subdomains of partner-related domains, indicating DNS reconnaissance.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for DNS request types. Specifically alert on any `AXFR` or `IXFR` (zone transfer) requests originating from unauthorized external or partner IP addresses targeting your domains. For query patterns, establish a baseline for query volume and subdomain entropy per source IP for domains associated with your organization and its trusted partners. Use time series analysis to detect spikes in query volume and entropy calculations to identify subdomain enumeration attempts (e.g., a source querying aaaa.partner.com, aaab.partner.com, etc.)."
          },
          "An authenticated user account associated with a trusted partner performing broad or unusual resource enumeration on internal systems, deviating from their established baseline of activity.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4663",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On servers accessible by partners, baseline the typical scope of activity for partner accounts using Windows Event IDs 5140 (Network Share Access) and 4663 (Object Access). Monitor for deviations, such as a single partner account accessing an abnormally high number of unique files/shares or attempting to access sensitive directories outside their normal scope within a single session. Use descriptive statistics (mean, std dev of files accessed per session) and percentile analysis to flag outlier sessions indicative of internal reconnaissance."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```