[
  {
    "Is the adversary conducting reconnaissance by searching victim-owned websites? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1594 - Search Victim-Owned Websites": {
          "High volume of requests or rapid sequence of requests to website pages from a single external source IP.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for external source IPs accessing the victim's website. Calculate the total request count and requests per unit of time (e.g., requests per minute) for each source IP. Use statistical methods like outlier detection (e.g., Z-score or IQR) to identify source IPs with significantly higher request volumes or rates than the average."
          },
          "Requests for known hidden files (robots.txt, sitemap.xml, hidden directories) or suspicious user-agent strings accessing the website.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for requests targeting specific paths like '/robots.txt', '/sitemap.xml', or known hidden directories. Also, analyze the 'user_agent' field in http.log. Identify requests for hidden paths or user agents that are unusual or known to be associated with scanning/crawling tools. Use frequency analysis on user-agent strings to identify rare ones."
          },
          "Frequent access from an external IP to specific website sections likely containing employee, contact, or internal business details (e.g., /about-us, /contact, /team, /staff).": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests from external IPs to specific URLs or URL patterns (e.g., containing 'about', 'contact', 'team', 'staff', 'personnel'). Identify external source IPs frequently accessing a large number of pages within these sections within a short timeframe. Use correlation analysis or frequency distribution of visited paths per source IP to identify anomalous access patterns to sensitive sections."
          },
          "Requests to sensitive pages lacking typical internal referer headers or exhibiting unusual navigation paths (e.g., jumping directly to deep links without browsing).": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the 'referer' field in Zeek http.log for requests originating from external IPs. Identify requests to potentially sensitive pages (as defined by URL patterns or context) where the referer field is empty, malformed, or points to an external site, deviating from normal user navigation. Use sequence analysis on Zeek http.log events for a given source IP to identify unusual page access orders (e.g., accessing deep links or sensitive pages without logical preceding navigation)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]