```json
[
  {
    "Is the adversary gathering information about our organization's software? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592.002 - Software": {
          "Inbound connections to public-facing services from IP addresses known to be associated with malicious scanning, reconnaissance campaigns, or threat actor infrastructure.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from all inbound Zeek conn.log traffic targeting public-facing web servers and application servers against multiple, high-confidence, and frequently updated cyber threat intelligence (CTI) feeds. Specifically subscribe to feeds listing known scanners, TOR exit nodes, malicious proxies, and infrastructure associated with known threat actors. Alert on high-confidence matches and investigate associated activity for further reconnaissance patterns."
          },
          "Inbound HTTP/S requests to public-facing services containing User-Agent strings, URI patterns, or request headers characteristic of common vulnerability scanners or software fingerprinting tools.": {
            "Data": "Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan all inbound Zeek http.log requests for User-Agent strings that match a curated list of reconnaissance tools (e.g., Nmap, Nikto, Acunetix, Burp Suite, ZGrab, Metasploit). Look for URI patterns indicative of probing for known software vulnerabilities or administrative interfaces (e.g., '/wp-admin', '/admin.php', requests for '/.git/config', '/.env', or paths related to specific CVEs). Analyze Zeek ssl.log for anomalous JA3/JA3s hashes associated with such tools. Maintain and use regular expression matching against a frequently updated list of these tool-specific patterns."
          },
          "An external source IP exhibiting broad, systematic, or unusually paced scanning behavior across multiple ports or web application paths on public-facing servers.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify external source IPs connecting to a high number of destination ports on one or more servers in a short time frame (horizontal/vertical scanning). Analyze Zeek http.log for sources requesting a large number of non-existent pages (indicated by 404 error codes) or systematically traversing directory structures. Calculate the entropy of destination ports or requested URIs per source IP to identify scanning behavior. Use time series analysis to detect unusual spikes in connection attempts or error rates from a single external source, indicating automated reconnaissance."
          },
          "Anomalous or malformed requests from an external source designed to elicit detailed error messages or version information from public-facing software and services.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for inbound requests that are syntactically unusual, contain unexpected data types, use invalid methods, or are otherwise crafted to trigger application exceptions. Correlate these requests with server responses that contain verbose error messages, stack traces, or explicit software version banners (e.g., in Server or X-Powered-By headers). Establish baselines for normal server error rates and types (e.g., 4xx, 5xx) and alert on significant deviations, especially when correlated with a specific external source IP. Use linear regression to model normal error rates and flag outliers."
          },
          "Outbound connections from internal hosts to newly-registered domains (NRDs) or websites with a history of hosting fingerprinting scripts, which may indicate a user has visited a strategically compromised website.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries to newly-registered domains (e.g., registered within the last 30-60 days) or domains with low reputation scores. Correlate DNS queries with subsequent outbound connections in Zeek conn.log and HTTP requests in Zeek http.log. Analyze the content or behavior of these sites for the presence of known browser or software fingerprinting scripts (e.g., FingerprintJS, Panopticlick). Use descriptive statistics to identify internal hosts with an unusually high frequency of connections to NRDs or suspicious sites, which may indicate a user is being targeted for passive reconnaissance."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```