[
  {
    "Is the adversary conducting reconnaissance to identify network trust dependencies? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.003 - Network Trust Dependencies": {
          "Network connections from external sources attempting to enumerate services or endpoints used by trusted partner organizations.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, http.log, and ssl.log for connections originating from external IP ranges or known suspicious IPs targeting IP addresses or hostnames associated with trusted partner network segments or services. Use statistical analysis (e.g., frequency distribution, correlation analysis) to identify unusual spikes in connection attempts or service enumeration patterns targeting these specific destinations."
          },
          "DNS queries resolving domains known to be associated with trusted third-party service providers.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries resolving domains known to be used by trusted third-party service providers. Use time series analysis or entropy measures on query patterns from external or suspicious internal sources to identify unusual reconnaissance activity targeting these domains."
          },
          "Scanning activity originating from external IPs or trusted third-party network segments targeting internal subnets or services potentially accessible via trust dependencies.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connection attempts (especially failed attempts) originating from external or trusted partner IP ranges targeting multiple internal hosts or ports within a short time window. Identify patterns consistent with port scanning (e.g., numerous connections to different ports on one host) or network scanning (e.g., connections to the same port across many hosts). Use statistical methods (e.g., counts of unique destination IPs/ports per source IP per time window, correlation analysis of source IP and destination sweep) to identify outliers indicative of scanning activity."
          },
          "Enumeration activity (e.g., listing shares, directories) on internal servers accessible via trusted relationships, originating from user accounts or hosts associated with those relationships.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 5140 (Network Share Access), 4663 (Attempted Access to an Object), and 4688 (Process Creation) on critical internal servers frequently accessed by trusted third parties. Filter events for source IP addresses or user accounts associated with these relationships. Analyze event volume and patterns for unusual enumeration behavior (e.g., accessing an excessive number of shares/files, attempting access to sensitive objects not typically accessed) using frequency analysis. Additionally, monitor 4688 for process creation indicative of reconnaissance commands (e.g., `net view`, `dir`) initiated by these users/IPs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]