[
  {
    "Is the adversary conducting reconnaissance using spearphishing? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1598.002 - Spearphishing Attachment": {
          "Multiple internal recipients receiving emails from a single external sender not previously observed, potentially failing SPF/DKIM checks.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log to identify source email addresses and destination recipients. Group logs by sender and count the number of unique internal recipients. Identify external senders with a high volume of emails to multiple internal users. Check for 'spf_pass' and 'dkim_pass' fields in smtp.log. Investigate senders with low frequency of prior communication or failing SPF/DKIM using descriptive statistics on sender frequency."
          },
          "Evidence of attachment interaction, such as execution of suspicious files originating from email attachments or suspicious outbound network connections shortly after receiving emails.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) on endpoints, filtering for processes spawned by email clients or common document viewers. Correlate process creation events with recent email delivery times (from smtp.log if available). Analyze Zeek conn.log for new outbound connections originating from these endpoint IPs shortly after suspicious process creation events, looking for low-frequency or unusual destinations using statistical analysis."
          },
          "Outbound network connections to unusual external websites or services originating from endpoints shortly after receiving an email with an attachment or link.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log and http.log entries showing outbound connections from internal endpoints with recent email delivery times (from smtp.log). Identify connections to external IPs/domains not commonly accessed by the user or organization. Use frequency analysis and statistical profiling (e.g., percentiles, IQR) of outbound network destinations per user/endpoint to identify outliers and rare connections shortly after email receipt."
          },
          "Execution of suspicious command-line tools or scripts originating from processes spawned by email attachments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation on endpoints. Filter for processes whose parent process is a common email client or document viewer. Correlate these events with recent email receipt times (from Zeek smtp.log if available). Analyze the 'New Process Command Line' field for patterns indicative of script execution (e.g., powershell, wscript, cscript), execution of command processors (cmd.exe), or data staging/collection tools. Use frequency analysis or rule-based detection to flag command lines that are rare or match known suspicious patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]