[
  {
    "Is the adversary performing active scanning against our external infrastructure? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1595 - Active Scanning": {
          "Detection of high-volume or unusual network traffic patterns originating from a single external source IP address targeting multiple internal/external IPs/ports.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and weird.log for connections to external-facing infrastructure. Group connections by source IP and count destination IPs/ports contacted. Identify source IPs with unusually high connection counts or unique destination ports/IPs relative to other sources using descriptive statistics (e.g., mean, standard deviation, or IQR analysis) or by setting static thresholds. Flag sources exceeding statistical outliers or thresholds."
          },
          "Identification of specific scan signatures (e.g., SYN scan, Xmas tree scan, OS/service fingerprinting attempts) in network traffic targeting external interfaces.": {
            "Data": "Zeek conn.log; Zeek weird.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek conn.log (TCP flags, connection states), weird.log (protocol anomalies), and http.log (unusual User-Agent or header fields, rapid requests to diverse paths) for patterns indicative of specific scan types. Look for correlation between specific external source IPs and multiple detected scan signatures within a short time window. Develop signatures or rules to flag common scanning techniques."
          },
          "Detection of rapid, widespread ICMP requests or connection attempts to a wide range of IPs/ports from a single external source.": {
            "Data": "Zeek icmp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek icmp.log for a high rate of ICMP Echo Requests (type 8) originating from single external IPs targeting multiple internal IPs within a short time window (e.g., count unique destinations per source IP per minute). Similarly, analyze Zeek conn.log for external source IPs attempting connections to a large number of distinct internal destination IPs or ports using protocols commonly targeted by service scans (e.g., TCP 22, 23, 80, 443, 3389). Use frequency analysis or statistical thresholds to identify source IPs exhibiting high-volume or high-unique destination connection patterns."
          },
          "Identification of unusual or known scanning tool User-Agent strings or other HTTP header anomalies in traffic targeting external web services.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for connections to external-facing web servers. Filter logs for suspicious User-Agent strings commonly associated with scanning tools or libraries (e.g., 'Nmap', 'python-requests', 'Go-http-client', known vulnerability scanner names) or unusual/malformed header fields (e.g., excessive length, unusual characters, missing core headers). Use frequency analysis to identify source IPs or User-Agent strings with unusual occurrence patterns relative to baseline. Correlate suspicious headers with high connection volume or attempts to diverse paths from the same source IP."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]