[
  {
    "Is the adversary gathering information about victim hosts? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592 - Gather Victim Host Information": {
          "Detection of external scanning/probing activity targeting network services or hosts.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 5156",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for patterns indicative of scanning (e.g., connections or lookups to multiple ports/hosts from a single source IP over a short period). Identify frequent failed connection attempts (Windows Event ID 4625) from external IPs to common service ports. Use correlation analysis to identify patterns of probing activity across different log types."
          },
          "External web traffic containing unusual or suspicious User-Agent strings or excessive information requests.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek http.log for requests originating from external IPs targeting internal or exposed web services. Analyze User-Agent strings for suspicious or malformed values. Use descriptive statistics and frequency analysis to identify anomalous User-Agent strings or unusual volumes/patterns of requests from specific external sources."
          },
          "Outbound connections from internal hosts to known malicious domains or IPs associated with reconnaissance infrastructure (e.g., ScanBox C2s) or services known for information gathering.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for outbound connections from internal hosts to URLs, domains, or IP addresses identified in threat intelligence feeds as being part of reconnaissance campaigns or hosting information-gathering malware (like ScanBox). Analyze HTTP headers in Zeek http.log for unusual parameters or excessive host-specific information being sent. Use correlation analysis to link DNS queries (Zeek dns.log) for suspicious domains with subsequent connections (Zeek conn.log)."
          },
          "Specific queries from external IPs to publicly accessible services (e.g., web servers, API endpoints) that attempt to enumerate detailed host information, software versions, or configurations, beyond normal browsing behavior.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for unusual URI patterns, query parameters, or HTTP methods originating from external IPs targeting known web applications or APIs that might reveal host details (e.g., requests for `/.git/config`, `/.env`, `phpinfo.php`, specific version-revealing paths, or excessive OPTIONS requests). Use regular expressions to search for known information-gathering query patterns. Establish baselines for common URIs accessed on public services and flag low-frequency, suspicious queries using frequency analysis. Use time series analysis on the frequency of such queries from specific external IPs."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]