
[
  {
    "Is the adversary conducting reconnaissance on our business relationships? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1591.002 - Business Relationships": {
          "Network connections or DNS queries involving IP addresses or domains known to be associated with reconnaissance tools, scanning services, or threat actors known for supply chain targeting.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate all inbound and outbound network connections (Zeek conn.log) and DNS queries (Zeek dns.log) against a high-confidence cyber threat intelligence (CTI) feed of IPs and domains associated with reconnaissance activities, malicious proxy services, or known threat actor infrastructure. Additionally, cross-reference DNS query responses to check for typosquatted domains mimicking legitimate business partners. Alert on any confirmed matches."
          },
          "Anomalous DNS query patterns or web traffic exhibiting characteristics of automated scraping/crawling tools targeting public-facing web pages that list business partners or clients.": {
            "Data": "Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for unusual query types such as 'ANY' or 'AXFR' which may indicate attempts at DNS zone transfers. In Zeek http.log, use regular expressions to monitor for User-Agent strings of known web scraping tools (e.g., Scrapy, HTTrack, Wget) targeting public URLs containing keywords like 'partners', 'clients', or 'about-us'. Analyze request frequency from single source IPs to these pages; a high, rapid rate of requests is a strong pattern for automated crawling. Use correlation analysis to link suspicious User-Agents with high request volumes."
          },
          "Anomalous external connection attempts or scanning activity targeting network services specifically configured for business partner interaction, such as partner extranets, B2B APIs, or dedicated VPN endpoints.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and baseline normal traffic patterns for network services dedicated to business partner interaction. Monitor Zeek conn.log for external connection attempts to these services from IP addresses not on an allow-list of known partner IPs. Use frequency analysis to distinguish widespread scanning (many IPs, few attempts each) from targeted probing (few IPs, many attempts). Analyze Zeek weird.log for malformed packets or protocol violations targeting these services, which may indicate enumeration or vulnerability discovery. Use time series analysis on connection volume from unknown sources to detect anomalous spikes."
          },
          "Anomalous network traffic patterns originating from the legitimate IP space of a known business partner, such as connections to unusual internal assets or data transfers inconsistent with normal business operations.": {
            "Data": "Zeek conn.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an inventory of trusted IP ranges for key business partners. Establish a baseline for normal traffic from these partners (e.g., typical destination ports/hosts, data transfer volumes, protocols). Monitor Zeek conn.log for traffic from these partner IPs that deviates from the established baseline, such as connections to internal administrative interfaces, development servers, or employee workstations instead of the expected application servers. Use the Inter-Quartile Range (IQR) method or Z-scores to flag anomalous data transfer volumes (from Zeek files.log or conn.log bytes) or connection counts."
          },
          "An internal user account, particularly one involved with partner management, exhibiting unusual information gathering behavior, such as accessing an abnormally large volume of partner contracts, contact lists, or technical integration documents.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4624",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network shares and document repositories containing sensitive business relationship information. Monitor access events (Windows Event ID 4663) to these locations. For each user, establish a baseline of normal access patterns. Flag users who access an unusually high number of distinct files or a large volume of data compared to their historical baseline or their peer group's activity. Use percentile analysis on file access counts per user session (bracketed by logon/logoff events, e.g., Event ID 4624) to identify outliers. High entropy in accessed file paths for a single user in a short timeframe can also indicate broad, non-specific information gathering."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
