[
    {
        "information_requirement": "Is the adversary performing reconnaissance by purchasing technical data?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1597.002",
                "name": "Purchase Technical Data",
                "evidence": [
                    {
                        "description": "Login attempts (successful or failed) to corporate services using credentials known to be part of publicly reported data breaches or found on dark web marketplaces specific to the organization.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4625",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Regularly ingest lists of breached credentials (username/email, password hashes/plain text if available) associated with the organization's domains from reputable breach notification services or specialized dark web monitoring. Correlate these credentials against both failed (Windows Event ID 4625) and successful (Windows Event ID 4624) login attempts to internal and external corporate services (monitored via Zeek conn.log for external services). Alert on any direct matches or high-probability matches (e.g., username match with common password variations from breach). Initiate credential reset procedures for affected accounts and investigate successful logins for further compromise. Use descriptive statistics to track the frequency of such attempts over time."
                    },
                    {
                        "description": "A sequence of targeted reconnaissance activities against specific, non-public systems or user accounts shortly after alerts or intelligence indicating a potential data leak or sale involving the organization's technical data.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4625",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Upon receiving intelligence about a potential data sale or leak concerning the organization (e.g., from dark web monitoring, CTI providers), proactively monitor for a pattern of activity: 1. Increased or highly specific scanning/connection attempts (Zeek conn.log) towards internal IP ranges, hostnames, or services potentially detailed in the purchased data. 2. Followed by targeted login attempts (Windows Event IDs 4625, 4624) against user accounts that might have been exposed. 3. Subsequent internal network probing if any login is successful. Correlate these event types (scanning, login attempts, internal probing) based on source IP and within a defined timeframe (e.g., 1-7 days) post-intelligence receipt. Use correlation analysis and potentially simple time series forecasting to see if activity exceeds expected random noise."
                    },
                    {
                        "description": "Highly targeted and unusual external connection attempts to specific internal, non-public services or ports, suggesting prior knowledge of internal infrastructure details potentially obtained via purchase.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for connection attempts from previously unseen or low-reputation external IPs to internal hosts/ports that are not typically exposed or are unexpected based on known public infrastructure. Establish a baseline of 'normal' background internet noise versus highly specific targeting. Use frequency analysis and clustering (e.g., K-means on connection features) to identify rare connection attempts (e.g., single IP to a unique internal host:port combination not seen before) or small groups of IPs exhibiting this behavior. Compare observed targets against an inventory of internal, non-public services. Calculate entropy measures on destination ports per source IP; low entropy might indicate highly focused activity."
                    },
                    {
                        "description": "Anomalous login patterns (e.g., credential stuffing, password spraying, impossible travel) using accounts that may have been compromised through purchased data, across various corporate services.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4625",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event IDs 4624 (successful login) and 4625 (failed login) across all accessible services for patterns indicative of credential abuse that could leverage purchased credentials. This includes: a) High rate of failed logins for a single user from multiple IPs (credential stuffing). b) High rate of failed logins from a single IP or subnet for multiple users (password spraying). c) Successful logins from new, geographically unusual, or multiple disparate geolocations for a single user in a short timeframe ('impossible travel'), using IP geolocation from Zeek conn.log. Use descriptive statistics (counts, rates, frequency distributions), Inter-Quartile Range (IQR) and box-plots to identify outliers in login attempts/failures. Correlate identified accounts with lists of users potentially exposed in known breaches."
                    },
                    {
                        "description": "Targeted scanning or exploitation attempts against specific, non-public services or vulnerabilities (especially zero-days or unpatched known vulnerabilities) whose details might have been part of purchased technical data.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Windows Event ID (Application Log for service errors/crashes)",
                            "Windows Event ID (System Log for service errors/crashes)"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log and Zeek http.log for focused scanning (e.g., low volume, specific ports/URLs) or traffic matching exploit signatures/patterns targeting non-public services or unique organizational infrastructure components from external IPs. Pay special attention to attempts against services whose vulnerabilities or specific configurations are not widely publicized. Correlate these network-observed attempts with server-side logs (Windows Application/System Event Logs) for unusual errors, service crashes, or anomalous behavior that might indicate successful or attempted exploitation. Use time series analysis on the frequency of such targeted events to detect unusual spikes, potentially correlating these with external intelligence regarding data sales or new exploit kits targeting specific infrastructure elements."
                    },
                    {
                        "description": "Anomalous access patterns to cloud services or externally-facing enterprise applications using credentials potentially sourced from purchased data breaches, including unusual data access or administrative actions.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for connections from external IPs to corporate cloud services (e.g., O365, AWS, GCP) or other critical SaaS applications. Monitor for successful authentications (correlate with Windows Event ID 4624, especially Logon Type 9 for ADFS/federated identity, or infer from traffic patterns in Zeek http.log if applicable) followed by anomalous behavior. This could include access to unusual services/data within the cloud platform, high-volume data downloads, or administrative changes (e.g., new user creation, permission changes, if inferable from API call patterns in Zeek http.log for unencrypted traffic). Establish baselines for user/application access patterns to these external services and use descriptive statistics, time series analysis, or linear regression models to detect deviations that might indicate misuse of purchased credentials for reconnaissance or staging further attacks."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
