[
  {
    "Is the adversary conducting reconnaissance via phishing for information? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1598 - Phishing for Information": {
          "Email traffic exhibiting characteristics of sender spoofing (e.g., SPF/DKIM failures, mismatched headers) or unusual sender patterns (e.g., single unknown sender to multiple internal accounts).": {
            "Data": "Zeek smtp.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log and dns.log for incoming messages with SPF/DKIM failures or header anomalies indicative of spoofing. Identify incoming email campaigns where a single external sender address or domain attempts to send messages to a statistically significant number of internal recipients (using frequency analysis)."
          },
          "Email messages containing suspicious requests for sensitive information (e.g., credentials, personal data) or links/phone numbers pointing to uncategorized or known-bad destinations.": {
            "Data": "Zeek http.log; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log, conn.log, and dns.log for connections originating from internal users shortly after receiving emails. Extract URLs from email logs (if available, otherwise infer from network connections) and perform automated lookups against threat intelligence feeds and URL categorization services. Use correlation analysis to link recipients of suspicious emails to subsequent network activity (e.g., connections to flagged IPs/domains)."
          },
          "High volume of outbound email replies or new conversations initiated by internal users towards suspicious external domains or newly created external accounts shortly after receiving an initial email.": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smtp.log for outbound emails from internal users to external domains/addresses not in a baseline of frequent contacts. Use Zeek conn.log to identify related outbound connections. Calculate the frequency and volume of outbound communications for internal users to rare or new external destinations. Flag users with a statistically significant increase in outbound emails/connections to unusual external contacts, especially if correlated with receiving emails flagged as suspicious."
          },
          "Process execution or network connections on internal endpoints or servers following user interaction with email content that attempt to exfiltrate data or connect to unusual external sites.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek http.log; Zeek conn.log",
            "Data Platform": "Endpoints; Servers; Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 (process creation) and 5156 (outbound network connections) on endpoints/servers. Identify processes spawned shortly after a user (based on successful logon Event ID 4624 correlation or known email recipients) interacts with email content (e.g., browser child processes, script hosts). Correlate these processes/connections with Zeek logs (http.log, conn.log) to identify connections to known malicious IPs/domains or destinations statistically rare for the user/organization (using frequency analysis or entropy measures)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]