
[
  {
    "Is the adversary conducting reconnaissance on client configurations? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592.004 - Client Configurations": {
          "Outbound connections from internal clients to external domains or IP addresses known to be associated with malicious reconnaissance, phishing kits, or client fingerprinting services.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join destination IPs from Zeek conn.log and queried domains from Zeek dns.log with a high-confidence, continuously updated threat intelligence feed listing infrastructure known for reconnaissance, client fingerprinting, or phishing campaigns. Alert on any matches. Investigate associated HTTP requests in Zeek http.log for additional context on the nature of the interaction."
          },
          "Outbound HTTP requests containing URI patterns, specific Javascript library names, or parameter combinations known to be used by common client fingerprinting toolkits.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan Zeek http.log URIs and request bodies for signatures of known client fingerprinting scripts and libraries (e.g., 'fingerprint.js', 'client.js', or specific patterns from tools like CanvasBlocker). Maintain and apply a list of regular expressions to match these known patterns in URLs or POST data. Correlate multiple requests to the same external domain containing these patterns from a single client to increase detection confidence."
          },
          "Anomalous patterns of inbound network scanning from external sources targeting client-side services, indicating an attempt to enumerate client software and operating system versions.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for a high diversity of destination ports being probed from a single external IP or subnet, especially targeting common client ports (e.g., SMB 139/445, RDP 3389, VNC 5900+, SSH 22) across a range of internal client IP addresses. Use statistical analysis to flag sources exceeding a baseline for connection attempts or port diversity (e.g., high entropy of destination ports per source IP). Analyze Zeek weird.log for events like 'bad_TCP_checksum' or 'possible_split_routing' that often accompany scanning activity."
          },
          "Anomalous characteristics in outbound web requests, such as an unusually high number of HTTP headers or requests to diverse, unrelated domains in a short time frame from a single client, suggestive of browser fingerprinting.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline for the number and type of HTTP headers per outbound request for different client populations. Use descriptive statistics (mean, standard deviation, box-plots) to identify requests with an outlier number of headers. Monitor for the presence of specific, less common headers used for fingerprinting (e.g., Client Hints headers like `Sec-CH-UA-*`). Analyze Zeek dns.log to detect clients making rapid DNS queries for a high number of disparate domains, which can be part of fingerprinting services that test reachability or load components from many sources. Use correlation analysis to link these DNS and HTTP anomalies."
          },
          "An internal host executing commands or running scripts to enumerate local client configurations (e.g., browser versions, installed software) and exfiltrating the results.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "On endpoints, monitor for process creation events (Windows Event ID 4688) associated with reconnaissance commands, such as querying WMI for software lists (`wmic product get name,version`), checking browser registry keys, or running PowerShell scripts with Get-ItemProperty. Correlate the execution of such commands with subsequent outbound network connections (Zeek conn.log) to unknown or suspicious destinations within a short time window. Use time series analysis to detect unusual spikes in data transfers following these local reconnaissance activities."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
