[
  {
    "Is the adversary conducting reconnaissance using public scan databases? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596.005 - Scan Databases": {
          "Targeted probing or scanning activity against services or ports identified in public scan databases that match our network's public profile.": {
            "Data": "Zeek conn.log, Zeek dce_rpc.log, Zeek dns.log, Zeek http.log, Zeek ssl.log, Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn, dce_rpc, dns, http, ssl, weird) for inbound connections and requests targeting services/ports known to be publicly exposed and discoverable via services like Shodan. Compare observed connection patterns (source IPs, ports, protocols, payloads) to typical baseline traffic using descriptive statistics and outlier detection (e.g., IQR). Correlate with external threat intelligence regarding IPs known to scrape scan databases."
          },
          "Login attempts or vulnerability exploitation attempts targeting specific services or versions that are known to be vulnerable and were discoverable via scan databases.": {
            "Data": "Zeek conn.log, Zeek http.log, Zeek ssl.log, Zeek weird.log, Windows Event ID 4624, Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn, http, ssl, weird) and Windows Event Logs (4624, 4625) for login attempts or exploit attempts against specific services (e.g., web servers, databases, SSH, RDP) with known vulnerabilities. Cross-reference the targeted service/version against information commonly found in public scan databases. Look for login attempts using common usernames or patterns discoverable via OSINT/reconnaissance. Use correlation analysis between failed login attempts and specific targeted services/ports found via reconnaissance."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]