```json
[
  {
    "Is the adversary conducting reconnaissance to identify business tempo, or leveraging this knowledge for malicious activity? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1591.003 - Identify Business Tempo": {
          "Network traffic to or from the perimeter originating from IP addresses or using domains/JA3 hashes known to be associated with reconnaissance-as-a-service platforms or specific reconnaissance tools.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously inner join perimeter network logs (Zeek conn.log source/destination IPs, Zeek dns.log queries, Zeek ssl.log JA3/JA3S hashes) against a high-confidence cyber threat intelligence (CTI) feed specializing in reconnaissance infrastructure, updated daily. Investigate any alerts for further low-and-slow reconnaissance activity."
          },
          "A consistent pattern of repeated, passive queries from a single external source to services that reveal activity (e.g., VPN login pages, webmail portals) over an extended period without login attempts, potentially to baseline server response times or observe activity patterns.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and conn.log for external IPs that connect to key external services (VPN, OWA, etc.) repeatedly over weeks or months with very low frequency (e.g., once every few hours). Analyze connection metadata to identify sources that establish a connection but do not proceed to authentication or send minimal data. Use correlation analysis to link these sparse events by source IP over a long time window (30-90 days) to identify this specific passive reconnaissance pattern."
          },
          "Anomalous long-term, low-frequency information gathering from a single external entity across multiple services, inconsistent with normal user or automated scanner behavior.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate connection logs over a long period (e.g., 30-90 days). For each external source IP, calculate the entropy of destination ports/services, the average time between connections, and the total number of connections. Use a clustering algorithm or statistical analysis to flag sources with a unique combination of low connection frequency, long observation period, and moderate-to-high service entropy, which is characteristic of patient reconnaissance rather than automated scanning or normal user traffic."
          },
          "Execution of sensitive commands or access to critical assets during identified low-activity periods (nights, weekends, holidays), deviating from established user and system baselines.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish multi-dimensional baselines of normal activity for critical assets and privileged users, incorporating time-of-day, day-of-week, process execution frequency, file access patterns, and network connection volume. Use time series analysis and descriptive statistics (mean, median, standard deviation) for these baselines. Alert on events such as privileged logins (Event ID 4624), execution of discovery or lateral movement tools (Event ID 4688), or access to sensitive data shares (Event ID 4663) that occur outside of 2-3 standard deviations of the normal time-based activity profile for that user or system."
          },
          "Creation or modification of scheduled tasks or services configured to execute payloads or scripts specifically during non-business hours or holidays.": {
            "Data": "Windows Event ID 4698; Windows Event ID 4702",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for the creation (Windows Event ID 4698) or modification (Event ID 4702) of scheduled tasks. Parse task configuration data to explicitly identify triggers set for outside standard business hours (e.g., 10 PM - 6 AM, weekends, known company holidays). Correlate task creation with the user account that created it and the executable it is configured to run. Use frequency analysis to flag users or systems that anomalously create off-hours tasks, and prioritize the associated binaries/scripts for analysis."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```