[
  {
    "Is the adversary conducting reconnaissance against our external network? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1595.001 - Scanning IP Blocks": {
          "High volume of ICMP or low-port scans targeting external IP ranges.": {
            "Data": "Zeek conn.log; Zeek icmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and icmp.log for traffic targeting external IP ranges. Identify source IPs sending high volumes of ICMP traffic or connection attempts to low/unallocated ports. Use frequency analysis to identify source IPs exhibiting statistically unusual connection patterns to multiple destination IPs within external blocks."
          },
          "Connections to a wide range of common service ports (e.g., 22, 80, 443, 3389) across external IP ranges from a single source, potentially followed by connection resets.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Examine Zeek conn.log for external source IPs attempting connections across a wide distribution of destination ports within external IP ranges. Calculate entropy of destination ports per source IP. Flag source IPs with high destination port entropy or those showing many short-lived connections followed by FIN/RST flags, indicative of port scanning."
          },
          "External scanning activity eliciting specific application-layer responses (e.g., HTTP server banners, SSH versions) from multiple hosts within an external IP range.": {
            "Data": "Zeek http.log; Zeek ssh.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to common service ports (80, 443, 22, etc.) across external IP ranges from a single source IP. Correlate successful connections with corresponding Zeek application logs (http.log, ssh.log). Identify source IPs that successfully elicit server banners or version information from multiple distinct hosts, indicating active version scanning or enumeration attempts. Use correlation analysis to link scan activity in conn.log to specific responses in application logs."
          },
          "High volume of external connections or ICMP requests targeting a sequential range of IP addresses or a specific subnet within external IP blocks from a single source.": {
            "Data": "Zeek conn.log; Zeek icmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and icmp.log for traffic targeting external IP ranges. Group traffic by source IP. For each source IP, examine the distribution of destination IP addresses. Identify source IPs where destination IPs are highly clustered within specific sequential ranges or subnets (e.g., using subnet analysis or analyzing the numerical sequence of destination IPs) indicating a targeted block scan pattern. Calculate the percentage of IPs hit within a specific range compared to the range size."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]