[
  {
    "Is the adversary performing reconnaissance using spearphishing links? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1598.003 - Spearphishing Link": {
          "Detection of multiple internal accounts receiving emails from a single, unusual, or external sender that fail SPF/DKIM checks.": {
            "Data": "Email Gateway Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Email Gateway logs for inbound emails. Identify emails sent to multiple internal recipients from a single external source. Filter emails based on SPF/DKIM failures or unusual header analysis. Calculate the frequency of emails from suspect senders across internal recipients using descriptive statistics. Flag senders/emails exceeding thresholds."
          },
          "Detection of email messages containing links to uncategorized or known-bad websites, or links with suspicious obfuscation (e.g., IP addresses in URL, @ symbol usage).": {
            "Data": "Email Gateway Logs; Zeek http.log; Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Email Gateway logs for inbound emails containing links. Extract URLs from email body/attachments. Analyze Zeek logs (http.log, dns.log) for outbound connections triggered by user clicks on email links. Compare extracted URLs against threat intelligence feeds for known malicious sites. Analyze URLs for obfuscation techniques (e.g., hex/decimal IPs, '@' symbol). Use correlation analysis to link email receipt events to suspicious outbound network activity."
          },
          "Outbound network connections to suspicious domains or IPs, particularly low-traffic destinations or known malicious infrastructure, initiated from user systems shortly after receiving potentially malicious emails.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for outbound connections from internal user IP addresses. Correlate activity with the timing of inbound emails to those users (if available from other logs not specified here). Identify destination IPs/domains not seen frequently within the network's typical traffic patterns (using frequency analysis or percentiles on destination counts across the network). Cross-reference flagged destinations against threat intelligence feeds. Investigate connections to rare external destinations or known malicious infrastructure occurring shortly after email receipt."
          },
          "Execution of unusual or unexpected processes (e.g., hidden browser windows, suspicious scripts, downloaded files) on user endpoints following potential interaction with a phishing link.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect and analyze Windows Event ID 4688 (Process Creation) from endpoints. Identify processes spawned by email clients or web browsers that are unusual (e.g., have hidden windows, run from temporary directories, involve script interpreters with unusual arguments) and associated with user accounts. Correlate these process events with network connection attempts (Windows Event ID 5156, Zeek conn.log) made by the newly created processes. Use descriptive statistics to identify outlier process names, command lines, or connection patterns compared to the user's or group's baseline activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]