[
  {
    "Is the adversary gathering information about our organization's software? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592.002 - Software": {
          "Unusual scanning or probing activity targeting external services to identify software versions or characteristics.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections targeting public-facing services or ports. Identify source IPs showing unusual connection patterns (e.g., rapid connection attempts across multiple ports/services, connections with unusual User-Agent strings in http.log). Calculate entropy of destination ports or services per source IP to identify scanning behavior. Flag sources exhibiting high entropy or unusual connection frequencies."
          },
          "Outbound connections from internal systems to known compromised external websites hosting malicious content designed to collect host software information.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections from internal systems to known malicious or suspicious domains/IPs from threat intelligence feeds. Use correlation analysis to link these connections to specific processes observed via Windows Event ID 4688 (Process Creation) logs on relevant endpoints/servers. Investigate internal systems connecting to suspicious external sites known for collecting host software information."
          },
          "Connections originating from internal systems to external services exhibiting User-Agent strings associated with vulnerability scanners or reconnaissance tools.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for outbound connections originating from internal systems. Filter for requests containing User-Agent strings that are commonly used by vulnerability scanners, reconnaissance tools, or display unusual patterns (e.g., lack of standard browser info, sequential version numbers). Use frequency analysis or percentile rank to identify rare or anomalous User-Agent strings observed from internal hosts connecting externally."
          },
          "Outbound network connections from internal systems exhibiting data transfer patterns consistent with the exfiltration of potentially sensitive host or software configuration data.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for unusual outbound connection patterns (e.g., frequent small transfers, transfers to unusual destinations) from internal systems. Correlate with Windows Event ID 5156 on endpoints to identify the process initiating the connection. Use descriptive statistics (e.g., average bytes sent per connection, total bytes sent per session/process) and compare against established baselines for normal outbound traffic from the system or process. Flag significant deviations that could indicate data exfiltration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]