```json
[
  {
    "Is the adversary performing reconnaissance by searching public digital certificate data? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596.003 - Digital Certificates": {
          "Internal host DNS queries or network connections to domains/IPs known to be part of malicious infrastructure offering illicit certificate search services or used by adversaries for reconnaissance leveraging certificate data.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and regularly update a threat intelligence list of domains and IP addresses associated with malicious certificate reconnaissance tools, known adversary C2 infrastructure that performs such recon, or illicit certificate data aggregation services. Monitor Zeek dns.log for queries from internal hosts to these domains and Zeek conn.log for direct connections from internal hosts to these IPs. Alert on any confirmed matches and investigate the source host for potential compromise or insider activity."
          },
          "Observed User-Agent strings or specific API interaction patterns in HTTP/S traffic from internal hosts, known to be associated with tools used for certificate harvesting, when accessing legitimate certificate transparency log domains or public certificate databases.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Compile and maintain a list of User-Agent strings and characteristic API query patterns/endpoints (e.g., specific URL paths, query parameters like 'subject', 'domain') used by known reconnaissance tools that query certificate data (e.g., Sublist3r, Amass, crt.sh scripts, custom recon frameworks). Monitor Zeek http.log (for decrypted or HTTP traffic) for these artifacts in requests from internal hosts to known CT log domains (e.g., `*.ct.googleapis.com`, `crt.sh`) or other public certificate search services. Correlate with DNS queries (Zeek dns.log) to the same services. Use regular expression matching and a continuously updated signature set."
          },
          "An internal host exhibiting an unusually high volume or frequency of diverse DNS queries to multiple certificate transparency (CT) log domains or public certificate search services, deviating significantly from its established baseline or role-based expectations.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for normal DNS query activity to a comprehensive list of known legitimate CT log domains (e.g., `*.ct.googleapis.com`, `*.digicert.com/ct`, `ct.sectigo.com`, `ct.izenpe.com`, `crt.sh`) per internal host profile (e.g., developer, security analyst, standard user) or subnet. Monitor Zeek dns.log. Alert on internal hosts exceeding dynamic thresholds (e.g., using Inter-Quartile Range (IQR) or percentile-based outlier detection on query counts or query frequency to a high number of distinct CT domains/subdomains within a short time window). Also, flag hosts not typically expected to perform such lookups (e.g., standard user workstations making >N queries to >M CT domains). Use time series analysis to detect sudden sustained increases in this specific type of query activity. Calculate entropy of queried CT domains per host to identify unusually broad scanning."
          },
          "An external IP address initiating an unusually high number of SSL/TLS handshakes or requesting certificates from a diverse set of an organization's public-facing hostnames/IPs in a short period, potentially validating hosts found via certificate data.": {
            "Data": "Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for external IPs connecting to port 443 across a wide range of your organization's public-facing servers. Analyze Zeek ssl.log for details of these handshakes, including unique `server_name` (SNI) requests. Flag external IPs exhibiting a high frequency of new SSL/TLS sessions to distinct hosts or requesting many different SNIs belonging to the organization within a condensed timeframe (e.g., >N unique SNIs or >M distinct hosts in K minutes). Use descriptive statistics (frequency counts, calculation of connection rates, percentiles based on historical data) to establish 'high frequency' thresholds. While this activity can be legitimate (e.g., search engine crawlers), a sudden spike from an unknown IP may indicate an adversary validating hosts found via certificate data or directly harvesting certificates from live services for reconnaissance."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```