
[
  {
    "Is the adversary conducting reconnaissance by searching victim-owned websites? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1594 - Search Victim-Owned Websites": {
          "Access attempts to victim-owned websites originating from IP addresses known to be malicious, part of botnets, or associated with User-Agent strings from known malicious actors or reconnaissance campaigns.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses from Zeek conn.log and User-Agent strings from Zeek http.log accessing victim-owned websites against continuously updated threat intelligence feeds (e.g., known malicious IPs, TOR exit nodes, IP ranges of cloud providers frequently abused for scanning, known malicious or highly suspicious User-Agents). Alert on any confirmed matches and investigate associated session activity."
          },
          "Requests targeting specific file types, known sensitive paths (e.g., /robots.txt, /sitemap.xml, /.git/, /wp-admin/, common backup file extensions), or query parameters commonly associated with reconnaissance tools or vulnerability scanning; or use of User-Agent strings characteristic of automated scanning/reconnaissance tools.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests to victim-owned websites matching a curated list of patterns: specific URLs (e.g., robots.txt, sitemap.xml, .env, common administrative interfaces like /wp-admin), file extensions (e.g., .sql, .bak, .config, .zip), or query strings indicative of common web scanner payloads (e.g., for SQLi, XSS, directory traversal). Also, identify requests with User-Agent strings known to be associated with reconnaissance tools (e.g., sqlmap, nmap script output, dirbuster, nikto, common Python request libraries without customization). Maintain and regularly update this list of path patterns and tool-specific User-Agents using regular expression matching. Alert on occurrences and analyze for intent."
          },
          "Anomalously high volume of requests, rapid succession of page accesses, or unusually broad crawling activity (high diversity of URLs accessed) from a single external source IP or a cluster of related IPs to victim-owned websites.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for external source IPs accessing victim-owned websites. For each source IP, calculate: total request count, requests per unit of time (e.g., per minute/hour), and the diversity of URLs accessed (e.g., using entropy of visited paths or count of unique URLs). Use statistical methods such as Z-score, Inter-Quartile Range (IQR), or percentile-based outlier detection on these metrics to identify source IPs exhibiting significantly higher activity than established baselines or typical user behavior. Correlate activity from IPs within the same Autonomous System Number (ASN) or geolocation to detect distributed scanning attempts."
          },
          "Concentrated or systematic browsing of website sections likely containing sensitive information (e.g., employee directories, 'about us', contact pages, career portals, investor relations documentation) by an external source, especially if a large number of such pages are accessed within a short period.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define URL patterns corresponding to sensitive sections of victim-owned websites (e.g., /about, /contact, /team, /staff, /careers, /investors, /api). Monitor Zeek http.log for requests from external IPs to these sections. Identify external source IPs that frequently access numerous unique pages within these defined sensitive sections within a short timeframe (e.g., >N pages in M minutes). Use descriptive statistics (e.g., count of sensitive pages visited per session/IP) and establish alert thresholds. Time series analysis of access rates to these sections can reveal unusual spikes in interest from specific sources."
          },
          "Anomalous HTTP referer headers (e.g., missing, malformed, or external/unexpected referers for sensitive internal pages) or direct access to deep-linked, non-public, or sensitive pages on victim-owned websites, bypassing typical user navigation paths.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the 'referer' field in Zeek http.log for requests to victim-owned websites. Flag requests to deep or sensitive pages (especially those not typically entry points) that have missing, malformed, or external/unexpected referers. Model typical user navigation paths by analyzing sequences of page visits per session (e.g., using transition probabilities or common n-grams of page visits). Identify sessions or source IPs exhibiting significant deviations from these common paths, such as jumping directly to multiple unlinked or sensitive pages. Calculate and monitor the ratio of direct (no referer or external referer) versus internally referred access for sensitive pages per IP; a high direct access ratio can be suspicious."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
