[
  {
    "Is the adversary conducting reconnaissance against the organization? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596.002 - WHOIS": {
          "Unusual outbound network connections to known WHOIS server ports (43) or websites offering WHOIS lookups originating from internal systems or monitored infrastructure.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections on port 43. Monitor Zeek dns.log for queries to known WHOIS servers or domain lookup services. Identify destination IPs/domains and query patterns. Use frequency analysis to spot unusual surges in WHOIS queries."
          },
          "Logs showing queries for sensitive organizational details (e.g., specific contacts, internal domain structure hints) made via publicly accessible WHOIS lookup websites.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for search terms submitted to WHOIS lookup websites containing organizational domain names, specific employee names (if publicly known or guessed), or internal server naming patterns. Apply correlation analysis between search terms and subsequent connection attempts or other suspicious activities."
          },
          "Internal systems making direct WHOIS queries (port 43) or accessing online WHOIS lookup services for domains not typically accessed by that system/user.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for outbound connections on port 43 from internal IPs. Monitor Zeek http.log for internal IPs accessing known WHOIS lookup websites (using URL patterns or domain lists). Establish a baseline of normal WHOIS/lookup activity per internal system/user using frequency analysis or time series analysis. Flag outliers that deviate significantly from their baseline or the organizational average. Investigate the source internal IP and the queried domain/IP."
          },
          "Targeted internal network scans or connection attempts immediately following an internal system's access to WHOIS data related to those targets.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Network devices; Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify internal systems that performed potential WHOIS lookups (e.g., based on previous evidence). Correlate the timestamps of these lookups with subsequent suspicious network connection attempts (Zeek conn.log, Windows Event ID 5156) originating from *that* internal system or targeting specific internal systems/domains likely identified via WHOIS (e.g., internal IPs/hostnames matching learned patterns). Use time series analysis to find temporal proximity between the lookup and the follow-on activity, focusing on scan-like behavior (many connections to different ports/hosts in a short period)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]