
[
  {
    "Has the adversary leveraged information from closed sources to conduct reconnaissance or prepare for initial access? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1597 - Search Closed Sources": {
          "Login attempts (successful or failed) using employee credentials known to have been exposed in third-party data breaches.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively obtain lists of employee credentials (email addresses, usernames) exposed in known public and private data breaches from a dedicated monitoring service. Create a high-priority watchlist of these specific accounts. Correlate this watchlist with all login attempts (Windows Event IDs 4624 for success, 4625 for failure) originating from external IP addresses. Alert with high severity on any activity, especially successful logins, involving these confirmed compromised accounts, as this is a direct indicator that breach data is being actively used against the organization."
          },
          "A pattern of failed login attempts from a single source IP targeting numerous user accounts, consistent with password spraying using a common leaked password.": {
            "Data": "Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4625 logs for password spraying patterns, characterized by one or a few source IPs attempting to authenticate to a large number of distinct user accounts over a short period. Flag source IPs with a high ratio of unique target accounts to total failed login attempts. Use descriptive statistics and correlation analysis on the count of unique user accounts targeted by each external IP within a time window (e.g., 1 hour) to identify outliers. While the specific password is unknown, this pattern is a hallmark of using a popular password obtained from a closed-source data dump."
          },
          "A successful login to a dormant or rarely used account, especially from an external source, following a prolonged period of no activity.": {
            "Data": "Windows Event ID 4624; Active Directory logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of account activity by analyzing historical login data (Windows Event ID 4624) and lastLogonTimestamp from Active Directory. Identify accounts that have been dormant for an extended period (e.g., >90 days). Generate a high-priority alert for any successful login to a dormant account, especially if the logon type is remote (Type 3 or 10). Use time series analysis on individual account login frequency to detect a sudden transition from zero to one, as adversaries using old breach data may not know which accounts are inactive."
          },
          "Targeted network scanning or probing of specific non-public services or infrastructure whose existence is not advertised and could likely only be known from internal documentation, private threat intelligence, or a prior breach.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a defined list of externally-facing services, ports, and hosts that are not public knowledge (e.g., staging servers, temporary management interfaces, non-standard VPN ports). Monitor Zeek conn.log for any connection attempts from untrusted external IP addresses to this specific infrastructure. Since legitimate traffic to these assets should be zero or near-zero from the public internet, any connection attempt is highly suspicious. Use frequency analysis and correlation to detect low-and-slow scanning that exclusively targets these sensitive assets, which strongly indicates prior knowledge from closed sources."
          },
          "Anomalous successful login activity for a valid account, such as the user's first-ever remote login or a login from a new and unusual geographic location, indicating a potential account takeover using credentials from a closed source.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each user, build a dynamic profile of normal login behavior including typical source countries/ASNs, common logon types, and login time-of-day/day-of-week. Monitor Windows Event ID 4624 for successful logins and geolocate the source IP. Flag a user's first-ever successful remote login (Logon Type 10) or first login from a new country/ASN. Use statistical profiling (e.g., inter-quartile range, percentile analysis on login times and locations) to establish baselines and identify significant deviations that could indicate valid credentials obtained from a closed source are being exploited."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
