
[
  {
    "Has the adversary gathered reconnaissance information via private threat intelligence sources that enables subsequent attacks? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1597.001 - Threat Intel Vendors": {
          "Network connections or login attempts originating from external IPs, domains, or involving usernames identified in threat intelligence as associated with reconnaissance activity or recent data breaches.": {
            "Data": "Zeek conn.log; Zeek dns.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from network logs (Zeek conn.log) and authentication logs (Windows Event IDs 4624, 4625) against a CTI feed of known malicious infrastructure. Additionally, cross-reference usernames in failed/successful login events against lists of compromised accounts from recent, relevant breaches reported by threat intelligence vendors. Alert on any direct matches for immediate investigation."
          },
          "Use of specific reconnaissance tools or scanning patterns (e.g., distinctive User-Agent strings, specific URI paths for vulnerability checks) known to be used by adversaries immediately following a new vulnerability disclosure.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain and monitor against a list of signatures for common reconnaissance tools and vulnerability scanners (e.g., specific User-Agents, request headers, URI patterns). Analyze Zeek http.log for matches to these patterns, especially against services recently identified as vulnerable in threat intelligence. Use regular expression matching to identify tool-specific probes or exploit attempts. Correlate with Zeek conn.log to identify scanning behavior across multiple ports from sources using these patterns."
          },
          "A sudden spike in scanning or exploitation attempts against a specific service or port, temporally correlated with the publication of a new vulnerability or exploit in a threat intelligence report.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish baselines for connection attempts and traffic volume to all public-facing services and ports. Monitor for significant deviations from this baseline using time series analysis (e.g., ARIMA, exponential smoothing). When a new high-risk vulnerability is announced in threat intelligence, analysts should specifically query for spikes in activity targeting the vulnerable service within the subsequent 0-72 hour window. Correlate connection attempts with IOCs from the vulnerability report if available."
          },
          "An increase in login attempts (credential stuffing or password spraying) using usernames or email formats that align with a recently disclosed data breach which threat intelligence indicates is being actively exploited.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon receiving threat intelligence about a major third-party data breach, analyze the format of compromised credentials (e.g., `firstname.lastname@company.com`). Monitor Windows Event ID 4625 for a surge in failed logins matching this format, especially from a diverse set of source IPs. Use descriptive statistics to track the rate of failed logins for known vs. unknown users. Box-plots and IQR analysis can identify outlier IPs responsible for a high volume of failed attempts. A high ratio of failed logins for known users, especially if they follow a specific format from a breach, is a strong indicator of a targeted credential stuffing attack informed by threat intelligence."
          },
          "Targeted reconnaissance or exploitation attempts against specific assets (e.g., servers, applications) shortly after those assets or their technologies were mentioned in a threat intelligence report as part of an organization's externally visible infrastructure.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an inventory of assets and technologies known to be discoverable via external reconnaissance. When threat intelligence reports mention an organization's infrastructure (e.g., 'Company X uses specific VPN appliance'), perform a focused hunt for increased scanning or anomalous interaction with those specific assets. Use frequency analysis and correlation to identify if a low-frequency asset suddenly becomes a high-frequency target for external probes. Use linear regression to test if the rate of probes against a specific asset changes significantly after a relevant intelligence report is published."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
