```json
[
  {
    "Is the adversary bypassing network defenses through network boundary bridging? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1599 - Network Boundary Bridging": {
          "Connections to network boundary device management interfaces from known malicious IP addresses, or traffic matching specific signatures for known vulnerabilities in these devices.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses connecting to network device management interfaces (e.g., SSH, HTTPS, Telnet on ports 22, 443, 23) against a high-confidence cyber threat intelligence (CTI) feed of known malicious IPs. Additionally, use Zeek's signature engine or a correlated IDS/IPS to scan traffic destined for these devices for patterns matching known exploits (e.g., CVEs affecting firewalls, routers, or VPN concentrators). Alert on any matches from either the CTI join or signature detection."
          },
          "Execution of specific commands or scripts on a multi-homed host to create a network bridge between two separate network interfaces.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On hosts identified as being multi-homed (having active network interfaces in different network segments), monitor for process creation events (Windows Event ID 4688 with command-line logging enabled). Create a pattern-based rule to detect the use of network configuration utilities like `netsh.exe` with specific command-line arguments used for bridging adapters (e.g., `netsh bridge add adapter`). Alert on the execution of these specific command patterns, as they are highly indicative of manual attempts to bridge isolated network segments."
          },
          "A host with interfaces in different network segments observed relaying traffic between those segments in a manner inconsistent with its designated function.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify multi-homed hosts by finding devices with IP addresses in multiple distinct network segments (e.g., corporate LAN and a restricted/DMZ segment). Analyze Zeek conn.log for traffic patterns where this host receives a connection on one interface and initiates a corresponding connection from its other interface to a different destination, effectively acting as a proxy or bridge. Use correlation analysis on source/destination IPs and ports across the host's interfaces within a short time window (e.g., <1 second). Establish a baseline of expected traffic relay (if any) for approved applications and use linear regression or time series analysis to detect anomalous increases in relayed traffic volume or connections."
          },
          "Detection of network traffic crossing security boundaries (e.g., between internal, DMZ, or external zones) that violates established security policies.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and maintain an explicit map of network security zones and the policies governing traffic between them (e.g., traffic from DMZ to internal LAN is prohibited except for specific ports/protocols to specific servers). Analyze Zeek conn.log collected at network choke points. Identify and alert on any connection that violates these defined policies. Use descriptive statistics and frequency analysis to periodically review all inter-zone traffic, calculating the entropy of protocols and destination ports to identify unusual or unexpectedly diverse communication channels that may indicate a policy gap or misconfiguration."
          },
          "Anomalous access to network boundary device configurations correlated with subsequent security policy violations.": {
            "Data": "Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusual connections to network device management interfaces (e.g., from unexpected internal subnets, outside of business hours). Concurrently, monitor Windows Event ID 4663 (Object Access auditing) on management servers for write/modify access to network device configuration files. Upon detecting an anomalous access event or a configuration file modification, trigger a heightened monitoring state. Perform correlation analysis by reviewing Zeek conn.log entries from the subsequent time period, specifically searching for traffic that matches previously prohibited patterns but is now successfully traversing the associated network boundary. Alert on any policy-violating traffic observed within a defined window (e.g., 60 minutes) following a configuration change event."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```