[
  {
    "Is the adversary performing reconnaissance against the network's DNS infrastructure? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.002 - DNS": {
          "Unusual volume or pattern of DNS queries from external sources targeting internal DNS servers, potentially indicating active scanning or attempts to enumerate records (though much activity happens externally).": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for queries originating from external IP addresses. Analyze query volume per source IP and query types. Use statistical analysis (e.g., calculating Z-scores or IQR on query volume) to identify external sources exhibiting unusually high query rates against a variety of internal hostnames or record types."
          },
          "Attempted or successful DNS zone transfer (AXFR) requests received by internal DNS servers from unauthorized external sources.": {
            "Data": "Zeek dns.log; Windows Event ID 5504",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "If Zeek logs query types, filter Zeek dns.log for AXFR queries and correlate with source IPs. Additionally, monitor Windows Event Logs on internal DNS servers for Event ID 5504 (DNS Server Zone Transfer). Investigate any successful or attempted AXFR from unauthorized source IPs."
          },
          "Specific external DNS queries for sensitive record types (e.g., MX, TXT, SPF, SRV, A/AAAA for known internal hosts) against organizational domains/subdomains.": {
            "Data": "Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for external queries targeting organizational domains (identified via asset inventory or domain lists). Filter for sensitive record types (e.g., 'MX', 'TXT', 'SPF', 'SRV'). Identify source IPs and frequently queried record types/hostnames. Use frequency analysis to spot external IPs repeatedly querying these specific records, especially if unrelated to legitimate business partners or services. Consider applying correlation analysis between query types and source IPs."
          },
          "Logging of specific reconnaissance-related query types (e.g., ANY, or frequent queries for non-existent internal records) on internal Windows DNS servers from external sources.": {
            "Data": "Windows Event ID 5505; Zeek dns.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs on internal DNS servers for Event ID 5505 (DNS Query). Filter 5505 events originating from external source IPs for unusual query types ('ANY') or patterns (e.g., sequential queries for a large range of IP addresses or hostnames that do not exist). Use frequency analysis or time series analysis to identify external source IPs making unusual numbers or types of queries as logged by the server, correlating with Zeek dns.log where possible."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]