[
  {
    "Is the adversary gathering information about organizational roles? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1591.004 - Identify Roles": {
          "External probing or scanning activity targeting services that might expose role-specific information or access points (e.g., RDP, VPN portals, specific web application paths).": {
            "Data": "Zeek conn.log; Zeek ssh.log; Zeek rdp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, ssh.log, rdp.log for external source IPs scanning or probing specific ports/services known to be used by internal roles (e.g., RDP 3389, SSH 22, VPN ports). Analyze traffic volume and frequency from external IPs. Use statistical methods (e.g., frequency analysis, time series analysis) to identify spikes or unusual patterns characteristic of scanning activity (e.g., detecting outlier connection rates from external IPs)."
          },
          "Failed access attempts to systems/services typically used by high-value roles, potentially indicating targeted reconnaissance or attempted access based on gathered role information.": {
            "Data": "Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect Windows Event ID 4625 (failed logon attempts) from servers and Zeek conn.log for denied connections to key services. Identify target systems/accounts involved in frequent failed login/connection attempts. Cross-reference target systems/accounts with a list of systems/accounts associated with high-value roles. Analyze patterns of failed attempts (e.g., brute force patterns) using time series analysis or correlation analysis to identify targeted reconnaissance attempts towards specific roles."
          },
          "Malicious file downloads or attempted execution potentially associated with targeted phishing attempts related to role identification.": {
            "Data": "Zeek http.log; Zeek fileinfo.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for file downloads (potentially from suspicious domains or with unusual file types like .exe, .dll, .docm) correlated with user activity. Monitor Windows Event ID 4688 on endpoints for the execution of suspicious processes or files downloaded via HTTP. Correlate these events with user activity potentially targeted based on identified roles. Use frequency analysis or statistical profiling (e.g., outlier detection for uncommon process executions) to identify uncommon file downloads or process executions by user or host compared to baseline."
          },
          "External network connections to unusual or unexpected services/ports on internal systems, potentially using credentials obtained for specific roles.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for external source IPs attempting connections to internal systems on ports/services not typically exposed or used by the general user base (e.g., internal database ports, less common administrative ports). Compare connection patterns to baseline traffic using statistical methods (e.g., identifying outlier connections by destination port/service, source IP, or connection volume using IQR or percentile analysis). Correlate successful external connections with successful login events (Windows Event ID 4624, Logon Type 3 for network logon) on target internal systems, especially if target accounts are associated with sensitive roles."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]