[
  {
    "Is the adversary conducting reconnaissance using public scan databases? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596.005 - Scan Databases": {
          "Targeted probing or scanning activity against services or ports identified in public scan databases that match our network's public profile.": {
            "Data": "Zeek conn.log; Zeek dce_rpc.log; Zeek dns.log; Zeek http.log; Zeek ssl.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn, dce_rpc, dns, http, ssl, weird) for inbound connections and requests targeting services/ports known to be publicly exposed and discoverable via services like Shodan. Compare observed connection patterns (source IPs, ports, protocols, payloads) to typical baseline traffic using descriptive statistics and outlier detection (e.g., IQR). Correlate with external threat intelligence regarding IPs known to scrape scan databases."
          },
          "Login attempts or vulnerability exploitation attempts targeting specific services or versions that are known to be vulnerable and were discoverable via scan databases.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log; Zeek weird.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek logs (conn, http, ssl, weird) and Windows Event Logs (4624, 4625) for login attempts or exploit attempts against specific services (e.g., web servers, databases, SSH, RDP) with known vulnerabilities. Cross-reference the targeted service/version against information commonly found in public scan databases. Look for login attempts using common usernames or patterns discoverable via OSINT/reconnaissance. Use correlation analysis between failed login attempts and specific targeted services/ports found via reconnaissance."
          },
          "Connection attempts to less common or unexpected ports/services that might have been identified as open via public scan databases.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections from external IPs to ports that are not part of the organization's standard published services or are rarely seen in baseline traffic using frequency analysis. Flag source IPs exhibiting connections to multiple non-standard ports. Investigate flagged connections and correlate with Zeek weird.log for unusual connection states."
          },
          "Connection attempts or specific requests targeting known vulnerabilities in software versions that could be identified via banners or certificates discoverable in public scan databases.": {
            "Data": "Zeek http.log; Zeek ssl.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for requests targeting paths or parameters associated with known web application vulnerabilities discoverable through banner grabbing. Analyze Zeek ssl.log for connections using client/server names or certificates linked to known vulnerable software versions identified via OSINT. Filter Zeek conn.log for connections to ports where services are running identifiable software (e.g., web, mail, database). Correlate observed target software/versions with publicly available vulnerability databases and information potentially found in scan databases."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]