
[
  {
    "Is the adversary gathering information about victim hosts? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592 - Gather Victim Host Information": {
          "Inbound network scanning or probing activity originating from IP addresses or networks identified in threat intelligence as known sources of malicious reconnaissance or active scanning.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate source IP addresses from incoming connection attempt logs (Zeek conn.log), Windows Filtering Platform logs (Windows Event ID 5156 for connections permitted or blocked by host firewalls), and failed authentication logs (Windows Event ID 4625) against a frequently updated Cyber Threat Intelligence (CTI) feed of IP addresses/networks known for reconnaissance or scanning activities. Alert on high-volume attempts, connections to an unusual number of ports, or connections from these flagged IPs, and investigate further for coordinated reconnaissance."
          },
          "Outbound connections from internal client systems to external domains, IPs, or URLs known to host reconnaissance frameworks (e.g., ScanBox) or information-stealing scripts that gather host details.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for DNS queries and Zeek conn.log/http.log for subsequent outbound connections from internal hosts (especially user workstations) to external destinations (URLs, domains, IPs) listed on threat intelligence feeds identifying reconnaissance infrastructure or malicious JavaScript hosting sites (e.g., ScanBox C2s, browser profiling services). Analyze outbound Zeek http.log requests to these destinations for User-Agent strings revealing detailed client OS/browser versions and for HTTP parameters or POST bodies containing encoded or specific host information (e.g., screen resolution, plugins, local IP). Use correlation analysis to link suspicious DNS queries to these outbound connections and data leakage."
          },
          "Inbound HTTP/S requests to web servers containing User-Agent strings, specific URI patterns, or sequences of requests characteristic of known host information gathering tools or vulnerability scanners.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for inbound requests targeting web applications. Maintain and apply a list of regular expressions to match User-Agent strings of common reconnaissance tools and vulnerability scanners (e.g., Nmap, Nikto, Dirb, specific Python library UAs used in custom scripts). Identify common path traversal attempts (`../`), directory enumeration patterns (`/admin/`, `/backup/`, `/.git/`, `/.svn/`), or specific file requests (`/.env`, `wp-config.php`, `config.json`, `phpinfo.php`) known to be used by such tools for information gathering. Use correlation analysis to detect a sequence of such requests from a single IP, and calculate the entropy of requested paths from a source IP to identify automated tool usage."
          },
          "Anomalous patterns of inbound connection attempts from external sources, such as high-rate port scanning, subnet-wide host discovery sweeps, or service enumeration across multiple hosts/ports, deviating from normal traffic profiles.": {
            "Data": "Zeek conn.log; Windows Event ID 5156; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connection attempts from external IPs. Identify sources making connections to an unusually high number of distinct ports on a single host (port scanning) or to the same port(s) across a wide range of hosts within owned netblocks (network/subnet sweeping) in a short time window (e.g., using a sliding window algorithm). Use statistical methods like Inter-Quartile Range (IQR) or standard deviations on connection counts per source IP/destination port combinations to detect outliers. Correlate with Windows Event ID 5156 (firewall drops/allows) and Windows Event ID 4625 (failed authentications) to understand the scope and success of probing. Create box-plots for connection attempts per source IP to visually identify aggressive scanners."
          },
          "External HTTP/S requests to web servers exhibiting unusual, malformed, or uniquely identifying User-Agent strings that appear crafted to elicit specific server responses or test for User-Agent based content delivery, potentially for host profiling by an adversary.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for User-Agent strings from external inbound requests. Establish a baseline of common User-Agent strings and their frequencies observed on your public-facing services. Flag User-Agents that are exceptionally rare, malformed (e.g., failing to parse standard UA structure), overly simplistic, or exhibit high entropy (suggesting randomization or custom crafting). Monitor for changes in User-Agent strings from a single IP across multiple requests in a short session. Use frequency analysis (e.g., identifying User-Agents below a certain percentile of occurrence) to highlight suspicious entries. Correlate findings with other anomalous request characteristics such as unusual request paths or methods."
          },
          "Anomalous sequences or high frequency of queries from external IPs to publicly accessible services that attempt to enumerate detailed host information, software versions, or misconfigurations, beyond normal user browsing or API interaction behavior.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for unusual URI patterns, query parameters, or HTTP methods (e.g., excessive or out-of-place OPTIONS, TRACE requests) originating from external IPs targeting web applications or APIs. Focus on requests that might reveal host details, such as attempts to access common sensitive files (`/.git/config`, `/.env`, `web.config`), version-revealing paths (`/api/v1/version`), or queries designed to trigger specific error messages that leak information. Use regular expressions for known information-gathering query patterns. Establish baselines for URI access patterns, query parameter entropy, and request frequencies for public services. Flag low-frequency, suspicious queries or IPs exhibiting high rates of diverse information-probing requests using frequency analysis (e.g., count distinct suspicious query types per source IP) and time series analysis on query types/counts per source IP. Correlate multiple distinct information-gathering query types from a single source IP within a defined session."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
