[
  {
    "Is the adversary using network address translation traversal for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "Network traffic packets observed changing source or destination IP addresses when traversing network boundaries.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek conn.log by comparing source/destination IPs observed on one side of a network boundary device with IPs observed on the other side for the same connection flow ID. Identify flow IDs where IP addresses change unexpectedly across the boundary, potentially indicating NAT/PAT. Use correlation analysis to match flows across interfaces."
        },
        "New or statistically rare external destinations originating from internal networks, potentially indicating altered routing via NAT.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek conn.log for connections originating from internal networks to external destinations that were previously unreachable or are unexpected. Identify new or statistically rare destination IPs/ports from specific internal source networks. Use descriptive statistics and percentile analysis on historical Zeek data to identify statistically anomalous new external destinations, potentially indicating altered routing via NAT."
        },
        "Flows exhibiting consistent session metadata (e.g., total bytes, duration, port pairs) while showing source or destination IP translation across network boundaries.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Identify connection flows in Zeek conn.log traversing network boundary devices where source or destination IPs are observed changing. For such translated flows, correlate session metadata like total bytes (orig_bytes + resp_bytes), duration, and protocol/port pairs. Use comparative statistics to analyze the distribution and consistency of these attributes for translated flows compared to typical non-translated flows or historical patterns, identifying statistically significant deviations or unexpected uniformity indicative of potential unauthorized NAT."
        },
        "Internal hosts connecting directly to IPs/ports normally only accessed via specific gateways or not intended for direct internal routing.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Establish a baseline of allowed internal-to-internal and internal-to-external communication paths based on historical Zeek conn.log data, mapping source internal subnets/IPs to allowed destination subnets/IPs/ports and expected gateways. Identify new connections that bypass expected gateways or communicate directly with destinations normally considered off-limits for direct internal routing. Use graph analysis or rule-based filtering derived from the baseline to flag connections violating established communication patterns, potentially indicating NAT manipulation redirecting traffic."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]