[
  {
    "Is the adversary performing reconnaissance using wordlist scanning? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1595.003 - Wordlist Scanning": {
          "High volume of requests to non-existent or potentially sensitive paths on public-facing web servers from external IPs, indicative of directory or file enumeration.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for connections to public-facing web servers resulting in 404 errors (Not Found) or other errors, particularly POST/GET requests for suspicious paths (e.g., admin, .env, backup, common directories). Identify source IPs with an unusually high rate of such requests using statistical analysis (e.g., calculating z-scores or IQR for request volume per source IP)."
          },
          "Numerous requests or attempts to access cloud storage buckets/objects with unusual or sequential naming patterns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to cloud storage endpoints (e.g., s3.amazonaws.com, storage.googleapis.com). Identify source IPs making a large number of requests to these endpoints targeting sequential or dictionary-like object names. Use correlation analysis to link connection attempts to known cloud storage naming conventions or publicly available lists."
          },
          "High volume of unique URI requests from a single source IP within a short timeframe targeting web servers.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log to group requests by source IP and time window (e.g., 1 minute, 5 minutes). For each group, calculate the number of unique requested URIs. Flag source IPs with an unusually high rate of unique URI requests compared to typical traffic patterns, using descriptive statistics (e.g., average unique requests per IP per minute) and outliers detection (e.g., Z-score or IQR on unique request counts)."
          },
          "Sequence of failed attempts to access cloud storage objects or buckets followed by a successful access, or a sequence of attempts against sequentially or similarly named resources.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections and requests targeting known cloud storage endpoints (e.g., AWS S3, GCP Storage). Filter for patterns of requests (GET, LIST) resulting in authorization errors or 'Not Found' responses followed by successful attempts or requests targeting variations of bucket/object names. Use correlation analysis to link consecutive requests from the same source IP targeting resource names with minor variations (e.g., bucket-test, bucket-dev, bucket-prod)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]