
[
  {
    "Is the adversary conducting reconnaissance using social media? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1593.001 - Social Media": {
          "Connections to social media platforms from an internal host that is also communicating with known malicious command and control (C2) infrastructure.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify internal source IPs making connections to known social media domains. Concurrently, check if these same source IPs are also connecting to destinations on a CTI feed of known malicious C2 IPs/domains within a specific time window (e.g., 24 hours). Use correlation analysis to link these two distinct activities. An inner join of connection logs against a CTI feed can identify hosts communicating with malicious infrastructure; a subsequent check for social media traffic from those hosts may indicate a malicious actor is leveraging the compromised host for reconnaissance."
          },
          "Execution of scraping tools or scripts identified through suspicious command-line arguments or specific User-Agent strings in network traffic to social media sites.": {
            "Data": "Windows Event ID 4688; Zeek http.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command-line arguments containing social media URLs in conjunction with scripting tools (e.g., `python.exe`, `curl.exe`, `powershell.exe`). Separately, analyze the `user_agent` field in Zeek http.log for connections to social media sites using strings associated with scraping libraries (e.g., Scrapy, python-requests) or known OSINT tools instead of standard browsers. Correlate findings from both host and network data to identify hosts running reconnaissance scripts."
          },
          "An internal host exhibiting automated, high-frequency browsing behavior on social media sites, characterized by rapid, sequential access to many distinct profiles or pages without typical user dwell times.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each internal source IP, analyze its connections to social media domains. Calculate the rate of new page/profile requests (distinct URIs in Zeek http.log) per minute and the time delta between requests. Establish a baseline for normal user browsing rates and patterns. Flag IPs exhibiting a significantly higher request rate (e.g., >3 standard deviations above the mean) or an unnaturally consistent time delta between requests. Use time series analysis to identify robotic, non-human access patterns. A box-plot of URI requests per session can identify outlier scraping sessions."
          },
          "An internal system, especially a server or other non-user endpoint, initiating any connection to social media platforms, which deviates from its established baseline network behavior.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile the typical network behavior of all internal hosts, particularly servers, IoT devices, and other non-user workstations, to create a baseline of normal destination categories. Monitor Zeek dns.log for DNS queries and Zeek conn.log for TCP/UDP connections from these profiled systems to domains categorized as social media. Since servers and specialized devices should rarely, if ever, connect to social media, any such connection is a high-confidence anomaly indicating a potential policy violation or compromise. Use linear regression or other trend analysis to detect a sudden change in a host's network traffic profile towards these new destinations."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
