```json
[
  {
    "Is the adversary conducting reconnaissance by leveraging information from public scan databases? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1596.005 - Scan Databases": {
          "Inbound connections or probes originating from IP addresses known to be associated with mass-scanning services or threat actors who leverage public scan data.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate the source IP addresses of all inbound connections from Zeek conn.log against a high-confidence, frequently updated CTI feed that specifically identifies IPs belonging to known internet scanners (e.g., Shodan, Censys, ZoomEye) or threat actor infrastructure known to initiate attacks based on public scan data. Alert on matches and scrutinize the associated activity in Zeek http.log for malicious intent."
          },
          "Exploitation attempts using specific payloads, tools, or request patterns that are popular for a vulnerability recently highlighted or made searchable in public scan databases.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for specific URI patterns, request headers/bodies, or payloads associated with popular, actively exploited vulnerabilities (e.g., Log4j, F5 BIG-IP, Citrix CVEs). Proactively correlate these attempts with services on your network that are known (via your own reconnaissance) to be listed as vulnerable in public scan databases. Maintain and update signatures for these 'trending' exploits and tool-specific artifacts (e.g., Nuclei templates, Metasploit user-agents)."
          },
          "A single external IP making sequential connection attempts to a diverse set of ports that closely matches the organization's known footprint in a public scan database.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively query public scan databases (e.g., Shodan, Censys) for your organization's IP ranges/ASNs to build a 'ground truth' list of exposed ports and services. Monitor Zeek conn.log for external source IPs that connect to a high percentage (>50%) of these exact ports, especially non-standard ones, within a short time window (e.g., < 10 minutes). Use correlation analysis to match the observed set of connections against the ground truth list. This identifies an actor systematically checking a pre-compiled list."
          },
          "A sudden, anomalous spike in inbound probes or login attempts targeting a specific, potentially obscure, service shortly after a configuration change could have exposed it to public scanners.": {
            "Data": "Zeek conn.log; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of inbound traffic volume (connection attempts per hour) for each externally facing service using historical Zeek conn.log data. Use time series analysis (e.g., ARIMA, seasonal decomposition) to detect statistically significant spikes in connection attempts from multiple, disparate external IPs targeting a single service. Correlate traffic spikes with recent firewall or configuration changes and associated failed login attempts (Windows Event ID 4625) to determine if a newly discovered service is being targeted."
          },
          "Targeted brute-force or credential stuffing attacks using usernames that could be derived from organizational information found alongside technical data in scan databases or other OSINT sources.": {
            "Data": "Windows Event ID 4625; Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for a high rate of failed login attempts (Windows Event ID 4625) against externally facing services (RDP, OWA, VPN). Analyze the usernames being attempted. Flag attack patterns that use standardized email formats (e.g., f.lastname, first.last) derived from OSINT, especially when the attack targets a service whose existence was likely confirmed via a scan database. Use entropy measures on attempted usernames from a single source IP to differentiate random brute-force from targeted guessing and correlate with any eventual success (Windows Event ID 4624)."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```