[
    {
        "information_requirement": "Is the adversary collecting information about the organization using publicly available sources?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1593.002",
                "name": "Search Engines",
                "evidence": [
                    {
                        "description": "Presence of sensitive or operationally useful organizational data (e.g., credentials, network diagrams, technology stacks, employee details) indexed and publicly accessible via search engines.",
                        "data_sources": [
                            "Public Search Engine Results"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Implement a continuous monitoring process using automated search engine 'dorking' queries. Target organizational domains, IP ranges, and keywords related to sensitive information ('password', 'confidential', 'filetype:xls', 'filetype:pdf') and operational data ('internal', 'vpn', 'remote', employee names). Use correlation analysis to track findings over time, prioritize remediation based on data sensitivity, and feed findings into other detection mechanisms."
                    },
                    {
                        "description": "Use of specific command-line utilities (e.g., `curl`, `wget`, `bitsadmin`) or PowerShell cmdlets (`Invoke-WebRequest`) to download files from public URLs, particularly on hosts where such activity is uncommon.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 process creation events for command-line arguments containing download utilities (`curl`, `wget`, `bitsadmin`, `certutil`) or PowerShell cmdlets (`Invoke-WebRequest`, `Start-BitsTransfer`). Create a baseline of normal usage for these tools across host roles (e.g., developer workstations vs. domain controllers). Use frequency analysis and correlation with host role to flag anomalous executions, especially downloads from non-corporate domains on servers or by non-technical users."
                    },
                    {
                        "description": "Anomalous web traffic patterns to the organization's public-facing websites characterized by unusual search engine referrers, rapid browsing behavior, or systematic enumeration of site content originating from a single external source.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log data for traffic to public-facing web servers. Profile typical referrers from major search engines. Use time series analysis to detect sudden spikes in traffic from specific referrers, especially those containing reconnaissance-style keywords. For individual source IPs, analyze the sequence and timing of requests. Flag IPs exhibiting behavior indicative of automated crawling or manual, rapid review of search results (e.g., high request rate, requests for many different pages in a short time, high rate of 404 errors indicating enumeration). Calculate the entropy of URL paths requested by a single IP; a high entropy could indicate broad discovery."
                    },
                    {
                        "description": "Outbound network connections from internal systems to known URLs hosting publicly indexed sensitive organizational data, indicating potential internal reconnaissance or abuse of discovered information.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a dynamic watchlist of specific URLs identified via external dorking as hosting sensitive corporate data. Monitor Zeek http.log for any outbound requests from internal hosts to these exact URLs. An inner join between network logs and the watchlist will identify this activity. Alert on any match, as internal hosts should generally not access sensitive corporate data from public caches or unofficial locations."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
