[
  {
    "Is the adversary conducting reconnaissance against our network security appliances? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1590.006 - Network Security Appliances": {
          "Inbound network traffic exhibiting characteristics of port scanning targeting a range of ports, potentially including those used by security appliances.": {
            "Data": "Zeek conn.log; Zeek portscan.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and portscan.log for inbound connections exhibiting a high rate of connection attempts to distinct destination ports from a single source IP within a short timeframe. Use statistical methods (e.g., frequency analysis, time-based thresholding) to identify port scanning patterns. Correlate with known external IP ranges and common security appliance ports."
          },
          "Inbound network traffic attempting to identify specific services or software versions running on external-facing systems, including potential security appliance management interfaces.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to standard and non-standard ports often used for management interfaces or less common services on public-facing IPs. Examine Zeek http.log or ssl.log for suspicious user agents, HTTP methods, or TLS negotiation patterns indicative of service fingerprinting attempts. Use correlation analysis to link scan attempts to specific external IPs and timings."
          },
          "Connection attempts targeting non-standard or management ports on known external-facing network security appliances.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify the IP addresses of external-facing network security appliances. Filter Zeek conn.log for inbound connections targeting these IPs. Calculate the frequency of connections to destination ports other than standard public services (e.g., 80, 443). Flag source IPs exhibiting connection attempts to multiple non-standard ports on these appliances or a high frequency of attempts to specific management ports using frequency analysis."
          },
          "Application layer requests or metadata patterns indicative of querying specific services or status pages on external-facing network security appliances.": {
            "Data": "Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify the IP addresses of external-facing network security appliances. Analyze Zeek http.log and ssl.log for transactions involving these destination IPs. Examine HTTP URIs, request methods (GET, POST, etc.), and User-Agent strings for patterns indicative of security scanner tools or specific appliance status/management page requests. Analyze TLS SNI values for suspicious hostnames. Use descriptive statistics on request types or path frequencies to identify anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]