[
  {
    "Is the adversary performing reconnaissance by searching open websites and domains? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "Unusual external connection attempts targeting common sensitive services (e.g., RDP, SSH, databases).": {
          "Data": "Zeek conn.log; Windows Event ID 4625",
          "Data Platform": "Network devices, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek conn.log for external source IPs attempting connections to internal IPs on sensitive ports (e.g., 22, 3389, database ports). Monitor Windows Event ID 4625 on systems hosting these services for correlated failed login attempts. Identify high frequency attempts from specific IPs or blocks. Use correlation analysis to identify source IPs targeting multiple sensitive services."
        },
        "External network connections or process executions potentially initiated by interaction with targeted external communications (e.g., clicking a malicious link in a spearphishing email).": {
          "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4688",
          "Data Platform": "Network devices, Endpoints",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek conn.log and http.log for connections from internal hosts/endpoints to suspicious external destinations following the receipt of targeted external communications (e.g., via email, messaging). Analyze Windows Event ID 4688 for unusual child processes spawned by common user applications (e.g., email client, browser) that connect externally. Use time series analysis or behavioral profiling to identify deviations from normal communication patterns."
        },
        "Increased network probing or scanning activity targeting internal systems from external sources shortly after sensitive information is identified on open sources.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek conn.log for spikes or unusual patterns in connection attempts (especially on common service ports like SSH, RDP, SMB, SQL) from external IPs to internal systems. Correlate these patterns with recent intelligence feeds or OSINT monitoring results indicating the public exposure of internal infrastructure details (e.g., IP ranges, system names). Use statistical methods (e.g., time series anomaly detection, frequency analysis of targeted ports/IPs) to identify unusual connection volumes or targeted scanning originating externally."
        },
        "Internal network activity or process execution consistent with attempts to access resources using credentials or information publicly exposed.": {
          "Data": "Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 4688; Zeek conn.log",
          "Data Platform": "Endpoints, Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event IDs 4624/4625 for login attempts (especially network logons - Type 3) using usernames or hostnames recently identified in public data dumps or breaches. Analyze Windows Event ID 4688 and Zeek conn.log for unusual process executions or network connections on internal systems that align with accessing resources (e.g., internal shares, specific servers) using information likely gathered via open source reconnaissance. Correlate login failures/successes or connection attempts with timelines of publicly exposed data."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]