[
  {
    "Has the adversary gathered information from closed sources during reconnaissance? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1597 - Search Closed Sources": {
          "Failed login attempts using potentially leaked credentials identified from closed sources.": {
            "Data": "Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4625 across critical servers for failed login attempts. Analyze account names involved, especially those originating from external IP addresses. Use correlation analysis to link multiple failed attempts across different systems or source IPs to the same account name, potentially indicating credential spraying or testing credentials obtained from closed sources."
          },
          "Network connections probing specific services or ports potentially identified through reconnaissance of closed sources.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to non-standard or unusual ports on external-facing or internal systems. Compare connection patterns and destination ports against known service configurations that could have been revealed via closed-source intelligence gathering. Use frequency analysis or descriptive statistics on connection attempts to specific ports or services to identify unusual spikes or persistent low-volume probing."
          },
          "Successful login attempts using valid accounts, originating from unusual IP addresses or occurring at unusual times, potentially leveraging credentials from closed sources.": {
            "Data": "Windows Event ID 4624",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 for successful logons (e.g., Type 3 or Type 10). For each successful logon, extract the username, source IP address, and timestamp. Establish a baseline of typical logon times and source IP addresses per user/account using descriptive statistics (mean, standard deviation) and percentile analysis. Flag successful logons that originate from new/rare source IPs or occur significantly outside the account's typical working hours (e.g., outside the 10th-90th percentile of login times)."
          },
          "Network connections targeting specific, potentially vulnerable services (ports/protocols) in a manner consistent with known exploit signatures or probing activity, suggesting prior knowledge from closed sources.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for traffic to service ports potentially identified via closed sources. Analyze Zeek http.log for suspicious URI patterns, request methods, or headers indicative of exploit attempts targeting specific web vulnerabilities. Correlate observed activity patterns with known exploit databases or vulnerability intelligence feeds. Use frequency analysis and time series analysis to identify bursts of activity or persistent, low-volume probing attempts targeting specific hosts or services, which could indicate prior knowledge from closed-source reconnaissance."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]