```json
[
  {
    "Is the adversary conducting reconnaissance using spearphishing via voice? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1598.004 - Spearphishing Voice": {
          "An internal host connects to an external domain or IP address known to be part of a vishing or callback phishing campaign's infrastructure.": {
            "Data": "Zeek dns.log; Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inner join network logs (Zeek dns.log queries, conn.log destination IPs, http.log host headers) against a high-confidence, continuously updated threat intelligence feed of domains and IPs associated with known vishing campaigns (e.g., callback phishing, credential harvesting sites). Alert on any matches and investigate the associated host and user activity immediately before and after the connection."
          },
          "Installation or execution of a legitimate remote administration tool (e.g., AnyDesk, TeamViewer, ScreenConnect, Quick Assist) on a host where it is not standard authorized software.": {
            "Data": "Windows Event ID 4688; Windows Event ID 11707",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a baseline of standard, authorized software for user workstations. Monitor for process creation events (Windows Event ID 4688) corresponding to the execution of non-standard remote administration tools. Also monitor for software installation events (e.g., Windows Event ID 11707 from MSI installers) for these tools. Correlate execution with subsequent outbound network connections from the tool's process using Zeek conn.log. Use descriptive statistics to identify hosts where this activity is rare or a first-time occurrence, which is a common pattern in vishing-based tech support scams."
          },
          "A user's host downloads a container file (e.g., ISO, ZIP, VHD) from a non-standard source, followed by the execution of a script or LNK file from within the mounted or uncompressed file.": {
            "Data": "Zeek files.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for downloads of container files (ISO, ZIP, VHD) by web browsers. Correlate the download event with subsequent process creation events (Windows Event ID 4688) on the same host where the parent process is `explorer.exe` or a decompression utility, and the child process is a scripting host (e.g., `wscript.exe`, `cscript.exe`, `mshta.exe`) or a process launched from an unusual path (e.g., a temporarily mounted ISO drive). This sequence is a known pattern for payload delivery in vishing attacks."
          },
          "A user account performs a successful remote login from a new or geographically anomalous location shortly after browsing to a suspicious website category like a newly registered domain.": {
            "Data": "Zeek http.log; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate user web browsing activity (Zeek http.log) to suspicious domains (e.g., newly registered, dynamic DNS, uncategorized) with subsequent successful remote access logins (Windows Event ID 4624 Logon Type 10 or 3) by the same user within a short time window (e.g., 5-15 minutes). Establish a baseline of user login locations and flag any login from a new or statistically rare ASN or country, especially when preceded by this suspicious browsing behavior. This behavioral chain suggests a user was tricked into visiting a credential harvesting site."
          },
          "A browser or office application process spawns a scripting host (e.g., PowerShell, Wscript) which subsequently establishes a new external network connection, indicating a user was likely tricked into enabling malicious content.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for unusual parent-child relationships, specifically a browser (`chrome.exe`, `msedge.exe`) or Office application (`winword.exe`, `excel.exe`) spawning a scripting host (`powershell.exe`, `wscript.exe`, `cscript.exe`, `mshta.exe`). Correlate this process creation event by host and timestamp with a new, long-lived, or unusual external network connection (Zeek conn.log) initiated by that scripting host process. Use correlation analysis to link the process event with the network event and alert on this behavioral chain, which is indicative of user-driven execution of a malicious payload."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```