[
  {
    "Is the adversary conducting reconnaissance on client configurations? (TA0043 - Reconnaissance)": {
      "Indicators": {
        "T1592.004 - Client Configurations": {
          "Internal systems connecting to known infrastructure used for collecting client configurations.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log and http.log for connections originating from internal IPs to external IPs/domains found in threat intelligence feeds tagged for reconnaissance or malicious scanning infrastructure. Prioritize connections to ports or services commonly used for web browsing (80, 443). Use frequency analysis on destination IPs/domains to identify frequently contacted external reconnaissance infrastructure."
          },
          "Network traffic or host events indicating interaction with malicious websites or content designed to fingerprint client configurations.": {
            "Data": "Zeek http.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for suspicious user agent strings or unusual GET/POST requests that may indicate client fingerprinting. Correlate Zeek logs with Windows Event ID 4688 on endpoints/servers to identify processes initiating connections to suspicious URLs. Use frequency analysis on unusual HTTP headers or query parameters seen in http.log originating from internal clients."
          },
          "Network traffic indicating external scanning activity targeting client-side services (e.g., SMB, RDP, VNC, SSH ports) potentially revealing OS/version or other configuration details.": {
            "Data": "Zeek conn.log; Zeek weird.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections from external IPs to common client/user ports (e.g., 139, 445, 3389, 5900+, 22) on internal endpoints or servers. Analyze weird.log for related anomalies indicative of scanning. Use frequency analysis on source IPs and destination ports to identify common scanning sources or targeted services. Correlate with asset inventory data to identify which client configurations might be exposed."
          },
          "Outbound HTTP/S requests from client systems containing an unusual number of specific headers or parameters often used for client fingerprinting.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log entries from internal clients. Identify outbound requests to external sites (especially newly observed or suspicious domains). Use statistical methods (e.g., frequency distribution, correlation analysis) to identify requests with a high count of non-standard or suspicious HTTP headers (e.g., client hints, exotic accept headers) or URL parameters commonly used in fingerprinting scripts. Establish a baseline of normal client HTTP header usage and flag significant deviations."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]