[
    {
        "information_requirement": "Is the adversary performing reconnaissance by searching open websites and domains for information about our organization?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1593",
                "name": "Search Open Websites-Domains",
                "evidence": [
                    {
                        "description": "Anomalous web traffic to public-facing websites from IP addresses or using User-Agents known to be associated with malicious reconnaissance tools or actors.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate source IP addresses and User-Agent strings from Zeek http.log and conn.log traffic destined for public-facing web servers against a high-confidence cyber threat intelligence (CTI) feed of known malicious scanners, crawlers, and reconnaissance tool signatures (e.g., specific versions of nmap, ZGrab, Nuclei). Alert on any confirmed matches and investigate for further targeting."
                    },
                    {
                        "description": "Web traffic patterns on public-facing sites indicative of automated content scraping or directory enumeration, such as high-frequency requests for non-existent pages or rapid traversal of site directories from a single source.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log from public web server traffic. For each source IP, calculate the request rate and the distribution of HTTP status codes over a defined time window (e.g., 5 minutes). Flag IPs with an unusually high request rate combined with a high percentage of 404 (Not Found) or 403 (Forbidden) responses, which indicates directory/file brute-forcing. Use descriptive statistics (mean, standard deviation, percentiles) on request counts per IP to identify outliers. Identify sequential requests that appear to be walking a directory tree."
                    },
                    {
                        "description": "Anomalous DNS query patterns against the organization's public DNS servers, such as zone transfer attempts or a high volume of queries for various subdomains, suggesting attempts to map the organization's domain structure.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log on public-facing DNS servers for 'AXFR' query types originating from unauthorized external IPs and alert immediately. Profile normal external DNS query volume and patterns. Use time series analysis to detect significant spikes in query volume from specific external resolvers or clients. Calculate the entropy of queried subdomains for a given source IP over time; a sustained high entropy can indicate a subdomain enumeration attempt using a wordlist. Flag sources with a high ratio of NXDOMAIN (non-existent domain) responses."
                    },
                    {
                        "description": "A correlated increase in probes or login failures against external services for usernames that have recently appeared in public data breaches or on paste sites.",
                        "data_sources": [
                            "Windows Event ID 4625",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Integrate a feed of breached credentials or usernames associated with the company domain from external monitoring services. Cross-reference usernames from this feed against failed login attempts (Windows Event ID 4625) on external-facing services (e.g., VPN, OWA, RDP). Monitor Zeek conn.log for connection attempts to these services from external IPs. Use correlation analysis to link the timeline of the data exposure with a subsequent increase in login attempts or connection probes for those specific accounts. A statistically significant increase in failed logins for these accounts post-breach is a strong indicator that reconnaissance results are being tested."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
