[
  {
    "Is the adversary forging web credentials to gain unauthorized access? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1606 - Forge Web Credentials": {
          "Authentication activity associated with unknown or unexpected accounts accessing web applications/services.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for connection attempts and access to web applications/services. Correlate activity with Windows Event ID 4624/4625 for successful/failed logons potentially tied to web service access (e.g., via SSO). Identify requests/logons from unexpected user accounts or accounts created recently. Use descriptive statistics to find rare accounts or sudden spikes in activity for specific services."
          },
          "Access to web applications/services from unusual locations or systems that do not match expected user configurations.": {
            "Data": "Zeek http.log; Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log for source IP addresses and connection patterns to web applications/services. Geolocate source IPs from Zeek logs. Compare source IPs and user-agent strings with expected patterns for users accessing these services. Use percentile analysis or clustering to identify outlier source IPs or abnormal user-agent combinations. Correlate Zeek data with Windows Event ID 4624 if host/source info is logged."
          },
          "Execution of commands or processes associated with known web credential forging tools or API interactions (e.g., `zmprov gdpak`).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creations containing command-line arguments related to known web credential forging utilities or API calls (e.g., 'zmprov gdpak'). Analyze the user account executing the command and the parent process. Use frequency analysis to identify rare or never-before-seen command executions or executions by unexpected user accounts."
          },
          "Automated or programmatic-like access patterns to web applications/services indicative of token/cookie usage.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log and conn.log for sequences of requests originating from the same source IP and/or associated with the same session/user that exhibit high frequency, predictable timing, or unusual request patterns indicative of automated tools rather than interactive user activity. Use time series analysis or statistical process control to identify bursts of activity or deviations from baseline user behavior for specific applications."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]