[
  {
    "Has the adversary collected sensitive data from configuration repositories? (TA0009 - Collection)": {
      "Indicators": {
        "T1602 - Data from Configuration Repository": {
          "Network traffic involving unexpected source IP addresses or ports accessing configuration repositories (e.g., SNMP traps/gets from untrusted sources).": {
            "Data": "Zeek conn.log; Zeek snmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, snmp.log) for connections to and from devices acting as configuration repositories on known ports/protocols. Identify source and destination IPs/ports. Filter for connections originating from untrusted networks or involving unusual ports/protocols for these assets. Use frequency analysis of connections to identify rare access attempts or unexpected source/destination pairs."
          },
          "Detection of unusually large data transfers or high frequency of queries from configuration repositories to internal or external destinations.": {
            "Data": "Zeek conn.log; Zeek snmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and snmp.log for connection byte counts (orig_bytes, resp_bytes) and query frequency from configuration repositories. Calculate descriptive statistics (mean, median, std dev, IQR) for transfer sizes and query rates per source/destination pair. Flag connections or periods with byte counts or query rates significantly deviating from the norm (e.g., using IQR or z-score analysis)."
          },
          "Authentication attempts or successful access to configuration repositories using unusual or potentially compromised credentials/accounts.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor server logs (Windows Event IDs 4624 for successful logon, 4625 for failed logon) and network logs (Zeek conn.log) for authentication attempts targeting known configuration repository systems (e.g., SNMP servers, management consoles). Identify source IPs and user accounts involved. Correlate authentication events with threat intelligence feeds for known compromised accounts or malicious IPs. Analyze login frequency and patterns for accounts accessing these repositories using descriptive statistics (mean, std dev, IQR) on login times and frequency per account to identify outliers or accounts with unusual access timing or frequency compared to their baseline or peer groups."
          },
          "Attempts to access or transfer specific sensitive configuration files or directories on systems hosting configuration repositories.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on sensitive configuration files/directories used by configuration repositories to generate Windows Event IDs 4663 (Attempted Access to an Object) and 4656 (A handle to an object was requested). Monitor these events for access attempts by unexpected user accounts, processes, or from unusual network locations. Correlate host access events with network logs (Zeek conn.log) if data transfer protocols (e.g., SMB, FTP) are involved. Use frequency analysis or correlation analysis with user behavior baselines to identify access patterns that deviate from normal administration activities for those files/directories."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]