[
  {
    "Has the adversary modified network device operating system images or memory to evade defenses? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1601.001 - Patch System Image": {
          "Checksum of network device OS image file does not match known good checksum.": {
            "Data": "Network Device OS Image Files (via SCP/SFTP/Console); Network Device Logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Periodically or on suspicion, securely download network device OS image files. Calculate the cryptographic hash (checksum) of the file on a trusted workstation. Compare the calculated hash against a database of known good vendor hashes. Alert on mismatches. Conduct vendor-assisted memory integrity checks if live system compromise is suspected."
          },
          "Suspicious file transfer or configuration changes related to OS images on network devices.": {
            "Data": "Network Device Logs (syslog/audit); Zeek ftp.log; Zeek tftp.log; Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network device logs for commands related to file transfers (copy, tftp, ftp, scp) involving OS image filenames or system partitions. Monitor Zeek logs (ftp, tftp, ssh) for connections to/from network devices transferring large files. Analyze transfer events by source IP, destination IP, port, time, and filename using descriptive statistics and time series analysis to identify outliers or sudden changes in activity."
          },
          "Detection of suspicious debug commands or memory modification attempts executed on network devices.": {
            "Data": "Network Device Logs (syslog/audit)",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network device logs for the execution of privileged debug commands (vendor-specific, e.g., 'debug', 'write memory') known or suspected to allow memory modification. Analyze the sequence and frequency of these commands using time series analysis or sequence analysis to identify unusual patterns or commands executed outside of planned maintenance windows or by unauthorized users."
          },
          "Unauthorized access attempts or modifications to network device boot loader configuration or ROMMON settings.": {
            "Data": "Network Device Logs (syslog/audit); Console access logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor network device logs for console access events or attempts to access/modify boot loader settings (e.g., 'boot system' command usage, attempts to enter ROMMON mode). Use frequency analysis to identify unusual console access sessions or attempts to change boot configurations outside of approved change windows. Correlate console access attempts with device authentication logs to identify unauthorized access."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]