```json
[
  {
    "Is the adversary forging web credentials (e.g., SAML, web cookies) to gain unauthorized access? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1606 - Forge Web Credentials": {
          "Use of web credentials associated with known malicious signatures or originating from IP addresses linked to credential forging or abuse campaigns.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from Zeek conn.log and http.log against a cyber threat intelligence (CTI) feed of IPs known to engage in credential abuse. Inspect Zeek http.log for specific, known-bad cookie values or SAML assertion structures used by threat actors by maintaining a watchlist of high-confidence atomic indicators related to forged credentials. Alert on any matches."
          },
          "Execution of commands or use of scripts known to be associated with forging or exporting web credentials or their signing components (e.g., Golden SAML attacks, Zimbra preauth key theft).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs for command-line arguments containing strings related to known credential forging utilities (e.g., 'mimikatz', 'ADFSDump', 'shimit') or specific API commands used to steal signing material (e.g., 'zmprov gdpak' for Zimbra preauth keys). Use regular expression matching on a maintained list of these patterns and analyze the context of the user account and parent process for anomalous executions."
          },
          "A SAML assertion presented to a service provider contains suspicious or malformed attributes, such as an illegitimate issuer, an overly long validity period, or a signature using a weak algorithm.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse SAML assertions from Zeek http.log POST requests (requires SSL/TLS visibility). Flag assertions where the 'Issuer' attribute does not match an approved Identity Provider (IdP). Identify assertions with exceptionally long lifetimes (e.g., > 24 hours) or with a validity start date far in the past. Check the signature algorithm and alert on the use of weak or deprecated algorithms (e.g., SHA1). Maintain and correlate against a pattern list of legitimate issuers, acceptable lifetimes, and strong algorithms."
          },
          "A user successfully authenticates to a service provider via a SAML assertion without a corresponding recent authentication event at the identity provider (IdP), indicating a potentially stolen or forged token.": {
            "Data": "Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful SAML-based logins at service providers (from Zeek http.log or application logs) with successful IdP authentication events (e.g., Windows Event ID 4624 on an ADFS server). Identify service provider logins that lack a preceding IdP login event for the same user within a reasonable time window (e.g., 5-10 minutes). Use correlation analysis on username, source IP, and timestamps across IdP and Service Provider logs. A high ratio of SP logins to IdP logins for a user is a strong behavioral anomaly."
          },
          "A user's session cookie is reused from a new or anomalous geographic location, user-agent, or IP address subnet, particularly if it occurs shortly after being issued to a different, legitimate source.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Track user session cookies from Zeek http.log. For each session cookie, establish a baseline of its associated attributes (source IP, user-agent, geolocation). Alert when the same cookie is re-used from a source with significantly different attributes (e.g., different country, different browser family, different ASN). Implement 'impossible travel' logic for session cookies by correlating timestamps and geolocations of cookie use. Use clustering algorithms or descriptive statistics on session attribute changes per user to find outliers."
          },
          "An account, authenticated via web credentials, performs actions inconsistent with its established behavioral baseline, such as accessing unusual applications, performing administrative functions for the first time, or exhibiting high-frequency, automated activity.": {
            "Data": "Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "After a successful web login (identified via Windows Event ID 4624 or in Zeek http.log), monitor the subsequent HTTP requests for that session. Profile normal application usage per user or role over time. Flag sessions that access an unusual number or type of applications, perform high-privilege actions for the first time, or exhibit programmatic request timing. Use entropy measures on accessed URLs or time-series analysis on request frequency to detect significant deviations from baseline interactive user behavior, which may indicate a hijacked or forged session."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```