```json
[
  {
    "Is the adversary attempting to evade defenses by disabling cryptographic hardware on network devices? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1600.002 - Disable Crypto Hardware": {
          "Administrative connections (SSH, Telnet) to network devices originating from IP addresses on threat intelligence lists or not on an approved allow-list of management sources.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a strict allow-list of authorized source IP addresses for administrative access to network infrastructure. Monitor Zeek conn.log for all connections to network devices on management ports (e.g., TCP/22, TCP/23). Inner join the source IPs of these connections with the allow-list and a cyber threat intelligence (CTI) feed of known malicious IPs. Alert on any connection from an IP that is not on the allow-list or that appears on the CTI feed."
          },
          "Execution of specific, vendor-dependent CLI commands on network devices known to disable hardware-based encryption or weaken cryptographic configurations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of high-risk, vendor-specific CLI commands that disable hardware crypto engines (e.g., 'no crypto engine,' 'crypto engine software') or modify crypto policies. Monitor Windows Event ID 4688 with command-line logging enabled on management servers/jump boxes for these specific strings within SSH/Telnet client processes. If using unencrypted Telnet, monitor Zeek conn.log payloads for these command patterns. Use regular expression matching and alert on any execution."
          },
          "Anomalous administrative access to a network device, characterized by logins from unusual geolocations, at atypical times, or with session durations that deviate significantly from established baselines.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a statistical baseline of normal administrative access patterns for network devices using Windows Event ID 4624 from management servers and Zeek conn.log. Profile typical source IPs/subnets, login times, and session durations per user and per device. Use time series analysis, percentile analysis, and Inter-Quartile Range (IQR) methods to detect significant deviations, such as a login at an unusual time from a user who only works 9-5, or a session lasting hours when the average is minutes. Correlate Zeek connection data with successful logins to enrich alerts."
          },
          "A significant and unexpected change in network traffic encryption status or volume immediately following a suspected configuration modification on a critical network device.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor the proportion of encrypted vs. unencrypted traffic traversing key network segments using Zeek ssl.log and conn.log. Establish a baseline for this ratio (e.g., 95% of traffic is TLS). Use time series analysis or statistical process control charts to detect a sudden, sustained drop in the proportion of SSL/TLS traffic. Correlate the timestamp of this change with any known or suspected anomalous administrative access events on upstream network devices to infer that hardware encryption may have been disabled as a result."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```