```json
[
  {
    "Is the adversary developing resources for exploitation via drive-by target? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1608.004 - Drive-by Target": {
          "Internal systems connecting to domains or IP addresses on threat intelligence feeds specifically associated with drive-by-compromise, watering holes, or exploit kit infrastructure.": {
            "Data": "Zeek http.log; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate all outbound DNS queries (Zeek dns.log) and HTTP/S connections (Zeek http.log, conn.log) against high-confidence, context-specific threat intelligence feeds (updated at least hourly) that identify domains and IPs known for hosting exploit kits, watering hole attacks, or drive-by content. Alert on any matches and investigate the associated host and session for signs of compromise."
          },
          "Observation of multi-stage redirection chains characteristic of malvertising or exploit kits, where a user is passed through several domains in a short time.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek http.log entries by source IP and timestamp, analyzing the 'Referer' header to reconstruct browsing sessions. Identify chains of rapid, sequential redirections (HTTP status 3xx) or iframe/script-based redirections across multiple distinct domains, especially if the chain involves low-reputation or newly registered domains. Use correlation analysis to link DNS queries to subsequent HTTP requests to map the full redirection path. Flag chains longer than a baseline threshold (e.g., > 3-4 hops in < 5 seconds) that terminate at a suspicious destination."
          },
          "Connections to newly registered domains (NRDs) or domains with other suspicious registration characteristics, which are commonly used for temporary attack infrastructure.": {
            "Data": "Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Zeek dns.log for all queried domains. Enrich domain data in near real-time with domain age, WHOIS information, and passive DNS history. Use descriptive statistics to establish a baseline for normal domain age within the organization. Flag and apply a risk score to all connections to domains younger than a specific threshold (e.g., < 60 days) or those with privacy-protected WHOIS records. Use linear regression to track and alert on a sudden increase in the rate of NRDs being visited across the enterprise."
          },
          "An internal client downloading a high-entropy script or executable file from a non-standard or low-reputation website that typically does not serve such content.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log and http.log to identify all file downloads. Profile visited domains based on the MIME types and file extensions of content they typically serve to build a baseline. Calculate the Shannon entropy of all downloaded scripts (e.g., JavaScript, VBScript). Use statistical analysis (e.g., outlier detection using IQR on file type frequencies per domain) to identify when a domain serves a file type that is anomalous for its profile (e.g., an `.exe` from a known blog). Flag downloads of any script with an entropy score significantly higher than the baseline average for web scripts, as this indicates obfuscation."
          },
          "An anomalous spike in traffic to advertising or content delivery networks, followed immediately by connections to suspicious or previously unseen domains.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Categorize and baseline traffic volume to known ad networks and CDNs using Zeek conn.log. Employ time series analysis (e.g., ARIMA, seasonal decomposition) to detect anomalous spikes in connection volume to these networks from internal clients. For hosts contributing to a detected spike, immediately analyze their subsequent DNS queries (Zeek dns.log) and HTTP requests (Zeek http.log) within a short time window (1-5 minutes) for connections to newly registered domains, low-reputation sites, or direct-to-IP addresses, which may indicate the payload stage of a malvertising attack."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```