```json
[
  {
    "Has the adversary obtained credentials or forged authentication material? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1606.001 - Web Cookies": {
          "Web application access using a session cookie originating from a source IP address present on a high-confidence threat intelligence feed of malicious actors (e.g., TOR exit nodes, known C2 servers, proxies).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate source IP addresses from all web application sessions, identified in Zeek conn.log and http.log, against a high-confidence, frequently updated cyber threat intelligence feed of malicious IP addresses. Alert on any session initiated from a matching IP and investigate for credential compromise and unauthorized access."
          },
          "Anomalous process execution on an endpoint where a browser process spawns an unusual child process (e.g., PowerShell) or a known cookie-theft tool process accesses browser cookie databases.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor for process creation events (Windows Event ID 4688) where a browser process (e.g., chrome.exe, firefox.exe, msedge.exe) is the parent of a command-line interpreter (cmd.exe, powershell.exe) or scripting engine. Maintain and hunt for a list of process names, command-line arguments, or hashes of known cookie-stealing tools, especially focusing on processes that attempt to access local browser cookie database files."
          },
          "A user's web session exhibiting multiple anomalous characteristics inconsistent with their established baseline, such as originating from an unusual geolocation, using a novel User-Agent, or representing an 'impossible travel' scenario.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For each user, create a multi-faceted baseline of normal web session activity using historical Zeek data, including typical source countries/ASNs (from conn.log), User-Agent strings (from http.log), and time-of-day/day-of-week patterns. Use statistical methods (e.g., descriptive statistics, percentile analysis) to detect significant outliers in new sessions. Implement 'impossible travel' logic by correlating login timestamps and geolocations, flagging sessions that are physically unfeasible given the user's previous session location and time."
          },
          "A successful authenticated web session for a user account without a corresponding preceding interactive logon event (e.g., Windows Logon Type 2 or 10) on a corporate endpoint, suggesting session initiation from an unmanaged device using a stolen cookie.": {
            "Data": "Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful authenticated web sessions identified in Zeek http.log with successful interactive logon events (Windows Event ID 4624, Logon Type 2 or 10) on corporate systems by the same user account. Flag web sessions for which no corresponding interactive logon event is found within a preceding time window (e.g., 30 minutes), as this indicates the session may have been initiated from a non-corporate device using a stolen cookie."
          },
          "A web session, flagged as potentially suspicious by other means, is immediately followed by anomalous behavior within the application, such as rapid data enumeration, accessing unusual administrative functions, or modifying security settings.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "For web sessions identified as high-risk (e.g., from an unusual location), analyze the intra-session HTTP requests recorded in Zeek http.log. Profile the user's typical in-app behavior. Use time-series analysis to detect an unusually high frequency of requests compared to the user's baseline. Calculate the entropy of accessed URL paths; a sudden spike in entropy can indicate broad enumeration. Alert on access to sensitive URLs (e.g., '/admin', '/api/export', '/settings/security') that deviate from the user's established access patterns."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```