
[
  {
    "Has the adversary attempted to evade defenses by weakening encryption on network devices? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1600.001 - Weaken Encryption": {
          "File transfer to a network device of an image whose hash matches a known malicious or weakened firmware/OS version.": {
            "Data": "Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log for file transfers over protocols like TFTP, FTP, SCP, or HTTP to IP addresses of managed network infrastructure. Extract file hashes (MD5, SHA1) and compare them against a threat intelligence feed of known malicious or illegitimately modified network device firmware images. Alert on any match for immediate investigation."
          },
          "Execution of network device management or file transfer tools on administrative systems with command-line arguments indicating a firmware update or configuration push, especially outside of a scheduled maintenance window.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on designated management servers and endpoints for execution of command-line tools like `ssh`, `plink.exe`, `tftp.exe`, `scp.exe`. Analyze command lines for patterns matching device management, such as `copy running-config tftp`, `archive tar /xtract`, or transferring `.bin`, `.img`, or `.pkg` files to network device IPs. Correlate process execution time with authorized change windows. Use correlation analysis to link these commands to specific users or source systems and flag unauthorized or anomalous sequences."
          },
          "Sudden increase in usage of weak or deprecated cryptographic ciphers, SSL/TLS versions, or SSH algorithms for traffic associated with a critical network device.": {
            "Data": "Zeek ssl.log; Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of common ciphers, TLS/SSL versions, and key lengths from Zeek ssl.log for traffic associated with key network infrastructure (e.g., VPN concentrators, firewalls). Monitor for a statistically significant increase in the use of weak ciphers (e.g., RC4, DES, EXPORT-grade), older SSL/TLS versions (e.g., SSLv3, TLS 1.0), or smaller key lengths (e.g., < 2048-bit RSA). Similarly, monitor Zeek ssh.log for downgrades in key exchange, encryption, or MAC algorithms. Use time series analysis or percentile shifts to detect anomalous changes, especially after a suspected file transfer or reboot of the device."
          },
          "Anomalous, large file transfer to a network device, followed by an inferred device reboot, and subsequently altered traffic patterns originating from or passing through the device.": {
            "Data": "Zeek conn.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log and conn.log for large file transfers (e.g., > 10MB, matching typical firmware sizes) to network devices, especially over unencrypted protocols like TFTP or FTP. Correlate the timing of this transfer with a subsequent loss and resumption of connectivity from the device (inferred from Zeek conn.log state changes or lack of heartbeats), indicating a reboot. Following the reboot, analyze traffic patterns from/through the device for significant deviations from the pre-reboot baseline using descriptive statistics, correlation analysis, or entropy measures on protocol, port, and destination IP distributions."
          },
          "Network device begins communicating with unusual external or internal hosts or using protocols atypical for its function, especially following a potential configuration change event.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile the typical communication patterns (peers, protocols, ports, data volume) for critical network devices using historical Zeek conn.log data. After a suspected configuration change event (e.g., reboot, anomalous file transfer, or observed weak crypto usage), monitor the device for new communication channels. Flag connections to low-reputation external IPs, internal endpoints not associated with network management, or the use of unexpected protocols (e.g., a firewall initiating outbound IRC). Use linear regression or frequency analysis to identify rare or novel communication patterns that deviate from the established baseline."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
