[
  {
    "Has the adversary modified system images to evade defenses? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1601 - Modify System Image": {
          "Mismatch detected between reported operating system version/checksum on a network device and expected baseline.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to network device management ports (e.g., SSH, SCP, FTP, HTTP/S for web management) that could facilitate image transfer or version checks. Analyze connection volume and timing. While direct image checksum is not in Zeek, correlate suspicious connection activity with network device logs (if available via syslog) or manual verification procedures. Use frequency analysis on connection logs to identify unusual device management sessions."
          },
          "Abnormal behavior or crashes reported by a network device inconsistent with the standard OS image, potentially indicating runtime modification.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusual connection patterns, spikes in traffic, or network errors originating from specific network devices. Analyze the frequency and timing of device-initiated connections or error messages using descriptive statistics or time series analysis to detect deviations from established baselines that may indicate instability or compromised runtime."
          },
          "Detection of file transfer activity (e.g., SCP, TFTP, HTTP/S uploads) to network device management interfaces, especially for files matching common image names or extensions.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek http.log; Zeek ssh.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek conn.log for connections to network device management ports (e.g., 22, 69, 80, 443) on target network devices. Correlate with Zeek logs for relevant protocols (ftp.log, http.log, ssh.log) looking for PUT or upload actions, or large data transfers based on byte counts in conn.log. Analyze filenames and sizes recorded in the logs where available. Flag transfers of files with extensions or names suggestive of OS images (e.g., .bin, .img, .tar, vendor-specific naming conventions). Use frequency analysis to identify rare file transfers to these devices or unusual byte transfer volumes."
          },
          "Execution of network device management commands or software (e.g., SSH/SCP clients, TFTP clients, specific vendor tools) on internal hosts, especially those not typically used for device administration.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints and servers for process creation events related to network device management tools (e.g., `ssh.exe`, `scp.exe`, `tftp.exe`, `putty.exe`, vendor CLI tools). Correlate process execution with Zeek conn.log to confirm outbound connections from the host to network device IPs and management ports. Baseline normal usage of such tools per user/host and flag executions on unusual hosts or at unusual times using frequency analysis or time series analysis. Analyze command line arguments from Event ID 4688 for suspicious parameters (e.g., upload commands, specific file paths)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]