[
  {
    "Is the adversary collecting network configuration data? (TA0009 - Collection)": {
      "Indicators": {
        "T1602.002 - Network Device Configuration Dump": {
          "Detection of unusual Simple Network Management Protocol (SNMP) or Smart Install (SMI) traffic originating from suspicious hosts.": {
            "Data": "Zeek conn.log; Zeek dce_rpc.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to standard SNMP ports (UDP 161/162) or SMI ports (TCP 4786) originating from non-management hosts or unusual external IPs. Analyze network device logs for SNMP queries or traps from unexpected sources. Use statistical analysis (e.g., time series) to identify spikes or deviations from baseline traffic patterns for these protocols."
          },
          "Network traffic containing strings or patterns commonly found in network device configurations being exfiltrated.": {
            "Data": "Zeek conn.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Inspect Zeek conn.log and potentially Zeek file.log for traffic involving network device configurations. Develop signatures or regular expressions to detect the presence of common configuration keywords (e.g., 'password', 'enable secret', 'community string', 'ip address', 'hostname') in exfiltrated data streams (e.g., via HTTP POSTs, DNS requests, or direct file transfers). Use correlation analysis to link detected content to specific network sessions or hosts."
          },
          "Detection of processes or commands executed on a host designed to connect to network devices and retrieve configurations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints/servers for command-line arguments containing tools or commands used to access network devices or configurations (e.g., `snmpget`, `ssh`, `telnet`, `tftp`, `scp`, `rsh`). Correlate these events with Zeek conn.log to identify the target network devices (based on destination IP/port) and the nature of the connection. Analyze frequency and volume of such commands originating from suspect hosts or accounts."
          },
          "Detection of network sessions transferring known network device configuration file types or patterns using file transfer protocols or suspicious outbound connections.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek sftp.log; Zeek http.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, ftp.log, sftp.log, http.log, file.log) for transfers originating from internal network devices or hosts towards external/unusual destinations, particularly on file transfer ports (TFTP 69, SCP/SFTP 22, etc.) or via suspicious HTTP POST requests (check Zeek http.log 'uri' or 'request_body' for config names/keywords). Identify transfers of files with names suggesting configuration data (e.g., `.cfg`, `.conf`, `startup-config`, `running-config`). Use time series analysis or volume thresholds to detect unusual bursts of file transfer activity involving network device IPs or hosts known to manage devices."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]