[
  {
    "Is the adversary executing commands via container administration services? (TA0002 - Execution)": {
      "Indicators": {
        "T1609 - Container Administration Command": {
          "Execution of container administration client commands (`docker exec`, `kubectl exec`) on a host system.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations on potential container hosts or developer workstations. Filter for command lines containing 'docker exec' or 'kubectl exec'. Analyze frequency and timing using descriptive statistics. Identify rare combinations of user, source host, and container/command."
          },
          "Suspicious network connections to container administration service endpoints from unexpected sources or with unusual volume/patterns.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to known container administration ports (e.g., 2375/2376 for Docker, 6443/443/10250 for K8s) from external or unexpected internal sources. Analyze connection volume and rate using time series analysis to identify spikes or unusual persistent activity. Correlate source IPs with threat intelligence."
          },
          "Anomalous process creation or command execution originating from within a container, as logged on the host.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container hosts for process creations whose command line or parent process indicates execution originating from within a container (e.g., processes spawned by container runtime components, or processes with container-specific paths/arguments). Identify command lines associated with known malicious activities or significant system modifications. Use descriptive statistics to baseline normal process activity within containers on hosts and flag deviations."
          },
          "Creation or modification of containers with suspicious entrypoints or command overrides.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for command lines containing `docker run`, `kubectl run`, or `kubectl create`. Analyze command line arguments for flags like `--entrypoint`, `--command`, `cmd`, or suspicious image names and parameters that could execute malicious code upon container startup. Use correlation analysis to link these commands to the user account executing them and the source host. Flag commands containing known malicious strings or patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]