[
  {
    "Has the adversary obtained credentials or forged authentication material? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1606.001 - Web Cookies": {
          "User session activity originating from unusual locations or unexpected systems, potentially indicating forged cookies bypassing normal authentication.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections to web applications/services. Identify session source IP addresses. Geolocate source IPs and calculate frequency distribution of source countries/regions. Flag sessions from rare locations or unexpected system types (e.g., unusual User-Agent strings based on http.log) based on low frequency or percentile analysis."
          },
          "Access to sensitive web applications or cloud services by accounts exhibiting access patterns inconsistent with their usual behavior, possibly due to forged cookies.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Zeek http.log for access patterns to sensitive URLs/services. Identify repeated access by a user/source IP from disparate locations within a short timeframe using correlation analysis. Establish baseline access times for sensitive resources per user via descriptive statistics (e.g., mean, median, standard deviation of access times) and flag access outside normal ranges (e.g., using IQR or multiple standard deviations)."
          },
          "Successful access to web applications or cloud services using accounts for which no corresponding successful interactive logon event was recorded on internal systems around the same time.": {
            "Data": "Zeek http.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful HTTP sessions to web applications/services (Zeek http.log) with successful interactive logon events (Windows Event ID 4624 Logon Type 2, 10, etc.) on internal systems by the same user account within a defined time window (e.g., 15-30 minutes). Flag HTTP sessions associated with a user account that do not have a corresponding interactive logon on an internal system shortly before or during the session. Use correlation analysis to match users and timestamps across logs."
          },
          "Access to web applications or cloud services by a user account from a source IP address or system configuration (User-Agent) inconsistent with the user's established historical pattern.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish historical baseline patterns for user access to web applications/services using Zeek conn.log (source IP) and http.log (User-Agent strings), grouped by user account. For new sessions, compare the source IP's geographic location and the User-Agent string against the user's historical profile. Flag sessions with IP locations or User-Agents that fall outside the user's typical historical distribution, utilizing frequency analysis or identifying outliers based on historical data."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]