
[
  {
    "Is the adversary preparing infrastructure (e.g., malicious links) for targeting our organization? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1608.005 - Link Target": {
          "Internal network activity involving domains, URLs, or IP addresses identified as malicious link targets by high-confidence threat intelligence feeds.": {
            "Data": "Zeek intel.log; Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously ingest threat intelligence feeds (e.g., from ISACs, commercial providers, open-source lists) containing domains, URLs, and IPs associated with known phishing, typosquatting, and malware campaigns into Zeek's Intelligence Framework. Monitor Zeek intel.log for any matches against internal DNS queries (from dns.log) or outbound connections (from conn.log). Correlate intel hits with the internal host and user, and analyze the frequency and timing of lookups to prioritize potentially active campaigns."
          },
          "Discovery of newly registered domains using registration patterns (e.g., specific TLDs, privacy services, registrars) similar to those used in past campaigns, followed by internal access attempts.": {
            "Data": "Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Proactively monitor domain registrations (e.g., using Certificate Transparency logs, OSINT tools) for variations of the organization's domains (typosquatting, homoglyphs). Analyze registration patterns (registrar, hosting provider, use of privacy shields, TLD) to identify domains matching known adversary TTPs. Add high-confidence discoveries to an internal watchlist. Monitor Zeek dns.log and http.log for any internal traffic to these watched domains and investigate the source of the query or connection (e.g., phishing email)."
          },
          "Network traffic containing HTTP artifacts or content signatures matching known phishing kits, credential harvesting pages, or malware delivery frameworks.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan Zeek http.log payloads and Zeek files.log content for specific HTML structures, comments, form field names, or JavaScript functions characteristic of known phishing kits (e.g., signatures for GoPhish, Evilginx2). Use regular expression matching and YARA rules against HTTP bodies. Use correlation analysis to link multiple hosts connecting to the same malicious page, which may indicate a targeted campaign."
          },
          "An unusual volume of internal DNS queries for newly registered domains (NRDs) or domains with low reputation scores, especially if followed by short-lived connections or minimal data transfer.": {
            "Data": "Zeek dns.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enrich Zeek dns.log data with domain age (WHOIS) and reputation scores from external services. Establish a baseline for the normal rate of internal queries to NRDs (e.g., domains registered within the last 30-60 days). Use time series analysis to detect spikes in NRD lookups across the enterprise. Correlate DNS queries to NRDs with subsequent outbound connections in Zeek conn.log. Use descriptive statistics and box-plots on connection duration and bytes transferred to flag sessions that are unusually short or involve minimal data, a characteristic of malicious link C2 check-ins."
          },
          "A surge in outbound traffic to domains of legitimate but frequently abused services (e.g., link shorteners, code repositories, cloud storage) containing high-entropy or unique user-specific URL paths.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of domains for legitimate, commonly abused services (e.g., bit.ly, pastebin, github.io, *.blob.core.windows.net). Monitor Zeek dns.log for spikes in queries to these domains. For HTTP traffic to these services (Zeek http.log), calculate the entropy of the URL path and query parameters. Use an IQR or percentile-based approach to flag URLs with unusually high entropy, which suggests a randomly generated or unique identifier common in phishing links. Correlate multiple internal hosts accessing different high-entropy URLs on the same base domain to uncover widespread campaigns using unique links per target."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
