
[
  {
    "Is the adversary attempting to evade defenses by weakening encryption? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1600 - Weaken Encryption": {
          "Encrypted connections (TLS/SSL) to external IP addresses or domains known to be associated with adversary command and control infrastructure.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously cross-reference external destination IP addresses from Zeek conn.log and Server Name Indication (SNI) fields from Zeek ssl.log against updated cyber threat intelligence feeds for known adversary infrastructure. Filter for encrypted sessions (e.g., port 443) and alert on any matches. Use correlation analysis to link these connections to internal hosts and associated user activity."
          },
          "Observation of network traffic using deprecated or weak encryption protocols, cipher suites, or key lengths known to be vulnerable.": {
            "Data": "Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log to identify the use of deprecated protocols (e.g., SSLv2, SSLv3, TLS 1.0/1.1) or cipher suites known to be weak (e.g., those using RC4, DES, 3DES, or null/export-grade encryption). Maintain a blacklist of forbidden protocols and ciphers. Generate high-priority alerts for any session using these blacklisted parameters, especially for connections to sensitive internal services or external authentication portals."
          },
          "Detection of unencrypted protocols (e.g., HTTP, FTP, Telnet) for traffic to or from services where encryption is mandated by policy.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Define and maintain a list of critical internal/external services and hosts where encryption is mandatory (e.g., login portals, administrative interfaces, domain controllers). Monitor Zeek conn.log for connections to these destinations using unencrypted protocols (e.g., HTTP on port 80, Telnet on 23). Use frequency analysis to identify any instances of unencrypted communication to these sensitive destinations and investigate the cause, which could indicate a misconfiguration or an active downgrade attack."
          },
          "Unauthorized access to or modification of local files or registry keys on administrative systems that govern encryption settings.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4670",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable and configure System Access Control Lists (SACLs) on critical files (e.g., configuration files for VPN clients) and registry keys related to system-wide or application-specific encryption settings. Monitor Windows Event IDs 4656 (Object Handle Requested), 4663 (Object Accessed), and 4670 (Permission Changed) for unauthorized access or modification attempts by non-standard users or processes. Baseline normal access patterns using descriptive statistics and flag outliers or modifications occurring outside of scheduled maintenance windows."
          },
          "Anomalous connections to the management interfaces of network encryption devices (e.g., VPNs, firewalls) from unusual sources or at atypical times.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify the IP addresses of network encryption device management interfaces. Monitor Zeek conn.log for connections (e.g., SSH, HTTPS) to these IPs. Establish a baseline of authorized source IPs (e.g., admin subnets) and typical access times. Alert on connections from unexpected sources or at unusual times. Correlate with process creation events (Windows Event ID 4688) on administrative servers for the launch of management tools (e.g., putty.exe, ssh.exe) targeting these devices. Use time series analysis to detect anomalous spikes in connection attempts."
          },
          "Unexpected file transfers originating from network encryption devices, potentially indicating configuration exfiltration or firmware modification.": {
            "Data": "Zeek files.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek files.log and conn.log for file transfer protocols (e.g., FTP, SCP, TFTP) originating from the IP addresses of network encryption devices. Baseline normal activity, such as configuration backups to specific authorized servers. Alert on transfers to unexpected destinations (especially external IPs), transfers of unusual file types/names (e.g., firmware images, running-config), or transfers occurring outside of normal maintenance windows. Use linear regression to model expected data transfer volumes and detect significant positive outliers that could indicate exfiltration."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
