[
  {
    "Is the adversary evading defenses by downgrading system images? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1601.002 - Downgrade System Image": {
          "Configuration changes on network devices related to the system boot image or version settings.": {
            "Data": "Zeek syslog.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek syslog logs and relevant Windows Event IDs (e.g., 4688 for script execution, or specific management software events) for configuration changes on network devices. Filter for keywords related to 'boot', 'image', 'version'. Use correlation analysis to link configuration changes to potential downgrade activity by analyzing sequences of events."
          },
          "File transfer or modification events associated with network device system image files.": {
            "Data": "Zeek ftp.log; Zeek smb.log; Zeek files.log; Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (ftp.log, smb.log, files.log) and Windows Event IDs (4656, 4663) on servers potentially storing device images or on devices supporting these logs for file transfer or modification events involving network device image files. Identify unusual file access patterns using statistical methods (e.g., frequency analysis, time series analysis of file access volume) and correlate with configuration change events."
          },
          "Network device reporting an operating system version older than the established baseline.": {
            "Data": "Zeek syslog.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek syslog for messages from network devices containing operating system version information (e.g., boot messages, command output from periodic status checks). Compare reported versions against a maintained baseline of expected versions for each specific network device or device type. Flag devices reporting a version string that is older than the baseline using string comparison or version number parsing. Use frequency analysis to identify devices that frequently report unexpected versions."
          },
          "Network device restart occurring shortly after suspected image file modification or configuration change.": {
            "Data": "Zeek syslog.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek syslog for messages indicating network device restarts or reboots. Correlate restart events with recent (e.g., within 60 minutes) Zeek syslog entries indicating configuration changes related to boot images or file transfer events involving network device image files. Flag restarts that occur within this window following suspicious activity, calculating the time difference using timestamp correlation and flagging outliers based on typical device restart times."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]