[
  {
    "Is the adversary preparing tools for use by staging them on external infrastructure? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1608.002 - Upload Tool": {
          "Detection of tools being downloaded from suspicious or known adversary staging infrastructure.": {
            "Data": "Zeek http.log; Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log and file.log for file downloads. Analyze download sources (IPs, domains) and compare against threat intelligence feeds or reputation lists of known adversary infrastructure or suspicious hosting providers. Correlate with Windows Event ID 4688 to identify processes initiating downloads. Use frequency analysis on download sources to identify rare or unique download origins."
          },
          "Network traffic patterns or connections from internal systems towards external IPs or domains associated with known adversary infrastructure or suspicious cloud hosting services potentially used for staging.": {
            "Data": "Zeek conn.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and dns.log for connections and DNS queries to external IPs/domains. Compare against threat intelligence feeds of known adversary infrastructure. Identify connections to domains hosted on suspicious cloud infrastructure or services frequently abused for staging (e.g., certain free hosting, specific PaaS providers). Use correlation analysis to link connections to suspicious destinations with other internal activity."
          },
          "Anomalous connections or downloads originating from internal systems targeting external code hosting platforms (e.g., GitHub, GitLab) potentially used for tool staging.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, dns.log, http.log, and file.log for outbound activity targeting well-known code hosting platforms. Establish a baseline of normal access patterns (frequency, time of day, source systems, accessed paths, file types). Use frequency analysis, time series analysis, and statistical process control to identify deviations from the baseline, such as access from unusual systems, large or numerous downloads of executables or archives, or access outside typical working hours. Correlate network activity with threat intelligence on known adversary usage of such platforms."
          },
          "Connections from internal systems to external IPs or domains with low reputation, recent registration, or high churn, followed by the download of executable content or archives.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dns.log for queries to domains with recent registration dates or known dynamic DNS providers. Analyze Zeek conn.log for connections to external IPs with low reputation scores from threat intelligence feeds. Correlate these connections with Zeek http.log and file.log to identify downloads of suspicious file types (e.g., .exe, .dll, .zip, .tar.gz). Use correlation analysis to link connection characteristics (e.g., destination reputation, domain age, connection volume) with downloaded file properties (e.g., file size, MIME type)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]