[
  {
    "Is the adversary developing resources involving digital certificates? (TA0042 - Resource Development)": {
      "Indicators": {
        "Outbound network connections to servers presenting new or unusual SSL/TLS certificates.": {
          "Data": "Zeek ssl.log; Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek ssl.log for outbound connections presenting certificates. Extract certificate details (issuer, subject, validity dates, hash). Use statistical analysis (e.g., frequency counting, set difference against a baseline) to identify certificates with hashes not previously observed or observed infrequently. Flag connections using certificates with short validity periods. Focus on certificates from unknown issuers."
        },
        "Network connections to destinations whose SSL/TLS certificate information matches known suspicious certificates or infrastructure.": {
          "Data": "Zeek ssl.log; Zeek conn.log; Threat Intelligence Feed",
          "Data Platform": "Network devices, Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Extract certificate hashes or other unique identifiers from Zeek ssl.log for outbound connections. Perform an inner join or correlation analysis comparing extracted certificate hashes/details with threat intelligence feeds of known malicious certificates or associated infrastructure IPs. Investigate connections where certificate information matches known indicators of compromise."
        },
        "Outbound connections to external servers using SSL/TLS certificates that are self-signed or have invalid certificate paths.": {
          "Data": "Zeek ssl.log; Zeek x509.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Zeek x509.log for certificate validation failures or certificates marked as self-signed in outbound connections. Filter for invalid certificate chains or untrusted issuers. Identify destination IPs and associated Zeek conn.log entries. Use frequency analysis or set difference to flag certificates with these characteristics that are rarely or never seen in normal outbound traffic. Investigate connections using self-signed/invalid certificates."
        },
        "Outbound connections to external servers using SSL/TLS certificates with suspicious or generic subject/issuer information, or using weak cryptographic algorithms.": {
          "Data": "Zeek ssl.log; Zeek x509.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Extract certificate subject and issuer fields, along with cryptographic details (cipher suite, key length) from Zeek ssl.log and x509.log for outbound connections. Use string pattern matching or rule-based analysis to identify suspicious subject/issuer fields (e.g., highly generic names, single characters, typo-squatted domains). Use frequency analysis or set difference to flag connections using weak cipher suites or key lengths that are uncommon in legitimate traffic. Correlate with Zeek conn.log entries for investigation."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]