```json
[
  {
    "Is the adversary collecting network configuration data? (TA0009 - Collection)": {
      "Indicators": {
        "T1602.002 - Network Device Configuration Dump": {
          "Execution of scripts with file hashes known to be associated with network device configuration dumping tools, or exfiltration of configuration data to known malicious IP addresses or domains.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events and check the file hash of the executable against a CTI feed of known malicious scripts/tools used for configuration collection. Concurrently, correlate logs showing large data transfers (Zeek conn.log) from network management systems or devices with destination IPs/domains (from Zeek dns.log) known to be malicious C2 servers or drop zones. An inner join between traffic logs and threat intel feeds is the primary method."
          },
          "Execution of command-line utilities or scripts indicative of network device interaction and configuration retrieval from non-administrative or unexpected hosts.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) logs for command-line arguments containing network management tool names (`plink.exe`, `tftp.exe`, `scp.exe`), native utilities (`ssh`, `telnet`), or specific device commands (`show running-config`, `copy running-config tftp`). Correlate these command-line events with subsequent network connections (Zeek conn.log) to device management ports (TCP/22, TCP/23, UDP/161, TCP/4786). Use frequency analysis to flag hosts that rarely or never execute such commands, especially if they are not designated management servers."
          },
          "Detection of unencrypted network traffic containing keywords, file names, or data structures characteristic of network device configurations.": {
            "Data": "Zeek files.log; Zeek ftp.log; Zeek http.log; Zeek snmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Implement content inspection rules on unencrypted file transfer protocols. Monitor Zeek files.log for files with common configuration extensions (.cfg, .conf) or names (`startup-config`, `running-config`). Scan file contents and HTTP POST bodies (Zeek http.log) using regular expressions for keywords like 'enable secret', 'snmp-server community', 'ip address', 'interface Vlan'. In Zeek snmp.log, look for bulk 'get' requests for sensitive OIDs (Object Identifiers) related to configuration data tables."
          },
          "Anomalous network connection patterns to device management ports (SSH, Telnet, SNMP, SMI), such as connections from unusual internal sources, connections at atypical hours, or a sudden increase in the volume of management traffic.": {
            "Data": "Zeek conn.log; Zeek snmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal device management traffic, identifying authorized management servers, typical protocols/ports, and traffic volume. Monitor Zeek conn.log for connections to ports 22, 23, 161, 4786 from hosts not on the authorized list. Use time series analysis (e.g., ARIMA) on connection counts to management ports to detect statistically significant spikes. Use descriptive statistics (mean, median, std dev) to profile session durations and data volumes per source, flagging outliers using the Inter-Quartile Range (IQR) method or Z-scores."
          },
          "A single user or host authenticating to an unusually high number of network devices within a short timeframe, indicating automated collection activity.": {
            "Data": "Zeek ssh.log; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate authentication events across multiple network devices. For a given source IP, count the number of distinct destination devices it connects to on management ports (from Zeek conn.log) and successfully authenticates to (via Zeek ssh.log for SSH, or Windows Event ID 4624 on a centralized RADIUS/TACACS+ server) within a sliding time window (e.g., 30 minutes). Establish a baseline for the number of devices typically managed by an administrator in that timeframe. Use percentile analysis (e.g., flag sources in the 99th percentile) to identify accounts exhibiting fan-out login behavior indicative of automated script-based collection."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```