[
  {
    "Is the adversary attempting to evade defenses by disabling cryptographic hardware on network devices? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1600.002 - Disable Crypto Hardware": {
          "Successful administrative login and command execution on network devices related to configuration changes or unusual CLI commands.": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections using network management protocols (SSH, Telnet, SNMP) to network devices. Correlate with successful administrative logins (Windows Event ID 4624) on network management servers. Analyze login times, source IPs, and connection duration using descriptive statistics (e.g., frequency, time series) to identify unusual management access patterns or lengthy sessions."
          },
          "Changes detected in network device system images or unusual performance/traffic patterns potentially indicative of disabled hardware encryption.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for unusual traffic patterns (e.g., unexpected changes in traffic volume, shifts in protocol usage) or potential performance degradation on network links using statistical process control or time series anomaly detection focused on network segments involving critical devices."
          },
          "Execution of specific command-line interface (CLI) commands on network devices known or suspected to disable hardware encryption or modify crypto configurations.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on network management servers (if CLI is executed there) or Zeek conn.log (if device logging is parsed and sent) for execution of network device CLI commands via management protocols (SSH, Telnet). Filter for commands related to crypto configuration (vendor-specific). Maintain a list of known commands that disable hardware crypto or weaken settings. Use frequency analysis to identify rare command usage. Use correlation analysis to link specific command execution events with suspicious user accounts or time windows. Investigate instances of these commands being run."
          },
          "Unusual administrative logins or network connection patterns to network devices immediately preceding configuration changes or image updates.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify occurrences of network device configuration changes or image updates (requires external input or detection logic based on NMS/device logs). For each such event, analyze successful administrative logins (Windows Event ID 4624 on management servers) and network management connections (Zeek conn.log) to the device within a preceding time window (e.g., 15-30 minutes). Use descriptive statistics and time series analysis on login times, source IPs, and connection durations to identify logins/connections that deviate significantly from normal patterns preceding changes (e.g., unexpected source IP, unusual time, excessive duration)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]