[
  {
    "Is the adversary developing or staging resources to support operations? (TA0042 - Resource-Development)": {
      "Indicators": {
        "T1608 - Stage Capabilities": {
          "Successful or attempted connections from internal hosts to known malicious URLs or domains associated with drive-by compromises hosted on suspicious infrastructure or public platforms.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for connections from internal hosts to external URLs. Correlate destination IPs/domains from Zeek conn.log with threat intelligence feeds for known malicious sites or hosted drive-by content. Identify referring URLs to trace the source of redirection. Use frequency analysis on destination domains to identify rare or newly observed domains likely used for staging."
          },
          "Network connections to external IPs/domains using custom or newly observed protocols/ports, or encrypted traffic to suspicious destinations, potentially involving staged C2 infrastructure or tool delivery sites.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections to external IPs/domains on non-standard ports or using unusual protocols. Analyze Zeek ssl.log for connections using self-signed certificates or certificates with suspicious issue dates/details indicative of staged infrastructure. Correlate external connection endpoints (from conn.log and dns.log) with threat intelligence feeds to identify known malicious C2 or tool staging sites. Use time series analysis on connection volume and destination entropy to detect sudden changes or unusual communication patterns."
          },
          "Connections from internal hosts to public code repositories, file-sharing sites, or PaaS platforms known for hosting staged capabilities.": {
            "Data": "Zeek http.log; Zeek conn.log; Zeek dns.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log, conn.log, and dns.log for connections to domains/IPs associated with public hosting/PaaS providers (e.g., github.com, pastebin.com, herokuapp.com, cloudfront.net). Analyze HTTP requests (Zeek http.log) for unusual file downloads or access patterns (e.g., fetching `.exe`, `.dll`, scripts from non-standard paths). Correlate network activity with Windows Event ID 4688 on endpoints to detect suspicious process creation (e.g., running downloaded files). Use descriptive statistics and frequency analysis to baseline normal interactions with these sites and identify significant deviations by specific internal hosts."
          },
          "Network traffic from internal hosts exhibiting suspicious User-Agent strings or HTTP request patterns characteristic of adversary tools or staged content access.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log for connections from internal hosts to external sites. Extract and analyze User-Agent strings using frequency analysis or entropy measures to identify rare or unique User-Agents. Examine HTTP request headers and methods for combinations or values not typical of legitimate browsing or applications. Develop rules or behavioral profiles based on known adversary User-Agents or access patterns to staged content (e.g., specific sequence of requests to download multiple files)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]