[
  {
    "Is the adversary attempting to evade defenses by weakening encryption? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "Changes detected to the configuration or system image of network devices responsible for encryption (e.g., VPN concentrators, firewalls).": {
          "Monitor Zeek logs (conn.log) for connections to network device management ports (e.g., SSH 22, HTTPS 443) from unusual sources or times. Monitor Windows Event logs (4688) for process creation related to network device management tools on administrative servers. Look for correlation between such activity and unexpected network traffic changes. Use time series analysis on connection counts to management ports to detect anomalous spikes.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log) for connections to network device management ports (e.g., SSH 22, HTTPS 443) from unusual sources or times. Monitor Windows Event logs (4688) for process creation related to network device management tools on administrative servers. Look for correlation between such activity and unexpected network traffic changes. Use time series analysis on connection counts to management ports to detect anomalous spikes."
          },
          "Observation of network traffic patterns inconsistent with expected encryption levels or protocols (e.g., use of weaker ciphers, unencrypted traffic where encryption is expected).": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for the use of deprecated or weak TLS/SSL versions or cipher suites. Baseline common encryption parameters using descriptive statistics (frequency of cipher suites, TLS versions). Identify outliers or significant shifts in usage patterns over time using correlation analysis or time series analysis."
          },
          "Unauthorized modification or access to configuration files or registry keys related to network device management on administrative systems.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4670",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Configure SACLs on critical network device configuration files and registry keys on administrative servers. Monitor Windows Event IDs 4656 (Object Handle Requested), 4663 (Object Accessed), and 4670 (Permission Changed) for unauthorized access or modification attempts by non-standard users or processes. Baseline normal access patterns using descriptive statistics (frequency, time of access) and flag outliers or attempts outside of scheduled maintenance windows."
          },
          "Network traffic indicating unexpected file transfers (e.g., configuration backups, modified images) from network encryption devices.": {
            "Data": "Zeek ftp.log; Zeek ssh.log; Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (ftp.log, ssh.log, http.log, files.log) for file transfer activity originating from network encryption devices (firewalls, VPNs). Identify unexpected destinations (especially external IPs), file names (e.g., config files, system images), or sizes. Baseline normal configuration backup destinations and times using descriptive statistics and flag deviations or connections to unusual external IPs using correlation analysis against known good destinations. Examine file hashes in files.log for known good configuration file hashes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary attempting to evade defenses by weakening encryption? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "Observation of network traffic patterns inconsistent with expected encryption levels or protocols (e.g., use of weaker ciphers, unencrypted traffic where encryption is expected).": {
          "Analyze Zeek ssl.log for the use of deprecated or weak TLS/SSL versions or cipher suites. Baseline common encryption parameters using descriptive statistics (frequency of cipher suites, TLS versions). Identify outliers or significant shifts in usage patterns over time using correlation analysis or time series analysis.": {
            "Data": "Zeek conn.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek ssl.log for the use of deprecated or weak TLS/SSL versions or cipher suites. Baseline common encryption parameters using descriptive statistics (frequency of cipher suites, TLS versions). Identify outliers or significant shifts in usage patterns over time using correlation analysis or time series analysis."
          },
          "Identification of unencrypted connections (e.g., HTTP instead of HTTPS, unencrypted protocols) to destinations where encryption is normally enforced.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify sensitive internal or external destinations (e.g., login portals, file shares, critical services) where encryption (e.g., HTTPS, SMTPS, etc.) is expected. Monitor Zeek conn.log for connections to these destinations on unencrypted ports (e.g., 80 instead of 443, 25 instead of 587/465, or other known unencrypted service ports). Use frequency analysis to identify the occurrence of unencrypted sessions to these targets. Investigate connections where the service should always be encrypted."
          },
          "Encrypted connections (e.g., TLS/SSL) observed to external IP addresses or domains known to be associated with adversary infrastructure or known malicious activities.": {
            "Data": "Zeek conn.log; Zeek ssl.log; Zeek x509.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Compare external destination IPs and domains from Zeek conn.log and ssl.log (SNI, certificate info from x509.log) against updated cyber threat intelligence feeds for known adversary C2 or exfiltration endpoints. Filter for sessions using encrypted protocols (e.g., port 443). Flag encrypted sessions connecting to known malicious destinations. Use correlation analysis to link these connections to other internal security alerts if possible."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]