[
  {
    "Has the adversary accessed credentials using forged SAML tokens? (TA0006 - Credential-Access)": {
      "Indicators": {
        "T1606.002 - SAML Tokens": {
          "SAML SSO logins to service providers without corresponding authentication events in the domain (e.g., missing Windows Event IDs 4769, 1200, 1202).": {
            "Data": "Windows Event ID 4769; Windows Event ID 1200; Windows Event ID 1202",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Query Windows Event Logs (4769, 1200, 1202) on domain controllers for successful SAML authentication events. Identify periods or users where SAML-based access to resources occurred but corresponding domain events are missing. Correlate based on timestamps and user identities if available. Investigate discrepancies indicating potentially forged tokens bypassing standard domain authentication logging."
          },
          "Anomalous SAML SSO login source IP addresses or patterns inconsistent with user behavior (e.g., logins from unusual geolocations, logins occurring at odd hours).": {
            "Data": "Zeek conn.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to known SAML service provider endpoints. Extract source IP addresses and connection timestamps. Geolocate source IPs and calculate frequency distribution of source countries/regions and connection times. Identify anomalies using descriptive statistics, IQR, or percentile analysis to flag connections from unusual locations or occurring outside typical business hours. Additionally, analyze Windows Event ID 4624 events that may follow successful SAML authentication if resources are accessed on-premise."
          },
          "Subsequent host activity (e.g., process creation, network connections) on accessed resources exhibiting higher privileges than normally expected for the user account, immediately following a SAML-based login.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5156",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate successful SAML logins (identified through Zeek logs or potentially service provider logs if available, linking back to user/host) with Windows Event ID 4624 logon sessions. Analyze subsequent Windows Event ID 4688 (process creation) and 5156 (network connection) events within that session. Identify processes running with elevated privileges (e.g., spawned by explorer.exe running as Administrator) or network connections to sensitive internal resources that are unusual for the specific user's normal role, using baseline analysis and correlation."
          },
          "Persistent or unusually long duration network connections to SAML service provider resources originating from a source IP or user, without intermittent disconnects typical of interactive user sessions or standard token refresh cycles.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to internal resources that use SAML authentication, correlating connections by source IP, destination IP, and potentially user if available via logs. Analyze connection duration using descriptive statistics (mean, median, max duration). Identify connections significantly longer than the typical session duration for users or exceeding known standard SAML token lifetimes (e.g., exceeding one hour if default). Use time series analysis to detect patterns of persistent connection activity from specific sources that bypass normal session management."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]