[
  {
    "Is the adversary collecting network information via SNMP MIB dumps? (TA0009 - Collection)": {
      "Indicators": {
        "T1602.001 - SNMP (MIB Dump)": {
          "Detection of unusual SNMP queries or high volume of SNMP traffic originating from unexpected hosts.": {
            "Data": "Zeek snmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek snmp.log to identify the types and frequency of SNMP queries. Establish a baseline of normal SNMP traffic patterns for different host groups and identify outliers based on query types, source IPs, destination IPs, or query volume using descriptive statistics or IQR analysis."
          },
          "SNMP traffic detected originating from or destined to untrusted hosts, external networks, or known malicious IPs.": {
            "Data": "Zeek snmp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and snmp.log for SNMP traffic (UDP/161, TCP/161). Filter for traffic originating from or destined to external IP addresses or known malicious IPs (cross-referenced with threat intelligence feeds). Investigate SNMP sessions involving communication outside of expected internal management segments or with external entities."
          },
          "Detection of SNMP queries targeting specific MIB OIDs known to contain sensitive system information or network configuration details (e.g., host description, routing tables, installed software).": {
            "Data": "Zeek snmp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek snmp.log for GET or GETNEXT requests targeting sensitive MIB OIDs (e.g., system group OIDs like .1.3.6.1.2.1.1, ipRouteTable OIDs like .1.3.6.1.2.1.4.21, software OIDs). Identify source IPs making these specific queries. Correlate with unexpected hosts or high frequency queries to flag potential MIB enumeration attempts. Use frequency analysis to identify OIDs most frequently queried by specific sources, especially those outside normal patterns."
          },
          "Execution of SNMP query tools (e.g., snmpwalk, snmpget, PowerShell commands invoking SNMP) on endpoints or servers where such activity is not expected.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creations involving command-line arguments related to SNMP querying tools (e.g., `snmpwalk.exe`, `snmpget.exe`, `powershell.exe -command *SNMP*`, `Get-SNMP*`). Flag executions on hosts not designated for network management or occurring outside scheduled maintenance windows. Analyze correlation between flagged process execution events and subsequent SNMP network traffic observed in Zeek logs from the same source IP."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]