[
  {
    "Has the adversary attempted to evade defenses by reducing encryption key space? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1600.001 - Reduce Key Space": {
          "Anomalous traffic patterns observed originating from or transiting network devices potentially indicating altered encryption settings or device behavior.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for traffic originating from or passing through network devices. Identify deviations from baseline traffic volume, protocol usage, or connection patterns using time series analysis or statistical profiling (e.g., entropy measures on destination ports/IPs)."
          },
          "Changes in network device behavior or observed network characteristics correlating with system configuration changes or reboots on the device.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate events in Zeek conn.log showing changes in network device behavior (e.g., reboots indicated by connection drops, altered traffic flows) with potential network device configuration changes or reboots (inferred from network behavior or correlated with external logs if available). Look for anomalous traffic originating from the device after such events using correlation analysis."
          },
          "Execution of network device management CLI tools or file transfer utilities on servers/endpoints with command-line arguments related to network device configuration or image transfer.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on designated management servers or endpoints for execution of command-line interfaces (e.g., \"ssh\", \"telnet\", \"plink.exe\", vendor-specific tools) or file transfer utilities (e.g., \"tftp.exe\", \"ftp.exe\", \"scp.exe\"). Analyze command-line arguments for connections to network device IPs or hostnames, or flags indicating file transfer/configuration changes. Use correlation analysis to identify sequences of commands or suspicious argument combinations associated with specific user accounts or source IPs."
          },
          "Network traffic indicating unscheduled or anomalous file transfers to or from network devices using common transfer protocols.": {
            "Data": "Zeek conn.log; Zeek ftp.log; Zeek ssh.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, ftp.log, ssh.log, and http.log for connections involving network devices (as destination or source) on ports associated with file transfer (TFTP 69, FTP 21, SCP/SFTP 22, HTTP/S 80/443 potentially for web management). Identify file transfer events (indicated by logs or high byte counts in conn.log). Compare transfer times and volumes against a baseline of scheduled maintenance/updates using time series analysis. Flag transfers occurring outside established windows or with unusual sizes using outlier detection methods (e.g., IQR)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]