```json
[
  {
    "Is the adversary developing resources to facilitate initial access or persistence? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1608.006 - SEO Poisoning": {
          "Internal DNS requests or HTTP connections to domains, URLs, or IP addresses known to be associated with active SEO poisoning campaigns.": {
            "Data": "Zeek dns.log; Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously inner join domains from Zeek dns.log, host headers from Zeek http.log, and destination IPs from Zeek conn.log against a high-confidence threat intelligence feed specializing in phishing and malicious SEO campaigns (updated at least daily). Alert on any matches and investigate the associated user and endpoint."
          },
          "Network traffic exhibiting patterns of evasive redirection or cloaking, where traffic from a search engine is quickly redirected through multiple hops or served content inconsistent with the User-Agent.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Zeek http.log for entries where the Referer header indicates a major search engine (e.g., Google, Bing, DuckDuckGo). For this traffic, identify sessions with rapid, multiple redirects (e.g., >2 redirects with HTTP status codes 3xx within seconds). Additionally, correlate traffic to the same URI but with different User-Agents (e.g., one mimicking a search crawler vs. a standard browser) to detect content cloaking. Maintain and use a list of known redirector domains or suspicious TLDs often used in these chains."
          },
          "Internal users accessing websites via search engines that subsequently attempt to deliver high-risk file types or utilize suspicious HTML keyword stuffing techniques.": {
            "Data": "Zeek http.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log traffic with a search engine Referer. Inspect the destination URI and Zeek files.log for downloads of high-risk file extensions (e.g., .iso, .zip, .msi, .hta, macro-enabled Office docs) from non-reputable or newly registered domains. If traffic is unencrypted, scan HTML bodies for keyword stuffing (high density of relevant but out-of-context keywords). Use frequency analysis to flag domains that disproportionately serve high-risk files to search-referred traffic."
          },
          "Anomalous increase in web traffic from search engines to a cluster of newly registered or low-reputation domains by multiple users across the organization.": {
            "Data": "Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal search-referred web traffic destinations. Use time series analysis on Zeek http.log data (filtered by search engine referers) to detect statistically significant spikes in traffic to specific domains or categories of domains (e.g., newly registered domains). Correlate HTTP traffic with DNS query age from Zeek dns.log. Use descriptive statistics and clustering to identify when multiple, disparate users suddenly begin visiting the same low-reputation site via search, indicating a successful SEO poisoning campaign targeting organizational keywords."
          },
          "Individual users exhibiting unusual web browsing behavior patterns originating from search engines, such as an atypically high rate of navigating to low-reputation domains or downloading files from search-referred sites.": {
            "Data": "Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Profile individual user browsing behavior for traffic originating from search engines. For each user, calculate a baseline score based on the reputation of domains they visit and the frequency of file downloads from search-referred sessions. Use percentile analysis or Z-scores to identify users whose behavior deviates significantly from their own baseline or the baseline of their peer group (e.g., suddenly visiting many more low-reputation domains than usual). Use regression analysis to test for correlations between searches for specific business terms and subsequent high-risk browsing activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```