[
    {
        "information_requirement": "Is the adversary building malicious container images on hosts to evade defenses?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1612",
                "name": "Build Image on Host",
                "evidence": [
                    {
                        "description": "Container build process making network connections to IP addresses or domains known to be malicious, or using a build context containing files with known malicious hashes.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Zeek files.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate the timestamp of a container build process (Windows Event ID 4688 for 'docker build') with network connection logs (Zeek conn.log, Zeek http.log) from the same host. Inner join destination IPs/domains against a CTI feed of known malicious hosts. Additionally, inspect files transferred during the build (via Zeek files.log) and check their MD5/SHA256 hashes against a threat intelligence database of known malicious files. Alert on any confirmed match."
                    },
                    {
                        "description": "Execution of a container build command using a specific combination of flags, arguments, or a Dockerfile name/path known to be associated with malicious activity or obfuscation techniques.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creations of container build tools (e.g., 'docker build', 'buildah', 'podman build'). Analyze command-line arguments for patterns frequently associated with malicious image builds, such as using '--no-cache' to force re-downloading of malicious layers, specifying an unusual Dockerfile location (e.g., '-f /tmp/build.df'), or piping obfuscated content directly into the build context. Maintain and match against a list of known malicious build command patterns derived from threat intelligence reports."
                    },
                    {
                        "description": "A container image build process is initiated on a host not designated as a build server, or by a user account that does not typically perform development or CI/CD tasks.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain an explicit inventory of authorized build servers and designated CI/CD or developer service accounts. Monitor Windows Event ID 4688 for 'docker build' processes. Generate high-priority alerts when a build is executed on a host not in the inventory (e.g., a production database server, domain controller) or by a user account outside of authorized groups. Establish baselines of build activity per host/user and use descriptive statistics (frequency counts, time-of-day analysis) to detect anomalous build events."
                    },
                    {
                        "description": "A container build process making network connections to external destinations that are not official or whitelisted internal container registries, particularly if downloading files or connecting to low-reputation domains.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate the start and end time of a container build process (Windows Event ID 4688) with concurrent network activity (Zeek conn.log) from the same host. Maintain a whitelist of approved container registry domains/IPs (e.g., docker.io, gcr.io, internal registries). Flag and investigate any connections made during the build to external destinations not on the whitelist. Use correlation analysis to link the build event with data transfer volume; large downloads from non-registry sources are highly suspicious. Use regression models to predict expected network traffic during a build and flag significant deviations."
                    },
                    {
                        "description": "A sequence of events where a container is built on a host and then immediately executed, followed by the new container initiating anomalous network activity (e.g., C2 beaconing) or suspicious process execution.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and monitor for a multi-stage behavioral sequence. Step 1: Detect a 'docker build' process completion (via logs or polling for new image IDs). Step 2: Detect a 'docker run' or 'docker start' command (Windows Event ID 4688) for the newly created image tag/ID within a short time window (e.g., < 5 minutes) on the same host. Step 3: Monitor network traffic (Zeek conn.log) and process activity originating from the new container for behavioral anomalies, such as periodic C2 beaconing, port scanning of the internal network, or accessing sensitive local files and directories. Use time series analysis to detect beaconing patterns."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
