```json
[
  {
    "Is the adversary performing discovery on the network, specifically for Group Policy settings? (TA0007 - Discovery)": {
      "Indicators": {
        "T1615 - Group Policy Discovery": {
          "Execution of GPO discovery tools with known malicious file hashes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) that include command-line arguments related to GPO discovery (e.g., gpresult, Get-GPO). For each initiating executable, compute the file hash (e.g., SHA256). Compare these hashes against a continuously updated threat intelligence feed of known malicious binaries and post-exploitation tools. Alert on any matches."
          },
          "Execution of native utilities or PowerShell cmdlets with command-line parameters characteristic of GPO reconnaissance tools.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for the execution of 'gpresult.exe', 'powershell.exe', or 'pwsh.exe'. Inspect command-line arguments for patterns indicative of broad GPO reconnaissance, such as `gpresult /r`, `gpresult /z`, `Get-GPO -All`, `Get-GPResultantSetOfPolicy`, or usage of tools like PowerView's `Get-NetGPO`. Correlate execution with the parent process; execution by non-standard parent processes (e.g., an Office application, a web browser) should be investigated. Use frequency analysis to flag rare or first-seen command-line variations."
          },
          "Anomalous volume or pattern of LDAP queries targeting Group Policy Container objects on domain controllers.": {
            "Data": "Zeek dcerpc.log; Windows Event ID 4661",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "On domain controllers, monitor Windows Event ID 4661 (if object access auditing is enabled for DS Access) or network traffic via Zeek for LDAP queries targeting objects with categories like 'groupPolicyContainer'. Establish a baseline for query volume and frequency per user and host using descriptive statistics (mean, median, standard deviation) over a rolling time window. Use time series analysis or Z-score calculations to detect statistically significant spikes in query activity from a single source, which could indicate enumeration by tools like BloodHound or PowerView."
          },
          "Anomalous file access patterns against the SYSVOL share, such as bulk enumeration of policy files by non-administrative users or from unusual workstations.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4663; Zeek smb_files.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor file share access events on domain controllers (Windows Event ID 5140 for network share object access, 4663 for specific file access if SACLs are configured) and SMB traffic (Zeek smb_files.log) for read operations within `\\\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\`. Profile which users and workstations normally access this share to create a baseline. Alert on access from user accounts not in designated GPO management groups, from server-class machines that are not domain controllers, or a sudden, high-volume enumeration of multiple policy folders from a single source. Use a box-plot on the number of files accessed per session to identify outlier enumeration activity."
          },
          "Correlated sequence of LDAP queries for GPOs followed by direct file access to the corresponding policies in the SYSVOL share from the same source.": {
            "Data": "Windows Event ID 4661; Windows Event ID 5140; Zeek dcerpc.log; Zeek smb_files.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a stateful detection rule that correlates GPO discovery events across different data sources. Trigger an alert when the same source host or user performs an LDAP query for 'groupPolicyContainer' objects (from Zeek dcerpc.log or Windows Event ID 4661) and is subsequently observed accessing the `\\\\SYSVOL\\...\\Policies` share (from Zeek smb_files.log or Windows Event ID 5140/4663) within a short time window (e.g., 5 minutes). This specific sequence is a strong behavioral indicator of targeted GPO discovery, separating it from normal background activity."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```