[
  {
    "Is the adversary executing commands or code by deploying containers? (TA0002 - Execution)": {
      "Indicators": {
        "T1610 - Deploy Container": {
          "Deployment of unknown or suspicious container images/pods in the environment.": {
            "Data": "Zeek conn.log, Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to public container image registries (DockerHub, etc.) from unexpected internal hosts. Correlate with Windows Event ID 4688 on potential container hosts to identify processes initiating container pull/run commands. Analyze the volume and frequency of image pulls using time series analysis to detect anomalies."
          },
          "Suspicious process execution observed within newly deployed containers.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container hosts for suspicious child processes spawned by the container runtime or container management tools. Analyze Zeek conn.log for unusual network connections originating from container host IP addresses or ranges, looking for C2 patterns or data exfiltration attempts using correlation analysis with threat intel feeds."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  },
  {
    "Is the adversary evading defenses by deploying containers? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1610 - Deploy Container": {
          "Deployment of containers configured with lax or no network rules/user limitations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to observe network traffic originating from newly deployed container hosts/IP ranges. Identify connections to unexpected internal or external destinations that violate typical container network policies. Use descriptive statistics to baseline container network behavior and identify deviations."
          },
          "Deployment of privileged or known vulnerable containers onto nodes.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container hosts for unexpected process creation or privilege escalation events associated with newly deployed privileged containers. Analyze Zeek conn.log for network traffic from these hosts indicating access to sensitive internal resources or attempting external communication, using correlation analysis."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]