[
  {
    "Has the adversary escalated privileges by escaping from a container or virtualized environment? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1611 - Escape to Host": {
          "Execution of suspicious syscalls (e.g., mount, unshare, keyctl) or unexpected process activity on the host originating from within a container.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container host servers for process creation events originating from containerized processes or indicating execution outside expected container contexts. Analyze process command lines for syscalls like 'mount', 'unshare', 'keyctl', or attempts to load kernel modules. Correlate suspicious processes with network connections (if applicable) in Zeek conn.log. Use correlation analysis to link suspicious syscall usage to subsequent process activity or network connections."
          },
          "Creation or modification of container volume configurations attempting to access host filesystem or the creation of unexpected host processes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container host servers for process creation events resulting from container configuration changes or volume manipulation (e.g., unexpected shell or binary execution). Analyze command lines for signs of accessing host filesystems (e.g., references to host paths). Identify network activity in Zeek conn.log originating from these unexpected host processes. Use time series analysis or frequency analysis on process creation events to identify unusual bursts of activity or processes originating from unexpected sources on the host."
          },
          "Process creation on the host resulting from commands sent to container management sockets (e.g., docker.sock) originating from a container.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container host servers. Identify process creation events where the parent process is a container runtime process or a process handling container management API calls (e.g., Docker daemon, Kubelet process). Analyze command line arguments (`New Process Command Line`) for suspicious commands or binary executions characteristic of container escape via management socket exploitation (e.g., `docker run`, `kubectl exec` issued from an unexpected source path). Use frequency analysis to identify rare process creations on the host originating from container management sources."
          },
          "Unusual access or modification of critical host system files or directories originating from processes associated with containers or from containers with excessive privileges.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable detailed object access auditing (Windows Event ID 4663) on critical host directories (e.g., system directories, sensitive configuration paths, mounted volumes used by containers). Correlate these access events with process creation events (Windows Event ID 4688) to identify if the accessing process originated from or is associated with a container (e.g., running as root, unexpected path). Use frequency analysis or statistical baselining to identify rare or anomalous file access patterns on the host originating from container-related processes accessing critical host resources."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]