[
  {
    "Is the adversary discovering cloud storage objects? (TA0007 - Discovery)": {
      "Indicators": {
        "T1619 - Cloud Storage Object Discovery": {
          "High volume or frequency of cloud storage object enumeration API calls.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events indicative of cloud storage enumeration tools (e.g., 'aws s3api list-objects', 'az storage blob list'). Analyze Zeek conn.log for high volume/frequency of connections to known cloud storage API endpoints. Use statistical methods (e.g., time series analysis, frequency distribution) to identify sudden spikes or unusually high rates of these events/connections."
          },
          "Cloud storage object enumeration API calls originating from unusual source IP addresses or during unusual times.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 and Zeek conn.log for cloud enumeration activity. Correlate with login events (Windows Event ID 4624) to identify associated users/systems. Identify source IPs/users initiating this activity and use descriptive statistics or correlation analysis to compare against baseline activity. Flag events occurring from rare IPs or outside typical working hours/days using time series analysis or frequency analysis."
          },
          "Cloud storage object enumeration API calls performed by user accounts or service principals that do not typically perform this activity.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events containing cloud storage enumeration commands (e.g., 'aws s3api list-objects', 'az storage blob list'). Identify the initiating user from the event. Correlate with Zeek conn.log to confirm external connections to cloud storage endpoints from the host. Use frequency analysis to identify users performing enumeration commands who have not done so previously or do so infrequently compared to their established baseline activity or their peer group."
          },
          "Cloud storage object enumeration activity immediately followed by high-volume data transfer (download/upload) from the same source or user.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify cloud storage enumeration activity (e.g., via Windows Event ID 4688 commands or Zeek conn.log patterns). For these identified sources (IPs/users), monitor Zeek conn.log for subsequent connections to cloud storage endpoints showing high outbound data volume (bytes_sent) or high inbound data volume (bytes_resp). Use time series analysis to detect this sequence of events (enumeration followed by large transfer) within a short time window. Apply thresholds based on historical data transfer volumes (descriptive statistics like mean + standard deviation or IQR) to flag unusually large transfers following enumeration."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]