[
  {
    "Has the adversary escalated privileges by escaping from a container or virtualized environment? (TA0004 - Privilege Escalation)": {
      "Indicators": {
        "T1611 - Escape to Host": {
          "Execution of suspicious syscalls (e.g., mount, unshare, keyctl) or unexpected process activity on the host originating from within a container.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container host servers for process creation events originating from containerized processes or indicating execution outside expected container contexts. Analyze process command lines for syscalls like 'mount', 'unshare', 'keyctl', or attempts to load kernel modules. Correlate suspicious processes with network connections in Zeek conn.log. Use correlation analysis to link suspicious syscall usage to subsequent process activity or network connections."
          },
          "Creation or modification of container volume configurations attempting to access host filesystem or the creation of unexpected host processes.": {
            "Data": "Windows Event ID 4688, Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container host servers for process creation events resulting from container configuration changes or volume manipulation (e.g., unexpected shell or binary execution). Analyze command lines for signs of accessing host filesystems. Identify network activity in Zeek conn.log originating from these unexpected host processes. Use time series analysis or frequency analysis on process creation events to identify unusual bursts of activity or processes originating from unexpected sources."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]