```json
[
  {
    "Is the adversary attempting to discover the geographic location of systems? (TA0007 - Discovery)": {
      "Indicators": {
        "T1614 - System Location Discovery": {
          "Network connections from internal systems to known public IP geolocation lookup services.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a list of domains and IP addresses for common public IP geolocation services (e.g., ipinfo.io, ip-api.com, ifconfig.me, whatismyip.com). Monitor Zeek DNS logs for queries to these domains and Zeek conn.log/http.log for direct connections. Alert on any connection from a server or critical endpoint, as this is highly anomalous. For other endpoints, investigate any connections not associated with legitimate software or user activity."
          },
          "Execution of a specific sequence of built-in commands or scripts known to be used by adversaries to gather system location information from command-line.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for specific command-line patterns used to discover location. This includes direct PowerShell queries like `Get-Culture`, `Get-TimeZone`, `[System.TimeZoneInfo]::Local`, or `ipconfig /all | findstr 'DNS Servers'`. Flag executions by unusual parent processes (e.g., `wscript.exe`, `mshta.exe`, Office applications) or by users who do not typically perform system administration. Correlate multiple discovery commands from the same process ID or user session within a short time window (e.g., 2 minutes) to detect scripted reconnaissance patterns."
          },
          "A user, process, or host performing an unusual number or variety of system location discovery commands, deviating from its established activity baseline.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal system and network discovery command usage (e.g., `systeminfo`, `ipconfig`, `netsh`, `Get-Culture`, `hostname`) for users, hosts, and system processes. Monitor Windows Event ID 4688 logs for executions of these commands. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect hosts or users executing these commands with unusually high frequency or variety compared to their peers or their own history. Calculate the entropy of unique discovery commands per user/host over a time window; a sudden increase can indicate active reconnaissance."
          },
          "Execution of system location discovery commands followed closely by an outbound network connection to an unusual or non-standard external destination.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events showing execution of location-revealing commands (`systeminfo`, `ipconfig`, `Get-Culture`, `Get-TimeZone`) with subsequent Zeek conn.log entries for outbound connections from the same source host within a short timeframe (e.g., 1-5 minutes). Use correlation analysis to test the relationship between discovery command execution and outbound traffic. Flag connections to low-reputation IPs, newly registered domains, or destinations not present in baseline traffic patterns for that host/user group for immediate investigation."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```