[
  {
    "Is the adversary attempting to discover the geographic location of systems? (TA0007 - Discovery)": {
      "Indicators": {
        "T1614 - System Location Discovery": {
          "Execution of processes or API calls attempting to query system locale, timezone, or language settings.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing commands or making API calls (if feasible through advanced logging/EDR) related to system locale, timezone, or language settings (e.g., 'GetLocaleInfoW'). Use frequency analysis to identify unusual or rare processes executing these checks within the environment."
          },
          "Network connections from internal systems to known external IP geolocation lookup services.": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections originating from internal IPs to a list of known external IP geolocation lookup service domains/IPs (e.g., ip-api.com, ipinfo.io). Identify source hosts of these connections and analyze connection frequency and volume using descriptive statistics to find anomalies relative to baseline traffic."
          },
          "Execution of command-line tools querying system locale, timezone, or network configuration that could reveal location information.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing commands like `systeminfo`, `ipconfig /all`, `hostname`, `Get-ComputerInfo`, etc., especially when run from unusual directories or by unusual users. Analyze command line arguments for specific queries related to locale, timezone, or network configuration (`/all`). Use frequency analysis to identify uncommon executions of these standard commands."
          },
          "Outbound network connections to uncommon or suspicious destinations immediately following execution of system or network configuration discovery commands.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 showing execution of location-revealing commands (`systeminfo`, `ipconfig`, etc.) with subsequent Zeek conn.log entries originating from the same host within a short timeframe (e.g., 60 seconds). Filter these connections for unusual destinations (e.g., external IPs not in typical allow lists, connections to internal hosts/ports not normally accessed by this source/user). Use correlation analysis to identify hosts that frequently run these commands followed by suspicious connections."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]