[
  {
    "Is the adversary performing discovery on the network, specifically for Group Policy settings? (TA0007 - Discovery)": {
      "Indicators": {
        "T1615 - Group Policy Discovery": {
          "Execution of suspicious commands or PowerShell functions related to Group Policy discovery (e.g., gpresult, Get-DomainGPO).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs for process creations containing command-line arguments like 'gpresult', 'Get-DomainGPO', 'Get-DomainGPOLocalGroup'. Calculate the entropy of command-line strings or process names relative to baselines to identify anomalous execution."
          },
          "Abnormal volume or pattern of LDAP queries targeting Group Policy objects on domain controllers.": {
            "Data": "Zeek dcerpc.log; Windows Event ID 4661",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek dcerpc.log (or relevant logs) and Windows Event ID 4661 logs on domain controllers for LDAP queries targeting 'groupPolicyContainer' objects. Calculate the frequency and volume of such queries per source IP/user/timeframe. Use time series analysis or statistical profiling to identify spikes or unusual patterns compared to normal domain activity."
          },
          "Unusual file system access patterns or attempts to access GPO files directly within the SYSVOL share.": {
            "Data": "Windows Event ID 5140; Windows Event ID 4663; Zeek smb.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 5140 for access to the SYSVOL share, specifically paths matching `*\\SYSVOL\\*\\Policies\\*`. If SACLs are configured, monitor Windows Event ID 4663 for read/access attempts on files within these paths. Analyze Zeek smb.log for connections and file operations (e.g., file open, read) targeting the `Policies` directory on SYSVOL. Use statistical profiling on normal SYSVOL access (source hosts, users, file types accessed) to identify outliers or sudden increases in access frequency from unusual sources."
          },
          "Authentication events (successful or failed) on domain controllers for access to SYSVOL share originating from potentially suspicious sources or using unusual account types.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Filter Windows Event IDs 4624 and 4625 on domain controllers for logon Type 3 (Network) targeting the SYSVOL share. Identify source workstations/servers initiating this access. Profile normal network logon sources for SYSVOL access. Flag logons originating from unusual workstation types, accounts not typically involved in GPO management, or a high volume of failed attempts from any source attempting SYSVOL access. Use frequency analysis to establish baselines for which machines and users access SYSVOL shares."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]