[
  {
    "Is the adversary executing commands or code by deploying containers? (TA0002 - Execution)": {
      "Indicators": {
        "T1610 - Deploy Container": {
          "Deployment of unknown or suspicious container images/pods in the environment.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to public container image registries (DockerHub, etc.) from unexpected internal hosts. Correlate with Windows Event ID 4688 on potential container hosts to identify processes initiating container pull/run commands. Analyze the volume and frequency of image pulls using time series analysis to detect anomalies (sudden spikes, pulls at unusual times)."
          },
          "Suspicious process execution observed within newly deployed containers.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container hosts for suspicious child processes spawned by the container runtime or container management tools (e.g., shells, unexpected binaries). Analyze Zeek conn.log for unusual network connections originating from container host IP addresses or ranges (e.g., C2 patterns, data exfiltration ports) using correlation analysis with threat intel feeds."
          },
          "Direct API calls to container management daemon (e.g., Docker, containerd) originating from unexpected sources or users.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to standard container daemon API ports (e.g., Docker default 2375/2376) from source IPs outside of designated management hosts or ranges. Correlate successful (Event ID 4624) and failed (Event ID 4625) authentication attempts related to these services. Use frequency analysis to baseline normal API access sources/users and flag connections from rare or never-before-seen sources."
          },
          "Deployment activities observed through logs of management interfaces like Kubernetes Dashboard or Kubeflow, originating from unusual users or IP addresses.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to known ports/paths of Kubernetes Dashboard or Kubeflow interfaces. Correlate with authentication logs (Windows Event ID 4624/4625) to identify successful logins from unusual users or IPs. Analyze access logs (if available, otherwise rely on conn/auth logs and subsequent activity) for deployment actions triggered by unusual user accounts or source IPs using frequency analysis. Identify spikes in activity on these interfaces using time series analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary evading defenses by deploying containers? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1610 - Deploy Container": {
          "Deployment of containers configured with lax or no network rules/user limitations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to observe network traffic originating from newly deployed container hosts/IP ranges. Compare destination IPs/ports against a baseline of expected container traffic and allowed network segments. Flag connections to external IPs not on an approved list or connections between containers/hosts that violate segmentation policies. Use descriptive statistics (e.g., count of unique destinations, byte volumes) to baseline container network behavior and identify deviations."
          },
          "Deployment of privileged or known vulnerable containers onto nodes.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on container hosts for unexpected process creation or privilege escalation events associated with newly deployed privileged containers. Analyze Zeek conn.log for network traffic from these hosts indicating access to sensitive internal resources or attempting external communication, using correlation analysis with internal asset lists or threat intel feeds."
          },
          "Network traffic from a newly deployed container communicating with unexpected external destinations or bypassing internal network segmentation controls.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify network connections originating from IP ranges assigned to containers using Zeek conn.log. Compare destination IPs/ports against a baseline of expected container traffic and allowed network segments. Flag connections to external IPs not on an approved list or connections between containers/hosts that violate segmentation policies. Use descriptive statistics to identify containers with unusually high connection counts or unique external destinations, potentially indicating defense evasion."
          },
          "Deployment of containers utilizing images tagged as 'privileged' or referencing known vulnerable image versions from public or private registries.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections to container registries pulling specific image names or tags. Correlate with Windows Event ID 4688 events showing container run commands and their arguments (image name, flags like '--privileged'). Maintain a list of known vulnerable or excessively privileged image tags/names. Use correlation analysis to link image pull/run events with known suspicious image lists."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]