[
  {
    "Is the adversary evading defenses using reflective code loading? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1620 - Reflective Code Loading": {
          "Unexpected loading of .NET CLR modules (mscor.dll, mscoree.dll, clr.dll) into processes that typically do not use .NET.": {
            "Data": "Windows Event ID 7 (Sysmon); Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 7 (Sysmon) for .NET CLR modules (mscor.dll, mscoree.dll, clr.dll) loading into processes not typically associated with .NET execution (e.g., notepad.exe, services.exe). Identify baseline process module loads using historical data and flag deviations via correlation analysis or frequency analysis."
          },
          "Processes exhibiting suspicious behavior (e.g., unexpected network connections, file access) after unexpected module loading or without corresponding file-backed execution.": {
            "Data": "Zeek conn.log; Windows Event ID 4688; Windows Event ID 11 (Sysmon)",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unexpected outbound connections from processes known to have loaded unusual modules (based on analysis of Event ID 7/4688). Correlate process IDs/names from Windows Event ID 4688 or Sysmon Event ID 11 with network activity in Zeek conn.log. Use frequency analysis to identify processes making rare or unusual network connections."
          },
          "Command line arguments associated with process creation indicating reflective loading or suspicious in-memory execution (e.g., specific PowerShell syntax).": {
            "Data": "Windows Event ID 4688; Sysmon Event ID 1",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 and Sysmon Event ID 1 for processes (especially scripting hosts like powershell.exe, wscript.exe, cscript.exe) created with command line arguments containing suspicious patterns indicative of reflective loading (e.g., `::Load(`, `Add-Type -TypeDefinition`, base64 encoded strings in command line). Use regular expressions or pattern matching for identification. Flag commands containing base64 encoded data or unusually long strings combined with such patterns."
          },
          "Outbound network connections initiated by processes lacking a corresponding executable file on disk.": {
            "Data": "Sysmon Event ID 1; Sysmon Event ID 11; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Sysmon Event ID 1 for processes with zero file hash or that execute from temporary/unusual locations (e.g., temp directories). Correlate these processes (using Process GUID or PID/Create Time) with Sysmon Event ID 11 and Zeek conn.log entries showing outbound network connections. Flag connections originating from processes with no disk-backed executable or from suspicious paths. Use correlation analysis to link process execution without file hash to subsequent network activity and identify patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]