[
  {
    "Is the adversary attempting to evade defensive measures by detecting debuggers? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1622 - Debugger Evasion": {
          "Execution of suspicious Native API calls associated with debugger detection (e.g., IsDebuggerPresent, NtQueryInformationProcess) by potentially malicious processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of processes with suspicious names or command lines often associated with malware. Analyze Windows Event ID 7 (Sysmon - Image Load) for the loading of system libraries or specific modules commonly used for anti-debugging checks by suspicious processes. Use correlation analysis to link suspicious process execution with the loading of relevant modules."
          },
          "Execution flows indicating the use of Structured Exception Handling (SEH) possibly triggered to detect debugger presence.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes exhibiting crash-like behavior (e.g., rapid start/stop) or unusual exception handling patterns that deviate significantly from established baselines for that process or application. Use time series analysis to identify processes with frequent, short-lived execution bursts potentially indicative of SEH-based checks."
          },
          "Execution of unexpected child processes or scripts by potentially malicious parent processes, used for debugger detection.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 to identify child processes spawned by known suspicious processes. Look for child processes with command lines indicative of system queries, debugger checks (such as querying system information or accessing known debugger locations), or unusual scripting activity. Use correlation analysis to link the child process behavior to the parent process and identify suspicious parent-child relationships."
          },
          "Attempts to access registry keys or file paths associated with debugging tools or configurations by unexpected processes.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing command-line utilities (`reg query`, `dir`, `Get-Item`) targeting known debugger-related locations. Correlate with Windows Event ID 4663 (if auditing for access to specific objects like registry keys `HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options` or debugger directories is enabled) for access attempts by unusual processes. Use frequency analysis to identify processes performing multiple such checks."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary performing discovery by checking for analysis environments like debuggers? (TA0007 - Discovery)": {
      "Indicators": {
        "T1622 - Debugger Evasion": {
          "Rapid sequence of system information gathering activities, including checks for debuggers, from an unusual process.": {
            "Data": "Windows Event ID 4688; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs to identify processes executing a rapid sequence of system query commands (e.g., `tasklist`, `query process`, `wmic`) or debugger detection utilities. Correlate this process activity with Zeek dns.log for unusual lookups originating from the same host. Use time series analysis on process creation and command execution events to identify bursts of discovery activity."
          },
          "High volume of OutputDebugStringW() calls or similar activity potentially flooding debug logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes exhibiting unusually high CPU usage or generating excessive log data that doesn't correspond to their expected function. (Note: Standard Windows Event Logs do not directly capture debug output; this action infers potential log flooding from process behavior or related resource consumption). Use descriptive statistics and outlier detection on process resource usage (if available via other logging) to flag anomalies."
          },
          "Command execution or script activity querying system information related to process tracing or debugger presence on Windows.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes executing command-line utilities like `tasklist`, `wmic process`, or specific PowerShell commands (`Get-Process`, `Get-CimInstance Win32_Process`) with arguments or scripting logic that could indicate an attempt to find debuggers or analyze process states. Use frequency analysis and time series analysis on command execution events from a single source process to identify bursts of system querying activity."
          },
          "Correlation of debugger detection attempts with other co-occurring discovery activities from the same source.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Windows Event ID 4688 events indicating potential debugger checks or system queries (from command execution evidence) with other Event ID 4688 events showing system/user enumeration commands (`net user`, `net group`), Zeek conn.log showing internal network scanning (e.g., many connections to different IPs/ports), or Zeek dns.log showing rapid internal DNS lookups from the same source host within a short timeframe. Use correlation analysis to identify sequences or clusters of distinct discovery activities originating from the same source."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]