[
  {
    "Is the adversary attempting to evade defensive measures by detecting debuggers? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1622 - Debugger Evasion": {
          "Execution of suspicious Native API calls associated with debugger detection (e.g., IsDebuggerPresent, NtQueryInformationProcess) by potentially malicious processes.": {
            "Data": "Windows Event ID 4688, Windows Event ID 7",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for creation of processes with suspicious names or command lines often associated with malware. Analyze Windows Event ID 7 (Sysmon - Image Load) for the loading of system libraries or specific modules commonly used for anti-debugging checks by suspicious processes. Use correlation analysis to link suspicious process execution with the loading of relevant modules."
          },
          "Execution flows indicating the use of Structured Exception Handling (SEH) possibly triggered to detect debugger presence.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes exhibiting crash-like behavior (e.g., rapid start/stop) or unusual exception handling patterns that deviate significantly from established baselines for that process or application. Use time series analysis to identify processes with frequent, short-lived execution bursts potentially indicative of SEH-based checks."
          }
        }
      }
    }
  },
  {
    "Is the adversary performing discovery by checking for analysis environments like debuggers? (TA0007 - Discovery)": {
      "Indicators": {
        "T1622 - Debugger Evasion": {
          "Rapid sequence of system information gathering activities, including checks for debuggers, from an unusual process.": {
            "Data": "Windows Event ID 4688, Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 logs to identify processes executing a rapid sequence of system query commands (e.g., `tasklist`, `query process`) or debugger detection utilities. Correlate this process activity with Zeek dns.log for unusual lookups originating from the same host. Use time series analysis on process creation events to identify bursts of discovery activity."
          },
          "High volume of OutputDebugStringW() calls or similar activity potentially flooding debug logs.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes exhibiting unusually high CPU usage or generating excessive log data that doesn't correspond to their expected function. (Note: Standard Windows Event Logs do not directly capture debug output. This action infers potential log flooding from process behavior). Use descriptive statistics and outlier detection on process resource usage (if available) to flag anomalies."
          }
        }
      }
    }
  }
]