[
  {
    "Has the adversary accessed credentials by stealing or forging authentication certificates? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1649 - Steal or Forge Authentication Certificates": {
          "Access or export attempts of private keys for authentication certificates from protected storage (Registry, files, certificate store).": {
            "Data": "Windows Event ID 4663, Windows Event ID 5058, Windows Event ID 5059",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event Logs (4663, 5058, 5059) and Sysmon logs (26, if enabled) for access or export operations targeting cryptographic keys or certificate store locations (e.g., dpapi system hive keys, certificate store file paths). Correlate export events with concurrent network activity (using Zeek logs) or process execution (using other Windows Events) that might indicate data exfiltration or malicious usage. Use descriptive statistics to identify unusual users or processes performing these actions."
          },
          "Suspicious or excessive certificate enrollment or renewal requests, especially for privileged accounts or with unusual Extended Key Usage (EKU) or Subject Alternative Name (SAN) values.": {
            "Data": "Windows Event ID 4886, Windows Event ID 4898, Windows Event ID 4899",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event Logs (4886, 4898, 4899) on Certificate Authority servers and Domain Controllers. Identify certificate enrollment requests (4886). Analyze the Subject Alternative Name (SAN) and Extended Key Usage (EKU) fields within the certificate information from the logs. Flag requests for privileged accounts (SANs matching administrators, system accounts) or certificates with unusual EKUs (e.g., Smart Card Logon, Client Authentication) by users or machines that shouldn't have those rights based on group membership or policy. Use frequency analysis to detect spikes in enrollment requests for specific templates or users."
          }
        }
      },
      "version": "1.0",
      "last_updated": "2025-05-04"
    }
  }
]