[
  {
    "Is the adversary attempting to evade defenses by modifying plist files? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1647 - Plist File Modification": {
          "Modification of plist files located in user or system auto-run directories.": {
            "Data": "Windows Event ID 4656; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 4656 and 4663 for file object access/modification events targeting common Windows auto-run locations (e.g., Startup folders, registry keys like Run, RunOnce - acknowledging this technique is macOS-specific, applying logic to Windows equivalents based on requested data sources). Analyze access patterns by process and user. Use descriptive statistics to identify processes or users with unusually high file modification activity in these sensitive locations."
          },
          "Execution of code originating from locations referenced in recently modified plist files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Correlate new process creations originating from locations commonly used by Windows auto-run mechanisms (like Startup folders, paths found in Run registry keys - acknowledging this technique is macOS-specific, applying logic to Windows equivalents based on requested data sources) with recent file modification events (from Evidence 1 action). Use correlation analysis between file modification events and subsequent process creation events from relevant paths."
          },
          "Execution of command-line tools or scripts known to modify Windows auto-run persistence locations (e.g., Registry Run keys, Startup folders).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes with command line arguments indicative of modifying Windows Run/RunOnce registry keys (e.g., `reg.exe add`, `powershell.exe Set-ItemProperty`, `wmic.exe startup`) or manipulating files/shortcuts in Startup folders (e.g., `copy.exe`, `powershell.exe Copy-Item`). Use frequency analysis or statistical profiling on process names/command lines accessing these locations to identify deviations from baseline activity."
          },
          "Appearance of unexpected network connections originating from processes associated with Windows auto-run locations or services, especially those recently created or modified.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes starting from common Windows auto-run locations (Startup folders, paths found in Run/RunOnce registry keys, service ImagePath). Correlate these process creations with network connection events (Windows Event ID 5156) or Zeek conn.log entries originating from these processes. Use network flow analysis or correlation to identify outbound connections to unusual or known malicious destinations from processes typically not expected to have network activity, or from processes recently added to auto-run locations. Use descriptive statistics on connection frequency and volume for processes in these locations to highlight anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]