[
  {
    "Has the adversary accessed credentials by stealing or forging authentication certificates? (TA0006 - Credential Access)": {
      "Indicators": {
        "T1649 - Steal or Forge Authentication Certificates": {
          "Access or export attempts of private keys for authentication certificates from protected storage (Registry, files, certificate store).": {
            "Data": "Windows Event ID 4663; Windows Event ID 5058; Windows Event ID 5059",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event Logs (4663, 5058, 5059) and Sysmon logs (26, if enabled) for access or export operations targeting cryptographic keys or certificate store locations (e.g., dpapi system hive keys, certificate store file paths). Correlate export events with concurrent network activity (using Zeek logs) or process execution (using other Windows Events) that might indicate data exfiltration or malicious usage. Use descriptive statistics to identify unusual users or processes performing these actions."
          },
          "Suspicious or excessive certificate enrollment or renewal requests, especially for privileged accounts or with unusual Extended Key Usage (EKU) or Subject Alternative Name (SAN) values.": {
            "Data": "Windows Event ID 4886; Windows Event ID 4898; Windows Event ID 4899",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event Logs (4886, 4898, 4899) on Certificate Authority servers and Domain Controllers. Identify certificate enrollment requests (4886). Analyze the Subject Alternative Name (SAN) and Extended Key Usage (EKU) fields within the certificate information from the logs. Flag requests for privileged accounts (SANs matching administrators, system accounts) or certificates with unusual EKUs (e.g., Smart Card Logon, Client Authentication) by users or machines that shouldn't have those rights based on group membership or policy. Use frequency analysis to detect spikes in enrollment requests for specific templates or users."
          },
          "Access or modification of certificate files located outside standard protected storage locations (e.g., unexpected paths).": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Security Event IDs 4656 and 4663 for access attempts (READ_DATA, WRITE_DATA, DELETE) on files with certificate extensions (.cer, .crt, .pfx, .p12, .pem) located in user directories or non-standard system paths. Correlate with Windows Event ID 4688 to identify the process performing the access. Establish a baseline of normal access patterns to these file types and use frequency analysis to flag accesses by unusual users or processes, or to unusual file paths using methods like identifying rare paths."
          },
          "Successful authentication attempts using certificate credentials from unexpected source systems or accounts, or at unusual times.": {
            "Data": "Windows Event ID 4624; Zeek x509.log; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 on domain controllers and target servers, filtering for logon types associated with network or remote authentication (Type 3, 10) that use certificate credentials. Identify logons listing a certificate as the authentication method. Correlate logon events with source IPs (using Zeek conn.log) and target systems. Use time series analysis and frequency analysis to identify logons using certificates from unusual source IPs, originating from unexpected machines for the logging-in user, or occurring outside of normal working hours or patterns for that account/user (e.g., using IQR or percentile analysis on login times). Investigate certificate details from Zeek x509.log if available."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]