[
  {
    "Is the adversary executing code or commands using serverless functions or automation services? (TA0002 - Execution)": {
      "Indicators": {
        "T1648 - Serverless Execution": {
          "Network connections from potential serverless environment egress points to suspicious external or internal destinations.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from IP subnets or ranges associated with serverless egress points (if known) or cloud VPCs connecting to internal networks. Identify destinations that are external (unusual ports/protocols) or internal (unusual services/hosts). Use correlation analysis to link this activity to other events or threat intelligence feeds."
          },
          "Anomalous Windows Event Logs indicating activity (logons, process creation, file access) on internal systems potentially initiated by serverless functions.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688; Windows Event ID 5145",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (Successful Logon), 4688 (Process Creation), and 5145 (Detailed File Share Access) on servers/endpoints for logon attempts, process execution, or file access originating from accounts or system names associated with serverless execution roles/identities (if visible in Windows logs) or from internal IPs that might be relaying such activity. Use descriptive statistics to identify accounts/systems with unusual activity patterns."
          },
          "Connections from cloud/serverless IP ranges to internal network services or systems that are unexpected for serverless functions.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections originating from IP ranges associated with cloud provider serverless egress points or cloud VPCs connecting to the internal network. Identify connections targeting internal services (e.g., databases, file shares, RDP, internal APIs) and compare against known/authorized serverless interaction patterns. Flag connections to sensitive internal hosts or services, or volumes/frequencies inconsistent with normal operations (e.g., using frequency distribution or descriptive statistics on destination ports/IPs)."
          },
          "Successful authentication attempts or subsequent process creation events on internal systems using service accounts or roles typically associated with cloud services or serverless functions.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify Windows Event ID 4624 (Successful Logon) events on internal servers where the 'Account Name' corresponds to known cloud service roles, service accounts, or identities used by serverless functions. Correlate these logons with subsequent process creation events (Windows Event ID 4688) initiated by that account or session. Use descriptive statistics to baseline normal activity for these accounts/roles and flag unusual logons (e.g., interactive logon type for a service account) or suspicious process execution commands."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]