```json
[
  {
    "Is the adversary attempting to discover system information, specifically device drivers? (TA0007 - Discovery)": {
      "Indicators": {
        "T1652 - Device Driver Discovery": {
          "Execution of a process whose file hash matches a known malicious discovery tool or script used for driver enumeration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Windows Event ID 4688 for all process creation events. For each new process, retrieve the file hash (e.g., SHA256). Compare this hash against a high-confidence threat intelligence feed of known malicious binaries, specifically those categorized as discovery tools or scripts. Alert on any match and investigate the process lineage and subsequent activity."
          },
          "Execution of common system utilities (e.g., driverquery.exe, wmic.exe, powershell.exe, sc.exe) with command-line arguments or script content specific to enumerating device drivers.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4104",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and Windows Event ID 4104 (PowerShell Script Block Logging). Create detection rules for command-lines and script blocks containing patterns such as `driverquery.exe`, `wmic driver get`, `wmic service get`, `Get-WmiObject Win32_SystemDriver`, `Get-Service`, `Get-PnpDevice`, and `sc query`. Establish a baseline of normal administrative usage and alert when these patterns are executed by non-administrative users, from non-standard directories (e.g., %TEMP%, %APPDATA%), or as part of a suspicious process chain."
          },
          "Anomalous read activity against Windows Registry hives containing device driver and service information, such as rapid enumeration by a single process or access by an unexpected process.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable object access auditing for read access (e.g., `KEY_QUERY_VALUE`, `KEY_ENUMERATE_SUB_KEYS`) on the `HKLM\\SYSTEM\\CurrentControlSet\\Services` registry hive. Monitor Windows Event ID 4663 for access events. Establish a baseline of normal access to this hive by legitimate system processes (e.g., svchost.exe, services.exe). Use time-series analysis to detect sudden spikes in access volume and frequency analysis of process names to identify outliers. Alert on access from non-standard processes (e.g., spawned from an Office document, running from temporary user directories) or when a single process enumerates a statistically significant number of subkeys in a short period."
          },
          "A sequence of discovery activities where driver enumeration follows initial access, privilege escalation, or is initiated by a process running with an unusual parent-child relationship.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4624; Windows Event ID 4672",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Use correlation analysis to link driver discovery commands (identified via pattern-based detections) with other preceding suspicious events within a short time window (e.g., 5-15 minutes). Hunt for driver enumeration commands spawned by unusual parent processes such as `winword.exe`, `excel.exe`, or browsers. Correlate driver discovery activity with recent logon events (Windows Event ID 4624, Logon Type 3 or 10) from suspicious sources or with recent special privilege assignment (Windows Event ID 4672), which might indicate post-compromise reconnaissance."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```