[
  {
    "Is the adversary attempting to discover system information, specifically device drivers? (TA0007 - Discovery)": {
      "Indicators": {
        "T1652 - Device Driver Discovery": {
          "Execution of Windows utilities like driverquery.exe or other command-line tools used for driver enumeration.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for execution of 'driverquery.exe'. Analyze command line arguments. Calculate frequency of execution per host and user; flag executions outside of known administrative scripts or unexpected user accounts using descriptive statistics."
          },
          "Execution of processes or scripts from unusual locations or by non-standard accounts known to perform system information gathering, including driver details.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation). Identify processes with names or execution paths that deviate from normal system administration, particularly if observed attempting to interact with system information functions or run immediately after initial access/privilege escalation. Use correlation analysis to link suspicious process creation with previous events (e.g., successful login, exploit)."
          },
          "Access to specific Windows Registry keys known to contain driver or service configuration information by unusual processes or users.": {
            "Data": "Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Enable auditing for read access (SUCCESS and FAILURE) on critical registry keys containing driver and service information (e.g., \"HKLM\\SYSTEM\\CurrentControlSet\\Services\"). Monitor Windows Event ID 4663 for access to these keys. Identify access attempts by non-system processes, processes executed from unusual locations, or by standard users. Use frequency analysis to identify sudden spikes in read access to these keys."
          },
          "Execution of command-line tools or scripts (e.g., wmic, powershell) querying driver or service information.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) for command lines containing utilities and parameters used to query driver or service information (e.g., \"wmic driver get *\", \"powershell Get-PnpDevice -Class system\", \"Get-Service\", interacting with COM/WMI for driver objects). Filter by processes executed from non-standard directories or by non-administrative accounts. Use correlation analysis to link these queries to other suspicious activities or previous events."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]