
[
  {
    "Is the adversary using impersonation tactics to evade defenses or trick users? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1656 - Impersonation": {
          "Emails received from source IP addresses, domains, or containing URLs known to be associated with phishing or impersonation campaigns.": {
            "Data": "Zeek smtp.log; Zeek dns.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously correlate metadata from Zeek logs with cyber threat intelligence (CTI) feeds. Inner join source IPs from Zeek smtp.log, domains from the 'from' header in smtp.log, and queried domains from dns.log against CTI lists of known malicious IPs and domains. Scan URLs observed in Zeek http.log that correlate with email traffic against phishing URL feeds. Alert on any confirmed matches."
          },
          "Emails exhibiting patterns of display name spoofing, where the sender's display name impersonates a trusted entity but the actual 'From' address is external or unrelated.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Parse the 'From' header in Zeek smtp.log for each email to separate the display name and the email address. Compare the display name (e.g., 'CEO Name') against a list of key internal personnel and trusted partners. Flag emails where the display name matches a high-value internal identity, but the sending domain is external, non-standard, or otherwise unexpected (e.g., @gmail.com instead of @company.com). This pattern matching identifies a common impersonation technique."
          },
          "Receipt of emails from sender domains that are visually or typographically similar to legitimate internal or trusted partner domains (typosquatting).": {
            "Data": "Zeek smtp.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Extract sender domains from Zeek smtp.log and queried domains from dns.log. Compare these against an allow-list of legitimate internal and trusted partner domains. Use string similarity algorithms (e.g., Levenshtein distance) to calculate the character difference between observed domains and legitimate ones. Flag domains with a low distance score (e.g., 1-2 character difference) that also have a low frequency of occurrence across the organization. This behavioral analysis helps detect sophisticated impersonation attempts."
          },
          "Emails containing language or requests that are anomalous for the purported sender, such as urgent financial transactions, credential requests, or unusual file types, often targeting specific individuals.": {
            "Data": "Zeek smtp.log; Zeek files.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze the 'subject' field from Zeek smtp.log for high-risk keywords ('urgent', 'payment', 'invoice', 'password', 'wire transfer'). Use time series analysis to detect unusual spikes in such emails organization-wide. Analyze Zeek files.log for email attachments with high-risk extensions (e.g., .html, .iso, .img) or double extensions, especially in emails flagged for suspicious content. Use entropy measures on subject lines; a high entropy score may indicate randomly generated or obfuscated subjects used to bypass simple filters."
          },
          "An internal user account sending emails with unusual characteristics, suggesting account takeover and subsequent internal impersonation.": {
            "Data": "Zeek smtp.log; Windows Event ID 4624",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a baseline of normal email activity for internal user accounts using historical Zeek smtp.log data (e.g., recipient count per email, email frequency, time of day, common external domains). Monitor for significant deviations from this baseline, such as emails to an abnormally large number of recipients or to a high percentage of new external domains. Use correlation analysis to link these email anomalies with recent suspicious login events (e.g., Windows Event ID 4624 from an unusual geographic location or IP address) for the same user account. Use box-plots or IQR to flag outliers in email volume or recipient count per user."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
