[
  {
    "Is the adversary causing financial impact through theft? (TA0040 - Impact)": {
      "Indicators": {
        "T1657 - Financial Theft": {
          "Evidence of unauthorized financial transactions originating from compromised accounts or systems.": {
            "Data": "Zeek conn.log; Zeek http.log; Windows Event ID 4624; Windows Event ID 4663",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for connections to financial services or systems from unusual internal or external sources. Analyze Windows Event IDs 4624 (successful logon) and 4663 (attempted access to objects) on financial servers for suspicious login times or access patterns. Use correlation analysis to link successful logins or data access attempts with unusual network connections. Flag connections/access deviating significantly from established baselines (e.g., using time series analysis or anomaly detection on connection volume/frequency)."
          },
          "Suspicious network traffic or activity related to known ransomware command and control (C2) or data exfiltration endpoints potentially linked to extortion.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek dns.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log, http.log, and dns.log for connections to known malicious IPs, domains, or patterns associated with ransomware C2 infrastructure or data leak sites, as identified by threat intelligence. Analyze the volume and frequency of connections to suspicious external sites. Use entropy measures or correlation analysis to identify data transfer patterns indicative of exfiltration to these sites."
          },
          "Suspicious email traffic indicating attempted Business Email Compromise (BEC) involving requests for fund transfers or changes to payment information.": {
            "Data": "Zeek smtp.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smtp.log for emails containing keywords related to financial transactions ('invoice', 'payment', 'wire transfer', 'account change', etc.) combined with unusual sender/recipient combinations or domain characteristics. Analyze Zeek http.log for connections to webmail services from unexpected locations or followed by unusual network activity. Use frequency analysis on email metadata or connection patterns to identify anomalies indicative of BEC attempts."
          },
          "High-volume or unusual outbound data transfer patterns to external destinations, potentially indicative of data exfiltration for extortion or sale.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ftp.log; Zeek smb.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for sessions with high byte counts transmitted outbound (orig_bytes). Analyze http.log, ftp.log, and smb.log for large file transfers to external or unusual internal destinations. Establish baselines for normal outbound data transfer volumes per user, host, or network segment using descriptive statistics (mean, median, sum). Flag transfers significantly exceeding these baselines (e.g., using IQR, percentile analysis, or comparison to moving averages)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]