[
  {
    "Has the adversary executed commands on cloud virtual machines using administration services? (TA0002 - Execution)": {
      "Indicators": {
        "T1651 - Cloud Administration Command": {
          "Suspicious process creation events initiated by virtual machine agent processes (e.g., ssmagent, waagent).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs on cloud virtual machines. Identify processes created by known VM agent executables (e.g., ssmagent.exe, waagent.exe). Analyze command line arguments and parent-child process relationships for suspicious activity. Use descriptive statistics on process names/command lines launched by agents to identify rare or outlier executions."
          },
          "Network connections initiated by processes spawned by virtual machine agents to unusual external destinations or internal systems.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for network connections originating from cloud virtual machines. Correlate connection times with suspicious process creation events identified in Event ID 4688 where the parent process is a VM agent. Identify connections to unusual ports, protocols, or external IP addresses. Use correlation analysis to link host process activity (Event ID 4688) with network connections (Zeek conn.log)."
          },
          "Outbound network connections to suspicious destinations (e.g., unusual IPs, rare ports, non-standard protocols) initiated shortly after process creation by a VM agent.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate Zeek conn.log entries with Windows Event ID 4688 events where the parent process is a known VM agent. Identify outbound connections initiated within a short time window (e.g., 60 seconds) after the agent-spawned process starts. Flag connections to IPs not in known good lists, using non-standard ports/protocols, or with unusual data transfer volumes (descriptive statistics like sum or mean). Use correlation analysis to link the specific command line (from 4688) to the network activity (from conn.log)."
          },
          "Abnormal frequency or timing of administrative commands executed by virtual machine agents on specific hosts or across the environment.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 events where the parent process is a known VM agent and the command line contains administrative keywords or patterns (e.g., 'net', 'powershell', 'Invoke-Command', 'wmic', 'sc', 'taskkill'). Track the frequency of these administrative commands per host and across groups of hosts. Use time series analysis or baseline analysis (descriptive statistics like daily average) to detect sudden spikes in administrative command execution or execution occurring outside of normal maintenance windows or business hours."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]