[
    {
        "information_requirement": "Is the adversary performing discovery by enumerating system logs?",
        "tactic_id": "TA0007",
        "tactic_name": "Discovery",
        "indicators": [
            {
                "technique_id": "T1654",
                "name": "Log Enumeration",
                "evidence": [
                    {
                        "description": "Execution of a process with a file hash known to be a malicious log enumeration tool, or exfiltration of enumerated log data to a known malicious IP address or domain.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) and compare the file hash of the executed process against a CTI feed of known malicious tool hashes. Simultaneously, monitor Zeek conn.log for any network connections from log-generating systems (e.g., Domain Controllers, critical servers) to destination IPs/domains present on a CTI feed, and correlate these connections with preceding log access events on the source host."
                    },
                    {
                        "description": "Execution of native Windows utilities (e.g., wevtutil.exe, powershell.exe, findstr.exe) with specific command-line arguments used for querying, filtering, or exporting system logs.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for the execution of `wevtutil.exe`, `powershell.exe`, or `findstr.exe`. Scrutinize command-line arguments for patterns related to log enumeration, such as `wevtutil qe`, `wevtutil epl`, `Get-WinEvent`, `Get-EventLog`, `Select-String -Path ... *.evtx`, or `findstr` searching within the `WinEvt` directory. Maintain a list of suspicious command patterns and flag executions, especially when initiated by non-standard user accounts or contexts."
                    },
                    {
                        "description": "A process or user account accessing an unusually high volume or variety of distinct system log files, deviating from its established baseline of activity.",
                        "data_sources": [
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable object access auditing for log files (`%SystemRoot%\\System32\\Winevt\\Logs\\*`). Monitor Windows Event ID 4663 for read access attempts. Establish a baseline for normal log access per user and known benign processes (e.g., `svchost.exe` for EventLog service). Use descriptive statistics and time series analysis to identify unusual spikes in access frequency. Calculate the entropy of log file names accessed by a single process in a short time window; a high entropy value may indicate indiscriminate enumeration across multiple log types."
                    },
                    {
                        "description": "A sequence of events where a process reads system logs and is immediately followed by a large or anomalous outbound network connection from the same host.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a detection rule that correlates events in a sequence: 1. A process reads one or more system log files (Windows Event ID 4663). 2. Within a short time window (e.g., 1-5 minutes), the same host initiates an outbound network connection (Zeek conn.log). Flag sequences where the data volume of the network connection is a statistical outlier (using IQR or percentile analysis on `bytes_out` for that host) or where the connection is initiated by a process not typically associated with network activity. Use linear regression to model expected network traffic after log access and flag significant deviations."
                    },
                    {
                        "description": "The clearing of critical system logs, particularly the Security log, which is a common anti-forensics step taken after enumeration to hide malicious activity.",
                        "data_sources": [
                            "Windows Event ID 1102"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Generate a high-priority alert for any instance of Windows Event ID 1102 ('The audit log was cleared'). This event is highly suspicious and warrants immediate investigation. Correlate this event with recent login activity (Windows Event ID 4624) and process execution (Windows Event ID 4688) on the host to identify the responsible user account and process that preceded the log clearing event."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
