[
  {
    "Is the adversary using impersonation tactics to evade defenses or trick users? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1656 - Impersonation": {
          "Emails received with sender addresses that closely resemble internal or trusted external domains but have subtle differences (typosquatting, subdomains).": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log. Extract 'from' and 'mail_from' fields. Compare against known internal and trusted external domains. Use string distance algorithms (e.g., Levenshtein distance) to identify domains with minimal differences that could indicate typosquatting. Calculate frequency of sender domains to identify rare or new senders purporting to be established entities."
          },
          "Emails containing urgent requests for sensitive actions (e.g., financial transfers, credential sharing) using language/tone inconsistent with the purported sender or standard procedures.": {
            "Data": "Zeek http.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log 'subject' fields for keywords indicative of urgency or financial requests ('urgent', 'payment', 'invoice', 'request', etc.). Use frequency analysis and statistical outliers detection on keyword occurrences per sender or recipient group. Analyze Zeek http.log for connections initiated from user activity logs shortly after email receipt to suspicious or newly registered domains potentially linked in the email. Use entropy measures on subject lines or URLs to detect anomalies."
          },
          "Outbound network traffic from internal systems associated with potentially compromised accounts to suspicious or recently registered external domains.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek dns.log for lookups of recently registered or low-reputation domains (cross-reference with threat intelligence feeds or domain age lookups). Correlate Zeek conn.log showing outbound connections to these domains with Zeek smtp.log indicating email activity from internal users/servers to external recipients. Use correlation analysis to identify patterns of communication from potentially compromised accounts (if source users/accounts are available in logs) or internal IPs to suspicious domains."
          },
          "Successful network logons (Type 3) to internal resources from unusual sources associated with accounts potentially used for subsequent suspicious outbound communications.": {
            "Data": "Windows Event ID 4624; Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify successful network logons (Windows Event ID 4624, Logon Type 3) to internal servers from external or unusual internal source IPs, focusing on high-value accounts. Correlate these logons with subsequent outbound network connections (Zeek conn.log) and email activity (Zeek smtp.log) originating from the logged-in account or server IP. Look for patterns of logon from unusual sources immediately preceding suspicious outbound emails (flagged by unusual volume, destination, or content entropy). Use correlation analysis and time series analysis to link suspicious logon events to communication patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]