[
    {
        "information_requirement": "Is the adversary causing financial impact through theft?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1657",
                "name": "Financial Theft",
                "evidence": [
                    {
                        "description": "Network connections to or from IP addresses, domains, or URLs known to be associated with ransomware operations, financial malware C2, or cryptocurrency mining pools.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate network logs (Zeek conn.log, dns.log queries, http.log requests) against high-confidence threat intelligence feeds identifying infrastructure used for ransomware, banking trojans, cryptocurrency miners, or data leak sites. Inner join connection logs with CTI data and generate high-priority alerts for any matches. This provides a direct link to known financial threat infrastructure."
                    },
                    {
                        "description": "Execution of processes or use of command-line arguments associated with known financial fraud tools or cryptomining software.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) logs for the creation of processes with executable names (e.g., `xmrig.exe`, `t-rex.exe`, known banking trojan names) or command-line arguments that match signatures of known cryptomining software or financial theft tools. Maintain and regularly update a list of these signatures. Use correlation analysis to identify widespread execution across multiple endpoints, indicating a potential campaign."
                    },
                    {
                        "description": "Email traffic patterns matching known Business Email Compromise (BEC) schemes, such as display name spoofing, use of lookalike domains, or specific keywords related to urgent financial requests.",
                        "data_sources": [
                            "Zeek smtp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek smtp.log headers to detect discrepancies between 'From' and 'Reply-To'/'Return-Path' fields or display names that impersonate executives ('CEO Fraud'). Use regular expressions to search for lookalike domains (e.g., 'acme-corp.com' vs. 'acmecorp.com'). Scan email subjects and bodies for keyword patterns common in BEC, such as 'urgent payment', 'wire transfer', 'updated invoice', 'account details change'. Correlate these patterns with unusual sender-recipient relationships, such as an executive's spoofed account emailing an accounts payable clerk."
                    },
                    {
                        "description": "A sequence of events indicating account compromise followed by fraudulent financial activity, such as an impossible travel login followed by connections to banking websites or changes to payment systems.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and hunt for a logical attack chain: 1. A high-risk login event (e.g., Windows Event ID 4624 showing impossible travel, login from a known malicious IP, or after multiple failed attempts). 2. Within a short time window (e.g., 30 minutes), the same user/host initiates network connections (Zeek conn.log/ssl.log) to known financial institutions or payment portals. 3. The user makes POST requests (Zeek http.log) to URIs containing terms like 'transfer', 'payment', 'beneficiary', or 'payout'. Correlate these multi-source events by user, host, and time to detect the full TTP chain of financial theft."
                    },
                    {
                        "description": "Anomalous user or system access to sensitive financial applications, directories, or databases, followed by unusual data movement or network activity.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4663",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal access patterns (users, source hosts, time of day, processes) to critical financial servers and file shares using Windows Event IDs 4624 (logon) and 4663 (object access). Monitor for deviations, such as a non-finance user account accessing a payment processing application, or a server process accessing payroll data outside of its normal batch window. Correlate these anomalous access events with subsequent outbound network connections (Zeek conn.log) from the same host. Use linear regression to model expected activity levels and flag significant positive residuals."
                    },
                    {
                        "description": "Anomalous volume or characteristics of outbound data transfer from critical data repositories, suggesting exfiltration for extortion purposes.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile normal outbound data transfer volumes and file types from servers containing sensitive financial, customer, or intellectual property data. Use time series analysis on Zeek conn.log `orig_bytes` to detect sudden spikes in data leaving the network from these key assets. Analyze Zeek files.log for transfers of an unusual number of files or file types (e.g., mass transfer of compressed archives like .zip, .rar, .7z) to external destinations. Use entropy measures on file types or destination IPs to detect abnormal diversity in exfiltration activity, and use inter-quartile range (IQR) calculations on data volumes to identify statistical outliers."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
