[
  {
    "Is the adversary performing discovery by enumerating system logs? (TA0007 - Discovery)": {
      "Indicators": {
        "T1654 - Log Enumeration": {
          "Execution of host binaries/scripts (e.g., wevtutil, PowerShell) to query or export system logs (Security, System, Application).": {
            "Data": "Windows Event ID 4688; Windows Event ID 4663; Windows Event ID 1102",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation logs (Event ID 4688) for execution of `wevtutil.exe`, `powershell.exe` with command-line arguments related to log enumeration/export (e.g., `get-winevent`, `export-forwardedevents`). Monitor object access logs (Event ID 4663) for suspicious access to log files. Look for Event ID 1102 (Security log cleared). Use correlation analysis to link process execution to log file access or external network connections (Zeek conn.log)."
          },
          "Unusual access patterns or bulk data transfer from log sources (e.g., endpoints, servers, SIEM) towards internal staging points or external destinations.": {
            "Data": "Zeek conn.log; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusually large data transfers originating from potential log sources (endpoints, servers) towards unusual internal or external destinations. Use descriptive statistics and box plots on bytes transferred per connection/host to identify outliers. Monitor object access logs (Event ID 4663) for suspicious access to log files that precedes large data transfers."
          },
          "Repeated or unusual access patterns to specific log files (e.g., Security logs, Sysmon logs) by a user account or process.": {
            "Data": "Windows Event ID 4663; Zeek conn.log",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4663 for access attempts (File Read Data or similar access masks) to log files (e.g., *.evtx, Sysmon.evtx). Use time series analysis to identify sudden increases in access frequency or patterns of access that deviate from normal baseline activity. Use correlation analysis to link these access events to source process (from Event ID 4688) and user. Analyze Zeek conn.log for network activity concurrent with log access from the same host."
          },
          "Large outbound network connections from systems containing logs to suspicious destinations following log access activity.": {
            "Data": "Zeek conn.log; Windows Event ID 4663; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for unusually large outbound connections from potential log sources (endpoints/servers). Correlate these large transfers with Windows Event ID 4663 showing read access to log files and Windows Event ID 4688 showing execution of potential transfer or archiving tools on the source host. Use descriptive statistics (sum of bytes transferred) and box plots or IQR analysis on outbound data volume from these systems to identify statistical outliers. Cross-reference destination IPs with threat intelligence feeds."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]