[
  {
    "Has the adversary gained initial access to the network via content injection? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1659 - Content Injection": {
          "Unexpected file downloads or execution attempts observed on endpoints, originating from seemingly legitimate web traffic.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek http.log; Zeek file.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events initiated by web browsers or common document viewers. Analyze Zeek http.log and file.log for unexpected file downloads associated with benign-looking HTTP requests. Use correlation analysis to link file downloads to subsequent suspicious process activity (e.g., process creation, network connections). Identify rare file types or download sources using frequency analysis."
          },
          "Network connections initiated by injected content, potentially bypassing normal traffic controls or security policies.": {
            "Data": "Windows Event ID 5156; Zeek conn.log; Zeek dns.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and Windows Event ID 5156 for new outbound network connections from processes associated with recently accessed websites or documents. Compare destination IPs/domains against known good lists and threat intelligence feeds. Use descriptive statistics or entropy measures on connection parameters (e.g., destination port distribution, byte counts) to identify anomalies."
          },
          "Discrepancies or inconsistencies observed between the expected content/size of legitimate web responses and the actual data received by endpoints.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log to compare observed 'resp_bytes' and response status codes with baseline data or expected values for specific domains/services. Correlate with Zeek conn.log to examine byte counts (`orig_bytes`, `resp_bytes`) for deviations from baseline patterns for specific services/websites using descriptive statistics (mean, standard deviation) and outlier detection (IQR)."
          },
          "Execution of processes or scripts directly from web browser cache or temporary internet file locations, or unusual parent processes for executed files.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events where the image path or command line includes paths typically associated with web browser caches or temporary internet files (e.g., '%AppData%\\Local\\Microsoft\\Windows\\INetCache', '%TEMP%'). Analyze parent-child process relationships to identify processes spawned directly by web browsers or other unusual parent processes. Use frequency analysis to identify rare execution paths or parent processes."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  },
  {
    "Is the adversary using content injection for command and control? (TA0011 - Command-And-Control)": {
      "Indicators": {
        "T1659 - Content Injection": {
          "Unusual network traffic patterns or destinations associated with injected C2 communications, potentially mimicking legitimate traffic.": {
            "Data": "Zeek conn.log; Zeek dns.log; Zeek http.log; Zeek tls.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log, dns.log, http.log, and tls.log for unusual communication patterns that might indicate covert C2. Look for connections to known malicious IPs/domains, unusual domain generation algorithm (DGA) patterns using entropy analysis on domain names, or irregular data sizes/frequencies using time series analysis on connection volumes/durations. Identify suspicious TLS handshakes using JA3 hashes from Zeek tls.log."
          },
          "Observation of unexpected data exfiltration or ingress traffic channels, potentially hidden or disguised within normal communications.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log and http.log for unusual data transfers, particularly outbound traffic that doesn't conform to expected patterns (e.g., large uploads from unexpected sources, data hidden within seemingly normal requests/responses). Use linear regression or correlation analysis to identify deviations from baseline data transfer volumes for specific hosts or services. Correlate with Zeek file.log for evidence of files transferred over unexpected channels."
          },
          "Recurring small data transfers or specific sequence of requests/responses over a long-lived connection that resembles covert C2 traffic, potentially disguised as legitimate application traffic.": {
            "Data": "Zeek conn.log; Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for connections with unusual duration or periodic small data transfers (`orig_bytes`, `resp_bytes`) inconsistent with typical application behavior. Examine Zeek http.log for repetitive request patterns, unusual user agent strings, or timing anomalies. Use time series analysis to detect periodic connection attempts or data transfer pulses. Identify connections with rare JA3 hashes from Zeek ssl.log communicating with suspicious destinations."
          },
          "Detection of known malicious payloads or specific command strings embedded within otherwise normal-looking HTTP/S traffic bodies or parameters.": {
            "Data": "Zeek http.log; Zeek file.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Scan Zeek http.log request/response bodies (if captured and stored) or correlate with Zeek file.log for known malicious file hashes or patterns indicative of embedded commands or payloads transferred via HTTP/S. Use string matching or signature analysis techniques (if available in processing pipeline). Identify HTTP headers or parameters with unusual values using frequency analysis and investigate traffic involving these anomalies."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]