
[
  {
    "Has the adversary executed commands on cloud virtual machines using administration services? (TA0002 - Execution)": {
      "Indicators": {
        "T1651 - Cloud Administration Command": {
          "Execution of commands via a VM agent containing known malicious indicators such as malicious IPs, domains, or file hashes within their arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously scan the command-line arguments from Windows Event ID 4688 for all processes created by known VM agent executables (e.g., ssmagent.exe, waagent.exe, google_guest_agent.exe). Correlate and match command-line arguments against a high-confidence, continuously updated CTI feed of malicious IP addresses, domains, and file hashes. Alert on any direct matches, as this is a high-fidelity indicator of malicious execution."
          },
          "Execution of commands via a VM agent that match known malicious tool patterns, such as specific PowerShell command structures, base64-encoded payloads, or the invocation of common post-exploitation scripts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze command-line arguments from Windows Event ID 4688 for processes spawned by VM agents. Use regular expression matching to identify patterns indicative of malicious tools or techniques, such as `powershell -enc`, `IEX(New-Object Net.WebClient).DownloadString`, or references to known hacking tool scripts (e.g., Mimikatz, PowerSploit, BloodHound). Calculate the entropy of command-line arguments to find obfuscated or encoded commands; a high entropy score compared to a baseline of normal commands is a strong indicator of a pattern designed to evade simple string matching."
          },
          "A process spawned by a VM agent initiates network connections to unusual external destinations, exhibits C2-like beaconing behavior, or connects to internal systems not typically accessed by automated management.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation events (Windows Event ID 4688) for children of VM agents with network connection logs (Zeek conn.log) based on source IP and timestamp. Flag connections to non-standard ports, IP addresses with poor reputation (cross-referenced with a TI feed), or destinations in unusual geolocations. Use time series analysis on connection logs to detect patterns of regular, periodic callbacks (beaconing) or unusually long-lived connections. Use correlation analysis to link specific command lines (from Event ID 4688) to the resulting anomalous network activity."
          },
          "Execution of unusual or rare child processes by a VM agent, or processes that are inconsistent with documented administrative tasks and established baselines.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 to identify all child processes of known VM agents (ssmagent.exe, waagent.exe, etc.). Establish a baseline of common and expected child processes and their command-line structures for your environment. Use frequency analysis to flag rare or never-before-seen child processes or command-line arguments. Alert on executions of interactive shells (cmd.exe, powershell.exe without expected arguments), discovery tools (whoami.exe, net.exe, ipconfig.exe), or any process execution not part of a documented, approved administrative or maintenance task."
          },
          "A significant deviation from the baseline frequency, timing, or volume of commands executed via cloud administration services on a single host or across the environment.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Establish a statistical baseline for the execution of commands by VM agents using historical Windows Event ID 4688 data. Profile key metrics such as the typical number of commands per hour/day, the time of day for executions (e.g., distinguishing maintenance windows from business hours), and the user context of the execution. Use time series analysis (e.g., ARIMA, Holt-Winters) to detect significant spikes in execution volume or commands occurring at anomalous times. Alert when the execution volume on a host or group of hosts exceeds a dynamic threshold (e.g., >3 standard deviations from the mean) or deviates significantly from its historical pattern."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
