[
  {
    "Has the adversary acquired access to the network or systems? (TA0042 - Resource Development)": {
      "Indicators": {
        "T1650 - Acquire Access": {
          "Successful authentication using legitimate but potentially compromised accounts from unusual or previously unseen external locations.": {
            "Data": "Windows Event ID 4624; Zeek conn.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Collect successful login events (Windows Event ID 4624, Zeek conn.log, VPN logs). Filter for external source IPs. Compare source IPs and login times against historical data for each user/account. Identify users with successful logins from previously unseen IPs or at times statistically outside their normal behavior (e.g., using time series analysis or correlation with geographic data). Prioritize accounts with high privileges."
          },
          "Discovery or use of unauthorized remote access tools (like Web Shells or unexpected VPN configurations) not provisioned by IT.": {
            "Data": "Windows Event ID 4688; Windows Event ID 5156; Zeek http.log; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) and network connection events (Windows Event ID 5156, Zeek conn.log) on public-facing servers and endpoints. Search for processes or network connections associated with known web shell names/hashes or communication patterns indicative of unauthorized remote access tools. Analyze entropy or frequency distribution of accessed URLs/parameters in Zeek http.log on web servers to detect anomalous patterns indicative of web shell activity."
          },
          "Suspicious connections or activity on internal systems originating from an account/source that appears to have bypassed standard external access points (e.g., direct RDP, SMB, WinRM from external IP without VPN).": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek conn.log for connections from external source IPs directly to internal service ports (e.g., RDP 3389, SMB 445, WinRM 5985/5986) on internal servers, bypassing VPN or standard gateways. Correlate with Windows Event IDs 4624 (successful logon) and 4625 (failed logon) on target servers to identify associated accounts. Use frequency analysis or descriptive statistics (e.g., count of distinct external source IPs per internal service per time unit) to identify accounts or source IPs exhibiting such direct external access patterns that are rare or non-existent in baseline data."
          },
          "Unusual pattern of rapid credential reuse across multiple systems or services shortly after a successful login via an external vector or suspicious internal foothold.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4648",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4624 (successful logon) and 4648 (explicit credential logon) across endpoints and servers. Identify successful logons originating from suspicious external sources (from other alerts) or associated with the initial access vector. Correlate these initial logons with subsequent successful logons using the *same* account (or explicitly supplied credentials for that account) on *multiple different* internal systems within a short timeframe (e.g., minutes to hours). Use correlation analysis or clustering techniques to group logon events by account and source/target systems to identify accounts exhibiting rapid lateral movement patterns."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]