
[
  {
    "Has the adversary gained initial access to the network via Wi-Fi? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1669 - Wi-Fi Networks": {
          "Connections from MAC addresses or to BSSIDs matching a watchlist of known rogue, suspicious, or unauthorized devices.": {
            "Data": "Wireless Controller/Access Point Logs; RADIUS Logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain a watchlist of suspicious or known-malicious MAC addresses (for clients) and BSSIDs (for access points), populated from threat intelligence or prior incidents. Continuously compare all connection attempts and authentications recorded in wireless controller and RADIUS logs against this list. An inner join between the live connection logs and the watchlist will reveal matches. Alert on any match for immediate investigation of the device and its activity."
          },
          "Execution of known Wi-Fi cracking, sniffing, or man-in-the-middle tools on a network-connected endpoint, identified by process name or command-line arguments.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events on all endpoints, particularly those on the Wi-Fi segment. Use a watchlist of process names (e.g., aircrack-ng.exe, ettercap.exe, kismet.exe, wireshark.exe) and suspicious command-line patterns (e.g., 'aireplay-ng --deauth'). Correlate process execution with the host's network activity (from Zeek conn.log) to identify subsequent anomalous traffic patterns, such as scanning or connecting to unusual ports. Use correlation analysis on parent-child process relationships to detect suspicious execution chains."
          },
          "Detection of a rogue or 'evil twin' access point broadcasting a legitimate or similarly named corporate SSID from an unauthorized device.": {
            "Data": "Wireless Controller/Access Point Logs; Wireless Intrusion Detection System (WIDS) Logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor and profile all detected access points broadcasting corporate or look-alike SSIDs. Compare the BSSIDs (MAC addresses) and cryptographic configurations of these APs against a maintained inventory of authorized corporate APs. Alert on any corporate SSID being broadcast from an unknown BSSID or with incorrect security settings. Use linear regression on signal strength data over time to detect new, persistent APs in unexpected locations. Correlate with Zeek conn.log to see if any corporate devices attempt to connect to these rogue APs."
          },
          "An abnormally high rate of failed Wi-Fi authentication attempts from a single device, or a sudden spike in failures across the network, indicating brute-force or deauthentication attacks.": {
            "Data": "Wireless Controller/Access Point Logs; RADIUS/802.1X Authentication Logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Aggregate failed authentication events (e.g., EAP failures, incorrect pre-shared keys) from RADIUS and wireless controller logs by source MAC address. Use time series analysis to detect sudden spikes in the overall failed authentication rate across the network, which could indicate a broad attack. For individual devices, use descriptive statistics to establish a baseline of failed attempts and flag any MAC address exceeding a dynamic threshold (e.g., >3 standard deviations from the mean, or a count identified as an outlier using an Inter-Quartile Range box-plot)."
          },
          "An unknown or unmanaged device successfully connecting to a protected enterprise Wi-Fi network, or a known device connecting with a spoofed MAC address.": {
            "Data": "Wireless Controller/Access Point Logs; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Maintain an inventory of authorized MAC addresses for devices permitted on the corporate Wi-Fi network. Correlate successful connection logs from wireless controllers with this inventory to identify any connections from unauthorized MAC addresses. To detect spoofing, monitor for behavioral impossibilities, such as the same MAC address being seen simultaneously on physically distant access points or appearing on a wired switch port (via Zeek conn.log source MAC) and a wireless AP at the same time. Analyze the OUI (first 3 bytes of the MAC) of connecting devices; flag connections where the OUI vendor does not match the expected device type from asset inventory."
          },
          "A dual-homed system connected to both wired and wireless networks bridging traffic between the corporate network and an external or untrusted network.": {
            "Data": "Zeek conn.log; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify dual-homed systems by correlating logs to find devices with active IP addresses on both wired and wireless subnets. Monitor Zeek conn.log for traffic patterns indicative of bridging, such as traffic originating from the trusted wired network being sent from the dual-homed device's wireless IP address to an external destination. Analyze connection volumes and destinations to detect anomalies. On the host, monitor Windows Event ID 4688 for the execution of network configuration tools (e.g., netsh.exe) that could enable bridging or routing."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
