[
  {
    "Is the adversary attempting to impact network or data availability/integrity using email bombing? (TA0040 - Impact)": {
      "Indicators": {
        "T1667 - Email Bombing": {
          "High volume of incoming email traffic to targeted recipients within a short time frame.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log for connection rate, smtp.log for message volume) for connections to internal mail servers (SMTP ports 25, 587, etc.). Identify specific destination email addresses receiving a high volume or rate of connections/messages within a short time window. Use time series analysis or simple rate limiting thresholds to detect significant spikes in email traffic targeting specific recipients. Calculate the average connection/message rate per recipient over time and flag recipients exceeding a calculated threshold (e.g., using standard deviation or IQR)."
          },
          "Significant increase in volume or rate of connections to internal mail infrastructure from external sources targeting specific recipients, potentially indicating an attempt to bury legitimate emails.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek logs (conn.log, smtp.log) for connections related to inbound email targeting recipients identified in high-volume alerts. Analyze patterns of connection source/destination, size, and frequency to identify distinct streams of high-volume, potentially junk traffic versus normal correspondence streams. Look for changes in the distribution of email traffic volume or source IPs targeting specific users that deviate from historical norms using descriptive statistics."
          },
          "Presence of multiple automated web registrations for email lists or newsletters originating from internal IPs or associated with email bombing traffic source IPs.": {
            "Data": "Zeek http.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek http.log for outgoing connections to websites known for email list subscriptions or containing registration forms, especially if originating from internal IPs potentially involved in sending bombing emails or associated with email bombing traffic source IPs. Analyze HTTP requests for POST data often found in registration forms (e.g., containing email addresses). Use frequency analysis to identify internal hosts making an unusual number of such connections or registrations within a short period. Correlate with Zeek conn.log for associated traffic patterns."
          },
          "Inbound or outbound network connections from a user's system or mail server to unexpected or potentially malicious destinations immediately following a detected email bombing event targeting that user.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon detecting a high-volume email bombing event targeting a specific recipient (user or system), monitor Zeek conn.log and Windows Event ID 5156 on relevant endpoints/servers for inbound/outbound connections associated with that user/system immediately following the bombing. Correlate connection data (source/destination IPs, ports, protocols) with Threat Intelligence feeds and baseline network traffic patterns. Flag connections to rare destinations, known malicious IPs, or using unusual ports/protocols (potentially identified via correlation analysis or entropy measures) as potential follow-on activity (e.g., C2 or data exfiltration attempts)."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]