```json
[
  {
    "Is the adversary attempting to impact network or data availability/integrity using email bombing? (TA0040 - Impact)": {
      "Indicators": {
        "T1667 - Email Bombing": {
          "Inbound emails from sources (IPs, domains) or with content (subjects) matching known email bombing or spam-as-a-service indicators.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate sender IP addresses (from Zeek conn.log connecting to mail server ports) and sender domains/subjects (from Zeek smtp.log) against continuously updated threat intelligence feeds and internal blocklists for known malicious senders, spam-as-a-service providers, or subject lines used in past bombing campaigns. Use exact matching and regular expressions to alert on any confirmed matches."
          },
          "A high diversity of senders delivering emails with identical or highly similar content to a single recipient, characteristic of a subscription bomb.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "For recipients flagged with high email volume, aggregate Zeek smtp.log data. Group messages by recipient and analyze the diversity of sender IPs/domains versus the similarity of subject lines or message bodies (using hashing or fuzzy hashing like ssdeep). Calculate the entropy of sender domains for emails with identical subjects; a high entropy combined with low content variance is a strong pattern for a distributed subscription bomb. Investigate recipients with an unusually high ratio of unique senders to identical content."
          },
          "Multiple automated web registrations for email lists or newsletters associated with a target's email address, indicating a potential setup for a subscription bomb.": {
            "Data": "Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "This is a proactive hunt. Monitor Zeek http.log for outgoing HTTP POST requests containing internal email addresses in form data fields (e.g., 'email=', 'subscriber='). Use frequency analysis to identify any source IP (internal or external) making an anomalous number of subscription requests for the same or different target email addresses in a short time. This pattern often precedes the email bomb itself."
          },
          "A statistically significant anomaly in the volume, rate, or size of emails targeting a specific recipient or the mail server as a whole, deviating from established baselines.": {
            "Data": "Zeek conn.log; Zeek smtp.log",
            "Data Platform": "Network devices, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously monitor Zeek conn.log and smtp.log to establish baseline email traffic metrics (e.g., messages/minute, connections/minute, average message size) per recipient and for the mail infrastructure overall. Use time series analysis (e.g., ARIMA) to forecast expected traffic and detect anomalies where the actual volume significantly exceeds the predicted range (e.g., >3 standard deviations). Use box-plots or IQR analysis on short-term traffic windows to flag sudden spikes that are statistical outliers. Investigate the top N recipients driving any detected anomaly."
          },
          "Anomalous network activity from a user's system occurring concurrently with an email bombing event, suggesting a distraction tactic to hide other malicious actions.": {
            "Data": "Zeek conn.log; Windows Event ID 5156",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Upon triggering an email bomb alert for a user, automatically elevate monitoring on that user's endpoint and associated network traffic. Correlate the timestamp of the bombing event with network connection logs (Zeek conn.log, Windows Event ID 5156). Use correlation analysis to look for new connections to rare external IPs (low frequency analysis), traffic on non-standard ports, or DNS queries for suspicious domains. This behavioral hunt aims to find the true objective hidden by the 'noise' of the email bomb."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```