[
  {
    "Is the adversary attempting to maintain exclusive control over compromised systems? (TA0003 - Persistence)": {
      "Indicators": {
        "T1668 - Exclusive Control": {
          "System logs showing unexpected patching events, service disabling, or firewall rule modifications.": {
            "Data": "Windows Event ID 1127; Windows Event ID 4946; Windows Event ID 4947; Windows Event ID 7036",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (1127, 4946, 4947, 7036) for unexpected software installations (patches), firewall changes, or service state changes. Identify processes responsible for these changes using process creation logs (Windows Event ID 4688). Analyze the timing of these events using time series analysis to detect deviations from normal patch cycles or maintenance windows. Correlate with network logs (Zeek conn.log) for outbound connections during these events."
          },
          "Execution logs showing attempts to uninstall or disable security software, remove files, or modify user/group privileges.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4720; Windows Event ID 4724; Windows Event ID 4738; Zeek file.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (4688, 4720, 4724, 4738) for process executions associated with software uninstallation tools, file deletion commands, or privilege modification utilities. Analyze the frequency and timing of these events using descriptive statistics and outlier detection (e.g., box plots) to identify unusual bursts of activity. Monitor Zeek file.log for potential deletion or modification of executable files transferred over the network."
          },
          "Deletion or modification of executable files or configuration files associated with security tools or competing malware.": {
            "Data": "Windows Event ID 4663; Windows Event ID 4656; Zeek file.log; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event Logs (4663 - file delete, 4656 - handle request) for deletion or modification attempts on known security tool paths or common malware locations. Use Windows Event ID 4688 to identify the responsible process and its command line. Monitor Zeek file.log for file transfers (upload/download) involving suspicious file extensions or names from affected hosts. Create a list of critical files/paths (security tools, config files) and track events affecting them using frequency analysis to identify unusual activity spikes."
          },
          "Unexpected installation of patches or disabling of specific services known to be vulnerable shortly after suspicious activity or compromise.": {
            "Data": "Windows Event ID 1127; Windows Event ID 7036; Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event IDs 1127 (MSI Installer) and 7036 (Service Status) for unexpected patch installations or service disablements, particularly on services known to be vulnerable. Correlate these events with preceding suspicious activity observed on the host or from network logs (e.g., exploit attempts, anomalous logins). Identify the process initiating the change (Event ID 4688) and its command line. Maintain a list of known vulnerable services and monitor their status changes. Use time series analysis or correlation rules to link suspicious inbound network events with subsequent host remediation actions."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]