```json
[
  {
    "Is the adversary attempting to maintain exclusive control over compromised systems? (TA0003 - Persistence)": {
      "Indicators": {
        "T1668 - Exclusive Control": {
          "Execution of a process identified by file hash as a known tool for disabling security products or removing competing malware.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 (Process Creation) and extract the file hash for each new process. Correlate these hashes against a continuously updated threat intelligence feed of known malicious tools used for disabling security products (e.g., PCHunter, GMER, PowerTool) or specific malware removers. Generate a high-priority alert for any exact hash match."
          },
          "Command-line execution patterns consistent with disabling security services, modifying firewall rules, or forcefully uninstalling security software.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor process creation events (Windows Event ID 4688) for specific command-line arguments used to manipulate system defenses. Use regular expression matching to search for patterns such as: `netsh advfirewall set allprofiles state off`, `sc.exe config <service_name> start= disabled`, `sc.exe stop <service_name>`, `wmic product where name='<security_product_name>' call uninstall`, or `powershell.exe -c Set-MpPreference -DisableRealtimeMonitoring $true`. Maintain and regularly update a list of these command patterns associated with security tampering."
          },
          "Unauthorized modification of specific registry keys or values known to disable or cripple security products like antivirus or EDR agents.": {
            "Data": "Windows Event ID 4657",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a high-fidelity monitoring list of critical registry keys associated with security tools. Monitor for registry modification events (Windows Event ID 4657) targeting these keys. Examples include `HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\DisableAntiSpyware` or keys under `HKLM\\SYSTEM\\CurrentControlSet\\Services` for various EDR or AV services. Alert on any modification by an unauthorized process (i.e., not a trusted installer or administrator process during a maintenance window)."
          },
          "A process spawned from a network service or suspicious parent modifies firewall rules, disables security-related services, or deletes files in security tool directories outside of an approved change window.": {
            "Data": "Windows Event ID 4688; Windows Event ID 4947; Windows Event ID 7036; Windows Event ID 4663",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate process creation (Windows Event ID 4688) with subsequent defensive actions like firewall modification (4947), service state changes (7036), or file deletion (4663). Analyze the parent-child process relationships to identify when a process spawned by a remote access tool, web server, or other suspicious parent performs these actions. Use time series analysis of these events to establish a baseline of normal maintenance activity and alert on deviations or outliers that occur outside of expected change windows."
          },
          "A sequence of user account modifications indicating a hostile takeover, such as a newly created administrative account proceeding to delete or disable other legitimate user accounts.": {
            "Data": "Windows Event ID 4720; Windows Event ID 4726; Windows Event ID 4732; Windows Event ID 4725",
            "Data Platform": "Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Create a correlation rule to detect a malicious sequence of account manipulation events within a short time window (e.g., 30 minutes): 1. A new user account is created (Event ID 4720). 2. The new account is added to a privileged group like Administrators (Event ID 4732). 3. The new account (or the process that created it) subsequently disables (Event ID 4725) or deletes (Event ID 4726) other existing user accounts, especially other administrative accounts. Investigate any such sequence as a potential exclusive control attempt."
          },
          "Installation of a patch for a specific vulnerability or disabling of a vulnerable service immediately following suspicious inbound network activity indicative of exploitation.": {
            "Data": "Zeek conn.log; Windows Event ID 1127; Windows Event ID 7036; Windows Event ID 4688",
            "Data Platform": "Network devices, Servers, Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Correlate network events with host events by linking suspicious inbound connections (e.g., from Zeek conn.log matching exploit signatures or originating from known bad IPs) to subsequent host-based remediation actions on the target system. Use correlation analysis to identify if a patch installation (Windows Event ID 1127) or service disablement (Windows Event ID 7036) occurs within a short window (e.g., 1 hour) after the suspicious network event. Investigate the process that initiated the patch/change (Windows Event ID 4688) to verify if it was an unauthorized action intended to prevent further exploitation by others."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
```