[
  {
    "Has the adversary gained initial access to the network via Wi-Fi? (TA0001 - Initial Access)": {
      "Indicators": {
        "T1669 - Wi-Fi Networks": {
          "Successful or failed connections to enterprise Wi-Fi access points from unknown or unexpected devices/MAC addresses.": {
            "Data": "Zeek conn.log; Wireless Controller/Access Point Logs; RADIUS/802.1X Authentication Logs",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor wireless access point logs and RADIUS authentication logs for connection attempts from unknown MAC addresses or devices not registered in asset inventory. Use frequency analysis on MAC addresses and device types connecting to the Wi-Fi to establish a baseline. Investigate connections bypassing expected authentication mechanisms or deviating significantly from the baseline frequency."
          },
          "Unusual network traffic originating from a dual-homed system (wired and wireless) that connects to the enterprise Wi-Fi.": {
            "Data": "Zeek conn.log; Windows Event ID 4624; Windows Event ID 4625; Windows Event ID 4688",
            "Data Platform": "Network devices, Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Identify dual-homed systems (systems with active connections on both wired and wireless interfaces). Monitor Zeek conn.log for traffic originating from these systems destined for the wireless network segment that seems anomalous in volume, destination, or protocol. Use correlation analysis to link anomalous traffic patterns with host events (Windows Event IDs 4624, 4625, 4688) on the dual-homed system."
          },
          "Execution of known network sniffing or MITM tools on Wi-Fi connected systems.": {
            "Data": "Windows Event ID 4688; Zeek conn.log; Zeek http.log",
            "Data Platform": "Endpoints, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on endpoints connected to Wi-Fi for process creation events indicating known network sniffing or MITM tools (e.g., Wireshark, tcpdump, Ettercap). Identify the source IP address of the host executing the tool. Correlate with Zeek conn.log to identify anomalous network traffic originating from this host, such as connections to unusual destinations or high data volume using descriptive statistics. Analyze Zeek http.log for potential cleartext credentials or unusual TLS/SSL errors indicative of MITM. Investigate the process parent-child relationships for suspicious tool execution."
          },
          "High rate of failed Wi-Fi authentication attempts from a single source or attempts to connect to unauthorized SSIDs.": {
            "Data": "Wireless Controller/Access Point Logs; RADIUS/802.1X Authentication Logs; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor wireless controller/AP logs and RADIUS/802.1X logs for failed authentication events (e.g., EAP failures) and attempts to associate with unauthorized SSIDs. Aggregate failed attempts by source MAC address and time. Use frequency analysis to identify MAC addresses with unusually high failure rates or those attempting multiple unauthorized SSIDs. Correlate failed attempts with Zeek conn.log for any connection attempts originating from these MACs before successful authentication. Use time series analysis to identify sudden spikes in failed authentication attempts across the network."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]