[
  {
    "Is the adversary attempting to evade defenses by modifying cloud resource hierarchy? (TA0005 - Defense-Evasion)": {
      "Indicators": {
        "T1666 - Modify Cloud Resource Hierarchy": {
          "Successful execution of cloud provider CLI tools or connections to cloud API endpoints associated with modifying top-level hierarchy (e.g., creating accounts, leaving organizations, creating subscriptions) from unexpected internal systems.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events indicating cloud provider CLI tools (`aws`, `az`, `gcloud`, etc.) or scripts executing. Analyze Zeek conn.log for connections originating from internal IPs to known cloud provider API endpoints related to identity, account, or organization management (e.g., STS, IAM, Organizations for AWS; Azure AD, Resource Manager for Azure). Use correlation analysis to link these network events to specific hosts/users and identify activity from unauthorized locations or times. Use descriptive statistics or time series analysis to baseline normal activity towards these endpoints and flag significant deviations."
          },
          "Network traffic patterns or internal host activity suggesting the preparation or execution of cloud resource transfers or ownership changes that bypass standard logging.": {
            "Data": "Windows Event ID 4688; Zeek conn.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log for high-volume or unusual connections from internal hosts towards cloud provider endpoints not typically associated with routine operations, which could indicate resource manipulation attempts. Monitor Windows Event ID 4688 for execution of scripts or commands that might interact with cloud resources in ways intended to obscure actions. While direct evidence of resource transfer is typically in cloud-native logs, analyze available logs for preparatory steps or anomalous network interactions potentially related to such activity using correlation analysis to link events across different log types."
          },
          "Execution of cloud provider CLI commands or scripts associated with modifying resource hierarchy (e.g., aws organizations leave-organization, az account create) on internal hosts.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events containing cloud provider CLI commands (`aws`, `az`, `gcloud`) and specific arguments related to resource hierarchy modification (`organizations leave-organization`, `account create`, `organizations policies update`, `subscriptions create`, etc.). Establish a baseline of normal cloud management command executions on designated administrative hosts. Use frequency analysis or comparison to baseline (e.g., using z-scores or control charts) to identify executions of these commands on non-administrative hosts or by unusual users/processes."
          },
          "Network connections from internal hosts to cloud provider API endpoints specifically associated with account, organization, or subscription management services.": {
            "Data": "Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log to identify connections from internal hosts to known cloud provider API endpoints associated with account, organization, or subscription management (e.g., `organizations.amazonaws.com`, `management.azure.com`, `cloudresourcemanager.googleapis.com`). Establish baseline network traffic patterns to these specific endpoints from authorized internal sources. Use anomaly detection techniques (e.g., time series analysis for volume/frequency, statistical methods for source/destination analysis like entropy) to flag connections from new or unusual source IPs/hosts or with anomalous timing or volume."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]