[
  {
    "Is the adversary attempting to discover virtual machines within the environment? (TA0007 - Discovery)": {
      "Indicators": {
        "T1673 - Virtual Machine Discovery": {
          "Execution of hypervisor CLI commands (e.g., esxcli, vim-cmd) known to enumerate VMs on a host or hypervisor.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 on jump boxes or management servers for process creations involving command-line tools like 'esxcli', 'vim-cmd', or similar hypervisor CLI utilities. Analyze command-line arguments for patterns indicating VM enumeration (e.g., 'list', 'getallvms'). Calculate the frequency of such commands and flag rare executions or executions by unusual users/processes using frequency analysis."
          },
          "Unusual network connections or activity patterns directed at hypervisor management interfaces (e.g., vCenter, ESXi web interface).": {
            "Data": "Zeek conn.log; Zeek http.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek conn.log and http.log for connections originating from potentially compromised internal hosts to known hypervisor management ports or web interfaces (e.g., ESXi, vCenter). Identify connections with unusual source IPs, unusual timing (e.g., outside maintenance windows), or suspicious HTTP request patterns. Use frequency analysis or time series analysis to identify anomalous connection volume or patterns to these interfaces."
          },
          "SNMP queries originating from unexpected internal hosts targeting hypervisor management interfaces or subnets known to contain hypervisors.": {
            "Data": "Zeek snmp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek snmp.log for SNMP GET/GETNEXT requests originating from internal hosts not typically used for infrastructure management, targeting IPs or subnets associated with hypervisors. Identify OIDs commonly used for system/process discovery or virtual machine enumeration if known. Correlate with Zeek conn.log to identify the full connection details. Use frequency analysis to baseline SNMP query sources and destinations and flag deviations."
          },
          "Unusual log entries on hypervisor hosts or management servers indicating successful or failed authentication or API calls immediately preceding suspected VM discovery activity.": {
            "Data": "Windows Event ID 4624; Windows Event ID 4625; Zeek http.log",
            "Data Platform": "Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor successful (4624) and failed (4625) logon attempts on servers used for hypervisor management, especially network logons (Type 3). Monitor Zeek http.log for authentication attempts (GET/POST to login endpoints) on hypervisor web interfaces. Correlate unusual or suspicious authentications (e.g., brute force patterns, logins from rare sources/times) with subsequent execution of discovery commands (from existing evidence) or network connections to management APIs using correlation analysis."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]