
[
  {
    "Is the adversary executing commands or code via input injection? (TA0002 - Execution)": {
      "Indicators": {
        "T1674 - Input Injection": {
          "Execution of command line arguments or network requests to domains/IPs that are an exact match to known malicious indicators associated with input injection campaigns.": {
            "Data": "Windows Event ID 4688; Zeek http.log; Zeek dns.log",
            "Data Platform": "Endpoints, Servers, Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Continuously scan Windows Event ID 4688 command lines for specific strings or arguments known to be used by malware employing input injection. Concurrently, use Zeek http.log and dns.log to check requested hostnames and URLs against a high-confidence cyber threat intelligence (CTI) feed of domains known to host malicious JavaScript for injection or serve as frames for Browser-in-the-Browser attacks. Alert on any exact matches."
          },
          "Spawning of command shells or script interpreters (e.g., powershell.exe, cmd.exe, wscript.exe) as direct child processes of common user-facing applications such as web browsers or office productivity software.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for process creation events. Maintain and enforce a list of suspicious parent-child process relationships (e.g., chrome.exe -> powershell.exe, outlook.exe -> cmd.exe, iexplore.exe -> wscript.exe). Generate high-priority alerts for any occurrences of these predefined malicious patterns. Use process lineage analysis to confirm the direct parent-child relationship and investigate the associated user session."
          },
          "Execution of command lines that are unusually long, complex, or contain obfuscated content (e.g., Base64 encoding), suggesting they were not typed manually but injected via methods like pastejacking.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "From Windows Event ID 4688 logs, measure the length and calculate the character entropy of all command lines. Establish a dynamic baseline for normal command line length and entropy for common processes (e.g., cmd.exe, powershell.exe). Use statistical methods such as Inter-Quartile Range (IQR) or Z-scores to flag outliers that are significantly longer or more complex than the norm. Specifically search for PowerShell command lines using '-EncodedCommand' or '-e' and decode the payload for analysis."
          },
          "An atypically rapid sequence of process creations originating from the same parent process or user session, suggesting automated input from a script or malicious hardware device (Keystroke Injection).": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 timestamps. Group consecutive process creation events by their Parent Process ID or user session. Calculate the time delta between each event in the sequence. Use time series analysis or simple statistical thresholds (e.g., more than 5 process creations in under 1 second from a single parent) to identify bursts of activity that are too fast for manual typing. Correlate with physical device connection events (e.g., USB insertion) if available."
          },
          "Anomalous JavaScript loading or unexpected iframe rendering from external or suspicious sources within a web session, potentially indicating JavaScript Injection or Browser-in-the-Browser attacks.": {
            "Data": "Zeek http.log; Zeek ssl.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek http.log to identify websites loading JavaScript from multiple, disparate, or non-reputable domains within a single page load. Use frequency analysis to identify rare or new external script sources. Monitor for the creation of iframes that overlay the entire page and source content from a look-alike or suspicious domain, identified by checking the 'Referer' and 'Host' headers or via SSL certificate information (e.g., new, self-signed certs) in Zeek ssl.log. Use correlation analysis to link suspicious script loads to subsequent malicious network traffic from the same host."
          }
        }
      },
      "version": "2.0",
      "last_updated": "2025-05-11"
    }
  }
]
