[
  {
    "Has the adversary executed commands on guest VMs using ESXi administration services? (TA0002 - Execution)": {
      "Indicators": {
        "Unusual network connections originating from ESXi host management interfaces to guest VMs or unexpected external destinations.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek conn.log for connections originating from ESXi host management IPs. Filter for connections to unexpected ports, external IPs, or unusual internal IPs. Use time series analysis to detect spikes or changes in connection volume/destinations from these sources."
        },
        "Process creation events on guest Windows VMs showing vmtoolsd.exe spawning suspicious child processes or executing unexpected commands.": {
          "Data": "Windows Event ID 4688",
          "Data Platform": "Servers",
          "NAI": "Insert site-specific NAI here",
          "Action": "Monitor Windows Event ID 4688 logs on guest VMs. Identify processes created by vmtoolsd.exe or vmtoolsd. Use correlation analysis to link these process creations to other suspicious events on the host or network activity observed in Zeek logs."
        },
        "Creation of suspicious processes or execution of known malicious commands on guest VMs correlated with prior network activity from ESXi management IPs.": {
          "Data": "Windows Event ID 4688; Zeek conn.log",
          "Data Platform": "Servers, Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Correlate Windows Event ID 4688 logs on guest VMs with Zeek conn.log entries showing connections from ESXi management IPs to those guests within a short time window (e.g., 60 seconds). Filter 4688 logs for suspicious process names, command line arguments (e.g., invoking powershell, cmd.exe for unusual tasks, data exfiltration tools), or processes with low prevalence (using frequency analysis). Flag process creation events that follow suspicious network activity from the ESXi host IPs."
        },
        "Unusual outbound data transfer volume or connections to suspicious external destinations originating from guest VMs.": {
          "Data": "Zeek conn.log",
          "Data Platform": "Network devices",
          "NAI": "Insert site-specific NAI here",
          "Action": "Analyze Zeek conn.log for outbound connections from guest VM IPs to external destinations. Use time series analysis to identify sudden increases or deviations from baseline in bytes transferred or connection frequency per guest VM. Flag connections to known malicious IPs from threat intelligence feeds or destinations with low historical connection frequency (using frequency analysis/percentiles)."
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]