[
  {
    "Is the adversary executing commands or code via input injection? (TA0002 - Execution)": {
      "Indicators": {
        "T1674 - Input Injection": {
          "Unusual or rapid sequence of system command executions or script interpreter launches (e.g., PowerShell, cmd.exe, bash) potentially indicative of simulated keystrokes.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 (Process Creation) logs. Identify processes launched with command lines containing unexpected keywords or unusual sequences (e.g., 'powershell.exe -command ...', 'cmd.exe /c ...'). Analyze process creation timing; identify rapid sequences of commands or processes launched in quick succession (e.g., using time series analysis on process creation timestamps, calculating time differences between consecutive process creations)."
          },
          "Unexpected or programmatic interaction with GUI elements (e.g., rapid window switching, opening developer console) or script execution within browser processes originating from unusual events.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 for processes launched from unexpected parent processes (e.g., command interpreter or script host launched directly from a browser process) or with command lines indicating browser interaction (e.g., opening dev tools, pasting commands). Use frequency analysis to identify rare or unusual process relationships or command line arguments on a per-host or per-user basis."
          },
          "Suspiciously long or complex command line arguments executed within processes, potentially indicating pasted or injected input.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints, Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Windows Event ID 4688 for process creation events. Measure the length and complexity (e.g., presence of special characters, base64 patterns) of command line arguments. Use statistical methods such as percentile analysis or mean/standard deviation calculations on argument lengths per process type to identify outliers that are significantly longer or more complex than normal, which may suggest injected input."
          },
          "Execution of script interpreter processes or unusual child processes spawned directly from user-facing applications like browsers or office documents.": {
            "Data": "Windows Event ID 4688",
            "Data Platform": "Endpoints",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Windows Event ID 4688 logs. Identify instances where known script interpreters (e.g., powershell.exe, wscript.exe, cscript.exe) or command shells (cmd.exe) are spawned as direct child processes of common user applications (e.g., browser processes, winword.exe, excel.exe). Analyze process lineage (parent-child relationships) using graph analysis or simple rule-based detection to identify uncommon or suspicious parent-child relationships."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]