[
  {
    "Is the adversary employing email spoofing for defense evasion? (TA0005 - Defense Evasion)": {
      "Indicators": {
        "T1672 - Email Spoofing": {
          "Inbound emails failing DMARC, SPF, or DKIM authentication checks for domains that should enforce these.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log for inbound emails where DMARC, SPF, or DKIM status indicates failure ('fail', 'softfail', 'permerror', 'temperror') or policy indicates 'none', specifically for domains known to enforce stricter policies. Use correlation analysis to identify patterns of failed checks targeting specific internal users or departments."
          },
          "Inbound emails with FROM headers that appear to originate from internal or trusted external domains but bypass or have missing DMARC, SPF, or DKIM authentication checks.": {
            "Data": "Zeek smtp.log; Zeek conn.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review Zeek smtp.log and conn.log for inbound emails exhibiting characteristics of spoofing (e.g., mismatch between FROM header and authenticated sender, missing or weak authentication results) originating from external IPs. Identify source IPs and correlate with threat intelligence. Use descriptive statistics on source IP reputation or historical communication patterns to identify anomalies."
          },
          "Inbound emails where the SMTP envelope sender (MAIL FROM) does not match the email header sender (From:), particularly when the header sender is a trusted domain.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Analyze Zeek smtp.log for inbound emails where the 'mailfrom' field is different from the 'from' field. Filter for cases where the 'from' field contains a domain from a list of internal or trusted external domains. Investigate these discrepancies as potential spoofing attempts. Use frequency analysis to identify repeated spoofing attempts targeting specific users or domains or occurring within specific time windows."
          },
          "Spike in inbound emails from an unusual external IP address claiming to originate from a trusted internal or external domain.": {
            "Data": "Zeek smtp.log",
            "Data Platform": "Network devices",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Zeek smtp.log for inbound emails where the 'from' header matches a domain from a list of internal or trusted external domains. Aggregate emails by source IP and 'from' domain. Use time series analysis or statistical process control (e.g., identifying points outside 2 standard deviations from the mean daily volume) to detect sudden increases in email volume from specific external IPs using trusted 'from' domains. Investigate source IPs with anomalous activity."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]