[
  {
    "Is the adversary maintaining persistence by leveraging cloud application integrations? (TA0003 - Persistence)": {
      "Indicators": {
        "T1671 - Cloud Application Integration": {
          "Creation or modification of OAuth application integrations with broad permissions or unusual names/publishers.": {
            "Data": "SaaS/Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor SaaS/Cloud Audit Logs for events related to application creation (e.g., 'Add application'), consent grants (e.g., 'Consent to application'), or modification (e.g., 'Update application'). Identify events initiated by unusual accounts or with broad permissions. Use correlation analysis to link application creation/modification events to subsequent unusual access attempts."
          },
          "Existing or new application integrations being granted unusually high privileges or exhibiting anomalous data access patterns.": {
            "Data": "SaaS/Cloud Audit Logs; Application Access Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Review SaaS/Cloud Audit Logs and Application Access Logs for existing or newly consented applications being granted high-risk permissions (e.g., 'Read all mailboxes', 'Global Administrator'). Analyze usage patterns (e.g., volume, type of data accessed) to identify anomalous activity using time series analysis or entropy measures on access frequency per application."
          },
          "Consent granted to an application integration by a high-privileged account or consent remaining active after the granting account is disabled.": {
            "Data": "SaaS/Cloud Audit Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor SaaS/Cloud Audit Logs for 'Consent to application' events. Identify the account granting consent and its assigned roles/privileges using correlation analysis with account management logs. Prioritize investigation for consents granted by high-privileged accounts. Correlate active application consents with user account status changes (e.g., disabled, deleted accounts); flag consents that remain active post-disabling using joins."
          },
          "Anomalous resource access or data transfer volume from a cloud application integration, particularly if linked to a recently created service principal.": {
            "Data": "SaaS/Cloud Audit Logs; Application Access Logs",
            "Data Platform": "Servers",
            "NAI": "Insert site-specific NAI here",
            "Action": "Monitor Application Access Logs for patterns inconsistent with the application's documented purpose or baseline behavior. Filter access logs by application/service principal ID. Use descriptive statistics (sum, mean, max) on bytes transferred or number of resources accessed. Identify deviations from baseline access patterns using IQR or percentile analysis. Correlate anomalous access with SaaS/Cloud Audit Logs to determine if the application/service principal was recently created."
          }
        }
      },
      "version": "1.1",
      "last_updated": "2025-05-07"
    }
  }
]