[
  {
    "information_requirement": "Is the adversary attempting to disrupt system availability by stopping services? (TA0040 - Impact)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1489",
        "name": "Service Stop",
        "evidence": [
          {
            "description": "A process executes a service control command (e.g., net stop, sc stop, Stop-Service) AND the process hash is on a threat intelligence watchlist, OR the process stops a critical security service (e.g., WinDefend, SysmonSvc, EDR agent) regardless of the process's reputation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All managed endpoints and servers, especially security infrastructure servers hosting AV/EDR management consoles.",
            "action": [
              "Implement a SIEM correlation rule that joins process creation events (Windows Event ID 4688) with a threat intelligence feed of malicious file hashes. Trigger an alert if a matching process executes net.exe, sc.exe, or powershell.exe with arguments containing 'stop' or 'Stop-Service'. Additionally, create a high-severity alert for any service stop event (Windows Event ID 7036) where the Param1 field (service name) is on a pre-defined critical services watchlist (e.g., 'WinDefend', 'SysmonSvc', 'MsSense').",
              "For each parent process name (e.g., powershell.exe, cmd.exe), build a frequency distribution of all command-line arguments observed. Calculate an entropy score for the arguments of each new command execution. A command containing service-stop keywords that also has an unusually high entropy score, such as being in the top 5th percentile, may indicate obfuscation and should be flagged for review.",
              "Deploy a supervised classification model, such as Random Forest or Gradient Boosting, trained on labeled historical process execution data (Event ID 4688). Engineer features including parent process name, user context, command-line parameter structure (argument count, presence of keywords), and target service name (from Event ID 7036). The model should classify each service stop command as benign or malicious, alerting on predictions with a high confidence score."
            ]
          },
          {
            "description": "A single user account or source hostname is responsible for stopping more than 5 distinct services within a 1-minute window across one or more hosts.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All managed endpoints and servers, with a focus on server groups hosting the same application (e.g., web farms, database clusters).",
            "action": [
              "Create a SIEM rule that aggregates service stop events (Windows Event ID 7036) and service stop commands (from Windows Event ID 4688) by the user account and source hostname. Trigger an alert if the count of distinct services stopped by a single user or from a single host exceeds a threshold of 5 within a 60-second sliding window.",
              "For each host, establish an hourly baseline of service stop events (Event ID 7036) using a 30-day moving average and standard deviation. Create a dynamic threshold, such as $$ \\mu + 3\\sigma $$ (mean plus three standard deviations). Trigger an alert if the number of service stop events within a 5-minute interval on a host exceeds this dynamic threshold, indicating a statistically significant spike in activity.",
              "Apply a density-based clustering algorithm, such as DBSCAN, to a dataset of service stop events, using features like timestamp, hostname, and user_account. A dense cluster identified by the algorithm represents a burst of activity concentrated in time and space (across one or a few hosts/users). Flag these automatically identified clusters as anomalous 'mass service stop' events for investigation."
            ]
          },
          {
            "description": "A stop event for a data protection service (e.g., 'VSS', 'SQLWriter', 'wbengine') is followed within 15 minutes on the same host by either: (a) execution of a shadow copy deletion command (e.g., vssadmin delete shadows), (b) a high volume of file modification/deletion events, or (c) a large data egress event.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, database servers, virtualization hosts, backup infrastructure servers, and network egress points (e.g., Internet gateway).",
            "action": [
              "Implement a stateful SIEM correlation rule. Condition 1: A service stop event (Windows Event ID 7036) occurs for a service on the 'Data Protection Services' watchlist (e.g., 'VSS', 'SQLWriter'). Condition 2: Within 15 minutes on the same host, one of the following occurs: (a) a process creation event (Event ID 4688) for vssadmin.exe with 'delete shadows' arguments, OR (b) the count of file modification events (Event ID 4663) exceeds 1000, OR (c) the sum of outbound bytes in Zeek conn.log exceeds 100MB. Trigger a critical alert if both conditions are met.",
              "For each internal host, calculate the 99th percentile of hourly outbound data volume in bytes using Zeek conn.log data from the past 30 days. Separately, monitor for stop events (Event ID 7036) of critical services like 'VSS' or 'SQLWriter'. If such a stop is observed, initiate a heightened monitoring state for that host for the next 30 minutes. Alert if the host's outbound traffic volume in any 5-minute interval during this period exceeds its pre-calculated 99th percentile baseline.",
              "Develop a Hidden Markov Model (HMM) to represent the ransomware attack lifecycle with states such as 'Benign', 'Service_Stop_Defense_Evasion', and 'Impact_Data_Encryption'. Train the model on event sequences from known incidents and benign activity. Feed the real-time stream of security events (Event IDs 7036, 4688, 4663; Zeek logs) for each host into the HMM. Alert when the model transitions to the 'Impact_Data_Encryption' state with high probability immediately following a 'Service_Stop_Defense_Evasion' state."
            ]
          },
          {
            "description": "A service's startup configuration is changed to 'Disabled' (Registry value Start set to 4) or its ImagePath is modified, and the change is initiated by a process not on an approved allowlist (e.g., services.exe, svchost.exe, patch management tools) or occurs outside a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 7040",
              "Windows Event ID 1102"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, critical application servers, and endpoint workstations. The registry key HKLM\\SYSTEM\\CurrentControlSet\\Services\\ is the specific location on these systems.",
            "action": [
              "Create a SIEM rule to detect registry modifications (Windows Event ID 4657) to the 'Start' or 'ImagePath' values under any HKLM\\SYSTEM\\CurrentControlSet\\Services\\* key. Trigger an alert if the initiating process name is not on a pre-defined allowlist of legitimate service management tools. Correlate this alert with any preceding security log clear event (Windows Event ID 1102) from the same host within the last hour to increase severity.",
              "Maintain a multidimensional frequency table of (ProcessName, UserName, TargetService, DayOfWeek, HourOfDay) for all service configuration change events (Event ID 7040 or 4657). For each new event, calculate a rarity score based on the inverse frequency of its tuple in the historical data. Alert on events with a rarity score exceeding the 98th percentile, indicating a highly unusual combination of factors.",
              "Train an autoencoder neural network on historical service configuration change events (Event ID 4657/7040), using features like the initiating process, user account, parent process, target service, and time of day. The model learns to reconstruct normal events with low error. In production, feed new events through the model and flag any event with a high reconstruction error as anomalous, indicating a deviation from established patterns."
            ]
          },
          {
            "description": "The count of unique services entering a 'stopped' state on a single host within a one-hour period exceeds a host-specific baseline, OR a single service (e.g., 'MSExchangeIS') stops concurrently on more than 20% of hosts within a logically-defined asset group.",
            "data_sources": [
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Logically grouped assets such as all Domain Controllers, all Exchange servers, all VDI instances, or all hosts within a specific production subnet.",
            "action": [
              "Define logical asset groups in the SIEM (e.g., 'Domain Controllers', 'Exchange Servers'). Implement a rule that triggers an alert if a single service name (e.g., 'MSExchangeIS') is observed in stop events (Windows Event ID 7036) from more than a specified percentage (e.g., 20%) of the hosts in its corresponding asset group within a 5-minute window.",
              "For each individual host, calculate the hourly count of unique service names that enter a stopped state (from Event ID 7036). Establish a baseline distribution for this count over a 30-day period. Trigger an alert if the current hourly count on a host exceeds its 99th percentile, indicating an abnormally broad service disruption on that machine.",
              "Apply time-series analysis to the enterprise-wide count of service stop events (Event ID 7036) aggregated per minute. Decompose the series into trend, seasonality (daily/weekly patterns), and residual components. Use an anomaly detection algorithm, such as Isolation Forest, on the residual component to identify significant spikes that are not explained by normal operational cycles, which could indicate a widespread, coordinated attack."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]