[
  {
    "information_requirement": "Has the adversary impacted systems or data by defacing internal resources?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1491.001",
        "name": "Internal Defacement",
        "evidence": [
          {
            "description": "Detection of files (e.g., HTML, ASPX, PHP, JS, JPG, PNG) written to internal web servers or endpoints whose SHA256 hash or filename matches known defacement tools, scripts, or imagery signatures from threat intelligence feeds.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Web Servers (e.g., SharePoint, Confluence, Intranet), File Servers, Endpoint Desktops",
            "action": [
              "Create a SIEM rule to continuously scan files written to web server directories (monitored via Windows Event ID 4663 with appropriate SACLs) and files transferred over the network (Zeek files.log) by matching their SHA256 hashes against a threat intelligence feed of known defacement tool, image, or script hashes. Generate an alert upon a match.",
              "For HTTP POST/PUT requests observed in Zeek http.log targeting web servers, calculate the entropy of the transferred file payloads (correlated via the 'fuid' from Zeek files.log). Flag file writes where the entropy is anomalously high (e.g., > 95th percentile of historical entropy for that server/URL path), suggesting packed or obfuscated scripts, or anomalously low, suggesting simple image/text files replacing complex pages.",
              "Develop a content classification model (e.g., Naive Bayes or SVM) trained on known-good corporate web content and known-bad defacement pages (e.g., from public archives). Apply this classifier to the body of HTTP responses in Zeek http.log and to files written to web directories to detect content that is thematically or structurally inconsistent with expected corporate content, flagging potential defacement."
            ]
          },
          {
            "description": "Execution of command-line processes with arguments that directly modify system UI elements (e.g., desktop wallpaper, login banner) or overwrite web server content files (e.g., index.html).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for login messages), All Windows Endpoints and Servers",
            "action": [
              "Create a SIEM rule to alert on process creation events (Windows Event ID 4688) where `reg.exe` modifies the `HKCU\\Control Panel\\Desktop\\Wallpaper` or `HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\LegalNoticeText` registry keys, or where `powershell.exe` (via PowerShell Event ID 4104 script block logging) uses `Set-ItemProperty` for the same keys. Also, flag command lines containing `copy`, `move`, or `echo` that overwrite common web root files like `index.html` or `default.aspx`.",
              "For each host, establish a baseline of parent-child process relationships using Windows Event ID 4688. Monitor for anomalous process chains where a common user process (e.g., WINWORD.EXE, OUTLOOK.EXE) spawns a shell (cmd.exe, powershell.exe) which then executes a file copy or registry modification command targeting UI elements. Flag parent-child relationships that are statistically rare (e.g., occurring for the first time or falling below a 1% frequency threshold in the environment).",
              "Utilize a command-line analysis model (e.g., a logistic regression or decision tree classifier) to score the maliciousness of all shell commands captured in Windows Event ID 4688 and 4104. The model should be trained on features like command length, presence of specific keywords (`copy`, `reg add`, `Set-ItemProperty`), file paths (`C:\\inetpub\\wwwroot`), and obfuscation patterns. A high score triggers an alert."
            ]
          },
          {
            "description": "An anomalous volume, timing, or source of file modifications on internal web servers, or unusual HTTP methods used to upload content, when compared against a historical baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Web Server file systems (e.g., C:\\inetpub\\wwwroot), Network traffic segments leading to internal web servers",
            "action": [
              "Define a watchlist of critical web content files (e.g., `index.html`, `login.aspx`, `web.config`). Create a rule that triggers an immediate alert when a file modification event (Windows Event ID 4663) is logged for any file on this list originating from a process other than an approved deployment or content management service account/process.",
              "For each internal web server, create a time-series baseline of file modifications (from Windows Event ID 4663) and HTTP requests (from Zeek http.log), aggregated per hour. Alert when the volume of modifications or POST/PUT requests exceeds a dynamic threshold, such as 3 standard deviations above the moving average for that hour of the day and day of the week. Additionally, use frequency analysis to flag modifications from source IPs or user accounts not in the top 95% of historical content modifiers.",
              "Employ an anomaly detection model like an Isolation Forest or One-Class SVM trained on features from normal web update activity. Features should include source IP, user agent (from Zeek http.log), file extension, file size (from Zeek files.log), process name (from Windows Event ID 4663), and HTTP method. The model will identify and alert on any activity that falls outside the learned boundary of normal behavior, indicating a potential defacement attempt."
            ]
          },
          {
            "description": "Observation of a multi-stage behavioral sequence where a process writes a file (e.g., image, web shell) which is then used in a subsequent command to alter a system's visual interface or web content.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers (e.g., Citrix), Internal web and application servers",
            "action": [
              "Create a correlation rule that triggers when, within a 60-second window on the same host: 1) A file with an image or web extension (.jpg, .png, .aspx, .php) is created (Windows Event ID 4663) by a non-approved process. 2) A process is created (Windows Event ID 4688) with a command line that references the new file's path and either modifies a UI registry key or overwrites a file in a web root directory.",
              "Calculate the prevalence of specific three-event sequences (e.g., network download via Zeek -> file write via 4663 -> registry modify via 4688) across the enterprise. Use a statistical measure like Pointwise Mutual Information (PMI) to score the strength of association between these event types originating from the same host. A sequence with an unusually high PMI score, especially if it's rare overall, indicates a strong, non-random behavioral pattern that warrants investigation.",
              "Use a sequence analysis model, such as a Long Short-Term Memory (LSTM) network, trained on streams of host events (process creation, file modification, registry access). Train the model to predict the 'next' event in a sequence. An alert is generated when the model observes a sequence associated with defacement (e.g., `powershell.exe` -> `file.write(.jpg)` -> `reg.exe modify wallpaper`) that it has learned is a high-risk pattern, or when it encounters a sequence with a very high prediction error, indicating novel behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]