[
  {
    "information_requirement": "Is the adversary maintaining persistence through a malicious Microsoft Exchange Transport Agent?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.002",
        "name": "Transport Agent",
        "evidence": [
          {
            "description": "A new DLL file is created in a Microsoft Exchange Server transport agent directory, and the file's hash is either present on a threat intelligence feed or is statistically rare within the enterprise.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of Microsoft Exchange Servers, specifically the transport agent directories (e.g., %ExchangeInstallPath%TransportRoles\\agents\\).",
            "action": [
              "Create a detection rule to monitor for file creation events (Sysmon Event ID 11) in Exchange transport agent directories. For each new DLL, calculate its hash and query against a threat intelligence database of known malicious file hashes. Generate a high-severity alert on any match.",
              "For all new DLLs created in transport agent directories, calculate the prevalence of each file hash across the enterprise over a 30-day window. Flag hashes that are statistically rare (e.g., seen only on a single host) for manual review, as this may indicate custom or targeted malware.",
              "Deploy a pre-trained machine learning model that classifies PE files based on static properties (e.g., sections, imports, entropy, packer identification). For each new DLL created, analyze the file and alert if the model classifies it as malicious with a high confidence score (e.g., > 0.90). This detects novel malware without a known signature."
            ]
          },
          {
            "description": "Execution of the 'Install-TransportAgent' PowerShell cmdlet is observed, or a new registry key is created or modified under the Exchange Server's transport agent configuration path, indicating new agent registration.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 13",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers (Command-line interface, PowerShell script block logs, and Windows Registry); Domain Controller Security Logs.",
            "action": [
              "Create a high-severity alert that triggers upon detection of the string 'Install-TransportAgent' in PowerShell Script Block Logs (Windows Event ID 4104) or command-line process creation logs (Windows Event ID 4688). Additionally, alert on any registry key creation or modification (Sysmon Event ID 13) under the path `HKLM\\SOFTWARE\\Microsoft\\ExchangeServer\\v15\\TransportRoles\\agents\\`.",
              "For every 'Install-TransportAgent' execution captured in logs, calculate the Shannon entropy of the string values provided to the `-AssemblyPath` and `-Name` parameters. Establish a baseline for normal entropy scores. Alert when a new execution's entropy score exceeds a defined threshold (e.g., $$ H(X) > 4.0 $$), indicating a high degree of randomness often used to evade signature-based detection.",
              "Train a logistic regression model to produce a risk score for each 'Install-TransportAgent' execution. Use features such as: parent process name, user account context, time of day (e.g., outside business hours), entropy of agent name/path, and whether the DLL path points to a non-standard directory. An execution with a high probability score (e.g., > 0.85) should trigger an alert for analyst review."
            ]
          },
          {
            "description": "The 'edgetransport.exe' process writes a file with a high-risk extension (e.g., .exe, .ps1, .zip) to a non-standard file system directory, such as C:\\Temp, user profiles, or a web-accessible path, potentially indicating data staging or payload dropping.",
            "data_sources": [
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on Microsoft Exchange Servers, focusing on non-standard temporary directories (C:\\Temp, C:\\Windows\\Temp), user profile directories, and internet-accessible web server directories.",
            "action": [
              "Implement a detection rule to alert on any file creation event (Sysmon Event ID 11) where the source process is `edgetransport.exe` AND the target file path is outside a predefined allow-list of known-good Exchange directories OR the target file extension is on a block-list of high-risk types (e.g., .exe, .ps1, .bat, .zip, .rar).",
              "For all file write events by `edgetransport.exe`, establish a baseline of normal file path locations and file extensions. Calculate the frequency of each (path, extension) pair observed over a 30-day period. Alert on any new event whose pair falls into a low-frequency percentile (e.g., bottom 1st percentile), indicating a deviation from normal process behavior.",
              "Utilize an unsupervised learning algorithm like Isolation Forest on file creation events from `edgetransport.exe`. Ingest features such as file path depth, file extension, entropy of the filename, and time of day. The model will assign an anomaly score to each event, and events exceeding a dynamically tuned threshold will be flagged as outliers representing significant deviations from normal file write activity."
            ]
          },
          {
            "description": "An outbound network connection from an Exchange transport process, such as 'edgetransport.exe', communicates with a destination that is either on a threat intelligence feed or exhibits anomalous characteristics in terms of port, protocol, or data volume.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies) monitoring traffic from the Exchange server DMZ; Network sensor logs on Microsoft Exchange Servers.",
            "action": [
              "Continuously correlate destination IP addresses from network connection logs (Zeek conn.log, Sysmon Event ID 3) and resolved domains from DNS logs (Zeek dns.log) originating from `edgetransport.exe` against a threat intelligence feed of known malicious C2 servers or suspicious domains. Generate a high-severity alert on any match.",
              "For each Exchange server, create a statistical baseline of outbound connections from `edgetransport.exe`. For each destination port, track the mean ($$ \\mu $$) and standard deviation ($$ \\sigma $$) of bytes sent (`orig_bytes`) and connection duration. Alert when a new connection's metrics exceed a threshold, such as $$ value > \\mu + 3\\sigma $$, or fall in the 99th percentile for a given attribute.",
              "Implement a DBSCAN clustering algorithm on network connection features (destination port, protocol, data volume, JA3/JA3s hash) for traffic from `edgetransport.exe`. The model will group connections into clusters of normal behavior. Any connection identified as noise or belonging to a very small, sparse cluster should be flagged as an anomaly for investigation. This can detect novel C2 channels that do not match known signatures."
            ]
          },
          {
            "description": "A measurable anomaly in email flow metrics is observed, such as a drop in received mail for a specific user, an increase in outbound mail containing encrypted attachments, or emails with abnormally high subject line entropy, suggesting interception, modification, or exfiltration.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at the Mail Transfer Agent (MTA) layer; Network egress points capturing SMTP traffic.",
            "action": [
              "Create a detection rule to alert when an outbound email (from `Zeek smtp.log`) contains an attachment identified in `Zeek files.log` with a file magic number corresponding to an encrypted archive (e.g., 'application/x-7z-compressed', 'application/zip') AND the destination domain is not on an approved list of business partners.",
              "For each user, establish a baseline of outbound email activity, including average daily volume and the frequency distribution of attachment MIME types (`file_mime_type` in `files.log` correlated with `smtp.log`). Alert if a user's daily outbound volume exceeds the 98th percentile of their historical distribution or if they send an attachment with a MIME type they have never sent before.",
              "Apply a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the inbound email count per hour for high-value mailboxes. An alert is triggered if the count drops into a trough that is statistically significant and flagged as an anomaly by the model, which could indicate a malicious transport agent is silently deleting or redirecting incoming mail before delivery."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]