[
  {
    "information_requirement": "Is the adversary maintaining persistence on web servers using malicious IIS components? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.004",
        "name": "IIS Components",
        "evidence": [
          {
            "description": "The IIS worker process (w3wp.exe) initiates an outbound network connection to a destination IP address or domain with a known malicious reputation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 3 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IIS Web Servers, DMZ Network Segment, Network Egress Points, DNS Resolvers",
            "action": [
              "Symbolic: Correlate process-specific network connection events (Sysmon Event ID 3) with network flow data (Zeek conn.log) to attribute connections to 'w3wp.exe'. Cross-reference the destination IP address and any associated DNS query (Zeek dns.log) against a high-confidence threat intelligence feed of known C2 servers or malicious domains. Generate a high-severity alert on any match.",
              "Statistical: For each IIS server, calculate the entropy of requested fully-qualified domain names (FQDNs) over a 1-hour rolling window. A sudden, sharp increase in entropy can indicate Domain Generation Algorithm (DGA) activity. Alert when the entropy score for w3wp.exe traffic exceeds the 99th percentile of its historical baseline.",
              "Machine Learning: Train a time-series forecasting model (e.g., Prophet or ARIMA) on the volume of outbound connections per hour from 'w3wp.exe' to destinations not associated with legitimate application functions. Alert when the observed connection count significantly exceeds the model's predicted upper confidence interval, indicating an anomalous spike in external communication."
            ]
          },
          {
            "description": "The execution of AppCmd.exe or PowerShell IIS cmdlets with arguments indicating the installation, registration, or modification of an IIS module, handler, or ISAPI filter.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows PowerShell Event ID 4104",
              "Windows PowerShell Event ID 800"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IIS Web Servers, Administrator Workstations, Jump Servers",
            "action": [
              "Symbolic: Create a detection rule that searches process command-line logs (Sysmon Event ID 1) for `AppCmd.exe` executions containing case-insensitive strings such as 'install module', 'add module', 'set config', 'unlock section', 'globalModules', or 'add name='. Similarly, search PowerShell logs (Event ID 4104, 800) for cmdlets like 'New-IISModule', 'Set-WebConfigurationProperty', or 'Add-WebConfiguration' targeting module configurations.",
              "Statistical: For each host, establish a baseline frequency of `AppCmd.exe` and IIS-related PowerShell cmdlet executions. Calculate the mean and standard deviation of these command executions per user account. Flag any user whose execution count for these specific commands in a 24-hour period exceeds 3 standard deviations from their own or a peer group's baseline, especially if executed outside of business hours.",
              "Machine Learning: Use a pre-trained or custom-trained classification model (e.g., a transformer-based model on command lines) to score the maliciousness of command-line arguments. Train the model on public repositories of malicious commands and known-good administrative scripts. A high maliciousness score for an IIS-related command execution should generate a medium-severity alert for analyst investigation."
            ]
          },
          {
            "description": "A new DLL file is created in a sensitive IIS directory, or the primary IIS configuration file (applicationhost.config) is modified to add or alter a module registration by an unauthorized process or at an anomalous time.",
            "data_sources": [
              "Windows Event ID 11 (Sysmon)",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4663",
              "File Integrity Monitoring (FIM) Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of IIS Web Servers, specifically the directories '%windir%\\System32\\inetsrv\\', '%windir%\\assembly\\', application-specific 'bin' folders, and the '%windir%\\System32\\inetsrv\\config\\' directory.",
            "action": [
              "Symbolic: Alert on file creation events (Sysmon Event ID 11) where a new DLL is written to `%windir%\\System32\\inetsrv\\` or a web application's `bin` directory by a process not on a trusted installer allow list (e.g., `msiexec.exe`, `trustedinstaller.exe`). Also, use a FIM tool to alert on any change to `%windir%\\System32\\inetsrv\\config\\applicationhost.config` that adds or modifies a `<modules>` or `<globalModules>` section outside of a designated change window.",
              "Statistical: Profile the set of processes that normally write files to IIS-related directories. Create a frequency table of parent processes and the created file extensions. Alert when a rare process (e.g., `w3wp.exe`, `cmd.exe`, `powershell.exe`) writes a DLL file, as this represents a statistically improbable event based on historical data.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on file modification events affecting IIS directories. Features should include the process name, user context, target file path, file extension, and time of day. Clusters of events that are distant from the large, dense clusters of 'normal' administrative activity can be flagged as anomalous."
            ]
          },
          {
            "description": "The IIS worker process (w3wp.exe) spawns a child process that is not part of a pre-defined allow list of expected helper applications.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution environment on all IIS Web Servers.",
            "action": [
              "Symbolic: Create a high-priority alert that triggers whenever a process creation event (Sysmon Event ID 1) has `w3wp.exe` as the ParentImage and the Image is a command shell (`cmd.exe`, `powershell.exe`), a scripting engine (`cscript.exe`, `wscript.exe`), a network utility (`net.exe`, `ipconfig.exe`), or a reconnaissance tool (`whoami.exe`, `quser.exe`).",
              "Statistical: For each IIS server, build a historical baseline of all child processes spawned by `w3wp.exe`. Calculate the rarity of each child process name across the fleet of servers. Alert when a child process is spawned that has either never been seen before in the environment or is in the bottom 5th percentile of frequency, indicating it is highly unusual.",
              "Machine Learning: Employ a sequence analysis model (e.g., a Hidden Markov Model or LSTM) to learn normal sequences of process executions that follow a web request handled by `w3wp.exe`. A malicious IIS module spawning a child process will create a process execution sequence (e.g., w3wp.exe -> cmd.exe -> whoami.exe) that deviates significantly from learned normal patterns, allowing the model to flag it as an anomaly."
            ]
          },
          {
            "description": "An outbound network connection from an IIS worker process (w3wp.exe) exhibits characteristics that deviate significantly from a behavioral baseline, such as an unusual destination port, data volume, or connection periodicity.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Windows Event ID 3 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Network Segment, Network Egress Points, IIS Web Servers",
            "action": [
              "Symbolic: Alert when the IIS worker process (`w3wp.exe`), identified via Sysmon Event ID 3, initiates an outbound connection (Zeek conn.log) to a non-standard port (e.g., any port not in the approved set {80, 443, 53, 1433}) or to a raw IP address that did not have a preceding DNS query from the same host within the last hour.",
              "Statistical: For each server's `w3wp.exe` process, model the distribution of outbound connection durations and total bytes transferred. Use the Inter-Quartile Range (IQR) method to identify outliers. A connection whose byte count is greater than $$ Q3 + 1.5 \\times IQR $$ should be flagged for review. Separately, monitor for beaconing by calculating the variance of inter-arrival times for connections to the same destination; low variance indicates periodic C2 activity.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means) on network connection features (destination port, protocol, bytes out, connection duration, destination ASN, JA3/JA3S hash) from `w3wp.exe`. A new, small cluster forming with unusual characteristics (e.g., long-lived connections on a high port to a residential ISP ASN) can indicate the emergence of a C2 channel."
            ]
          },
          {
            "description": "The IIS worker process (w3wp.exe) loads a DLL module that is unsigned, has a low prevalence across the environment, or was recently created on the file system.",
            "data_sources": [
              "Windows Event ID 7 (Sysmon)",
              "Windows Event ID 11 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process memory space and file system of all IIS Web Servers.",
            "action": [
              "Symbolic: Create a detection rule for Image Load events (Sysmon Event ID 7) where the process is `w3wp.exe`, the `Signed` field is 'false', and the `SignatureStatus` is not 'Valid'. Exclude known-good, internally developed unsigned DLLs. Further, alert if the loaded DLL's path is an unusual location like `C:\\Temp\\`, `C:\\Windows\\Temp\\`, or a user's AppData folder.",
              "Statistical: Maintain a stack-ranked list of all DLLs (by SHA256 hash) loaded by `w3wp.exe` across all IIS servers. Flag any DLL that is in the bottom 5% of prevalence. Correlate the load event time (Sysmon Event ID 7) with the file creation time (Sysmon Event ID 11) for that DLL. A load event occurring within 24 hours of file creation is highly suspicious and should be alerted on.",
              "Machine Learning: Train a classification model (e.g., Gradient Boosting) on DLL image load events. Use features such as: IsSigned (boolean), Signer Name (categorical), file path entropy, DLL name entropy, prevalence score (from statistical method), and the Imphash of the DLL. The model will output a probability score that the loaded module is malicious, allowing for tiered alerting."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]