[
  {
    "information_requirement": "Is the adversary attempting to impact system availability or recovery using shutdown/reboot?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1529",
        "name": "System Shutdown-Reboot",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688 or Sysmon Event ID 1) where the new process's file hash matches a known malicious binary associated with impact tactics (e.g., wiper, ransomware) and the command line explicitly initiates a system shutdown (e.g., contains 'shutdown /s' or 'shutdown /r').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical infrastructure servers (Domain Controllers, Database Servers), application servers, and general user endpoints.",
            "action": [
              "Create a real-time rule to scan process creation events (Windows Event ID 4688, Sysmon Event ID 1). Alert if the process's file hash (SHA256, MD5) is present in a threat intelligence feed of known impact-related malware AND the command line arguments contain 'shutdown' with '/s', '/r', or '/g'.",
              "For processes that initiate a shutdown command, calculate the Shannon entropy of the process name. Compare this to a historical baseline of entropy scores for all executables that have previously initiated shutdowns. Alert if the entropy score is in the top 5% (e.g., > 95th percentile), indicating a likely randomized or packed malware executable name.",
              "Train a classification model (e.g., XGBoost, Random Forest) using features from process creation events, including: parent process name, parent process path, user context, command-line arguments, process name entropy, and file path location. Use the model to classify any process initiating a shutdown as either 'benign' or 'malicious'. Alert on 'malicious' classifications with a confidence score above 0.85."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688 or Sysmon Event ID 1) for `shutdown.exe`, `Restart-Computer`, or `Stop-Computer` where the parent process is a scripting interpreter (e.g., `powershell.exe`, `cmd.exe`, `wscript.exe`) and the command line includes parameters for immediate (`/t 0`), forced (`/f`), or unprompted (`-Force`) execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows PowerShell Logging Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, with heightened scrutiny on administrative jump boxes and domain controllers.",
            "action": [
              "Create a rule to alert when a process creation event shows `shutdown.exe` spawned by `powershell.exe`, `cmd.exe`, or `wscript.exe` with command-line arguments containing '/f' or '/t' with a value less than 60. Also, monitor PowerShell Script Block logs (Event ID 4104) for `Restart-Computer -Force` or `Stop-Computer -Force`.",
              "Establish a baseline of command-line argument combinations for `shutdown.exe` and `Restart-Computer`/`Stop-Computer` across the enterprise. Calculate the frequency of each observed combination. Alert when a rare combination is used (e.g., a combination seen in < 1% of historical executions), especially if it includes a shutdown comment (`/c`) or is initiated by a non-administrative user.",
              "Use a clustering algorithm (e.g., DBSCAN) on vectorized command-line arguments from all observed shutdown commands. Features for vectorization should include presence of flags (`/f`, `/r`, `/t`, `-Force`), the value of the time parameter, and the presence/length of the comment field. Alert on any shutdown command that is classified as a noise point or outlier, indicating it does not belong to established clusters of normal administrative behavior."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688 or Sysmon Event ID 1) for a remote administration tool (e.g., `psexec.exe`, `wmic.exe`, `Enter-PSSession`, `Invoke-Command`) whose command line targets a remote system with a shutdown command, correlated with a corresponding network connection (Zeek conn.log) to that target on a management port (e.g., TCP/445, TCP/5985, TCP/5986).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Windows PowerShell Logging Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrative Workstations, Jump Servers, Management Network Segments, and Domain Controllers.",
            "action": [
              "Alert when a process creation event for `wmic.exe` contains the arguments `node:` and `os call shutdown`, OR a PowerShell log (Event ID 4104) shows `Invoke-Command` or `Enter-PSSession` executing `Restart-Computer`/`Stop-Computer` on a remote machine, AND the source host is not a designated administrative server or part of a pre-approved automation source list.",
              "For each administrator account, build a statistical profile of their remote reboot activity, including the average and standard deviation of systems rebooted per hour. Alert if an account's reboot activity exceeds a dynamic threshold (e.g., 3 standard deviations above their personal mean, or a sharp increase in the number of unique target systems).",
              "Construct a directed graph where nodes are hosts and users, and edges represent remote administration commands (e.g., user -> source_host -> command -> target_host). Use a graph-based anomaly detection algorithm (e.g., Community Detection) to find normal administrative patterns. Alert on new edges that bridge disparate communities (e.g., a user from the marketing department issuing a shutdown to a domain controller) or have a high anomaly score."
            ]
          },
          {
            "description": "A successful remote logon (Windows Event ID 4624, Logon Type 3 or 10) is followed within a short time window (e.g., under 2 minutes) by a system shutdown initiation event (Windows Event ID 1074) on the same host, attributed to the same Logon ID.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 1074"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-value assets such as Domain Controllers, Database Servers, Certificate Authorities, and critical application servers.",
            "action": [
              "Implement a stateful rule that triggers on a successful remote logon event (Windows Event ID 4624 with Logon Type 3 or 10). If a system shutdown event (Windows Event ID 1074) is recorded on the same host with a matching Logon ID within a 5-minute window, generate an alert.",
              "For each user account, calculate the historical distribution of their remote logon session durations. Alert if a session immediately preceding a shutdown event (Event ID 1074) has a duration that is a statistical outlier (e.g., falls in the bottom 5th percentile of that user's typical session durations), indicating a potential automated 'login-and-shutdown' script.",
              "Use a sequence analysis model, such as a Long Short-Term Memory (LSTM) network, trained on sequences of security events per user session. The model learns normal event sequences (e.g., logon -> file access -> process execution -> logoff). Alert if the model observes a high-probability transition directly from 'Remote Logon' to 'System Shutdown', as this would be an anomalous sequence for most legitimate user behavior."
            ]
          },
          {
            "description": "A statistically anomalous number of system shutdown events (Windows Event ID 1074 for initiated, or Windows Event ID 6006 for unexpected) across multiple distinct hosts within a short time window (e.g., 10 minutes), where the activity is not correlated with a known, scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6006"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The entire enterprise network, logically segmented by asset groups (e.g., Workstations, VDI, Web Servers, Database Servers) for more granular analysis.",
            "action": [
              "Create a scheduled query to run every 5 minutes, counting the distinct hosts reporting Event ID 1074 or 6006 in the last 15 minutes. Alert if this count exceeds a static threshold (e.g., >2% of total assets in a group) AND the current time is outside a predefined maintenance calendar.",
              "For each asset group, establish an hourly baseline of shutdown/reboot events. Use a Z-score or modified Z-score on a 15-minute sliding window to detect outliers in the event count. Alert if the number of shutdowns in a given window is more than 4 standard deviations above the mean for that specific time of day and day of the week.",
              "Apply a multivariate time-series anomaly detection model (e.g., VAR-based or LSTM autoencoder) to the stream of shutdown event counts from multiple asset groups simultaneously. This model can learn inter-group correlations (e.g., workstation reboots often happen together, but workstation and DC reboots are independent). Alert when a spike in reboots is flagged as an anomaly that violates these learned patterns."
            ]
          },
          {
            "description": "A sudden, statistically significant drop in the volume of network flow data (e.g., total bytes, connection counts, unique source IPs) from one or more critical network subnets, as observed in network flow data (Zeek conn.log), indicating a mass system outage or network isolation.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Choke Points (Core Switches, Subnet Aggregation Points, Internet Gateway, VPN Concentrators).",
            "action": [
              "For each critical subnet (e.g., DC subnet, database server subnet), create a rule that alerts if the count of active connections in `conn.log` drops by more than 90% in a 5-minute window compared to the average of the previous hour.",
              "For each monitored network segment, calculate a rolling 30-day baseline of key traffic metrics (bytes_in, bytes_out, connection_count) per minute, bucketed by time of day. Alert if the current traffic volume for a segment drops below the 1st percentile of its historical distribution for that specific time.",
              "Implement a time-series forecasting model (e.g., Prophet, which handles seasonality well) for each critical network segment's traffic volume. The model will predict the expected traffic volume with confidence intervals (e.g., 99% confidence). Alert if the observed traffic volume falls below the lower bound of the model's prediction for a sustained period (e.g., > 3 consecutive 1-minute intervals)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]