[
  {
    "information_requirement": "Is an adversary leveraging a compromised internal account for lateral movement via internal spearphishing? (TA0008 - Lateral Movement) (PIR)",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1534",
        "name": "Internal Spearphishing",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to a destination on a threat intelligence blocklist (IP, domain) or a file transfer containing a known malicious hash, where the process initiating the connection is a mail client or collaboration tool.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal DNS Resolvers, User Endpoints, Web Proxies",
            "action": [
              "Join network connection logs (Zeek conn.log destination IPs) and DNS query logs (Zeek dns.log query names) with threat intelligence feeds of known malicious indicators. Generate an alert on any match where the source IP is from the internal network space.",
              "For all DNS queries (Zeek dns.log), calculate the enterprise-wide frequency of each FQDN over the last 90 days. Enrich domain data with registration dates via WHOIS. Flag internal hosts initiating connections to domains that are both rarely requested (e.g., bottom 5th percentile of popularity) and newly registered (e.g., less than 30 days old).",
              "Deploy a pre-trained supervised classification model (e.g., Gradient Boosting) that uses features from network logs (destination port, protocol, data volume, domain entropy, TLS JA3 hash) to score each outbound connection's probability of being malicious. Generate an alert when a connection initiated by an email or chat client (e.g., OUTLOOK.EXE, MSTEAMS.EXE) exceeds a high-confidence probability threshold."
            ]
          },
          {
            "description": "An email client, web browser, or office productivity application (e.g., OUTLOOK.EXE, CHROME.EXE, WINWORD.EXE) spawns a script interpreter or shell process (e.g., powershell.exe, cmd.exe, wscript.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Virtual Desktop Infrastructure (VDI), Application Servers",
            "action": [
              "Implement a detection rule that alerts when a parent process from the list [OUTLOOK.EXE, WINWORD.EXE, EXCEL.EXE, POWERPNT.EXE, MSTEAMS.EXE] spawns a direct child process from the list [powershell.exe, cmd.exe, wscript.exe, cscript.exe, mshta.exe, rundll32.exe].",
              "From process creation logs (Windows Event ID 4688), extract and calculate the Shannon entropy of the command-line arguments. Establish a baseline entropy score for common processes. Alert when a script interpreter spawned by an office application has a command-line entropy score that is a significant outlier (e.g., > 3 standard deviations above its baseline or a fixed threshold of 4.5).",
              "Utilize a trained classification model (e.g., Random Forest) to analyze process creation events. The model should use features like parent process name, child process name, command-line length, command-line entropy, and user context. Use the model's output (a 'benign' or 'suspicious' classification) to trigger alerts on high-confidence 'suspicious' events originating from office or collaboration applications."
            ]
          },
          {
            "description": "An internal-to-internal email contains one or more of the following: a mismatch between the 'From' and 'Reply-To' headers; a URL from a known URL shortening service; or a file attachment with a high-risk extension (.iso, .lnk, .html, .vhd).",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Transfer Agents, Network Segments with Email Servers",
            "action": [
              "From SMTP logs (Zeek smtp.log), create a detection rule to flag any internal-to-internal email where the 'from' header domain and the 'reply-to' header domain do not match. Also, scan email metadata for links containing domains from a maintained list of URL shortening services.",
              "Analyze SMTP and file transfer logs (Zeek smtp.log, files.log) to build a frequency distribution of file attachment MIME types for internal-to-internal emails over a 30-day baseline period. Generate an alert when an email contains an attachment type that falls in a low percentile of frequency (e.g., bottom 1st percentile), such as 'application/x-iso9660-image', 'application/x-ms-shortcut', or 'text/html'.",
              "Implement a logistic regression model to assign a risk score to each internal email. Use features from SMTP logs (e.g., header mismatches, URL count, subject line length, presence of attachments) and graph-based features (e.g., rarity of sender-recipient pair). Flag emails with a model-predicted probability of being malicious above a defined threshold."
            ]
          },
          {
            "description": "A sequence of events occurs on a single host within a short time window: 1) A DNS query to a low-reputation domain. 2) A suspicious process is created by an office application. 3) The new process initiates an outbound network connection or attempts to access a network share.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, File Servers, Network Egress Points, DNS Resolvers",
            "action": [
              "Create a stateful correlation rule that triggers when the following sequence occurs for a single host within a 5-minute window: 1. A DNS query for a non-categorized or newly registered domain (Zeek dns.log). 2. A suspicious process creation, such as WINWORD.EXE spawning powershell.exe (Windows Event ID 4688). 3. An access attempt to a network share (Windows Event ID 5145).",
              "For each user, create a baseline profile of normally accessed network shares and access frequency using Windows Event ID 5145 logs over 90 days. Following a potential phishing click (e.g., connection to a low-reputation domain from Zeek logs), flag any subsequent access to a network share that is statistically rare for that user (e.g., a share they have never accessed).",
              "Employ a sequence mining model (e.g., Hidden Markov Model or LSTM) trained on aggregated host event logs (DNS, process, network, file access). The model learns normal temporal sequences of user activity. Alert when the model detects a sequence with a low probability of occurring, particularly sequences matching the pattern of [email client -> DNS query -> process spawn -> network connection]."
            ]
          },
          {
            "description": "An internal user account sends a number of emails to other internal users that is a statistical anomaly compared to its established baseline, where the emails share highly similar subject lines.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Transfer Agents, Network Segments with Email Servers",
            "action": [
              "Create a rule that triggers if a single internal source IP sends emails to more than 100 unique internal recipients within a 1-hour window where the subject line is identical.",
              "For each internal sender, calculate a 30-day rolling baseline (mean and standard deviation) for (a) emails sent per hour and (b) unique recipients per hour, using Zeek smtp.log. Alert when a sender exceeds 3 standard deviations above their established mean for both metrics in the same hour.",
              "On an hourly basis, ingest internal email metadata from Zeek smtp.log. Use a clustering algorithm like DBSCAN on feature vectors derived from subject lines (e.g., TF-IDF). A large, dense cluster of emails from a single sender, which is anomalous compared to that sender's historical clustering patterns, indicates a potential automated campaign."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]