[
  {
    "information_requirement": "Has an unauthorized entity accessed or queried process state data from key ICS components? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0801",
        "name": "Monitor Process State",
        "evidence": [
          {
            "description": "Specific ICS protocol read requests (e.g., Modbus Function Code 0x03/0x04, DNP3 Function Code 0x01/0x02, OPC Read/Browse) to Data Historians or PLCs originating from an IP address or user account not on a predefined whitelist, or an existing source exhibiting a statistically significant increase in query volume or data transfer size over a 24-hour period.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log",
              "Windows Event ID 4663",
              "Windows Event ID 4690"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data Historian servers (Level 3), Process Control Network (PCN) gateways (Level 3/2), PLC subnets (Level 1/2), HMI/EWS subnets (Level 2.5/2), DMZ between IT and OT networks.",
            "action": "1. **Symbolic Logic:** Create and maintain a whitelist of authorized source IPs and user accounts permitted to query Data Historians and PLCs on common ICS ports (e.g., Modbus 502, DNP3 20000, OPC-UA 4840, Siemens S7 102). Alert on any `Zeek conn.log`, `Zeek modbus.log`, `Zeek dnp3.log`, or `Zeek opc.log` entry showing a connection from a non-whitelisted IP to an ICS asset on these ports. Additionally, correlate with `Windows Event ID 4663` (Object Access) for any access to historian database files or specific ICS application logs from non-whitelisted users or processes. 2. **Statistical Method:** For whitelisted sources, establish a 30-day baseline for the daily count of unique process variable read requests and total data transfer volume from `Zeek modbus.log`, `dnp3.log`, or `Zeek opc.log` (or parsed from `conn.log` for specific port/protocol signatures). Calculate the 99th percentile for these metrics. Trigger an alert if any source IP or user exceeds its established 99th percentile for unique read requests or data volume within a 1-hour rolling window, indicating excessive data collection. 3. **Machine Learning:** Implement a time-series anomaly detection model (e.g., Isolation Forest, Prophet) on the rate of ICS protocol read requests (e.g., `Zeek modbus.log` function codes, `Zeek opc.log` read requests) from individual source IPs to specific ICS devices. Train the model on 60 days of historical data. Flag significant deviations from predicted normal behavior (e.g., a sudden, sustained increase in read request frequency from a specific EWS to a PLC that has no operational justification) as potential process state monitoring."
          },
          {
            "description": "A single source IP address, particularly an HMI or EWS, initiates network connections on ICS-specific ports to a number of unique destination ICS devices (e.g., PLCs, RTUs, IEDs) within a 15-minute window that exceeds its historical communication breadth, or communicates with devices entirely outside its established operational zone.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) (Level 2), HMI systems (Level 2), Level 2/3 network boundary devices, PLC/RTU subnets (Level 1/2), ICS application servers (Level 2.5).",
            "action": "1. **Symbolic Logic:** Maintain a dynamic whitelist of known, authorized peer-to-peer communication relationships between ICS hosts (EWS, HMI, PLCs) and specific ICS ports using `Zeek conn.log`. Alert when a source IP initiates a connection to an ICS device on an ICS port (e.g., 502, 20000, 4840) that is not part of its established communication whitelist. Correlate with `Windows Event ID 4688` (Process Creation) for any new or unusual process execution on the source host immediately prior to the anomalous connection. 2. **Statistical Method:** For each unique source IP in `Zeek conn.log`, calculate the number of unique destination IPs and unique destination ICS ports (e.g., 502, 20000, 4840) contacted within a rolling 10-minute window. Establish a 30-day baseline for these counts for each source IP. Trigger an alert if the current count of unique destinations or unique ports for a source exceeds its 99th percentile, indicating a sudden expansion of network interaction potentially for discovery. 3. **Machine Learning:** Apply a clustering algorithm (e.g., K-Means, DBSCAN) to `Zeek conn.log` and ICS protocol-specific logs (`Zeek modbus.log`, `Zeek dnp3.log`) data. Use features such as source IP, destination IP, destination port, and ICS function codes to group hosts by their typical communication profiles. Flag a host if its communication pattern significantly deviates from its assigned cluster (e.g., a host suddenly communicating with devices across multiple clusters it typically doesn't interact with), suggesting a change in behavior indicative of reconnaissance or widespread process data collection."
          },
          {
            "description": "A successful remote interactive login (RDP, SSH, console) to a critical ICS host (HMI, EWS, Data Historian) from an unapproved geographic location, outside normal business hours, or using a previously unused account, immediately followed (within 5 minutes) by outbound ICS protocol communication (e.g., Modbus, DNP3, OPC-UA) from that host to Level 1/2 ICS devices.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs) (Level 2), Engineering Workstations (EWS) (Level 2), ICS Application Servers (Level 2.5), Jump Servers (Level 3/2.5), Active Directory Domain Controllers (Level 3).",
            "action": "1. **Symbolic Logic:** Establish a whitelist of authorized source IPs, user accounts, and typical logon times for remote interactive logons (Windows Event ID 4624, Logon Type 10 for RDP, 7 for Unlock, or 2 for Interactive Console; `Zeek rdp.log` for RDP activity) to critical ICS hosts. Alert on any remote logon from a non-whitelisted source IP, an unrecognized user account, or outside of defined operational hours. Immediately after such an alert, check `Zeek conn.log` and protocol-specific logs (e.g., `modbus.log`, `dnp3.log`, `opc.log`) for any outbound connections from the affected ICS host to Level 1/2 devices on ICS ports within a 5-minute window. 2. **Statistical Method:** For each critical ICS host, baseline the frequency and duration of remote interactive logon sessions (Windows Event ID 4624, Logon Type 10) and the subsequent volume of ICS protocol traffic (`Zeek conn.log`, `modbus.log`, `dnp3.log`, `opc.log`) to Level 1/2 devices. Calculate the 95th percentile for these metrics over the last 30 days. Trigger an alert if an interactive logon session, especially one from a statistically rare source IP or user account, is followed by ICS traffic to Level 1/2 devices that exceeds the 95th percentile in terms of volume or duration. 3. **Machine Learning:** Train a supervised learning model (e.g., Random Forest, Gradient Boosting) to classify remote logon sessions on critical ICS hosts as 'normal' or 'anomalous'. Features for the model should include source IP entropy, time of day, day of week, user account history, and geopolitical risk scores for source IPs. Once a logon is classified as anomalous, use a sequence mining algorithm on `Zeek conn.log` and ICS protocol logs to identify common sequences of events post-login. Flag any sequence that includes connections to multiple Level 1/2 devices or high data transfer volumes as potential process state monitoring activity."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]