[
  {
    "information_requirement": "Is an adversary attempting to destroy critical operational data or system files to inhibit response functions in the ICS environment? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0809",
        "name": "Data Destruction",
        "evidence": [
          {
            "description": "Execution of known data destruction utilities or anomalous command-line activity on critical ICS assets.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians",
            "action": "Continuously monitor for process creation events (Windows Event ID 4688) on all NAIs. Create and maintain a watchlist of known data destruction tool process names (e.g., sdelete.exe, killdisk.exe, cipher.exe) and suspicious command-line arguments (e.g., '/w', '-z'). Establish a baseline of normal processes and command-line usage on these sensitive systems. Alert on the execution of any process not on the established baseline or any process matching the watchlist. Analyze parent-child process relationships to detect legitimate tools being spawned by unusual parents (e.g., sdelete.exe spawned by a web server process)."
          },
          {
            "description": "Anomalously high volume of file deletion or modification events originating from a single user or process on a server hosting critical ICS data.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Data Historians, ICS Backup Servers",
            "action": "Enable object access auditing on critical file shares and directories containing ICS project files, configurations, and backups. Monitor for a high rate of file deletion events (Windows Event ID 4663 with Accesses: DELETE) from a single source host or user account. Establish a baseline for normal file deletion rates per user/system per hour. Use statistical methods, such as alerting when the number of deletions in a 10-minute window exceeds the 99th percentile of the baseline, to detect abnormal activity indicative of wiping."
          },
          {
            "description": "Targeted deletion of specific, high-value ICS file types, such as PLC project files, HMI configurations, or historian archives, which are critical for operational recovery.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), File servers hosting ICS project files and backups",
            "action": "Implement high-priority, rule-based alerts for any deletion event (Windows Event ID 4663 with Accesses: DELETE) targeting files with critical ICS-specific extensions (e.g., *.ACD, *.S7P, *.PCV, *.HMI). The action should require immediate investigation, correlating the deletion with the user account, source workstation, and time of day. A deletion from a non-EWS host or by a non-engineering user account outside of a planned maintenance window should be treated as a critical incident."
          },
          {
            "description": "Transfer of unrecognized or suspicious executable files from the IT network into the OT/ICS environment, potentially representing the staging of a data destruction tool.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network boundary between IT and OT networks (e.g., ICS DMZ), Core ICS network segments",
            "action": "Monitor Zeek logs for executable files (.exe, .dll, .bat, .ps1) transferred into the ICS network via protocols like SMB or HTTP (Zeek files.log). Calculate the Shannon entropy of all transferred files; a high entropy score can indicate packed or encrypted payloads. Use Zeek's pe.log to analyze PE header information for anomalies, such as unusual section names or missing compilation timestamps. Correlate file transfer events with connection logs (Zeek conn.log) to identify the source and destination. Alert on any executable transfer from a non-approved source or to a destination other than a designated software repository."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]