[
  {
    "information_requirement": "Is an adversary collecting data from our ICS information repositories? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0811",
        "name": "Data from Information Repositories",
        "evidence": [
          {
            "description": "Detection of a single user account or host accessing more than 50 unique files within a 15-minute window from ICS-related network shares or Document Management Systems, or any access to files explicitly tagged as 'SCADA_Schematic', 'PLC_Configuration', 'HMI_Layout', or 'RTU_Manual'.",
            "data_sources": [
              "Zeek smb_files.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Engineering Workstations, Document Management Systems (DMS), and Sharepoint/Confluence instances hosting ICS documentation.",
            "action": "1. **Symbolic Logic:** Create a high-priority alert for any 'file_open' or 'file_read' event (Windows Event ID 5145, Zeek smb_files.log) where the 'filename' or 'filepath' contains keywords like 'SCADA_Schematic', 'PLC_Configuration', 'HMI_Layout', 'RTU_Manual', 'P&ID_Drawing', or 'Historian_Backup' AND the 'source_ip' or 'user_id' is not on an approved list of engineering/administrative accounts. 2. **Statistical Method:** For each source host (identified by 'id.orig_h' in Zeek smb_files.log or 'Source_IP' in Windows Event ID 5145), establish a 7-day rolling baseline of the average number of unique files accessed per 15-minute interval. Generate an alert if the current unique file access count for a host exceeds 3 standard deviations from its established average or surpasses the 99th percentile for all hosts on the NAI. 3. **Machine Learning:** Apply a user and entity behavior analytics (UEBA) model to Zeek smb_files.log and Windows Event ID 5145 data. Train the model on historical file access patterns (e.g., time of day, file types, volume, source/destination). Flag any session or user activity that exhibits a high anomaly score (e.g., top 1% of anomalies) indicating deviation from normal file access behavior, such as accessing an unusual number of different file types or files from a disparate set of directories."
          },
          {
            "description": "Outbound data transfer from known ICS information repositories (e.g., Historian, Control System Database) exceeding 100MB in a single session or accumulating more than 500MB within 1 hour to any non-ICS internal client IP or external IP address, utilizing common data transfer protocols (e.g., SMB, MSSQL, HTTP/S, FTP).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek http.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historian Servers, Control System Databases (SQL, Oracle), ICS File Servers, and Engineering Workstations acting as data aggregation points.",
            "action": "1. **Statistical Method:** Filter Zeek conn.log for connections originating from NAIs where 'resp_bytes' is greater than 100MB. For each NAI, establish a 30-day statistical baseline (mean, 99th percentile) of 'resp_bytes' per connection and total 'resp_bytes' per hour for all destinations. Trigger an alert if a single connection's 'resp_bytes' exceeds the 99th percentile of historical traffic or if the hourly aggregate 'resp_bytes' to a single destination IP exceeds 3 standard deviations from the NAI's average hourly outbound transfer. 2. **Symbolic Logic:** Create an alert for any connection (Zeek conn.log) from an NAI to an IP address on a known threat intelligence feed (e.g., C2, malicious IPs) with 'resp_bytes' greater than 0. Additionally, look for connections to common cloud storage or file-sharing service domains (e.g., drive.google.com, dropbox.com) from NAIs. 3. **Machine Learning:** Implement a time-series anomaly detection model on the 'resp_bytes' field from Zeek conn.log, specifically for traffic originating from NAIs. Train the model to recognize normal daily and weekly patterns of data transfer volume. Alert on significant deviations (e.g., a sudden, sustained increase in outbound data volume that falls outside the learned seasonal pattern with a high anomaly score), which could indicate bulk exfiltration."
          },
          {
            "description": "Successful interactive (Logon Type 2) or network (Logon Type 3) logon to a critical ICS repository host (e.g., Engineering Workstation, Historian Server) by a user account not belonging to the 'ICS_Engineers' or 'ICS_Admins' Active Directory groups, or a valid account logging in from an atypical geographic location, device, or outside of normal working hours.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Historian Servers, Domain Controllers, and Jump Servers within the ICS network segment.",
            "action": "1. **Symbolic Logic:** Monitor Windows Event ID 4624 (Successful Logon) on NAI hosts. Generate an immediate alert for any successful logon where the 'TargetUserName' is not a member of predefined authorized groups (e.g., 'ICS_Engineers', 'ICS_Admins') OR the 'LogonProcessName' indicates a suspicious logon type (e.g., 'Advapi' for service logons not explicitly authorized). 2. **Statistical Method:** For each 'TargetUserName' in Windows Event ID 4624 on NAIs, establish a baseline of typical login times, source IP geolocation (enriched from Zeek conn.log), and 'WorkstationName' (source device). Calculate a risk score for each login based on deviations from this baseline (e.g., login outside of 2 standard deviations from average login time, source IP from a country not seen in the last 90 days, new 'WorkstationName'). Alert when a cumulative risk score for a single login or user within an hour exceeds a predefined threshold (e.g., top 5% of all observed risk scores). 3. **Machine Learning:** Apply a supervised machine learning classification model (e.g., Random Forest, SVM) to Windows Event ID 4624 data. Train the model using historical login data, labeling known legitimate and suspicious login attempts. Features for the model should include 'TargetUserName', 'LogonType', 'Source_IP', 'LogonTime', 'WorkstationName', 'Account_Group_Membership', and geolocation data (from Zeek conn.log). The model will classify new login events as 'normal' or 'anomalous', triggering an alert for 'anomalous' classifications with a high confidence score."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]