[
  {
    "information_requirement": "Is an adversary attempting to disrupt operator visibility of the industrial process? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0815",
        "name": "Denial of View",
        "evidence": [
          {
            "description": "A Human-Machine Interface (HMI) or operator workstation stops receiving expected periodic status updates or keep-alive messages from a field device (e.g., PLC, RTU) over an ICS protocol.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The control system network segment connecting HMIs to field controllers.",
            "action": "Identify critical HMI-to-PLC/RTU communication pairs based on network traffic (Zeek conn.log). Establish a baseline for the frequency and volume of communication (e.g., bytes per minute, packets per minute) for each pair during normal operations. Monitor for a sudden and complete cessation of traffic or a drop below a statistically significant threshold (e.g., >3 standard deviations below the mean) from the PLC/RTU to the HMI that is not correlated with a scheduled maintenance window."
          },
          {
            "description": "A critical HMI software process on an operator workstation terminates unexpectedly or is killed by another process, resulting in a loss of the operator's view.",
            "data_sources": [
              "Windows Event ID 4689",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interface (HMI) workstations and Engineering Workstations.",
            "action": "Monitor for the termination of critical HMI software processes (e.g., `view.exe`, `ftview.exe`) via Windows Event ID 4689. Correlate this with preceding process creation events (Event ID 4688) to identify if a malicious script or tool (e.g., `taskkill.exe`) was responsible for the termination. Alert on unexpected terminations not initiated by a logged-on administrator or a known software update process."
          }
        ]
      },
      {
        "technique_id": "T0814",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "An unusually high volume of network traffic, particularly connection requests (SYN packets), is directed at a critical control system component like an HMI or data historian, leading to resource exhaustion and preventing it from displaying process data.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways to the control system, Data Historian servers, HMI workstations.",
            "action": "For critical assets (HMIs, Historians), establish a baseline of incoming connection attempts (total and per source IP) using Zeek conn.log. Calculate the 95th and 99th percentiles for the number of connections per minute. Trigger an alert when the number of inbound connection attempts exceeds the 99th percentile for a sustained period (e.g., more than 1 minute). Analyze the 'conn_state' field in Zeek conn.log for a high ratio of 'S0' (SYN sent, no reply) or 'REJ' (connection rejected) states, indicative of a SYN flood."
          },
          {
            "description": "A critical Windows service required for HMI data visualization or communication (e.g., OPC server, data collection service) terminates unexpectedly.",
            "data_sources": [
              "Windows Event ID 7034"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI workstations, Engineering Workstations, servers hosting control system applications.",
            "action": "Monitor for Windows Event ID 7034, which explicitly logs the unexpected termination of a service. Create a list of critical ICS-related services. Establish a baseline of normal service behavior and alert on any instance of Event ID 7034 for services on the critical list, especially if the service is not configured to restart automatically."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]