[
  {
    "information_requirement": "Is an adversary using default credentials for lateral movement within the OT network? (TA0109 - Lateral Movement)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0812",
        "name": "Default Credentials",
        "evidence": [
          {
            "description": "A successful network connection is made to a critical ICS device (e.g., PLC, RTU) from a new or unusual source IP over a common management protocol known to use default credentials.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting IT and OT zones (Purdue Model Level 3.5)",
            "action": "Maintain a watchlist of known default usernames for OT devices and their associated management ports (e.g., 21, 23, 80, 443, 502). Monitor Zeek conn.log for successful connections ('REJ' state_code is not present) to these devices on these ports. Establish a baseline of legitimate source-destination communication pairs. Alert when a connection is established from a source IP not present in the baseline. Use statistical methods to detect a single source IP connecting to an abnormally high number (e.g., >95th percentile) of OT devices over a short timeframe, which could indicate scanning or lateral movement."
          },
          {
            "description": "A process associated with remote management (e.g., vendor-specific engineering software, putty.exe) is created on an Engineering Workstation (EWS) immediately following an anomalous user login, resulting in a network connection to a control system device.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS)",
            "action": "Correlate successful user logins (Windows Event ID 4624) on Engineering Workstations with subsequent process creation events (Windows Event ID 4688) for remote management tools (e.g., 'pl_win.exe', 'putty.exe'). Link these host events with outbound network connections (Zeek conn.log) from the EWS to OT devices. Establish a baseline for each user's typical login behavior (time, source) and tools used. Calculate a risk score based on deviations from the baseline (e.g., off-hours login + use of a rare tool + connection to a new PLC). An aggregate score exceeding a predefined threshold triggers an alert for likely credential abuse."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]