[
  {
    "information_requirement": "Has an adversary caused a loss of availability in a critical ICS component? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0826",
        "name": "Loss of Availability",
        "evidence": [
          {
            "description": "A critical ICS host, such as an HMI or Engineering Workstation (EWS), unexpectedly stops communicating on the network, and its essential SCADA/control applications crash or terminate.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations on the Process Control Network.",
            "action": "Continuously monitor Zeek conn.log to profile the expected 'heartbeat' or communication frequency from critical ICS assets (HMIs, EWS). Establish a baseline for the time interval between communications for each device. Alert if a device fails to communicate for a period exceeding 3 standard deviations of its normal interval. Upon alert, pivot to the host's Windows Event Logs and query for application crash events (ID 1000, 1002) or unexpected critical service stop events (ID 7036) that occurred just before the network silence."
          },
          {
            "description": "A high volume of file modification, renaming, or deletion events occurs in a short period on a critical system like a Historian or EWS, consistent with ransomware encrypting or wiping ICS project files, configurations, or historical data.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historian Servers, Engineering Workstations, and file servers hosting ICS project files and configurations.",
            "action": "On file servers and EWS, enable file system auditing for critical project directories. Ingest Windows Event ID 4663. For each host, calculate the entropy of file extensions being modified by a single process in a 1-minute window. A sudden, sharp decrease in entropy (e.g., many different file types being renamed to a single '.encrypted' extension) is a strong indicator. Additionally, establish a baseline for the rate of file modification events per process and alert when this rate exceeds the 99th percentile of the historical distribution for that host. Correlate with process creation events (ID 4688) looking for known ransomware processes or suspicious command-line arguments like 'vssadmin.exe delete shadows'."
          },
          {
            "description": "A flood of network traffic, potentially using legitimate or malformed ICS protocols, is directed at a Programmable Logic Controller (PLC) or other field device, causing it to become unresponsive to legitimate operator commands.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The Process Control Network segment, specifically network traffic directed at PLCs, RTUs, and IEDs.",
            "action": "Using Zeek conn.log, baseline the number of concurrent connections and total bytes transferred per minute to each critical controller (PLC, RTU). Create a statistical model (e.g., moving average with standard deviation) for these metrics. Trigger an alert if traffic from any single source IP to a controller exceeds a dynamic threshold (e.g., 4 standard deviations above the moving average) for more than 60 seconds. Correlate this with Zeek notice.log for any `Scan::Address_Scan` or similar notices originating from the same source IP."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]