[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via external remote services? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0822",
        "name": "External Remote Services",
        "evidence": [
          {
            "description": "A successful login to an ICS-facing remote access service (e.g., VPN, RDP gateway) exhibits multiple anomalous characteristics, such as originating from a previously unseen country or ASN, occurring at an unusual time, or being preceded by a high number of failed login attempts.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Demarcation Zone (DMZ), VPN Concentrators, Remote Access Gateways, Jump Boxes",
            "action": "Correlate successful logins (Windows Event ID 4624) on remote access servers with network connection logs (Zeek conn.log) using timestamp and IP addresses. For each user account, establish a baseline of normal activity including typical login hours, source countries/ASNs, and login frequency. Use descriptive statistics to define 'normal' (e.g., mean and standard deviation of login times). Trigger an alert when a successful login occurs from a new country or from an IP that also generated a high count of failed logins (Windows Event ID 4625) in the preceding hour, or if the login time is more than 3 standard deviations from the user's established baseline."
          },
          {
            "description": "A high volume of failed login attempts against single or multiple accounts from a single external source IP, indicative of a brute force or password spraying attack against the remote service.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers for Remote Access, VPN Concentrators, Domain Controllers",
            "action": "From a single source IP identified in Zeek conn.log, count the number of failed login events (Windows Event ID 4625) over a 5-minute window. Alert if the count exceeds a threshold (e.g., 20 failures). To detect password spraying, identify when a single source IP generates failed logins for a large number of distinct user accounts (e.g., >15 unique accounts in 10 minutes). Calculate the ratio of failed (4625) to successful (4624) logins from external IPs; a ratio exceeding the 95th percentile of the daily norm for that service is highly suspicious."
          },
          {
            "description": "Following a successful remote access session, network traffic patterns are observed that are inconsistent with typical engineering or maintenance activities, such as internal network scanning or large, unexpected data transfers.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal ICS Network Segments, Engineering Workstations, Human-Machine Interfaces (HMIs), Data Historians",
            "action": "After a successful remote login (Windows Event ID 4624), track the subsequent network activity from the associated source IP in Zeek conn.log. Establish a baseline of normal post-login behavior for remote users, including typical destination IPs and ports. Alert when a user's session deviates from this baseline, such as connecting to an abnormally high number of unique hosts or ports within the ICS network (potential scanning). Calculate the entropy of destination ports contacted by the source IP in a 10-minute window; a sudden spike in entropy indicates scanning behavior. Also, alert on connections where the total bytes transferred (`orig_bytes` + `resp_bytes`) exceeds the 99th percentile of typical remote session data volume."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]