[
  {
    "information_requirement": "Is an adversary using GUI-based remote access for execution on ICS hosts? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0823",
        "name": "Graphical User Interface",
        "evidence": [
          {
            "description": "A successful remote interactive logon (RDP) to a critical ICS host, such as an HMI or Engineering Workstation, from an anomalous source or at an unusual time.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Workstations (OWS), ICS Domain Controllers",
            "action": "Filter Windows Security logs for Event ID 4624 where Logon Type is 10 (RemoteInteractive). Establish a baseline of authorized user accounts and source workstations that legitimately use RDP to access critical ICS assets. Alert on any logon event that deviates from this baseline, such as a logon from an unapproved source IP, a user account not associated with engineering or operations, or a logon occurring outside of standard maintenance windows. Calculate the frequency of RDP sessions per user/source and flag users with a statistically significant increase in session frequency (e.g., > 95th percentile of their historical activity)."
          },
          {
            "description": "Network traffic indicating an RDP or VNC session to a critical ICS asset from an unauthorized source or with unusual characteristics (e.g., long duration, high volume).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, Demilitarized Zone (DMZ) Firewalls, Connections between IT and OT networks",
            "action": "Continuously monitor Zeek conn.log for connections to destination ports TCP/3389 (RDP) and TCP/5900-5906 (VNC). Create an allow-list of authorized source-destination IP pairs for these services within the ICS environment. Generate an alert for any connection that does not match the allow-list. For allowed connections, establish a baseline for session duration and bytes transferred. Use statistical analysis (e.g., z-score, interquartile range) to detect sessions that are outliers in terms of their duration or data volume, which could indicate interactive adversary activity rather than routine access."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]