[
  {
    "information_requirement": "Is an adversary establishing persistence on control system devices via unauthorized firmware modifications? (PIR)",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0839",
        "name": "Module Firmware",
        "evidence": [
          {
            "description": "Network traffic containing firmware update protocols (e.g., TFTP, FTP, or vendor-proprietary) originates from a source other than an authorized Engineering Workstation (EWS) or occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) perimeter, Engineering Workstations (EWS), network segments containing PLCs/RTUs.",
            "action": "Establish and maintain a list of authorized EWS IP addresses. Monitor Zeek conn.log for connections using common firmware transfer protocols (e.g., TCP/21, UDP/69) where the id.orig_h (originator) is not on the authorized EWS list and the id.resp_h (responder) is a known control system device. For identified transfers, analyze the corresponding Zeek files.log entry. Calculate the Shannon entropy of the transferred file; a high entropy score may indicate a packed or encrypted malicious firmware image. Correlate findings with maintenance schedules to reduce false positives."
          },
          {
            "description": "A control system module (e.g., PLC Ethernet card) reboots or ceases communication unexpectedly, immediately following network activity indicative of a file transfer.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN), critical PLC and RTU assets.",
            "action": "For critical control system assets, establish a statistical baseline of communication heartbeat frequency and data volume using Zeek conn.log. Implement a time-series analysis to detect sudden and prolonged communication drop-offs from a monitored device. If a communication loss is detected, automatically query Zeek logs for the 1-hour period prior to the event for any file transfer activity (via files.log) or connections from non-standard hosts to the affected device IP."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to impair process control by manipulating module firmware on critical PLCs or RTUs? (PIR)",
    "tactic_id": "TA0106",
    "tactic_name": "Impair Process Control",
    "indicators": [
      {
        "technique_id": "T0839",
        "name": "Module Firmware",
        "evidence": [
          {
            "description": "A known vendor-specific firmware update utility is executed on a host that is not an authorized Engineering Workstation (EWS), with command-line arguments targeting a control system device.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), management servers with access to the Process Control Network (PCN).",
            "action": "Maintain an inventory of approved firmware update process names (e.g., 'firmware_loader.exe') and the hostnames of authorized EWS. Create a detection rule to alert on Windows Event ID 4688 where the 'New Process Name' field matches an item in the inventory, but the event's 'Computer' field does not match an authorized EWS hostname. The action should automatically extract and display the 'Command Line' from the event log to provide immediate context on the targeted device IP and firmware file used."
          },
          {
            "description": "A control system device begins exhibiting novel network behavior, such as communicating with new internal or external hosts or using different protocols, without a corresponding and authorized configuration change.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) core and boundary.",
            "action": "For each critical ICS device, generate a baseline of normal network communications using at least 30 days of Zeek conn.log data. The baseline should be a whitelist of tuples: (source_ip, destination_ip, destination_port, protocol). Create a detection that triggers when a new connection is observed that does not match any entry in the device's established baseline. Use descriptive statistics to periodically report the top 5 rarest connections observed across the PCN to proactively hunt for subtle deviations."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]