[
  {
    "information_requirement": "Is an adversary intercepting ICS network communications? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0830",
        "name": "Adversary-in-the-Middle",
        "evidence": [
          {
            "description": "A single MAC address is associated with multiple critical IP addresses, or a critical IP address (e.g., for a PLC or HMI) suddenly resolves to a new, unauthorized MAC address, indicative of ARP poisoning.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Security Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) switches, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Domain Controllers",
            "action": "From network traffic (Zeek conn.log), establish a baseline of known IP-to-MAC address mappings for critical ICS assets. Continuously monitor for any changes to this baseline. Alert when a known critical IP address appears with a new MAC address. Additionally, monitor for command line execution (Windows Event ID 4688) of 'arp -a' on key hosts like HMIs and EWS to capture ARP table state, and alert on changes to entries for critical assets. Use descriptive statistics to identify any single MAC address associated with a number of IPs exceeding 3 standard deviations from the network baseline."
          },
          {
            "description": "Network traffic from a critical ICS device, such as a PLC, is routed through an unexpected intermediary host instead of its usual destination, like the SCADA server or HMI.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network backbone of the PCN, network gateways between ICS and enterprise zones, SCADA servers",
            "action": "Analyze Zeek conn.log to baseline communication paths between critical ICS endpoints (e.g., PLC-to-HMI, EWS-to-PLC). Model these as source-destination pairs. Search for connections where a known critical source IP communicates with an unknown or unauthorized destination IP, especially if that new IP then communicates with the original intended destination. Alert on the appearance of these new intermediary hops in established communication channels. Calculate the percentile of traffic volume flowing to new intermediaries; a high percentile may indicate a successful redirection."
          },
          {
            "description": "Anomalous SSL/TLS certificates, such as new self-signed certificates or certificates with validation errors, appear on communication channels expected to be secured with valid, trusted certificates.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Encrypted communication channels, typically involving SCADA/Historian servers, remote access solutions, and modern field devices",
            "action": "Using Zeek x509.log and ssl.log, create and maintain a baseline of known-good certificate fingerprints, subjects, and issuers for all encrypted ICS traffic. Generate an alert for any connection that uses a new, previously unseen self-signed certificate. Also alert on any certificate with a 'validation_status' other than 'ok'. Calculate the Shannon entropy of certificate subject and issuer fields; unusually high entropy may indicate randomly generated, malicious certificates."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]