[
  {
    "information_requirement": "Has an adversary disabled or degraded critical protective functions? (TA0105 - Impact)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0837",
        "name": "Loss of Protection",
        "evidence": [
          {
            "description": "Detection of specific, high-impact industrial control commands (e.g., 'Stop CPU', 'Program/Logic Download', 'Key Switch/Mode Change', 'Force Output', 'Write to Protected Register') targeting a Safety Instrumented System (SIS) controller, originating from an unapproved IP address or user, or occurring outside of established maintenance windows, indicating an attempt to disable or alter protective logic.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Zeek dnp3.log",
              "Zeek bacnet.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4697",
              "Windows Event ID 4656/4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIS network segments (Level 0/1), Engineering Workstation (EWS) network segment (Level 2/3), Process Control Network (PCN) segments where EWS communicate with SIS devices, Active Directory Domain Controllers (for authentication data)",
            "action": "1. **Symbolic Logic**: Identify all Zeek industrial protocol logs (s7comm.log, modbus.log, enip.log, dnp3.log, bacnet.log) containing commands known to modify or halt SIS operations (e.g., 'Stop CPU', 'Program/Logic Download', 'Key Switch/Mode Change', 'Force Output', 'Write to Protected Register'). Filter for commands targeting known SIS controller IP addresses. Correlate these events with `Windows Event ID 4624` (successful login) and `Windows Event ID 4688` (process creation, specifically engineering software) on Engineering Workstations (EWS) within a 5-minute window preceding the command. Alert if the source IP of the command is not a whitelisted EWS, or if the user account performing the action is not authorized for SIS modifications. 2. **Statistical Method**: Establish a baseline of normal logic download frequency, size, and checksum for each SIS controller over a 30-day period using Zeek industrial protocol logs. Calculate the mean and standard deviation for these metrics. Alert if a 'Program/Logic Download' command is observed where the download size or frequency deviates by more than 3 standard deviations from the baseline, or if the logic checksum changes unexpectedly outside of a scheduled maintenance window. 3. **Machine Learning/Time Series**: Implement a time series anomaly detection model (e.g., Isolation Forest or LSTM autoencoder) on the frequency and type of control commands observed targeting SIS devices from Zeek industrial protocol logs. Train the model on historical data (e.g., 90 days) to learn normal operational patterns. Alert on significant deviations in command frequency or type that exceed a pre-defined anomaly score threshold, indicating unusual control activity."
          },
          {
            "description": "An unusual volume or pattern of critical alarm inhibitions or modifications to alarm setpoints to non-protective values, originating from a Human-Machine Interface (HMI) or Engineering Workstation (EWS), detected through industrial protocol write commands or HMI audit logs, indicating an attempt to suppress alerts or bypass safety limits.",
            "data_sources": [
              "Zeek opc-ua.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "HMI application audit logs",
              "Data Historian logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI network segment (Level 2), EWS network segment (Level 2/3), Process Control Network (PCN) segments (Level 1/2), Data Historian servers",
            "action": "1. **Symbolic Logic**: Identify specific industrial protocol write commands (e.g., OPC-UA Write, Modbus Write Multiple Registers, S7comm Write Variable) from Zeek logs (opc-ua.log, modbus.log, s7comm.log, dnp3.log) targeting memory addresses or tags known to control critical alarm setpoints or inhibition flags. Cross-reference these events with a whitelist of authorized HMI/EWS IPs and user accounts (from `Windows Event ID 4624`). Alert on any write operation from an unapproved source or at an unexpected time (e.g., outside of scheduled maintenance windows). 2. **Statistical Method**: Establish a 7-day rolling baseline for the average rate of alarm inhibitions and setpoint modifications per HMI/EWS device and per user session (correlated using `Windows Event ID 4624` and Zeek logs). Calculate the Z-score for the current rate. Alert if the current rate of inhibitions or setpoint changes exceeds 3 standard deviations from the historical mean for a given device or user, indicating a statistically significant surge in activity. 3. **Machine Learning/Classification**: Develop a supervised machine learning model (e.g., Random Forest Classifier) trained on historical industrial protocol write commands and HMI audit logs, labeled as 'normal' or 'anomalous' (e.g., during known incidents or maintenance). Features could include source IP, destination IP, command type, register/tag modified, value written, time of day, and user. Use the model to classify new write commands. Alert on classifications indicating 'anomalous' activity related to alarm management."
          },
          {
            "description": "Sudden and sustained cessation of expected network communication (e.g., polling, heartbeat, status updates) from critical protective devices (e.g., protective relays, safety interlocks, circuit breakers) as observed in network flow logs, indicating a potential physical disablement, bypass, or network disruption affecting safety systems.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "ICMP logs",
              "Firewall logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Level 0/1 field device network segments (e.g., for safety interlocks, sensors), Level 2 SCADA/DCS network segments (for protective relays, circuit breakers), Substation network segments (for IEDs), DMZ/Perimeter firewalls",
            "action": "1. **Symbolic Logic**: Maintain a comprehensive inventory of all critical protective devices (e.g., protective relays, safety PLCs, safety interlocks) including their IP addresses, expected communication protocols (e.g., DNP3, Modbus/TCP, S7comm), and normal polling/heartbeat intervals. Create a rule to alert if no `Zeek conn.log` entries or specific industrial protocol entries (dnp3.log, modbus.log, s7comm.log) are observed from a critical protective device IP address for a period exceeding its expected communication interval plus a configured tolerance (e.g., 2x the normal interval), indicating a complete loss of communication. 2. **Statistical Method**: For each critical protective device, establish a 14-day rolling baseline of its average communication volume (bytes/packets) and frequency (connections per minute) using `Zeek conn.log`. Calculate the percentile rank for current communication metrics. Alert if the current communication volume or frequency drops below the 5th percentile of its baseline for a sustained period (e.g., 5 consecutive minutes), which may indicate degraded communication rather than a full loss. 3. **Machine Learning/Time Series**: Apply a time series forecasting model (e.g., ARIMA or Prophet) to predict the expected communication frequency of each critical protective device based on historical `Zeek conn.log` data. Continuously compare actual communication frequency against the predicted range. Generate an alert if the actual frequency falls below the lower bound of the prediction interval for a specified duration (e.g., 10 minutes), signaling an unexpected and sustained communication disruption."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]