[
  {
    "information_requirement": "Is an adversary attempting to upload and exfiltrate PLC logic for reconnaissance? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0845",
        "name": "Program Upload",
        "evidence": [
          {
            "description": "A data transfer from a PLC to another device on the network exceeds 1MB (a typical size for a full PLC logic file) or significantly deviates (e.g., >3 standard deviations) from the historical average of `resp_bytes` for that specific PLC-client communication pair. This transfer is inconsistent with normal operational polling traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, specifically network connections between PLCs and Engineering Workstations (EWS) or jump boxes, and the Demilitarized Zone (DMZ) if data exfiltration is suspected.",
            "action": "1. **Statistical Baseline Deviation:** Using Zeek conn.log, establish a 7-day rolling baseline of `resp_bytes` for each unique (PLC IP, EWS IP) communication pair, specifically for connections to known ICS programming ports (e.g., TCP/102 for S7comm, TCP/44818 for EtherNet/IP). Alert when the current `resp_bytes` for a session exceeds the 99th percentile or is greater than the average plus 3 standard deviations of the historical baseline for that specific pair. 2. **Protocol Command Matching (Symbolic Logic):** Monitor `zeek s7comm.log` for specific `function_code` values that indicate a program upload (e.g., `0x1A` for 'Upload' or 'Read Program Block'). Immediately alert upon detection, especially if the source IP is not an authorized EWS or the event occurs outside of scheduled maintenance windows. 3. **Time Series Anomaly Detection (Advanced Statistical):** Apply a time-series anomaly detection model (e.g., an Exponentially Weighted Moving Average or a Holt-Winters forecast) to the aggregated `resp_bytes` from PLCs to EWS within rolling 5-minute windows. Flag and alert on sustained deviations that exceed a predefined anomaly score threshold, indicating a significant and unusual increase in data transfer volume over time."
          },
          {
            "description": "An engineering application (e.g., TIA Portal, Studio 5000) is executed by a non-whitelisted user account, from an unauthorized file path (e.g., `C:\\Temp\\malware.exe`), or with command-line arguments that deviate significantly from a historical baseline (e.g., high entropy or unusual parameters). This process creation occurs immediately before or concurrently with an outbound network connection to a PLC's programming port.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), and other industrial endpoints with authorized PLC programming software.",
            "action": "1. **Rule-Based Execution Anomaly (Symbolic Logic):** Create a whitelist of authorized user accounts, parent processes, and execution paths for known engineering applications (e.g., `TIA Portal.exe`, `Studio5000.exe`). Alert on any `Windows Event ID 4688` where these applications are launched by a user not in the whitelist, from a path not in the whitelist (e.g., `C:\\Users\\Public\\`), or spawned by an unusual parent process (e.g., `powershell.exe`, `mshta.exe`). 2. **Command-Line Entropy & Frequency (Statistical):** For each engineering application, track the daily execution count and calculate the Shannon entropy of its command-line arguments over a 30-day period. Alert if the daily execution count exceeds the 99th percentile of its historical average or if the command-line argument entropy deviates by more than 3 standard deviations from the historical mean, indicating unusual or randomized parameters. 3. **Behavioral Correlation with Network Activity (Advanced Statistical/Rule):** Correlate `Windows Event ID 4688` events for engineering software launches with subsequent `Windows Event ID 5156` (Windows Filtering Platform Connection) events where the `DestinationPort` corresponds to an ICS programming port (e.g., TCP/102, TCP/44818) within a 5-minute window. Further enrich these correlated events with `Windows Event ID 4624` logon data to identify if the user session initiating this activity is anomalous (e.g., first-time logon for the user on this EWS, logon from an unusual source IP or at an unusual time)."
          },
          {
            "description": "An anomalous successful logon to an Engineering Workstation (EWS) is observed, characterized by multiple deviations from a user's established baseline (e.g., source IP, time of day, logon type). This anomalous logon is immediately followed by network activity from the EWS to a PLC consistent with a program upload.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs on Engineering Workstations (EWS), network traffic monitoring points between EWS and PLCs, and Active Directory domain controllers for centralized authentication logs.",
            "action": "1. **Multi-Factor Baseline Deviation (Statistical):** For each successful logon event (Windows Event ID 4624) on EWS assets, establish a 30-day rolling baseline for the associated user account, encompassing typical login times (e.g., hourly distribution), source IP ranges/subnets, and `LogonType`. Flag logons that simultaneously deviate from the baseline by more than 2 standard deviations across at least two different metrics (e.g., source IP and time of day). 2. **Rule-Based Correlation with Upload Activity (Symbolic Logic):** If an anomalous logon (as identified in step 1) occurs on an EWS, immediately query `Zeek conn.log` and `zeek s7comm.log` for outbound connections initiated from that EWS to PLCs on ICS programming ports (e.g., TCP/102, TCP/44818) within the subsequent 15 minutes. Generate a high-priority alert if these connections contain program upload function codes (e.g., S7comm `function_code = 0x1A`) or exhibit `resp_bytes` exceeding a predefined threshold for a typical program upload (e.g., >1MB). 3. **User Entity Behavior Analytics (UEBA) for Logon (Advanced Statistical/ML):** Implement a UEBA model that assigns a risk score to user logons on EWS by analyzing multiple features such as time of day, day of week, source IP geolocation, previous logon history, and frequency of EWS access. Flag and alert on logons that generate a high-risk score, indicating a significant deviation from the user's established normal behavior profile for EWS access."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]