[
  {
    "information_requirement": "Is an adversary attempting to inhibit response functions by modifying system firmware? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0857",
        "name": "System Firmware",
        "evidence": [
          {
            "description": "A large file transfer consistent with a firmware image is sent to a critical ICS device (e.g., PLC, RTU) over an expected or unexpected protocol (e.g., FTP, TFTP, vendor-specific) from an unauthorized source or at an unusual time.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments containing critical controllers, Network links between corporate and ICS networks, Engineering Workstations (EWS)",
            "action": "Monitor Zeek conn.log for connections to known ICS devices on firmware update ports (e.g., FTP/21, TFTP/69, or vendor-specific ports). Establish a baseline of authorized source IPs (e.g., EWS, vendor jump boxes) and file sizes for legitimate updates using historical Zeek files.log data. Alert on transfers from non-standard sources, transfers with anomalous file sizes (using z-score or interquartile range on the 'seen_bytes' field), or transfers occurring outside of scheduled maintenance windows."
          },
          {
            "description": "Execution of a known firmware update utility on an Engineering Workstation (EWS) or Human-Machine Interface (HMI) outside of a planned maintenance window or by an unauthorized user account.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Human-Machine Interfaces (HMIs)",
            "action": "Create a watchlist of known ICS vendor firmware update executable names and hashes. Monitor for their execution via Windows Event ID 4688 on all EWS and HMIs. Correlate the logon session ID from Event 4688 with Event 4624 to identify the user. Alert on any execution that is unscheduled or initiated by a user account not authorized for maintenance activities. Calculate the frequency of use for each tool by user; flag executions by users who have a low historical frequency of using that specific tool."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary establishing persistence by implanting malicious system firmware? (PIR)",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0857",
        "name": "System Firmware",
        "evidence": [
          {
            "description": "A critical ICS device (PLC, RTU) begins communicating in an anomalous manner (e.g., new protocols, different polling frequency, connections to new C2 destinations) shortly after a suspected firmware transfer.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing critical controllers (PLCs/RTUs), Network egress points from the Process Control Network (PCN)",
            "action": "For each critical ICS asset, establish a baseline of normal communication patterns using Zeek conn.log. This baseline should include typical destination IPs, ports/protocols, connection duration, and data volume per hour. After detecting a potential firmware update event, monitor the target device for significant deviations from its baseline. Use statistical methods like calculating the entropy of destination ports or flagging connections to destinations with a low historical prevalence (e.g., seen less than 1% of the time) to identify anomalous post-update behavior."
          },
          {
            "description": "A file identified as a firmware image is transferred over the network, and its hash does not match any known-good, approved firmware versions maintained in a central repository.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN), Engineering Workstations (EWS), File servers hosting firmware images",
            "action": "Maintain a database of file hashes for all approved firmware versions for devices on the PCN. When Zeek files.log identifies a file transfer with a MIME type or file extension associated with firmware (e.g., .bin, .hex), automatically compare its hash against the known-good database. Correlate with Zeek conn.log to identify the source and destination. Generate a high-severity alert for any transfer of a firmware file with an unknown or explicitly blacklisted hash."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]