[
  {
    "information_requirement": "Is an adversary leveraging standard application layer protocols (e.g., DNP3, Modbus, HTTP) for command and control within the ICS network? (PIR)",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0869",
        "name": "Standard Application Layer Protocol",
        "evidence": [
          {
            "description": "A standard industrial or enterprise protocol (e.g., DNP3, Modbus, RDP) is observed communicating over a non-standard port, especially to or from an external IP address or between sensitive network segments.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Demarcation (Firewall/Gateway), Engineering Workstations (EWS), Human-Machine Interfaces (HMIs).",
            "action": "Analyze Zeek conn.log to establish a baseline of all observed protocol-port pairings (e.g., 'dnp3' on port 20000, 'modbus' on 502). Create a watchlist of critical industrial protocols. Generate an alert for any traffic where a watched protocol is identified by the Zeek protocol analyzer on a port not in its established baseline. Prioritize alerts where the source or destination is an external IP or crosses the IT/OT boundary."
          },
          {
            "description": "The volume, frequency, or content of traffic for a standard protocol (e.g., HTTP, DNP3) deviates significantly from its established baseline, suggesting it's being used as a tunnel for C2.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dnp3.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Historian Servers, Web Proxies.",
            "action": "For HTTP C2 (Zeek http.log), calculate the 95th percentile of POST request sizes for each internal host over a 30-day period. Alert when a host sends a POST request exceeding this statistical baseline. Additionally, calculate the Shannon entropy of requested URIs and User-Agent strings; alert on high-entropy values indicative of DGA. For DNP3 C2 (Zeek dnp3.log), baseline the normal function codes used between specific master/outstation pairs. Alert on the use of rare or unexpected function codes (e.g., WRITE, DIRECT_OPERATE), especially if they originate from an unusual source like an IT-based system and correlate with suspicious process creation (Windows Event ID 4688) on the source host."
          },
          {
            "description": "An RDP session is initiated from an external, non-whitelisted IP address to a critical ICS asset, or an internal RDP session occurs at an unusual time or between assets that do not typically communicate via RDP.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Jump Servers/Bastion Hosts, HMIs, Domain Controllers.",
            "action": "Monitor for successful interactive logons (Windows Event ID 4624 with Logon Type 10 for RDP). For each event, extract the source IP address. Use Zeek conn.log to determine if the source IP is internal or external. Alert on any successful RDP logon from an external IP not on an approved allowlist. For internal RDP, build a graph of normal source-destination RDP connections and alert on any new edge in the graph, representing a previously unseen RDP path."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]