[
  {
    "information_requirement": "Is an adversary exploiting remote services to gain initial access into the ICS environment?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0866",
        "name": "Exploitation of Remote Services",
        "evidence": [
          {
            "description": "Anomalous network connection from the IT network targets a known vulnerable or rarely used service within the OT network, potentially with unusual payload characteristics.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The IT/OT network boundary (e.g., industrial DMZ) and internet-facing OT assets.",
            "action": "Monitor Zeek conn.log for all connections crossing the IT/OT boundary. Establish a baseline of normal source-destination-port communication pairs. Use statistical analysis to identify rare or first-seen connections targeting OT assets, particularly on ports associated with remote services (e.g., 445/SMB, 3389/RDP, 5900/VNC) or ICS protocols (e.g., 502/Modbus, 20000/DNP3). For identified connections, calculate the Shannon entropy of the payload; a high entropy score may indicate encrypted or packed exploit code not matching expected protocol behavior. Correlate findings with Zeek notice.log for signatures of known exploits."
          },
          {
            "description": "A critical service on an OT asset crashes or terminates unexpectedly immediately following a network connection from an untrusted source in the IT network.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 7034",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), and Historian servers within the OT network.",
            "action": "Correlate network connection logs (Zeek conn.log) from IT sources to OT assets with host-based logs on the destination asset. For each successful connection, query the target host's logs for Application Error events (Windows Event ID 1000) or Service Terminated Unexpectedly events (Windows Event ID 7034) where the faulting application or service name matches the service listening on the connection's destination port. A temporal correlation within a short window (e.g., 30 seconds) is a strong indicator of a failed exploit attempt or an exploit causing instability."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary exploiting remote services to move laterally within the ICS environment?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0866",
        "name": "Exploitation of Remote Services",
        "evidence": [
          {
            "description": "An OT host (e.g., an EWS) initiates connections to a specific remote service (e.g., SMB) on an abnormally high number of other OT hosts, indicative of scanning or worm-like propagation.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Key network segments within the OT zone, such as the supervisory control network or process control network.",
            "action": "Analyze Zeek conn.log for intra-OT traffic. For each source host, create a time-series count of unique destination hosts it connects to on common remote service ports (e.g., 445, 3389) within a sliding 10-minute window. Establish a baseline and standard deviation for this 'fan-out' activity for each host. Generate an alert when a host's connection count exceeds a dynamic threshold (e.g., 3 standard deviations above its mean, or exceeds the 99th percentile of all host activity), suggesting active scanning for lateral movement opportunities."
          },
          {
            "description": "A legitimate OT service process (e.g., a historian service or HMI application) spawns an unusual child process (e.g., command shell, PowerShell) after receiving a connection from another OT host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical OT assets such as Engineering Workstations, HMIs, and application servers.",
            "action": "Create a detection that joins network and host data. Trigger when an incoming network connection from another OT host (Zeek conn.log) is followed within minutes by a process creation event (Windows Event ID 4688) on the target host. The detection should specifically look for whitelisted service processes (e.g., `historian.exe`, `hmi_runtime.exe`) as the parent process and non-standard, interactive shells (e.g., `cmd.exe`, `powershell.exe`) or unsigned binaries as the child process. Maintain a baseline of normal parent-child relationships and alert on any deviation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]