[
  {
    "information_requirement": "Has an adversary compromised our OT environment via a trusted supply chain relationship? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0862",
        "name": "Supply Chain Compromise",
        "evidence": [
          {
            "description": "A newly installed or recently patched software/firmware on a critical OT asset (e.g., HMI, Engineering Workstation) initiates network connections to unknown or suspicious external destinations shortly after installation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Human-Machine Interfaces (HMIs), Historian servers, OT network demilitarized zone (DMZ).",
            "action": "Correlate software installation events (Windows Event ID 4697 - Service Installation, Windows Event ID 4688 - Process Creation for installers) on critical OT hosts with subsequent network connections from those hosts within a 24-hour window using Zeek conn.log. For each new connection, analyze the destination IP and queried domain (Zeek dns.log). Establish a baseline of normal destinations for these hosts and alert on connections to destinations that are statistically rare (e.g., have a low historical frequency score) or have a low reputation score from threat intelligence feeds. Calculate the Jaccard similarity between the set of domains contacted post-update and the set of domains contacted in the 30 days prior; a low similarity score indicates a significant change in behavior."
          },
          {
            "description": "An executable associated with a known ICS vendor application is executed from an unusual file path or is unsigned, suggesting a trojanized installer has dropped a malicious payload.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, HMIs, Application servers in the Process Control Network.",
            "action": "Monitor Windows Event ID 4688 (Process Creation) on key OT Windows-based systems. Maintain an allow-list of expected file paths for legitimate ICS vendor executables (e.g., 'C:\\Program Files\\Vendor\\app.exe'). Alert on any process execution where a known ICS process name (e.g., 'HMI_Client.exe') runs from a non-standard path (e.g., 'C:\\Users\\operator\\AppData\\Local\\Temp\\'). Calculate the Shannon entropy of the file path; paths with unusually high entropy, especially within user-writable directories, should be prioritized for investigation as they may indicate randomized payload placement by an installer."
          },
          {
            "description": "A control system device (e.g., PLC, RTU) exhibits anomalous network behavior, such as communicating with new internal or external hosts or using non-standard protocols, following a recent firmware update.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, particularly network traffic to/from PLCs, RTUs, and other embedded controllers.",
            "action": "Using Zeek conn.log, establish a rigorous communication baseline for each control device on the network. The baseline should model device-to-device communication pairs, protocols/ports, connection frequency, and typical data volume per connection. Use descriptive statistics (mean, median, standard deviation) to define 'normal' for each metric. Generate an alert when a device's behavior deviates significantly (e.g., > 3 standard deviations from the mean) from its baseline, such as initiating a connection to a new IP address, using a port not seen in its historical profile, or a sudden spike in data transfer volume. Correlate the timestamp of the network anomaly with physical maintenance logs to determine if a recent firmware update occurred."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]