[
  {
    "information_requirement": "Is an adversary causing physical damage to ICS assets or the surrounding environment?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0832",
        "name": "Manipulation of Control",
        "evidence": [
          {
            "description": "A critical process parameter (e.g., temperature, pressure, rotational speed) exceeds its documented safe operating limits immediately following a command from a controller or HMI. This suggests control logic has been manipulated to push equipment into a damaging state.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs)",
            "action": "From network data (e.g., Zeek modbus.log), establish a baseline of normal value ranges for write commands to critical PLC registers corresponding to physical actuators. Use descriptive statistics (mean, median, 99th percentile) for these values. Generate an alert when a new write command is observed with a value that falls outside 3 standard deviations of the historical norm or exceeds documented safety thresholds. Correlate the timestamp of the alert with process creation logs (Windows Event ID 4688) on the source HMI/EWS to identify the process that initiated the malicious command."
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Device Restart/Shutdown",
        "evidence": [
          {
            "description": "A critical controller or server (e.g., PLC, HMI, historian) undergoes an unscheduled shutdown or restart that is not correlated with a planned maintenance window, known power outage, or authorized administrative action. An improper shutdown can cause physical damage to equipment that requires a specific, sequenced power-down procedure.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6008",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Process Historians, Domain Controllers within the ICS environment",
            "action": "Monitor critical Windows-based ICS assets for unexpected shutdown events (Windows Event ID 6008 - Unexpected Shutdown) or user-initiated shutdowns (Windows Event ID 1074 - Shutdown Initiated). For any such event that does not correlate with a change management ticket, investigate the associated user account and process name from the event log. Correlate the event's timestamp with network logs (Zeek conn.log) to identify any inbound remote connections (e.g., RDP, WinRM) to the device immediately preceding the shutdown, which could indicate the source of an unauthorized remote command."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]