[
  {
    "information_requirement": "Is an adversary collecting PLC I/O image data to understand the industrial process? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0877",
        "name": "I-O Image",
        "evidence": [
          {
            "description": "Read commands targeting a PLC's I/O memory originate from a device not on the established allow-list of authorized HMIs, Engineering Workstations, or Historians.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments containing PLCs.",
            "action": "Continuously monitor ICS protocol logs (e.g., Zeek modbus.log, s7comm.log) for read function codes directed at PLCs. For each read request, correlate the source IP from conn.log with a pre-defined asset inventory of authorized control system components (HMIs, EWS, Historians). Alert on any read requests originating from an unauthorized IP address."
          },
          {
            "description": "An authorized device, such as an Engineering Workstation, issues an unusually high volume or frequency of read commands to a PLC, deviating significantly from its established operational polling baseline.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic between authorized clients (e.g., Engineering Workstations, HMIs) and PLCs.",
            "action": "For each authorized source-destination PLC pair, ingest ICS protocol logs (e.g., Zeek s7comm.log) into a time-series model. Calculate a baseline for the frequency (requests per minute/hour) of read commands over a representative operational period (e.g., 30 days). Use statistical methods, such as identifying request frequencies exceeding the 99th percentile or 3 standard deviations from the mean, to detect anomalous polling behavior."
          },
          {
            "description": "The use of specific, low-level ICS protocol function codes to directly read PLC memory blocks corresponding to the I/O image, which are not typically used during normal HMI-to-PLC polling operations.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application layer data within the Process Control Network (PCN), specifically traffic destined for PLCs.",
            "action": "Analyze Zeek s7comm.log or modbus.log data, specifically the 'function' or 'func' fields. Create a baseline of commonly used function codes for each HMI-to-PLC communication path. Calculate the entropy of function codes used by each source device over a rolling time window. A sudden spike in entropy or the appearance of rare diagnostic or direct memory read functions, not part of the established baseline, should trigger an alert."
          },
          {
            "description": "Anomalous network read commands targeting a PLC originate from an Engineering Workstation (EWS) that is concurrently exhibiting signs of compromise, such as the execution of unusual processes or scripts.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and the Process Control Network (PCN).",
            "action": "Upon receiving a network-based alert for anomalous PLC read activity from an EWS, pivot to its host logs. Scrutinize Windows Event ID 4688 logs on that EWS for the time window surrounding the network alert. Search for the execution of non-standard processes, command-line utilities (e.g., powershell.exe), or any process not part of the standard engineering software suite. The temporal correlation of suspicious host process execution with anomalous network polling strongly indicates a compromised EWS being used for I/O image collection."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]