[
  {
    "information_requirement": "Is an adversary attempting to hide their presence on critical ICS hosts? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0872",
        "name": "Indicator Removal on Host",
        "evidence": [
          {
            "description": "The Windows Security Event Log, or other critical event logs, were cleared on a critical ICS host. This is a highly anomalous action outside of approved maintenance windows.",
            "data_sources": [
              "Windows Event ID 1102"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, and OT Domain Controllers.",
            "action": "Create a high-severity alert for any instance of Windows Event ID 1102 (The audit log was cleared). This event is a strong indicator of compromise in an OT environment. Correlate the event's timestamp with preceding user logins (Windows Event ID 4624) and process creations (Windows Event ID 4688) on the same host to identify the responsible account and parent process."
          },
          {
            "description": "An unusually high volume of files are deleted from an ICS host by a single process or user, particularly from directories known to contain logs, temporary files, or staged adversary tools.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on Engineering Workstations and HMIs, specifically directories containing logs (e.g., C:\\Windows\\System32\\winevt\\Logs\\), temporary files, and user profiles.",
            "action": "Enable file system auditing for deletion events (Event ID 4663 with Accesses: DELETE) on critical directories. Monitor for suspicious process creations (Event ID 4688) such as `wevtutil.exe cl`, `del`, or `sdelete.exe`. Establish a baseline of file deletion events per host/user using a 30-day rolling window. Generate an alert when the number of deletions in a short time frame (e.g., 1 hour) exceeds a statistical threshold, such as three standard deviations above the mean or the 99th percentile."
          },
          {
            "description": "An adversary deletes or modifies command history files (e.g., PowerShell ConsoleHost_history.txt) to conceal executed commands on an Engineering Workstation or HMI.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and other ICS hosts where operators or administrators might use command-line interfaces.",
            "action": "Monitor process creation events (Windows Event ID 4688) for command lines targeting known history files, such as `del %APPDATA%\\Microsoft\\Windows\\PowerShell\\PSReadLine\\ConsoleHost_history.txt`. Because this is a specific and suspicious action, any occurrence should be investigated to determine the user and context of the command."
          },
          {
            "description": "An adversary stops the event logging service to prevent further activity from being recorded.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 7040"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Services running on critical ICS hosts like EWS, HMIs, and Historians.",
            "action": "Monitor for Windows System Event ID 7036 where the service name is 'Windows Event Log' and the state is 'stopped'. This event is extremely rare and suspicious. Also monitor for Event ID 7040 (The start type of the Windows Event Log service was changed), as an adversary may disable the service to prevent it from restarting. Alert immediately on either of these events and correlate with recent network activity (Zeek conn.log) to identify potential remote administration sessions."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]