[
  {
    "information_requirement": "Has the adversary stolen operational information from the ICS environment?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0882",
        "name": "Theft of Operational Information",
        "evidence": [
          {
            "description": "Anomalous high-volume data transfer originates from a critical ICS asset (e.g., Engineering Workstation, Data Historian) to an unusual internal or external destination, suggesting exfiltration of operational data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points between the OT and IT networks, Engineering Workstations, Data Historians.",
            "action": "For critical ICS assets, establish a baseline of normal data transfer volumes (sum of `orig_bytes` in conn.log) and destination IP addresses/subnets over a 30-day period. Calculate the 95th percentile for hourly data volume for each asset. Generate an alert when an asset's hourly data transfer volume exceeds this baseline. For such alerts, enrich the destination IP with DNS lookups from Zeek dns.log occurring just before the transfer to check for connections to suspicious or newly registered domains."
          },
          {
            "description": "Archiving or compression utilities are executed on an Engineering Workstation or file server, targeting directories known to contain sensitive operational files (e.g., PLC project files, HMI configurations).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, ICS Application Servers, File servers hosting project data.",
            "action": "Monitor for process creation events (Windows Event ID 4688) on critical ICS assets for known archiving tool process names (e.g., `7z.exe`, `rar.exe`, `zip.exe`, `tar.exe`). Analyze the `CommandLine` field for file paths or extensions related to operational data (e.g., `.L5K`, `.ACD`, `.hmi`, `.csv`). A low-frequency execution of these tools targeting sensitive directories is a strong indicator of data staging for theft."
          },
          {
            "description": "A user account or automated process accesses an unusually large number of distinct operational files or directories in a short timeframe, deviating significantly from normal user behavior.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers containing operational design documents, PLC/HMI project repositories.",
            "action": "Assuming object access auditing is enabled for critical file shares (generating Windows Event ID 4663), establish a baseline for the number of unique files accessed per user per hour. Use a sliding time window (e.g., 10 minutes) to count distinct file access events for sensitive file types (e.g., `.ACD`, `.L5K`). Alert when the count for a single user exceeds 3 standard deviations from their personal or role-based baseline, suggesting an automated or scripted collection effort."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]