[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via an internet-exposed device?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0883",
        "name": "Internet Accessible Device",
        "evidence": [
          {
            "description": "Unsolicited inbound connection attempts from external, untrusted IP addresses to ICS-specific ports on devices within the OT network.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Perimeter/DMZ Firewall",
            "action": "Filter Zeek conn.log for connections where the originating IP is from the public internet (not RFC1918 or known-good partner space) and the destination IP is within the ICS network space. Focus on destination ports commonly associated with ICS protocols (e.g., 102 for S7, 502 for Modbus, 20000 for DNP3, 44818 for EtherNet/IP) and remote administration (e.g., 5900 for VNC, 3389 for RDP). Establish a baseline of normal connection attempts. Use descriptive statistics to identify outliers, such as a sudden spike in connection volume from a single source IP or a connection attempt from a geographically rare source country. Alert on any connection attempts to these ports from IPs not on a pre-approved allow list."
          },
          {
            "description": "A high volume of failed authentication attempts from a single external IP address targeting an exposed Windows-based ICS asset (e.g., HMI, Engineering Workstation).",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Exposed Engineering Workstations (EWS) or Human-Machine Interfaces (HMIs)",
            "action": "Monitor for Windows Event ID 4625 (An account failed to log on) on critical internet-facing ICS assets. Group events by source network address and account name over a 5-minute window. Calculate the rate of failed logins per source. Establish a baseline for normal failed login activity. Trigger an alert when the failure rate from a single external IP exceeds a statistical threshold (e.g., 3 standard deviations above the mean, or a hard limit of >10 failures in 5 minutes). Correlate the timestamp and source IP with Zeek conn.log to confirm the traffic originated externally and to check for other suspicious network activity from the same source."
          },
          {
            "description": "A successful remote login to an ICS asset from an unauthorized external IP address.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers, Exposed Engineering Workstations (EWS) or Human-Machine Interfaces (HMIs)",
            "action": "For every successful remote login (Windows Event ID 4624 with Logon Type 10 for RDP or Type 3 for network share), extract the source network address. Use Zeek conn.log to confirm the connection path and enrich the source IP with GeoIP and ASN information. Compare the source IP against a maintained allow-list of known remote administrator, vendor, and business partner IP addresses. Any successful login from an external IP not on this list is a high-fidelity alert for a potential breach."
          },
          {
            "description": "Anomalous data transfer volume from an internet-facing ICS device to an external destination, potentially indicating data staging or C2 communication after a successful compromise.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Perimeter/DMZ Firewall",
            "action": "For established connections in Zeek conn.log between internal ICS assets and external IPs, model the baseline data transfer behavior. For each connection, analyze the 'resp_bytes' (data sent from ICS to external host). Calculate the 95th and 99th percentile for data volume per device over a rolling 30-day window. Generate an alert when a single connection's 'resp_bytes' exceeds the 99th percentile, or when the cumulative daily volume for a device exceeds the 95th percentile, indicating an unusual amount of data leaving the control network."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]