[
  {
    "information_requirement": "Is an adversary capturing wireless ICS communications for subsequent use? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Detection of ICS process control commands received via wireless gateway that are outside of scheduled operational windows, contradict current process states, or result in anomalous physical responses or system alerts, indicating a potential replay attack.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek DNP3.log",
              "Zeek Modbus.log",
              "Windows Event ID 4624",
              "SCADA/DCS System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting wireless gateways to the ICS network, Wireless Access Points/Gateways, Human-Machine Interfaces (HMIs), and Engineering Workstations (EWS).",
            "action": "1. **Symbolic Logic**: Identify successful command transmissions from wireless gateways in `Zeek conn.log` (or specific ICS protocol logs like `Zeek DNP3.log` or `Zeek Modbus.log`) that target critical ICS assets. Correlate these command transmissions with `Windows Event ID 4624` (successful logon) on associated HMIs/EWS within a specific time window (e.g., 5 minutes). Flag any command transmission that lacks a corresponding authorized operator logon as a potential unauthorized command. 2. **Statistical Method**: Establish a baseline of normal command frequency and volume (bytes/packets) from wireless gateways to ICS devices using `Zeek conn.log` over a 30-day period. Calculate the 99th percentile for command frequency and volume. Alert on any 5-minute interval where the command frequency or volume from a wireless gateway exceeds its respective 99th percentile, indicating an unusual burst of activity. 3. **Machine Learning**: Develop a time-series anomaly detection model (e.g., using Isolation Forest or ARIMA) on the sequence of command types and their parameters observed in `Zeek conn.log` (or ICS protocol logs) originating from wireless gateways. Train the model on historical legitimate command sequences. Flag sequences that significantly deviate from the learned normal patterns as potential replayed or malicious commands."
          },
          {
            "description": "Identification of MAC addresses or unique device identifiers transmitting on ICS wireless frequencies (e.g., WirelessHART, Zigbee, 700 MHz) that are not present in the authorized asset inventory or exhibit signal characteristics inconsistent with known legitimate devices.",
            "data_sources": [
              "Wireless IDS Logs",
              "Spectrum Analyzer Logs",
              "Asset Management Database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical airspace surrounding ICS facilities, specifically near wireless field devices, sensors, actuators, and wireless access points/gateways.",
            "action": "1. **Symbolic Logic**: Establish and maintain an authoritative allow-list of all authorized MAC addresses and unique device identifiers for ICS wireless devices in an asset management database. Configure Wireless IDS and Spectrum Analyzers to parse device identifiers. Generate an immediate alert for any detected MAC address or device identifier that does not match an entry in the allow-list. 2. **Statistical Method**: For each authorized wireless device, collect baseline data on its typical signal strength (RSSI), frequency, and data transmission rates over a 7-day period. Calculate the interquartile range (IQR) for these metrics. Alert when any authorized device's current signal strength or data rate falls outside of 1.5 times the IQR of its established baseline for a sustained period (e.g., 5 minutes), indicating a potential impersonation or close-proximity rogue device. 3. **Machine Learning**: Apply a clustering algorithm (e.g., K-Means) to historical wireless device signal characteristics (e.g., RSSI, frequency stability, packet size distribution) to identify distinct 'device profiles'. Continuously feed new observations into the model. Flag any new device observation that does not significantly cluster with an existing authorized profile, or an authorized device whose characteristics shift to a different cluster, as an anomaly."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to discover our wireless ICS protocols and frequencies? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Detection of unknown or unauthorized RF transmitters emitting signals across multiple frequency bands or exhibiting rapid frequency hopping and power changes, specifically within or adjacent to licensed/unlicensed bands known to be used by ICS protocols (e.g., 900 MHz, 2.4 GHz, 700 MHz).",
            "data_sources": [
              "Spectrum Analyzer Logs",
              "Wireless IDS Logs",
              "RF Environment Baseline Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical perimeter and airspace surrounding ICS facilities, focusing on sensitive areas like control rooms, substations, remote terminal units (RTUs), and field device arrays.",
            "action": "1. **Symbolic Logic**: Establish a baseline of known, legitimate RF emissions within the ICS operational frequencies using `Spectrum Analyzer Logs`. Define 'known' emissions by frequency, bandwidth, power level, and typical duration. Configure alerts for any detected signal that does not match an established baseline profile and persists for more than 60 seconds. 2. **Statistical Method**: Continuously calculate the Shannon entropy of observed frequencies and power levels within defined ICS bands from `Spectrum Analyzer Logs` over 1-minute intervals. Establish a historical baseline for this entropy. Trigger an alert if the current entropy value exceeds the 99th percentile of the baseline, indicating a sudden increase in varied or unpatterned RF activity consistent with broad-spectrum scanning. 3. **Machine Learning**: Train a classification model (e.g., Support Vector Machine or Random Forest) on `Spectrum Analyzer Logs` to distinguish between known legitimate RF patterns (e.g., WirelessHART communication bursts, scheduled radio checks) and known discovery/scanning patterns (e.g., continuous sweep, rapid frequency shifts). Continuously feed live spectrum data into the model, flagging any classification as 'discovery scan' with high confidence."
          },
          {
            "description": "A sudden and statistically significant increase in failed authentication attempts, malformed protocol packets, or connection resets originating from an unknown or previously inactive wireless source targeting ICS wireless gateways, as observed in network traffic logs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Wireless Gateway System Logs",
              "Active Directory Security Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of ICS wireless gateways and associated authentication servers.",
            "action": "1. **Symbolic Logic**: Filter `Zeek conn.log` for connections to ICS wireless gateways (e.g., specific IP/port combinations). Identify connection attempts where `conn_state` indicates failure (e.g., `S0`, `REJ`) or where `history` shows a high number of retransmissions or resets. Correlate these with `Zeek notice.log` for `protocol_violation` or `scanning` notices. Trigger an alert if a source IP address, not present in the authorized network inventory, generates more than 5 failed connection attempts or 3 protocol violation notices within a 60-second window. 2. **Statistical Method**: Establish a 7-day rolling baseline for the average rate of failed connections (`conn_state=REJ` or `S0`) and `protocol_violation` notices per source IP address targeting ICS wireless gateways, using `Zeek conn.log` and `Zeek notice.log`. Calculate the Z-score for current rates. Trigger an alert for any source IP address whose failed connection rate or protocol violation rate exceeds a Z-score of 3.0 (i.e., 3 standard deviations above the mean baseline) within a 5-minute window. 3. **Machine Learning**: Develop a deep learning anomaly detection model (e.g., LSTM autoencoder) to learn normal sequences of connection states, protocol fields, and `Zeek notice.log` events for traffic interacting with ICS wireless gateways. Train the model on historical benign traffic. Continuously feed real-time `Zeek conn.log` and `Zeek notice.log` data into the model. Flag any sequence that results in a high reconstruction error as an anomalous probing or reconnaissance attempt."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]