[
  {
    "information_requirement": "Has an unauthorized program modification been made to a critical ICS controller to establish persistence?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0889",
        "name": "Modify Program",
        "evidence": [
          {
            "description": "An engineering workstation or other host sends a program download, online edit, or other logic modification command to a PLC/controller, especially outside of a scheduled maintenance window or from an unauthorized source.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network Segment, Engineering Workstations",
            "action": "Filter Zeek logs (e.g., notice.log or specific ICS protocol logs like s7comm.log) for function codes related to program modification ('Program Download', 'Write Block', 'Online Edit'). For each event, correlate the source IP with a known list of authorized Engineering Workstations (EWS). Establish a baseline of which EWS programs which PLC. Use descriptive statistics to identify source-destination pairs that are statistical outliers. Simultaneously, monitor Windows Event ID 4688 on EWS hosts for the execution of programming software (e.g., TIA_Portal.exe, Studio5000.exe). Any program modification command not preceded by an authorized software launch on a known EWS, or occurring outside a documented change window, should be flagged as a high-risk anomaly."
          },
          {
            "description": "A PLC/controller's operational mode is changed from 'RUN' to a state that permits modification, such as 'PROGRAM' or 'REMOTE', by an unauthorized asset.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical PLCs/Controllers, Process Control Network Segment",
            "action": "Using Zeek's ICS protocol parsers, create a continuous monitor for PLC mode change commands. Establish a state table for each critical controller, tracking its operational mode. Calculate the percentage of time each controller spends in a non-'RUN' state; flag any controller whose time in 'PROGRAM' or 'REMOTE' mode exceeds the 99th percentile of its historical baseline. Further, create an alert for any mode change command originating from an IP address not on the authorized Engineering Workstation allowlist. Correlate these mode change events with subsequent network traffic to the controller to identify potential follow-on program modification activity."
          },
          {
            "description": "The checksum, hash, or size of a controller's program logic file changes unexpectedly, indicating a modification has occurred without authorization.",
            "data_sources": [
              "Zeek files.log",
              "Windows Application Event Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Configuration Management Servers, Process Control Network Segment",
            "action": "Assuming a monitoring tool periodically checks controller logic and logs to a central server: search Windows Application Event Logs for events indicating 'Configuration Change' or 'Program Hash Mismatch'. Establish a 'golden' hash for each controller's logic. Any logged hash that deviates from the golden baseline is a high-confidence indicator of modification. Additionally, monitor Zeek files.log for transfers of project files (e.g., .ACD, .S7P) over the network. Calculate the entropy of transferred files; a significant deviation in entropy for a file destined for a PLC, compared to historical transfers, may indicate a maliciously packed or altered logic file."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]