[
  {
    "information_requirement": "Is an adversary using remote services to gain initial access to the ICS network? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "An anomalous RDP connection is established from an untrusted network (e.g., corporate IT) to a host within the OT/ICS network, bypassing designated jump hosts or occurring outside of established maintenance windows.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Security Event ID 4624",
              "Microsoft-Windows-TerminalServices-LocalSessionManager/Operational Event ID 21"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network boundary between IT and OT networks (ICS DMZ), Jump Servers, Engineering Workstations (EWS)",
            "action": "Filter Zeek conn.log for TCP port 3389 traffic where the source IP belongs to the IT network range and the destination IP is in the OT network range. Correlate successful connections with Windows Event ID 4624 (Logon Type 10) on the destination host. Establish a baseline of authorized source IPs (jump hosts) and user accounts for such connections. Alert on any RDP connection that deviates from this baseline, such as originating from a non-authorized source IP or using a non-privileged user account."
          },
          {
            "description": "A high volume of failed login attempts via a remote service (RDP, SMB) originates from a single external source IP, followed by a successful login, indicating a potential brute-force or password spraying attack.",
            "data_sources": [
              "Windows Security Event ID 4625",
              "Windows Security Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing remote access servers, Jump Servers, ICS DMZ",
            "action": "For each source IP in Zeek conn.log connecting on port 3389 or 445, count the number of failed logins (Event ID 4625) and successful logins (Event ID 4624) on the destination host within a 5-minute window. Calculate the failure-to-success ratio. Alert when this ratio exceeds a predefined threshold (e.g., 20:1) for a single user account or when the total number of failed logins from one IP exceeds a volumetric threshold (e.g., >100 failures)."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using remote services for lateral movement within the ICS network? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "An atypical peer-to-peer RDP connection is observed between two hosts within the OT network that do not normally communicate via RDP, such as from a Human-Machine Interface (HMI) to an Engineering Workstation (EWS) or between two HMIs.",
            "data_sources": [
              "Zeek rdp.log",
              "Zeek conn.log",
              "Windows Security Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians",
            "action": "Create a network graph or adjacency matrix of all internal RDP connections (TCP port 3389 in Zeek conn.log) over a 30-day baseline period. Use this baseline to identify statistically rare or previously unseen source-destination RDP connections within the OT network. Investigate any new RDP link, especially those involving critical assets or using administrative accounts (identified from Logon Type 10 in Event ID 4624)."
          },
          {
            "description": "An SMB connection is used to access administrative shares (e.g., C$, ADMIN$) or transfer executable/project files to a critical asset like an Engineering Workstation or HMI from another compromised host within the OT network.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Zeek smb_files.log",
              "Windows Security Event ID 4624",
              "Windows Security Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Domain Controllers, File Servers within the OT network",
            "action": "Monitor Zeek smb_mapping.log for any access to administrative shares (e.g., paths containing 'C$' or 'ADMIN$'). Monitor Zeek smb_files.log for the transfer of files with sensitive extensions (e.g., '.exe', '.dll', '.bat', '.ps1', '.ACD', '.L5K') between workstations, excluding known software distribution points. Establish a baseline of normal file transfer patterns and alert on transfers whose size or frequency exceeds the 95th percentile, or that involve rare source-destination pairs."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]