[
  {
    "information_requirement": "Is an adversary using a compromised ICS host as a proxy for Command and Control communications?",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0884",
        "name": "Connection Proxy",
        "evidence": [
          {
            "description": "A host, such as an Engineering Workstation (EW) or HMI, receives one or more connections from an external source and subsequently initiates a significantly larger number of connections to internal ICS assets (a 'fan-out' pattern). This behavior is anomalous for ICS environments where communication paths are typically static and well-defined.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeters between IT and OT zones, Engineering Workstations, HMIs, and data historians.",
            "action": "Aggregate Zeek conn.log data by source IP (`id.orig_h`) over 1-hour intervals. For each source IP, calculate the count of unique internal destination IPs. Establish a historical baseline for this metric for each critical host. Generate an alert when a host's unique destination count exceeds the 99th percentile of its baseline, especially if that host also received an inbound connection from an external IP address in the same time window. On the suspected proxy host, correlate the timestamps of anomalous network activity with Windows Event ID 5156 (WFP permitted a connection) to identify the specific application name (`Application Name`) responsible for the connections."
          },
          {
            "description": "A host, likely a jump server or DMZ system, is observed relaying traffic using ICS-specific protocols. An inbound connection from an external IP is followed closely in time by one or more outbound connections from that same host to internal control systems (e.g., PLCs, RTUs) using protocols like Modbus, DNP3, or S7.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Jump servers, OT DMZ, network segments containing PLCs and other field devices.",
            "action": "Create a streaming query that triggers on an inbound connection from an external IP to a sensitive internal host (identified in Zeek conn.log). Upon trigger, search for all outbound connections from that same internal host within the next 5 seconds. Raise a high-priority alert if any of these subsequent connections use common ICS ports (e.g., 502/TCP for Modbus, 20000/TCP for DNP3, 102/TCP for S7). Enrich the alert by querying Windows Event ID 4624 (An account was successfully logged on) on the proxy host to identify any recent remote logons (`Logon Type` 3 or 10) that preceded the suspicious network activity."
          },
          {
            "description": "A host's network traffic exhibits characteristics of protocol tunneling, where C2 is hidden within a legitimate protocol. This can manifest as unusually high data volumes or statistical anomalies in protocols like DNS or HTTP, followed by connections to internal systems. This suggests the host is acting as an endpoint to un-tunnel and proxy C2 traffic.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, hosts with direct or proxied internet access from the OT environment.",
            "action": "For Zeek dns.log, calculate the length and Shannon entropy of the `query` field. Baseline these values across the network. Alert on any DNS queries that are statistical outliers (e.g., length or entropy > 3 standard deviations from the mean for that source host). If an alert is generated, immediately inspect Zeek conn.log for any subsequent connections made by the alerting host to other internal systems. Correlate the timestamp of the anomalous DNS query with Windows Event ID 4688 (A new process has been created) on the source host to identify if a suspicious process (e.g., powershell.exe, rundll32.exe) was created just before the event."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]