[
  {
    "information_requirement": "Is an adversary collecting sensitive project files or configuration data from our ICS assets? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0807",
        "name": "Command-Line Interface",
        "evidence": [
          {
            "description": "A command-line interpreter (e.g., cmd.exe, powershell.exe) is used to access or stage an unusually high number of files, particularly those with extensions related to ICS projects (.ACD, .L5K, .SCX) or in directories known to contain sensitive schematics and configurations.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers",
            "action": "Filter for process creation events (Windows Event ID 4688) where the process name is cmd.exe or powershell.exe on NAIs. Analyze the associated command-line arguments for file access commands (e.g., 'dir', 'copy', 'xcopy', 'robocopy', 'findstr') and keywords matching sensitive ICS file extensions (.ACD, .L5K, .HMI, .SCX) or directory names ('Projects', 'Schematics'). Establish a baseline of command-line usage for each NAI; alert on deviations exceeding the 95th percentile of command-line length or complexity for that host type. A spike in this activity, especially from a non-administrative or remote user, is highly suspicious."
          }
        ]
      },
      {
        "technique_id": "T0853",
        "name": "Scripting",
        "evidence": [
          {
            "description": "Execution of a script (e.g., PowerShell, Python) that enumerates and reads multiple files from directories containing sensitive ICS project data. The script execution may be obfuscated or invoked by an unusual parent process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Domain Controllers, File Servers hosting ICS project files",
            "action": "Hunt for scripting engine processes (powershell.exe, python.exe, wscript.exe) via Windows Event ID 4688. Analyze command-line arguments for high entropy scores, which can indicate obfuscation. If available, search PowerShell script block logs (Windows Event ID 4104) for file system enumeration cmdlets ('Get-ChildItem', 'Get-Content') targeting sensitive directories. Correlate the timestamp of the script execution with network logs (Zeek conn.log) to identify any preceding remote access (e.g., RDP, WinRM) or subsequent outbound connections that could represent data staging. Develop a statistical model of normal script execution per host and flag outliers based on script block content, execution time, and parent process rarity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]