[
  {
    "information_requirement": "Is an adversary attempting to inhibit response functions by changing credentials on critical ICS devices? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0892",
        "name": "Change Credential",
        "evidence": [
          {
            "description": "The execution of ICS configuration/engineering software on a management host (e.g., Engineering Workstation) by an unauthorized user account or at an anomalous time.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and Human-Machine Interfaces (HMIs) within the Process Control Network (PCN)",
            "action": "On designated EWS and HMI hosts, create a baseline of user accounts that are authorized to execute specific ICS programming software (e.g., 'TIA Portal.exe', 'Studio5000.exe', 'ControlBuilder.exe'). Monitor for process creation events (Windows Event ID 4688) where these executables are launched by a user account not on the authorized list. Correlate the process execution with the parent logon session (Windows Event ID 4624) to identify logon type (e.g., remote desktop) and source IP. Use time-series analysis to identify executions that fall outside of the 95th percentile for normal business/maintenance hours."
          },
          {
            "description": "Network traffic from a management host to a controller (e.g., PLC, RTU) containing function codes or commands specific to setting, enabling, or changing a password, particularly outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek (or other sensor) ICS protocol logs such as s7comm.log or modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting the control network to the supervisory network, specifically traffic to and from critical controllers and EWS.",
            "action": "Monitor Zeek conn.log for connections to critical controllers on known ICS protocol ports (e.g., 102/tcp for S7, 502/tcp for Modbus). For protocols that are parsed, establish a baseline of normal function codes observed between EWS-to-controller pairs. Generate an alert for the use of rare and high-privilege function codes related to 'Set Password', 'Change Key', or 'Set Protection Level'. Calculate the entropy of function codes per source-destination pair over a rolling time window; a sudden decrease in entropy (indicating a few repeated, possibly malicious, commands) or the appearance of a statistically unlikely command should be flagged for investigation."
          },
          {
            "description": "A correlated sequence of events where an anomalous logon to an Engineering Workstation is followed by the launch of ICS configuration software and subsequent network traffic to a controller consistent with a credential modification.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Domain Controllers, and network gateways between IT and OT networks.",
            "action": "Develop a multi-stage detection model. Stage 1: Identify high-risk logons to EWS hosts (Windows Event ID 4624) by flagging sessions originating from non-standard subnets or occurring at anomalous times (e.g., > 3 standard deviations from the user's mean login time). Stage 2: Within a high-risk session, look for the execution of ICS programming software (Windows Event ID 4688). Stage 3: If both previous stages are met, query network logs (Zeek conn.log) for connections from the EWS to a controller's management port within 15 minutes of the process execution. Assign a risk score to each stage; a cumulative score exceeding a predefined threshold generates a high-fidelity alert indicating a likely attempt to illegitimately change controller credentials."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]