[
  {
    "information_requirement": "Is an adversary exploiting vulnerabilities to escalate privileges on critical ICS assets like Engineering Workstations or HMIs? (PIR)",
    "tactic_id": "TA0111",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T0890",
        "name": "Exploitation for Privilege Escalation",
        "evidence": [
          {
            "description": "A high-privilege process associated with ICS applications (e.g., historian service, HMI software) spawns an anomalous child process, such as a command shell (cmd.exe, powershell.exe) or a reconnaissance tool (whoami.exe, net.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), and Historian Servers within the Process Control Network (PCN).",
            "action": "Filter for Windows Event ID 4688 where the parent process is a known, high-privilege ICS application and the new process is an interactive shell or system utility. Establish a baseline of normal child processes for these parents using historical data. Alert on any deviation. Calculate the statistical rarity of each parent-child pair; a pair in the bottom 1st percentile of historical frequency is a strong signal of compromise."
          },
          {
            "description": "A new service is installed on a critical ICS asset, and its properties (name, description, binary path) are inconsistent with legitimate administrative activity or software deployment.",
            "data_sources": [
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), HMIs, and Domain Controllers within the Process Control Network (PCN).",
            "action": "Monitor for Windows Event ID 4697. Compare the 'Service Name' and 'Service File Name' against an allowlist of known-good services for the specific ICS asset type. Analyze the 'Service File Name' path for high string entropy or location in non-standard directories (e.g., C:\\Temp, C:\\Users\\Public). Alert on any service installation not matching the allowlist or exhibiting anomalous path characteristics."
          },
          {
            "description": "Anomalous network traffic, such as a connection to a rare destination or a file transfer containing an executable, originates from an ICS host immediately prior to host-based indications of privilege escalation.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting EWS, HMIs, and servers within the PCN; network gateways between the PCN and corporate IT network.",
            "action": "Upon detection of suspicious host activity (e.g., anomalous process creation via Event ID 4688), pivot to network logs. For the source host IP, examine Zeek conn.log data for the 5-10 minutes preceding the event. Identify connections to destinations not seen in the last 30 days. Use descriptive statistics to flag connections where the transmitted byte count ('orig_bytes') is in the top 99th percentile for that specific source-destination port combination, potentially indicating exploit payload delivery."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]