[
  {
    "information_requirement": "Is an adversary attempting to execute code via Autorun on an ICS system? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0895",
        "name": "Autorun Image",
        "evidence": [
          {
            "description": "A new process is created, and the executable path originates from a removable media volume (e.g., USB drive, newly mounted drive letter).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Human-Machine Interfaces (HMIs), and any ICS host with user-accessible removable media ports.",
            "action": "Monitor for process creation events (Windows Event ID 4688). For each event, parse the executable's path. Maintain a baseline of standard, fixed drive letters (e.g., C:, D:). Generate an alert if a process is executed from a drive letter not present in the baseline. To reduce false positives, calculate the statistical rarity of the parent process initiating a child process from a non-fixed drive. An alert with a higher confidence score should be generated if a typically non-interactive parent process (e.g., a system service) is observed launching the process."
          },
          {
            "description": "Within an ICS virtual machine, an unknown or rare process is executed shortly after a potential (unobserved) virtual disk mounting event, followed by anomalous network activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Hypervisor hosts and the guest virtual machines they manage (e.g., virtualized HMIs, data historians, domain controllers).",
            "action": "Within critical ICS virtual machines, monitor for process creation (Windows Event ID 4688). Establish and maintain a baseline of known-good executables and their file paths for each system. Alert on any process execution that is not on the baseline. Enhance this detection by calculating the Shannon entropy of the new process's filename; a high entropy score (e.g., in the 95th percentile of all known filenames) suggests a randomly generated, potentially malicious executable. Correlate the timestamp of this execution with any subsequent outbound network connections from the host VM's IP address in Zeek conn.log to an unusual or non-categorized destination to further increase the alert's priority."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]