[
  {
    "information_requirement": "Is an adversary using hardcoded credentials to move laterally between ICS assets?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "A single, non-administrative account successfully authenticating to multiple, distinct ICS assets (e.g., HMI to EWS, EWS to PLC) within a short timeframe, inconsistent with normal operator or engineering duties.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), and network segments connecting control devices.",
            "action": "For each user account, create a baseline of normally accessed destination systems by analyzing successful network logons (Windows Event ID 4624, Logon Type 3). Use statistical methods to identify outlier behavior, such as an account connecting to a number of unique destination hosts that exceeds the 95th percentile of its own historical behavior or the behavior of its peer group over a 24-hour window. Correlate the source and destination IP addresses with Zeek conn.log to validate the connection path and protocol used."
          },
          {
            "description": "Successful authentication to an ICS asset using a known, vendor-specific hardcoded credential from a public or internal watchlist.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic to/from critical controllers (PLCs, RTUs), Engineering Workstations, and network authentication servers.",
            "action": "Maintain a watchlist of known hardcoded usernames specific to the ICS equipment deployed in the environment. Create a high-priority alert for any successful login event (Windows Event ID 4624) or observed successful authentication in cleartext protocols (Zeek ssh.log, telnet.log) where the username field matches an entry on the watchlist. The alert should be triggered regardless of the source or destination asset."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has an adversary established persistence using hardcoded credentials on an ICS device?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "Repeated, periodic successful logins to a critical ICS asset from an unexpected source using an account not associated with legitimate automated processes (e.g., data historians, backup services).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical control system servers (e.g., Historians, SCADA servers), Engineering Workstations, and network gateways between IT and OT zones.",
            "action": "For each account performing remote logins (Windows Event ID 4624, Logon Type 3 or 10), analyze the time series of successful authentications. Calculate the time deltas between consecutive logins. A low variance or standard deviation in these deltas, indicating a machine-like 'heartbeat' interval (e.g., every 300 seconds +/- 5s), for a non-service account is highly suspicious. Cross-reference the source IP in Zeek conn.log to ensure it is not a known and authorized management or automation server."
          },
          {
            "description": "A successful interactive login (e.g., SSH, Telnet, RDP) to a field device (e.g., PLC, RTU) that rarely, if ever, receives such connections during normal operations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing PLCs, RTUs, Intelligent Electronic Devices (IEDs), and other field controllers.",
            "action": "Establish a baseline of assets that normally accept interactive remote connections and the typical source systems for these connections. Monitor Zeek logs (conn.log, ssh.log, telnet.log) for successful connections to devices not on this baseline. Generate an alert for any successful interactive session to a device that has not received one in a long period (e.g., > 90 days) or from a source IP not associated with an authorized Engineering Workstation or operator console."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]