[
  {
    "information_requirement": "Is the adversary attempting to inhibit or disable safety and protection functions? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0800",
        "name": "Activate Firmware Update Mode",
        "evidence": [
          {
            "description": "A process is executed on an Engineering Workstation (EWS) with command-line arguments that specify a target ICS device and an action to initiate a firmware update or maintenance state.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and other Windows-based systems with access to control system programming software.",
            "action": "Monitor Windows Event ID 4688 on Engineering Workstations for process creation events involving device management utilities or scripting engines (powershell.exe, cmd.exe). Analyze command-line arguments for keywords such as 'firmware', 'update', 'maintenance', 'reset', or the IP addresses of critical ICS devices (e.g., PLCs, RTUs). Calculate the entropy of command lines to flag unusually complex or obfuscated commands. Correlate a suspicious process execution with a new network connection in Zeek conn.log from the EWS to the target ICS device within a short time window (e.g., 5 seconds)."
          },
          {
            "description": "A network command consistent with activating firmware update mode is sent to a critical ICS device (e.g., PLC, protection relay), followed by a cessation of normal process-related communications from that device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek custom ICS protocol logs (e.g., modbus.log, dnp3.log)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS network segments containing critical controllers and protection devices, particularly the Purdue Model Level 1 and 2 networks.",
            "action": "Analyze Zeek logs for ICS protocols (e.g., Modbus, DNP3) for function codes or commands related to 'enter maintenance mode', 'firmware update', or 'device reset' sent to critical assets like protection relays. Establish a baseline of normal command-and-control traffic between the EWS and field devices. Alert on the presence of these specific, sensitive commands, especially if they originate from an unauthorized source IP or occur outside of scheduled maintenance windows. Correlate the command with a subsequent drop in expected periodic traffic from the target device (e.g., polling responses) using a time-series analysis of Zeek conn.log data for that device's IP, flagging deviations greater than 3 standard deviations from the baseline communication frequency."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]