[
  {
    "information_requirement": "Is an adversary attempting to impair our process control by manipulating I/O points? (PIR)",
    "tactic_id": "TA0106",
    "tactic_name": "Impair Process Control",
    "indicators": [
      {
        "technique_id": "T0806",
        "name": "Brute Force I-O",
        "evidence": [
          {
            "description": "A source IP initiates write commands to a single I/O point at a rate exceeding its established baseline (e.g., >50 writes per minute) and originating from an unapproved HMI/EWS or an endpoint without a corresponding authorized process creation event.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), and Programmable Logic Controllers (PLCs)",
            "action": "1. **Baseline & Statistical (Frequency Anomaly):** For each unique combination of (source IP, destination PLC IP, I/O address) in Zeek modbus.log (and other ICS protocol logs like dnp3.log, s7comm.log), establish a baseline of 'write command per minute' frequency over a 30-day period. Calculate the 99th percentile and 3-sigma upper control limit for each baseline. Generate an alert if the current 1-minute write command frequency for any (source IP, destination PLC IP, I/O address) exceeds its 99th percentile AND its 3-sigma upper control limit. 2. **Symbolic Logic (Unauthorized Source/Process):** Upon detection of a frequency anomaly, perform a lookup: a) Check if the source IP is on an approved whitelist of HMIs/EWS authorized to write to that specific PLC/I/O point. b) Correlate the source IP with Windows Event ID 4688 (Process Creation) on associated HMIs/EWS within a 5-minute window prior to the anomalous write activity. Flag if the process is not a known, authorized control application or if no process creation event is recorded for the source IP. 3. **ML Application (Time Series Anomaly Detection):** Apply a time-series anomaly detection model (e.g., Isolation Forest, Prophet for forecasting and deviation) to the aggregated 'write command per minute' metric for each critical I/O point. Train the model on historical data (e.g., 90 days). Trigger an alert if the model identifies a significant deviation from the expected pattern, indicating an unusual surge in write activity that might not be caught by simple thresholding."
          },
          {
            "description": "A single source IP executes write commands to a sequence of I/O point addresses (e.g., `addr` values showing linear or arithmetic progression) within a 30-second window, or targets a high percentage (>75%) of unassigned/invalid I/O points, or exhibits a sudden, significant change in I/O address entropy.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Programmable Logic Controllers (PLCs), and ICS field devices",
            "action": "1. **Symbolic Logic (Sequential/Invalid Address Targeting):** For each source IP, group write commands in Zeek modbus.log (and other ICS protocol logs) by 30-second sliding windows. Within each window, extract the sequence of I/O addresses (`addr` field). Identify if the sequence shows linear progression (e.g., `addr_n+1 = addr_n + 1`) or other arithmetic patterns. Additionally, compare all targeted `addr` values against a known-good configuration list for the destination PLC. Alert if >75% of targeted addresses within a 30-second window are unassigned or invalid for that specific PLC. 2. **Statistical Method (Entropy Anomaly):** For each source IP, calculate the Shannon entropy of the `addr` field for all write commands over a 5-minute sliding window. Establish a baseline entropy range for typical operation (e.g., 30-day moving average). Trigger an alert if the current entropy value for a source IP deviates by more than 2 standard deviations from its baseline, especially if it indicates a sudden increase (broad scanning) followed by a sharp decrease (focused targeting). 3. **ML Application (Sequence Anomaly Detection):** Employ a sequence modeling algorithm (e.g., Hidden Markov Model or a recurrent neural network) trained on historical sequences of I/O write commands to detect anomalous patterns of address traversal. Train the model on sequences of `addr` values from Zeek logs. Flag any new sequence of I/O writes that significantly deviates from learned normal patterns, indicating an unusual scanning or manipulation attempt."
          },
          {
            "description": "A single I/O point receives write commands from a source IP that cause its state to toggle (e.g., 0 to 1, 1 to 0) at a frequency exceeding a known safe operating limit (e.g., >10 toggles per minute), or from an authenticated session (Windows Event ID 4624) exhibiting anomalous characteristics (e.g., rare source IP, unusual time).",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Programmable Logic Controllers (PLCs), and critical field devices (e.g., actuators, valves)",
            "action": "1. **Baseline & Statistical (Toggle Frequency Anomaly):** For each unique (source IP, destination PLC IP, I/O address) in Zeek modbus.log (and other ICS protocol logs), monitor write commands that result in a state change (e.g., a coil being set then reset). Calculate the 'toggle frequency' (number of state changes) per minute. Establish a dynamic baseline for each I/O point's maximum safe toggle frequency based on engineering specifications or historical data. Alert if the observed toggle frequency exceeds its baseline by more than 150% or if it surpasses a hard-coded critical threshold (e.g., >10 toggles/minute for a specific valve). 2. **Symbolic Logic (Anomalous Authentication/Source):** When a toggle frequency anomaly is detected, correlate the source IP with successful logon events (Windows Event ID 4624) on HMIs/EWS. Identify if the logon session associated with the anomalous activity exhibits any of the following: a) Originates from an IP address not on an approved whitelist for control operations. b) Occurs outside of standard operating hours for the user. c) Is associated with a user account with no prior history of interacting with that specific I/O point. 3. **ML Application (Behavioral Anomaly Detection):** Develop a classifier (e.g., One-Class SVM or Isolation Forest) trained on normal sequences of I/O point values and their transitions from Zeek logs. This model learns the expected 'value change' behavior for critical I/O points. Trigger an alert when the model detects a sequence of rapid toggles that significantly deviates from the learned normal operational patterns, indicating a potentially malicious manipulation."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]