[
  {
    "information_requirement": "Is an adversary executing commands on critical ICS assets via a command-line interface?",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0807",
        "name": "Command-Line Interface",
        "evidence": [
          {
            "description": "A common ICS management shell (e.g., cmd.exe, powershell.exe, or a vendor-specific shell) on a critical system like an HMI or EWS spawns an unexpected or rare child process, such as a network reconnaissance tool (net.exe, ipconfig.exe) or a script interpreter.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers",
            "action": "Monitor for process creation events (Windows Event ID 4688) on critical ICS assets. Establish a baseline of normal parent-child process relationships for each host. Use frequency analysis to identify child processes that are statistically rare for a given parent process (e.g., a process that has not been seen in the last 90 days or falls below the 5th percentile of execution frequency). Alert on any such deviations from the established baseline."
          },
          {
            "description": "A remote login to an ICS asset is immediately followed by command-line execution that is anomalous for the user account or source IP address, such as occurring outside of normal maintenance windows or involving commands not typical for the user's role.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS DMZ, Remote Access Servers, Engineering Workstations (EWS)",
            "action": "Correlate successful remote logons (Windows Event ID 4624, Logon Type 10) with network connection logs (Zeek conn.log showing traffic on ports 3389, 22). For each session, track subsequent process creation events (Windows Event ID 4688) tied to the logon ID. Establish a baseline of typical commands, session duration, and source IP subnets for each remote user. Flag sessions where the command set has a low Jaccard similarity score compared to the user's historical command sets or originates from a previously unseen IP address."
          },
          {
            "description": "A command is executed with arguments that indicate obfuscation, reconnaissance, or data staging. This includes encoded PowerShell commands, network scanning commands, or output redirection to temporary or unusual file locations.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows-based ICS assets, including HMIs, EWS, and servers in the Process Control Network (PCN)",
            "action": "Ensure command-line process auditing is enabled to capture full command lines in Windows Event ID 4688. Scan command-line arguments for suspicious patterns such as 'powershell -enc', 'whoami', 'net user', or file redirection operators ('>', '>>'). Calculate the character entropy for command-line arguments; a high entropy score can indicate packed or encoded data. A combination of suspicious keywords and high entropy should trigger a high-priority alert."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]