[
  {
    "information_requirement": "Is an adversary attempting to inhibit response functions by blocking serial COM ports?",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0805",
        "name": "Block Serial COM",
        "evidence": [
          {
            "description": "A TCP connection to a known serial-to-Ethernet converter port is established and remains open for an unusually long duration with little to no data transfer, preventing legitimate connections.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing serial-to-Ethernet converters, PLCs, and RTUs.",
            "action": "Identify the IP addresses and TCP ports of known serial-to-Ethernet converters. Analyze Zeek conn.log, filtering for connections to these target devices. For each connection, calculate the duration and total bytes transferred (orig_bytes + resp_bytes). Establish a baseline of normal connection durations and data volumes for these specific ICS devices. Use statistical methods to flag connections where the duration is in the top percentile (e.g., >99th) and the data transfer rate is anomalously low (e.g., <1st percentile). A connection exhibiting both characteristics is a strong indicator of an attempt to block the serial COM port."
          },
          {
            "description": "An unusual or unauthorized source host initiates a connection to a serial-to-Ethernet converter.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT network boundary, engineering workstations, and serial-to-Ethernet converter network segments.",
            "action": "Maintain an allowlist of authorized IP addresses (e.g., HMIs, engineering workstations) permitted to connect to specific serial-to-Ethernet converters. Monitor Zeek conn.log for any connections where the source IP (id.orig_h) is not on the allowlist for the destination converter IP (id.resp_h) and port (id.resp_p). On the source host, correlate the connection timestamp with process creation events (Windows Event ID 4688) to identify the process (e.g., telnet.exe, netcat) that initiated the unauthorized connection."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]