[
  {
    "information_requirement": "Is an adversary performing automated collection of data from our ICS/OT environment? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0802",
        "name": "Automated Collection",
        "evidence": [
          {
            "description": "A single host establishes an unusually high number of connections to multiple distinct ICS devices (e.g., PLCs, HMIs, Historians) over a short period. This fan-out connection pattern deviates significantly from normal, periodic polling behavior seen from legitimate HMIs or Engineering Workstations.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments (Control Network, Process Network)",
            "action": "Analyze Zeek conn.log to identify hosts initiating connections to known ICS devices. For each source host, calculate the number of unique destination ICS devices connected to and the total connection count over a rolling 5-minute window. Establish a baseline for these metrics for legitimate systems (e.g., HMIs, EWS). Flag any source host whose unique destination count exceeds the 99th percentile of the established baseline, suggesting potential scanning or enumeration activity."
          },
          {
            "description": "The execution of a non-standard script (e.g., PowerShell, Python) or an unapproved binary on a key ICS asset like an Engineering Workstation or HMI, which is not part of the approved software baseline for that system. The process execution is immediately followed by a burst of network activity directed at other ICS assets.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Operator Stations / HMIs, ICS Application Servers",
            "action": "On critical ICS hosts (EWS, HMIs), monitor Windows Event ID 4688 (Process Creation). Create an allowlist of known-good parent/child process relationships and command-line arguments. Alert on any process creation that deviates from this allowlist, especially the launch of scripting engines like 'powershell.exe' or 'python.exe'. For any such alert, correlate the timestamp and source host with Zeek conn.log data for the subsequent 5 minutes. A high-entropy command line followed by a statistically significant spike in network connections from that host to other ICS devices is a strong indicator of automated collection script execution."
          },
          {
            "description": "A single host generates a high rate of successful network logon events (Type 3) to a specific ICS server, such as an OPC server or Data Historian. This rapid, repeated authentication pattern is symptomatic of an automated tool programmatically accessing and enumerating services via protocols like DCOM/RPC.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "OPC Servers, Data Historians, Domain Controllers servicing the ICS environment",
            "action": "On Windows-based ICS servers (e.g., OPC servers, historians), ingest Windows Event ID 4624 (An account was successfully logged on) and filter for Logon Type 3 (Network). For each source-destination pair, calculate the rate of these events per minute. Establish a baseline for this rate. An alert should be generated when the rate for any given pair exceeds 3 standard deviations from the historical norm, suggesting an anomalous authentication pattern potentially driven by an automated enumeration script. Correlate the source IP from the event with Zeek conn.log to verify the associated network traffic."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]