[
  {
    "information_requirement": "Is an adversary attempting to destroy critical operational data or system files to inhibit response functions in the ICS environment? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0809",
        "name": "Data Destruction",
        "evidence": [
          {
            "description": "Detection of process creation events (Windows Event ID 4688) on critical ICS assets where the `CommandLine` field matches known data destruction utility patterns or exhibits statistically anomalous string characteristics.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers (PCS)",
            "action": "1. **Symbolic Logic (IOC Match):** Continuously monitor for process creation events (Windows Event ID 4688) on all NAIs. Create and maintain a watchlist of known data destruction tool process names (e.g., `sdelete.exe`, `killdisk.exe`, `cipher.exe`) and suspicious command-line arguments (e.g., `/w`, `-z`, `format C:`). Alert immediately on any process execution or command-line argument matching this watchlist. 2. **Statistical Method:** Establish a 7-day rolling baseline for normal process execution frequency and unique command-line argument combinations for each NAI. Alert if a process's execution count or a command-line argument's usage exceeds the 99th percentile of its historical baseline within a 5-minute window, or if a new, previously unseen (0th percentile) process/argument combination appears. 3. **Machine Learning (Classification):** Employ an unsupervised anomaly detection model (e.g., Isolation Forest or One-Class SVM) trained on at least 90 days of baseline process creation data (features: process name, parent process name, command-line length, number of unique arguments, execution time of day). Trigger high-priority alerts for any new process execution classified as an outlier, indicating anomalous behavior for that specific ICS asset."
          },
          {
            "description": "Detection of a statistically significant surge in file deletion events (Windows Event ID 4663 with `Accesses: DELETE`) from a single `SubjectUserName` or `ProcessName` targeting critical ICS data directories within a defined time window (e.g., 5 minutes).",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Data Historians, ICS Backup Servers, Engineering Workstations (EWS) local storage",
            "action": "1. **Symbolic Logic (Rule-based):** Ensure object access auditing is enabled on critical file shares and directories containing ICS project files, configurations, and backups to generate Windows Event ID 4663. Configure a high-priority alert for any single `SubjectUserName` or `ProcessName` generating more than 50 `Accesses: DELETE` events within a 60-second period on any critical ICS data path. 2. **Statistical Method:** Calculate a 7-day rolling baseline for the average number of `DELETE` events per `SubjectUserName` and `ProcessName` per 5-minute interval across all NAIs. Trigger an alert if the current 5-minute count for any `SubjectUserName` or `ProcessName` exceeds 3 standard deviations from its rolling average, or if the number of deletions exceeds the 99.5th percentile of the baseline. 3. **Machine Learning (Time Series Anomaly Detection):** Apply a time-series anomaly detection algorithm (e.g., ARIMA or Prophet-based model) to the aggregated `DELETE` event counts per `SubjectUserName` and `ProcessName` to predict expected deletion volumes. Alert when actual deletion volumes deviate significantly (e.g., 99th percentile prediction interval breach) from predicted values, indicating an unusual and potentially malicious surge."
          },
          {
            "description": "Detection of `DELETE` events (Windows Event ID 4663) targeting files with specific, high-value ICS extensions (e.g., *.ACD, *.S7P, *.PCV, *.HMI) on critical ICS assets or backup locations.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), File servers hosting ICS project files and backups, Data Historians",
            "action": "1. **Symbolic Logic (IOC Match):** Create and maintain a watchlist of critical ICS file extensions (e.g., `.ACD`, `.S7P`, `.PCV`, `.HMI`, `.SCADA`, `.BAK_PLC`, `.DBF_HIST`, `.MDB`) and configure a high-priority alert for any Windows Event ID 4663 where `Accesses: DELETE` and `ObjectName` ends with one of these extensions. Additionally, identify known legitimate processes and users that perform these deletions and whitelist them. 2. **Statistical Method:** Establish a baseline of legitimate deletion events for these critical file types, noting the `SubjectUserName`, `Source Workstation`, and `Time of Day`. Alert immediately if a deletion occurs from a `SubjectUserName` or `Source Workstation` that has never (0th percentile) legitimately deleted such a file, or if the deletion occurs outside of established maintenance windows (e.g., 3 standard deviations from the average deletion time for that specific file type/user combination). 3. **Machine Learning (Classification):** Develop a supervised classification model (e.g., Decision Tree or Random Forest) trained on historical legitimate file deletions (if available) and known malicious deletion patterns. Features would include `SubjectUserName` entropy, `ProcessName` entropy, `ObjectName` extension, `Source Workstation` type (EWS vs. other), and `Time of Day`. Alert on events classified as malicious deletion with a high confidence score (e.g., >0.9)."
          },
          {
            "description": "Detection of file transfer events (Zeek files.log) from IT to OT/ICS networks where the transferred file is an executable (e.g., `mime_type` indicates executable, or `file_type` is PE32) and exhibits high Shannon entropy, unusual PE header characteristics, or matches known malicious hashes/signatures.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network boundary between IT and OT networks (e.g., ICS DMZ), Core ICS network segments, SCADA network segments",
            "action": "1. **Symbolic Logic (IOC Match):** Configure alerts for `Zeek files.log` entries where `mime_type` indicates an executable (e.g., `application/x-dosexec`, `application/x-msdownload`) or `file_type` is PE32 (from `pe.log`), and the `tx_hosts` (source) or `rx_hosts` (destination) are outside of a whitelist of approved IT/OT file transfer servers or designated software update repositories. Additionally, integrate with threat intelligence feeds to match `sha256` hashes from `files.log` against known malicious data destruction tools. 2. **Statistical Method:** Calculate the Shannon entropy for all transferred files identified as executables in `Zeek files.log`. Establish a baseline for normal entropy distribution based on legitimate ICS software. Alert on files where the entropy value exceeds the 95th percentile of the baseline distribution (e.g., >7.5 bits per byte), indicating potential packing or encryption. Correlate with `Zeek pe.log` for additional statistical anomalies in PE header fields like `num_sections`, `num_imports`, or `timestamp` (e.g., values falling outside 3 standard deviations of their historical mean). 3. **Machine Learning (Classification):** Employ a binary classification model (e.g., Logistic Regression or SVM) trained on `Zeek files.log` and `Zeek pe.log` features (e.g., file size, entropy, `mime_type`, `is_exe`, `num_sections`, `linker_time`, `imports` count, `exports` count, source/destination IP reputation). The model should be periodically retrained with new legitimate file transfers and known malicious samples. Alert on classifications indicating suspicious executable transfers from IT to OT with a high confidence score."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]