[
  {
    "information_requirement": "Is an adversary attempting to impact our industrial process by denying operator control? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0813",
        "name": "Denial of Control",
        "evidence": [
          {
            "description": "A sustained, high-volume flood of network traffic targeting a critical control system device (e.g., PLC, RTU), leading to resource exhaustion and unresponsiveness to legitimate commands.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS network segments, particularly network traffic to and from PLCs, RTUs, and HMIs.",
            "action": "Monitor Zeek conn.log for connections to critical ICS assets. Establish a baseline for normal traffic volume (orig_bytes, resp_bytes) and connection count per source/destination pair over 5-minute intervals. Generate an alert when the connection count or total bytes sent to a specific ICS device from a single source exceeds a statistical threshold (e.g., 3 standard deviations above the mean, or the 99th percentile). Correlate high traffic volumes with changes in connection states, such as a large number of 'S0' (SYN sent, no reply) or 'REJ' (connection rejected) states, which could indicate a SYN flood or resource exhaustion."
          },
          {
            "description": "An unauthorized but syntactically valid command (e.g., 'stop process', 'enter maintenance mode') is sent from a workstation to a control device, preventing further legitimate operator interaction.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), HMIs, and Domain Controllers.",
            "action": "Identify network connections from EWS/HMIs to PLCs/RTUs using Zeek conn.log, filtering for ICS-specific protocols and ports (e.g., TCP/502 for Modbus). Correlate the source IP and timestamp of these connections with user logon events (Windows Event ID 4624) and process creation events (Windows Event ID 4688) on the source workstation. Establish a baseline of which users, workstations, and processes are authorized to interact with specific PLCs. Alert on deviations, such as a non-operator account sending commands, a command originating from an unusual process, or control actions occurring outside of scheduled maintenance windows."
          },
          {
            "description": "The HMI or SCADA client software on an operator workstation crashes or hangs, preventing operators from monitoring or controlling the process. This may be caused by malformed data sent to the client application.",
            "data_sources": [
              "Windows Event ID 1000",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Operator workstations, Human-Machine Interfaces (HMIs), and Engineering Workstations (EWS).",
            "action": "On critical HMI and EWS endpoints, monitor for Windows Event ID 1000 (Application Error), specifically where the 'Faulting application name' is the HMI/SCADA software. Upon detection of a crash, automatically query Zeek conn.log for all network connections to the affected host in the 5 minutes preceding the crash timestamp. Analyze the source IPs and protocols of this traffic to identify anomalous or unexpected communication that could have triggered the software failure."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]