[
  {
    "information_requirement": "Is an adversary attempting to exploit our public-facing ICS applications for initial access? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0819",
        "name": "Exploit Public-Facing Application",
        "evidence": [
          {
            "description": "Anomalous inbound network traffic patterns, such as a sudden spike in connections or traffic volume from a rare geographic location, are observed targeting a public-facing ICS application.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ containing public-facing ICS applications (e.g., Historians, Web HMIs, Remote Access Gateways)",
            "action": "Filter Zeek conn.log for traffic to known public-facing ICS application servers. Establish a baseline of source IP geolocation, ASN, and daily connection volume. Use descriptive statistics (e.g., connections exceeding the 95th percentile) to identify outliers in connection counts or data volume from a single source. Simultaneously, search Zeek http.log URI and POST body fields for common web exploit patterns (e.g., SQL injection, command injection strings) or signatures of known ICS-related CVEs. Correlate findings with Zeek notice.log for events like 'Scan::Address_Scan' to prioritize suspicious sources."
          },
          {
            "description": "A public-facing ICS application spawns an anomalous child process (e.g., a shell or reconnaissance tool) shortly after receiving a suspicious external network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing ICS application servers (e.g., Windows-based HMI servers, data historians)",
            "action": "Correlate inbound network connections from Zeek conn.log to process creation events (Windows Event ID 4688) on the destination host within a short time window (e.g., 5 minutes). Establish a baseline of legitimate parent-child process relationships for the specific ICS application (e.g., `historian.exe` should not spawn `powershell.exe`). Create a high-fidelity alert for any deviation from this baseline, especially the creation of interactive shells (`cmd.exe`, `powershell.exe`) or common reconnaissance tools (`whoami.exe`, `ipconfig.exe`, `net.exe`) by the application process."
          },
          {
            "description": "A public-facing application server initiates an unexpected connection to an internal host within the ICS network, potentially indicating lateral movement after a successful exploit.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network boundary between the IT/DMZ and the OT/ICS network",
            "action": "Monitor Zeek conn.log for all connections originating from public-facing ICS application servers to internal ICS network segments. Create a baseline of all legitimate, expected connections (source host, destination host, destination port, protocol). Alert on any connection that deviates from this established baseline. Analyze the protocol and data volume of any anomalous connection to determine potential intent (e.g., SMB for file access, RDP for interactive access)."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]