[
  {
    "information_requirement": "Is an adversary using default credentials for lateral movement within the OT network? (TA0109 - Lateral Movement)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0812",
        "name": "Default Credentials",
        "evidence": [
          {
            "description": "A successful network connection to a critical ICS asset (e.g., PLC, RTU, IED) using a management or ICS protocol is followed by a successful authentication using a known default credential (e.g., 'admin', 'root', 'ics', 'operator'). The connection originates from an unauthorized source IP or network segment (e.g., IT network to OT network) not present in an established access control list or asset communication baseline. For protocols lacking explicit authentication logs, the evidence is the use of privileged function codes (e.g., Modbus 'Write Single Coil', DNP3 'Operate') from an unauthorized source. (Citation: Keith Stouffer May 2015) [1]",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek ftp.log",
              "Zeek telnet.log",
              "Zeek rdp.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek s7comm.log",
              "Sysmon Event ID 3",
              "ICS Asset Inventory",
              "Network Access Control Lists (ACLs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Level 1 (Process Control) and Level 2 (Supervisory Control) networks, specifically targeting PLCs, RTUs, HMIs, IEDs, and other field devices. Also, the IT/OT DMZ (Purdue Model Level 3.5), network traffic between Engineering Workstations and Level 2/1 devices, and connections to SCADA servers and Historian databases.",
            "action": [
              "Construct a correlation rule that joins network flow data (Zeek conn.log) with authentication logs (Zeek ssh.log, ftp.log, rdp.log) on connection UID. Trigger an alert if a connection to a destination IP on the critical ICS asset list uses a destination port associated with management protocols, and the authentication log shows a successful login with a username from a watchlist of default credentials. For protocols without authentication logs (e.g., Modbus, DNP3), alert when a protocol log (e.g., Zeek modbus.log) shows a 'write' or 'control' function code originating from a source IP not on the approved whitelist for that specific asset.",
              "For each critical ICS asset, profile the set of authenticated users and source IPs over a 30-day baseline. Calculate the frequency of each username. Create a risk score for each authentication event where $$ risk_score = 1 / (frequency + 1) $$. Alert on any successful authentication where the username is on the default credential list and the resulting risk score exceeds the 99th percentile of all scores for that asset, indicating a rare or first-time usage of a default account.",
              "Train an unsupervised graph-based anomaly detection model (e.g., using GraphSAGE) on a baseline of network traffic (Zeek conn.log). Represent the network as a graph where nodes are devices (IPs) and edges are connections, with features like protocol, port, and connection duration. The model learns normal communication patterns and node embeddings. In production, score new connections for anomalousness. Flag connections with high anomaly scores, especially those involving an authentication event with a default credential, as potential lateral movement."
            ]
          },
          {
            "description": "A successful interactive or remote logon (Windows Event ID 4624, Logon Type 2 or 10) to a high-value Windows-based OT asset (e.g., EWS, HMI, Jump Server) with a default or shared account is followed within a 5-minute window by the creation of a remote access process (Windows Event ID 4688: mstsc.exe, putty.exe; PowerShell Event ID 4104: Enter-PSSession) and a subsequent outbound network connection (Sysmon Event ID 3, Zeek conn.log) to another ICS device. This sequence deviates from the established user or host behavior baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "PowerShell Event ID 4104",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Jump Servers, Remote Access Servers, SCADA Servers, and Human-Machine Interfaces (HMIs) running Windows operating systems within the Process Control Network (PCN) or IT/OT DMZ.",
            "action": [
              "Create a SIEM rule that triggers on a successful logon (Windows Event ID 4624) where the `Account Name` is on a default/shared account watchlist and the target host is a critical OT asset. Correlate this event using the `Logon ID` with a subsequent process creation (Event ID 4688) for a remote access tool or a PowerShell script block log (Event ID 4104) containing remote access cmdlets, occurring within 5 minutes. Further enrich by correlating the source IP and timeframe with network connection logs (Sysmon Event ID 3 or Zeek conn.log) showing an outbound connection to another ICS asset IP.",
              "For each EWS and critical server, establish a 30-day baseline of process execution rarity and network connection rarity. For each user session (defined by Logon ID), calculate a session risk score by summing the negative log probabilities of each executed process and each destination IP connected to (rarer events have higher scores). Alert if a session initiated with a default/shared account has a risk score that exceeds the 98th percentile for that host or user, indicating a statistically anomalous sequence of actions.",
              "Implement a sequence-based anomaly detection model (e.g., an LSTM autoencoder) trained on event logs from EWS and jump servers. Each sequence represents a user session from logon to logoff, containing events like process creation and network connections. The model learns to reconstruct normal event sequences. Apply the trained model to live data; a high reconstruction error for a session indicates an anomaly. Prioritize alerts for anomalous sequences that are initiated by a default account and involve connections to sensitive ICS assets."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]