[
  {
    "information_requirement": "Is an adversary collecting data from our ICS information repositories? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0811",
        "name": "Data from Information Repositories",
        "evidence": [
          {
            "description": "Anomalous file access patterns, characterized by either: 1) A single user account or host accessing a statistically unusual volume of unique files (e.g., >50) within a short timeframe (e.g., 15 minutes) from a sensitive ICS repository. 2) Any access to files whose names or paths contain sensitive ICS-related keywords (e.g., 'SCADA_Schematic', 'PLC_Config', 'RTU_Manual').",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Sysmon Event ID 11",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Engineering Workstations (EWS), Document Management Systems (DMS), Project File Shares, Configuration Management Databases (CMDBs), and SharePoint/Confluence sites hosting ICS documentation.",
            "action": "1. Symbolic Logic: Ingest Windows Event ID 5145 and Zeek smb_files.log. Create a rule that triggers when 'Accesses' in Event 5145 includes 'ReadData' or the 'action' in smb_files.log is 'file_read'. The primary condition is a case-insensitive keyword match (e.g., 'SCADA', 'P&ID', 'RTU', 'PLC', 'HMI', 'Historian', 'Network_Diagram') within the 'RelativeTargetName' (EID 5145) or 'filename' (Zeek) fields. As a secondary condition to reduce false positives, verify that the 'TargetUserName' (EID 5145) or 'user' (Zeek) is NOT a member of a predefined Active Directory allowlist group for ICS documentation access. 2. Statistical Method: For each unique user ('TargetUserName'/'user') and source host ('SourceAddress'/'id.orig_h') pair, establish a 30-day rolling baseline of file access activity from NAIs. Calculate the 99th percentile for the count of unique files accessed ('RelativeTargetName'/'filename') within a 15-minute rolling window. Generate an alert if the current count for a user/host pair exceeds its established 99th percentile baseline. Additionally, calculate the Shannon entropy of file extensions accessed by a user in a 1-hour window; a sudden spike in entropy compared to the user's baseline indicates reconnaissance or data staging. 3. Machine Learning: Deploy a UEBA model (e.g., Isolation Forest) focused on file access from NAIs. Ingest Windows Event ID 5145, Sysmon Event ID 11, and Zeek smb_files.log. Engineer features for each access event: user, source host, target server, file path depth, file extension, time of day, day of week, is_keyword_match (binary), and is_outside_business_hours (binary). The model should learn normal access patterns for each user. Generate an alert when the anomaly score for a user's activity in a 1-hour window exceeds the 99.5th percentile of all scores, indicating a significant deviation from normal behavior."
          },
          {
            "description": "Anomalous outbound data transfer originating from a known ICS information repository. This is defined as a network session exceeding a volume threshold (e.g., >100MB) or a cumulative transfer from a single host exceeding an hourly threshold (e.g., >500MB) to a destination outside the defined ICS network, particularly to known cloud storage domains or IP addresses with no established business justification.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Historian Servers, Control System Databases (SQL, Oracle), OPC DA/HDA servers, ICS File Servers, and Engineering Workstations acting as data aggregation points.",
            "action": "1. Symbolic Logic: From Zeek conn.log, filter for connections originating from NAI IP addresses to destinations outside the defined ICS and corporate network address spaces. Correlate the destination IP ('id.resp_h') with a high-confidence threat intelligence feed of known malicious IPs. Generate a critical alert on any match. For other external connections, correlate the destination IP with Zeek dns.log to resolve the domain and with Zeek ssl.log to extract the SNI ('server_name'). Match the resolved domain/SNI against a list of unauthorized services (e.g., public cloud storage, webmail, paste sites). Generate a high-priority alert on a match where data was transferred ('orig_bytes' > 1KB). 2. Statistical Method: Using Zeek conn.log, establish a 30-day baseline for each NAI host ('id.orig_h'). Calculate two metrics: a) the 99th percentile of total outbound bytes ('orig_bytes') per hour to any non-ICS destination, and b) the 99th percentile of outbound bytes ('orig_bytes') for a single session. Generate an alert if a host's total outbound traffic in a 1-hour window exceeds its hourly baseline OR a hard threshold of 500MB. Generate a separate alert if any single session's outbound traffic exceeds its single-session baseline OR a hard threshold of 100MB. 3. Machine Learning: Implement a time-series anomaly detection model for network egress volume. For each NAI host, create a time-series dataset of total outbound bytes per 15-minute interval, aggregated from Zeek conn.log. Train a model (e.g., Prophet, to handle seasonality) on at least 90 days of historical data to learn the normal egress patterns for each host. In real-time, compare the actual outbound volume against the model's prediction and confidence interval. Generate an alert when the observed volume exceeds the upper bound of the model's prediction for two or more consecutive intervals."
          },
          {
            "description": "A successful logon to a critical ICS repository host (e.g., EWS, Historian) by either: 1) A user account not belonging to an authorized Active Directory group for that system. 2) A valid account exhibiting a combination of at least two anomalous factors, such as login from a rare geographic location, use of an unfamiliar source workstation, or occurrence outside of normal working hours.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Historian Servers, Human-Machine Interface (HMI) consoles, Domain Controllers, and Jump Servers within the ICS network.",
            "action": "1. Symbolic Logic: Monitor Windows Event ID 4624 on all NAI hosts. Generate a high-priority alert if a successful logon occurs where the 'TargetUserName' is NOT a member of an authorized AD group for that specific host role (e.g., 'Historian_Admins', 'EWS_Users'). Generate a medium-priority alert for any successful logon with 'LogonType' 10 (RemoteInteractive) from an account that is not on an explicit allowlist for remote access to ICS assets. 2. Statistical Method: For each user account, establish a 90-day baseline from Windows Event ID 4624 and Zeek conn.log data. The baseline should profile: a) common login hours, b) a set of common source geolocations, and c) a set of previously used source 'WorkstationName' values. For each new successful logon, score it based on deviations: +3 points for login outside normal hours (e.g., 22:00-05:00), +5 for login from a new country, +2 for login from a new source workstation name. Generate an alert if a single logon event accumulates a score of 5 or more, indicating a combination of anomalous factors. 3. Machine Learning: Train a classifier model (e.g., Random Forest) to distinguish between legitimate and suspicious logons using historical, labeled Windows Event ID 4624 data. Engineer features for each event: LogonType, IsAdmin (derived from group memberships), IsServiceAccount (from naming convention), TimeOfDay, DayOfWeek, IsNewSourceGeoIP (compared to user's 90-day history), IsNewSourceWorkstation (compared to user's 90-day history), and IsRemoteLogon (LogonType 10). Generate an alert when the model classifies a logon as 'suspicious' with a confidence score greater than 0.90."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]