[
  {
    "information_requirement": "Is an adversary collecting data from our ICS information repositories? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0811",
        "name": "Data from Information Repositories",
        "evidence": [
          {
            "description": "Anomalous access to a large number of files or specific sensitive files on ICS-related network shares, potentially indicating enumeration or bulk collection of schematics, manuals, or configuration documents.",
            "data_sources": [
              "Zeek smb_files.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Engineering Workstations, and Document Management Systems",
            "action": "For hosts identified as NAIs, monitor network share access (Windows Event ID 5145 and Zeek smb_files.log). Establish a baseline of file access count per source host over a 24-hour period. Alert when a host exceeds the 95th percentile of files accessed. Separately, create a high-priority alert for any access to files containing keywords indicative of sensitive ICS data (e.g., 'SCADA', 'RTU', 'schematic', 'diagram', 'HMI', 'PLC_config') from non-engineering or administrative hosts."
          },
          {
            "description": "Unusually large volume of data transferred from a known ICS information repository (e.g., Historian, Database, File Server) to a client host, inconsistent with normal operations.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historian Servers, Control System Databases, and critical file repositories",
            "action": "Filter Zeek conn.log for connections where the destination IP is a known NAI (e.g., Historian, DB Server) and the destination port is relevant (e.g., 445 for SMB, 1433 for MSSQL). For each NAI, establish a statistical baseline (mean, standard deviation, 99th percentile) of the 'resp_bytes' field for all connecting clients over a 30-day period. Trigger an alert when a single connection's 'resp_bytes' exceeds 3 standard deviations above the server's average or surpasses the 99th percentile, indicating a potential bulk data transfer."
          },
          {
            "description": "A user or service account, not typically associated with engineering or maintenance, successfully logs onto a critical repository host such as an Engineering Workstation or Historian.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Historian Servers, and Domain Controllers",
            "action": "Monitor for successful logon events (Windows Event ID 4624) on hosts within the NAI. Maintain a list of authorized user accounts for these systems. Generate an alert for any successful logon (Logon Type 2 for interactive or 3 for network) by an account not on the authorized list. Correlate this activity with subsequent file or network share access events from the same source host to increase confidence."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]