[
  {
    "information_requirement": "Is an adversary using default credentials for lateral movement within the OT network? (TA0109 - Lateral Movement)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0812",
        "name": "Default Credentials",
        "evidence": [
          {
            "description": "A successful network connection (`Zeek conn.log` `state_code` not 'REJ' or 'S0') is observed from a source IP to a known critical ICS device (e.g., PLC, RTU) on a common management port (e.g., 21, 23, 80, 443, 502) where the source IP address is either new to the destination device or outside of established baseline communication patterns for that specific port/service.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Level 1 and 2 Control Systems Networks (PLCs, RTUs, HMIs), DMZ between IT and OT networks, Network segments connecting IT and OT zones (Purdue Model Level 3.5)",
            "action": "1. **Symbolic Logic:** Identify all successful network connections (`state_code` not 'REJ' or 'S0') in `Zeek conn.log` to known ICS device IPs (e.g., PLCs, RTUs) on common management ports (e.g., 21, 23, 80, 443, 502). Cross-reference source IPs against a whitelist of authorized management hosts for each ICS device. Flag any connection from an unauthorized source IP as a high-fidelity alert. 2. **Statistical Method:** For each ICS device and management port, establish a baseline of typical source IPs and connection volumes (e.g., daily count of distinct source IPs) over the past 30 days. Use a statistical method (e.g., Z-score, 3 standard deviations) to identify when the number of distinct source IPs connecting to a single ICS device on a management port significantly deviates from its baseline. Additionally, identify when a single source IP connects to an abnormally high number (e.g., >95th percentile compared to other IPs) of distinct ICS devices within a 5-minute window. 3. **Machine Learning:** Apply an unsupervised machine learning algorithm (e.g., Isolation Forest or K-means clustering) on `Zeek conn.log` data, using features such as source IP, destination IP, destination port, connection duration, and byte volume for connections targeting ICS devices. Identify data points or clusters that are significantly different from established 'normal' patterns, indicating anomalous communication potentially associated with default credential abuse or lateral movement."
          },
          {
            "description": "A successful user login (Windows Event ID 4624) on an Engineering Workstation (EWS) is immediately followed (within 60 seconds) by the creation of a process associated with remote management (Windows Event ID 4688, e.g., 'pl_win.exe', 'putty.exe', 'ssh.exe', 'telnet.exe', 'ftp.exe'), which then initiates an outbound network connection (`Zeek conn.log`) from the EWS to a control system device on a standard management port, and this sequence of events deviates from the user's established behavioral baseline.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Jump Servers accessing OT network, Historian Servers",
            "action": "1. **Symbolic Logic:** Correlate `Windows Event ID 4624` (successful login) on EWS with `Windows Event ID 4688` (process creation) for known remote management tools (e.g., `pl_win.exe`, `putty.exe`, `ssh.exe`, `telnet.exe`, `ftp.exe`, `sftp.exe`) within a 60-second window, for the same `Logon_ID`. Further link these host events with outbound successful network connections (`Zeek conn.log`, `state_code` not 'REJ' or 'S0') from the EWS to known ICS device IPs (e.g., PLCs, RTUs) on management ports. Alert on any such correlated sequence involving a user account known to have default credentials or a connection to an ICS device from an EWS not typically used by that specific user. 2. **Statistical Method:** Establish a multi-faceted behavioral baseline for each user on EWS, including typical login times (e.g., working hours), source IPs (e.g., specific office subnet), and the frequency/type of remote management tools launched. For each new login and subsequent activity, calculate a deviation score by comparing current characteristics (login time, source IP, processes launched, destination OT device) against the user's historical profile. Use descriptive statistics (e.g., sum of Z-scores for each deviation from the norm) to identify logins with a cumulative deviation score exceeding a 99th percentile threshold, indicating high anomaly. 3. **Machine Learning:** Develop a User Behavior Analytics (UBA) model using historical `Windows Event ID 4624`, `4688`, and `Zeek conn.log` data from EWS. Train a classifier (e.g., Random Forest or Gradient Boosting) to distinguish between normal and anomalous user activity sequences (successful login -> process launch -> network connection). Features could include login time of day, source IP geolocation, process name, destination IP/port, user group, and historical frequency of such sequences. Flag sequences classified as anomalous with a high probability as potential default credential abuse."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]