[
  {
    "information_requirement": "Is an adversary exploiting software vulnerabilities in ICS devices to evade security controls? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0820",
        "name": "Exploitation for Evasion",
        "evidence": [
          {
            "description": "Anomalous network traffic targeting ICS devices, potentially indicating an exploit attempt or bypass of network segmentation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN), Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Network boundary between IT and OT networks",
            "action": "Establish a baseline of normal network communications (source/destination IP, port, protocol, connection duration, byte count) between EWS/HMIs and field devices (e.g., PLCs, RTUs) using Zeek conn.log. Use descriptive statistics (mean, median, standard deviation) to define normal traffic patterns for specific ICS protocols. Generate alerts for connections that are statistical outliers, such as connections from non-EWS assets to device engineering ports, unusually high data volume transfers, or connections to devices that have historically been stable. Cross-reference alerts with Zeek notice.log for signatures of known ICS exploits."
          },
          {
            "description": "Execution of unusual processes or scripts on Engineering Workstations or HMIs used to interact with or re-program control devices.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs)",
            "action": "On EWS and HMI systems, monitor for process creation (Windows Event ID 4688). Establish a baseline of legitimate engineering software and system utilities. Alert on the execution of non-standard tools, particularly network scanners, packet capture utilities, or scripting interpreters (e.g., powershell.exe) with suspicious command-line arguments. Calculate the entropy of command-line arguments to identify potential obfuscation. Correlate suspicious process execution with subsequent outbound network connections (Windows Event ID 5156) to ICS devices."
          },
          {
            "description": "Unauthorized transfer of firmware files to control system devices, suggesting an attempt to exploit firmware consistency checks or install malicious firmware.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN), Engineering Workstations (EWS)",
            "action": "Filter Zeek files.log for file transfers over common industrial protocols (e.g., FTP, TFTP, HTTP) with file extensions associated with firmware (.bin, .hex, .fw). Create a whitelist of authorized source systems (e.g., specific EWS) and known-good file hashes for legitimate firmware. Alert on any firmware file transfer originating from an unauthorized source, destined for an unusual number of devices, or having an unknown file hash. Analyze the corresponding Zeek conn.log record to identify the source, destination, and service used for the transfer."
          },
          {
            "description": "Disabling of security features or clearing of logs on Windows-based HMIs or EWS to hide malicious activity.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 7040"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), OT Domain Controllers",
            "action": "Create high-priority alerts for Windows Event ID 1102 (The audit log was cleared) on all critical HMI and EWS assets. Monitor for Windows Event ID 7040 (A service was installed in the system) or changes in service states for critical security tools (e.g., antivirus, EDR agent, host-based firewall). Correlate these events with preceding anomalous login activity (Windows Event ID 4624) or process execution (Windows Event ID 4688) to identify the source of the evasion activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]