[
  {
    "information_requirement": "Is an adversary using GUI-based remote access for execution on critical ICS hosts? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0823",
        "name": "Graphical User Interface",
        "evidence": [
          {
            "description": "An authenticated, successful remote interactive logon (Windows Event ID 4624, Logon Type 10) to an identified critical ICS host. Evidence includes the source IP address not matching an authorized IP range, the User ID or Account Name not belonging to an approved RDP user group, or the logon timestamp occurring outside of established operational hours or maintenance windows for that specific host or user account, based on asset and policy baselines.",
            "data_sources": [
              "Windows Event ID 4624 (Successful Logon)",
              "Windows Event ID 4625 (Failed Logon)",
              "Active Directory Security Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Workstations (OWS), ICS Domain Controllers, Jump Servers, Remote Access Gateways",
            "action": "1. Symbolic Logic: Step 1: Establish and maintain a baseline of critical ICS hosts, authorized remote access user accounts, authorized source IP ranges, and operational time windows for each host/user group within a CMDB or asset inventory system. Step 2: Query security logs for Windows Event ID 4624 where 'Logon Type' is 10 (RemoteInteractive) and 'Target Server Name' matches a critical ICS host. Step 3: For each matching event, compare the 'Source Network Address' against the authorized source IP ranges. Verify if the 'Account Name' is part of an authorized RDP user group (e.g., via Active Directory lookup). Compare the 'Logon Time' against the defined operational time windows for the specific 'Target Server Name' or 'Account Name'. Step 4: Generate a high-priority alert if any of these conditions are violated: unauthorized source IP, unauthorized user account, or logon outside operational hours.\n2. Statistical Method: Step 1: For each unique 'Account Name' and 'Source Network Address' observed in Windows Event ID 4624 (Logon Type 10) to critical ICS hosts, calculate the daily count of successful RDP sessions over a 30-day rolling window. Step 2: Establish a statistical baseline for each user's and source IP's average daily session count and average session duration (derived from pairing 4624/4634 or Zeek conn.log), along with their standard deviations, over the 30-day period. Step 3: Identify current daily session counts for a user or source IP that exceed the 95th percentile of their historical daily counts. Step 4: Identify current average session durations for a user or source IP that exceed their historical average by more than 2 standard deviations. Step 5: Generate an alert for any user or source IP exhibiting either of these statistical anomalies, indicating atypical remote access behavior.\n3. Machine Learning: Step 1: Prepare a dataset from historical Windows Event ID 4624 (Logon Type 10) data, including features such as 'Account Name', 'Source Network Address', 'Target Server Name', 'Time of Day (hour)', 'Day of Week', and 'Session Duration'. Label historical events as 'normal' or 'anomalous' based on past security incidents or policy violations. Step 2: Train a supervised machine learning model (e.g., Random Forest or Gradient Boosting) on this labeled dataset to classify new logon events. Step 3: Apply the trained model to new Windows Event ID 4624 (Logon Type 10) events in near real-time. Step 4: Generate a high-priority alert for events classified as 'anomalous', prioritizing alerts with a high model confidence score for the 'anomalous' class."
          },
          {
            "description": "Zeek conn.log entries showing RDP (TCP/3389) or VNC (TCP/5900-5906) connections to identified critical ICS assets. Evidence includes the 'id.orig_h' (source IP) not being present in an authorized remote access source IP allow-list, or the 'duration' of the connection or the sum of 'orig_bytes' and 'resp_bytes' exceeding the 99th percentile of historical interactive session activity for that specific 'id.resp_h' (destination host).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek x509.log",
              "Firewall logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, Demilitarized Zone (DMZ) Firewalls, Connections between IT and OT networks, Remote Access Gateways/VPN Concentrators, Perimeter Firewalls (IT/OT boundary)",
            "action": "1. Symbolic Logic: Step 1: Establish and maintain an inventory of critical ICS assets, their IP addresses, and an allow-list of authorized source IP addresses permitted to initiate RDP (TCP/3389) or VNC (TCP/5900-5906) connections to these assets. Step 2: Filter Zeek conn.log for connections where 'id.resp_p' is 3389 or in the range 5900-5906, and 'id.resp_h' is identified as a critical ICS asset. Step 3: For each matching connection, verify if the 'id.orig_h' is present in the authorized source IP allow-list for the specific 'id.resp_h'. Step 4: Generate a high-priority alert for any connection where the 'id.orig_h' is not found in the authorized allow-list, indicating an unauthorized remote access attempt.\n2. Statistical Method: Step 1: For authorized RDP/VNC connections (as identified by symbolic logic), collect historical data (e.g., 30-day rolling window) from Zeek conn.log for 'duration', 'orig_bytes', and 'resp_bytes', grouped by 'id.orig_h' and 'id.resp_h' pairs. Step 2: Calculate the 99th percentile and the mean plus 3 standard deviations for 'duration' and for the sum of 'orig_bytes' + 'resp_bytes' for each unique source-destination pair based on the historical data. Step 3: For new authorized RDP/VNC connections, compare their 'duration' and 'orig_bytes' + 'resp_bytes' against the established 99th percentile and mean + 3 standard deviations thresholds. Step 4: Generate an alert if either the connection duration or total bytes transferred significantly exceeds these thresholds, indicating unusually long or data-intensive interactive sessions that warrant investigation.\n3. Machine Learning: Step 1: Aggregate Zeek conn.log data to count the number of RDP/VNC connections (where 'id.resp_p' is 3389 or 5900-5906) per hour, grouped by 'id.orig_h' and 'id.resp_h'. Step 2: Train a time-series anomaly detection model (e.g., Isolation Forest or Prophet) on this aggregated historical connection count data for each source-destination pair to learn normal connection patterns. Step 3: Apply the trained model to real-time aggregated connection counts for RDP/VNC sessions. Step 4: Generate a high-priority alert when the model identifies a significant deviation (e.g., a sudden surge or drop in connections outside the predicted range) from the established baseline, indicating unusual remote access patterns that may suggest adversary activity."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]