[
  {
    "information_requirement": "Have adversary actions resulted in a disruption of critical industrial processes, leading to a loss of productivity and revenue?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0836",
        "name": "Modify Parameter",
        "evidence": [
          {
            "description": "A critical control system parameter (e.g., setpoint, trip point) is changed to a value outside of its established safe operating envelope, and this change is not associated with a scheduled maintenance or authorized operational adjustment.",
            "data_sources": [
              "Zeek modbus.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Supervisory Network (Level 2) and Engineering Workstations (EWS)",
            "action": "Monitor ICS protocol logs (e.g., Zeek modbus.log) for write commands (e.g., Modbus function codes 5, 6, 15, 16) targeting critical process parameters. Establish a baseline of normal value ranges and modification frequencies for key parameters. Alert on modifications that fall outside the 99th percentile of historical values or occur from an unauthorized source IP address (not a known HMI/EWS). Correlate the timestamp of the anomalous write command with process start events (Windows Event ID 4688) on Engineering Workstations to identify the potential source process."
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "A critical control system device (e.g., PLC, HMI, Historian) becomes unresponsive due to an abnormally high volume of network traffic, resulting in loss of view or loss of control.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control Network (Level 1/2) and critical controllers (PLCs, RTUs)",
            "action": "Using Zeek conn.log, establish a baseline for the volume and rate of connections (e.g., connections per second) to critical ICS devices like PLCs and HMIs. Monitor for statistically significant deviations from this baseline. For example, calculate the mean and standard deviation of connection volume per minute for each critical device IP. An alert should be generated if the connection volume exceeds 3 standard deviations above the mean. Further, analyze the `conn_state` field; a high ratio of 'S0', 'S1', or 'REJ' states for a target device can indicate a SYN flood or resource exhaustion DoS attack."
          }
        ]
      },
      {
        "technique_id": "T0855",
        "name": "Unauthorized Command Message",
        "evidence": [
          {
            "description": "A command message, such as a process stop or device restart, is sent to a control device from a source not authorized to issue such commands, or at a time inconsistent with planned operations, leading to an unexpected process halt.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Operator Stations (HMI), and the ICS Supervisory Network",
            "action": "Identify critical command messages within ICS protocol traffic (e.g., specific write requests in Zeek dnp3.log or modbus.log). Create a whitelist of authorized source IPs (EWS/HMI) and user accounts permitted to issue these commands. Alert on any critical command originating from an IP not on the whitelist. Correlate the source IP and timestamp with successful logins (Windows Event ID 4624) on network systems to identify the user account potentially responsible for the unauthorized command."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]