[
  {
    "information_requirement": "Has an adversary's action resulted in a disruption of critical industrial processes, leading to a measurable loss of productivity or revenue?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0836",
        "name": "Modify Parameter",
        "evidence": [
          {
            "description": "A write operation targeting a critical control system parameter, such as a Modbus holding register for a turbine speed setpoint or a DNP3 analog output for a valve position, is observed in Zeek ICS protocol logs. The modification is considered anomalous if: 1) The new parameter value falls outside of documented engineering safety limits. 2) The value deviates by more than 3 standard deviations from its 30-day rolling average. 3) The command originates from a source IP or user account (correlated via Windows Event ID 4624) not on the authorized asset and user allowlist. 4) The modification occurs outside a scheduled maintenance window without a corresponding change management ticket. 5) The parameter change is immediately followed by a process alarm or an anomalous physical state change in historian data.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Historian Process Data",
              "Change Management System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control Network (Purdue Model Levels 1 & 2) for PLC/RTU traffic; Engineering Workstations (EWS) and HMIs for host logs and command origination context; Process Historian servers for correlating network events with physical process impact.",
            "action": [
              "Create and maintain an allowlist of authorized source IPs (EWS/HMIs), user accounts, and critical parameter addresses/tags with their corresponding engineering safety value ranges. Query Zeek ICS logs (e.g., modbus.log for functions like 'write_single_register') targeting these critical addresses. Generate a high-severity alert if the source IP (`id.orig_h`) and associated user (from Windows Event ID 4624) are not on the allowlist OR if the written value (`data_val`) is outside the pre-defined safety limits. Cross-reference the alert timestamp with the change management system to suppress alerts for authorized activities.",
              "For each critical parameter tag, ingest its values from Zeek logs and historian data into a time-series database. Calculate a 30-day rolling baseline including mean and standard deviation for both the parameter value and the frequency of write operations per hour. Generate a medium-severity alert if a newly written value exceeds 3 standard deviations from the value baseline, or if the write frequency exceeds 3 standard deviations from the frequency baseline. Enrich alerts with user and process context from Windows Event ID 4688 to identify the parent process that initiated the command.",
              "Train a Random Forest classification model using features from Zeek ICS logs (source/destination IP, function, address, value), enriched with host data (user account from Win EVT 4624, parent process from Win EVT 4688) and contextual data (time-of-day, day-of-week). Label historical data as 'authorized' or 'malicious' based on incident reports and change management logs. Deploy the model to score new write events in real-time and alert on any event classified as 'malicious' with a confidence score above 0.9."
            ]
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "A critical ICS device (e.g., PLC, RTU) experiences a network-based service disruption over a 1-minute window, evidenced by: 1) A sustained increase in average round-trip time (RTT) of over 50% compared to its 7-day baseline in Zeek conn.log. 2) A connection failure rate where the count of connections with 'S0', 'S1', or 'REJ' states in Zeek conn.log exceeds 3 standard deviations above the baseline. 3) A high volume of ingress traffic (>10,000 packets/sec) from a single source IP, especially if traffic consists of a high percentage of ICMP messages or TCP SYN packets without a corresponding established connection. This network anomaly is correlated with a 'communication loss' alarm on an associated HMI or a gap in data reporting from the device to the process historian.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek tcp.log",
              "Zeek udp.log",
              "Zeek icmp.log",
              "HMI Alarm Logs",
              "Historian Process Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control and Supervisory Networks (Purdue Model Levels 1, 2, 3) to monitor traffic to/from critical controllers, servers, and HMIs; Network boundaries and gateways between IT and OT networks to detect cross-domain flood attempts.",
            "action": [
              "Implement a SIEM rule to alert when a single source IP (`id.orig_h` in Zeek conn.log) generates more than 1,000 connection attempts to a critical ICS device IP within 1 minute where the `conn_state` is 'S0' (SYN sent, no reply). Additionally, create a rule to alert if the packet count in Zeek icmp.log from a single source to a single critical destination exceeds 500 packets per second, or if the count of UDP packets with a payload size less than 64 bytes exceeds 1,000 packets per second.",
              "For each critical ICS device IP, establish a 30-day baseline from Zeek conn.log for average RTT, connection rate (connections/minute), and the ratio of failed connections ('S0','S1','REJ') to successful ones ('SF'). Alert if any metric exceeds 3 standard deviations from its baseline in a 5-minute rolling window. Concurrently, calculate the Shannon entropy of source IPs connecting to critical devices over 1-minute windows; alert if the entropy drops by more than 50% from its rolling 24-hour average, indicating a less random, more concentrated source of traffic.",
              "Deploy a time-series anomaly detection model, such as an LSTM autoencoder, trained on historical network flow metrics from Zeek conn.log for each critical ICS device. Use features like `orig_bytes`, `resp_bytes`, `orig_pkts`, `resp_pkts`, and counts of connection states per minute. The model will learn the normal 'heartbeat' of the device's network traffic. Generate an alert when the reconstruction error for live traffic exceeds a dynamically set threshold (e.g., the 99th percentile of reconstruction errors from a validation dataset), indicating a significant deviation from the learned normal pattern."
            ]
          }
        ]
      },
      {
        "technique_id": "T0855",
        "name": "Unauthorized Command Message",
        "evidence": [
          {
            "description": "A critical command message, such as a Modbus function code 0x05 (Write Single Coil) to an emergency stop relay or an EtherNet/IP 'Stop' command, is observed in Zeek ICS protocol logs. The command is considered unauthorized if: 1) It originates from a source IP or user account (correlated via Windows Event ID 4624) not on the documented allowlist for that specific command and target device. 2) The command occurs outside its normal operational window (e.g., after 10 PM local time) and lacks a corresponding change management ticket. 3) The command is part of a sequence that deviates from established operational workflows, such as a 'stop' command without a preceding 'ramp down' sequence.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4663",
              "Change Management System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and Operator Stations (HMI) for command origination context; ICS Control Network (Purdue Model Levels 1 & 2) for monitoring command transmission to PLCs/RTUs; Authentication Servers for user identity correlation; Change Management database for operational context.",
            "action": [
              "Maintain a granular allowlist of {source IP, user account, destination IP, command_type, target_address_range} tuples for authorized operations. Implement a real-time query on Zeek ICS protocol logs to generate a high-priority alert for any command that does not match an allowlist entry. Before finalizing the alert, automatically query the change management system API to check for an approved change record matching the command parameters and timeframe, suppressing the alert if one is found.",
              "For each authorized {user, command_type} pair, profile the timing (hour of day, day of week) and frequency of commands over a 30-day period to establish a statistical baseline. Alert if a critical command is issued at an hour that falls outside the 99th percentile of its typical execution time distribution. For command sequences, model the process workflow using a first-order Markov chain. Alert if a transition between two command states occurs that has a historically observed probability of less than 0.01, indicating a dangerously abnormal sequence of operations.",
              "Train a One-Class SVM model on feature vectors representing normal command sequences originating from authorized users. Engineer features to include source IP, categorical user ID, categorical command type, command parameters, and the time delta since the user's last command. Deploy the model to score new commands in real-time. Alert on any command identified as an outlier, and escalate the priority if the anomalous command is correlated with preceding anomalous host activity, such as unauthorized access to HMI project files (Windows Event ID 4663) on the source workstation within the last hour."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]