[
  {
    "information_requirement": "Is an adversary using GUI-based remote access for execution on ICS hosts? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0823",
        "name": "Graphical User Interface",
        "evidence": [
          {
            "description": "A successful remote interactive logon (Windows Event ID 4624, Logon Type 10) to a critical ICS host (defined by a pre-approved asset list) where the source IP address is not present in an authorized source IP whitelist, the user account is not a member of an authorized RDP user group, or the logon timestamp falls outside of pre-defined operational windows for that specific host or user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Workstations (OWS), ICS Domain Controllers, Jump Servers, Remote Access Gateways",
            "action": "1. Symbolic Logic: Step 1: Define and maintain a configuration management database (CMDB) or static list of critical ICS hosts, authorized user accounts for remote access, authorized source IP ranges for remote access, and specific operational time windows (e.g., maintenance schedules) for each critical host or user group. Step 2: Query Windows Security logs for Event ID 4624 where 'Logon Type' is 10 (RemoteInteractive). Step 3: For each matching event, compare 'Source Network Address' against the authorized source IP ranges. Compare 'Account Name' against authorized user accounts. Compare 'Logon Time' against the operational time windows for the destination host. Step 4: Generate a high-priority alert if any of these conditions are violated (e.g., unauthorized IP, unauthorized user, or logon outside operational hours).\n2. Statistical Method: Step 1: For each unique user and source IP observed in Windows Event ID 4624 (Logon Type 10), calculate the daily count of successful RDP sessions over a 30-day rolling window. Step 2: Establish a baseline for each user's and source IP's average daily session count and session duration, along with their standard deviations. Step 3: Identify instances where the current daily session count for a user or source IP exceeds the 95th percentile of their historical daily counts. Step 4: Identify instances where the average session duration for a user or source IP exceeds their historical average by more than 2 standard deviations. Step 5: Generate an alert for any user or source IP exhibiting either of these statistical anomalies.\n3. Machine Learning: Step 1: Train a supervised machine learning model (e.g., Random Forest, XGBoost) using historical Windows Event ID 4624 (Logon Type 10) data. Feature engineering should include: Account Name, Source Network Address, Destination Host, Time of Day (e.g., hour), Day of Week, Session Duration (derived from logout events or network logs). Label historical data as 'normal' or 'anomalous' based on past investigations or security policies. Step 2: Apply the trained model to new Windows Event ID 4624 (Logon Type 10) events in near real-time. Step 3: Generate a high-priority alert for events classified as 'anomalous'. Incorporate the model's confidence score, prioritizing alerts where the confidence in the 'anomalous' classification is high, or where the confidence in 'normal' is exceptionally low."
          },
          {
            "description": "Zeek conn.log entries indicating RDP (TCP/3389) or VNC (TCP/5900-5906) connections destined for known ICS assets (from an asset inventory) where the id.orig_h (source IP) is not present in an authorized remote access source IP whitelist, or where the duration of the connection or the sum of orig_bytes and resp_bytes exceeds the 99th percentile of historical interactive session activity for that specific destination host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, Demilitarized Zone (DMZ) Firewalls, Connections between IT and OT networks, Remote Access Gateways/VPN Concentrators, Perimeter Firewalls (IT/OT boundary)",
            "action": "1. Symbolic Logic: Step 1: Define and maintain an inventory of ICS assets and their IP addresses. Create an allow-list of authorized source IP addresses and destination ICS asset IP addresses permitted to establish RDP (TCP/3389) or VNC (TCP/5900-5906) connections. Step 2: Filter Zeek conn.log for connections where id.resp_p is 3389 or id.resp_p is in the range 5900-5906, and id.resp_h is an ICS asset. Step 3: For each matching connection, check if the id.orig_h and id.resp_h pair exists in the authorized allow-list. Step 4: Generate a high-priority alert for any connection that does not match the allow-list criteria.\n2. Statistical Method: Step 1: For RDP/VNC connections identified as authorized (from symbolic logic), collect historical data (e.g., 30-day rolling window) for duration, orig_bytes, and resp_bytes fields from Zeek conn.log, grouped by unique id.orig_h and id.resp_h pairs. Step 2: Calculate the 99th percentile and the mean plus 3 standard deviations for duration and for the sum of orig_bytes + resp_bytes for each unique source-destination pair. Step 3: For new authorized RDP/VNC connections, compare their duration and orig_bytes + resp_bytes against these established thresholds. Step 4: Generate an alert if either the connection duration or total bytes transferred exceeds the 99th percentile or the mean + 3 standard deviations, indicating unusually long or data-intensive interactive sessions.\n3. Machine Learning: Step 1: Aggregate Zeek conn.log data to count the number of RDP/VNC connections (id.resp_p 3389 or 5900-5906) per hour, grouped by id.orig_h and id.resp_h. Step 2: Train a time-series anomaly detection model (e.g., Isolation Forest or Prophet) on this aggregated historical connection count data for each source-destination pair. Step 3: Apply the trained model to real-time aggregated connection counts. Step 4: Generate a high-priority alert when the model identifies a significant deviation (e.g., a sudden surge or drop in connections outside the predicted range) from the established baseline, indicating unusual remote access patterns."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]