[
  {
    "information_requirement": "Is the adversary attempting to blind operators to the state of the industrial process by causing a Loss of View? (TA0105 - Impact) (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0829",
        "name": "Loss of View",
        "evidence": [
          {
            "description": "Observation of Windows Event ID 1000 (Application Error) or Windows Event ID 1002 (Application Hang) for a critical HMI process (e.g., view.exe, iFIX.exe, FactoryTalkView.exe) on an operator workstation or HMI server. This includes a frequency exceeding 3 events within a 60-second window, a sustained absence of expected process activity (e.g., 5+ minutes without Windows Event ID 4688 for the HMI process after a Windows Event ID 4689), or a lack of expected HMI application-specific log entries, indicating non-responsiveness.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Windows Event ID 4688",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Operator Workstations and HMI Servers within the Level 2 (Supervisory) and Level 3 (Control) zones of the Process Control Network (PCN), including any associated DMZ for remote HMI access.",
            "action": "1. Symbolic Logic: Create a watchlist of critical HMI executable names (e.g., view.exe, iFIX.exe, FactoryTalkView.exe). Query for Windows Event ID 1000 or 1002 where the 'Process Name' or 'Image Name' matches an entry on the watchlist. If 3 or more such events occur on the same host within a 60-second sliding window, generate a high-priority alert. Additionally, identify instances of Windows Event ID 4689 (Process Termination) for a critical HMI process. If a corresponding Windows Event ID 4688 (Process Creation) for the same HMI process is not observed on that host within 30 seconds, indicating an unexpected termination without immediate restart, generate an alert. 2. Statistical Method: For each critical HMI application process on each HMI host, establish a 7-day baseline for the average frequency of Windows Event ID 1000 and 1002 occurrences per 5-minute rolling window. Calculate the 99th percentile of this baseline. Trigger an alert if the current 5-minute frequency on any host/application pair exceeds this 99th percentile. Separately, for critical HMI processes expected to be continuously running, establish a baseline for the typical interval between consecutive Windows Event ID 4688 events (process creation, e.g., after an expected restart). If no Windows Event ID 4688 for a critical HMI process is observed on a host where it is normally active for a period exceeding 3 times its established maximum normal interval (e.g., 5 minutes if restarts are typically less than 90 seconds), generate an alert. 3. Machine Learning: Implement an unsupervised anomaly detection model (e.g., Isolation Forest) trained on historical time-series data streams. Input features should include the count of Windows Event ID 1000/1002 per HMI host per minute, and the count of Windows Event ID 4689 per HMI host per minute. The model should learn normal patterns of HMI application stability and restarts. An alert is generated when the model assigns an anomaly score above a predefined threshold (e.g., 0.7), indicating a significant deviation from normal HMI application behavior, such as an unusual surge in errors or unexpected, unrecovered terminations."
          },
          {
            "description": "Detection of a sustained (e.g., for 5 minutes or more) cessation or a statistically significant reduction (e.g., a drop below the 5th percentile of baseline volume) in the frequency or volume of established periodic network communication flows (e.g., Modbus/TCP, EtherNet/IP, OPC UA) from specific critical Level 0/1 devices (PLCs, RTUs) to Level 2/3 systems (Data Historian, HMI servers), as observed in Zeek network flow metadata or protocol-specific logs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek opcua.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical network segments (e.g., managed switches, industrial firewalls) at the Level 1.5 (Industrial Demilitarized Zone/IDMZ) and Level 2 (Supervisory) boundaries within the Process Control Network (PCN), specifically those carrying traffic between Level 0/1 devices (PLCs, RTUs) and Level 2/3 systems (HMI, Historian, Engineering Workstations).",
            "action": "1. Symbolic Logic: For each known critical PLC/RTU to Historian/HMI communication pair (e.g., src_ip='PLC_A_IP', dst_ip='Historian_IP', dst_port='502'), establish a baseline for its expected communication interval (e.g., every 5 seconds). Query Zeek conn.log or relevant protocol logs (modbus.log, enip.log) to detect if no new connection or protocol activity from that src_ip to dst_ip:dst_port has been observed for a period exceeding 3 times its normal interval (e.g., 15 seconds), triggering an immediate alert. 2. Statistical Method: For each critical PLC/RTU-to-Historian/HMI communication flow, calculate the 7-day rolling average of 'orig_bytes' and 'resp_bytes' from Zeek conn.log and the count of protocol-specific messages (e.g., modbus.log 'function_code' 0x03 read input registers) per minute. Establish a lower 5th percentile threshold for these metrics. An alert is triggered if the current 5-minute average for 'orig_bytes', 'resp_bytes', or message count for any flow drops below this 5th percentile, indicating a statistically significant reduction in expected data exchange. 3. Machine Learning: Implement a time-series forecasting model (e.g., SARIMA or Prophet) on the aggregated count of connections and total 'orig_bytes'/'resp_bytes' from Zeek conn.log for each critical PLC/RTU-to-Historian/HMI flow. Train the model on 30 days of historical data to predict expected traffic volumes and frequencies. An alert is generated when the observed traffic volume falls below the model's predicted lower confidence interval (e.g., 99% prediction interval) for a sustained period (e.g., 10 consecutive minutes), signifying an anomalous and persistent loss of communication."
          },
          {
            "description": "Observation of Zeek conn.log entries showing an abrupt and statistically significant surge (e.g., 10x increase over baseline within 60 seconds) in connection attempts to critical HMI server IP addresses and ports. This surge specifically includes conn_state values indicating failed connections (e.g., 'S0' - SYN sent, no reply; 'REJ' - connection rejected; 'RSTO' - RST originated by responder) or a high volume of Windows Event ID 5156 (Windows Filtering Platform Packet Drop) on HMI servers, suggesting a potential Denial-of-Service (DoS) or resource exhaustion attack.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments (e.g., industrial firewall interfaces, core switches) hosting critical HMI Servers within the Level 2 (Supervisory) zone of the Process Control Network (PCN) and any associated IDMZ or enterprise DMZ enabling remote access to HMI systems.",
            "action": "1. Symbolic Logic: Maintain a critical asset list of HMI server IPs and their expected open ports. From Zeek conn.log, count all connections to these HMI IPs where 'conn_state' is 'S0', 'REJ', or 'RSTO'. If the count of such failed connections from a single 'id.orig_h' to a single 'id.resp_h:id.resp_p' exceeds 30 within a 30-second window, or if the total count of failed connections to any HMI server exceeds 100 from multiple 'id.orig_h' within a 60-second window, generate a high-priority alert. Additionally, monitor for Windows Event ID 5156 on HMI servers where 'Direction' is 'Inbound' and 'Action' is 'Block' for connections to critical HMI ports; a count exceeding 50 events from a single source IP within a 60-second window should trigger an alert. 2. Statistical Method: For each HMI server IP, calculate the 5-minute rolling average of: (a) total new connections (conn_state 'S0', 'SF', 'OTH') and (b) the percentage of failed connections (conn_state 'S0', 'REJ', 'RSTO') out of total connections from Zeek conn.log. Establish a 7-day baseline for both metrics. Alert if: (a) the current 5-minute average for total new connections exceeds the 99th percentile of its baseline AND (b) the current 5-minute average for failed connection percentage exceeds the 95th percentile of its baseline, particularly if 'duration' is consistently low. Separately, for Windows Event ID 5156 on HMI servers, calculate the 5-minute rolling average of blocked inbound connections. Alert if this average exceeds the 99th percentile of its 7-day baseline. 3. Machine Learning: Implement an unsupervised anomaly detection model (e.g., Isolation Forest or One-Class SVM) on Zeek conn.log data targeting HMI servers. Extract features such as connection rate (conn.log count per minute), entropy of 'id.orig_h' (source IPs), entropy of 'id.resp_p' (destination ports), and the ratio of 'S0' to 'SF' 'conn_state' values. Train the model on 30 days of known normal traffic patterns. An alert is generated when the model assigns an anomaly score above a predefined threshold (e.g., 0.6), indicating traffic patterns significantly divergent from normal, characteristic of DoS or aggressive scanning."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]