[
  {
    "information_requirement": "Is an adversary exploiting software vulnerabilities in ICS devices to evade security controls? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0820",
        "name": "Exploitation for Evasion",
        "evidence": [
          {
            "description": "An anomalous network connection to or from an ICS asset (e.g., PLC, RTU, HMI) characterized by the use of a non-standard or unapproved protocol (e.g., RDP, SMB, FTP), a non-standard port for an approved protocol, or connection metrics (byte volume, packet count, duration) that deviate more than 3 standard deviations from an established 30-day baseline for the specific source-destination-port-protocol tuple.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dce_rpc.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN), Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Network boundary between IT and OT networks, Industrial Demilitarized Zone (IDMZ)",
            "action": [
              "Define and maintain an explicit whitelist of authorized source IPs (e.g., EWS, HMIs), destination ICS assets, and allowed protocol/port pairs for the OT network. Using Zeek conn.log, generate a high-priority alert for any connection that violates this whitelist, such as an unknown IP connecting to a PLC on TCP/502, or the use of forbidden protocols like RDP, SMB, or FTP to or from a critical ICS device. Correlate alerts with Zeek notice.log to match against known ICS exploit signatures.",
              "For each whitelisted source-destination-port-protocol tuple, establish a 30-day rolling baseline of normal connection behavior using Zeek conn.log data (orig_bytes, resp_bytes, duration). Calculate the mean and standard deviation for each metric. Generate an alert when a new connection's metric exceeds 3 standard deviations from its baseline mean or surpasses the 99th percentile, indicating an unusually large or long-lived connection that could be part of an exploit.",
              "Train a time-series anomaly detection model (e.g., Isolation Forest) on historical Zeek conn.log data (e.g., 90+ days) to learn the normal patterns of connection counts and total data volume per hour for critical ICS assets. Generate an alert when observed activity significantly deviates from the forecasted pattern, flagging potential coordinated or high-volume exploit attempts that may not be caught by per-connection statistical checks."
            ]
          },
          {
            "description": "Anomalous process creation on a critical ICS host (EWS, HMI) indicated by an unsigned executable, execution from a non-standard path (e.g., %TEMP%, C:\\Users\\Public), command-line arguments with Shannon entropy exceeding the 99th percentile of the host's baseline, or the use of a Living Off the Land Binary (LOLBin) with suspicious parameters (e.g., network connections, encoding).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Jump Servers within the OT network",
            "action": [
              "On critical ICS hosts (EWS, HMIs), generate an alert from Windows Event ID 4688 for any process creation where the executable is unsigned, is not on a pre-defined whitelist of approved engineering software, executes from a non-standard directory (e.g., %TEMP%, C:\\Users\\Public), or involves a LOLBin (e.g., certutil.exe, bitsadmin.exe) with suspicious arguments like 'encode', 'decode', or URLs. Correlate with Windows Event ID 5156 to prioritize processes making outbound network connections.",
              "For each host, establish a baseline of command-line argument characteristics from historical Windows Event ID 4688 data. Calculate the Shannon entropy for every new command line and generate an alert if the entropy score exceeds the 99th percentile of the host's baseline, indicating potential obfuscation. Additionally, baseline parent-child process relationships and alert on any new relationship that is statistically rare (e.g., falls in the bottom 1st percentile of frequency), such as an HMI application unexpectedly spawning cmd.exe.",
              "Deploy a process behavior classification model (e.g., Random Forest) trained on labeled Windows Event ID 4688 data from the ICS environment. Use features such as process name, parent process, execution path, command-line entropy, and user context to classify each new process as 'benign' or 'suspicious'. Alert on any process classified as suspicious with a high confidence score (e.g., > 0.8) for analyst review."
            ]
          },
          {
            "description": "Anomalous transfer of firmware (.bin, .hex), configuration (.xml, .cfg), or project files (.prj, .acd) to or from an ICS device, indicated by an unauthorized source IP, a file hash (SHA256) that does not match a known-good baseline, or a transfer occurring outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN), Engineering Workstations (EWS), Industrial Demilitarized Zone (IDMZ) for firmware update servers, OT File Servers",
            "action": [
              "Maintain a strict inventory of approved firmware/project files (by SHA256 hash), authorized source systems (EWS IPs), and designated maintenance windows. Using Zeek files.log and Windows Event ID 4663 (for file shares), generate a high-priority alert for any transfer of a critical file type (.bin, .hex, .acd, etc.) that does not match a known-good hash, originates from an unauthorized IP, or occurs outside of a scheduled maintenance window.",
              "Analyze Zeek files.log to monitor file transfer patterns. Generate an alert if the same firmware or project file (by hash) is transferred to an unusually high number of devices in a short time frame (e.g., fan-out exceeding the 99th percentile of devices per hour), which could indicate widespread malicious deployment. Also, baseline the size of legitimate firmware files and alert if a transferred file's size deviates significantly (e.g., > 3 standard deviations) from the expected size for that file type.",
              "Train a classification model (e.g., LightGBM) to assess the risk of each file transfer event. Use features from Zeek files.log and conn.log, such as source/destination IP, protocol, file extension, filename entropy, time of day, and a binary feature indicating if the transfer is within a maintenance window. Alert on any transfer classified as malicious with a high probability score (e.g., > 0.85)."
            ]
          },
          {
            "description": "Direct evidence of security control tampering on a critical ICS host (EWS, HMI), including the clearing of security audit logs (Windows Event ID 1102), stopping or disabling of a security service (Windows Event ID 7040), or unauthorized modification of system audit policies (Windows Event ID 4719) or security-related registry keys (Windows Event ID 4657).",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 7040",
              "Windows Event ID 4719",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Windows Servers within the ICS network, OT Domain Controllers",
            "action": [
              "Generate an immediate, non-suppressible alert for the occurrence of Windows Event ID 1102 (The audit log was cleared) on any critical ICS host. Additionally, create alerts for Windows Event ID 7040 when a critical security service (e.g., Sysmon, 'WinDefend', EDR agent) is stopped or disabled, and for Event IDs 4719 or 4657 indicating unauthorized changes to audit policies or security-related registry keys.",
              "Establish a baseline for the hourly log volume from each critical host. Generate an alert if the log volume for a host drops by a significant percentage (e.g., >90%) within one hour, as this may indicate log tampering even if Event ID 1102 is absent. Separately, track the frequency of service state changes (Event ID 7040) and alert on any change to a security service that is historically rare (e.g., below the 1st percentile of occurrence).",
              "Implement a sequence analysis model (e.g., Hidden Markov Model or LSTM) trained on normal sequences of Windows Event IDs from EWS/HMI hosts. The model should learn typical user and system behavior. Generate a high-risk alert when the model detects an anomalous sequence, such as an unusual login (4624) followed by a suspicious process creation (4688) and then a security service being disabled (7040) within a short time window."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]