[
  {
    "information_requirement": "Have adversary actions resulted in a disruption of critical industrial processes, leading to a loss of productivity and revenue?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0836",
        "name": "Modify Parameter",
        "evidence": [
          {
            "description": "A critical control system parameter (e.g., Modbus register value, DNP3 point value, EtherNet/IP tag) is written to a value that falls outside the established safe operating limits, or a significant deviation from its historical operational range, specifically when not correlated with a documented change management request or authorized maintenance window.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control Network (Level 1/2) for protocol logs; Engineering Workstations (EWS) for host logs; Historian Servers for process data.",
            "action": "1. **(Symbolic Logic)** Monitor ICS protocol logs (e.g., Zeek modbus.log, dnp3.log, enip.log) for write commands (e.g., Modbus function codes 5, 6, 15, 16; DNP3 write functions; EtherNet/IP explicit/implicit writes) targeting known critical process parameters. Establish a whitelist of authorized source IPs and user accounts (correlating with Windows Event ID 4624 on EWS) for these write operations. Alert on any write command from an unauthorized source. 2. **(Statistical Method)** For each critical parameter identified, calculate its historical operating range (e.g., 5th to 95th percentile) and typical modification frequency from relevant ICS protocol logs. Alert if a parameter value is written outside this established percentile range, or if the rate of modification for a parameter exceeds 3 standard deviations from its historical average within a 5-minute rolling window. 3. **(Machine Learning)** Apply a time series anomaly detection model (e.g., Isolation Forest or ARIMA) to the values of critical ICS parameters over time. Train the model on historical 'normal' operation data. Generate an alert when the model detects a statistically significant anomaly in the parameter's value or its rate of change, indicating a deviation from expected behavior not explained by known operational cycles. Correlate these anomalies with process creation events (Windows Event ID 4688) on associated EWS to identify potential originating processes."
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "A critical control system device (e.g., PLC, HMI, Historian) exhibits a sudden and sustained degradation in network response time, an abnormally high volume of ingress network traffic (e.g., connection attempts, fragmented packets), or a significant increase in connection failures (e.g., SYN-ACK timeouts, RST flags), leading to loss of view or control as observed in network flow data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek tcp.log",
              "Zeek udp.log",
              "Zeek icmp.log",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control Network (Level 1/2) for network traffic; Critical ICS Devices (PLCs, RTUs, HMIs, Historians) for device status.",
            "action": "1. **(Statistical Method)** Using Zeek conn.log, establish a baseline for the volume (connections per second) and rate of connection failures (e.g., ratio of 'S0', 'S1', 'REJ' states to 'SF' states) to critical ICS device IPs. Monitor for deviations from this baseline exceeding 3 standard deviations over a 1-minute rolling window. 2. **(Symbolic Logic)** Analyze Zeek tcp.log and udp.log for an abrupt increase in packet size or fragmentation to critical ICS devices, or a sustained high volume of traffic from a single, unapproved source IP. Specifically, identify patterns indicative of SYN floods (high count of 'S0' states in conn.log without corresponding 'SF') or UDP floods (high volume of UDP traffic to common service ports from a single source in udp.log). Alert if traffic volume from an unknown source to a critical device exceeds 1000 packets per second. 3. **(Machine Learning)** Implement a time series anomaly detection model on network traffic volume (bytes/packets per second) to and from critical ICS devices, using Zeek conn.log. Train the model on historical data. An alert is generated when the model detects an unusual surge or drop in traffic volume that deviates significantly from the predicted pattern, which could indicate a DoS or network disruption. Correlate with Windows Event ID 4697 (Service Installation) on EWS/HMI to detect new services potentially related to attack tools."
          }
        ]
      },
      {
        "technique_id": "T0855",
        "name": "Unauthorized Command Message",
        "evidence": [
          {
            "description": "A command message that directly impacts process operation (e.g., emergency stop, device restart, pump shutoff, valve closure) is observed in ICS protocol logs, originating from an IP address or user account not on an authorized whitelist, or occurring outside of predefined operational schedules and documented change management windows.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Operator Stations (HMI), PLC/RTU Networks, ICS Supervisory Network (Level 2).",
            "action": "1. **(Symbolic Logic)** Identify known critical command messages (e.g., specific Modbus write commands for process halts, DNP3 freeze/reset commands, EtherNet/IP shutdown requests) within Zeek modbus.log, dnp3.log, or enip.log. Create a strict whitelist of authorized source IPs (EWS/HMI) and authenticated user accounts (from Windows Event ID 4624) permitted to issue these commands. Alert immediately on any identified critical command originating from a non-whitelisted IP or user. 2. **(Statistical Method)** Establish a baseline for the frequency and timing of critical command messages from authorized sources. Calculate the entropy score for the source IPs and command types observed over a 1-hour window. A sudden drop in entropy (e.g., many identical commands from a single new source) or commands occurring outside the 99th percentile of normal operational hours should trigger an alert. 3. **(Machine Learning)** Utilize a behavioral analytics model (e.g., clustering or supervised classification) to profile typical command sequences and user interaction patterns on HMIs and EWS (leveraging Windows Event ID 4624 and 4663 for object access related to HMI applications, combined with ICS protocol logs). Train the model to recognize 'normal' sequences of commands and user activities. Alert on command messages that deviate significantly from established normal operational sequences or user behavior profiles, indicating an anomalous or potentially unauthorized command chain. Correlate with file access logs (Windows Event ID 4663) on EWS for unauthorized access to HMI configuration files."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]