[
  {
    "information_requirement": "Has an adversary modified the execution flow or tasking of an ICS controller? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0821",
        "name": "Modify Controller Tasking",
        "evidence": [
          {
            "description": "Detection of specific ICS protocol function codes (e.g., S7comm 'Download block' (function code 0x1A), 'Start/Stop program' (0x1C), 'Write variable' (0x1D); Modbus 'Write Multiple Registers' (0x10), 'Write Multiple Coils' (0x0F); EtherNet/IP 'Write Tag' (0x4B)) in Zeek logs (s7comm.log, modbus.log, enip.log) where the source IP address is not on the authorized Engineering Workstation (EWS) whitelist, or when these commands are observed outside of predefined maintenance windows or documented operational schedules (e.g., 08:00-17:00 local time).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments within the Process Control Network (PCN) where Engineering Workstations communicate directly with Programmable Logic Controllers (PLCs) and Distributed Control Systems (DCS).",
            "action": "1. **Symbolic Logic (IOC Match):** Configure SIEM rules to detect specific function codes within Zeek ICS protocol logs (e.g., `s7comm.log` for S7comm 'Download block' (0x1A), 'Start/Stop program' (0x1C), 'Write variable' (0x1D); `modbus.log` for 'Write Multiple Registers' (0x10), 'Write Multiple Coils' (0x0F); `enip.log` for 'Write Tag' (0x4B)). Establish a whitelist of authorized source IP addresses for Engineering Workstations (EWS) and authorized destination controller IP addresses. Generate an alert if any of these function codes are observed originating from an IP not on the EWS whitelist, or if the destination controller IP is not typically associated with programming activity (e.g., a critical production PLC without recent change management approval). Enrich alerts with `Zeek conn.log` for source/destination ports and service details.\n2. **Statistical Method (Frequency Anomaly):** Establish a 90-day historical baseline for the count of ICS program modification function codes (as defined in Symbolic Logic) per source EWS IP address and destination controller IP address, segmented by hour of day and day of week. Calculate the mean (μ) and standard deviation (σ) for the frequency of these commands during specific operational shifts or maintenance windows. Implement a detection that flags any instance where the observed frequency of these commands for a given EWS-controller pair, in a specific time window, exceeds `μ + (3 * σ)`. This identifies statistically significant deviations from normal programming activity. Correlate with `Zeek conn.log` to identify unusual connection durations or byte transfers.\n3. **Machine Learning (Time-Series Anomaly Detection):** Deploy a time-series anomaly detection model (e.g., ARIMA, Prophet, or Isolation Forest) on aggregated counts of ICS program modification function codes (from `s7comm.log`, `modbus.log`, `enip.log`) per controller over 15-minute intervals. Train the model on 60-90 days of historical data representing normal operational and maintenance periods. Configure the model to generate an anomaly score. Trigger an alert when the anomaly score for a specific controller exceeds the 99th percentile of historical anomaly scores, indicating an unexpected surge or change in program modification activity. Enrich alerts by correlating with `Zeek conn.log` to identify the source IP and `Zeek notice.log` for any related policy violations, and reference change management records."
          },
          {
            "description": "Detection of known ICS engineering software process executions (e.g., `TIA Portal.exe`, `Studio 5000.exe`, `Unity Pro.exe`, `Step7.exe`) on an Engineering Workstation (EWS) via `Windows Event ID 4688` (Process Creation). This evidence is particularly strong when the process is initiated by a user account not on an authorized whitelist, outside of established operational hours (e.g., 08:00-17:00 local time), or from an unusual parent process (e.g., `cmd.exe`, `powershell.exe`, or a web browser instead of `explorer.exe`). It is further strengthened by `Windows Event ID 4624` (Successful Logon) indicating an anomalous login, and co-occurrence with `Zeek conn.log` showing outbound connections from the EWS to ICS controller IP addresses within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Dedicated Engineering Workstations (EWS) within the ICS network.",
            "action": "1. **Symbolic Logic (Whitelist/Blacklist):** Configure SIEM rules to monitor `Windows Event ID 4688` (Process Creation) on EWS for specific ICS engineering software executables (e.g., `TIA Portal.exe`, `Studio 5000.exe`, `Unity Pro.exe`, `Step7.exe`). Create a whitelist of authorized user SIDs (from `Windows Event ID 4624` and `4672`) permitted to execute these applications on each EWS. Additionally, create a blacklist of suspicious parent processes (e.g., `cmd.exe`, `powershell.exe`, `mshta.exe`). Generate an alert if an ICS engineering software process is executed by a user not on the whitelist, or if its parent process is on the blacklist. Enrich alerts with `Zeek conn.log` for any immediate outbound connections to ICS controller IPs.\n2. **Statistical Method (Time-Based Anomaly):** For each authorized user on each EWS, establish a 60-day historical baseline of their typical login times (`Windows Event ID 4624`) and ICS engineering software execution times (`Windows Event ID 4688`). Calculate the 5th and 95th percentiles for the start and end times of these activities. Generate an alert if an ICS engineering software process is executed by an authorized user, but the execution time falls outside their established 5th-95th percentile window (e.g., a user who normally works 08:00-17:00 executes `TIA Portal.exe` at 02:00). Prioritize alerts where this temporal anomaly correlates with `Zeek conn.log` showing new or unusual connections to ICS controller IPs within a 5-minute window.\n3. **Machine Learning (User Behavior Analytics - UBA):** Implement a UBA model (e.g., Isolation Forest or K-Means Clustering on feature vectors) that profiles normal activity for each authorized user on each EWS, using features derived from `Windows Event ID 4624` (login patterns, source workstations), `Windows Event ID 4688` (frequently executed applications, process lineage), and `Zeek conn.log` (typical network destinations, data volume). Train the model on 90 days of historical data. The model should calculate a deviation score from the user's established baseline. Generate an alert when a user's activity (e.g., executing `Studio 5000.exe` from an unusual workstation, followed by an outbound connection to a critical PLC at an atypical time) results in a deviation score exceeding a predefined threshold (e.g., top 1% of historical scores), indicating a potential compromised account or insider threat."
          },
          {
            "description": "Detection of discrepancies between the current operational configuration of an ICS controller and its established baseline configuration, specifically the addition of new tasks, modification of existing task properties (interval, frequency, priority), or altered program associations. This is identified through: 1) Periodic polling of controller configuration via ICS protocols (e.g., S7comm, Modbus) and comparison of retrieved configuration data against a known-good baseline (e.g., using cryptographic hashes). 2) Parsing `Zeek s7comm.log` (or other relevant ICS protocol logs) for explicit configuration change messages (e.g., S7comm 'Write block' (0x19) or 'Download block' (0x1A) for configuration areas, or 'Read/Write System Data' functions) that indicate modifications to task lists, program organization unit (POU) associations, or task priorities.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Controller internal logs (if available via remote access/Syslog)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Directly on Programmable Logic Controllers (PLCs) and Distributed Control Systems (DCS) themselves, or the network segments facilitating their communication for configuration polling.",
            "action": "1. **Symbolic Logic (Baseline Deviation):** Implement a script or configuration management tool to periodically (e.g., hourly) query critical ICS controllers (PLCs, DCS) via their native protocols (e.g., S7comm 'Read Block' (0x18), Modbus 'Read Holding Registers' (0x03) for configuration areas) to retrieve active task lists, program associations, and task priorities. For each controller, maintain a known-good baseline configuration file and its cryptographic hash (e.g., SHA-256) in a secure configuration repository. Upon each query, calculate the hash of the retrieved configuration. Generate an immediate alert if the newly calculated hash does not match the stored baseline hash, indicating an unauthorized or unexpected configuration change. Enrich the alert with details from `Zeek s7comm.log` or other ICS logs if a corresponding write operation was observed.\n2. **Statistical Method (Rate Anomaly):** For controllers that log configuration changes via network messages (detectable in `Zeek s7comm.log` for S7comm 'Write block' (0x19), 'Download block' (0x1A), 'Write system data' (0x28)), establish a 30-day baseline of the typical frequency of these configuration modification messages per controller, segmented by hour of day. Calculate the moving average (MA) and standard deviation (SD) of these event counts over a 24-hour window. Generate an alert if the count of configuration modification messages for a specific controller within a 15-minute interval exceeds `MA + (2 * SD)`, indicating an unusually high or unexpected rate of configuration changes that could point to malicious activity.\n3. **Machine Learning (Configuration Change Classification):** Develop a supervised classification model (e.g., Random Forest, Gradient Boosting) trained on historical controller configuration change events. Label historical events as 'normal maintenance' (e.g., approved changes, scheduled updates) or 'anomalous' (e.g., unapproved changes, known malicious patterns). Features for the model should include: type of change (e.g., task added, priority modified, POU association changed), affected controller ID, time of day, day of week, originating EWS IP, and presence of corresponding `Windows Event ID 4688` (engineering software execution) and `Zeek conn.log` entries (EWS to controller communication). The model should classify new configuration changes. Trigger an alert for any 'anomalous' classification, providing a high-fidelity detection of malicious tasking modifications. Further enrich by correlating with change management tickets to reduce false positives."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]