[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via external remote services? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0822",
        "name": "External Remote Services",
        "evidence": [
          {
            "description": "A successful login event (Windows Event ID 4624) to an ICS-facing remote access service, where the Logon Type is 10 (RemoteInteractive) or 3 (Network), and at least two of the following anomalous characteristics are met: 1. The Source_Network_Address has no successful login history for the Target_User_Name in the last 90 days. 2. The geolocated country or Autonomous System Number (ASN) of the Source_Network_Address (from Zeek conn.log correlated with geoIP data) is new for that Target_User_Name in the last 90 days. 3. The Logon_Time occurs during a time of day (e.g., 10 PM - 5 AM local time) or day of the week (e.g., Saturday, Sunday) that is statistically rare for that specific user or user role. 4. The user-agent string (from Zeek http.log for web-based remote access) is new for the user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Demarcation Zone (DMZ), VPN Concentrators, Remote Access Gateways, Jump Boxes, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Authentication Servers within the ICS DMZ, Network traffic flows between Purdue Model Level 4 (Corporate) and Level 3 (Site Operations)",
            "action": [
              "For each successful remote login (Windows Event ID 4624, Logon Type 3 or 10) to a critical ICS-facing asset: 1. Correlate the Source_Network_Address with Zeek conn.log to enrich with connection details and a GeoIP database to get country/ASN. 2. Check if the Source_Network_Address is on a known malicious IP threat intelligence list; if so, generate a CRITICAL alert. 3. Check if the user's role and the target asset have a pre-defined geographic or IP-based access policy. Alert if the login violates this policy. 4. For privileged accounts, alert on any successful login from a country or ASN not seen for that user in the past 90 days.",
              "For each user, maintain a 90-day rolling baseline of remote access activity, including: a) a set of historically observed source countries and ASNs, b) a distribution of login times by hour-of-day and day-of-week, and c) a set of known user-agent strings. For each new login, calculate a risk score. Add points for deviations: +20 for a new country, +15 for a new ASN, +10 for a login time outside the user's 5th-95th percentile for that day, +5 for a new user-agent. Generate a HIGH alert if the cumulative score exceeds a defined threshold (e.g., 25), indicating multiple simultaneous anomalies.",
              "Develop and train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled historical login data (Windows Event ID 4624). Engineer features such as: cyclical representations of logon hour and day-of-week (sin/cos transforms), one-hot encoded source country, source ASN risk score, a boolean for whether the source IP is new to the user, a boolean for whether the user-agent is new, and the user's role/privilege level. The model will output a probability score (0-1) of the login being malicious. Flag all logins with a score > 0.9 for immediate analyst review."
            ]
          },
          {
            "description": "A single Source_Network_Address generates a high volume of failed login attempts (Windows Event ID 4625) against one or more accounts on an ICS remote access service. This is specifically defined as: 1. Brute Force: More than 10 failed login attempts against a single Target_User_Name within a 60-second window, with Status code 0xC000006D and Sub_Status_Code 0xC000006A (bad password). 2. Password Spraying: Failed login attempts from the same Source_Network_Address against more than 15 distinct Target_User_Name accounts within a 10-minute window.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Active Directory Domain Controllers, RADIUS), VPN Concentrators, Remote Access Gateways, ICS/OT Firewalls logging traffic at the boundary between the Enterprise network (Purdue Level 4) and the ICS DMZ (Purdue Level 3.5)",
            "action": [
              "Create a SIEM rule that triggers on Windows Event ID 4625 where the target asset is an ICS remote access service. The rule should aggregate by Source_Network_Address over a 10-minute sliding window. Generate a HIGH alert under two conditions: a) (Brute Force) IF the count of events for a single Target_User_Name > 10 within any 60-second sub-window. b) (Password Spray) IF the count of distinct Target_User_Name > 15 within the 10-minute window. Escalate alert priority if targeted accounts are identified as privileged ICS roles.",
              "For each remote access gateway, establish a 30-day baseline for the rate of failed logins per minute (from Windows Event ID 4625). Alert if the current rate exceeds the 99th percentile of this historical distribution. Additionally, for each 10-minute window, calculate the Shannon entropy of Target_User_Names grouped by Source_Network_Address. A high entropy value for a single source IP indicates it is attempting to log into many different accounts, characteristic of password spraying. Alert if an IP's entropy score is more than 3 standard deviations above the mean entropy for all source IPs in that time window.",
              "Utilize a density-based clustering algorithm (e.g., DBSCAN) on failed login events (Windows Event ID 4625) aggregated over a 1-hour period. For each Source_Network_Address, create a feature vector including: log10 of total failed logins, the number of unique target users, the ratio of 'bad password' (0xC000006A) to 'user not found' (0xC0000064) failures, and the standard deviation of timestamps between attempts. This will automatically group coordinated attack sources. Clusters with a high unique user count can be automatically labeled 'Password Spraying,' while clusters with a low unique user count but high failure count can be labeled 'Brute Force'."
            ]
          },
          {
            "description": "Following a successful remote access login (Windows Event ID 4624), the user's session exhibits anomalous post-access behavior within the ICS network, such as: 1. The user's source IP initiates connections to an unusually high number of distinct internal ICS hosts or ports. 2. The session involves the use of restricted ICS protocol function codes (e.g., Modbus 'Write Single Register'). 3. The session's total data transfer volume significantly exceeds the user's historical average. 4. The user's account initiates suspicious processes (e.g., network scanners, scripting interpreters) on the remote endpoint. 5. The session accesses or modifies files on a critical file share that are outside the user's normal job function.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Windows Event ID 4688",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal ICS Network Segments, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Data Historians, Programmable Logic Controllers (PLCs), Safety Instrumented System (SIS) interfaces, Internal DNS servers, ICS Application Servers",
            "action": [
              "Correlate a successful remote login (Windows Event ID 4624) with subsequent activity from that user's session. Generate a CRITICAL alert if: a) A connection is made to a critical ICS asset (e.g., PLC, SIS controller) that is not on the user's role-based access control list. b) Zeek logs show the use of restricted ICS protocol function codes (e.g., Modbus function codes > 16, DNP3 function code 'DIRECT_OPERATE'). c) A new process (Windows Event ID 4688) is created on a jump box or EWS for a known hacking tool, network scanner, or unusual scripting interpreter (e.g., powershell.exe -enc). d) Detailed file share logging (Windows Event ID 5145) shows access to sensitive engineering project files by a non-engineering account.",
              "For each user role (e.g., Operator, Engineer, Technician), establish a 30-day baseline profile of typical post-remote-login behavior. The profile should contain statistical measures for a 1-hour session window: a) The 99th percentile of unique internal hosts contacted. b) The 99th percentile of total session data volume (orig_bytes + resp_bytes). c) The set of common protocols and destination ports used. d) The 99th percentile of file access events (Windows Event ID 5145). Generate a HIGH alert if a live session exceeds two or more of these established 99th percentile thresholds.",
              "Employ an unsupervised anomaly detection model, such as an Autoencoder, on sessionized data following a successful remote login. A session is defined as all network (Zeek) and host (Windows Events) activity linked to the user within 4 hours of login. Create a feature vector for each session, including: total data volume, count of unique destination IPs, entropy of destination ports, counts of various connection states (e.g., SF, REJ), count of process creation events, count of file access events, and a binary vector indicating which ICS protocols were observed. Train the model on sessions from known-good, routine operational activity. A high reconstruction error for a new session signifies a major deviation from normalcy and should be flagged as a high-priority anomaly for analyst investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]