[
  {
    "information_requirement": "Has an adversary caused a loss of availability in a critical ICS component? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0826",
        "name": "Loss of Availability",
        "evidence": [
          {
            "description": "A critical ICS host (e.g., HMI, EWS) ceases all network communication for a defined critical period (e.g., >60 seconds), concurrently with the termination or crash of essential SCADA/control applications, or an unexpected system shutdown/restart.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Windows Event ID 7036",
              "Windows Event ID 4608",
              "Windows Event ID 4609"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations, Historian Servers, and Data Gateways on the Process Control Network.",
            "action": "1. **Statistical:** Establish a rolling baseline (e.g., 7-day moving average) for the time interval between communications for each critical ICS device using Zeek conn.log. Trigger an alert if a device fails to communicate for a period exceeding the 99th percentile of its historical communication interval, or 3 standard deviations above the moving average. 2. **Symbolic:** Correlate network silence alerts with Windows Event IDs 1000 (Application Error), 1002 (Application Hang), 7036 (Service Control Manager - service stopped/started), 4608 (System shutdown), or 4609 (System shutdown initiated by a process). Specifically, look for these events occurring within a 5-minute window prior to the observed network communication cessation, particularly for critical ICS applications or services (e.g., SCADA HMI runtime, PLC programming software services). 3. **Machine Learning:** Develop a time-series anomaly detection model (e.g., using an Isolation Forest or Prophet algorithm) on the communication frequency of each critical ICS host. Train the model on historical Zeek conn.log data to learn normal communication patterns and alert when the model identifies a significant deviation (e.g., a communication gap classified as anomalous with high confidence score) from the expected pattern."
          },
          {
            "description": "An anomalous surge in file modification (write/rename/delete) events (e.g., >500 events/minute) on critical ICS data directories (e.g., HMI project files, Historian databases, PLC programs) on systems like Historian Servers or Engineering Workstations, often accompanied by changes to file extensions (e.g., '.encrypted') or mass deletion, indicative of ransomware or data wiping.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historian Servers, Engineering Workstations, File Servers hosting ICS project files and configurations, and Backup Servers storing critical ICS data.",
            "action": "1. **Statistical:** For each critical host, establish a 7-day rolling baseline for the rate of Windows Event ID 4663 events (file modification/deletion) per process per minute. Trigger an alert if any process's event rate exceeds the 99th percentile of its historical rate. Additionally, calculate the Shannon entropy of file extensions associated with ID 4663 events for each process in a 5-minute window; alert on a sudden drop in entropy (e.g., below 0.5) indicating uniform renaming. 2. **Symbolic:** Correlate high file modification activity with Windows Event ID 4688 (Process Creation) to identify the initiating process. Look for known ransomware executable names (e.g., 'conti.exe', 'revil.exe'), or suspicious command-line arguments (e.g., 'vssadmin.exe delete shadows', 'powershell.exe -enc ...'), or the presence of specific file extensions (e.g., '.locked', '.enc', '.crypt') in ID 4663 events indicating encryption. 3. **Machine Learning:** Implement a clustering algorithm (e.g., K-Means or DBSCAN) on Windows Event ID 4663 events, using features such as process ID, target file path, and event timestamp. Train the model to identify clusters of file activity that deviate significantly from normal user/system behavior (e.g., a single process rapidly modifying files across many directories, or renaming files to a common extension). Alert when a new cluster is identified that is significantly different from benign clusters, indicative of mass file manipulation."
          },
          {
            "description": "An abrupt and sustained increase (e.g., >10x baseline) in network traffic volume (bytes/packets) or connection attempts from an unexpected source IP to a critical ICS field device (e.g., PLC, RTU, IED) over a short period (e.g., 30 seconds), specifically targeting ICS protocol ports, resulting in the device becoming unresponsive or exhibiting abnormal operational status.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek profinet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The Process Control Network segment, specifically network traffic directed at PLCs, RTUs, and IEDs, and Control System Firewall logs.",
            "action": "1. **Statistical:** For each critical ICS field device (PLC, RTU, IED), establish a rolling 7-day baseline for inbound connection rate (connections/minute), total bytes transferred (bytes/minute), and unique source IPs from Zeek conn.log. Trigger an alert if any of these metrics from a single source IP exceeds the 99th percentile of its historical distribution, or 4 standard deviations above a 30-minute moving average, sustained for at least 30 seconds. 2. **Symbolic:** Identify any source IP communicating with critical ICS devices that is not on an approved allow-list for the Process Control Network. Correlate high traffic alerts with Zeek notice.log for specific notices such as `DDoS::Syn_Flood`, `DDoS::Port_Scan`, `Scan::Address_Scan`, or `Protocol::Malformed_Packet` originating from the same source IP, specifically targeting ICS protocol ports (e.g., Modbus TCP port 502, EtherNet/IP port 44818). 3. **Machine Learning:** Deploy a real-time unsupervised anomaly detection model (e.g., using Isolation Forest or One-Class SVM) on network flow features extracted from Zeek conn.log (e.g., source/destination IP, port, protocol, byte count, packet count, duration) for traffic destined to critical ICS devices. Train the model on historical benign traffic patterns. Alert when the model identifies network flows that are classified as anomalous with a high anomaly score, indicating a deviation from normal communication behavior that could signify a denial-of-service attempt or unusual traffic flood."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]