[
  {
    "information_requirement": "Has an adversary caused a sustained loss of control over a critical industrial process? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0827",
        "name": "Loss of Control",
        "evidence": [
          {
            "description": "A high volume of operator commands sent from Human-Machine Interfaces (HMIs) are failing or timing out, while the target control devices (PLCs, RTUs) show no corresponding logged activity or show error states.",
            "data_sources": [
              "Windows Event ID 1000",
              "Zeek conn.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Operator Workstations / HMIs, Process Control Network (PCN), Engineering Workstations",
            "action": "Correlate HMI application errors (Windows Event ID 1000) with network connection logs (Zeek conn.log) and ICS protocol logs (Zeek modbus.log). Establish a baseline for the normal rate of failed operator commands. Monitor for a sudden spike in this failure rate from specific HMIs. Calculate the ratio of failed commands to successful commands over a rolling time window. An increase in this ratio exceeding 3 standard deviations from the established baseline, especially if correlated with TCP resets (RST packets) in Zeek conn.log, indicates a potential loss of control."
          },
          {
            "description": "Critical process variables (e.g., temperature, pressure, flow rate) are observed deviating significantly from their operational setpoints, and there are no corresponding legitimate operator commands or automated control loop adjustments logged to explain the deviation.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN), Programmable Logic Controllers (PLCs), Process Historian Server",
            "action": "Analyze ICS protocol logs (Zeek modbus.log, dnp3.log) for unauthorized 'Write' commands targeting registers associated with critical process setpoints. Establish a baseline of which source devices (e.g., specific HMIs) are authorized to write to these registers. An alert should be generated when a write command originates from an unauthorized source IP. Additionally, use time-series analysis on process variable data (from a historian) to detect when a value exceeds its normal operating envelope (e.g., 99th percentile) without a corresponding authorized write command being logged in the network data."
          },
          {
            "description": "The Safety Instrumented System (SIS) activates to bring a process to a safe state, indicating that primary control systems have failed and a dangerous condition has been reached.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Safety Instrumented System (SIS) workstations, Demilitarized Zone (DMZ) between the Process Control Network and Safety Network",
            "action": "Treat any SIS activation alarm as a high-priority security event. Immediately correlate the SIS trip alarm with network and authentication logs from the 30 minutes prior to the event. Search for any successful logins (Windows Event ID 4624) to SIS workstations from unusual source IPs or outside of normal hours. Simultaneously, analyze Zeek conn.log for any new or anomalous network connections to the SIS network segment. A correlation between an unauthorized access and an SIS trip is a strong indicator of a malicious loss of control event."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]