[
  {
    "information_requirement": "Has an adversary modified the execution flow or tasking of a controller? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0821",
        "name": "Modify Controller Tasking",
        "evidence": [
          {
            "description": "Network traffic indicating a program download or logic modification command sent to a controller, especially outside of authorized maintenance windows or from an unauthorized source.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segment between Engineering Workstations and Controllers",
            "action": "Monitor Zeek logs for ICS protocol traffic (e.g., s7comm) between Engineering Workstations (EWS) and controllers. Establish a baseline of authorized EWS IP addresses and normal maintenance windows. Filter for function codes related to program modification (e.g., S7comm 'Download block'). Generate an alert for any such command observed originating from an unauthorized IP address or occurring outside of a 95% confidence interval for established maintenance times. Correlate with Zeek conn.log to verify the source and destination of the traffic."
          },
          {
            "description": "Anomalous execution of controller programming software on an Engineering Workstation (EWS), such as by an unauthorized user or at an unusual time, correlated with network connections to a controller.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS)",
            "action": "On EWS hosts, monitor for the creation of controller programming software processes (e.g., 'TIA Portal.exe') via Windows Event ID 4688. For each execution, correlate the timestamp and host IP with network connections to controller IPs in Zeek conn.log within a 5-minute window. Establish a baseline of authorized user accounts (from Event ID 4624) and typical hours of operation for this software. Use descriptive statistics (mean, standard deviation) to model normal usage times. Flag any execution by a non-baselined user or at a time exceeding two standard deviations from the mean operational hours."
          },
          {
            "description": "An unexpected change in controller configuration, such as a new task being added or the priority of a critical task being altered, detected via periodic polling or configuration change messages.",
            "data_sources": [
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Programmable Logic Controllers (PLCs) and Distributed Control Systems (DCS)",
            "action": "If available, use Zeek to parse ICS protocol messages that report configuration or status. Alternatively, actively poll controllers for their task lists. Create a cryptographic hash (e.g., SHA-256) of the baseline task configuration for each critical controller. Periodically re-calculate the hash and compare it against the stored baseline. An alert is generated upon any hash mismatch, indicating a configuration change. The change can then be correlated with network logs (Zeek conn.log) and EWS activity (Windows Event IDs) to identify the source."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]