[
  {
    "information_requirement": "Is an adversary executing unauthorized code on critical ICS assets (e.g., HMI, EWS) by directly interacting with the operating system's native API? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0834",
        "name": "Native API",
        "evidence": [
          {
            "description": "An observation where a whitelisted, critical ICS process (e.g., 'HMI_Runtime.exe') spawns a child process that exhibits one or more anomalous characteristics: the child process is an unauthorized interpreter ('cmd.exe', 'powershell.exe'); the parent-child relationship is previously unobserved or explicitly disallowed; the child process binary is unsigned or signed by an untrusted publisher; or the child process is executed from a user-writable or temporary directory ('%TEMP%', 'C:\\Users\\Public\\').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMI), ICS Application Servers (SCADA/DCS), Data Historian Servers, Domain Controllers within the Process Control Network.",
            "action": [
              "1. Define and maintain a watchlist of critical ICS parent process names. 2. Implement a detection rule that triggers an alert for a process creation event (Windows Event ID 4688 or Sysmon Event ID 1) where the ParentProcessName is on the watchlist AND one of the following is true: a) NewProcessName is in a denylist of interpreters {'cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe'}; b) The process signature is invalid or from an untrusted publisher; c) The NewProcessPath is located in a temporary or user-writable directory. 3. Separately, monitor for Windows Event ID 4656 where a critical ICS process requests process memory write access ('AccessMask' contains '0x40') to another process, indicating a potential precursor to process injection.",
              "For each critical parent process, build a 30-day rolling baseline of its child process names and the Shannon entropy of their command-line arguments. Generate a medium-priority alert when a parent-child relationship occurs that is in the 99th percentile of rarity based on historical frequency. Escalate to a high-priority alert if the command-line entropy for any child process deviates by more than 3 standard deviations from the parent's historical baseline, suggesting obfuscation.",
              "Train an Isolation Forest anomaly detection model using historical process creation data (Sysmon Event ID 1) from the ICS environment. Engineer features including ParentProcessName, NewProcessName, command_line_length, command_line_entropy, and boolean flags for 'is_signed' and 'is_in_system_directory'. Score new process events in real-time and flag any event with an anomaly score in the top 2% (98th percentile) for analyst review."
            ]
          },
          {
            "description": "An observation where a critical ICS application, identified by its process name, initiates a network connection that violates established network behavior baselines. Violations include: using an application-layer protocol (e.g., HTTP, RDP, SMB) on a network segment restricted to industrial protocols (e.g., Modbus, DNP3); connecting to a destination IP address external to the defined OT network space; or resolving a DNS name not present on an approved domain whitelist.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at the perimeter of ICS Network Segments (Purdue Levels 2/3), Industrial Demilitarized Zone (IDMZ) egress points, DNS resolvers serving the OT environment, Internet gateway proxies.",
            "action": [
              "1. Correlate process information (from Sysmon Event ID 3 or Windows Event ID 5156) with network connection logs (Zeek conn.log) using source IP and timestamp. 2. Create a high-priority alert if a whitelisted ICS application process is the source of a connection where the destination port is a common IT protocol (e.g., 80, 443, 3389, 445) AND the destination IP is not in the approved OT address space. 3. Create another high-priority alert if the process makes a DNS query (Zeek dns.log) for a domain not on the 'ICS Domain Whitelist'.",
              "For each critical ICS application, maintain a 30-day rolling baseline of its network behavior from Zeek conn.log, including total bytes transferred ('orig_bytes' + 'resp_bytes') and the set of unique destination ports. Generate a medium-priority alert if the application initiates a connection to a destination port never before seen in its baseline (0th percentile frequency). Escalate to high-priority if the total daily data volume for the application exceeds the 95th percentile of its historical daily volume.",
              "For each critical ICS application, develop a One-Class Support Vector Machine (OC-SVM) model trained on a baseline of normal network connection features from Zeek conn.log. Features should include 'duration', 'orig_bytes', 'resp_bytes', 'id.resp_p', and one-hot encoded 'proto' and 'conn_state'. Score new connections in real-time. Any connection classified as an outlier (falling outside the learned boundary of 'normal') should be flagged as anomalous for investigation."
            ]
          },
          {
            "description": "An observation where a whitelisted ICS process performs a write or delete operation on a file or registry key that is outside its standard operational baseline. Examples include: an HMI application creating a new executable file in 'C:\\Windows\\System32\\'; a SCADA server modifying a registry key associated with system startup ('HKLM\\...\\Run'); or any critical process modifying its own on-disk binary.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Sysmon Event ID 11",
              "Sysmon Event ID 12",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems and registries of critical ICS assets, including Engineering Workstations (EWS), Human-Machine Interfaces (HMI), and Application Servers. Specifically monitor critical directories ('C:\\Windows\\System32', application installation folders) and registry hives ('HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run').",
            "action": [
              "1. Configure System Access Control Lists (SACLs) on critical directories and registry hives. 2. Implement a rule that triggers a high-priority alert based on Sysmon events (11, 12, 13) or Windows Security events (4663, 4657) when a critical ICS process name attempts a write or delete operation on a protected resource. Protected resources include executables in system directories, autorun registry keys, or the application's own binary file path.",
              "For each critical ICS application, build a 30-day baseline of all file and registry paths to which it writes. Calculate a rarity score for each path based on its historical access frequency. Generate an alert for any write operation to a path whose rarity score is in the 99th percentile, indicating the process is interacting with an unusual and potentially malicious location.",
              "Train a character-level autoencoder model on the corpus of file and registry paths normally written to by each critical ICS application. The model learns to reconstruct normal path structures. Feed new write paths (from Sysmon/Windows events) into the trained model. A path that generates a high reconstruction error score indicates a syntactic anomaly (e.g., randomized, algorithmically generated) and should be flagged for investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]