[
  {
    "information_requirement": "Is an adversary manipulating physical control processes to cause an impact? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0831",
        "name": "Manipulation of Control",
        "evidence": [
          {
            "description": "An ICS 'write' command (e.g., Modbus function code 0x06 (Write Single Register), DNP3 function code 0x03 (Write) with specific data object variations, EtherNet/IP CIP Write, S7COMM Write Var) targeting a critical process setpoint register or tag is observed. This command originates from a source IP address not explicitly listed in the authorized asset inventory for setpoint modification on that specific asset, is initiated by a user account not a member of the 'ICS_Operators' or 'ICS_Engineers' Active Directory group, or occurs outside of the documented operational schedule (e.g., a write command observed at 03:00 local time on a production system with documented 07:00-19:00 operational hours, Monday-Friday).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek s7comm.log",
              "Data Historian Logs (e.g., tag write events)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) on the Process Control Network (PCN), Human-Machine Interfaces (HMIs) on the PCN, Level 1 & 2 Network Segments (e.g., containing PLCs, RTUs, IEDs), Data Historian Servers, Active Directory Domain Controllers",
            "action": "1. Symbolic Logic: Identify all 'write' commands in Zeek logs (modbus.log, dnp3.log, enip.log, s7comm.log) that target known critical setpoint registers/tags (as defined in a configuration management database or asset inventory). For each identified write, cross-reference the source IP with an authorized asset inventory list of HMIs/EWS designated for setpoint modification. Flag any write command originating from an IP not on this list. Additionally, correlate with Windows Event ID 4624 (successful logon) on the source host and Active Directory group membership logs to identify the user account. Alert if the user account is not a member of authorized groups (e.g., 'ICS_Engineers' or 'ICS_Operators') or if the command occurs outside of documented operational hours for the target asset. 2. Statistical Method: For each critical setpoint (as recorded by Data Historian or observed in ICS protocol logs), establish a baseline of typical modification frequency (e.g., writes per hour) and value ranges over the last 90 days. Calculate the interquartile range (IQR) for the rate of change and the magnitude of change in setpoint values. Alert when the rate of change or magnitude of change for a setpoint exceeds the 99th percentile of its historical distribution, or when multiple modifications (e.g., 5 changes in 1 minute) occur within a compressed timeframe that significantly deviates from the 99th percentile of historical activity. 3. Machine Learning: Employ a time series anomaly detection model (e.g., Isolation Forest, Prophet, or ARIMA with exogenous variables) on the historical values and write frequencies of critical setpoints as recorded by the Data Historian or observed in ICS protocol logs. Train the model on at least 6 months of normal operational data, including features such as value, rate of change, time of day, and day of week. Alert when the model identifies a significant deviation in a setpoint's value or its write frequency, or a sustained deviation from its learned normal patterns, indicating potential manipulation. The anomaly score exceeding a threshold of 0.8 could trigger an alert."
          },
          {
            "description": "ICS protocol 'write' or 'control' commands (e.g., Modbus function codes 0x05 (Write Single Coil), 0x06 (Write Single Register), 0x0F (Write Multiple Coils), 0x10 (Write Multiple Registers); DNP3 function codes 0x03 (Write), 0x04 (Select/Operate); EtherNet/IP CIP Write; S7COMM Write Var) are observed originating from a source IP address or MAC address not found within the current, validated asset inventory for the specific PCN segment, or from a device categorized in the inventory as a 'non-control' or 'read-only' asset (e.g., a printer, a guest network device, or an unmanaged network switch).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek s7comm.log",
              "Network Device Logs (e.g., switch MAC address tables, firewall connection logs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network switches and routers within Level 1 (Basic Control) and Level 2 (Supervisory Control) of the Purdue Model, Industrial DMZ (IDMZ) gateways, Firewalls between IT and OT networks, SCADA Servers, Management Workstations",
            "action": "1. Symbolic Logic: Ingest and maintain a dynamic asset inventory mapping of authorized IP/MAC addresses to specific PCN segments and their designated roles (e.g., HMI, PLC, Historian). Monitor Zeek conn.log for connections to known ICS ports (e.g., Modbus TCP 502, DNP3 20000/tcp, EtherNet/IP 44818/tcp, S7COMM 102/tcp) or Zeek modbus.log, dnp3.log, enip.log, s7comm.log for any 'write' or 'control' commands. Cross-reference the source IP/MAC of these commands against the authorized inventory. Generate an alert for any command originating from an unknown device, an unapproved IP/MAC address, or a device categorized as 'read-only' or 'non-control' for that segment. 2. Statistical Method: For each ICS device (PLC, RTU, IED), establish a baseline of unique source IP addresses that initiate 'write' commands and the frequency of these commands from each source over a 30-day period. Calculate the entropy score of source IP addresses observed initiating 'write' commands to critical ICS devices over rolling 1-hour windows. An entropy score significantly higher than the 99th percentile of the historical baseline indicates a sudden increase in diverse or new communicating sources, suggesting potential unauthorized activity. Alert when this threshold is exceeded. 3. Machine Learning: Apply a clustering algorithm (e.g., K-means, DBSCAN, or One-Class SVM) to Zeek conn.log data, using features such as source IP, destination IP, destination port (specifically ICS ports), protocol, and byte counts over 24-hour windows. Train the model on historical network flow data (e.g., 3 months). Identify clusters that represent normal communication patterns within the PCN. Flag any new or significantly deviating clusters that contain ICS protocol 'write' or 'control' command traffic as anomalous, potentially indicating an unauthorized device attempting to interact with control systems. An alert is triggered if a new cluster is detected with a high number of ICS write commands."
          },
          {
            "description": "A process execution event (Windows Event ID 4688) on an HMI or EWS is detected for an executable known to interact with ICS protocols or perform system-level manipulation (e.g., Modscan.exe, DNP3Master.exe, plccmd.exe, netcat, PowerShell scripts interacting with COM ports/DLLs). This process lacks a trusted digital signature, has a parent process not whitelisted for that executable (e.g., cmd.exe launched by a web browser, or a non-standard parent for a known ICS utility), or no interactive logon event (Windows Event ID 4624 Logon Type 2 or 10) by an authorized user account is observed on the same host within the preceding 60 seconds of the process creation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Windows Event ID 5136 (for GPO changes)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs) on the PCN, Engineering Workstations (EWS) on the PCN, SCADA Servers, Remote Access Servers (RAS) to OT networks, Active Directory Domain Controllers",
            "action": "1. Symbolic Logic: Create and maintain a whitelist of authorized executables, their expected file paths, trusted digital signatures, and expected parent processes for critical HMI/EWS (e.g., scadahmi.exe launched by explorer.exe). Monitor Windows Event ID 4688 for any process creation on HMI/EWS. Immediately flag any process creation where the executable is not on the whitelist, the parent process is unexpected, or the process lacks a valid digital signature. Additionally, correlate any process creation of known ICS control utilities with a preceding Windows Event ID 4624 (Logon Type 2 or 10) for the same user within 5 minutes; alert if no such interactive logon is found, or if Windows Event ID 4648 (A logon was attempted using explicit credentials) without a corresponding interactive logon is observed. 2. Statistical Method: Establish a baseline of typical process creation rates, unique process names, and parent-child process relationships on HMI/EWS over a 30-day period. Calculate the frequency of process creations per user and per host, and the frequency of specific parent-child process chains. Use descriptive statistics to identify outliers: alert if a user or host exhibits a process creation rate (e.g., number of new unique processes per hour) exceeding the 99th percentile of its historical baseline, or if a process known to interact with ICS devices is launched from an executable path that deviates from the 95th percentile of observed paths. Calculate an entropy score for parent-child process relationships; a score significantly higher than the 99th percentile baseline indicates an unusual diversity in process spawning. 3. Machine Learning: Employ a supervised machine learning model (e.g., Random Forest, Gradient Boosting, or Deep Neural Network) trained on historical Windows Event ID 4688 and 4624 data from HMI/EWS. Features for the model could include process name, parent process name, command line arguments, user account, logon type, time of day, day of week, digital signature status, and executable path. Label known legitimate and malicious process creations. The model should classify new process creations as 'normal' or 'anomalous', triggering an alert for high-confidence anomalous classifications (e.g., a confidence score above 0.9) especially for processes interacting with ICS, or if a process is classified as a known malicious utility."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]