[
  {
    "information_requirement": "Is an adversary executing unauthorized code on critical ICS assets (e.g., HMI, EWS) by directly interacting with the operating system's native API? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0834",
        "name": "Native API",
        "evidence": [
          {
            "description": "Detection of Windows Event ID 4688 (Process Creation) on critical ICS assets where a pre-defined critical ICS application process (e.g., HMI_Runtime.exe, Vendor_App.exe, Historian_Service.exe) spawns a child process not present in a pre-approved whitelist of parent-child process relationships. This specifically includes the creation of known command interpreters (cmd.exe, powershell.exe), scripting engines (wscript.exe, cscript.exe), or any executable whose digital signature is either missing, expired, revoked, or not issued by an approved vendor. Particular scrutiny is applied if the child process originates from ephemeral or user-writable directories (e.g., %TEMP%, C:\\Windows\\Temp, C:\\Users\\*\\AppData\\Local\\Temp) rather than standard program installation paths.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) within the control network, Human-Machine Interfaces (HMI) on the plant floor, ICS Application Servers hosting SCADA/DCS components, Data Historian Servers",
            "action": "1. Symbolic Logic: For critical ICS assets (EWS, HMI, ICS Application Servers), query Windows Event ID 4688 for process creation events. Generate an immediate alert if the 'ParentProcessName' field matches a whitelisted critical ICS application (e.g., 'HMI_Runtime.exe') and the 'NewProcessName' field matches 'cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', or any process where the 'NewProcessCommandLine' contains a path indicating a temporary directory (e.g., '%TEMP%', 'C:\\Windows\\Temp', 'C:\\Users\\*\\AppData\\Local\\Temp'). Additionally, alert if the 'SignatureStatus' field indicates 'Unsigned', 'Bad Signature', or if the 'Signer' field does not match an approved vendor for the 'NewProcessName' executable, where a signed process is expected.\n2. Statistical Method: Establish a 30-day baseline for each unique parent-child process pair observed from Windows Event ID 4688 on critical ICS assets, recording the average daily execution count and the Shannon entropy of their command-line arguments. For ongoing events, calculate the z-score for the observed daily execution count of each parent-child pair against its baseline mean and standard deviation. Also, calculate the z-score for the Shannon entropy of command-line arguments. Alert if the execution count z-score is less than -3 (indicating an abnormally rare event for a previously common pair) or if the command-line argument entropy z-score is greater than +3 (indicating unusual or randomized command-line parameters).\n3. Machine Learning: Implement an Isolation Forest model trained on 90 days of Windows Event ID 4688 data from critical ICS assets. Use features including 'ParentProcessName', 'NewProcessName', 'NewProcessCommandLine' (tokenized and embedded), 'SubjectUserName', 'NewProcessPath', and 'SignatureStatus'. Continuously feed new process creation events into the model. Generate an alert for any event where the anomaly score exceeds the 95th percentile of scores observed during the training period, indicating a significant deviation from normal ICS process behavior."
          },
          {
            "description": "Observation of outbound network connections in Zeek conn.log and DNS queries in Zeek dns.log, originating from a critical ICS application process (identified and correlated via Windows Event ID 5156 'Application Name'), where the connection parameters deviate from an established operational baseline. This includes connections utilizing non-industrial protocols (e.g., TCP/80 HTTP, TCP/443 HTTPS, TCP/3389 RDP, TCP/445 SMB) from an ICS network segment where only industrial protocols (e.g., Modbus, OPC UA, DNP3) are expected. Evidence also includes connections to IP addresses outside of the defined internal ICS/OT subnet ranges (e.g., RFC1918 ranges not designated for OT, or public IPs), or DNS resolutions for domains not present in the ICS network's pre-approved domain whitelist.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter of ICS Network Segments (e.g., Level 3 to Level 3.5/4), Industrial Demilitarized Zone (IDMZ) egress points, Internet Gateway Proxies",
            "action": "1. Symbolic Logic: Correlate 'Application Name' from Windows Event ID 5156 on critical ICS assets with 'id.orig_h' (source IP) from Zeek conn.log and 'id.resp_h' (destination IP), 'id.resp_p' (destination port), 'proto' (protocol). Also correlate 'id.orig_h' from Zeek dns.log with 'query' (queried domain). Generate an immediate alert if an ICS application (e.g., 'SCADA_Server.exe') initiates an outbound connection where the 'id.resp_p' and 'proto' indicate a non-industrial protocol (e.g., 'TCP/80', 'TCP/443', 'TCP/3389', 'TCP/445') from an ICS network segment, or if 'id.resp_h' is not within the pre-approved internal ICS IP ranges (e.g., 10.10.0.0/16, 172.16.0.0/20) or is listed in a global threat intelligence blacklist. Additionally, alert if 'query' from Zeek dns.log is not present in the ICS network's pre-approved domain whitelist.\n2. Statistical Method: Establish a 30-day baseline for each critical ICS application (identified via Windows Event ID 5156) based on its Zeek conn.log and dns.log activity. For each application, calculate the average daily number of connections, total bytes transferred, and the Shannon entropy of destination IP addresses and queried domain names. Continuously monitor these metrics and calculate their 7-day moving average and standard deviation. Generate an alert if any metric exceeds its 3-sigma upper control limit (i.e., Moving Average + 3 * Standard Deviation), indicating a statistically significant increase in network activity or diversification of communication targets for that ICS application.\n3. Machine Learning: Implement an XGBoost classifier, trained on 90 days of labeled Zeek conn.log and dns.log data (correlated with Windows Event ID 5156 application names) from ICS assets. Use features such as 'duration', 'orig_bytes', 'resp_bytes', 'proto', 'service', 'conn_state', 'query_name_length', 'entropy_of_query_name', and a boolean for 'is_internal_dest_ip'. Retrain the model monthly with new labeled data. For new network connection events, generate an alert if the model's classification probability for 'malicious' or 'C2' exceeds 0.9, indicating a high likelihood of adversarial communication by an ICS application."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]