[
  {
    "information_requirement": "Is an adversary attempting to modify or suppress critical process alarms? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0838",
        "name": "Modify Alarm Settings",
        "evidence": [
          {
            "description": "An alarm configuration file on a critical Windows-based host (e.g., HMI, Engineering Workstation) is modified or replaced by an unauthorized process or outside of a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian servers",
            "action": "Identify critical alarm configuration file paths and names (e.g., *.ALM, project directories) on EWS and HMI assets. Enable file system audit SACLs on these objects to generate Event ID 4663 for write access. For each 4663 event, correlate by timestamp and process ID with Event ID 4688 to identify the parent process responsible for the modification. Establish a baseline of legitimate processes (e.g., 'vendor_config.exe', 'project_loader.exe') that modify these files. Alert when a modification is performed by a non-standard process such as 'powershell.exe', 'cmd.exe', or an unrecognized binary. Use descriptive statistics to track the frequency of modifications per host and alert on spikes that deviate from the established norm (e.g., > 95th percentile of daily modifications)."
          },
          {
            "description": "A modified configuration file or project containing new alarm settings is transferred over the network to a control system device from an unauthorized source.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting IT to OT zones, network segments containing PLCs and HMIs, wireless industrial networks",
            "action": "Filter Zeek files.log for transfers with a destination IP in the control system network range. Create a baseline of known-good source IPs (e.g., specific EWSs), file types/MIME types, and file sizes commonly transferred to these assets. Generate an alert for any file transfer that violates this baseline, such as a transfer from an IT network host to a PLC or an unusually large configuration file. Use Zeek conn.log to enrich alerts with connection details, flagging long-duration connections or connections using non-standard ports that precede a suspicious file transfer."
          },
          {
            "description": "A critical service or process related to alarm generation and processing on a Windows-based operator station or HMI is unexpectedly stopped.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Operator Stations, Human-Machine Interfaces (HMIs), Alarm management servers",
            "action": "Identify the service names for all critical ICS alarm and HMI runtime applications. Create a watchlist of these service names. Monitor for Windows Event ID 7036 where a watched service enters the 'stopped' state. Correlate the timestamp with process creation logs (Event ID 4688) to determine if the service was stopped via a command-line utility (e.g., 'sc.exe stop <service>', 'net stop <service>'). Alert on any non-administrator-initiated stoppage that does not correlate with a system shutdown event (Event ID 1074) or a known software update process."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]