[
  {
    "information_requirement": "Is an adversary manipulating physical control processes to cause an impact? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0831",
        "name": "Manipulation of Control",
        "evidence": [
          {
            "description": "An ICS 'write' command (e.g., Modbus function code 0x06, DNP3 function code 0x03) targeting a critical process setpoint register is observed, and one of the following conditions is met: (a) the command's source IP address is not on a pre-defined allowlist for the target PLC/RTU; (b) the initiating user account, correlated from the source host, is not a member of an authorized OT operator group in Active Directory; or (c) the command occurs outside a documented operational or maintenance window for that asset.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek s7comm.log",
              "Windows Event ID 4624",
              "Data Historian Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) on the Process Control Network (PCN), Human-Machine Interfaces (HMIs) on the PCN, Level 1 and 2 Network Segments (containing PLCs, RTUs, IEDs), Data Historian Servers, Active Directory Domain Controllers",
            "action": [
              "For each ICS 'write' command detected in Zeek protocol logs, extract the source IP from the associated Zeek conn.log entry. Correlate the source IP and timestamp with a successful logon (Windows Event ID 4624) on the source host to identify the user. Alert if the source IP is not on the target asset's allowlist, the user is not a member of the authorized 'ICS_Operators' AD group, or the command timestamp is outside the asset's defined operational hours.",
              "For each critical setpoint tag monitored in the Data Historian, establish a 90-day rolling baseline for its rate of change (value delta per minute) and modification frequency (writes per hour). Compute the 99th percentile for both metrics. Generate an alert if a new write command causes a rate of change or an hourly write frequency that exceeds its respective 99th percentile threshold, indicating statistically anomalous manipulation.",
              "Train a multivariate time-series anomaly detection model (e.g., Isolation Forest, VAE) on historical data historian logs for critical setpoints. Use a feature set including setpoint value, time of day, day of week, source IP, and user account. Continuously score new write events against the model. Generate an alert for analyst review if any event receives an anomaly score exceeding a dynamically adjusted threshold (e.g., > 0.9), indicating a complex deviation from learned operational patterns."
            ]
          },
          {
            "description": "An ICS protocol 'write' or 'control' command (e.g., Modbus function code 0x0F, DNP3 function code 0x04) originates from a source IP or MAC address that is not present in the authoritative asset inventory for that specific OT network segment, or the inventory record for the source device explicitly designates its role as 'read-only' or 'monitoring-only'.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network switches and routers within Level 1 (Basic Control) and Level 2 (Supervisory Control) of the Purdue Model, Industrial DMZ (IDMZ) gateways, Firewalls segmenting IT and OT networks, SCADA Servers, Management Workstations",
            "action": [
              "Maintain a real-time asset inventory mapping authorized IP/MAC addresses to OT network segments and device roles. Monitor Zeek protocol logs for any 'write' or 'control' function codes. For each such command, query the asset inventory with the source IP and MAC address. Trigger an immediate alert if no matching record is found or if the found record's 'role' attribute is designated as 'read-only'.",
              "For each critical ICS device (e.g., PLC, RTU), establish a 30-day baseline of unique source IP addresses that legitimately initiate 'write' commands. Using a rolling 1-hour window, calculate the Shannon entropy of the source IP distribution for incoming commands to each device using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. Trigger an alert if the entropy score for a device increases by more than 3 standard deviations from its historical mean, indicating a suspicious diversification of control sources.",
              "Model the Process Control Network as a graph where nodes are devices (IPs) and edges represent connections from Zeek conn.log, weighted by protocol and port. Train a graph-based anomaly detection model on 90 days of data to learn normal communication subgraphs for control operations. Alert when the model detects a new, anomalous edge representing an ICS 'write' command that originates from a node not part of the learned 'authorized control' subgraph."
            ]
          },
          {
            "description": "A process creation (Windows Event ID 4688) is observed on a critical HMI or EWS for an executable capable of interacting with ICS protocols (e.g., plccmd.exe, modscan.exe) or a powerful scripting utility (e.g., powershell.exe), and one of the following is true: (a) the parent process is not an authorized interactive shell or management tool (e.g., 'explorer.exe'); (b) the process's file hash is not on a known-good software allowlist; or (c) the process is created in a non-interactive network logon session (Logon Type 3) by a non-administrative account.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4648"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs) on the PCN, Engineering Workstations (EWS) on the PCN, SCADA Servers, Remote Access Servers (RAS) providing access to the OT network",
            "action": [
              "On designated HMI and EWS endpoints, create a detection rule that monitors Windows Event ID 4688. For events where the 'NewProcessName' matches a list of high-risk ICS or system utilities, check the 'ParentProcessName' against a per-executable whitelist. Correlate the logon ID with Windows Event ID 4624 to check the session type. Alert if a high-risk process is spawned by an unauthorized parent or within a network logon session (Logon Type 3) not associated with a legitimate remote administration tool.",
              "For each HMI and EWS, establish a 30-day baseline of all observed parent-child process relationships, stored as a frequency map. For each new process creation event (Event ID 4688), calculate the historical rarity of the observed (parent, child) pair. Trigger an alert if the pair's frequency is in the bottom 1st percentile (i.e., it is an extremely uncommon execution pattern), prioritizing alerts where the child process is a known ICS tool or command-line interpreter.",
              "Train a classification model (e.g., Gradient Boosted Tree) on labeled Windows Event ID 4688 logs to distinguish malicious from benign activity. Features should include process name, parent process name, command-line argument length and entropy, and user context. Deploy the model to score new process executions in real-time. An event classified as 'suspicious' with a confidence score > 0.9, especially one involving command-line arguments with ICS-related keywords (e.g., 'modbus', 'write', 'register'), should trigger a high-severity alert."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]