[
  {
    "information_requirement": "Is an adversary modifying critical process control parameters to impair operations? (PIR)",
    "tactic_id": "TA0106",
    "tactic_name": "Impair Process Control",
    "indicators": [
      {
        "technique_id": "T0836",
        "name": "Modify Parameter",
        "evidence": [
          {
            "description": "A 'Write' command targets a critical ICS parameter, such as a PLC register for a pump setpoint, with a value that is either outside a predefined, documented safe operating range or deviates by more than 3 standard deviations from the parameter's historical baseline.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) Segments, PLC/RTU Controllers, SCADA Servers, Data Historians",
            "action": [
              "Create and maintain a watchlist of critical ICS parameter addresses (e.g., Modbus register 40110) and their documented safe operating ranges (min/max values) from engineering specifications. Query Zeek ICS protocol logs for 'Write' function codes. Trigger an alert when a 'Write' command's value for a parameter on the watchlist falls outside its defined safe range.",
              "For each critical ICS parameter, establish a historical baseline by calculating the mean and standard deviation of its written values over a 90-day period from Zeek ICS logs. Monitor real-time 'Write' commands and trigger an alert if a new value for a monitored parameter exceeds 3 standard deviations from its historical mean.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) on historical data for each critical parameter, using the written 'value' as the primary feature. Deploy the model to score new 'Write' commands in real-time. Trigger an alert for any 'Write' command whose value receives an anomaly score placing it in the top 1st percentile, indicating a statistically rare and potentially malicious modification."
            ]
          },
          {
            "description": "An ICS 'Write' command is observed originating from a source IP address that is not on the documented allowlist of authorized Engineering Workstations (EWS) or Human-Machine Interfaces (HMIs).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Network Boundary, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Remote Access VPN Concentrators",
            "action": [
              "Create and maintain a watchlist of authorized IP addresses for all EWS and HMI systems permitted to issue control commands. Join Zeek ICS protocol logs (e.g., modbus.log) with Zeek conn.log on the connection UID. Trigger an alert when a 'Write' command is observed originating from a source IP ('id.orig_h') not on the authorized watchlist.",
              "Analyze 90 days of Zeek conn.log and ICS protocol logs to identify all source IPs that have previously issued 'Write' commands. Calculate the frequency of 'Write' commands per source IP. Trigger an alert when a 'Write' command originates from a source IP whose historical write frequency is in the bottom 1st percentile, indicating a very rare or first-time source of control commands.",
              "Train a clustering model (e.g., DBSCAN) on historical Zeek conn.log data, using features such as (src_ip, dst_ip, dst_port, proto) for traffic targeting ICS devices. This model will identify normal communication clusters. Analyze real-time connections that contain 'Write' commands. Trigger an alert if the connection's feature set is classified as a noise point (i.e., does not belong to any normal communication cluster)."
            ]
          },
          {
            "description": "An ICS 'Write' command from an authorized EWS/HMI is temporally correlated within a 5-minute window to a successful Windows logon (Event ID 4624) on that same EWS/HMI that exhibits multiple anomalous characteristics, such as occurring outside of normal working hours or from a rare source network.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Active Directory Domain Controllers",
            "action": [
              "Correlate successful Windows logons (Event ID 4624) on EWS/HMI systems with subsequent ICS 'Write' commands from the same source IP within a 5-minute window. Maintain a watchlist of user accounts that are explicitly forbidden from performing control actions (e.g., guest accounts, administrative accounts not used for operations). Trigger an alert if a 'Write' command is preceded by a logon from a forbidden user account.",
              "For each operational user account, establish a baseline of normal logon hours (e.g., 08:00-17:00, Mon-Fri) from 90 days of Windows Event ID 4624 logs. When an ICS 'Write' command is observed, check the preceding logon event (within 5 minutes) from the source EWS/HMI. Trigger an alert if the logon time falls outside the user's established normal hours (e.g., in the 99th percentile of 'off-hours' logons for that user).",
              "Train a multi-feature anomaly detection model, such as an Autoencoder, on historical user sessions on EWS/HMIs, using features from Windows Event ID 4624 (logon type, source network, time of day) and Zeek conn.log (protocols used, data volume). When an ICS 'Write' command is observed, score the associated user session (e.g., the last 15 minutes of activity). Trigger an alert if the session's reconstruction error is high, indicating anomalous behavior by the user account that initiated the command."
            ]
          },
          {
            "description": "A single, critical control parameter is subjected to a rapid series of 'Write' commands within a 60-second window, where the frequency of writes significantly exceeds the 99th percentile of the historical norm for that specific parameter, suggesting an attempt at oscillatory manipulation or denial of control.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "PLC/RTU Controllers, Process Control Network (PCN) Segments, SCADA/Historian Servers",
            "action": [
              "For each critical parameter, define a static threshold for command frequency (e.g., more than 10 'Write' commands in 60 seconds). Create a SIEM rule that counts 'Write' commands per parameter over a 60-second sliding window. Trigger an alert if the count exceeds the predefined static threshold.",
              "For each critical parameter, calculate the 99th percentile of 'Write' command frequency (writes per minute) from 90 days of historical Zeek ICS logs. Create a scheduled query that monitors the write frequency for each parameter in a 1-minute sliding window. Trigger an alert if the observed frequency exceeds the calculated 99th percentile baseline.",
              "For each critical parameter, train a time-series forecasting model (e.g., ARIMA, Prophet) on the historical sequence of its values from Zeek logs. The model learns the normal rhythm and value progression. In real-time, feed the model the current value and command time. Trigger an alert if a sequence of rapid 'Write' commands causes the actual values to consistently fall outside the model's predicted confidence interval, indicating an unnatural, forced change in the parameter's behavior."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]