[
  {
    "information_requirement": "Is an adversary manipulating the view of the industrial process?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0831",
        "name": "Man in the Middle",
        "evidence": [
          {
            "description": "Anomalous network patterns on the process control network, such as duplicate MAC addresses or gratuitous ARP packets, suggesting an ARP spoofing attempt to intercept and alter traffic between controllers and HMIs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network Segment",
            "action": "Continuously monitor Zeek notice.log for ARP-related alerts (e.g., 'ARP_Spoofing'). Establish a baseline of authorized IP-to-MAC address pairings on the control network. Alert on any deviation from this baseline. Analyze Zeek conn.log to identify any new or unexpected communication flows between critical control system components (e.g., PLC to HMI), especially those not matching the established asset inventory."
          }
        ]
      },
      {
        "technique_id": "T0867",
        "name": "Standard Application Layer Protocol",
        "evidence": [
          {
            "description": "An HMI or engineering workstation sends an unusually high volume of write commands (e.g., Modbus Function Code 6 or 16) to a Programmable Logic Controller (PLC) compared to its established baseline. Alternatively, write commands contain values that fall outside of predefined, safe operational ranges for the physical process.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Programmable Logic Controllers (PLCs) and Human-Machine Interfaces (HMIs)",
            "action": "Using Zeek's ICS protocol logs (e.g., modbus.log), establish a baseline ratio of read vs. write function codes for each source-destination pair over a rolling 24-hour window. Alert when the proportion of write commands exceeds a statistically significant threshold, such as 3 standard deviations above the mean. For critical process variables, define acceptable value ranges and alert on any write command attempting to set a value outside of its pre-configured safe operational range."
          }
        ]
      },
      {
        "technique_id": "T0848",
        "name": "Modify Program",
        "evidence": [
          {
            "description": "An unauthorized process modifies or replaces a critical executable, library, or configuration file associated with the HMI software.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Windows Security Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interface (HMI) Servers and Engineering Workstations",
            "action": "Enable file system auditing on directories containing HMI software. Monitor for file modification events (Windows Event ID 4663) targeting key HMI files. For each modification, correlate the timestamp with process creation events (Windows Event ID 4688) to identify the responsible process. Maintain a whitelist of legitimate processes (e.g., trusted installers, patch management tools) allowed to modify these files and alert on any modification by a non-whitelisted process."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]