[
  {
    "information_requirement": "Is an adversary executing unauthorized code on critical ICS assets (e.g., HMI, EWS) by directly interacting with the operating system's native API? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0834",
        "name": "Native API",
        "evidence": [
          {
            "description": "A critical and typically stable ICS process, such as an HMI runtime or engineering application, spawns an unexpected child process (e.g., a command interpreter) or exhibits an otherwise anomalous parent-child relationship.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMI), ICS Application Servers",
            "action": "Continuously monitor for process creation events (Windows Event ID 4688) on HMIs and EWSs. Establish a strict baseline of legitimate parent-child process relationships for critical control system applications (e.g., vendor-specific executables). Alert on any deviation from this baseline, particularly if a critical process spawns a command-line interpreter (`cmd.exe`, `powershell.exe`) or an unsigned/unrecognized executable. Calculate the rarity of each parent-child pair observed; pairs with a frequency below the 5th percentile should be flagged for immediate review."
          },
          {
            "description": "A legitimate ICS application process, which normally only communicates on the OT network using industrial protocols, initiates an external network connection over a non-standard port or protocol to an unknown IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, Demilitarized Zone (DMZ) firewalls, Internet Gateway",
            "action": "Correlate process information from host logs (Windows Event ID 5156 - Application Name field) with network connection logs (Zeek conn.log) using timestamp and source IP. Create a baseline of expected network destinations, ports, and protocols for each critical ICS application. Alert on any ICS application that initiates a connection to an external IP address, uses a non-standard protocol, or generates DNS queries for non-whitelisted domains (Zeek dns.log). Calculate the Shannon entropy of requested domain names per process; a sudden spike in entropy for an ICS process could indicate C2 activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]