[
  {
    "information_requirement": "Is an adversary attempting to upload and exfiltrate PLC logic for reconnaissance? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0845",
        "name": "Program Upload",
        "evidence": [
          {
            "description": "A large volume of data is transferred from a PLC to another device on the network, inconsistent with normal operational traffic. This is often indicative of a full logic file upload rather than standard polling.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, specifically connections between Engineering Workstations (EWS) and PLCs.",
            "action": "Using Zeek conn.log, establish a baseline of bytes transferred (resp_bytes) from PLCs (responders) to EWS/other clients (originators). Continuously monitor for connections where the resp_bytes value exceeds the 95th percentile of the historical baseline for that specific PLC-client pair. Correlate high-volume transfers with specific ICS protocol commands (e.g., S7comm 'Upload' function code in s7comm.log) to confirm a program upload event. Alert on any such transfers occurring outside of scheduled maintenance windows."
          },
          {
            "description": "Engineering software on an Engineering Workstation (EWS) is launched by an unauthorized user, from a non-standard file path, or with unusual command-line arguments prior to establishing a connection with a PLC.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and Human-Machine Interfaces (HMIs).",
            "action": "Monitor for process creation events (Windows Event ID 4688) for known engineering applications (e.g., TIA Portal.exe, Studio5000.exe). Establish a baseline of legitimate user accounts, parent processes, and file paths for these applications. Alert on any execution by a non-engineer user account, from an unusual path (e.g., C:\\Users\\Public\\), or spawned by a suspicious parent (e.g., powershell.exe). Correlate the process creation event with a subsequent network connection to a PLC's programming port (e.g., TCP/102 for S7, TCP/44818 for EtherNet/IP) using Windows Event ID 5156 to increase confidence."
          },
          {
            "description": "An anomalous login to an Engineering Workstation (EWS) is immediately followed by network activity consistent with a PLC program upload.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs on Engineering Workstations, network traffic between EWS and PLCs.",
            "action": "Monitor successful logon events (Windows Event ID 4624) on EWS assets. For each logon, establish a baseline of source workstation/IP, time of day, and logon type. Alert on logons that deviate significantly from the baseline (e.g., interactive logon from a non-standard IT subnet, logon occurring at 2 AM). If an anomalous logon is detected, immediately query network logs (Zeek conn.log, s7comm.log) for any connections initiated from the EWS to PLCs within the next 30 minutes that involve program upload function codes or unusually large data transfers."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]