[
  {
    "information_requirement": "Is an adversary attempting to discover information about the ICS network topology, protocols, or credentials by sniffing network traffic? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0842",
        "name": "Network Sniffing",
        "evidence": [
          {
            "description": "Execution of a known network sniffing tool or packet capture driver on a critical ICS host, such as an Engineering Workstation (EWS) or Human-Machine Interface (HMI).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, HMIs, and other Windows-based systems within the Process Control Network (PCN).",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) on critical ICS assets. Maintain a watchlist of executable names associated with network sniffing tools (e.g., 'wireshark.exe', 'tcpdump.exe', 'rawcap.exe', 'tshark.exe'). Generate an alert upon the execution of any process on this list. Additionally, monitor for new service installations (Windows Event ID 7045) and flag any service whose name or description suggests network capture or promiscuous mode capabilities."
          },
          {
            "description": "A host on the ICS network exhibits anomalous network connection patterns, such as communicating with an abnormally high number of unique peers, which can be a byproduct of a sniffer resolving addresses or mapping the network.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting PLCs, RTUs, and SCADA servers; network choke points between the IT and OT networks.",
            "action": "Using Zeek conn.log, create a baseline for each critical ICS host (e.g., EWS, HMI, SCADA server) of its typical network 'fan-out' - the number of unique destination IP addresses it communicates with in a 24-hour period. Calculate the 95th percentile for this count for each host. Trigger an alert if a host's daily unique destination IP count exceeds this established statistical threshold, indicating potential network discovery activity."
          },
          {
            "description": "A new or unexpected communication flow is observed using unencrypted protocols known to be vulnerable to sniffing for credentials or sensitive commands (e.g., Telnet, FTP, Modbus, DNP3).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data historians, SCADA servers, and network segments carrying administrative or industrial protocol traffic.",
            "action": "Using Zeek conn.log, establish a baseline of all source-destination-port combinations that regularly communicate using unencrypted industrial (e.g., Modbus on TCP/502) or administrative (e.g., Telnet on TCP/23, FTP on TCP/21) protocols. Generate an alert if a new, previously unseen host pair begins communicating over these protocols. Further, analyze the volume (orig_bytes + resp_bytes) for established connections and alert if the byte count for a given unencrypted session exceeds 3 standard deviations from the historical average for that specific connection pair, potentially indicating bulk data capture."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]