[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via removable media? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0847",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688 or Sysmon Event ID 1) is observed on an ICS endpoint where the process image path originates from a removable drive letter (e.g., 'E:\\', 'F:\\'). The event is considered suspicious if the process hash is not on an established allowlist, the parent process is unexpected (e.g., not explorer.exe for user-initiated actions), or the process command line contains indicators of obfuscation or suspicious file types (.scr, .bat, .lnk).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Data Gateways, SCADA Servers, Portable technician laptops, any Windows-based ICS endpoint with USB/removable media access.",
            "action": "1. Symbolic Logic (Pattern Matching): In a SIEM, create a rule to detect (Windows Event ID 4688 OR Sysmon Event ID 1) where the process image path matches a regex for removable drives (e.g., '^[D-Z]:\\\\.*'). Generate a high-severity alert if the process's SHA256 hash is not in a pre-defined allowlist of approved software for that asset type. Escalate priority if the process name is svchost.exe, rundll32.exe, or cmd.exe and the parent process is explorer.exe, or if the command line executes a file from a hidden directory like 'RECYCLER' or 'System Volume Information'. 2. Statistical Method (Baseline Deviation): For each ICS asset, establish a 90-day rolling baseline of (ParentProcessName, ProcessName) tuples for all executions originating from removable media. For each new execution, if the tuple has never been observed for that asset, flag it as a zero-day occurrence. Additionally, calculate the Shannon entropy of the command line arguments. Alert if the entropy score is in the 95th percentile or higher for that asset, suggesting obfuscation or packed commands. 3. Machine Learning (Classification): Train a Random Forest classifier to distinguish between benign and malicious process executions from removable media. Use features from Sysmon Event ID 1 such as: ProcessName entropy, CommandLine length, CommandLine entropy, parent process name, is_signed, signature_status, and user context (e.g., is_system_account). In real-time, score new process events originating from removable media. Trigger an alert if the model's maliciousness confidence score exceeds 0.90."
          },
          {
            "description": "Following a process execution from removable media (as per the first evidence), correlated network connection events (Zeek conn.log) from the same host show communication to an external (non-RFC1918) or non-standard internal destination within a 5-minute window. Suspicious characteristics include connections to known malicious IPs/domains, unusual ports/protocols for the asset, anomalous data volumes, or suspicious TLS parameters (e.g., a rare JA3/JA3S hash, self-signed certificate).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The IT/OT network boundary, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Perimeter firewalls, Network Intrusion Detection Systems (NIDS) at the IT/OT boundary, ICS network switches and routers where Zeek sensors are deployed.",
            "action": "1. Symbolic Logic (Correlation and IOC Matching): Create a SIEM correlation rule that triggers when a process execution from removable media is followed within 5 minutes by a network connection from the same host IP. Generate a high-severity alert if the destination IP or domain (from Zeek dns.log 'query' field) matches a threat intelligence feed of known C2 servers. Additionally, alert if Zeek ssl.log shows a JA3 or JA3S hash matching a known malicious hash, or if the 'validation_status' is 'self-signed certificate' and the destination is external. Check Zeek files.log for outbound file transfers of archive types (.zip, .rar) not related to approved business processes. 2. Statistical Method (Behavioral Anomaly): For each ICS asset, create a 30-day rolling baseline of network behavior including: unique destination IPs per hour, distribution of destination ports, and average data volume (orig_bytes + resp_bytes) per connection. Following a removable media event, monitor the asset's network traffic. Alert if the number of unique destination IPs in the next hour exceeds the 98th percentile of the baseline, or if a connection uses a destination port that falls below the 1st percentile of historical usage for that asset. 3. Machine Learning (Time-Series Anomaly Detection): For each critical ICS asset, train an Isolation Forest model on 1-minute time-series aggregations of network data. Features should include: connection count, unique destination port count, total bytes, ratio of outbound to inbound bytes, and count of failed connection states (e.g., 'REJ'). After a removable media process execution is detected, feed the subsequent 10 minutes of network data from that asset into the model. An anomaly score exceeding a dynamically tuned threshold (e.g., 0.85) indicates a significant deviation from normal network behavior and should be alerted on."
          },
          {
            "description": "Within 10 minutes of a process execution from removable media, a persistence mechanism is created on the same ICS asset. This is evidenced by a new service creation (Windows Event ID 7045), a new scheduled task (Windows Event ID 4698 or Sysmon Event ID 1), or a new registry autorun key modification (Sysmon Event ID 13).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 7045",
              "Windows Event ID 4698",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, SCADA Servers, any Windows-based ICS endpoint with USB/removable media access.",
            "action": "1. Symbolic Logic (Correlation): Create a SIEM rule to correlate a process execution from removable media (Event ID 4688/1) on a host with a subsequent persistence event (Event ID 7045, 4698, or Sysmon 13) on the same host within 10 minutes. Alert if the 'ImagePath' of the new service or the command in the new scheduled task points to a file in a temporary or user-writable directory (e.g., 'C:\\Users\\Public\\', 'C:\\Windows\\Temp\\') or the removable drive itself. 2. Statistical Method (Rarity Analysis): For each class of ICS asset (e.g., EWS, HMI), create a baseline of common service names, scheduled task names, and autorun key paths. When a new persistence entry is detected following a removable media event, calculate the Jaccard distance or a similar string similarity metric between the new entry's name/path and the historical baseline. An entry with a very low similarity score (e.g., below the 5th percentile) is highly anomalous and should be investigated. 3. Machine Learning (Clustering): On a weekly basis, collect all new persistence entries (services, tasks, run keys) from critical ICS assets. Use a clustering algorithm like DBSCAN on features such as name entropy, path depth, creating user account, and presence of encoded commands. Analyst review of the resulting clusters can identify small, outlier clusters representing suspicious persistence techniques. Any new persistence event following a removable media execution that falls into a known-suspicious or outlier cluster should trigger an immediate high-priority alert."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]