[
  {
    "information_requirement": "Is an adversary attempting to modify controller logic via a program download?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0843",
        "name": "Program Download",
        "evidence": [
          {
            "description": "Network traffic containing specific ICS protocol function codes for 'program download' or 'write block' originates from an IP address not on the approved list of Engineering Workstations, or occurs at a statistically anomalous time.",
            "data_sources": [
              "Zeek s7.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN)",
            "action": "Analyze Zeek s7.log for function codes related to program download/write (e.g., 'Write Var', 'Download block'). Establish and maintain a baseline of authorized source IPs (Engineering Workstations) and destination IPs (PLCs). Use a simple lookup to alert on any download command from a source IP not in the authorized baseline. For temporal analysis, calculate the hourly frequency of downloads over a 30-day period to identify typical maintenance windows. Generate an alert if a download occurs in an hour with a historically low frequency (e.g., bottom 10th percentile)."
          },
          {
            "description": "A program download is initiated from an Engineering Workstation by a user account without the necessary privileges or by an anomalous process.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS)",
            "action": "Correlate network events from Zeek conn.log (connections on ICS ports like S7's TCP/102) with host events on the source EWS. For a given connection, identify the source process using Windows Event ID 4688 and its associated user context from the logon event (Windows Event ID 4624). Cross-reference the user against a list of authorized engineering personnel. An alert is generated if the user is not on the list or if the parent process is not approved engineering software (e.g., initiated by powershell.exe)."
          },
          {
            "description": "A controller's operating mode is changed to 'STOP' or 'PROGRAM' immediately prior to a program download, creating a suspicious sequence of events.",
            "data_sources": [
              "Zeek s7.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN)",
            "action": "Create a stateful analytic that looks for a sequence of events in Zeek s7.log for a specific PLC. The sequence is: (1) a 'Stop CPU' command, followed by (2) a 'Download block' or 'Write Var' command within a short time window (e.g., 5 minutes). Baseline the source IPs that perform this sequence. Alert if the sequence is initiated by an IP not in the established baseline of Engineering Workstations or occurs outside a designated maintenance period."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]