[
  {
    "information_requirement": "Is an unauthorized device acting as a master/control server on the ICS network? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0848",
        "name": "Rogue Master",
        "evidence": [
          {
            "description": "Control commands (e.g., Modbus write requests, DNP3 control relay output blocks) originate from an IP address that is not an authorized master server.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The ICS network segment containing master servers and outstations (PLCs, RTUs).",
            "action": "Maintain an authoritative asset inventory of designated master server IP and MAC addresses. Continuously monitor ICS protocol logs (e.g., Zeek modbus.log) for write/control function codes. For each command, join the source IP with the asset inventory. Generate a high-severity alert for any control command originating from an IP address not on the authorized master list."
          },
          {
            "description": "An outstation (e.g., PLC, RTU) establishes a network connection with a new or previously unknown server acting as a master.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic ingress/egress points for the process control network.",
            "action": "Using Zeek conn.log, establish a baseline of normal communication pairs (source IP -> destination IP, destination port) for all outstations on the network over a 30-day period. Create a state table or lookup file of these 'blessed' communication channels. Continuously monitor for new communication pairs involving an outstation and an unknown master IP. Calculate the rarity of the new source IP across the entire network; a source IP seen communicating with only one or a few outstations for the first time is highly suspicious and should be flagged for investigation."
          },
          {
            "description": "A known master server's IP address is suddenly associated with a new, unknown MAC address, potentially indicating an ARP spoofing attack to impersonate the legitimate master.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek arp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The legitimate master servers and Engineering Workstations (EWS).",
            "action": "Create and maintain a static IP-to-MAC address mapping for critical ICS assets, especially the primary master server. Monitor Zeek logs (arp.log, conn.log) for changes to this mapping. Use descriptive statistics to track the number of unique MAC addresses associated with the master IP over rolling time windows. An alert should be triggered if a new MAC address is associated with the master IP or if the count of associated MACs exceeds 1."
          },
          {
            "description": "The legitimate master server application or service stops unexpectedly, which could be a precursor to a rogue master taking over communications.",
            "data_sources": [
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The primary and backup master/control servers.",
            "action": "On the legitimate Windows-based master server(s), monitor for Windows Event ID 7036, which logs service state changes. Filter for the specific name of the control system master service (e.g., 'FactoryTalk HMI Server', 'WinCC Runtime'). Any event indicating the service has entered the 'stopped' state outside of a planned maintenance window should be treated as a high-priority alert for potential service disruption or takeover."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]