[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via removable media? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0847",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process is created from an executable located on a removable drive on a critical ICS asset. This is a primary indicator of either autorun functionality or a user manually executing a payload from a USB device.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles.",
            "action": "Monitor for Windows Event ID 4688 (Process Creation). For each event, parse the 'New Process Name' or 'Process Command Line' to extract the drive letter. Maintain a list of known, fixed system drives (e.g., C:, D:). Alert on any process execution originating from a drive letter not in the fixed list. To reduce false positives from legitimate technician activity, establish a frequency baseline for executable names launched from removable media. A process name that is statistically rare or has never been seen before should be prioritized as a high-confidence alert."
          },
          {
            "description": "An ICS host initiates anomalous network traffic immediately following a process launch from removable media. This could indicate malware beaconing for command and control across the IT/OT boundary or attempting lateral movement within the control network.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The IT/OT network boundary, Engineering Workstations (EWS), any ICS asset with network connectivity.",
            "action": "Correlate process creation events from removable media (Windows Event ID 4688) with network connection logs (Zeek conn.log) from the same source host occurring within a short time window (e.g., 5 minutes). Establish a baseline of normal network traffic for each critical ICS asset, including common destination IPs, ports, and protocols. Use descriptive statistics to model normal connection duration and data volume. Generate an alert when a host makes a connection to a destination IP not in its baseline, or when connection metrics like duration or bytes transferred exceed the 95th percentile of the historical distribution for that asset, immediately following a USB-based process execution."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]