[
  {
    "information_requirement": "Is an adversary attempting to upload PLC logic for reconnaissance or analysis? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0845",
        "name": "Program Upload",
        "evidence": [
          {
            "description": "A network session on an ICS programming port (e.g., TCP/102 for S7comm, TCP/44818 for EtherNet/IP) originating from a PLC where the data transferred to the client (e.g., EWS) is anomalously large or contains specific program upload function codes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps or SPAN ports on Process Control Network (PCN) switches, specifically monitoring traffic between Purdue Model Level 1 (Control Devices) and Level 2 (Supervisory Control).",
            "action": [
              "Query ICS protocol logs (e.g., zeek s7comm.log, enip.log) for specific function codes related to program or block uploads (e.g., S7comm function 'Upload' (0x1A), EtherNet/IP service 'Get_Attribute_All' (0x01) on a Logic object). Correlate the destination IP with a maintained whitelist of authorized Engineering Workstations (EWS). Trigger a high-priority alert if an upload command is observed destined for an unauthorized device or occurs outside a documented maintenance window.",
              "For each unique PLC-to-client IP pair on ICS programming ports, establish a 30-day rolling baseline of the mean and standard deviation for 'resp_bytes' from Zeek conn.log, aggregated in 5-minute intervals. Generate an alert when the aggregated 'resp_bytes' for a single interval exceeds the 99th percentile or deviates by more than 3 standard deviations from its historical mean, indicating an unusually large data transfer from the PLC.",
              "Train an unsupervised time-series anomaly detection model (e.g., ARIMA or an autoencoder) on network flow data features from Zeek conn.log, including total 'resp_bytes', total 'orig_bytes', and connection count, aggregated in 5-minute windows for each PLC. The model should learn the normal communication patterns of each device. Deploy the model to flag any time window where the reconstruction error or anomaly score exceeds a dynamically tuned threshold, indicating a significant deviation from normal data transfer behavior."
            ]
          },
          {
            "description": "An ICS engineering application (e.g., TIA Portal, Studio 5000) is launched on an Engineering Workstation (EWS) by an unauthorized user, from a non-standard file path, or by an unusual parent process (e.g., powershell.exe), and is immediately followed by a network connection to a PLC.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Detection and Response (EDR) agents or host-based logging on Engineering Workstations (EWS) and Human-Machine Interfaces (HMIs) located at Purdue Model Level 2.",
            "action": [
              "Create and enforce a strict whitelist for ICS software execution. Query for process creation events (Windows Event ID 4688) where the 'ProcessName' matches a known engineering application but the 'ParentProcessName' is not on an approved list (e.g., not 'explorer.exe'). Generate a high-priority alert if an engineering application is spawned by a command shell, script interpreter, or an unapproved remote administration tool.",
              "For each ICS engineering application, calculate the Shannon entropy of the 'CommandLine' argument string for every execution event (Windows Event ID 4688). Establish a 30-day baseline of the average entropy. Generate an alert when a new execution's command line entropy exceeds the 98th percentile of the baseline, suggesting unusually complex or randomized arguments which may indicate scripting or obfuscation.",
              "Train a supervised classification model (e.g., Random Forest) using labeled historical host event data. Features should include 'ProcessName', 'ParentProcessName', 'CommandLine' entropy, and the user account from Windows Event ID 4688. The model should be trained to classify process executions as 'Legitimate-Engineering-Activity' or 'Anomalous-Execution'. Deploy the model to classify new process creations in real-time and alert on any execution classified as anomalous."
            ]
          },
          {
            "description": "A successful logon to an Engineering Workstation (EWS) with multiple anomalous attributes (e.g., rare source IP, unusual time, non-standard logon type) is immediately followed by network activity consistent with a PLC program upload.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory domain controllers, EDR agents on Engineering Workstations (EWS), and network sensors monitoring traffic between the EWS and PLCs.",
            "action": [
              "Create a rule that triggers on a successful logon event (Windows Event ID 4624) to an EWS where the 'LogonType' is remote (e.g., Type 10) and the source IP is not from a whitelisted management subnet. If this occurs, immediately correlate the EWS IP with network logs (Zeek) for any subsequent connection to a PLC on an ICS programming port (e.g., TCP/102, TCP/44818) within the next 10 minutes. Escalate to a high-priority alert if such a correlated connection is found.",
              "For each user account that accesses an EWS, create a multi-faceted statistical baseline using logon events (Windows Event ID 4624) over 30 days, profiling typical logon hours, source subnets, and logon types. Assign a risk point for each deviation in a new logon event (e.g., +1 for off-hours, +2 for new subnet). If the total risk score for a logon session exceeds a predefined threshold (e.g., 3 points), generate a medium-priority alert for anomalous user authentication.",
              "Implement a User and Entity Behavior Analytics (UEBA) model that profiles EWS logon and subsequent network activity. The model, such as an Isolation Forest or a one-class SVM, should be trained on features from Windows Event ID 4624 (user, source IP, time of day, logon type) and correlated Zeek conn.log data (destination IP, destination port, bytes transferred). The model will assign an anomaly score to each user session. Generate a high-priority alert when a session's score falls into the top 1% of anomalous scores, indicating a significant behavioral deviation from the user's established norm."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]