[
  {
    "information_requirement": "Is an adversary attempting to evade detection by masquerading malicious files as legitimate ICS software or processes? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0849",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A process is executed with a name commonly associated with legitimate ICS software (e.g., RSLinx.exe, FTView.exe) but from an unusual or non-standard file path, such as a temporary directory or user profile folder.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), ICS Application Servers",
            "action": "Establish and maintain a baseline of standard execution paths for all known ICS vendor software and common system utilities. Monitor process creation events (Windows Event ID 4688) to extract the process name and full executable path. For each event, compare the execution path against the established baseline for that specific process name. Use a simple lookup or hash table for validation. Generate an alert for any process whose name matches a baselined application but whose path is anomalous, particularly if originating from directories like C:\\Users\\*, C:\\Temp\\, or C:\\Windows\\Temp\\."
          },
          {
            "description": "A file on disk has a name that mimics a legitimate ICS configuration file or executable, but its file extension is suspicious or it has a double extension designed to trick operators (e.g., 'Project_Update.zip.exe').",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File shares, Engineering Workstations (EWS), Operator Stations",
            "action": "Enable object access auditing for critical file directories containing ICS project files and software. Monitor file creation and modification events (Windows Event ID 4663) and parse the 'Object Name' field. Apply a rule-based search to identify file names containing double extensions (e.g., .pdf.exe, .zip.exe, .rtf.scr). Calculate entropy scores for filenames to detect unusually long or random names attempting to hide an extension. Alert on high-entropy names or those matching the double-extension pattern, especially for newly created files."
          },
          {
            "description": "A process masquerading as a common system utility (e.g., svchost.exe) that is not typically associated with direct user interaction or network-intensive tasks, initiates an external network connection to a rare or untrusted destination.",
            "data_sources": [
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments (Control/Process LAN), Corporate-to-ICS DMZ, Internet Gateway",
            "action": "Correlate host and network data. Use Windows Event ID 5156 ('The Windows Filtering Platform has permitted a connection') to identify the application name making an outbound connection from a critical ICS asset. Concurrently, analyze Zeek conn.log to baseline normal outbound traffic patterns (destination IPs, ports, ASNs) for these assets. Create a statistical model of normal behavior for common system processes like 'svchost.exe', 'lsass.exe', etc. An alert should be triggered when a process like 'svchost.exe' initiates a connection (seen in Event ID 5156) that corresponds to a network session in conn.log with characteristics falling outside a 95th percentile baseline, such as connecting to a new or rare ASN, using a non-standard port, or exhibiting an unusual data transfer volume."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]