[
  {
    "information_requirement": "Is an adversary attempting to discover the communication patterns and device roles within the ICS network? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0840",
        "name": "Network Connection Enumeration",
        "evidence": [
          {
            "description": "Execution of built-in network discovery utilities (e.g., netstat.exe, arp.exe) via a command-line interface on a critical ICS host, such as an Engineering Workstation or HMI.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWs), Human-Machine Interfaces (HMIs), Historian Servers",
            "action": "Monitor for process creation events (Windows Event ID 4688) on designated ICS hosts where the process name is 'netstat.exe', 'arp.exe', or 'nbtstat.exe' and the parent process is 'cmd.exe' or 'powershell.exe'. Establish a baseline of legitimate administrative activity and alert on any executions that deviate, especially if they occur outside of scheduled maintenance windows or are initiated by non-administrative user accounts."
          },
          {
            "description": "An internal host, not authorized as a network management or security tool, initiates connections to a large number of unique hosts or ports within the process control network in a short time frame.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS network segments (Process Control Network - PCN), Network choke points between IT and OT networks (DMZ)",
            "action": "Using Zeek conn.log, create a 5-minute sliding window to count the number of unique destination IPs and destination ports per source IP. Establish a baseline for this connection fan-out for all hosts. Use a statistical threshold (e.g., any source exceeding the 95th percentile of unique destinations) to flag potential internal scanning activity. Whitelist known network scanners and asset management tools to reduce false positives."
          },
          {
            "description": "A non-standard client host attempts to establish connections with multiple devices on ports associated with common ICS protocols (e.g., Modbus, DNP3, S7comm).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) subnets containing PLCs, RTUs, and other field controllers",
            "action": "Filter Zeek conn.log for traffic destined for common ICS ports (e.g., 502, 20000, 102). For each source IP initiating these connections, count the number of unique destination hosts. Alert when a source IP that is not a known HMI, SCADA server, or Engineering Workstation attempts to connect to multiple (e.g., >5) hosts on these ports within a 10-minute window. Calculate the entropy of destination ports per source IP; a low entropy score (targeting one or two specific ports) combined with a high destination host count is a strong indicator of protocol-specific enumeration."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]