[
  {
    "information_requirement": "Is an adversary attempting to upload and exfiltrate PLC logic for reconnaissance? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0845",
        "name": "Program Upload",
        "evidence": [
          {
            "description": "Observed network traffic originating from a PLC destined for an Engineering Workstation (EWS) or other non-PLC device, where the `resp_bytes` value in Zeek conn.log for a single session or aggregated over a short period (e.g., 5 minutes) significantly exceeds a predefined threshold (e.g., >1MB) or deviates by more than 3 standard deviations from the historical average for that specific PLC-client pair. This transfer is observed on ICS programming ports (e.g., TCP/102 for S7comm, TCP/44818 for EtherNet/IP) and is not consistent with known, scheduled operational polling or legitimate program downloads/uploads.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps/SPAN ports on Process Control Network (PCN) switches, particularly at Level 1.5/2 (between Control Devices and Supervisory Control/EWS) of the Purdue Model; also at the ICS Demilitarized Zone (DMZ) firewall for potential exfiltration.",
            "action": "1. **Symbolic Logic (Rule-based Protocol Command Matching):** Monitor `zeek s7comm.log` and `zeek enip.log` for specific `function_code` values or `Service Code` values that explicitly indicate a program upload or read operation (e.g., S7comm `function_code = 0x1A` (Upload), EtherNet/IP `Service Code = 0x4B` (Upload Data)). Alert immediately if such a code is detected originating from a PLC to an unauthorized destination IP or if the event occurs outside of scheduled maintenance windows. 2. **Statistical (Baseline Deviation for Data Volume):** For each unique (PLC IP, EWS IP, Destination Port) communication pair, establish a 7-day rolling baseline of `resp_bytes` and `orig_bytes` for connections on ICS programming ports (e.g., TCP/102, TCP/44818). Alert when a single session's `resp_bytes` or `orig_bytes` (from PLC) exceeds the 99th percentile or is greater than the mean plus 3 standard deviations of the historical baseline for that specific pair, indicating an unusually large data transfer. 3. **Machine Learning (Time Series Anomaly Detection):** Apply an unsupervised time-series anomaly detection model (e.g., Isolation Forest or an autoencoder) to the aggregated `resp_bytes` and `orig_bytes` (from PLC) for all connections between PLCs and EWS within rolling 5-minute windows. Flag and alert on sustained deviations that generate an anomaly score exceeding a predefined threshold (e.g., 0.8), indicating a significant and unusual increase in data transfer volume from PLCs over time, specifically excluding known scheduled activities and legitimate program downloads."
          },
          {
            "description": "A process creation event (`Windows Event ID 4688`) for an ICS engineering application (e.g., TIA Portal, Studio 5000) where the `ParentProcessName`, `CommandLine`, `User`, or `InitiatingProcessPath` deviates from a defined whitelist or historical baseline. This activity is immediately followed by or concurrent with an outbound network connection from the host (`Windows Event ID 5156`) to a PLC's programming port (e.g., TCP/102, TCP/44818).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint agents on Engineering Workstations (EWS) and Human-Machine Interfaces (HMIs) within the PCN, specifically monitoring process execution and network connections.",
            "action": "1. **Symbolic Logic (Whitelist/Blacklist Rule for Process Execution):** Create a whitelist of authorized `User` accounts, `ParentProcessName` values, and `ProcessPath` values for known ICS engineering applications (e.g., `Siemens.Automation.Portal.exe`, `Studio5000.exe`). Alert on any `Windows Event ID 4688` where an engineering application is launched by a user not in the whitelist, from a `ProcessPath` not in the whitelist (e.g., `C:\\Users\\Public\\Downloads\\`), or spawned by an unusual `ParentProcessName` (e.g., `powershell.exe`, `cmd.exe` directly). 2. **Statistical (Command-Line Entropy & Frequency Analysis):** For each unique engineering application process, track the daily execution count and calculate the Shannon entropy of its `CommandLine` arguments over a 30-day rolling period. Alert if the daily execution count exceeds the 99th percentile of its historical average or if the `CommandLine` entropy deviates by more than 3 standard deviations from the historical mean, indicating unusual or randomized parameters. Additionally, identify rare or never-before-seen command-line arguments using a frequency analysis over the same period. 3. **Machine Learning (Behavioral Anomaly & Correlation):** Develop a supervised machine learning model (e.g., a Random Forest classifier or XGBoost) trained on historical `Windows Event ID 4688` (process creation) and `Windows Event ID 5156` (outbound network connection) data from EWS. Features should include `User`, `ProcessName`, `ParentProcessName`, `CommandLine` entropy, `DestinationIP`, `DestinationPort` (specifically ICS programming ports), and `TimeOfDay`. The model should classify activity as 'normal' or 'anomalous'. Alert when a high anomaly score is generated for process creation of an engineering application followed by an outbound connection to a PLC, indicating a likely unauthorized program upload attempt."
          },
          {
            "description": "A `Windows Event ID 4624` (Successful Logon) on an Engineering Workstation (EWS) exhibits multiple anomalous characteristics simultaneously (e.g., source IP not from known subnets, logon occurring outside of typical working hours for that user, or `LogonType` inconsistent with historical patterns). This anomalous logon is immediately followed by outbound network connections from the EWS to a PLC on ICS programming ports (e.g., TCP/102, TCP/44818) with characteristics indicative of a program upload (e.g., large `resp_bytes` or specific function codes).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory domain controllers (for centralized authentication logs), endpoint agents on Engineering Workstations (EWS), and network taps/SPAN ports on PCN switches between EWS and PLCs.",
            "action": "1. **Statistical (Multi-Factor Baseline Deviation for Logon):** For each `Windows Event ID 4624` (Successful Logon) on EWS assets, establish a 30-day rolling baseline for the associated user account, encompassing typical `LogonTime` (e.g., hourly distribution, day of week), `SourceIpAddress` (e.g., /24 subnet or specific host list), and `LogonType`. Flag logons that simultaneously deviate from the baseline by more than 2 standard deviations across at least two different metrics (e.g., `SourceIpAddress` and `LogonTime`), or represent a completely new `LogonType` for that user on that EWS. 2. **Symbolic Logic (Rule-Based Correlation with Upload Activity):** If an anomalous logon (as identified in step 1) occurs on an EWS, within the subsequent 15 minutes, query `Zeek conn.log`, `zeek s7comm.log`, and `zeek enip.log` for outbound connections initiated from that EWS to PLCs on ICS programming ports (e.g., TCP/102, TCP/44818). Generate a high-priority alert if these connections contain program upload function codes (e.g., S7comm `function_code = 0x1A`) or exhibit `resp_bytes` exceeding a predefined threshold for a typical program upload (e.g., >1MB), correlated with the anomalous logon user. 3. **Machine Learning (User Entity Behavior Analytics - UEBA):** Implement a UEBA model (e.g., an unsupervised anomaly detection model like Isolation Forest or a deep learning autoencoder) that assigns a risk score to user logons on EWS. The model should analyze multiple features such as `LogonTime`, `DayOfWeek`, `SourceIpAddress` geolocation, previous logon history, `LogonType`, and frequency of EWS access. Flag and alert on logons that generate a high-risk score (e.g., top 1% of scores), indicating a significant deviation from the user's established normal behavior profile for EWS access, especially when followed by activity to PLCs."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]