[
  {
    "information_requirement": "Is an adversary attempting to modify controller logic via a program download? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0843",
        "name": "Program Download",
        "evidence": [
          {
            "description": "Network traffic captured in Zeek logs indicates an ICS program download or write operation (e.g., S7Comm 'Download Block', 'Write Var') originating from an IP address not on an established allow-list of authorized Engineering Workstations (EWS), or the activity occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek s7.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments with PLCs, network taps at key aggregation points in the PCN, DMZ between IT/OT networks, Engineering Workstation subnet.",
            "action": "1. Symbolic Logic: Query Zeek s7.log for function codes related to program modification (e.g., 'Download Block', 'Write Var'). For each event, cross-reference the source IP address ('id.orig_h') with a managed allow-list of authorized EWS IPs. Generate an alert if the source IP is not on the list. Additionally, check if the event timestamp falls outside of pre-defined maintenance windows; if so, generate a separate, medium-severity alert. 2. Statistical Method: For each unique PLC ('id.resp_h'), establish a baseline of hourly program download event counts over the last 90 days, separating counts inside and outside of maintenance windows. Calculate the mean ($$ \\mu $$) and standard deviation ($$ \\sigma $$) for non-maintenance window activity. Generate an alert if the current hourly download count for a PLC outside a maintenance window exceeds a threshold of $$ \\mu + 3\\sigma $$. 3. Machine Learning: Train an Isolation Forest model using features from Zeek s7.log and conn.log for each program download event. Features should include source IP, destination IP, S7 function, day of week, hour of day, and connection duration. A high anomaly score for a program download event indicates a significant deviation from normal engineering activity and should trigger an alert for analyst review."
          },
          {
            "description": "A successful user logon (Windows Event ID 4624, Logon Type 3 or 10) or a new process creation (Windows Event ID 4688) on an Engineering Workstation occurs within 60 seconds of a network connection to a PLC on an ICS protocol port (e.g., TCP/102). The user account or process name associated with the host activity is not on an approved allow-list for engineering operations.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Active Directory domain controllers, SIEM/Log Aggregator platform, Network sensors capturing traffic between EWS and PLCs.",
            "action": "1. Symbolic Logic: Create a SIEM correlation rule that triggers on a Zeek conn.log entry where the destination port ('id.resp_p') is a known ICS protocol port. Within a 60-second window, search for a logon event (4624) or process creation event (4688) on the source host ('id.orig_h'). Alert if the 'TargetUserName' from event 4624 or the 'ProcessName' from event 4688 is not on a pre-defined allow-list of authorized engineering users and applications for that specific EWS. 2. Statistical Method: For each EWS, create a historical baseline of (User, ProcessName, Destination_PLC_IP) tuples observed over a 30-day period and calculate their frequency. Alert if a new, never-before-seen tuple is observed initiating a connection to a PLC. Additionally, alert if a historically rare tuple (e.g., in the bottom 5th percentile of frequency) is observed, as this may indicate the infrequent use of a malicious tool. 3. Machine Learning: Train a Random Forest classifier on Windows Event ID 4688 data from EWS. Use features such as 'ParentProcessName', 'CommandLine' arguments, the Shannon entropy of the 'CommandLine' string, 'User', and 'ProcessName'. Label data based on known-good engineering software behavior versus suspicious or unauthorized processes. Alert when a process that initiates a PLC connection is classified as 'malicious' with a confidence score greater than 0.9."
          },
          {
            "description": "A sequence of commands is observed in Zeek s7.log where a PLC's operating mode is changed to a non-run state (e.g., 'STOP', 'PROGRAM') via a 'CPU Control' function, followed by a 'Download Block' or 'Write Var' command within a 5-minute window. This sequence either originates from an unauthorized source IP or occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek s7.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments monitored by Zeek, specifically traffic to and from PLCs, and a centralized log analysis platform capable of stateful sequence detection.",
            "action": "1. Symbolic Logic: Implement a stateful correlation rule that triggers upon observing an S7 'Stop CPU' command ('function: CPU_control', 'param_function: STOP'). The rule should store the (source_ip, plc_ip) tuple and a timestamp. If a 'Download Block' or 'Write Var' command is seen from the same tuple within 5 minutes, check if the source_ip is on the authorized EWS allow-list AND if the event occurs within a scheduled maintenance window. If either condition is false, generate a high-severity alert. 2. Statistical Method: For each PLC, analyze historical maintenance logs to calculate the distribution of the time delta ($$ \\Delta t $$) between 'Stop CPU' and subsequent 'Download Block' commands. Calculate the 5th and 95th percentiles of these deltas. Generate an alert if a newly observed sequence has a $$ \\Delta t $$ that falls outside this established range, as this indicates an abnormally fast (potentially automated) or slow (potentially manual and hesitant) operation that deviates from standard procedure. 3. Machine Learning: Develop a Hidden Markov Model (HMM) for each major PLC model in the environment, trained on sequences of S7 commands from Zeek s7.log. The states of the HMM represent operational phases (e.g., 'Running', 'Maintenance', 'Fault'). Generate an alert when a sequence of commands, such as Stop -> Download, has a low probability under the trained model, indicating a transition sequence that is not characteristic of normal operations or maintenance for that specific device."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]