[
  {
    "information_requirement": "Is an adversary attempting to discover systems on the ICS network? (TA0102 - Discovery)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0846",
        "name": "Remote System Discovery",
        "evidence": [
          {
            "description": "A single host initiates an abnormally high volume of connections or connection attempts to a large number of unique hosts or ports within the OT network, consistent with network sweeping or scanning.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, OT/IT DMZ, Engineering Subnet",
            "action": "From Zeek conn.log, group by source IP (`id.orig_h`) and calculate the count of unique destination IPs (`id.resp_h`) and destination ports (`id.resp_p`) over rolling 5-minute windows. Establish a baseline for these counts for each host. Use statistical methods to alert when a host's unique destination count exceeds the 95th percentile of its normal behavior. Focus on common discovery protocols like ICMP or connection attempts to common management ports (e.g., 22, 135, 445) across a subnet."
          },
          {
            "description": "Execution of built-in command-line utilities for network discovery on critical ICS assets like Engineering Workstations (EWS) or HMIs.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, HMIs, Data Historians",
            "action": "Monitor Windows Event ID 4688 for new process creation. Filter for common discovery command-line executables (e.g., `ping.exe`, `arp.exe`, `nbtstat.exe`, `net.exe`). Establish a baseline of normal process execution and parent-child relationships on these critical systems. Alert on deviations, such as a non-interactive process spawning these tools, or execution with arguments indicative of sweeping a network range (e.g., within a script)."
          },
          {
            "description": "A host previously unassociated with administrative or engineering functions is observed sending ICS-specific discovery or broadcast requests to multiple devices on the control network.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control System LAN, connections to PLCs and RTUs",
            "action": "Using Zeek logs with ICS protocol parsers (e.g., S7comm, ENIP, Modbus), monitor for discovery-related function codes or commands (e.g., EtherNet/IP List Identity requests). Group by source host and count the number of unique destination hosts receiving these discovery requests in a 10-minute window. Compare this count against a learned baseline of normal device interactions. A sudden spike in discovery requests from a non-engineering host or a business network host is a high-fidelity indicator of malicious discovery."
          },
          {
            "description": "A process on an Engineering Workstation or HMI makes an unusually large number of failed connection attempts to other systems on the OT network.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, ICS Network Segments",
            "action": "Correlate process creation (Windows Event ID 4688) on a source host with network connection logs (Zeek conn.log) originating from that same host. For a given process, analyze the `conn_state` field in Zeek. A high ratio of 'REJ' (connection rejected) or 'RSTO' (connection reset by originator) states to 'SF' (normal establishment) for a single process across many destination IPs indicates a potential port scan or discovery sweep."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]