[
  {
    "information_requirement": "Is an adversary using valid accounts to move laterally between ICS assets? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0859",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful authentication event (Windows Event ID 4624, Logon Type 3 or 10) on a critical ICS asset (e.g., HMI, EWS, Historian) where the source workstation, destination asset, and user account tuple is not explicitly authorized. This is identified by correlating the Windows login with network connection logs (Zeek conn.log) and comparing the resulting (id.orig_h, id.resp_h, TargetUserName) tuple against a pre-approved, time-bound access control list.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), Historian Servers, Active Directory/Authentication servers, Network switches/routers in critical OT segments, IT/OT DMZ gateways, Jump Servers, Safety Instrumented Systems (SIS), Distributed Control Systems (DCS) controllers.",
            "action": [
              "Create a SIEM rule to trigger on Windows Event ID 4624 with Logon Type 3 (Network) or 10 (RemoteInteractive) on designated critical ICS assets. Enrich the event with the source IP (id.orig_h) from Zeek conn.log using the destination IP and timestamp. Compare the resulting (id.orig_h, ComputerName, TargetUserName) tuple against a maintained allow-list of authorized lateral movement paths. Generate a high-severity alert for any successful login not on the allow-list.",
              "For each unique (ComputerName, TargetUserName) pair on critical ICS assets, profile the historical set of source IP addresses (id.orig_h) used for successful logins over the last 90 days. Calculate the rarity of each source IP for that pair. Generate a medium-severity alert when a successful login occurs from a source IP never before seen for that asset-user combination, or from a source IP that falls below the 1st percentile of historical usage frequency.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled historical login data (malicious vs. benign). Engineer features from Windows Event ID 4624 and Zeek logs, including: source IP subnet, destination asset role (HMI, EWS, etc.), user account privilege level, time of day as a cyclical feature, day of week, and a feature indicating if the source-destination-user triplet is new. Deploy the model to score all new lateral movement attempts, alerting on any login with a predicted malicious probability exceeding a tuned threshold, such as > 0.85."
            ]
          },
          {
            "description": "A network connection using a high-privilege administrative protocol (e.g., RDP, SSH, WinRM, SMB) is observed between ICS assets, or from an IT host to an ICS asset, that violates a defined access policy. Violation is defined as either a connection from an unauthorized source/destination pair or a connection exhibiting anomalous data transfer volumes compared to its historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network switches and routers in critical OT segments, Firewalls at network boundaries (e.g., IT/OT DMZ), Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Jump Servers, Remote Access Gateways, Historian Servers, Process Control Networks (PCN) assets, Data Diodes.",
            "action": [
              "Implement a SIEM rule that filters Zeek logs for connections to critical ICS assets where `service` is 'rdp', 'ssh', or 'winrm'. Correlate with Windows Event ID 4624 on the destination to get the TargetUserName. Compare the (Source_Asset_Role, Destination_Asset_Role, User_Group, Protocol) against a strict 'ICS Administrative Access Control Matrix'. Generate a critical alert for any connection that is not explicitly permitted by the matrix.",
              "For each permitted administrative connection path (Source IP, Destination IP, Protocol), establish a time-series baseline of connection frequency and total bytes transferred (orig_bytes + resp_bytes) per hour. Calculate the 99th percentile for both metrics over a 90-day period. Generate a high-priority alert if the hourly connection count or data volume for an established path exceeds this 99th percentile threshold, indicating unusually high activity.",
              "Apply an unsupervised anomaly detection model (e.g., Isolation Forest) to all administrative connections within the OT network. Create a feature vector for each connection including: source IP, destination IP, port, protocol, duration, and total bytes. Train the model on a 90-day baseline of normal activity. Score each new connection in real-time and alert on any connection that the model flags as a significant outlier (e.g., top 0.5% of anomaly scores), suggesting a novel or abusive connection pattern."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has an adversary created or compromised a valid account for persistent access to the ICS environment? (PIR)",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0859",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A new local or domain user account is created on a critical ICS asset (Windows Event ID 4720), and this new account is subsequently added to a high-privilege administrative group (e.g., Administrators, Remote Desktop Users) on that asset within a short time window (e.g., less than 10 minutes), particularly if the activity is not documented in a corresponding change request.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory/LDAP servers, Local security logs on EWS/HMIs/Historian Servers, Configuration management systems for PLCs/RTUs (if applicable), Patch Management/Change Management systems, Jump Servers.",
            "action": [
              "Create a SIEM correlation rule that triggers on a Windows Event ID 4720 (A user account was created) on any host within the NAI. If a subsequent Event ID 4732, 4728, or 4756 (A member was added to a security-enabled group) for the same TargetUserName occurs on the same host within 10 minutes, escalate the alert to critical. Automatically query the change management system API for an approved change matching the user, host, and time; if none exists, flag for immediate incident response.",
              "Analyze all new account creations (Event ID 4720). First, calculate the entropy of the TargetUserName and alert if it is unusually high, such as > 4.0, suggesting a randomly generated name. Second, calculate the Levenshtein distance between the new TargetUserName and all existing privileged account names (e.g., 'Administrator', 'svc_historian'); alert if the distance is 1 or 2, indicating potential typosquatting. Third, baseline the hourly rate of account creations per asset role (e.g., EWS, DC); alert if the rate exceeds the 99.9th percentile of the historical distribution.",
              "Train a supervised classification model (e.g., Logistic Regression) to predict the likelihood of a new account creation being malicious. Engineer features from Event ID 4720 such as: TargetUserName length and entropy, CreatorProcessName, time of day, day of week, a boolean for whether the name contains 'admin' or 'svc', and a boolean for whether a privilege-escalation event (e.g., 4732) occurred within 10 minutes. Deploy the model to score all new account creations and generate a high-priority alert for any creation with a predicted malicious probability over a tuned threshold, such as > 0.95."
            ]
          },
          {
            "description": "A privileged user account, designated for OT operations, successfully authenticates to a critical ICS asset (Windows Event ID 4624) from a source IP address not associated with a known, approved management location (e.g., a specific jump server or engineering subnet), or uses a login type (e.g., Logon Type 3 - Network) that is anomalous for that user's typical remote access behavior (e.g., they always use Logon Type 10 - RemoteInteractive via RDP).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Jump servers, Firewalls (IT/OT boundary), Active Directory/Authentication servers, Network switches/routers in critical OT segments, Endpoint devices (EWS, HMIs, Historian Servers), Remote Access Gateways.",
            "action": [
              "For each privileged OT account, maintain an explicit allow-list of (Source_IP_Subnet, Destination_Asset_Role, Permitted_Logon_Type). Create a SIEM rule to trigger on Event ID 4624 for these accounts. Enrich with the source IP from Zeek conn.log. Generate a critical alert if the observed (Source_IP, Destination_Asset, Logon_Type) tuple violates the allow-list. Additionally, enrich the source IP with GeoIP data and alert if the country of origin is unexpected or has never been seen for that account.",
              "For each privileged OT user, build a historical profile of their activity over 90 days, including: set of source IP subnets, distribution of logon types (2, 3, 10), and typical login hours (e.g., 07:00-18:00 M-F). For each new login, apply a risk score: +3 if source subnet is new, +2 if logon type has a historical frequency <5% for that user, +2 if login time is outside typical hours. Alert on any login event with a cumulative score of 4 or more.",
              "Utilize a one-class SVM (Support Vector Machine) or Isolation Forest model for unsupervised anomaly detection on privileged account logins. For each login (Event ID 4624), create a feature vector including: source IP subnet (one-hot encoded), destination asset role (one-hot encoded), logon type (categorical), and time of day/day of week (cyclical features). Train the model on a baseline of known-good login activity. Deploy the model to score new logins in real-time, flagging events with high anomaly scores for analyst investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]