[
  {
    "information_requirement": "Is an adversary using valid accounts to move laterally between ICS assets? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0859",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A user account, especially a service or operator account, authenticates to a critical ICS host (e.g., Engineering Workstation, HMI) from another host within the OT network where it has no operational reason to do so.",
            "data_sources": [
              "Windows Security Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Domain Controllers within the OT network",
            "action": "Correlate successful logins (Windows Event ID 4624) on critical ICS hosts with network connection logs (Zeek conn.log) to identify the source host of the login. Establish a baseline of normal 'source -> destination -> user' login activity. Use a statistical approach, such as identifying first-seen login pairings or calculating the rarity (e.g., bottom 5th percentile of frequency) of a specific user logging into a specific destination host. Flag logins from unusual source systems (e.g., an HMI logging into an EWS) for immediate review."
          },
          {
            "description": "A valid user account is observed initiating administrative protocols like RDP or WinRM between sensitive ICS hosts (e.g., from an HMI to an EWS), where such activity is not standard operational procedure for that account's role.",
            "data_sources": [
              "Windows Security Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting HMIs, EWS, and PLCs; OT DMZ",
            "action": "Filter Zeek conn.log for connections on ports 3389 (RDP) and 5985/5986 (WinRM) between hosts within the control network. Establish a baseline of which accounts and hosts are authorized to use these protocols. Monitor for deviations, such as an operator-level account initiating an RDP session to an EWS. Calculate the entropy of protocols used by each user account over a time window; a sudden spike in entropy (i.e., using a wider variety of protocols than normal) could indicate anomalous activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has an adversary created or compromised a valid account for persistent access to the ICS environment? (PIR)",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0859",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A new user account is created on a critical ICS asset like an Engineering Workstation or a domain controller serving the OT environment, especially outside of a scheduled maintenance window or without a corresponding change request.",
            "data_sources": [
              "Windows Security Event ID 4720"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Domain Controllers serving the OT environment, Historian servers",
            "action": "Alert on every instance of Windows Event ID 4720 (A user account was created) on designated critical ICS assets. Correlate the event with authorized change management tickets. Analyze the new account name for suspicious patterns (e.g., common backdoor names like 'support_svc', 'backup_adm', or slight misspellings of legitimate accounts). Baseline the frequency of account creation; any creation outside of this baseline (e.g., more than 1 per quarter) is highly suspicious."
          },
          {
            "description": "An account with privileges in the OT network authenticates successfully from an external or IT network source, bypassing expected remote access solutions (e.g., jump boxes, VPNs with strict access control).",
            "data_sources": [
              "Windows Security Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "OT DMZ, Internet-facing remote access servers, Authentication servers for the OT environment",
            "action": "Join successful OT host logins (Windows Event ID 4624) with network session data (Zeek conn.log) on the source IP address. Maintain a strict allow-list of approved source IP ranges/subnets for remote access to the OT environment. Generate a high-priority alert for any successful authentication to an OT asset from an IP address not on the allow-list. Use descriptive statistics to identify source IPs that are statistical outliers based on their rarity or geographic origin."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]