[
  {
    "information_requirement": "Is an adversary changing PLC operating modes to bypass security controls or prepare for further action? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0858",
        "name": "Change Operating Mode",
        "evidence": [
          {
            "description": "A PLC operating mode change command (e.g., from 'RUN' to 'PROGRAM' or 'REMOTE') is observed on the network outside of a scheduled and authorized maintenance window.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) monitoring points, particularly network taps between Level 1 (Controllers) and Level 2 (Supervisory Control).",
            "action": "Establish a baseline of normal PLC mode change events by correlating ICS protocol logs (e.g., S7comm 'Set CPU Mode' function) with authorized maintenance schedules. Create a simple statistical model to identify outliers. Alert on any mode change command that occurs on a day or time with a historically zero probability of maintenance activity (e.g., 2 AM on a Sunday) or is not correlated with a work order."
          },
          {
            "description": "A command to change a PLC's operating mode originates from a host that is not an authorized Engineering Workstation (EWS) or is otherwise unexpected.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Process Control Network (PCN), Authentication Logs for OT assets.",
            "action": "Maintain an explicit allowlist of IP addresses for authorized EWS. For every observed PLC mode change command in ICS protocol logs, extract the source IP. Alert if the source IP is not on the EWS allowlist. Use descriptive statistics on Zeek conn.log to find the top talkers to PLCs; investigate any new or low-frequency source IPs that appear and issue mode change commands."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary executing unauthorized program changes by manipulating PLC operating modes? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0858",
        "name": "Change Operating Mode",
        "evidence": [
          {
            "description": "A sequence of commands is sent to a PLC, changing the mode to 'PROGRAM', followed by a 'Program Download' command, and then a change back to 'RUN' mode within a short timeframe.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) monitoring points, subnets containing critical PLCs.",
            "action": "Implement a stateful detection rule that tracks interactions with each PLC. Trigger a high-severity alert if the following event sequence is observed from a single source IP to a single destination PLC within a 30-minute window: [Event 1: Mode Change to Program/Remote], [Event 2: Program Download], [Event 3: Mode Change to Run]. This sequence strongly indicates malicious logic deployment and execution."
          },
          {
            "description": "An unusual or unauthorized process on an Engineering Workstation (EWS), such as a script interpreter (powershell.exe), initiates a network connection that results in a PLC mode change command.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS).",
            "action": "When a PLC mode change is detected in network traffic (Zeek s7comm.log), pivot to the source EWS's host logs. Correlate the network connection details (IPs, ports, timestamp from Zeek conn.log) with process creation events (Windows Event ID 4688). Alert if the process initiating the connection is not the standard, GUI-based PLC programming software (e.g., TIA Portal, Studio 5000) but is instead a command-line utility, script, or unrecognized binary."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]