[
  {
    "information_requirement": "Is the adversary spoofing reporting messages to hide the true state of the industrial process? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0856",
        "name": "Spoof Reporting Message",
        "evidence": [
          {
            "description": "Reporting messages for a specific ICS field device exhibit protocol-level sequence number or timing anomalies. This includes duplicate sequence numbers from the same source within a short window, non-monotonic sequence number progression (a number decreases or resets without a corresponding protocol-level reset command), or gaps in sequence numbers. Additionally, the inter-arrival time (IAT) between messages deviates significantly from the device's configured reporting frequency.",
            "data_sources": [
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments monitoring Level 1 (Basic Control) devices (PLCs, RTUs, IEDs), the Level 2 (Supervisory Control) network, and Industrial Demilitarized Zone (IDMZ) network segments where ICS protocol traffic (DNP3, Modbus, IEC 61850) is captured and processed.",
            "action": [
              "Create a SIEM rule to alert when a Zeek dnp3.log entry shows a dnp3.seq_num or a modbus.log shows a modbus.trans_id from the same id.orig_h that is a duplicate of one seen in the last 5 seconds. Create a second rule to detect when a sequence number from a specific id.orig_h decreases without a corresponding 'Cold Restart' (DNP3 Function Code 13) or 'Restart Communications Option' (Modbus Function Code 8) command observed targeting the device in the preceding 60 seconds.",
              "For each unique device (id.orig_h), calculate the inter-arrival time (IAT) between its messages using Zeek log timestamps. Over a 30-day rolling window, establish the 5th and 95th percentiles for the IAT. Generate an alert if the current IAT falls outside this established range. Additionally, calculate the Shannon entropy of the sequence number increments (current_seq - previous_seq) over a 1-hour window. A sudden drop in entropy below a baseline threshold (e.g., from 3.5 to <1.0) indicates a fixed, repeating, or non-random sequence characteristic of a replay attack.",
              "Implement a multivariate time series anomaly detection model, such as an LSTM Autoencoder, to monitor sequence number, IAT, and message payload size (from conn.orig_bytes) for each critical device. Train the model on 90 days of baseline Zeek dnp3.log and conn.log data. The model should generate an alert when its reconstruction error for the live message stream exceeds a dynamically adjusted threshold based on a moving average and standard deviation of past errors."
            ]
          },
          {
            "description": "A specific telemetry point (e.g., pump pressure, valve position) reported via an ICS protocol shows a value that is physically implausible or contradicts a correlated value from a separate, trusted source. For example, a valve reports 'closed' (value 0) in Zeek modbus.log while a downstream flow meter simultaneously reports significant flow in Zeek dnp3.log.",
            "data_sources": [
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek iec61850.log",
              "Windows Application Event Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SCADA servers, Process Historian servers, HMI workstations, Engineering Workstations, and network segments where ICS protocol traffic is captured (e.g., Level 2 Supervisory Control Network, Industrial Demilitarized Zone).",
            "action": [
              "Create a SIEM correlation rule that triggers when a Process Historian logs a physics-based alarm (e.g., 'High pressure for Tank A' in Windows Application Event Log) but Zeek logs (dnp3.log, modbus.log) for the associated sensor on Tank A (id.orig_h) show a pressure value within the normal operational range within the same 30-second window.",
              "For physically linked processes (e.g., pump speed and pipe flow rate), ingest their time-series data from Zeek logs. Perform a continuous cross-correlation analysis on the two data streams over a 5-minute sliding window. Establish a baseline correlation coefficient (e.g., 0.95) during normal operation. Generate an alert if the real-time correlation coefficient drops below a critical threshold (e.g., < 0.5), suggesting one of the signals is no longer reflecting the physical reality.",
              "Train a supervised classification model (e.g., XGBoost) using historical telemetry from both primary ICS protocol logs and trusted secondary sources (e.g., historian database). Use features including the primary value, secondary value, their difference, and contextual data like the device's operational mode. Label data points as 'divergent' if the difference exceeds a physics-based threshold. Deploy the model to predict 'divergent' states in real-time with a confidence score >0.9."
            ]
          },
          {
            "description": "An ICS protocol reporting message (e.g., DNP3, Modbus) is observed where the source IP address (id.orig_h) or source MAC address (id.orig_l2_addr) in Zeek logs does not match the authoritative entry for that field device in a centrally managed asset inventory. Alternatively, the communication originates from a VLAN or subnet not designated for process control traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek iec61850.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Level 0 (Process Control) and Level 1 (Basic Control) network segments, Level 2 (Supervisory Control) network segments, Industrial Demilitarized Zone (IDMZ), and network gateways between IT and OT environments.",
            "action": [
              "Enrich a SIEM watchlist with the authoritative asset inventory of all OT devices, including their assigned IP and MAC addresses. Create a rule that cross-references every Zeek conn.log entry containing an ICS service (dnp3, modbus) against this watchlist. Alert if the log's id.orig_h or id.orig_l2_addr does not match the registered entry for that device.",
              "For each unique ICS device (id.orig_h), establish a 60-day baseline for the ratio of conn.orig_bytes to conn.resp_bytes from Zeek conn.log. Calculate the mean and standard deviation of this ratio. Generate an alert if the current ratio for a new connection deviates more than 3 standard deviations from the mean, indicating a potentially malformed or spoofed packet that elicits an unusual response.",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest) on network flow metadata from Zeek conn.log for each ICS device. Use features such as conn.orig_bytes, conn.resp_bytes, conn.duration, and the entropy of destination ports contacted by the source IP over a 5-minute window. Generate an alert when the model assigns a high anomaly score (>0.75) to a flow, indicating a deviation from its typical communication pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary spoofing reporting messages to mislead operators and impair process control? (PIR)",
    "tactic_id": "TA0106",
    "tactic_name": "Impair Process Control",
    "indicators": [
      {
        "technique_id": "T0856",
        "name": "Spoof Reporting Message",
        "evidence": [
          {
            "description": "An ICS protocol message reports a value that falsely indicates a critical or emergency state (e.g., extreme pressure, temperature) intended to trigger an unnecessary automated safety shutdown or mislead an operator into taking incorrect, process-impairing action. The reported value is contradicted by other physically correlated sensors or appears as an instantaneous, physically impossible jump.",
            "data_sources": [
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Application Event Logs",
              "Windows Security Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI workstations, Engineering Workstations, SCADA servers, and the Level 2 Supervisory Control network where operator actions and alarms are logged.",
            "action": [
              "Create a correlation rule that triggers if a critical alarm value (e.g., DNP3 value > 99th percentile of historical range) is reported in dnp3.log, but no corresponding operator logon (Windows Security Event ID 4624) or command was observed on the HMI in the preceding 5 minutes, and a physically correlated sensor (e.g., downstream flow) remains in a normal state.",
              "For each critical sensor value, calculate the rate of change between consecutive measurements from Zeek logs. Establish a baseline of the historical maximum rate of change for that physical process. Generate an alert if the currently observed rate of change exceeds 3 standard deviations of this baseline, as a spoofed value often manifests as a physically impossible instantaneous jump (a step function).",
              "Train a classification model (e.g., Random Forest) on historical data labeled with 'true alarm' and 'normal' states by process engineers. Use features including the reported value, its rate of change, values from 3-5 correlated sensors, and recent HMI operator activity. Deploy the model to classify incoming critical alerts in real-time as 'likely spoofed' or 'likely authentic'."
            ]
          },
          {
            "description": "A sudden burst of multiple, non-critical alarms are generated from various field devices within a short time frame (e.g., >10 alarms in 2 minutes). These alarms lack physical correlation and may appear erratic, consistent with an attempt to create 'alarm fatigue' or distract operators from a separate, simultaneous, and more critical event.",
            "data_sources": [
              "Windows Application Event Logs",
              "Zeek conn.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Central Alarm Servers, Process Historian, HMI workstations, and the Level 2 Supervisory Control Network.",
            "action": [
              "Create a SIEM rule that alerts when the count of distinct alarm events in the Windows Application Log from the central alarm server exceeds a threshold (e.g., 20) within a 5-minute window. This indicates a potential 'alarm flood' condition.",
              "Calculate the Shannon entropy of alarm source IPs (id.orig_h in Zeek logs that correspond to alarms) over a 10-minute sliding window. A sudden spike in entropy indicates that alarms are originating from a wider and more unusual variety of sources than normal. Generate an alert if the entropy value exceeds the 98th percentile of its historical baseline.",
              "Use a clustering algorithm (e.g., DBSCAN) on alarm events, using features like timestamp, device_ID, and alarm_priority. A dense cluster of low-priority alarms from disparate devices appearing suddenly would be flagged as an anomalous cluster, indicative of a coordinated distraction or impairment attack."
            ]
          },
          {
            "description": "A reporting message is spoofed to indicate a normal or 'all-clear' state for a critical safety system (e.g., flame detector, pressure relief valve sensor) while another part of the process is being actively manipulated into a dangerous state. The spoofed 'all-clear' message prevents the Safety Instrumented System (SIS) from triggering as intended.",
            "data_sources": [
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments monitoring Safety Instrumented Systems (SIS), network taps between PLCs and SIS controllers, and the Process Historian.",
            "action": [
              "Based on process engineering logic, create a high-priority SIEM rule: IF a control command (e.g., DNP3 function code for write/operate) is sent to a primary process device (e.g., main boiler valve) to enter a high-risk state, AND the associated safety sensor (e.g., flame detector) does NOT change state in its corresponding Zeek log within the expected time window, THEN generate a critical alert for a potential safety bypass.",
              "Monitor the heartbeat or 'keep-alive' messages from SIS devices. Calculate the jitter (standard deviation of inter-arrival times) for these reporting messages over a 1-hour window. A jitter value approaching zero (e.g., below the 1st percentile of the historical baseline) is highly suspicious and suggests a perfectly timed replay attack is being used to spoof a 'healthy' signal.",
              "Implement a time-series forecasting model (e.g., ARIMA) on a non-manipulated, but physically related, process variable (e.g., fuel flow rate into a boiler). If the model's forecast for a dependent variable (e.g., temperature) significantly diverges from the value being reported by the (potentially spoofed) temperature sensor, it indicates a physics violation. Generate an alert when the prediction error for the safety sensor's value exceeds a dynamic threshold for more than 60 seconds."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]