[
  {
    "information_requirement": "Is an adversary capturing screen data from Human-Machine Interfaces (HMIs) or Engineering Workstations (EWS)? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0852",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "An unusual or non-standard process associated with screen capture capabilities is executed on a critical ICS asset.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations",
            "action": "Monitor for process creation events (Windows Event ID 4688) on critical ICS assets like HMIs and EWS. Establish a strict baseline of allowed applications and processes for these systems. Alert on the execution of any process not on the established baseline, paying special attention to built-in Windows tools that can perform screen captures (e.g., 'psr.exe', 'SnippingTool.exe') or scripting engines ('powershell.exe') that are not part of normal operations. Calculate the rarity of each new process execution across the population of HMIs; a process appearing on only one machine is a high-confidence indicator of anomalous activity."
          },
          {
            "description": "Image files (.png, .jpg, .bmp) are created in unusual locations or by unexpected parent processes on an HMI or EWS.",
            "data_sources": [
              "Windows Event ID 11 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI/EWS local file systems, particularly temporary directories (%TEMP%, %APPDATA%) and user profile folders.",
            "action": "On HMI and EWS endpoints, monitor for file creation events (Sysmon Event ID 11) with image file extensions (.png, .jpg, .bmp). Baseline the legitimate processes that create these files (e.g., HMI software saving a report). Generate an alert when an image file is created in a temporary directory by a process not on the baseline, such as 'cmd.exe' or 'powershell.exe'. Further analyze by calculating the entropy of the filename; high-entropy (random-looking) filenames can be indicative of automated tool output."
          },
          {
            "description": "An HMI or EWS initiates an outbound network connection with a data payload size significantly larger than its normal operational baseline, potentially indicating the exfiltration of captured screen images.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, OT/IT Network Boundary, Purdue Model Level 2/3 systems",
            "action": "Analyze Zeek conn.log data for all connections originating from HMIs and EWS. For each source IP, establish a statistical baseline for the 'orig_bytes' field, calculating the mean, standard deviation, and 95th percentile over a 30-day window. Trigger an alert for any new connection where the 'orig_bytes' value exceeds the 95th percentile or is more than 3 standard deviations above the mean. Enrich these alerts with destination IP reputation data to prioritize connections to unknown or suspicious external addresses."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]