[
  {
    "information_requirement": "Is an adversary changing PLC operating modes to bypass security controls or prepare for further action? (TA0103 - Evasion)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0858",
        "name": "Change Operating Mode",
        "evidence": [
          {
            "description": "An S7comm 'Set CPU Mode' command (function_code 0x29) or an EtherNet/IP 'Set Attribute Single' service (service_code 0x10, Class 0x91, Instance 1, Attribute 8) targeting a PLC is observed, where the new mode is 'PROGRAM', 'REMOTE', or 'STOP'. The command's execution timestamp is cross-referenced with operational logs and is found to not correlate with a pre-approved, scheduled maintenance window.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek conn.log",
              "Maintenance Schedule Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network monitoring points (e.g., network taps, SPAN ports) on Level 1 (Control Network) and Level 2 (Supervisory Network) segments, and at the boundary of the Industrial DMZ (IDMZ) to capture all PLC-related traffic.",
            "action": [
              "Implement a SIEM rule that parses Zeek s7comm.log for `function_code` == 0x29 and Zeek enip.log for `service_code` == 0x10 targeting the specified class/instance/attribute. Upon a match, extract the event timestamp, source IP, and destination PLC IP. The rule must then query an external data source (e.g., a maintenance schedule database or CSV lookup file) to verify if the timestamp falls within an approved window for that specific PLC. Generate a high-severity alert if the activity occurs outside of any approved window.",
              "For each PLC, ingest Zeek s7comm.log and enip.log data over a rolling 30-day period, excluding known maintenance windows, to establish a baseline of normal mode change activity. Calculate the 99th percentile for the hourly count of mode change commands, grouped by source-destination pair and day of the week. Generate an alert if the current hourly count for any PLC-source pair exceeds its established percentile threshold, indicating an abnormal frequency of changes.",
              "Develop a time-series anomaly detection model (e.g., using the Prophet or an LSTM-based autoencoder framework) for each critical PLC using historical Zeek log data. Engineer features such as the count of mode change events per hour, the specific mode being set (as a categorical feature), and the source IP subnet. Train the model to learn the normal cadence and patterns of these changes. Deploy the model to score new events in real-time; trigger an alert when a mode change event or a sequence of events within a time window has a high anomaly score, indicating a significant deviation from the learned forecast."
            ]
          },
          {
            "description": "An ICS protocol command changing a PLC's operating mode (e.g., S7comm 'Set CPU Mode' or EtherNet/IP 'Set Attribute Single') is observed in network traffic, where the source IP address is not present on an authoritative allowlist of authorized Engineering Workstations (EWS), maintenance laptops, or designated jump servers for the OT environment.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Asset Inventory Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing Engineering Workstations (EWS), jump servers, and maintenance access points. Also, Level 1 (Control Network) and Level 2 (Supervisory Network) segments to monitor all communications to PLCs, and industrial firewall logs at the IT/OT boundary.",
            "action": [
              "Maintain a reference set or lookup table in the SIEM containing the IP addresses of all authorized Engineering Workstations and jump servers. Create a correlation rule that triggers when a mode change command is detected in Zeek s7comm.log or enip.log. The rule's logic is to alert if the `id_orig_h` (source IP) field from the Zeek log is not a member of the authorized IP address reference set.",
              "For each PLC, establish a 30-day rolling baseline of unique source IPs that have initiated mode change commands. Use a set-based comparison to identify any source IP in the current 24-hour period that is not present in the 30-day historical baseline. Trigger a medium-severity alert for any mode change command originating from such a 'new' IP. This detects first-time interactions without relying on a static allowlist.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) to distinguish between authorized and unauthorized connections initiating mode changes. Use historical, labeled data where connections from known EWS IPs are 'authorized' (0) and others are 'unauthorized' (1). Features should include network-level data from Zeek conn.log (`id_orig_p`, `proto`, `duration`, `orig_bytes`, `resp_bytes`, `conn_state`) and categorical features like time-of-day and day-of-week. Deploy the model to score new connections associated with mode changes; alert when a connection is classified as 'unauthorized' with a confidence score above 0.9."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary executing unauthorized program changes by manipulating PLC operating modes? (TA0104 - Execution)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0858",
        "name": "Change Operating Mode",
        "evidence": [
          {
            "description": "A specific three-event sequence is observed from a single source IP to a single destination PLC IP within a 15-minute window: (1) a command to change the operating mode to 'PROGRAM' or 'REMOTE', followed by (2) a program download command (e.g., S7comm 'Download Block' function_code 0x1B), and then (3) a command to change the operating mode back to 'RUN'.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network monitoring points on Level 1 (Control Network) segments housing critical PLCs, and Level 2 (Supervisory Network) segments connecting PLCs to SCADA/HMI systems and Engineering Workstations (EWS).",
            "action": [
              "Implement a stateful SIEM correlation rule that tracks ICS commands based on a common key (source IP, destination IP). The rule logic should trigger on the detection of the specific three-event sequence in the correct order: [Mode Change to Program/Remote] -> [Program Download] -> [Mode Change to Run]. The entire sequence must occur within a 15-minute sliding window. An alert from this rule signifies a high-confidence, complete program download lifecycle.",
              "For all historically observed, authorized program download sequences, baseline the typical time delta between each step (e.g., T1=time from mode change to download, T2=time from download to run). Calculate the median and interquartile range (IQR) for T1 and T2. Alert if a newly observed sequence has a duration for T1 or T2 that falls outside the outlier threshold of `Q1 - 1.5*IQR` to `Q3 + 1.5*IQR`. Extremely short durations may indicate automated adversary scripts.",
              "Utilize a sequence anomaly detection model, such as a Hidden Markov Model (HMM) or an LSTM-based autoencoder, trained on historical sequences of all ICS commands for each PLC. The model learns the normal transition probabilities between different command states (e.g., the probability of seeing a 'Download' after a 'Read' vs. after a 'Mode Change'). Alert when an observed sequence of commands has a low log-likelihood score as determined by the model, indicating it is a rare or anomalous progression of events."
            ]
          },
          {
            "description": "On an Engineering Workstation (EWS), a process is created (identified by Windows Event ID 4688) from an executable not on an established software allowlist. This process subsequently initiates an outbound network connection to a PLC (identified by Windows Event ID 5156 and Zeek conn.log), which is immediately followed by an ICS mode change command observed in network traffic (Zeek s7comm.log or enip.log) from the EWS to the PLC, with all events correlating within a 60-second window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Software Allowlist Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices designated as Engineering Workstations (EWS) and Maintenance Laptops, monitored via host-based agents (EDR/Sysmon). Also, the network segments where these EWS devices reside to capture their outbound traffic to the OT environment.",
            "action": [
              "Create a SIEM correlation rule that joins three data sources, keyed by the EWS IP address and a 60-second time window. The logic is: TRIGGER on (`Windows Event ID 4688` where `NewProcessName` is NOT IN software_allowlist.csv) IF FOLLOWED BY (`Windows Event ID 5156` where `ProcessID` matches the first event and `DestAddress` is in plc_ip_list.csv) IF FOLLOWED BY (Zeek log `s7comm` or `enip` showing a mode change where `id_orig_h` matches the EWS IP and `id_resp_h` matches the PLC IP). A successful correlation generates a critical alert.",
              "For each EWS, profile the set of parent-child process relationships that normally result in network communication to PLCs. Calculate a baseline of 'normal' process chains (e.g., 'explorer.exe -> TIA.exe'). Use a statistical measure like Jaccard distance or a simple set comparison to detect new or anomalous parent-child process relationships that initiate PLC communication. Alert when a process chain that has never been seen before, or is seen with a frequency exceeding the 99th percentile, communicates with a PLC and is associated with a mode change.",
              "Train a supervised classification model (e.g., XGBoost) using aggregated features from both host and network logs to predict malicious activity originating from an EWS. Host features include `NewProcessName`, `ParentProcessName`, `CommandLine`, and process integrity level. Network features from the resulting connection include `id_resp_p`, `proto`, `duration`, and `orig_bytes`. Label known-good engineering activities as 'benign' (0) and inject synthetic or known-bad data as 'malicious' (1). Deploy the model to alert when a process initiating a connection to a PLC (followed by a mode change) is classified as 'malicious' with high confidence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]