[
  {
    "information_requirement": "Has an adversary successfully tricked an ICS operator or engineer into executing malicious code?",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "Detection of a child process that is a command-line interpreter (e.g., `cmd.exe`, `powershell.exe`) or scripting engine (e.g., `wscript.exe`, `cscript.exe`) spawned by a parent process identified as a common office productivity application (e.g., `winword.exe`, `excel.exe`, `acrord32.exe`, `powerpnt.exe`) on an ICS endpoint, indicative of potential malicious macro or embedded object execution.",
            "data_sources": [
              "Windows Event ID 4688 (Process Creation)",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices within the ICS network, including Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, and ICS DMZ servers; network traffic monitoring points at ICS zone boundaries.",
            "action": "1. **Symbolic Logic:** Implement a SIEM rule to detect `Windows Event ID 4688` where `ParentProcessName` is `winword.exe`, `excel.exe`, `powerpnt.exe`, or `acrord32.exe` AND `NewProcessName` is `cmd.exe`, `powershell.exe`, `wscript.exe`, or `cscript.exe`. Exclude known legitimate processes based on an approved whitelist (e.g., specific vendor update scripts). 2. **Statistical Method:** For all `Windows Event ID 4688` events matching the parent-child process pattern, calculate the historical frequency of this specific parent-child process pair on each host over the last 90 days. Alert if the current observation falls below the 5th percentile of historical frequency or represents a previously unseen (zero frequency) combination for that host. Use descriptive statistics to summarize these frequencies. 3. **Machine Learning Application:** Apply a clustering algorithm (e.g., K-means or DBSCAN) to `Windows Event ID 4688` data, specifically focusing on `ParentProcessName`, `NewProcessName`, and `CommandLine` combinations. Identify clusters representing normal behavior and flag outliers or new clusters that deviate significantly from established normal patterns as potential anomalies. Correlate these anomalous process chains with `Zeek files.log` (looking for file hashes or names) and `Zeek conn.log` (identifying source IP/destinations) to determine if a potentially malicious document was involved and its origin."
          },
          {
            "description": "An executable file, identified by its path originating from a user-writable directory (e.g., `C:\\Users\\*\\Downloads\\`, `C:\\Users\\*\\AppData\\Local\\Temp\\`) or lacking a valid digital signature, is observed initiating an outbound network connection to an external IP address or uncommon port within 60 seconds of its process creation, suggesting C2 or payload delivery.",
            "data_sources": [
              "Windows Event ID 4688 (Process Creation)",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (EWS, HMIs, Maintenance Laptops) within ICS zones; network egress points from the ICS network to the enterprise network or internet; internal network segments where software repositories reside.",
            "action": "1. **Symbolic Logic:** Identify `Windows Event ID 4688` events where `NewProcessPath` contains `\\Users\\` and (`\\Downloads\\` OR `\\AppData\\Local\\Temp\\` OR `\\ProgramData\\`). Cross-reference the executable's hash with known threat intelligence feeds (e.g., VirusTotal, open-source IOCs). If a match is found, immediately alert. 2. **Statistical Method:** For processes originating from user-writable directories, calculate the entropy of the `NewProcessName` field. Alert if the entropy score exceeds a threshold (e.g., > 4.5 bits per byte), which often indicates randomly generated malware filenames. Additionally, for network connections (Zeek conn.log) initiated by these processes, establish a baseline of common destination IP/port pairs for each ICS host over the last 30 days. Flag connections to destinations that are in the bottom 5th percentile of observed frequency for that host or have never been observed before. 3. **Machine Learning Application:** Develop a supervised machine learning model (e.g., Random Forest or Gradient Boosting) trained on historical `Windows Event ID 4688` and `Zeek conn.log` data, using features such as `NewProcessPath`, `ParentProcessName`, `NewProcessCommandLine`, `DestinationIP`, `DestinationPort`, and connection duration. Classify new process executions and their subsequent network connections as benign or suspicious. Prioritize investigation of events flagged as suspicious, especially those with high confidence scores, and correlate with `Zeek dns.log` for domain reputation analysis."
          },
          {
            "description": "An application on an ICS host is observed executing with elevated privileges (indicated by `Token Elevation Type` of 'Type 2' or `%%1937` in `Windows Event ID 4688`), where the application is not present on an approved software whitelist or is observed originating from a temporary/user-writable directory, suggesting unauthorized privilege escalation or execution.",
            "data_sources": [
              "Windows Event ID 4688 (Process Creation)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows-based ICS endpoints, including Engineering Workstations, Human-Machine Interfaces (HMIs), Data Historians, and SCADA servers.",
            "action": "1. **Symbolic Logic:** Establish a strict whitelist of `NewProcessName` and `NewProcessPath` combinations for applications legitimately requiring elevated privileges (`Token Elevation Type` is `%%1937`) on ICS hosts. Create a SIEM rule to alert on any `Windows Event ID 4688` with `Token Elevation Type` `%%1937` where the `NewProcessName` and `NewProcessPath` do NOT match an entry in the approved whitelist. Additionally, flag if `NewProcessPath` contains common temporary or download directory strings. 2. **Statistical Method:** Monitor the frequency of `Token Elevation Type` `%%1937` events for each unique `NewProcessName` and `User` combination on each ICS host over the past 30 days. Calculate the interquartile range (IQR) for this frequency. Alert if the current frequency for a specific process/user/host combination exceeds the upper quartile by 1.5 times the IQR, indicating an abnormally high rate of elevation for that specific application or user. 3. **Machine Learning Application:** Employ a time-series anomaly detection algorithm (e.g., Isolation Forest or Prophet) on the rate of `Windows Event ID 4688` with `Token Elevation Type` `%%1937` per host, segmented by `NewProcessName`. Train the model on historical data to understand normal temporal patterns. Generate alerts for significant spikes or sustained deviations from the predicted normal rate, which could indicate a widespread compromise attempting to gain escalated privileges across multiple ICS assets."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]