[
  {
    "information_requirement": "Has an adversary successfully tricked an ICS operator or engineer into executing malicious code?",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "A Windows Event ID 4688 records a process creation where a parent process (ParentProcessName) from an approved Office application whitelist (e.g., winword.exe, excel.exe, powerpnt.exe, acrord32.exe) on an ICS host launches a child process (NewProcessName) that is a command-line interpreter or scripting engine (e.g., cmd.exe, powershell.exe, wscript.exe, cscript.exe). This event is considered suspicious if the child process's CommandLine contains obfuscated, base64-encoded, or otherwise non-standard arguments, or if the child process initiates an outbound network connection (observable in Zeek conn.log) within 15 seconds of its creation to an unapproved IP address or domain.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices within the ICS network, including Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, and ICS DMZ servers; network traffic monitoring points at ICS zone boundaries (e.g., firewall logs, Zeek sensors).",
            "action": "1. Symbolic Logic: Implement a SIEM rule to detect Windows Event ID 4688 where ParentProcessName is in ('winword.exe', 'excel.exe', 'powerpnt.exe', 'acrord32.exe') AND NewProcessName is in ('cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe'). Further refine by looking for CommandLine arguments in the child process that are indicative of execution (e.g., '/c', '-EncodedCommand', '-File', base64 strings) and are not part of an approved, regularly updated baseline for legitimate ICS applications. Exclude known legitimate processes/command lines based on an approved whitelist for ICS applications. Correlate with Zeek conn.log to flag if the child process initiates any outbound connections to non-whitelisted destinations within 15 seconds. \n2. Statistical Method: For all Windows Event ID 4688 events matching the parent-child process pattern (Office app -> interpreter), calculate the historical frequency of this exact ParentProcessName + NewProcessName + CommandLine combination on each host over the past 90 days. Alert if the current observation's frequency is in the bottom 5th percentile of historical frequency for that host, or if it represents a previously unseen combination. Use descriptive statistics (mean, standard deviation) to characterize normal behavior and flag events exceeding 3 standard deviations from the mean frequency. Additionally, calculate the Shannon entropy of the CommandLine argument for all such events and alert if it exceeds a threshold (e.g., 4.0 bits per byte), indicating potential obfuscation. \n3. Machine Learning Application: Apply an unsupervised anomaly detection algorithm (e.g., Isolation Forest or One-Class SVM) to Windows Event ID 4688 data, specifically focusing on features derived from ParentProcessName, NewProcessName, CommandLine (e.g., length, presence of special characters, entropy), and User. Train the model on historical ICS endpoint process data to establish a baseline of normal activity. Flag events with high anomaly scores (e.g., top 1% by anomaly score), indicating deviations from learned patterns. Correlate these anomalous process chains by ProcessId and timestamp (within 60 seconds) with Zeek files.log (looking for suspicious file hashes or names via threat intelligence lookup or a low reputation score) and Zeek conn.log (identifying unusual outbound connections from the affected host within 120 seconds of the event to destinations with low reputation or to non-standard ports) to determine if a potentially malicious document was involved and its origin."
          },
          {
            "description": "A Windows Event ID 4688 records a process creation where the NewProcessPath indicates execution from a user-writable directory (e.g., C:\\Users\\*\\Downloads\\, C:\\Users\\*\\AppData\\Local\\Temp\\, C:\\ProgramData\\) on an ICS host. Within 30 seconds of this process creation, a corresponding Zeek conn.log entry shows the same process initiating an outbound network connection to an IP address that is not on an approved internal or external whitelist, or to a port not typically used by legitimate applications on that host. Additional indicators of suspicion include an empty or highly randomized NewProcessName, an OriginalFileName or Description field that is absent, or a SigningStatus (from EDR/Sysmon) indicating unsigned or invalid signature.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (EWS, HMIs, Maintenance Laptops, Jump Boxes) within ICS zones; network egress points from the ICS network to the enterprise network or internet; internal network segments where software repositories reside; ICS DMZ network segments.",
            "action": "1. Symbolic Logic: Identify Windows Event ID 4688 events where NewProcessPath contains ('\\Users\\', '\\AppData\\Local\\Temp\\', '\\ProgramData\\') AND NewProcessPath does not match an approved whitelist of software installation paths. Immediately correlate with Zeek conn.log for any outbound connections initiated by the NewProcessId within 30 seconds. Flag connections to non-RFC1918 IPs or IPs not in an approved external whitelist, or to ports not in an approved ICS application port whitelist. Cross-reference the executable's ImageHash (SHA256) with threat intelligence feeds (e.g., VirusTotal, open-source IOCs) and alert on any positive matches. Also, check for SigningStatus (if available from EDR/Sysmon) indicating 'unsigned' or 'invalid', or if the OriginalFileName or Description fields are empty or contain randomized character strings. \n2. Statistical Method: For processes originating from user-writable directories (as identified by NewProcessPath in Windows Event ID 4688), calculate the entropy of the NewProcessName field. Alert if the entropy score exceeds a threshold (e.g., > 4.5 bits per byte), which often indicates randomly generated malware filenames. Additionally, for network connections (Zeek conn.log) initiated by these processes, establish a baseline of common destination IP/port pairs for each ICS host over the last 30 days. Flag connections to destinations that are in the bottom 1st percentile of observed frequency for that host or have never been observed before. Calculate the avg_duration and orig_bytes for these connections and flag those significantly outside (e.g., > 3 standard deviations) of the host's historical normal range for unusual connections. \n3. Machine Learning Application: Develop a supervised machine learning model (e.g., Random Forest or Gradient Boosting) trained on historical Windows Event ID 4688 and Zeek conn.log data, labeled as benign or malicious. Features should include NewProcessPath characteristics (e.g., depth, presence of temp/user folders), ParentProcessName, NewProcessCommandLine entropy, DestinationIP reputation (e.g., IP address block type, ASN), DestinationPort (common/uncommon), connection_duration, and orig_bytes. Classify new process executions and their subsequent network connections as benign or suspicious. Prioritize investigation of events flagged as suspicious, especially those with high confidence scores, and correlate with Zeek dns.log for domain reputation analysis and Zeek x509.log for certificate validation, specifically looking for newly observed domains or self-signed/expired certificates."
          },
          {
            "description": "A process on an ICS host, identified by Windows Event ID 4688, is observed executing with elevated privileges (Token Elevation Type of 'Type 2' or '%%1937' in the event details). This is considered suspicious if the NewProcessName and NewProcessPath do not match an entry in an approved software whitelist for privileged applications, or if the NewProcessPath originates from a temporary or user-writable directory (C:\\Users\\*\\Downloads\\, C:\\Users\\*\\AppData\\Local\\Temp\\, C:\\ProgramData\\).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows-based ICS endpoints, including Engineering Workstations, Human-Machine Interfaces (HMIs), Data Historians, SCADA servers, and Operator Workstations.",
            "action": "1. Symbolic Logic: Establish a strict whitelist of NewProcessName and NewProcessPath combinations for applications legitimately requiring elevated privileges (Token Elevation Type is '%%1937' or 'Type 2') on ICS hosts, including ImageHash (SHA256). Create a SIEM rule to alert on any Windows Event ID 4688 with Token Elevation Type '%%1937' or 'Type 2' where the NewProcessName and NewProcessPath (and optionally ImageHash) do NOT match an entry in the approved whitelist. Additionally, flag if NewProcessPath contains common temporary or download directory strings ('\\Users\\', '\\Temp\\', '\\ProgramData\\') and is not part of a whitelisted installer path. \n2. Statistical Method: Monitor the daily frequency of Windows Event ID 4688 events with Token Elevation Type '%%1937' or 'Type 2' for each unique NewProcessName, User, and NewProcessPath combination on each ICS host over the past 60 days. Calculate the mean and standard deviation for this frequency. Alert if the current daily count for a specific process/user/host combination exceeds the mean by 3 standard deviations, or if a previously unseen combination (zero frequency historically) is observed. Use a rolling window average to adapt to legitimate changes in behavior, recalculating the mean and standard deviation weekly. \n3. Machine Learning Application: Employ a time-series anomaly detection algorithm (e.g., Prophet or ARIMA) on the aggregated count of Windows Event ID 4688 events with Token Elevation Type '%%1937' or 'Type 2' per ICS host, segmented by NewProcessName and User. Train the model on historical data (e.g., 90 days) to understand normal temporal patterns, including daily, weekly, and monthly cycles. Generate alerts for significant spikes or sustained deviations (e.g., outside a 99th percentile prediction interval) from the predicted normal rate, which could indicate a widespread compromise attempting to gain escalated privileges across multiple ICS assets. Further, use a classification model to categorize the CommandLine of elevated processes as benign or malicious based on historical data and features like string length, character set, and presence of known malicious keywords or patterns."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]