[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS environment via spearphishing attachments? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0865",
        "name": "Spearphishing Attachment",
        "evidence": [
          {
            "description": "An internal email recipient, specifically an email address belonging to the 'ICS Engineers' or 'OT Administrators' Active Directory group, or a predefined watchlist of critical personnel (e.g., 'firstname.lastname@org.com'), receives an email from an external domain. This email contains an attachment with a file extension or MIME type from a defined blacklist of suspicious types (e.g., '.exe', '.dll', '.js', '.vbs', '.chm', '.hta', '.lnk', '.iso', '.zip' containing executables, macro-enabled documents like '.docm', '.xlsm', '.pptm', '.pdf' with embedded scripts). The email's subject line or the attachment filename (extracted from Zeek files.log) contains one or more keywords from a defined ICS-specific watchlist (e.g., 'PLC', 'SCADA', 'HMI', 'RTU', 'DCS', 'firmware', 'control system', 'operations', 'plant', 'maintenance', 'update', 'emergency', 'alert', 'outage', 'shutdown', 'production').",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway, OT Network Mail Relay (if present), Corporate-to-OT DMZ, Engineering Workstations (local email client logs), Control System Network (for internal email traffic if applicable)",
            "action": "1. Symbolic Logic: Establish and continuously update watchlists for: 1) high-risk recipient email addresses (e.g., members of 'ICS_Engineers' AD group), 2) ICS-specific keywords (e.g., 'PLC', 'SCADA', 'firmware update'), and 3) suspicious file extensions/MIME types (e.g., '.exe', 'application/x-msdownload', 'application/x-zip-compressed' containing executables). Query Zeek smtp.log for emails where the recipient matches a watchlist entry AND the sender is from an external domain. Correlate these with Zeek files.log (using 'fuid') to identify attachments. Filter for attachments where the 'filename' or 'subject' (from smtp.log) contains an ICS keyword AND the 'mime_type' or 'file_extension' is on the suspicious list. Immediately generate a high-priority alert for any matching event. 2. Statistical Method: For all emails captured by Zeek smtp.log to high-risk recipients from external domains, calculate the Shannon entropy of the attachment filename and, if policy allows, the file content (from files.log). Establish a baseline of expected entropy values for legitimate files and filenames observed over the last 90 days. Alert when an attachment to a high-risk recipient exhibits filename entropy exceeding the 99th percentile of the baseline for known benign filenames, or if the content entropy is characteristic of packed/encrypted malware (e.g., >7.0 bits/byte for a non-encrypted archive). Additionally, track the daily volume of external emails with suspicious attachments to high-risk recipients; alert if this volume deviates by more than 3 standard deviations from the 30-day moving average. 3. Machine Learning: Develop a supervised machine learning model (e.g., Gradient Boosting Classifier) trained on historical email metadata (sender reputation, recipient role, subject line length, presence of ICS keywords, attachment file types, number of attachments, filename entropy, content entropy) to classify incoming emails as 'phishing' or 'benign'. Retrain the model weekly with newly labeled data. Implement a real-time scoring mechanism. Generate a critical alert for emails classified as 'phishing' with a confidence score greater than 0.85, particularly when targeting high-risk ICS roles, and log all classifications for further review."
          }
        ]
      },
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "On an ICS engineering workstation, HMI, or operator console, Windows Event ID 4688 (A new process has been created) shows a known legitimate application (e.g., 'WINWORD.EXE', 'EXCEL.EXE', 'ACROBAT.EXE') as the 'ParentProcessName' and an unexpected child process as 'NewProcessName'. The 'NewProcessName' is a command-line interpreter ('cmd.exe'), scripting engine ('powershell.exe', 'wscript.exe', 'cscript.exe'), or system utility ('rundll32.exe', 'mshta.exe', 'certutil.exe'). The 'NewProcessCreationTime' for this event occurs within 300 seconds (5 minutes) of a successful user login (Windows Event ID 4624) by the same user on the same host, and within 600 seconds (10 minutes) of an email receipt event (from Zeek smtp.log or local email client logs) containing an attachment on the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Human-Machine Interfaces (HMIs), Operator Consoles, Jump Servers within the OT network",
            "action": "1. Symbolic Logic: Monitor Windows Event ID 4688 on all hosts within the NAI. Create a whitelist of approved parent-child process relationships for common applications (e.g., 'WINWORD.EXE' spawning 'OUTLOOK.EXE' for email, or 'ACROBAT.EXE' spawning 'AcroRd32.exe'). Immediately alert on any instance where a document-handling application ('WINWORD.EXE', 'EXCEL.EXE', 'ACROBAT.EXE') is the 'ParentProcessName' of a command-line interpreter or scripting engine ('cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe') or a known system utility used for execution ('rundll32.exe', 'certutil.exe'), AND this specific parent-child relationship is not on the established whitelist. Correlate the timestamp of the suspicious process creation with recent email activity (Zeek smtp.log) and user logins (Windows Event ID 4624) on the same host. 2. Statistical Method: For each unique parent-child process pair observed via Windows Event ID 4688 on hosts in the NAI, calculate its historical frequency over a 30-day rolling window. Establish a baseline for each host or group of hosts. Alert when a parent-child process pair, particularly involving document-handling applications and scripting engines, occurs at a frequency below the 1st percentile of its historical occurrences (indicating extreme rarity or first-time occurrence) or when its frequency suddenly spikes by more than 3 standard deviations from the mean for a specific host. Additionally, calculate the average time difference between user login and the first process creation by an office application; alert on significant deviations (e.g., >99th percentile) if the subsequent process is a scripting engine. 3. Machine Learning: Implement a process tree anomaly detection model (e.g., using graph embeddings or sequence analysis with a Recurrent Neural Network) on Windows Event ID 4688 data. Train the model on benign process execution patterns from engineering workstations, learning typical sequences and parent-child relationships. Alert when the model identifies a process execution chain that deviates significantly (e.g., anomaly score >0.9) from established benign patterns, especially if the chain originates from a user-launched application (like an office suite) and leads to the execution of suspicious binaries (e.g., 'powershell.exe', 'cmd.exe'). This can help detect polymorphic or previously unseen execution paths that bypass simple whitelists."
          },
          {
            "description": "A process, identified as originating from user execution of a suspicious attachment (e.g., 'cmd.exe' spawned by 'WINWORD.EXE' immediately after an email attachment interaction, as identified by the prior evidence chain), initiates an outbound network connection. The destination IP address or domain is present in a continuously updated threat intelligence feed of known malicious infrastructure (e.g., C2 servers, malware distribution sites). Alternatively, the connection uses a destination port (e.g., 4444, 8080, 53/TCP for non-DNS traffic) not typically observed for the originating host or application (e.g., not in the 95th percentile of historical port usage for that process/host). Or, the connection is to a geographic region (country/ASN) outside of established operational norms for the asset (e.g., not in a predefined whitelist of allowed countries for OT asset communications).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, HMIs, Operator Consoles, OT Network Egress Firewalls, Industrial Demilitarized Zone (IDMZ) Firewalls, Corporate-to-OT DMZ",
            "action": "1. Symbolic Logic: Correlate Windows Event ID 4688 (Process Creation) with Zeek conn.log, dns.log, http.log, and ssl.log where the 'id.orig_h' (source IP) matches the host IP and the 'ts' (timestamp) is within 120 seconds of a suspicious process creation (as identified in the previous action). For each outbound connection, perform a threat intelligence lookup on the 'id.resp_h' (destination IP address) and 'query' (DNS domain). Immediately alert on connections to known malicious IPs, domains, or C2 infrastructure identified by IOC feeds (e.g., STIX/TAXII, MISP). Additionally, maintain a whitelist of approved destination countries/ASNs for ICS assets; alert on connections to destinations outside this whitelist. 2. Statistical Method: For each host in the NAI, establish a baseline of its normal network connection patterns using Zeek conn.log (e.g., common destination IP/port pairs, byte volumes, protocol distribution). Calculate the frequency of unique destination IP addresses, ports, and protocols over a 7-day rolling window. Alert when a connection from a host exhibits a destination IP/port combination that falls below the 1st percentile of historical frequency for that host (indicating extreme rarity) or when the connection volume (bytes_orig or bytes_resp) to a specific destination deviates by more than 3 standard deviations from the host's historical average for that destination. Use entropy calculation on destination ports or application layer protocols (from Zeek http.log or ssl.log) to identify unusual communication patterns; alert if entropy exceeds the 99th percentile of baseline. 3. Machine Learning: Apply an unsupervised anomaly detection algorithm (e.g., Isolation Forest or One-Class SVM) to Zeek conn.log data, specifically focusing on connections originating from hosts within the NAI. The model should consider features such as destination IP, port, protocol, connection duration, total byte counts, and number of distinct connections. Train the model on historical benign network traffic for a minimum of 30 days. Alert when the model identifies connections with high anomaly scores (e.g., >0.9), indicating a significant deviation from learned normal behavior, potentially signaling C2 communication or data exfiltration initiated by a compromised process. Further, use clustering algorithms (e.g., DBSCAN) on connection metadata to identify clusters of similar, but rare, outbound connections that might represent beaconing or C2 channels."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]