[
  {
    "information_requirement": "Is an adversary leveraging standard application layer protocols (e.g., DNP3, Modbus, HTTP) for command and control within the ICS network? (PIR)",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0869",
        "name": "Standard Application Layer Protocol",
        "evidence": [
          {
            "description": "High-fidelity evidence of C2 is a network connection where: (1) Zeek identifies an application protocol (e.g., 'dnp3', 'modbus', 'http'); (2) the destination port is not the IANA-standard port or a documented organizational exception; AND (3) the connection traverses a critical network boundary (e.g., IT-to-OT) or involves a non-RFC1918 IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek service.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Demarcation Points (e.g., firewalls, DMZ), ICS Zone Gateways, Enterprise Network Perimeter, Internet Proxies, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, PLCs, RTUs, Jump Servers.",
            "action": [
              "Search Zeek conn.log for events where `service` is in a defined list of critical protocols (e.g., ['dnp3', 'modbus', 'rdp']) AND `id.resp_p` is NOT in the corresponding list of organization-approved ports. Escalate the alert if `id.orig_h` is in an OT subnet and `id.resp_h` is external (non-RFC1918), or if the connection crosses a defined IT/OT boundary.",
              "On a daily basis, analyze the last 30 days of Zeek conn.log data. For each unique `service`, calculate the usage frequency of every `id.resp_p`. Identify ports falling below the 5th percentile of usage for that specific service. Create a dynamic watchlist of these 'rare' service-port pairs and generate a medium-severity alert when a new connection matches an entry.",
              "Train an Isolation Forest model on historical Zeek conn.log data using features like `proto`, `service`, `id.resp_p`, `duration`, `orig_bytes`, `resp_bytes`, `conn_state`, and flags for external or cross-boundary connections. Deploy the model to score new connections and alert on any connection with an anomaly score exceeding a tuned threshold, indicating a statistically significant deviation from learned normal behavior."
            ]
          },
          {
            "description": "Evidence is one or more of the following measurable deviations from an established baseline for a specific protocol flow (e.g., identified by source/destination IP and port): (1) Data volume (`orig_bytes` or `resp_bytes` in Zeek conn.log) exceeds the 99th percentile for that flow. (2) An ICS protocol message (e.g., Zeek dnp3.log) contains a function code not on a pre-defined allowlist for that specific master-outstation pair. (3) HTTP metadata (e.g., `uri` or `user_agent` in Zeek http.log) has a Shannon entropy score greater than 3 standard deviations above the mean for the source host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), SCADA Servers, Historian Servers, Human-Machine Interfaces (HMIs), DMZ Web Servers, Process Control Networks (PCN) Segments, Enterprise Proxies, Internet Gateways, Domain Controllers, Jump Servers.",
            "action": [
              "For critical DNP3 master-outstation IP pairs, define a strict allowlist of expected `function_code` values from Zeek dnp3.log. Generate a high-severity alert when a transaction is logged with a function code not on the allowlist for that specific communication path. Enrich by flagging concurrent suspicious process creations (Windows Event ID 4688) on the source host.",
              "For each source host in the ICS network, establish a 30-day rolling baseline of the 95th percentile for `orig_bytes` in outbound HTTP requests (Zeek http.log), and the mean/stddev of Shannon entropy for `uri` and `user_agent` fields. Alert if a new request from a host exceeds its data volume baseline or has a URI/user-agent entropy score more than 3 standard deviations above its mean.",
              "For each master-outstation pair, create multivariate time-series data by aggregating Zeek logs into 10-minute windows (e.g., message count, function code distribution, avg duration, total bytes). Train an LSTM Autoencoder on this data to learn the normal operational rhythm. Deploy the model to alert when a new window's reconstruction error exceeds a dynamic threshold, indicating a deviation from learned process behavior."
            ]
          },
          {
            "description": "Evidence is a successful RDP logon (Windows Event ID 4624, Logon Type 10) to a critical ICS asset (e.g., EWS, HMI) that meets at least one of the following anomalous criteria: (1) The `Source Network Address` is an external (non-RFC1918) IP not on an explicit allowlist. (2) The logon time is statistically unusual for that user (e.g., >3 standard deviations from their mean logon hour). (3) The subsequent session duration (calculated from logon/logoff events) exceeds the 99th percentile for that user-asset pair.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4634",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Jump Servers/Bastion Hosts, Domain Controllers, Remote Access VPN Concentrators, IT/OT Demarcation Points, Active Directory Servers.",
            "action": [
              "Implement a SIEM rule to generate a high-severity alert for any successful RDP logon (Windows Event ID 4624, Logon Type 10) where the `Source Network Address` is external (non-RFC1918) AND is NOT on a maintained allowlist of approved IP addresses or subnets. Correlate with Zeek rdp.log to check for anomalous RDP client versions.",
              "For each user-asset pair, analyze the past 90 days of Windows Event ID 4624 to profile logon hours. Alert when a new logon occurs at an hour more than 3 standard deviations from the user's mean. Correlate Logon ID between Event 4624 (logon) and 4634 (logoff) to calculate session durations and alert if a session exceeds the 95th percentile for that pair.",
              "Construct a graph where nodes are users and ICS assets and edges are historical RDP sessions. Train a graph-based anomaly detection model (e.g., using GraphSAGE embeddings) to learn typical connection patterns. Deploy the model to score new RDP sessions and alert on highly improbable connections (e.g., a new edge between disparate clusters) or edges with highly anomalous features (e.g., time, duration, bytes transferred)."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]