[
  {
    "information_requirement": "Has an adversary compromised our OT environment via a trusted supply chain relationship? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0862",
        "name": "Supply Chain Compromise",
        "evidence": [
          {
            "description": "A newly installed or recently patched software/firmware on an OT asset (e.g., HMI, Engineering Workstation) establishes outbound network connections to external IP addresses or domains identified as malicious by threat intelligence, or to destinations not observed in the asset's historical communication baseline within 72 hours of installation/patching.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 4688",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points from OT segments (e.g., OT DMZ firewalls, industrial routers), Engineering Workstations, Human-Machine Interfaces (HMIs), Historian servers.",
            "action": "1. **Symbolic Logic (IOC):** Monitor Windows Event IDs 4697 (Service Installation) and 4688 (Process Creation) on OT assets for new software installations. Within 72 hours of an installation event, query Zeek conn.log, dns.log, and http.log for outbound connections from the affected host. Cross-reference all destination IPs and queried domains against multiple threat intelligence feeds (e.g., AlienVault OTX, MISP) for known malicious indicators (e.g., C2 servers, malware distribution sites). Generate a high-severity alert for any direct matches. 2. **Statistical Method:** For each OT asset, establish a 30-day communication baseline using Zeek conn.log, capturing destination IPs, domains, ports, and protocols. After a new software installation (Windows Event ID 4697/4688), calculate the Jaccard similarity index between the set of unique destination IP/domain pairs observed in the 72 hours post-installation and the set of unique pairs from the preceding 30-day baseline. An index below the 5th percentile of historical Jaccard scores for similar assets indicates a statistically significant deviation, triggering an alert. 3. **Machine Learning Application:** Implement a time-series anomaly detection model (e.g., Isolation Forest or LSTM autoencoder) on the sequence of network connection metadata (e.g., protocol, port, bytes_in, bytes_out, duration) from Zeek conn.log for critical OT assets. Train the model on historical 'normal' behavior. After a software installation, continuously feed real-time connection data into the model; a sustained anomaly score exceeding the top 1% of historical anomaly scores for connections originating from the recently updated host should generate an alert, indicating potential C2 activity or data exfiltration."
          },
          {
            "description": "An executable process, identified by name as a legitimate ICS vendor application, is observed executing from a non-standard file path (e.g., user-writable directories, temporary folders) or is found to lack a valid digital signature from the expected vendor, indicating a potential trojanized component or malicious payload.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices within the Process Control Network (PCN), specifically Engineering Workstations, Human-Machine Interfaces (HMIs), and application servers.",
            "action": "1. **Symbolic Logic (IOC):** Continuously monitor Windows Event ID 4688 (Process Creation) on all OT Windows-based systems. Maintain an allow-list of expected process names and their corresponding legitimate file paths for all critical ICS vendor applications (e.g., 'HMI_Client.exe' should only execute from 'C:\\Program Files\\Vendor\\HMI\\'). Immediately alert on any process creation event where a known legitimate ICS executable name is initiated from a file path not present in the allow-list, or from a path identified as suspicious (e.g., 'C:\\Windows\\Temp\\', 'C:\\Users\\Public\\') or matching known malware paths from threat intelligence. 2. **Statistical Method:** For each process creation event (Windows Event ID 4688), calculate the Shannon entropy of the full file path. Establish a baseline of entropy scores for legitimate application paths on each system. Alert on any process execution where the file path entropy exceeds the 95th percentile of the baseline for that system, particularly if the process originates from a user-writable directory (e.g., AppData, Temp). This indicates potential obfuscation or randomized naming. 3. **Machine Learning Application:** Develop a supervised machine learning classifier (e.g., Random Forest or SVM) trained on historical process creation events (Windows Event ID 4688) with labels for 'benign' and 'malicious' (e.g., known malware executions). Features for the model should include: process name, parent process, command line arguments, file path, directory depth, and file path entropy. Continuously feed new process creation events into the classifier; an alert is generated for any event classified as 'malicious' with a high confidence score, indicating a potential trojanized executable or dropped payload."
          },
          {
            "description": "A control system device (e.g., PLC, RTU, IED) demonstrates significant deviations from its established network communication baseline, such as initiating connections to previously unobserved internal or external IP addresses, utilizing non-standard industrial protocols, or exhibiting unusual data transfer volumes, within 72 hours of a reported firmware update or maintenance activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek modbus.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing critical control system devices (e.g., Level 0, Level 1 of the Purdue Model), industrial firewalls, and network taps near PLCs, RTUs, and IEDs.",
            "action": "1. **Symbolic Logic (IOC):** Monitor Zeek conn.log and specific industrial protocol logs (e.g., modbus.log, dnp3.log) for connections originating from control devices (PLCs, RTUs). Identify any connections to IP addresses or domains explicitly listed in threat intelligence feeds as known malicious C2 servers, botnet infrastructure, or data exfiltration points. Additionally, identify any usage of non-industrial or unexpected ports/protocols (e.g., outbound HTTP/S to public IPs from a PLC) that are not part of an established allow-list for that device. Generate an immediate alert for any direct match or violation. 2. **Statistical Method:** For each control device, establish a 60-day network communication baseline using Zeek conn.log, detailing unique destination IPs, ports, protocols, average connection frequency per hour, and average data volume per connection. After a reported firmware update, continuously compare the device's real-time network behavior against its baseline. Generate an alert if: a new destination IP or port is observed that falls below the 1st percentile of observed activity for similar devices, or if the connection frequency or data volume for an existing connection pair exceeds 3 standard deviations from its historical mean for a sustained period (e.g., 5 consecutive minutes). 3. **Machine Learning Application:** Deploy an unsupervised machine learning anomaly detection model (e.g., Autoencoder or Isolation Forest) on the aggregated network flow features (e.g., source/destination IP/port, protocol, byte counts, duration) from Zeek conn.log for each control device. Train the model on several months of 'normal' device communication data. Post-firmware update, continuously feed the device's network traffic into the trained model. Generate an alert when the model's anomaly score for a device's network activity exceeds a dynamically calculated threshold (e.g., top 1% of historical anomaly scores), indicating a significant shift in communication patterns that could signify compromise."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]