[
  {
    "information_requirement": "Is an adversary attempting to determine the operating state of our PLCs? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0868",
        "name": "Detect Operating Mode",
        "evidence": [
          {
            "description": "Observation of ICS protocol queries (specifically Modbus function code 17/0x11 'Report Slave ID' or S7COMM 'Read SZL' function) directed at PLCs. These queries originate from a source IP address not present in the authorized Engineering Workstation (EWS) or OT management server whitelist. Furthermore, an anomalous scanning pattern is identified where a single source IP queries five or more distinct PLC destination IPs for operating mode within a 5-minute rolling window, and this rate exceeds the 99th percentile of the established 30-day baseline for authorized EWS activity.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Industrial Control System (ICS) Network Zones (e.g., Process Control Network, Cell/Area Zone), Engineering Workstation (EWS) Subnets, OT Network Gateway/Firewall, Supervisory Control and Data Acquisition (SCADA) Servers, Historian Servers, DMZ/Perimeter Firewall.",
            "action": "1. Symbolic Logic: Identify all source IP addresses observed sending Modbus function code 17 (Report Slave ID) or S7COMM 'Read SZL' function requests in Zeek modbus.log or Zeek s7comm.log. Cross-reference these source IPs against a CMDB or authorized EWS/OT management server whitelist. Generate an alert for any source IP not present in the whitelist. 2. Statistical Method: For each source IP, calculate the number of distinct PLC destination IPs queried for operating mode within a 5-minute rolling window. Establish a 30-day baseline for this count for all authorized EWS. Alert if any source IP's distinct PLC query count exceeds the 99th percentile of its historical baseline or the overall network segment baseline, indicating potential enumeration or scanning behavior. 3. Machine Learning: Develop a time-series anomaly detection model (e.g., Isolation Forest or LSTM autoencoder) to analyze the rate of operating mode queries per source IP per hour across the OT network segment. Train the model on 90 days of Zeek modbus.log and s7comm.log data. Generate an alert when the model detects a statistically significant outlier in the query rate, indicating an anomalous spike in activity. 4. Correlation: Upon an alert from any of the above methods, pivot to Zeek conn.log to identify other protocols and destinations initiated by the suspicious source IP. If the source IP is an EWS, query Windows Event ID 4688 logs on that EWS for process creation events corresponding to known ICS engineering software (e.g., TIA Portal, Studio 5000) or suspicious command-line activity (e.g., nmap, plcscan)."
          },
          {
            "description": "A successful remote logon (Windows Event ID 4624, Logon Type 10) to an Engineering Workstation (EWS) where the source IP's geolocation (country/ISP), time of day, or client device generates a multivariate deviation score (e.g., Mahalanobis distance) exceeding the 95th percentile of the user's or EWS's 60-day historical baseline. This anomalous logon is then followed by ICS protocol queries (Modbus function code 17/0x11 or S7COMM 'Read SZL') originating from the same EWS within a 30-minute window.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstation (EWS) Endpoints, Remote Access VPN Concentrators, DMZ Jump Boxes, Active Directory Domain Controllers (for authentication logs), Network Intrusion Detection Systems (NIDS) on EWS subnets, Security Gateways/Perimeter Firewalls.",
            "action": "1. Symbolic Logic: Monitor Windows Event ID 4624 (successful logon) on EWS, specifically filtering for Logon Type 10 (RemoteInteractive). Immediately enrich the Source Network Address with geolocation data (country, city) and ISP information using external threat intelligence or internal geo-IP databases. Cross-reference the Source Network Address against a whitelist of authorized remote access IP ranges (e.g., VPN subnets, trusted partner networks). Generate an alert if the source IP is not whitelisted. 2. Statistical Method: For each user account performing a remote logon to an EWS, establish a baseline of typical logon times (hour of day, day of week), source countries, and source ISPs over the past 60 days. Calculate a multivariate deviation score for each new remote logon based on the Mahalanobis distance, considering these three features. Alert when a logon's deviation score exceeds the 95th percentile of historical scores for that specific user or the EWS group. 3. Machine Learning: Implement a User Behavior Analytics (UBA) model (e.g., a clustering algorithm like K-Means or DBSCAN) on EWS remote logon data (Windows Event ID 4624, Zeek rdp.log). Cluster logons based on features such as source_ip, user, time_of_day, day_of_week, duration, and geolocation. Flag logons that fall into sparse or previously unseen clusters as anomalous. 4. Correlation: Following any alert for an anomalous remote logon, correlate this with Zeek modbus.log or s7comm.log data for the same EWS. Specifically, look for operating mode queries (e.g., Modbus function code 17, S7COMM 'Read SZL') originating from the EWS within 30 minutes of the anomalous logon. Additionally, search Windows Event ID 4688 on the EWS for process executions of known ICS engineering software or suspicious command-line utilities (e.g., powershell, cmd.exe) occurring after the logon and before the PLC queries."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]