[
  {
    "information_requirement": "Is an adversary leveraging standard application layer protocols (e.g., DNP3, Modbus, HTTP) for command and control within the ICS network? (PIR)",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0869",
        "name": "Standard Application Layer Protocol",
        "evidence": [
          {
            "description": "Presence of Zeek conn.log records showing established network connections where the 'service' field identifies a known ICS or enterprise application-layer protocol (e.g., DNP3, Modbus, RDP, HTTP, SMB), but the 'id.resp_p' (destination port) or 'id.orig_p' (source port) does not match the IANA-assigned standard port for that protocol, nor any explicitly approved alternative port for the organization. This is particularly relevant when connections involve external IP addresses or traverse defined IT/OT network segmentation boundaries.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Demarcation Points (e.g., firewalls, DMZ), ICS Zone Gateways, Enterprise Network Perimeter, Internet Proxies, Domain Controllers, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, PLCs, RTUs, Jump Servers.",
            "action": "1. Symbolic Logic: Establish a lookup table or configuration file mapping standard and approved non-standard ports to common ICS/enterprise protocols (e.g., DNP3: TCP 20000; Modbus: TCP 502; RDP: TCP 3389, 3390). Create a SIEM rule that queries Zeek conn.log for new connections. The rule should trigger an alert if 'service' matches a known protocol AND 'id.resp_p' or 'id.orig_p' is NOT found in the approved port list for that 'service'. Further refine by adding conditions to prioritize alerts where 'id.orig_h' or 'id.resp_h' is identified as an external IP address (e.g., not in internal IP ranges) OR if the connection spans pre-defined IT/OT network boundary IP ranges. 2. Statistical Method: For each unique 'service' observed in Zeek conn.log over a rolling 30-day window, calculate the frequency of each 'id.resp_p' (destination port). Identify ports for a given 'service' that represent less than the 1st percentile of observed traffic volume for that service. Trigger an alert if Zeek conn.log shows a new connection for a critical ICS protocol (e.g., DNP3, Modbus) on a port identified as statistically rare for that service, particularly if the connection involves external IPs or crosses IT/OT boundaries. This can be implemented using a scheduled SIEM query that first computes percentiles and then applies them as a dynamic threshold. 3. Machine Learning: Deploy an unsupervised anomaly detection model (e.g., Isolation Forest, One-Class SVM) trained on historical Zeek conn.log data, using features such as 'service', 'id.resp_p', 'id.orig_h' (hashed or encoded), 'id.resp_h' (hashed or encoded), 'orig_bytes', 'resp_bytes', 'duration', and 'conn_state'. The model should learn typical communication patterns, including protocol-port combinations and source/destination host relationships. Generate an alert when the model flags a connection as anomalous, especially if it involves known ICS protocols on ports outside their learned common distribution or if communication occurs between hosts that rarely interact."
          },
          {
            "description": "Observed statistically significant changes (e.g., exceeding a 3-sigma threshold or falling outside established percentile ranges) in the volume, frequency, or specific structural characteristics (e.g., payload sizes, specific command codes, request/response patterns, or entropy of data fields like URIs or user agents) of application-layer protocol traffic (e.g., HTTP, DNP3, Modbus) as recorded in Zeek logs. These deviations are particularly suspicious when they occur from ICS assets or cross IT/OT boundaries, suggesting potential C2 tunneling or data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), SCADA Servers, Historian Servers, Human-Machine Interfaces (HMIs), DMZ Web Servers, Process Control Networks (PCN) Segments, Enterprise Proxies, Internet Gateways, Domain Controllers, Jump Servers.",
            "action": "1. Symbolic Logic: For Zeek dnp3.log, maintain an allowlist of expected DNP3 function codes and object groups for each unique 'id.orig_h' (master) and 'id.resp_h' (outstation) pair. Implement a SIEM rule to alert when a dnp3.log entry contains a 'function_code' or 'object_group' not present in the pre-approved allowlist for that specific master-outstation pair. Simultaneously, create a correlation rule: if an alert for anomalous DNP3 traffic (from the above rule) is triggered, search for Windows Event ID 4688 (Process Creation) on the 'id.orig_h' or 'id.resp_h' asset within a +/- 5-minute window for known malicious or administrative tools (e.g., cmd.exe, powershell.exe, nc.exe, psexec.exe) where the 'ParentProcessName' is an unexpected legitimate ICS application or a non-standard process. 2. Statistical Method: For Zeek http.log, establish a rolling 30-day baseline for each 'id.orig_h' by calculating the 95th percentile of 'orig_bytes' (request body size) and 'resp_bytes' (response body size) for HTTP POST requests. Trigger an alert when a host's 'orig_bytes' or 'resp_bytes' in a new POST request significantly exceeds its established 95th percentile (e.g., by more than 20% or a fixed threshold like 1MB above the percentile). Additionally, for all outbound Zeek http.log connections, calculate the Shannon entropy of the 'uri' and 'user_agent' fields. Alert when the entropy value for either field exceeds a dynamic threshold (e.g., 2.5 standard deviations above the 7-day rolling average for that field, or a fixed value like 6.0 bits), as high entropy often indicates obfuscated data, DGA, or C2 communications. 3. Machine Learning: Implement a multivariate time-series anomaly detection model (e.g., using an LSTM Autoencoder or a Prophet-like model) on Zeek dnp3.log and Zeek modbus.log data. Train the model on historical features such as 'num_messages', 'num_objects', 'function_code' distribution, 'request_count', 'response_count', and 'transaction_id' patterns for each unique master-outstation or client-server pair over time. The model should learn the normal operational patterns and periodicities. Generate an alert when the model detects significant deviations from these learned patterns (e.g., sudden spikes in message volume, unexpected command sequences, or changes in transaction frequency), indicating potential C2 activity or unauthorized protocol usage."
          },
          {
            "description": "A successful RDP logon (Windows Event ID 4624, Logon Type 10) where the 'Source Network Address' is an external IP not present on an approved allowlist, or an internal RDP session (also Logon Type 10) detected outside of established operational hours (e.g., 2 standard deviations from baseline login times), involving a source/destination host pair that rarely communicates via RDP (e.g., below the 5th percentile of observed RDP connections), or utilizing a user account not typically associated with RDP access to that specific ICS asset.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Jump Servers/Bastion Hosts (for IT/OT access), Domain Controllers, Remote Access VPN Concentrators, IT/OT Demarcation Points, Active Directory Servers.",
            "action": "1. Symbolic Logic: Create and maintain an allowlist of approved external IP addresses and VPN ranges authorized to initiate RDP connections into the ICS network. Implement a SIEM rule to alert on Windows Event ID 4624 (Successful Logon) with Logon Type 10 (RemoteInteractive) if the 'Source Network Address' is external and not present in the defined allowlist. Additionally, for internal RDP sessions, define a baseline of expected 'Source Workstation Name' and 'Target Account Name' pairs for each ICS asset. Alert on Windows Event ID 4624 (Logon Type 10) where an RDP session originates from an unapproved 'Source Workstation Name' or involves a 'Target Account Name' not typically associated with RDP access to the specific destination asset. 2. Statistical Method: For each unique 'Target Account Name' and 'Workstation Name' (destination asset) observed in Windows Event ID 4624 (Logon Type 10) over a 60-day period, establish a baseline of normal RDP logon times (day of week, hour of day) and typical 'Source Network Address' ranges. Calculate a deviation score (e.g., using Z-score or percentile deviation) for new RDP logons based on 'TimeCreated' and 'Source Network Address'. Trigger an alert if a logon's deviation score exceeds a threshold (e.g., Z-score > 2.5 or outside the 99th percentile), indicating an RDP session outside normal hours or from an unusual source. Concurrently, use Zeek rdp.log to track the count of RDP connections between 'id.orig_h' and 'id.resp_h' pairs over hourly intervals. Calculate the 95th percentile of connection counts for each pair over a 7-day rolling window and alert when a pair's current connection count exceeds this percentile, indicating a sudden surge in RDP activity. 3. Machine Learning: Apply a graph-based anomaly detection model (e.g., using a similarity-based approach like Local Outlier Factor on graph embeddings or a community detection algorithm) to historical RDP connection data from Zeek rdp.log and Windows Event ID 4624 (Logon Type 10). Represent ICS assets and user accounts as nodes, and RDP sessions as edges, enriched with features such as 'user', 'time_of_day', 'duration', 'orig_bytes', and 'resp_bytes'. Train the model to identify normal RDP communication patterns and typical user access relationships within the ICS network. Generate alerts when the model detects new, uncharacteristic RDP connections (e.g., connections between previously unseen host pairs, or a user account accessing an asset it has never accessed via RDP), or significant deviations in communication patterns (e.g., an HMI suddenly initiating RDP to a PLC directly, bypassing a jump server), signaling potential lateral movement or C2."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]