[
  {
    "information_requirement": "Has an adversary successfully tricked an ICS operator or engineer into executing malicious code?",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "An office application or document reader on an ICS host (e.g., Engineering Workstation) spawns a command-line interpreter or scripting engine, which is a common pattern for malicious macro execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), ICS DMZ servers.",
            "action": "Monitor for process creation events (Windows Event ID 4688) where a common office productivity application (e.g., winword.exe, excel.exe, acrord32.exe) is the parent process and a command-line interpreter (cmd.exe, powershell.exe) or scripting engine (wscript.exe, cscript.exe) is the child process. Establish a baseline of normal parent-child relationships on these critical systems. Use frequency analysis to identify statistically rare process chains (e.g., a chain that has never been seen before or is in the lowest 1st percentile of occurrences). Correlate the timestamp of the event with Zeek files.log to identify the source of the initial document and conn.log to trace the network session it was downloaded from."
          },
          {
            "description": "A new or unknown executable running from a user's temporary or download directory initiates an external network connection shortly after execution, potentially for command and control or to download a second-stage payload.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Maintenance Laptops, Software repositories, ICS network egress points.",
            "action": "Continuously monitor for new process executions (Windows Event ID 4688) where the process path originates from a user-writable directory (e.g., C:\\Users\\*\\Downloads\\, C:\\Users\\*\\AppData\\Local\\Temp\\, C:\\ProgramData\\). For each such execution, correlate by timestamp and source IP with network connection logs (Zeek conn.log). Establish a baseline of typical destination IPs and ports for EWS and HMI systems. Flag any connections to destinations that are statistically rare (e.g., not in the top 95th percentile of connections for that asset group) or have a low reputation score. Calculate the entropy of the executable filename; high entropy may indicate a randomly generated name used by malware."
          },
          {
            "description": "A user on a critical ICS asset grants elevated privileges (via UAC prompt) to an application that does not typically require administrative rights or is not part of an approved software list.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows-based ICS hosts, including HMIs, Engineering Workstations, and Data Historians.",
            "action": "Filter Windows Event ID 4688 for events where the 'Token Elevation Type' field is '%%1937' (Type 2), indicating a process is running with a full, elevated administrator token. Create and maintain a baseline of legitimate applications that are expected to run with elevated privileges on ICS hosts (e.g., vendor software installers, system administration tools). Generate an alert for any process not on this baseline that is executed with elevated privileges, especially if the process originates from a temporary directory or is unsigned. Track the frequency of elevation per application; a sudden spike in elevation for a rarely-elevated application is highly suspicious."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]