[
  {
    "information_requirement": "Is an adversary attempting to map our industrial control process? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0861",
        "name": "Point & Tag Identification",
        "evidence": [
          {
            "description": "Anomalous ICS protocol communication is observed, characterized by either: 1) A host using an ICS protocol (e.g., Modbus, DNP3, EtherNet/IP) for the first time in 30 days, or 2) An authorized ICS host exhibiting a statistically significant increase in the volume of read requests or the number of unique endpoints contacted within the Process Control Network compared to its historical baseline.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek ethernetip.log",
              "Zeek dnp3.log",
              "Zeek opcua.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments corresponding to Purdue Model Levels 0, 1, and 2, specifically traffic between PLCs, RTUs, and HMIs; Network taps or SPAN ports on switches within the Process Control Network (PCN); Firewall and NIDS logs at the boundary between the IT network (Level 4/5) and the OT DMZ (Level 3.5) and between the DMZ and the PCN (Level 3).",
            "action": [
              "Create and maintain a static allowlist of IP addresses for authorized ICS communication hosts (e.g., HMIs, EWS). For all ICS protocol traffic (Modbus, DNP3, EtherNet/IP, OPC-UA), compare the source IP (id.orig_h) against the static allowlist and a dynamic 30-day baseline of known communicating IPs. Generate a high-priority alert if a source IP is not on either list.",
              "For each authorized ICS host, establish a 7-day rolling baseline of hourly counts for ICS read requests (e.g., Modbus function codes 3, 4; EtherNet/IP Get_Attribute_All) and the number of unique destination devices contacted. Calculate the 99th percentile for these counts. Generate a medium-priority alert when a host's current hourly count for either read requests or unique destinations exceeds its 99th percentile baseline, indicating potential network or device scanning.",
              "Develop a per-host multivariate time-series anomaly detection model (e.g., Isolation Forest) using features from Zeek logs, such as hourly counts of ICS packets, unique destination IPs, and protocol-specific function codes. Train the model on at least 30 days of historical data to establish a normal communication fingerprint for each host. Run the model in real-time and generate a medium-priority alert when a host's activity produces an anomaly score exceeding the 95th percentile of its historical scores."
            ]
          },
          {
            "description": "Anomalous read access to sensitive ICS project files (e.g., .ACD, .L5K) or tag export files (e.g., .CSV, .XML) on Engineering Workstations or file servers. This is evidenced by access from an unauthorized user or process, or by an authorized user accessing an unusually high volume of files compared to their individual baseline.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File system and object access audit logs on Engineering Workstations (EWS), project file repositories, and version control servers, typically located in Purdue Model Level 3 or 2; Central file servers in the business network (Level 4) that store backups of ICS project files; Document management systems where tag databases might be stored.",
            "action": [
              "Enable SACLs on directories containing ICS project and tag export files to generate Windows Event ID 4663 for read access (AccessMask 0x1). Maintain an allowlist of authorized user accounts and parent processes (e.g., 'Studio5000.exe'). Trigger a high-priority alert if Event ID 4663 is logged for a monitored file type and the SubjectUserName or ProcessName is not on the allowlist, particularly if the process is a common scripting or command-line utility (e.g., powershell.exe, cscript.exe, cmd.exe).",
              "For each authorized user, establish a 7-day rolling baseline of hourly counts for: A) unique ICS project files accessed, and B) total read events (Event ID 4663) for those file types. Calculate the 99th percentile for both metrics per user. Generate a medium-priority alert if a user's hourly activity exceeds their 99th percentile for either unique file count or total read count, suggesting bulk file collection.",
              "Implement a UEBA model focused on file access activity (Event ID 4663) on critical EWS and file servers. Profile each user's normal behavior, including typical processes used to access files, access times, and file access velocity (count/time). The model should learn the standard 'user-process-filetype' triplets. Generate a medium-priority alert when the model detects a significant deviation, such as a user accessing an abnormally high number of project files via a script instead of the standard engineering software."
            ]
          },
          {
            "description": "Suspicious activity targeting a Process Data Historian, characterized by: 1) Network connections from new or unauthorized IP addresses, 2) A successful login immediately following a high volume of failed login attempts from a single source, or 3) An anomalously large data exfiltration from the historian to a client, as measured by network traffic volume.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic to and from Process Data Historian servers, typically at Purdue Model Level 3.5 or 4; Security event logs (logon/logoff events) on the historian servers themselves; Network flow data (e.g., Zeek conn.log) captured at the network switch port for the historian or at the firewall segmenting the historian from other network zones.",
            "action": [
              "Monitor connections to historian database ports (e.g., 1433, 5432, 4840) using Zeek conn.log. Generate a high-priority alert if the source IP (id.orig_h) is not on a static allowlist of authorized clients AND is not in a 30-day dynamic baseline of known clients. Additionally, on the historian server, trigger a high-priority alert if 10 or more failed logins (Event ID 4625) from a single IP are followed by a successful login (Event ID 4624) from the same IP within a 5-minute window.",
              "For each authorized client-historian connection pair, establish a 7-day rolling hourly baseline for total bytes transferred from the historian to the client (resp_bytes in Zeek conn.log). Calculate the 99.9th percentile for this value. Generate a medium-priority alert if the total bytes transferred in an hour for a given client exceeds its 99.9th percentile, indicating a potential bulk tag database export.",
              "Train a client-specific anomaly detection model (e.g., One-Class SVM) on historical Zeek conn.log data for each authorized historian client. Use features like connection duration, total bytes sent (orig_bytes), total bytes received (resp_bytes), and time-of-day. The model learns the normal 'data query profile' for each client. Generate a medium-priority alert when the model flags a new connection as a significant outlier, such as a query resulting in a data transfer 10x larger than any previously observed for that client."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]