[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS environment via spearphishing attachments? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0865",
        "name": "Spearphishing Attachment",
        "evidence": [
          {
            "description": "An email is received by an employee with a high-risk role (e.g., ICS engineer, control room operator) containing an attachment with a suspicious file type (e.g., .zip, .iso, .docm) and a subject line or filename containing ICS-specific keywords (e.g., 'PLC Update', 'SCADA Alert', 'Project Schematics').",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail gateway, Corporate-to-OT DMZ, Engineering workstations",
            "action": "Define a watchlist of high-risk recipient email addresses (e.g., engineers, operators) and ICS-specific keywords. Monitor Zeek smtp.log for emails sent to these recipients with subjects containing the keywords. Correlate smtp.log entries with files.log using the file unique ID (fuid) to inspect attachment filenames and MIME types. Calculate the entropy of attachment filenames; alert on high-entropy names sent to watchlisted recipients, as this can indicate randomized malware payloads. Generate alerts for any email matching a high-risk recipient, an ICS keyword, and a suspicious attachment type (e.g., executables, scripts, macro-enabled documents)."
          }
        ]
      },
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "A common office application (e.g., Microsoft Word, Adobe Reader) on an engineering workstation or HMI spawns an unusual child process, such as a command-line interpreter or scripting engine (e.g., cmd.exe, powershell.exe, wscript.exe), shortly after a user receives a suspicious email attachment.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering workstations, Human-Machine Interfaces (HMIs), Operator consoles",
            "action": "On hosts within the NAI, monitor for Windows Event ID 4688 (Process Creation). Establish a baseline of normal parent-child process relationships. Create a statistical model to identify rare process pairs. Alert when a common document-handling application (e.g., WINWORD.EXE, EXCEL.EXE, ACROBAT.EXE) is the parent process for a child process like 'powershell.exe', 'cmd.exe', 'wscript.exe', or 'rundll32.exe'. The rarity of this pairing across the environment should increase the alert's priority."
          },
          {
            "description": "A process, spawned via user execution of an attachment, initiates an external network connection to a destination that is rare for the host or environment.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering workstations, OT network egress points, Corporate-to-OT DMZ",
            "action": "Correlate a suspicious process creation event (Windows Event ID 4688) with network connection events (Zeek conn.log) originating from the same host within a short time window (e.g., 60 seconds). For each connection, analyze the destination IP address. Establish a baseline of common destination ASNs, countries, and domains for the NAI. Use a percentile-based approach to flag connections to destination IPs that fall within the bottom 5% of connection frequency for that host or user. Enrich destination IPs with threat intelligence and alert on connections to known malicious infrastructure or to geolocations inconsistent with normal business operations."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]