[
  {
    "information_requirement": "Is an adversary attempting to determine the operating state of our PLCs? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0868",
        "name": "Detect Operating Mode",
        "evidence": [
          {
            "description": "ICS protocol traffic containing operating mode queries (e.g., Modbus function code 17, S7COMM 'Read SZL', ENIP Get_Attribute_Single on Key Switch object) that meets one of two conditions: 1) The query originates from a source IP not on the established whitelist of authorized Engineering Workstations (EWS) and management servers. 2) The query originates from an authorized source, but the activity is anomalous, defined as the source IP querying a number of distinct PLCs (e.g., 5 or more) within a 5-minute window that exceeds the 99th percentile of that source's 30-day baseline.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek dnp3.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors (taps/SPANs) monitoring traffic at the boundary between the IT and OT networks (DMZ), within the Process Control Network (PCN), and within individual Cell/Area zones. Log sources on Engineering Workstations (EWS), SCADA servers, and Historians.",
            "action": "1. Symbolic Logic: Using a SIEM, create a rule to alert on any ICS protocol traffic containing operating mode queries (Modbus FC 17, S7COMM 'Read SZL', ENIP Key Switch object reads) where the source IP is not in the predefined asset list of authorized EWS and OT management servers. This list should be maintained in a CMDB or a simple lookup file. 2. Statistical Method: For each authorized source IP, establish a 30-day rolling baseline of the number of distinct destination PLCs queried for operating mode per 5-minute interval. Calculate the 99th percentile for this metric. Create an alert that triggers when any authorized source IP exceeds this 99th percentile threshold, indicating potential scanning or enumeration from a compromised authorized host. 3. Machine Learning: Deploy a time-series anomaly detection model (e.g., Isolation Forest, Seasonal-ARIMA) on Zeek ICS log data. For each source-destination pair, model the frequency and timing of operating mode queries. Train the model on at least 90 days of data to learn normal operational communication patterns. An alert is generated when the model flags a query or series of queries as a statistically significant deviation from the learned normal behavior. 4. Correlation: Upon an alert, automatically enrich the source IP from Zeek conn.log to retrieve all other connections made in the last hour to identify lateral movement. If the source is an EWS, query Windows Event ID 4688 logs on that host to find process creation events within 15 minutes of the alert, specifically looking for non-standard tools (e.g., nmap.exe, plcscan.py) or unusual parent-child process relationships."
          },
          {
            "description": "A successful remote logon to an Engineering Workstation (EWS) (Windows Event ID 4624, Logon Type 10) is flagged as anomalous based on a combination of factors (e.g., source IP geolocation, ISP, time of day) that deviates significantly from the user's established 60-day baseline. This anomalous logon is followed within 30 minutes by the same EWS initiating operating mode queries (e.g., Modbus FC 17, S7COMM 'Read SZL') against PLCs on the OT network.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstation (EWS) Endpoints, Remote Access VPN Concentrators, DMZ Jump Boxes, Active Directory Domain Controllers (for authentication logs), Network Intrusion Detection Systems (NIDS) on EWS subnets, Security Gateways/Perimeter Firewalls.",
            "action": "1. Symbolic Logic: Create a SIEM rule that triggers on a successful logon to an EWS (Windows Event ID 4624, Logon Type 10) where the source IP address is not on a pre-approved whitelist of known remote locations or VPN subnets. Enrich the source IP with GeoIP data and include the country of origin in the alert. 2. Statistical Method: For each user account on an EWS, build a 60-day baseline profile of remote logon activity, including features like hour-of-day, day-of-week, source country, and source ISP. For each new logon, calculate the Mahalanobis distance from the centroid of that user's historical activity in this feature space. Generate an alert if the distance exceeds a threshold set at the 95th percentile of historical distances. 3. Machine Learning: Implement a User and Entity Behavior Analytics (UEBA) clustering model (e.g., DBSCAN) on remote EWS logon events. Use features such as source IP, user, time, and session duration from Windows Event ID 4624 and Zeek rdp.log. The model will group typical logons into clusters. An alert is generated for any logon event that is classified as noise (i.e., does not belong to any existing cluster). 4. Correlation: Create a high-severity correlated alert that triggers if an alert for an anomalous EWS logon is followed within 30 minutes by network traffic from that same EWS IP containing ICS operating mode queries (identified in Zeek's modbus.log, s7comm.log, etc.). Further escalate the alert if subsequent Windows Event ID 4688 logs on the EWS show the execution of reconnaissance tools or engineering software outside of scheduled maintenance windows."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.4",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]