[
  {
    "information_requirement": "Are unauthorized tools or files being transferred to critical ICS assets like HMIs, Engineering Workstations, or Historians? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0867",
        "name": "Lateral Tool Transfer",
        "evidence": [
          {
            "description": "An executable file or script is transferred over the network using a standard file sharing protocol (e.g., SMB) to a critical ICS asset.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting IT and OT zones, Engineering Workstations (EWS), and Data Historians.",
            "action": "Filter Zeek smb_files.log for file transfers with suspicious extensions (.exe, .dll, .ps1, .bat, .zip) where the destination IP address belongs to a critical ICS asset. Establish a baseline of normal source-destination SMB connections (from Zeek conn.log) and file types transferred (from Zeek smb_files.log). Alert on new or rare connections that transfer executable files, especially to administrative shares (e.g., paths containing 'C$'). Calculate filename entropy for all transferred files; a score significantly higher than the established baseline average suggests obfuscated or randomly generated tool names and should be investigated."
          },
          {
            "description": "A file is written to a critical ICS host via a network share, particularly to an administrative share (e.g., C$, ADMIN$).",
            "data_sources": [
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical ICS hosts such as Engineering Workstations (EWS), HMIs, and Domain Controllers.",
            "action": "On critical ICS hosts, monitor Windows Event ID 5145 (Detailed File Share) for write access ('Accesses' field contains 'WriteData'). Create a high-priority alert for write events to administrative shares (e.g., 'ShareName' ending in '$') originating from non-administrative workstations or user accounts. Use descriptive statistics to establish a baseline of normal share access patterns per user and host. Flag any access that deviates by more than two standard deviations from the norm, such as a user writing to a new host for the first time or an unusual volume of files being written."
          },
          {
            "description": "A process is created on a critical ICS host from a file that was recently transferred to the system via a network share.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems and process tables on Engineering Workstations (EWS), application servers, and HMIs.",
            "action": "Correlate Windows Event ID 5145 (Detailed File Share) with Windows Event ID 4688 (Process Creation) on critical hosts. Trigger an alert if a process is created (4688) where the 'NewProcessName' or 'CreatorProcessName' matches the file path ('RelativeTargetName') from a recent file share write event (5145) within a short time window (e.g., less than 5 minutes). This directly links the file transfer to its execution, which is a strong indicator of malicious activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]