[
  {
    "information_requirement": "Is an adversary attempting to determine the operating state of our PLCs? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0868",
        "name": "Detect Operating Mode",
        "evidence": [
          {
            "description": "An ICS protocol query for a device's operating mode (e.g., Modbus function code 17, S7COMM 'Read SZL', ENIP Get_Attribute_Single on Key Switch object) originates from an IP address not on the authorized Engineering Workstation (EWS) asset list, or an authorized EWS queries an anomalous number of distinct PLCs for their operating mode within a short timeframe, exceeding a statistically established baseline.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek dnp3.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors (TAPs/SPANs) at the IT/OT boundary, within the Process Control Network (PCN), and in Cell/Area zones. Log aggregators for Engineering Workstations (EWS), SCADA servers, and data historians.",
            "action": [
              "Create a SIEM rule to trigger an alert when Zeek logs (modbus.log, s7comm.log, enip.log) show an operating mode query where the 'id.orig_h' (source IP) is not present in a maintained watchlist of authorized EWS and OT management servers. Upon alert, correlate the source IP with Windows Event ID 4688 on the source host (if EWS) to identify suspicious process execution (e.g., plcscan.py, nmap.exe) within a 15-minute window.",
              "For each authorized source IP, calculate a 30-day rolling baseline of the count of distinct destination PLCs queried for operating mode per 5-minute window. Generate an alert if a source IP exceeds the 99th percentile of its historical activity, indicating anomalous enumeration from a potentially compromised, but authorized, host.",
              "Train a time-series anomaly detection model (e.g., ARIMA or LSTM) on historical Zeek ICS log data, modeling the frequency and timing of operating mode queries for each source-destination IP pair. Train the model on at least 90 days of data to learn normal operational communication patterns. Generate an alert when the model flags a query or a sequence of queries as a statistically significant deviation from the learned baseline."
            ]
          },
          {
            "description": "A successful remote logon to an Engineering Workstation (EWS) using Windows Event ID 4624 (Logon Type 10) from an anomalous source (e.g., rare geolocation, new ISP, unusual time) is followed within 30 minutes by that same EWS IP initiating operating mode queries against PLCs on the OT network, as observed in Zeek ICS protocol logs.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log sources on Engineering Workstation (EWS) endpoints, Active Directory Domain Controllers, and remote access infrastructure (VPN concentrators, jump boxes). Network traffic sensors at the IT/OT boundary and monitoring EWS subnets.",
            "action": [
              "Create a correlated SIEM rule that triggers when a successful remote logon to an EWS (Windows Event ID 4624, Logon Type 10) from a source IP not on a geofenced or IP-based access list is followed within 30 minutes by Zeek logs showing ICS operating mode queries originating from that EWS's IP address.",
              "For each user, establish a baseline of remote logon attributes (hour-of-day, source ISP, source country). For each new remote logon, calculate an anomaly score based on the rarity of its attributes using z-scores or percentile ranks. If the score exceeds a set threshold (e.g., 95th percentile), create a low-priority alert. Escalate to a high-priority alert if this is followed within 30 minutes by an ICS operating mode query from the same EWS host.",
              "Use a User and Entity Behavior Analytics (UEBA) clustering model (e.g., DBSCAN) on EWS remote logon events (Windows Event ID 4624, Zeek rdp.log), using features like source IP, user, and session duration. Any logon classified as noise (an outlier) should be flagged. Create a high-severity correlated alert if a noise event is followed within 30 minutes by network traffic from that EWS IP containing ICS operating mode queries."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]