[
  {
    "information_requirement": "Is an adversary attempting to hide their presence on critical ICS hosts? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0872",
        "name": "Indicator Removal on Host",
        "evidence": [
          {
            "description": "An occurrence of Windows Event ID 1102 ('The audit log was cleared') on a critical ICS host, where the initiating user account is not a whitelisted administrator or the event occurs outside a scheduled maintenance window, indicating a probable unauthorized attempt to erase forensic evidence.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, and OT Domain Controllers.",
            "action": [
              "Create a detection rule that triggers a critical alert for Windows Event ID 1102 on any host tagged as 'ICS'. Enrich the alert by correlating the event timestamp with the preceding successful logon (Windows Event ID 4624) to identify the user and session. Cross-reference the user and timestamp against a watchlist of authorized administrators and a schedule of approved maintenance windows. Escalate any event from an unauthorized user or outside an approved window. Further enrich using Zeek conn.log to identify the source IP, flagging any from unexpected network segments.",
              "Establish a 90-day rolling baseline for the count of Windows Event ID 1102 per ICS host. Alert on any detection of this event, as it represents a statistical anomaly exceeding the 99.9th percentile. As a risk modifier, calculate the time delta between the event and the last interactive logon (Windows Event ID 4624, Logon Type 2 or 10) on the same host; a delta less than 300 seconds should significantly increase the alert's risk score.",
              "Utilize a User and Entity Behavior Analytics (UEBA) model to profile normal administrative actions, including typical logon times, source IPs, and commands executed. Flag an occurrence of Windows Event ID 1102 as a high-risk anomaly if it is initiated by an account with no history of such actions or occurs at an anomalous time, as determined by a time-series model (e.g., Isolation Forest). The resulting alert should include the model's confidence score and the specific anomalous features detected."
            ]
          },
          {
            "description": "A statistically significant spike in file deletion events (Windows Event ID 4663 with 'DELETE' access mask 0x10000) or the execution of file wiping utilities (Windows Event ID 4688) targeting system log directories (e.g., C:\\Windows\\System32\\winevt\\Logs\\), ICS application log directories (e.g., C:\\ProgramData\\Wonderware\\Logs\\), or user temporary directories on an ICS host.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek fileinfo.log",
              "Zeek pe.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on Engineering Workstations, HMIs, Process Control Servers, and Historian Servers, specifically directories containing system logs, ICS vendor-specific application logs, and user profiles.",
            "action": [
              "Create a detection rule that triggers a high-severity alert for Windows Event ID 4688 where the command line includes known file wiping utilities or commands (e.g., 'wevtutil.exe cl', 'del /s /q', 'sdelete.exe', 'cipher.exe /w') executed against sensitive log directories. Correlate with Windows Event ID 4663 events where the AccessMask is 'DELETE' (0x10000) and the ObjectName path matches these directories. Escalate priority if the executing process hash has a low reputation score derived from threat intelligence or Zeek pe.log analysis.",
              "For each ICS host, establish a 7-day rolling baseline for the count of file deletions (Windows Event ID 4663 with DELETE access) per user and per process within log directories. Alert if the deletion count in a 15-minute window exceeds the 99th percentile of the baseline. Separately, calculate the Shannon entropy of file extensions deleted by a single process in a 60-second window; a sudden drop in entropy below the 5th percentile suggests programmatic deletion of similar files and should trigger a correlated alert.",
              "Apply a time-series anomaly detection model (e.g., LSTM) to the rate of file deletion events (Windows Event ID 4663) per ICS host, flagging anomalous spikes as potential indicator removal activity. Use a clustering algorithm (e.g., DBSCAN) to group hosts or users with similar anomalous deletion patterns based on features like deletion rate, target directory, parent process, and time of day, to identify coordinated campaigns."
            ]
          },
          {
            "description": "The execution of a command (Windows Event ID 4688) or a file deletion event (Windows Event ID 4663) that specifically targets and removes a command-line history file (e.g., ConsoleHost_history.txt, .bash_history) from a user profile directory on an ICS host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User profile directories on Engineering Workstations (EWS) and other ICS hosts where operators use command-line interfaces (e.g., C:\\Users\\<user>\\AppData\\Roaming\\Microsoft\\Windows\\PowerShell\\PSReadline\\).",
            "action": [
              "Create a detection rule that generates a high-severity alert for a file deletion (Windows Event ID 4663, AccessMask 0x10000) or command execution (Windows Event ID 4688) where the target object or command line explicitly references known shell history files (e.g., 'ConsoleHost_history.txt', '.bash_history', 'PSReadline\\*.txt'). Escalate the alert's priority if the parent process is not a standard shell (e.g., powershell.exe, cmd.exe) or if the user account is not a whitelisted administrator.",
              "Establish a 30-day baseline for deletion events targeting command history files per user. As legitimate deletions are extremely rare, any occurrence should trigger an alert as it exceeds the 99.9th percentile. Calculate the time delta between the user's most recent interactive logon (Windows Event ID 4624, Logon Type 2 or 10) and the history file deletion event. A delta of less than 120 seconds is a high-confidence indicator of malicious activity.",
              "Implement a command-line classifier (e.g., Random Forest) trained to distinguish malicious from benign commands, using features like command arguments (bag-of-words), length, entropy, and parent process. A high anomaly score for a command that deletes a history file, especially when temporally correlated with other low-confidence indicators (e.g., unusual network activity in Zeek conn.log), should trigger a high-fidelity alert."
            ]
          },
          {
            "description": "The Windows 'EventLog' service state changes to 'stopped' (Windows Event ID 7036) or its startup type is modified to 'Disabled' (Windows Event ID 7040) on an ICS host, and the action is not correlated with a scheduled maintenance window or an authorized administrative account.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 7040",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Service Control Manager and system services on critical ICS hosts, including EWS, HMIs, Historians, and OT Domain Controllers.",
            "action": [
              "Create a detection rule that generates a critical alert for `(event_id=7036 AND service_name='EventLog' AND state='stopped')` or `(event_id=7040 AND service_name='EventLog' AND new_start_type='Disabled')`. Automatically query for preceding process creation events (Event ID 4688) to find the command used (e.g., 'sc.exe stop eventlog') and logon events (Event ID 4624) to find the user. If the user is not a whitelisted administrator performing the action within a documented maintenance window, escalate the alert for immediate response.",
              "Establish a 1-year baseline for the count of EventLog service stop (Event ID 7036) and disable (Event ID 7040) events per ICS host. Any occurrence outside a change-controlled maintenance window is a severe statistical anomaly (exceeding the 99.9th percentile) and must be alerted on. Calculate the time difference between the service change event and the last interactive logon (Windows Event ID 4624, Type 2 or 10); a difference of less than 60 seconds is highly suspicious.",
              "Implement a sequence-based anomaly detection model (e.g., an LSTM autoencoder) trained on normal sequences of service control events. A legitimate sequence might be 'stop -> reconfigure -> start' within a short time frame during maintenance. Flag an anomalous sequence, such as a 'stop' event not followed by a 'start' within a typical maintenance duration, or a 'disable' event with no preceding authorized activity, with a high anomaly score to trigger a critical alert."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]