[
  {
    "information_requirement": "Is an adversary attempting to achieve persistence by modifying ICS project files?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0873",
        "name": "Project File Infection",
        "evidence": [
          {
            "description": "An engineering project file is modified or accessed on a file server or engineering workstation without a corresponding authorized change request.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting project repositories and Engineering Workstations.",
            "action": "Monitor file shares containing ICS project files (e.g., *.ACD, *.S7P) for write access events (Windows Event ID 4663). Establish a baseline of users and hosts that typically modify these files. Alert on any modification from a user or host outside this baseline. For network transfers (Zeek smb_files.log), track the source and destination of project files and alert on transfers to or from non-standard locations or workstations."
          },
          {
            "description": "A project download to a PLC originates from an unauthorized host or occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The network segment connecting Engineering Workstations to the Process Control Network (PCN), and the Engineering Workstations themselves.",
            "action": "Maintain a list of authorized Engineering Workstation IP addresses. Using Zeek conn.log, monitor for and alert on any communication to PLCs on common programming ports (e.g., TCP/44818 for EtherNet/IP, TCP/102 for S7) originating from an IP address not on the authorized list. Correlate this network activity with process creation events (Windows Event ID 4688) on the source host to confirm the use of engineering software (e.g., Studio5000.exe, TIA Portal.exe)."
          },
          {
            "description": "A PLC's operational mode is changed from RUN to PROGRAM/REMOTE, followed by a large data transfer consistent with a project download.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic to and from Programmable Logic Controllers (PLCs).",
            "action": "Analyze Zeek conn.log data for connections to PLCs on programming ports. Establish a baseline for normal communication volume (total bytes) and duration for each source-destination pair. A mode change command followed by a project download will appear as a statistically significant outlier in connection duration and data volume. Alert on connections to PLCs that exceed the 95th percentile for bytes transferred or connection duration, especially if they occur outside of known maintenance periods."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]