[
  {
    "information_requirement": "Has an adversary successfully executed an action that has resulted in, or is intended to cause, physical damage to operational technology property? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0832",
        "name": "Manipulation of Control",
        "evidence": [
          {
            "description": "An ICS write command, observed in network protocol logs (e.g., Zeek Modbus, DNP3, ENIP), targets a critical control register (e.g., motor speed, valve position) and sets its value outside of predefined engineering safety limits. This includes commands intended to induce physical stress such as mechanical fatigue (e.g., 5 or more alternating open/close commands to a valve within 1 second) or thermal shock (e.g., commanding a heater to maximum output while a cooling system is simultaneously commanded off). The command originates from an IP address not on the approved allowlist of HMIs or Engineering Workstations and is not correlated with any authorized change management activity within a 15-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek s7comm.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, Safety Instrumented System (SIS) network segments, PLC/RTU network interfaces, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Data Historian servers.",
            "action": [
              "Create and maintain an asset inventory of critical PLC registers with their documented safe operating ranges (min/max values), data types, and read/write status. Implement a SIEM rule to generate a high-severity alert if a 'write' command (e.g., modbus.func=6 or 16) from a source IP not on the HMI/EWS allowlist targets a critical register with a value outside its defined safe range. Create a second rule to alert if a 'write' command targets a register defined as 'read-only'.",
              "For each critical process parameter (e.g., temperature, pressure, flow rate), establish a 30-day rolling baseline of its distribution during normal operations, calculating the 1st and 99th percentiles. Generate an alert if a live parameter reading, as reported by read commands, falls outside this established percentile range for more than three consecutive polling cycles. For interdependent systems (e.g., motor RPM, current draw, and temperature), calculate the Mahalanobis distance of the current state vector from the centroid of its normal operating baseline. Alert if this distance exceeds the 99.9th percentile of historical distances.",
              "Train a One-Class Support Vector Machine (OCSVM) on a baseline of normal operating data vectors, where each vector is a tuple of [source_ip, register_address, value]. Feed live 'write' command tuples into the model; a prediction of '-1' (outlier) indicates a deviation from learned normal commands and should trigger an alert. Separately, implement a time-series anomaly detection model (e.g., Isolation Forest) on features aggregated into 1-minute windows, such as: frequency of 'write' commands, entropy of target register addresses, and the ratio of 'write' to 'read' commands. An alert is generated on statistically significant changepoints or spikes in these metrics."
            ]
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Device Restart/Shutdown",
        "evidence": [
          {
            "description": "An unscheduled shutdown or restart of a critical ICS asset (e.g., a PLC controlling a turbine, an HMI for a safety system) is observed. The event is indicated by Windows Event ID 1074 (user-initiated shutdown/restart) or Event ID 6008 (unexpected shutdown). The initiating process is anomalous (e.g., powershell.exe, psexec.exe, wmic.exe), or the initiating user account is not on an approved list of administrators for that asset. The event lacks correlation with any pre-approved change management ticket or scheduled maintenance activity.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6008",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Windows Event ID 4672",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Process Historians, SCADA Servers, Engineering Workstations, Domain Controllers within the ICS environment, Network boundary sensors for ICS segments.",
            "action": [
              "Maintain a watchlist of critical ICS hostnames and a list of authorized administrator accounts. Implement a SIEM rule to generate a high-severity alert if (EventID is 1074 on a host in the watchlist) AND (the associated User is NOT in the admin list OR the Initiating Process Name is in a suspicious process list ['powershell.exe', 'cmd.exe', 'psexec.svc', 'wmic.exe']). Create a second rule to alert if an EventID 6008 occurs on a watchlist host and is not preceded by an authorized EventID 1074 within the previous 5 minutes.",
              "For each critical ICS asset, establish a 30-day rolling baseline for the frequency of EventID 1074 (Shutdown) and 6008 (Unexpected Shutdown), excluding scheduled maintenance windows. Generate an alert if the 24-hour count for either event exceeds the 99th percentile of its baseline. Separately, baseline the hourly unique source IPs connecting via RDP (from zeek_rdp.log) to critical assets and alert if a shutdown event is preceded within 60 minutes by an hourly unique IP count exceeding the 95th percentile of its baseline.",
              "Train a binary classification model (e.g., Random Forest) to predict if a Windows Event ID 1074 is 'malicious' (1) or 'benign' (0). Use features such as: time_of_day, day_of_week, is_admin_user (boolean), logon_type (from preceding EventID 4624), process_name, is_external_ip (from preceding zeek_conn.log), and process_command_line arguments (e.g., presence of '-f' force flag). An alert is triggered for any event classified as 'malicious' with a high confidence score. Use a clustering algorithm (e.g., DBSCAN) on pre-shutdown activity features (source_ip, user_account, processes_created) to identify novel clusters of activity that do not match known 'benign administrative' patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]