[
  {
    "information_requirement": "Is an adversary discovering information about our remote ICS systems? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0888",
        "name": "Remote System Information Discovery",
        "evidence": [
          {
            "description": "An unknown or previously unseen source IP address initiates requests for ICS device identification (e.g., Modbus function code 43, DNP3 Object Group 10, Variation 0 - Device Attributes, EtherNet/IP Identity Object) to more than 5 unique ICS devices (PLCs, RTUs, IEDs) within a 60-second window, or an authorized source IP exhibits a surge in such requests, exceeding its 95th percentile of historical activity for both request count and number of unique destinations within a 5-minute interval. This activity significantly deviates from the established baseline of periodic, low-volume polling from known SCADA servers or Engineering Workstations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "OT Network Segments (e.g., Level 1, Level 2), DMZ between IT/OT networks, Engineering Workstation Subnets, Control System Subnets, SCADA Server Subnets.",
            "action": "1. **Symbolic Logic:** From Zeek `modbus.log`, `dnp3.log`, and `enip.log`, filter for specific ICS discovery function codes (e.g., Modbus FC 43, DNP3 Object Group 10, EtherNet/IP Identity Object). Identify any source IP that is *not* present in the authorized ICS asset inventory or is attempting to communicate with an unauthorized destination device. Immediately alert on such unauthorized communications. 2. **Statistical Method:** For each authorized source IP, establish a rolling 7-day baseline for the average number of ICS discovery requests per 5-minute interval and the average number of unique destination ICS devices contacted per 5-minute interval. Calculate the 95th percentile for both metrics. Alert when any authorized source IP exceeds its 95th percentile for *both* request count and unique destinations within a 5-minute window. Use descriptive statistics (e.g., `COUNT_DISTINCT(dest_ip)`) to measure breadth. 3. **Machine Learning:** Apply a time-series anomaly detection algorithm (e.g., Isolation Forest or ARIMA model) to the aggregated count of ICS discovery requests per source IP over 1-minute intervals. Train the model on at least 30 days of historical data. Generate an alert when the model detects a statistically significant anomaly (e.g., anomaly score above 0.7) in the volume or pattern of discovery requests from a specific source IP, indicating a deviation from normal operational patterns."
          },
          {
            "description": "On an Engineering Workstation, a new or un-whitelisted process (based on process name, path, or hash) is observed via Windows Event ID 4688, and within 30 seconds of its creation, Zeek `conn.log` shows this EWS initiating network connections to more than 3 unique ICS devices (e.g., PLCs, RTUs) on common ICS ports (e.g., TCP/502, TCP/20000, TCP/44818) using protocols known for system information discovery, specifically if the connections are followed by information-gathering function codes in `modbus.log` or `dnp3.log`.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstation (EWS) endpoints, HMI workstations, Jump Servers/Bastion Hosts in the DMZ, SCADA Servers, and any other Windows-based hosts within the OT network segment.",
            "action": "1. **Symbolic Logic:** Establish a comprehensive whitelist of authorized process names, file paths, and SHA256 hashes for all legitimate ICS software running on EWS (e.g., `Studio5000.exe`, `TIA Portal.exe`). Monitor Windows Event ID 4688 for any process creation events. Alert immediately if a process is executed that is *not* on the whitelist. Furthermore, correlate successful user logins (Windows Event ID 4624) with subsequent process creation events and ensure that the user account aligns with the expected user for that EWS. 2. **Statistical Method:** For any newly created process (not on the whitelist), calculate the number of unique destination IPs and unique ports it attempts to connect to within 60 seconds of its creation using `Zeek conn.log`. If this count exceeds 2 unique IPs or 3 unique ports, and these connections are to ICS-specific ports (e.g., TCP/502, TCP/20000, TCP/44818), generate an alert. Use a percentile-based threshold (e.g., exceeding the 99th percentile of typical new process network activity on EWS) to flag highly anomalous network initiation behavior. 3. **Machine Learning:** Develop a supervised machine learning model (e.g., Random Forest Classifier) trained on historical Windows Event ID 4688 data, enriched with network connection metadata from `Zeek conn.log` for processes. Features for the model should include process name, parent process, command line arguments, number of unique connections, destination ports, and protocol usage. Label known legitimate activities as 'benign' and known malicious or highly suspicious activities as 'malicious'. Use the model to classify new process creations, alerting on any process classified with a 'malicious' probability score above 0.8, indicating a high likelihood of unauthorized activity."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]