[
  {
    "information_requirement": "Is an adversary using a compromised ICS host as a proxy for Command and Control communications?",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0884",
        "name": "Connection Proxy",
        "evidence": [
          {
            "description": "An ICS host (e.g., Engineering Workstation, HMI) exhibits a 'fan-out' network pattern: it receives an inbound connection from an external IP address not belonging to defined internal network ranges, and subsequently, within a 5-minute window, initiates outbound connections to 5 or more distinct internal ICS assets (e.g., PLCs, RTUs) with which it has not communicated in the preceding 30 days. This abrupt change from a static communication baseline is highly anomalous in a deterministic ICS environment.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Asset Inventory DB"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeters between IT and OT zones (e.g., IT/OT firewalls), ICS DMZ hosts, jump servers, and critical ICS assets such as Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, and SCADA servers.",
            "action": [
              "Create a rule to detect inbound connections in Zeek conn.log to a known ICS host where the source IP (id.orig_h) is external (not in defined internal IT/OT ranges). If detected, search for at least 5 subsequent, new outbound connections from that ICS host to unique internal ICS assets within a 5-minute window. A 'new' connection is defined as one to an asset not seen communicating with the source host in the last 30 days. Trigger a high-severity alert if the count exceeds 5, enriching with the initiating process from Windows Event ID 4688 and asset criticality from an asset inventory.",
              "For each ICS host, calculate a 30-day rolling baseline (average, standard deviation, 99th percentile) of the daily count of unique internal destination IPs from Zeek conn.log. Generate a medium-severity alert if the current day's count exceeds 3 standard deviations from the mean or surpasses the 99th percentile. Combine this Z-score with the reputation of the external source IP's ASN and the criticality of the destination assets to generate a composite risk score for alert prioritization.",
              "Implement a graph-based anomaly detection model (e.g., GraphSAGE) using Zeek conn.log data, where IPs are nodes and connections are edges. Train the model on at least 90 days of historical data to learn normal ICS communication graphs. Deploy the model to analyze network traffic in near-real-time and generate an alert when an ICS host's centrality score (e.g., degree, betweenness) suddenly increases, connecting to a cluster of previously unrelated assets, especially following an inbound external connection. An anomaly score exceeding a dynamically learned threshold triggers the alert."
            ]
          },
          {
            "description": "A designated intermediary host, such as a Jump Server or OT DMZ host, receives an inbound connection from an external IP address and, within 30 seconds, initiates one or more outbound connections to internal ICS assets using native ICS protocols (e.g., Modbus/TCP on port 502, DNP3 on port 20000, S7 on port 102, EtherNet/IP on port 44818). This relay behavior is highly suspicious if the external source is from an unexpected geo-location or ASN, or if the activity is not documented in change management logs.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Asset Inventory DB",
              "Threat Intelligence Feeds",
              "Change Management Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hosts within the OT DMZ, designated jump servers, SCADA servers, and the network segments containing field devices such as PLCs and RTUs.",
            "action": [
              "Monitor Zeek conn.log for inbound connections to designated intermediary hosts (e.g., Jump Servers) from external IPs. For each event, query for subsequent outbound connections from the intermediary host to internal ICS assets on known ICS protocol ports (e.g., 502/TCP, 20000/TCP, 102/TCP, 44818/TCP) within a 30-second window. If this sequence is found, cross-reference the external IP against threat intelligence feeds and the event timestamp against change management logs. Trigger a critical alert if the IP is malicious or the activity is unauthorized, enriching with user context from Windows Event ID 4624.",
              "For each intermediary host and user account, establish a 14-day rolling baseline of unique (external_IP, internal_ICS_IP, ICS_Protocol, user_account) relay tuples observed in Zeek conn.log and Windows Event ID 4624. Calculate the daily count of these unique tuples. Generate an alert if the current day's count exceeds the 99.9th percentile of historical observations or is more than 3 standard deviations above the mean, prioritizing alerts involving high-value internal assets.",
              "Train a sequence analysis model, such as a Hidden Markov Model (HMM) or an LSTM-based autoencoder, on historical connection sequences (e.g., protocol, duration, bytes transferred) for intermediary hosts. The model should learn the probability of transitioning between states (e.g., 'awaiting connection', 'external RDP in', 'internal Modbus out'). Deploy the model to score live connection sequences and alert when a low-probability sequence is detected, indicating a deviation from normal operational or maintenance patterns, such as a long-lived, low-bandwidth connection indicative of a C2 heartbeat."
            ]
          },
          {
            "description": "A host exhibits network traffic consistent with C2 protocol tunneling, followed by new connections from that host to internal ICS assets within 60 seconds. Tunneling evidence includes anomalies in legitimate protocols, such as DNS queries with length > 64 characters or Shannon entropy > 4.0; HTTP/S traffic with non-standard user-agents or high-entropy SNI values; or ICMP packets with unusually large payloads, indicating data exfiltration or C2 communications being encapsulated.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek icmp.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, any OT host with direct or proxied internet access (e.g., Historians, Engineering Workstations), perimeter firewalls and web proxies, and network segments where ICMP is permitted.",
            "action": [
              "Implement SIEM rules to detect tunneling indicators in real-time. For DNS, alert on Zeek dns.log entries where query length > 64 characters or entropy > 4.0. For HTTP/S, alert on Zeek http.log for suspicious User-Agents or Zeek ssl.log for anomalous JA3/JA3S hashes. For ICMP, alert on Zeek icmp.log for abnormally large payloads. If any tunneling indicator is detected, correlate the source host with any new connections to internal ICS assets in Zeek conn.log within the next 60 seconds. An alert should be triggered upon this correlation.",
              "For each host, compute 30-day rolling baselines (mean, std dev, 99th percentile) for key tunneling metrics from Zeek logs: DNS query entropy, HTTP URI entropy, ICMP packet size, and the frequency of observed JA3/JA3S hashes. Generate an alert when a host's metric exceeds 3 standard deviations from its baseline or surpasses the 99.5th percentile. Create a composite risk score by combining multiple anomalies (e.g., high DNS entropy + rare JA3 hash) to prioritize investigations.",
              "Train a supervised classifier, like a Random Forest, using features extracted from Zeek logs (e.g., query length, entropy, TLD, HTTP method, JA3 hash, certificate validity, packet sizes) on a labeled dataset of tunneled and non-tunneled traffic. Alternatively, if labeled data is unavailable, use an unsupervised model like an Isolation Forest trained on normal traffic. Deploy the model to score live traffic. A high-confidence prediction of tunneling (e.g., score > 0.95) should automatically trigger a query to identify if the source host subsequently initiated new connections to internal ICS assets, confirming the proxy behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]