[
  {
    "information_requirement": "Is an adversary discovering information about our remote ICS systems? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0888",
        "name": "Remote System Information Discovery",
        "evidence": [
          {
            "description": "An unauthorized host or a host exhibiting anomalous behavior sends a high volume of requests for detailed system information (e.g., make, model, firmware version) to multiple ICS devices, such as PLCs or RTUs, within a short timeframe. This deviates from the typical, periodic polling by legitimate SCADA servers or engineering workstations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting Engineering Workstations (EWS) to control devices (PLCs, RTUs) and the OT network core.",
            "action": "Using Zeek logs with ICS protocol parsers (e.g., modbus.log), aggregate requests by source IP for specific information-gathering function codes (e.g., Modbus function code 43 - Read Device Identification). Establish a baseline of request frequency and the number of unique destination devices per source IP over a 24-hour period. Use statistical analysis to alert when a source IP's request count or scan breadth (number of unique destinations) exceeds 3 standard deviations from its established baseline. Correlate the source IP against an asset inventory of authorized management systems to prioritize alerts from non-standard or unknown devices."
          },
          {
            "description": "A process not associated with standard ICS management software is executed on an Engineering Workstation and initiates connections to multiple control systems using discovery-related protocols or function codes.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and other hosts with access to the OT network.",
            "action": "On EWS hosts, monitor for process creation events (Windows Event ID 4688). Create a whitelist of known-good processes associated with HMI/SCADA software (e.g., 'Studio5000.exe', 'TIA Portal.exe'). Alert on any non-whitelisted process that is created. Correlate the timestamp and host IP of the alert with network connection logs (Zeek conn.log) to identify if the anomalous process initiated network connections to ICS devices on control-specific ports (e.g., TCP/502 for Modbus, TCP/20000 for DNP3). A temporal correlation between an unknown process launch and subsequent scanning of OT devices is a strong indicator of malicious discovery."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]