[
  {
    "information_requirement": "Is the adversary attempting to disable or manipulate the Safety Instrumented System (SIS)? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0880",
        "name": "Loss of Safety",
        "evidence": [
          {
            "description": "An unauthorized logic download to a Safety PLC from an Engineering Workstation (EWS) or other host, occurring outside of a scheduled maintenance window or by an unauthorized user.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Safety Instrumented System (SIS) network segment, OT/IT Demilitarized Zone (DMZ)",
            "action": "On Engineering Workstations, monitor for process creation events (Windows Event ID 4688) of SIS programming software (e.g., Triconex TriStation, Rockwell Studio 5000). Correlate the process launch with the logged-on user (Windows Event ID 4624) and the time of the event. For each launch, search Zeek conn.log for a corresponding network connection from the EWS to a known Safety PLC IP address. Establish a baseline of authorized users and approved maintenance windows for these activities. An alert should be generated for any programming activity that deviates from this baseline. Further, analyze the `orig_bytes` and `resp_bytes` fields in conn.log; a significant data transfer from the EWS to the PLC can indicate a logic download. Check Zeek files.log for any file transfers over protocols like FTP or SMB to the PLC, which could also represent a logic file transfer."
          },
          {
            "description": "Anomalous use of specific ICS commands known to inhibit, bypass, or override a safety function, originating from an unexpected source (e.g., a host outside the process control network).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), SIS network segment, Process Control Network (PCN)",
            "action": "Using a Zeek script or protocol analyzer that parses ICS protocols (e.g., Modbus, S7comm, DNP3), create a watchlist of function codes or commands that can alter the state of a safety system (e.g., Modbus 'Write Single Coil' to a bypass address). For every observed command on the watchlist, log the source IP, destination IP, and timestamp. Establish a baseline for which hosts are authorized to send these commands. Use Zeek conn.log and Windows Event ID 4624 to enrich the source IP with the user account on the originating machine. Calculate the frequency of these commands over time. Use a statistical model to alert on an anomalous increase in bypass commands (e.g., count exceeds the 95th percentile of the daily baseline) or if a command originates from an IP address not on the authorized list."
          },
          {
            "description": "A targeted network denial-of-service (DoS) attack against a Safety PLC or its associated I/O modules, characterized by a sudden and sustained spike in network traffic from one or more sources.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIS network segment, Network firewalls and routers separating process control zones",
            "action": "For critical SIS assets (PLCs, controllers), establish a multi-metric network baseline using Zeek conn.log, including connections per minute, unique source IPs, total bytes transferred, and protocol distribution. Continuously monitor for statistically significant deviations from this baseline. An alert should be triggered if, for example, the number of inbound connections to a Safety PLC from a single source exceeds 3 standard deviations of the norm for a sustained period (e.g., >1 minute). Additionally, monitor the `conn_state` field in conn.log for an abnormally high ratio of 'REJ' (rejected) or 'S0'/'S1' (incomplete) connections, which can indicate a SYN flood. Correlate findings with Zeek notice.log for any related scanning or network anomaly alerts targeting the SIS network segment."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]