[
  {
    "information_requirement": "Is the adversary attempting to disable or manipulate the Safety Instrumented System (SIS)? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0880",
        "name": "Loss of Safety",
        "evidence": [
          {
            "description": "The transfer of a PLC logic file (e.g., .L5X, .ACD, .PRO) to a Safety Instrumented System (SIS) PLC which is considered anomalous due to a combination of factors: occurring outside a documented maintenance window, originating from an unauthorized user account or host IP address, or utilizing a non-standard network protocol for logic transfers.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4672",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek smb.log",
              "Zeek ftp.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) within the Process Control Network (PCN), SIS network segment, OT/IT Demilitarized Zone (DMZ) gateways, SIS PLCs, File servers storing PLC logic, Authentication servers (Active Directory/LDAP).",
            "action": "1. Symbolic Logic: Create and maintain an asset inventory of SIS PLCs and authorized Engineering Workstations (EWS), and a user-based whitelist for accounts authorized to program SIS devices. Deploy a SIEM rule that triggers when a file transfer is detected in network logs (e.g., Zeek files.log, smb.log) with a destination IP matching an SIS PLC, a file name extension matching known logic file types, and the source IP is not a whitelisted EWS or the transfer occurs outside a scheduled maintenance window. Correlate the source IP to a user login on the EWS (Windows Event ID 4624) to verify the user is not on the authorized programmer whitelist.\n2. Statistical Method: For each authorized EWS-to-SIS PLC pair, establish a 30-day rolling baseline of file transfer characteristics using Zeek logs by correlating conn.log and files.log with the 'fuid'. Calculate the 99th percentile for transfer size (sum of 'resp_bytes') and connection duration. Generate an alert if a new logic file transfer exceeds both its size and duration 99th percentile thresholds simultaneously, indicating a statistically significant deviation from normal update behavior.\n3. Machine Learning Application: Train a binary classification model (e.g., Random Forest) to label logic downloads as 'authorized' or 'anomalous'. Use features from host (Windows Event IDs 4688, 4624) and network logs (Zeek conn.log, files.log), including source/destination IP, user account, protocol, file size, duration, time of day, and a binary feature indicating if it is within a maintenance window. Deploy the model to score all new logic downloads; a score above a high-confidence threshold (e.g., > 0.9) triggers an immediate investigation."
          },
          {
            "description": "Observation of specific ICS protocol commands or function codes known to alter, inhibit, or bypass safety functions sent to a known Safety Instrumented System (SIS) PLC. The command is considered anomalous if it originates from an unauthorized host, is not part of a documented maintenance or testing procedure, or targets a critical safety function with parameters outside of safe operational limits.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Safety Instrumented System (SIS) network segment, Process Control Network (PCN), SIS PLCs, Industrial Demilitarized Zones (IDMZ), Engineering Workstations (EWS), Authentication servers.",
            "action": "1. Symbolic Logic: Define a watchlist of high-risk ICS commands targeting safety functions (e.g., Modbus 'Write Single Coil' on a trip relay, S7comm 'Write Var' to a safety data block). Deploy a SIEM rule or Zeek script that monitors protocol-specific logs (modbus.log, s7comm.log, enip.log) for these commands directed at SIS PLC IPs. Generate a high-severity alert if a watched command is detected and the source IP is not on an explicit whitelist of authorized engineering hosts or the command occurs outside a documented change window.\n2. Statistical Method: For each SIS PLC, establish a 30-day rolling baseline of command behavior from Zeek ICS logs. Calculate two metrics in 5-minute windows: the frequency of critical 'write' or 'modify' commands, and the Shannon entropy of all observed function codes. Generate an alert if the frequency of a critical command exceeds 3 standard deviations from its baseline average, or if the function code entropy for a device suddenly spikes more than 2 standard deviations, indicating a novel and unpredictable command sequence.\n3. Machine Learning Application: Develop a sequence anomaly detection model (e.g., LSTM autoencoder) trained on historical sequences of ICS commands as tuples (timestamp, source_ip, dest_ip, protocol, function_code) from Zeek logs. The model learns the normal grammar of operational communication. Deploy the model to analyze real-time command sequences; a sequence with a high reconstruction error indicates a statistically significant deviation from learned safe operational patterns and should trigger an alert."
          },
          {
            "description": "A sudden, sustained surge of network traffic towards an SIS PLC, evidenced by a rate of new connection attempts, malformed packets, or total data volume that is multiple standard deviations above the established operational baseline, and which correlates with device unresponsiveness or packet drop notifications from network infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek weird.log",
              "Zeek packet_filter.log",
              "Network device logs (firewalls, switches, routers)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIS network segment, SIS PLCs, Industrial Demilitarized Zones (IDMZ), Network firewalls and routers separating process control zones, Core Process Control Network (PCN) switches, Network Intrusion Detection Systems (NIDS).",
            "action": "1. Symbolic Logic: Deploy a SIEM rule that queries Zeek conn.log every 30 seconds for connections targeting SIS PLC IP addresses with a 'conn_state' of 'S0' (SYN sent, no reply), 'S1' (SYN-ACK sent, no reply), or 'REJ' (connection rejected). If the count from a single source IP to a single SIS PLC exceeds 300 connections within the 30-second window, generate a high-severity alert. Concurrently, create rules to alert on any 'Scan::Address_Scan' or 'DoS::Excessive_Connections' notices from Zeek notice.log where the destination is an SIS asset.\n2. Statistical Method: For each SIS PLC, establish a 30-day rolling baseline from conn.log for the following per-minute metrics: total new connections, unique source IPs, total inbound bytes, and the ratio of rejected ('REJ') to established ('SF') connections. Generate an alert if the connection count or unique source IP count exceeds its 99th percentile for two consecutive minutes, or if the rejected connection ratio spikes more than 3 standard deviations above its mean.\n3. Machine Learning Application: Implement a multivariate time-series forecasting model (e.g., Prophet) for key traffic metrics per SIS PLC, including inbound packets per second and bytes per second from Zeek conn.log data. The model must be trained on at least 30 days of data to learn operational seasonality. Generate an alert when observed traffic volume consistently exceeds the model's predicted upper 99% confidence interval for a sustained period (e.g., > 60 seconds), indicating a volumetric anomaly not explained by normal process cycles."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]