[
  {
    "information_requirement": "Is the adversary attempting to inhibit our response functions by stopping critical ICS services? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0881",
        "name": "Service Stop",
        "evidence": [
          {
            "description": "A command is executed via the command line (e.g., sc.exe, net.exe, powershell) to stop a critical ICS-related service on a key operational technology (OT) asset like an Engineering Workstation or HMI.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human Machine Interfaces (HMIs), Historian Servers, OPC Servers",
            "action": "Create a watchlist of critical ICS service names (e.g., 'Rockwell FactoryTalk', 'OSIsoft PI', 'Wonderware Historian'). Monitor for Windows System Event ID 7036 where a service from this list enters the 'stopped' state. For each stop event, correlate by timestamp and host to find a preceding Windows Security Event ID 4688 (Process Creation) within a 1-minute window. Analyze the command line in the 4688 event for commands like 'sc.exe stop', 'net stop', or 'Stop-Service'. Establish a baseline of normal maintenance times; alert on any critical service stop events that deviate from this baseline by more than two standard deviations or occur on a weekend without a corresponding change ticket."
          },
          {
            "description": "A critical ICS service stops immediately following an anomalous network connection to the host, suggesting remote initiation of the service stop.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "OT Network Segments, DMZ between IT/OT, Critical Control System Hosts (e.g., EWS, HMIs)",
            "action": "Join Zeek conn.log data with Windows Event ID 7036 on the destination IP (id.resp_h) and timestamp. For every critical service stop event (Event ID 7036 on a watched service), query all network connections in conn.log to that host in the preceding 5 minutes. Build a statistical profile of normal connections for each critical host (e.g., typical source IPs, common ports, protocol distribution). Flag any connection preceding a service stop that is statistically anomalous, such as a connection from a source IP never before seen communicating with that host, a connection from the IT network directly into the OT network, or the use of an uncommon destination port. A high risk score is assigned if an anomalous connection is immediately followed by a critical service stop."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]