[
  {
    "information_requirement": "Is an adversary using a commonly used ICS or IT port for Command and Control?",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0885",
        "name": "Commonly Used Port",
        "evidence": [
          {
            "description": "Traffic on a standard IT or OT port (e.g., 80, 443, 502, 102, 20000) does not match the expected protocol associated with that port.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways between IT and OT networks",
            "action": "Using Zeek conn.log, filter for connections on critical IT/OT ports (e.g., 80, 443, 53, 502, 102, 20000, 44818). Compare the 'service' field to the expected protocol for the 'id.resp_p' (destination port). Flag any mismatches (e.g., 'service' is 'ssh' on port 502, or 'service' is 'unknown' on a well-known port with significant data transfer). Calculate the frequency of mismatches per source IP to identify persistent anomalous behavior."
          },
          {
            "description": "An asset within the ICS/OT network (e.g., PLC, HMI, Engineering Workstation) initiates an outbound connection to an external, non-whitelisted IP address on a common port.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS network segments containing HMIs and Engineering Workstations",
            "action": "Correlate asset inventory with network traffic from Zeek conn.log. Filter for connections where the 'id.orig_h' is an IP address of a known ICS asset and 'id.resp_h' is an external IP address (not within RFC1918 or other internal ranges). On host systems like Engineering Workstations, monitor Windows Event ID 5156 (WFP permitted a connection) for connections initiated by unexpected applications to external destinations on common ports like 80, 443, or 53. Maintain and compare against a whitelist of allowed applications and destinations."
          },
          {
            "description": "Connections on a commonly used port exhibit unusual characteristics, such as abnormally high data volume, long duration, or high entropy, inconsistent with the port's typical usage in an OT environment.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs monitoring traffic to/from critical ICS assets (e.g., PLCs, HMIs, Historians)",
            "action": "For connections on common OT ports (e.g., 502, 102, 44818) in Zeek conn.log, establish a baseline for 'duration', 'orig_bytes', and 'resp_bytes'. Use statistical methods (e.g., calculating the 95th percentile) to identify outliers that significantly deviate from the established norm for that specific protocol. For DNS traffic (port 53), analyze query/response sizes in dns.log; flag connections with unusually large payloads which could indicate tunneling. Alert on any connection whose metrics exceed three standard deviations from the established baseline for its port."
          },
          {
            "description": "A non-browser process on an Engineering Workstation or HMI initiates a high frequency of beacon-like connections over a common web port (80/443).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations and Human-Machine Interfaces (HMIs)",
            "action": "On endpoints, correlate process creation (Windows Event ID 4688) with network connections (Windows Event ID 5156). Identify processes that are not standard web browsers (e.g., chrome.exe, firefox.exe) making outbound connections on ports 80 or 443. From network data (Zeek conn.log), group connections by source IP and destination IP/port. Calculate the time delta between connections in each group. A low standard deviation in these time deltas suggests a regular, automated beacon characteristic of C2 traffic. Flag any non-browser process exhibiting this behavior."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]