[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via an internet-exposed device?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0883",
        "name": "Internet Accessible Device",
        "evidence": [
          {
            "description": "Detection of inbound connection attempts from an external IP address (not RFC1918 or on an approved allowlist) to an asset on a designated ICS network segment. This targets common ICS protocol ports (e.g., TCP 102 for S7, TCP 502 for Modbus, TCP/UDP 9600 for Omron FINS, TCP 44818 for EtherNet/IP) or remote access ports (e.g., TCP 5900 for VNC, TCP 3389 for RDP). Evidence includes connections logged in Zeek with a conn_state of 'S0' (connection attempt seen, no reply), 'REJ' (connection attempt rejected), or 'SF' (normal establishment) but with a very low data footprint (e.g., orig_bytes + resp_bytes < 100) and short duration (< 5 seconds), indicative of scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security monitoring sensors at the ICS network perimeter and IT/OT boundary, Firewall and IDS/IPS logs at the internet gateway",
            "action": [
              "Create a detection rule that triggers on Zeek conn.log events where `id.orig_h` is not in an RFC1918 or approved IP range, `id.resp_h` is within a defined ICS network range, and `id.resp_p` is in a watchlist of ICS/remote access ports (102, 502, 9600, 20000, 44818, 3389, 5900). Alert if `conn_state` is 'S0' or 'REJ'. For `conn_state` 'SF', alert if `duration` < 5 and `orig_bytes` + `resp_bytes` < 100. Cross-reference `id.orig_h` against a threat intelligence feed of known scanners or malicious actors.",
              "For each destination port (`id.resp_p`) in the ICS network, establish a 7-day rolling baseline of the hourly count of unique external source IPs (`id.orig_h`) initiating connections. Calculate the 99th percentile of this hourly count. Alert if the current hourly count exceeds this threshold. Additionally, calculate the entropy of destination ports targeted by a single external source IP in a 1-hour window; a high entropy score suggests a port scan across the asset.",
              "Deploy a time-series anomaly detection model (e.g., an LSTM autoencoder) on the aggregated hourly volume of inbound connection attempts (grouped by `conn_state`) to the ICS network from external IPs. Train the model on at least 90 days of network traffic data. Alert when the model flags a statistically significant anomaly in the volume or pattern of 'S0', 'REJ', or short 'SF' connections, indicating a coordinated scanning campaign."
            ]
          },
          {
            "description": "A high frequency of failed remote login attempts (Windows Event ID 4625 with Logon Type 3 or 10) originating from a single external source IP address to one or more accounts on a Windows-based ICS asset (e.g., HMI, Engineering Workstation, Jump Server). A specific threshold is 5 or more failures from one source IP within a 60-second window, which indicates a potential brute-force or password spraying attack.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint security logs on internet-facing Windows-based ICS assets (HMIs, EWS, Jump Servers), Authentication logs from central servers (Domain Controllers, RADIUS), Network security monitoring sensors at the network perimeter",
            "action": [
              "Create a rule that aggregates Windows Event ID 4625 by `Source Network Address` and `Target Account Name` over a 60-second sliding window. Trigger an alert if the count for a single non-RFC1918 `Source Network Address` exceeds 5. Enrich the alert by correlating the source IP and timestamp with Zeek conn.log to confirm the external connection path and with Zeek rdp.log or ssh.log for protocol-specific details like client software versions. Check the source IP against a threat intelligence blocklist.",
              "For each internet-facing ICS asset, establish a 7-day baseline of the hourly rate of failed logins (Event ID 4625, Type 3/10) from external IPs. Alert when the current rate from a single source IP exceeds the 99th percentile. Additionally, calculate the Shannon entropy of the `Target Account Name` field for failures from a single source IP over a 5-minute period. A low entropy score suggests a brute-force attack on one account, while a high entropy score suggests a password spraying attack across many accounts.",
              "Train a supervised classification model (e.g., Random Forest) to identify brute-force attacks in real-time. Use features from Windows Event ID 4625 (e.g., logon type, status code) and enriched Zeek data (e.g., source IP geolocation, ASN, time of day, RDP client name from rdp.log). Label historical data with known brute-force incidents. Classify each new failed login event and alert on events classified as malicious with high confidence (>0.9)."
            ]
          },
          {
            "description": "A successful remote login (Windows Event ID 4624, Logon Type 10 or 3) to an ICS asset originating from an external IP address that deviates from the established behavioral profile for the user account or asset. The deviation is characterized by anomalies in geolocation, time-of-day, source ISP, or a lack of prior history.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log",
              "Approved Remote Access IP Whitelist"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint security logs on internet-facing Windows-based ICS assets, Authentication logs from central servers (Domain Controllers, RADIUS), Asset management database containing whitelists of approved remote access IPs per user",
            "action": [
              "Create a high-priority alert for any successful login (Windows Event ID 4624, Type 10 or 3) where the `Source Network Address` is external (not RFC1918) and is NOT found in a pre-approved whitelist of IP addresses for that specific `Target Account Name` and destination asset. Immediately cross-reference the source IP against threat intelligence feeds.",
              "For each user account, build a multi-faceted baseline profile from the last 90 days of successful logins (Event ID 4624), including: 1) Source country and ASN, 2) Hour of day and day of week, 3) Subnet/24 of the source IP. For each new login, calculate a deviation score based on how anomalous each factor is (e.g., new country = high score, new hour = medium score). Alert if the cumulative score exceeds a statistically defined threshold (e.g., 3 standard deviations from the mean score of all historical logins for that user).",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest) as a User and Entity Behavior Analytics (UEBA) function. Feed the model with features from successful logins, including time-based features (time since last login), geographical features (distance from previous login), network features (source ASN, RDP client version), and categorical features (user, asset). The model learns the normal behavior for each user and entity and alerts when a new login is flagged as a significant outlier."
            ]
          },
          {
            "description": "Following a successful login flagged as anomalous, the detection of subsequent suspicious network activity originating from the compromised ICS asset. This includes: 1) Outbound connections to external destinations not previously contacted by this asset, 2) Data transfers with unusually large payloads, or 3) The use of non-standard protocols or ports for communication.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security monitoring sensors at the ICS perimeter, Endpoint logging (process creation and network filtering) on the source ICS asset",
            "action": [
              "Upon an alert for an anomalous successful login, trigger a secondary search. Alert if, within 30 minutes of the login, Windows Event ID 5156 or 4688 shows a process (e.g., powershell.exe, cmd.exe, rundll32.exe) on the compromised host initiating an outbound connection (Zeek conn.log) to an external IP on a known C2 threat intelligence list.",
              "For the session following an anomalous login, monitor all outbound connections from the source ICS asset (`id.orig_h`). For each connection, compare the destination IP's country/ASN, destination port, and outbound data volume (`resp_bytes`) against the asset's 30-day historical record. Alert if any of these attributes fall into the 99th percentile of rarity (e.g., a connection to a new country, a port never used before by this asset, or a data transfer size 10x the average).",
              "Develop a sequence analysis model (e.g., a Hidden Markov Model) trained on typical post-login event sequences (process creations, network connections, file modifications) for users on ICS assets. Feed the model the sequence of events following a login flagged as anomalous. Alert if the model calculates a low probability for the observed event sequence, indicating a significant deviation from normal post-login behavior, such as downloading a tool and establishing a persistent connection."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]