[
  {
    "information_requirement": "Is the adversary attempting to disable or manipulate the Safety Instrumented System (SIS)? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0880",
        "name": "Loss of Safety",
        "evidence": [
          {
            "description": "A detected transfer of a PLC logic file (e.g., `.L5X`, `.PRO`, `.SGF`) from an Engineering Workstation (EWS) to a Safety Instrumented System (SIS) PLC. This transfer is considered anomalous if it occurs outside of a pre-approved, documented maintenance window (e.g., no corresponding change management ticket), originates from an IP address or user account not on an authorized whitelist for SIS programming, or utilizes an unexpected network protocol for logic downloads (e.g., FTP instead of a vendor-specific protocol like S7comm or EtherNet/IP).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4672",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek smb.log",
              "Zeek ftp.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) within the Process Control Network (PCN), SIS network segment, OT/IT Demilitarized Zone (DMZ) gateways, SIS PLCs, File servers storing PLC logic, Authentication servers (Active Directory/LDAP).",
            "action": "1. Symbolic Logic: Create and maintain a watchlist of known SIS programming software executables (e.g., `Studio5000.exe`, `TriStation.exe`, `UnityPro.exe`). Monitor EWS hosts for process creation events (Windows Event ID 4688) matching this list. For each detected process, correlate with the user's login session (Windows Event ID 4624) using `Logon_ID` to determine the initiating user. Simultaneously, monitor network logs (Zeek files.log, smb.log, s7comm.log, enip.log) for file transfers from the EWS's IP address (`id.orig_h`) to a known SIS PLC's IP address (`id.resp_h`) within a 5-minute window of the process creation. Alert if the initiating user is not on an authorized SIS programming whitelist, or if the transfer occurs outside of a scheduled maintenance period as defined by a change management system. Also, alert on transfers using non-standard protocols like FTP (Zeek ftp.log) to SIS PLCs.\n2. Statistical Method: Using historical Zeek conn.log and files.log data from the past 30 days, establish a rolling baseline for legitimate logic downloads between each authorized EWS-to-SIS PLC IP pair. Calculate the 99th percentile for file transfer sizes (correlating Zeek's `fuid` between `files.log` and `conn.log` to sum `orig_bytes` or `resp_bytes`) and connection durations (`duration`). Alert if a new logic file transfer's size or duration exceeds its respective 99th percentile, suggesting an unusually large or prolonged transfer inconsistent with typical logic updates, which could indicate a malicious payload or reconnaissance activity.\n3. Machine Learning Application: Train a binary classification model (e.g., Random Forest or XGBoost) to label logic download events as 'authorized maintenance' or 'anomalous'. Extract features from network (Zeek conn.log, files.log, protocol-specific logs) and host logs (Windows Event IDs 4688, 4624) including source IP, destination IP, user account, network protocol, file size, connection duration, day of week, hour of day, and a binary feature indicating if the event occurred within a scheduled maintenance window. An 'anomalous' prediction with a high confidence score (e.g., >0.9) should trigger an immediate investigation, as it indicates a statistically significant deviation from normal, safe update procedures."
          },
          {
            "description": "A network log entry showing the use of specific Industrial Control System (ICS) protocol commands or function codes targeting a Safety Instrumented System (SIS) PLC, which are known to inhibit, bypass, or override safety functions. Examples include forcing a safety relay to an unsafe state, disabling a critical trip alarm, or modifying safety configuration parameters. The command is anomalous if it originates from an unauthorized host IP, is initiated by an unauthorized user account (correlated from host logs), or occurs outside a predefined operational context like scheduled testing or maintenance (e.g., no corresponding work order).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Safety Instrumented System (SIS) network segment, Process Control Network (PCN), SIS PLCs, Industrial Demilitarized Zones (IDMZ), Engineering Workstations (EWS), Authentication servers.",
            "action": "1. Symbolic Logic: Implement SIEM rules or Zeek scripts that monitor ICS protocol logs (modbus.log, s7comm.log, enip.log) for a strict watchlist of commands and function codes known to alter safety states. This watchlist must include function codes that can directly write to or modify safety-critical memory addresses, coils, or tags on SIS PLCs (e.g., Modbus function code 5 'Write Single Coil' or 6 'Write Single Register' targeting specific safety registers; S7comm 'Write Var' targeting safety-related data blocks; EtherNet/IP explicit messages modifying safety module configuration). Generate a high-severity alert if such a command is observed with a source IP not on an explicit whitelist of authorized EWS/HMI devices, or if the command targets a known safety-critical address/tag outside of a documented maintenance or testing period.\n2. Statistical Method: For each whitelisted source and destination SIS PLC pair, establish a 30-day rolling baseline of command frequencies and parameter value distributions from Zeek ICS logs (e.g., `modbus.function_code`, `s7comm.request_type`). Calculate the Shannon entropy of function codes observed in 5-minute windows for each SIS PLC. Generate an alert if the frequency of a critical 'write' command to an SIS PLC exceeds 3 standard deviations from its baseline average, or if the command entropy for a device suddenly spikes (e.g., >2 standard deviations from average entropy), indicating a novel and unpredictable sequence of commands inconsistent with normal, stable operations.\n3. Machine Learning Application: Develop a sequence anomaly detection model (e.g., using an LSTM autoencoder or a Markov chain model) trained on historical sequences of ICS commands (tuple of (source IP, destination IP, protocol, command/function code, parameters)) captured in Zeek ICS logs. The model learns the legitimate 'grammar' and typical order of device communication during normal operations. Alert when a new sequence of commands results in a high reconstruction error (for autoencoder) or a very low probability (for Markov chain), indicating a statistically significant deviation from learned safe and normal operational sequences, suggesting malicious manipulation of safety functions."
          },
          {
            "description": "A sudden and sustained surge in network traffic directed at a Safety Instrumented System (SIS) PLC, characterized by an abnormally high rate of connection attempts, a significant increase in malformed or invalid packets, or unusual protocol usage. This surge leads to measurable resource exhaustion (e.g., high CPU, dropped packets) and unresponsiveness of the safety device, as indicated by network performance metrics or device status logs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek weird.log",
              "Zeek packet_filter.log",
              "Network device logs (firewalls, switches, routers)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIS network segment, SIS PLCs, Industrial Demilitarized Zones (IDMZ), Network firewalls and routers separating process control zones, Core Process Control Network (PCN) switches, Network Intrusion Detection Systems (NIDS).",
            "action": "1. Symbolic Logic: Deploy a SIEM rule that queries Zeek conn.log every 30 seconds for new connections (`conn_state` 'S0' - SYN sent, no reply, 'S1' - SYN-ACK sent, no reply, or 'REJ' - connection rejected) targeting known SIS PLC IP addresses from any source. If the count of such connections from a single source IP to a single SIS PLC exceeds a predefined threshold (e.g., 300 connections in 30 seconds), generate a high-severity alert. Additionally, monitor Zeek notice.log for `Scan::Address_Scan` or `DoS::Excessive_Connections` notices specifically targeting SIS assets, and Zeek weird.log for a sudden increase in 'malformed packet' or 'protocol violation' entries directed at SIS PLCs.\n2. Statistical Method: For each SIS PLC, establish a 30-day rolling baseline from Zeek conn.log for the following metrics, calculated per minute: total new connections, unique source IPs, total inbound bytes, and the entropy of `conn_state` values. Generate an alert if the total new connection count or unique source IP count targeting an SIS PLC exceeds its 99th percentile, or if the connection state entropy drops sharply (e.g., below the 1st percentile, indicating a flood of a single state like 'S0' or 'REJ'), for two consecutive minutes. Use a Z-score or standard deviation calculation to identify statistically significant deviations.\n3. Machine Learning Application: Implement a multivariate time-series forecasting model (e.g., ARIMA or Prophet) for key traffic metrics per SIS PLC, such as inbound packets per second, bytes per second, and connection attempts per second, using Zeek conn.log data. The model should account for known operational seasonality (e.g., daily shifts, weekly maintenance). Generate an alert when the observed traffic volume for any of these metrics consistently exceeds the model's predicted upper 99% confidence interval for a sustained period (e.g., >60 seconds), indicating a volumetric anomaly not explained by normal process cycles or known operational events."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]