[
  {
    "information_requirement": "Is an adversary using remote services to gain initial access to the ICS network? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful remote service connection (RDP, VNC, SSH) to a critical OT asset (e.g., HMI, EWS) from an external source exhibits multiple anomalous characteristics simultaneously. These include originating from an IP not on an established access control list, occurring outside of standard maintenance windows, using a non-standard user account for that asset, or being the first such connection from that source IP in over 90 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log",
              "Windows Event ID 4624",
              "Microsoft-Windows-TerminalServices-LocalSessionManager/Operational Event ID 21"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Network Perimeter (ICS DMZ), Jump Servers, VPN Concentrators, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Networks (PCN).",
            "action": [
              "Create and maintain an allow list of authorized (Source IP, User, Destination Asset, Port) tuples for remote access. Ingest Zeek conn.log, Zeek ssh.log, and Windows Event ID 4624/21 logs into a SIEM. Implement a rule to generate an alert for any successful remote connection (e.g., Zeek conn_state = 'SF', ssh.log auth_success = T, Event ID 4624 Logon Type 10) on ports 22, 3389, or 5900 to a critical OT asset where the connection tuple is not on the allow list.",
              "For each critical OT asset, establish a 60-day baseline of: (a) known source IP subnets/ASNs, (b) login times by hour-of-day, and (c) session durations from Zeek conn.log. For each new connection, calculate a risk score by adding points for deviations: +1 for a source IP from a new/rare ASN, +1 for a login time >2 standard deviations from the mean for that hour, and +1 for a session duration >95th percentile. Generate an alert for any connection with a cumulative score of 2 or more.",
              "Train an unsupervised anomaly detection model, such as an Isolation Forest, on historical remote session data. Engineer features for each session including source IP geolocation, a boolean for allow list presence, destination asset criticality, hour of day, day of week, protocol, and bytes transferred (orig_bytes + resp_bytes from Zeek conn.log). Apply the trained model to new sessions in real-time and alert on sessions that receive a high anomaly score, indicating a rare combination of feature values."
            ]
          },
          {
            "description": "A brute-force or password spraying attack pattern is observed against an externally-facing OT asset, defined by a high rate of failed remote service authentications (RDP, SSH) from a single source IP, immediately followed by a successful authentication from the same source IP to one of the targeted assets within a short timeframe (e.g., 15 minutes).",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing remote access servers, Jump Servers, ICS DMZ, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Active Directory Domain Controllers within the OT environment.",
            "action": [
              "Implement a SIEM correlation rule that triggers an event when a single source IP generates more than 20 failed logins (Windows Event ID 4625 or Zeek ssh.log auth_success=F) to one or more OT assets within a 5-minute window. Generate a high-severity alert if this event is followed by a successful login (Windows Event ID 4624 or Zeek ssh.log auth_success=T) from the same source IP to any of the targeted destinations within the next 15 minutes.",
              "For each OT asset, establish a 30-day baseline of the failed login rate (count per minute) per source IP and calculate the 99th percentile. Monitor the failed login rate in real-time and generate an alert if the rate from any source IP exceeds its established 99th percentile for a given asset. Escalate the alert priority if a successful login from the anomalous source IP occurs within 30 minutes of the initial rate-based alert.",
              "Model login activity for each source-destination pair as a sequence of events. Train a Hidden Markov Model (HMM) with states representing 'Normal Activity' (low fail/success rate), 'Brute-Force Attack' (high fail rate), and 'Successful Compromise' (a success event following the brute-force state). Apply the model to live login event streams and generate an alert when the model determines the most probable sequence of states for an observed activity transitions into the 'Successful Compromise' state."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using remote services for lateral movement within the ICS network? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful remote service connection (RDP, VNC, SSH) is observed between two internal OT assets (e.g., HMI to EWS) where the specific source-destination-port-user combination has not been seen in a 90-day historical baseline or violates the defined OT network communication matrix (e.g., a Data Historian initiating an RDP session to an HMI).",
            "data_sources": [
              "Zeek rdp.log",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), Internal OT network segments.",
            "action": [
              "Generate a baseline set of all observed (source_host, destination_host, destination_port, user_account) tuples from 90 days of Zeek conn.log and Windows Event ID 4624 data, representing normal internal remote connections. Store this set in a lookup table. Create a real-time rule to check every new successful internal remote connection against this baseline and alert on any connection whose tuple is not found.",
              "For each internal host, use a 30-day rolling window to baseline its fan-out (number of unique RDP/SSH destinations) and destination entropy (Shannon entropy of the destination set). Calculate the 95th percentile for both metrics for each host. Generate an alert if a host's daily fan-out or destination entropy exceeds its established 95th percentile threshold, indicating potential scanning or anomalous pivoting activity.",
              "Model the OT network as a directed graph where nodes are hosts and edges are successful remote connections. Enrich nodes with asset attributes (e.g., type, criticality) and edges with connection attributes (e.g., protocol, user). Use a graph-based anomaly detection algorithm like GraphSAGE to learn normal graph structure. Generate alerts on the creation of low-probability edges (e.g., HMI to HMI RDP) or significant changes in edge weights that indicate anomalous behavior."
            ]
          },
          {
            "description": "An SMB connection is made to an administrative share (e.g., 'C$', 'ADMIN$') on a critical OT asset from a non-administrative workstation or from a user account accessing that share for the first time. This is followed by the transfer of an executable, script, or ICS project file (.exe, .ps1, .ACD, .L5K) inconsistent with established workflows, and subsequent execution of that file.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Zeek smb_files.log",
              "Windows Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Domain Controllers within the OT network, File Servers, Internal OT network segments.",
            "action": [
              "Create a correlation rule that detects the following sequence: 1) Access to an administrative share (C$, ADMIN$) on a critical OT asset (Windows Event ID 5145 or Zeek smb_mapping.log), followed by 2) a file write of a suspicious file type (.exe, .dll, .ps1, .bat, .L5K, .ACD) from the same source (Zeek smb_files.log), followed by 3) a process creation for that same filename on the destination host within 10 minutes (Windows Event ID 4688). Alert on the completion of this three-step sequence.",
              "For each user account, baseline the set of administrative shares they normally access over 30 days and alert on any first-time access to a new share. Separately, for each source-destination host pair, baseline the volume of SMB data transferred and the entropy of file extensions in Zeek smb_files.log. Alert if an SMB transfer volume exceeds 3 standard deviations from the mean or if file extension entropy indicates a targeted transfer of a single, non-standard file type.",
              "Implement a User and Entity Behavior Analytics (UEBA) model using a clustering algorithm like DBSCAN. For each SMB session, create a feature vector including user, source host, destination host type, share name, file extension category, file size, and time of day. The model will create clusters of normal behavior. Alert on any SMB activity that is flagged as noise by the algorithm, as it represents a significant deviation from all established normal behavior clusters."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]