[
  {
    "information_requirement": "Is an adversary using remote services to gain initial access to the ICS network? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful RDP connection (TCP port 3389, Logon Type 10) to a critical OT asset (e.g., HMI, PLC, EWS) where the source IP address is not included in the established whitelist of authorized IT/OT jump hosts or IT/OT gateway devices, or where the connection occurs outside of documented operational hours (e.g., 08:00-17:00 M-F) or scheduled maintenance windows.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Windows Event ID 4624",
              "Microsoft-Windows-TerminalServices-LocalSessionManager/Operational Event ID 21"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Network Perimeter (ICS DMZ), Jump Servers, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Networks (PCN), Critical OT Assets.",
            "action": "1. Symbolic Logic: Identify successful RDP connections in Zeek conn.log (service=rdp or TCP port 3389) and Windows Event ID 4624 (Logon Type 10) where the destination IP is categorized as a critical OT asset. Filter for connections where the source IP is not present in the established whitelist of authorized IT/OT jump hosts or IT/OT gateway devices. Generate an alert for any direct connection from a non-whitelisted source IP to a critical OT asset. 2. Statistical Method: For each critical OT asset, establish a 30-day baseline of RDP connection times, durations, and source IPs using Zeek conn.log and Windows Event ID 4624. Define an operational window (e.g., 08:00-17:00 M-F) and calculate the 95th percentile for connection duration. Flag RDP sessions that occur outside the defined operational window or whose duration exceeds the 95th percentile for that asset, especially if originating from an internal source IP not typically associated with RDP to that asset. 3. Machine Learning: Utilize historical Zeek rdp.log and Windows Event ID 4624 data to train an unsupervised machine learning model (e.g., Isolation Forest, One-Class SVM) on RDP session characteristics including source IP, destination IP, user account, time of day, day of week, and session duration. Apply the trained model to real-time RDP session data to identify and alert on RDP sessions that are statistically anomalous compared to the established 'normal' behavior for specific users or destination hosts."
          },
          {
            "description": "A series of multiple failed remote service login attempts (e.g., >20 attempts within 5 minutes, Windows Security Event ID 4625 for RDP/SMB) from a single source IP address, followed by a successful remote service login (Windows Security Event ID 4624, Logon Type 10) from the same source IP to any OT asset within a short time window (e.g., 15 minutes).",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing remote access servers (e.g., VPN concentrators), Jump Servers, ICS DMZ, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Active Directory Domain Controllers.",
            "action": "1. Symbolic Logic: Identify source IP addresses in Zeek conn.log (for TCP ports 3389 or 445) that generate more than 20 failed login attempts (Windows Event ID 4625) to a specific destination host within a 5-minute window. Subsequently, correlate these source IPs with successful login events (Windows Event ID 4624, Logon Type 10) from the same source IP to any host within the OT network within the next 15 minutes. Generate an alert for such sequences. 2. Statistical Method: For each destination host, establish a 24-hour rolling baseline of the rate of failed RDP/SMB login attempts (Windows Event ID 4625) from unique source IPs. Calculate the 99th percentile and standard deviation for this rate. Alert when the current rate from a single source IP exceeds the 99th percentile by more than 3 standard deviations, especially if followed by a successful login from that same source IP to any OT asset. 3. Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA, Prophet) to monitor the aggregate count of failed RDP/SMB login attempts (Windows Event ID 4625) across all OT assets. Detect and alert on sudden, statistically significant spikes in failed login volumes that deviate from predicted normal ranges. Additionally, implement a sequence classification model to identify patterns of 'multiple failed logins followed by a single successful login' from a consistent source IP across different users or hosts."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using remote services for lateral movement within the ICS network? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful RDP connection (TCP port 3389, Logon Type 10) is observed between two hosts within the OT network that has no prior record in the 90-day historical baseline of RDP activity, or where the source/destination host role combination (e.g., HMI to HMI, PLC to EWS) is not part of the authorized communication matrix for RDP.",
            "data_sources": [
              "Zeek rdp.log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Programmable Logic Controllers (PLCs) with RDP capabilities, Remote Terminal Units (RTUs), Internal OT network segments.",
            "action": "1. Symbolic Logic: Establish and maintain a whitelist of authorized internal RDP source-destination IP pairs and associated user accounts within the OT network, derived from a 90-day historical baseline of Zeek conn.log (service=rdp) and Windows Event ID 4624. Alert on any new RDP connection (source IP, destination IP, user account) not present in this whitelist, particularly if it involves known administrative user accounts or critical OT assets. 2. Statistical Method: For each internal OT source host, calculate the Shannon entropy of its RDP destination hosts (Zeek conn.log, port 3389) over a rolling 24-hour window. Establish a baseline for entropy scores. Flag RDP connections where the entropy score drops below the 5th percentile, indicating a reduction in destination diversity. Additionally, identify source hosts that initiate RDP connections to a number of distinct destination hosts exceeding 3 standard deviations from their historical mean. 3. Machine Learning: Construct a network communication graph of RDP sessions using Zeek conn.log, Zeek rdp.log, and Windows Event ID 4624 data for internal OT hosts. Apply a graph-based anomaly detection algorithm (e.g., based on centrality measures or community detection) to detect new, previously unobserved RDP communication paths (new edges) or significant changes in the frequency or volume of existing RDP communication between nodes that deviate from the established normal graph structure."
          },
          {
            "description": "An SMB connection (TCP port 445) to an administrative share (e.g., 'C$', 'ADMIN$') or a previously unobserved share is detected on a critical OT asset (e.g., EWS, HMI, Process Control Server). This includes the transfer of potentially malicious file types (e.g., .exe, .dll, .ps1, .bat, .vbs) or ICS-specific project files (.ACD, .L5K, .PRO, .RSLogix) via SMB to/from an internal OT source/destination pair that has no historical record of such transfers or is outside of established baselines for file sharing.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Zeek smb_files.log",
              "Windows Event ID 4624",
              "Windows Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Domain Controllers within the OT network, File Servers within the OT network, PLC programming terminals, Internal OT network segments.",
            "action": "1. Symbolic Logic: Monitor Zeek smb_mapping.log for connections to administrative shares (e.g., 'C$', 'ADMIN$') or any shares not explicitly whitelisted on critical OT assets (EWS, HMIs, Process Control Servers). Furthermore, monitor Zeek smb_files.log for the transfer of executable file types (e.g., .exe, .dll, .ps1, .bat, .vbs) or ICS project files (.ACD, .L5K, .PRO, .RSLogix) between internal OT hosts where neither the source nor destination is a designated software update server or known engineering repository. Correlate with Windows Event ID 4688 for suspicious process creation on the destination host following such file transfers. 2. Statistical Method: Establish a 60-day baseline of SMB file transfer volumes and frequencies (Zeek smb_files.log) for each unique source-destination pair within the OT network. Calculate the 99th percentile for daily file count and total byte volume for each pair. Alert when current daily SMB activity for a pair exceeds these baselines by more than 2 standard deviations. Additionally, calculate the entropy of file extensions transferred from individual source hosts; alert if the entropy score drops below the 5th percentile, indicating a lack of diversity in transferred file types. 3. Machine Learning: Develop a User and Entity Behavior Analytics (UEBA) model using SMB activity logs (Zeek smb_mapping.log, Zeek smb_files.log, Windows Event ID 5145) to profile normal SMB access patterns for each user and host within the OT network. Employ an unsupervised anomaly detection algorithm (e.g., autoencoders, k-means clustering) to identify SMB sessions exhibiting unusual characteristics, such as access to shares not typically used by a user/host, transfer of atypical file types, or significant deviations in transfer sizes or frequency, indicative of potential lateral movement."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]