[
  {
    "information_requirement": "Has an adversary captured wireless ICS communications for subsequent use (e.g., replay attacks)? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Detection of ICS process control commands originating from authorized wireless gateways that exhibit characteristics of a replay attack: (1) command execution timestamps fall outside of documented operational hours or scheduled maintenance windows; (2) a command attempts to transition a process variable to its current state without an intervening opposite command (e.g., 'valve open' command when historian data confirms the valve is already open); (3) a command is immediately followed by a cascade of unexpected system-level alerts (e.g., PLC fault codes, HMI critical alarms) within 60 seconds; or (4) two or more commands with identical application-layer payloads (e.g., same Modbus function code, register, and value) are observed with different network-layer timestamps or sequence numbers within a short time frame (e.g., 5 minutes).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "PLC Controller Syslog",
              "ICS Historian Database Logs",
              "HMI Application Event Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting wireless gateways to the ICS network, Wireless Access Points/Gateways, Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Data Historian servers, and PLC/RTU network interfaces.",
            "action": "1. Symbolic Logic: Query Zeek dnp3.log or Zeek modbus.log for ICS write commands from wireless gateway IPs. For each command, verify the timestamp is within operational hours and not during a maintenance window. Cross-reference with HMI logs or Windows Event ID 4624 on HMIs to ensure a corresponding operator action occurred within a +/- 1-minute window. Query ICS Historian logs to confirm the command does not set a device to its existing state without a preceding opposite command. Create a rule to alert if a command is executed without a corresponding authorized operator action or if it represents a redundant state change. 2. Statistical Method: For each unique wireless gateway IP and critical ICS asset, establish a 30-day rolling baseline of command frequency and the distribution of numerical command parameters from Zeek dnp3.log/modbus.log. Calculate the 99th percentile for command frequency per 5-minute window and the 1st/99th percentiles for numerical parameters. Alert if the current command frequency exceeds its 99th percentile or if a command parameter falls outside its established percentile range, indicating a statistically anomalous command. 3. Machine Learning: Train a Long Short-Term Memory (LSTM) Autoencoder on 6 months of legitimate ICS command sequences (features: command type, numerical parameters, inter-command time delta) from Zeek logs for each wireless gateway. In real-time, feed 5-minute command sequences into the model and calculate the reconstruction error. Generate an alert if the reconstruction error exceeds a threshold derived from the 95th percentile of errors on a validation dataset, indicating a significant deviation from learned normal command behavior consistent with a replay attack."
          },
          {
            "description": "Detection of unauthorized wireless device identifiers (e.g., MAC addresses, WirelessHART Network IDs) actively transmitting on defined ICS operational frequencies (e.g., 900 MHz, 2.4 GHz) that are not registered in the ICS asset inventory. Additionally, an authorized ICS wireless device identifier is detected with physical layer characteristics (e.g., Received Signal Strength Indicator (RSSI), signal-to-noise ratio) that are statistically inconsistent with its known, fixed physical location, suggesting device impersonation or spoofing.",
            "data_sources": [
              "Zeek wifi.log",
              "Wireless IDS Logs",
              "Spectrum Analyzer Logs",
              "RF Sensor Logs",
              "ICS Asset Inventory Database",
              "Network Access Control (NAC) Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical airspace and critical infrastructure corridors surrounding ICS facilities, specifically near wireless field devices, sensors, actuators, and wireless access points/gateways.",
            "action": "1. Symbolic Logic: Continuously monitor Wireless IDS logs and Zeek wifi.log for all transmitting device identifiers (e.g., MAC addresses). Query the ICS Asset Inventory Database to create an allow-list of authorized identifiers. Generate a high-priority alert for any detected identifier that is not on the authorized list and is transmitting on an ICS-related frequency or SSID. 2. Statistical Method: For each authorized, static wireless device MAC address, establish a 14-day rolling baseline of its mean and standard deviation for RSSI from Zeek wifi.log or Wireless IDS logs. Calculate the Z-score for RSSI in 1-minute intervals. Generate an alert if the Z-score for an authorized device's RSSI exceeds 3.0 (or falls below -3.0) for three consecutive intervals, indicating its signal strength is significantly different from its normal baseline, suggesting it may be a spoofed device transmitting from a different location. 3. Machine Learning: Use a K-Means clustering model trained on 30 days of historical wireless log data. Use features like average RSSI, standard deviation of RSSI, primary operating channel, and average packet size per unique device identifier to establish clusters representing normal operational profiles for devices in specific physical zones. In real-time, alert if a newly observed device does not fall into any established authorized cluster or if an authorized device's current characteristics cause it to shift to a cluster associated with a different physical location."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.4",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to discover our wireless ICS protocols and frequencies? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Detection of unauthorized radio frequency (RF) signals within or adjacent to ICS operational bands (e.g., 900 MHz, 2.4 GHz, 700 MHz) exhibiting reconnaissance characteristics such as: rapid frequency hopping across multiple channels (>5 channel changes per minute), broad-spectrum sweeps (>100 MHz span within 5 seconds), signals with unusually high entropy, or sudden power level changes (>10 dBm) not attributable to known devices. The signal persists for more than 30 seconds and does not match the profile of any authorized device in the RF baseline.",
            "data_sources": [
              "Spectrum Analyzer Logs",
              "Wireless IDS Logs",
              "RF Sensor Grid Logs",
              "Drone Detection System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical perimeter, airspace, rooftops, and high-ground locations with line-of-sight to ICS facilities, focusing on control rooms, substations, remote terminal units (RTUs), and field device arrays.",
            "action": "1. Symbolic Logic: Maintain a baseline of legitimate RF emissions (frequency, power, modulation, device IDs) in ICS bands. Create a rule to query Spectrum Analyzer Logs for any signal in an ICS band that does not match the baseline and exhibits reconnaissance behavior (e.g., `(signal_in_ics_band AND signal_not_in_baseline AND (is_freq_hopping OR is_broad_sweep OR has_power_fluctuation))`). Alert if the signal persists for more than 30 seconds. 2. Statistical Method: Over rolling 1-minute windows, continuously calculate the Shannon entropy of observed frequencies and power levels from Spectrum Analyzer Logs within defined ICS bands. Establish a 30-day rolling baseline (e.g., 99th percentile) for these entropy values. Generate an alert if the current entropy value for either metric exceeds its baseline for two consecutive intervals, indicating a statistically significant increase in unpredictable RF activity consistent with scanning. 3. Machine Learning: Train a Random Forest classifier using 90 days of labeled historical Spectrum Analyzer data with features like frequency range, average power, bandwidth, modulation, and rate of frequency change. Use labels such as 'legitimate_ics', 'environmental_noise', and 'reconnaissance_scan'. In real-time, classify 5-second spectrum snapshots. Alert when the model classifies a snapshot as 'reconnaissance_scan' with >90% confidence within an ICS operational band."
          },
          {
            "description": "A statistically significant increase (e.g., >3 standard deviations above the 30-day baseline) in failed connection attempts (Zeek conn.log state S0/REJ), authentication failures (Windows Event ID 4625), or malformed/unsupported ICS protocol requests (Zeek dnp3.log or modbus.log notices) originating from a single, previously unseen source IP or wireless device ID. The activity targets ICS wireless gateways or associated authentication services and involves probing multiple ports or uncommon ICS function codes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Wireless Gateway Authentication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of ICS wireless gateways, associated authentication servers (RADIUS/TACACS+), and Domain Controllers handling ICS-related authentication.",
            "action": "1. Symbolic Logic: Create a rule that triggers if a single source IP not in the asset inventory generates more than 10 failed authentications (Windows Event ID 4625), 20 rejected connections (Zeek conn.log state REJ), or 5 unsupported function code errors (Zeek dnp3.log/modbus.log) to an ICS wireless gateway within a 5-minute window. Correlate with a successful login (Windows Event ID 4624) from the same source immediately after, which elevates the alert priority. 2. Statistical Method: For each source IP targeting ICS gateways, establish a 14-day rolling baseline for the rate of: (a) failed connections, (b) protocol violations, and (c) failed authentications. In 5-minute windows, calculate a composite Z-score based on the deviation of these three metrics from their baseline. Alert if the composite Z-score for any source IP exceeds 3.0 for two consecutive intervals, indicating a significant surge in probing activity. 3. Machine Learning: Train an Isolation Forest anomaly detection model using 30 days of benign traffic data from wireless network segments. Use features aggregated per source IP over 1-minute intervals, including: count of failed connections, count of unique destination ports, ratio of malformed-to-well-formed protocol packets, and entropy of requested ICS function codes. Alert if the anomaly score for any source IP exceeds the 99th percentile of historical scores, indicating a highly anomalous reconnaissance attempt."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]