[
  {
    "information_requirement": "Has an adversary leveraged Autorun functionality or virtual disk images to execute malicious code on an ICS system? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0895",
        "name": "Autorun Image",
        "evidence": [
          {
            "description": "A temporal correlation of less than 30 seconds between a removable media insertion event (e.g., USB drive) and a subsequent process creation event (Windows Event ID 4688 or Sysmon Event ID 1). The new process originates from a non-fixed drive path (e.g., E:\\, F:\\), its parent process is explorer.exe, cmd.exe, or svchost.exe, and the executable exhibits one or more of the following: its hash matches a known malicious IOC, it is not digitally signed, or its execution frequency on the host is below the 1st percentile over the last 30 days.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Windows System Log Event ID 12",
              "Windows System Log Event ID 1006",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical USB ports on Windows-based Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), data historians, and any servers within the Process Control Network (PCN) or ICS DMZ. Includes endpoints used for device programming or maintenance updates.",
            "action": "1. Symbolic Logic (Rule-based): Using a SIEM, create a rule that joins removable device insertion events (Windows System Log Event ID 12 or 1006) with process creation events (Windows Event ID 4688 or Sysmon Event ID 1) on the same hostname where the time difference is less than 30 seconds. Alert if the process path in the creation event corresponds to a non-fixed drive letter AND the executable's hash matches a threat intelligence feed OR the executable is unsigned. Additionally, monitor for the creation of 'autorun.inf' files (Sysmon Event ID 11) on these drives immediately preceding the process execution. 2. Statistical Method (Percentile/Entropy): For processes flagged by the symbolic logic, establish a 30-day baseline of executable name entropy on similar hosts (e.g., all HMIs). Calculate the Shannon entropy of the flagged executable's filename. Alert if the entropy score exceeds the 98th percentile of the baseline, indicating potential randomization. Concurrently, monitor the host's network traffic in Zeek conn.log for 5 minutes post-execution. Calculate the count of new, unique destination IP-port pairs. Alert if this count exceeds the 99th percentile of the host's typical hourly new connection rate. 3. Machine Learning (Classification): Train a binary classification model (e.g., Random Forest, XGBoost) on historical process creation events (Sysmon Event ID 1). Features should include: parent process name, is_unsigned (boolean), executable path entropy, execution frequency percentile, process command-line length, and a boolean feature 'is_from_removable_media_post_insertion'. Label known malicious Autorun events as '1' and benign activity as '0'. Deploy the model to score new process creations in real-time, alerting on scores above a 0.85 threshold, especially when 'is_from_removable_media_post_insertion' is true."
          },
          {
            "description": "A temporal correlation of less than 60 seconds between a virtual disk mount event (logged by the hypervisor or as a disk initialization event on the guest OS) and a subsequent rare or suspicious process creation (Windows Event ID 4688 or Sysmon Event ID 1) within the guest VM. The new process is followed by anomalous outbound network activity, such as connections to known malicious IPs, low-reputation domains, or a statistically significant increase in data egress volume.",
            "data_sources": [
              "Hypervisor API logs (e.g., vSphere, Hyper-V)",
              "Windows System Log Event ID 15",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 22",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Virtualization hosts (hypervisors) managing guest VMs in the ICS DMZ or Process Control Network. Specific targets include virtualized HMIs, EWS, data historians, and domain controllers. Also includes VM templates, golden images, and network egress points monitoring traffic from the virtualization cluster.",
            "action": "1. Symbolic Logic (Rule-based): Correlate hypervisor logs for 'virtual disk attach' events with guest OS disk initialization events (Windows System Log Event ID 15). Within 60 seconds, look for process creation events (Sysmon Event ID 1) where the executable path is on the new volume. Alert if the executable's hash is found in a threat intelligence feed OR if the process initiates an outbound network connection (Sysmon Event ID 3) to a destination IP on a blocklist within 5 minutes of execution. 2. Statistical Method (Similarity/Ratio): For any process launched from a newly mounted virtual disk, analyze its subsequent DNS queries (Sysmon Event ID 22 or Zeek dns.log). Calculate the Jaccard similarity score between the set of domains queried in the first 5 minutes and the set of all domains queried by that VM over the past 30 days. Alert if the similarity score is below 0.1. In parallel, analyze Zeek conn.log for the connection initiated by the process; calculate the ratio of 'orig_bytes' to 'resp_bytes'. Alert if this data exfiltration ratio exceeds the 95th percentile of all connections from that VM. 3. Machine Learning (Time-Series Anomaly Detection): Implement a multivariate time-series anomaly detection model (e.g., Isolation Forest) on telemetry from critical VMs. Aggregate data into 1-minute windows, with features including: count of process creations, count of network connections, total bytes sent, count of unique DNS queries, and a boolean flag for 'vdisk_mounted_in_window'. Train the model on at least 30 days of benign activity. Alert if a time window receives an anomaly score in the top 1%, particularly if the 'vdisk_mounted_in_window' flag is true."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "AI Assistant"
    ]
  }
]