[
  {
    "information_requirement": "Is an adversary using hardcoded credentials to move laterally between ICS assets?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "Observe a single user account, not identified as a service account or known automation process, successfully authenticating to more than 5 distinct ICS assets (e.g., HMIs, EWS, PLCs, Historians) via remote logon (Logon Type 3 or 10) within a 30-minute window, where the source IP address is not a recognized Engineering Workstation or Jump Host, and the activity deviates significantly from the account's historical access patterns.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA servers, PLCs, RTUs, Historian servers, and network segments connecting control devices within the OT network.",
            "action": "1. **Baseline & Categorize**: Establish a baseline of normal remote login activity (Windows Event ID 4624, Logon Type 3 or 10) for all user accounts across ICS assets. Categorize accounts as 'service/automation', 'engineer', 'operator', etc. Identify common source IPs (EWS, Jump Hosts) for remote access to ICS assets. 2. **Symbolic Logic (Whitelist/Blacklist)**: Filter successful remote logins from Windows Event ID 4624 where the 'Account Name' is NOT a known service account or authorized automation process. Cross-reference source IP with Zeek conn.log to confirm connection details. 3. **Statistical Method (Frequency Outlier)**: For each filtered account, within a rolling 30-minute window, count the number of distinct destination IP addresses accessed via remote login. Alert if this count exceeds 5 AND is above the 99th percentile of that account's historical 30-minute distinct destination count. 4. **Machine Learning (Behavioral Anomaly)**: Train a user behavior analytics (UBA) model on historical remote login data (Windows Event ID 4624 and Zeek conn.log, including source/destination IPs, protocols, and time of day). The model should identify logins that deviate significantly from the established normal patterns for a specific user, especially those involving new destination assets or unusual timing/frequency. Flag logins with an anomaly score exceeding a threshold (e.g., 0.8) for investigation."
          },
          {
            "description": "Observe a successful authentication event (remote logon, SSH, Telnet, or other network protocols) to any ICS asset where the 'Account Name' or 'username' field precisely matches an entry in a curated watchlist of known hardcoded vendor credentials for deployed ICS equipment, irrespective of source or destination.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic to/from critical controllers (PLCs, RTUs, IEDs), SCADA servers, Historian servers, Engineering Workstations, HMIs, and any network authentication servers within the OT network.",
            "action": "1. **Symbolic Logic (IOC Match)**: Curate and maintain an up-to-date watchlist of known hardcoded usernames and default passwords specific to the ICS equipment deployed in the environment. Configure SIEM rules to generate a high-priority alert for any successful logon event (Windows Event ID 4624, Logon Type 3 or 10) or successful authentication observed in Zeek logs (ssh.log, telnet.log, http.log for web panels, ftp.log) where the 'Account Name' or 'username' field *exactly* matches an entry in the hardcoded credential watchlist. 2. **Statistical Method (Frequency of Watchlist Hits)**: Track the frequency of successful authentications using watchlist-matched hardcoded credentials. If a specific hardcoded credential is used successfully more than 3 times within a 24-hour period, or if more than 5 distinct ICS assets are accessed using any watchlist-matched credential within 30 minutes, escalate the alert. 3. **Machine Learning (Behavioral Anomaly on Credential Usage)**: Develop a machine learning model (e.g., an unsupervised anomaly detection model like an Autoencoder) that learns normal credential usage patterns (e.g., common usernames, source/destination pairs, protocols, time of day). Flag successful logins that are highly anomalous in terms of credential usage, especially if the username is rare or previously unobserved for remote access to that asset type, and then cross-reference with the hardcoded credential watchlist for confirmation."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has an adversary established persistence using hardcoded credentials on an ICS device?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "Observe a non-service user account successfully authenticating remotely (Logon Type 3 or 10, or via SSH/Telnet) to a critical ICS asset (e.g., PLC, Historian, SCADA server) at regular, machine-like intervals (e.g., within a +/- 5-second deviation) over a period exceeding 24 hours, where the source IP address is not a known automation server or authorized management workstation.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical control system servers (e.g., Historians, SCADA servers), PLCs, RTUs, Engineering Workstations, and network gateways between IT and OT zones, and within the OT zone.",
            "action": "1. **Baseline & Whitelist**: Identify all legitimate automated processes and their associated service accounts, source IPs, destination assets, and expected login frequencies/intervals. Whitelist these as normal periodic activities. 2. **Statistical Method (Periodicity Detection)**: For all successful remote logins (Windows Event ID 4624, Zeek ssh.log, Zeek telnet.log) to critical ICS assets by non-whitelisted accounts, group by 'Account Name' and 'Destination IP'. Calculate the time difference between consecutive logins. If the standard deviation of these time differences for a sequence of 10 or more logins is less than 5 seconds, and the activity is not on the whitelist, generate a high-priority alert. 3. **Symbolic Logic (Source & Account Validation)**: For any periodic activity identified, cross-reference the source IP address from Zeek conn.log to ensure it is not an authorized management workstation or automation server. Also, confirm the 'Account Name' is not a known service account. If both checks fail, escalate. 4. **Machine Learning (Time Series Anomaly)**: Implement a time series anomaly detection algorithm (e.g., a Prophet model or a seasonal decomposition of time series (STL) approach) on the login patterns for each unique user-destination pair. Train the model to identify deviations from established periodic access or the sudden emergence of new, highly periodic access patterns for accounts not typically associated with automation. Flag patterns with high anomaly scores or unexpected periodicity."
          },
          {
            "description": "Observe a successful interactive login (e.g., SSH, Telnet, RDP, console access) to a field device (e.g., PLC, RTU, IED) that has not recorded any interactive sessions from any source within the last 90 days, or where the source IP address is not from an authorized Engineering Workstation or Jump Host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing PLCs, RTUs, Intelligent Electronic Devices (IEDs), other field controllers, and any associated management interfaces or local consoles within the deepest levels of the OT network.",
            "action": "1. **Baseline & Whitelist**: Create a comprehensive inventory of all field devices (PLCs, RTUs, IEDs) and their typical interactive access patterns. Establish a baseline of devices that *never* receive interactive logins, or receive them extremely rarely (e.g., less than once per quarter), and from which source IPs (e.g., specific EWS). 2. **Statistical Method (Frequency Deviation)**: Monitor Zeek logs (conn.log for RDP/VNC, ssh.log, telnet.log) and Windows Event ID 4624 (Logon Type 10) for successful interactive logins to field devices. For any device that has not recorded a successful interactive login in the past 90 days, or where the current activity count exceeds the 99.9th percentile of its historical interactive login frequency, generate an alert. 3. **Symbolic Logic (Source Validation)**: For any successful interactive login to a field device, cross-reference the source IP address with a whitelist of authorized Engineering Workstations or Jump Hosts. If the source IP is not whitelisted, regardless of historical frequency, generate a high-priority alert. 4. **Machine Learning (Contextual Anomaly Detection)**: Train an unsupervised anomaly detection model (e.g., One-Class SVM) on historical interactive login data for field devices, considering features such as destination device type, source IP, protocol, time of day, and user account. The model should learn the 'normal' context for interactive sessions to these devices. Flag any interactive session that falls outside of this learned normal context with a high anomaly score, indicating potential unauthorized persistence."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]