[
  {
    "information_requirement": "Is an adversary attempting to inhibit response functions by changing credentials on critical ICS devices? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0892",
        "name": "Change Credential",
        "evidence": [
          {
            "description": "Execution of ICS engineering software (e.g., Siemens TIA Portal.exe, Rockwell Studio5000.exe, Schneider Electric ControlBuilder.exe) on an Engineering Workstation (EWS) by an unauthorized user account (SubjectUserName in Windows Event ID 4688 not in an authorized whitelist), originating from an unusual source IP address (for remote access via Windows Event ID 4624), or occurring outside of established operational hours (CreationTime in Windows Event ID 4688), indicating an attempt to gain control over device configurations, potentially for credential modification.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and Human-Machine Interfaces (HMIs) within the Process Control Network (PCN) and DMZ.",
            "action": "1. Symbolic Logic: Maintain a whitelist of authorized user accounts (SubjectUserName) and specific ICS engineering software executables (NewProcessName, e.g., 'TIA Portal.exe', 'Studio5000.exe', 'ControlBuilder.exe') for each EWS. Generate an alert for Windows Event ID 4688 where a NewProcessName matching a whitelisted executable is launched by a SubjectUserName not present in the authorized list for that specific EWS. This can be achieved with a SIEM rule joining event 4688 with an internal whitelist lookup table. 2. Statistical Method: For each EWS and authorized user, establish a baseline of typical execution times of day (CreationTime from Windows Event ID 4688) and source IP addresses (Source Network Address from Windows Event ID 4624 for remote logons) for ICS engineering software over the last 90 days. Calculate the 95th percentile for these execution timestamps and baselines for source IP ranges. Alert when an execution occurs where the CreationTime falls outside of these 95th percentile bounds for that user and software, or when a remote logon originates from an IP outside the established baseline, particularly when combined with non-operational hours (e.g., between 10 PM and 6 AM local time). 3. Machine Learning/Time Series: For each EWS, collect Windows Event ID 4688 data for ICS engineering software executions, including SubjectUserName, NewProcessName, and CreationTime, over a 30-day period. Apply a time-series anomaly detection algorithm (e.g., an Isolation Forest model or an Exponentially Weighted Moving Average with a 3-sigma threshold on execution frequency and duration) to identify significant deviations in execution patterns (e.g., sudden spikes in frequency, executions by previously inactive users, or unusually long execution durations) from the established baseline, signaling unusual activity. This model should be re-trained weekly."
          },
          {
            "description": "Network communication from an Engineering Workstation (EWS) or other management host to a Programmable Logic Controller (PLC), Remote Terminal Unit (RTU), or Intelligent Electronic Device (IED) containing specific ICS protocol function codes or commands (e.g., S7COMM 'Setup Communication' block with specific parameters for password change, Modbus Function Code '0x10' Write Multiple Registers targeting documented password/key memory addresses, or EtherNet/IP 'Set Attribute Single' to security-related attributes like 'User Credentials' or 'Password') known to modify or set device credentials, observed outside of documented maintenance windows or from an unauthorized source IP.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments within the Process Control Network (PCN) where Engineering Workstations (EWS) communicate with Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), or Intelligent Electronic Devices (IEDs), including DMZs or firewalls separating these zones.",
            "action": "1. Symbolic Logic: Identify specific ICS protocol function codes or commands (e.g., S7COMM Function Code '0x00', Subfunction '0x04' for 'Setup Communication' with password parameters; Modbus Function Code '0x10' 'Write Multiple Registers' to known password/key registers 0x0001-0x0004; EtherNet/IP 'Set Attribute Single' to Class '0x01', Instance '0x01', Attribute '0x05' for User Credentials) associated with credential modification. Configure SIEM rules to alert when these specific commands, including their relevant parameters, are observed in Zeek s7comm.log, modbus.log, or enip.log originating from an EWS or unauthorized host destined for a critical controller's IP address and port, and are not correlated with a documented maintenance event. 2. Statistical Method: For each EWS-to-controller communication pair, establish a historical baseline of observed ICS protocol function codes and their frequencies (from Zeek s7comm.log, modbus.log, or enip.log) over the last 90 days. Calculate the relative frequency of each function code over a 24-hour rolling window. Alert when a function code known for credential modification, which has a historical frequency below the 1st percentile for that specific communication pair, is observed. Additionally, baseline the typical volume of data exchanged (bytes_orig, bytes_resp in Zeek conn.log) for these protocol sessions, and alert on significant deviations (e.g., 3 standard deviations above the mean) when a credential modification command is present. 3. Machine Learning/Entropy: For each EWS-to-controller communication pair, calculate the Shannon entropy of observed ICS protocol function codes within a 1-hour sliding window from Zeek s7comm.log, modbus.log, or enip.log. Establish a baseline range for entropy scores for each pair over a 30-day period. Alert on significant drops in entropy (e.g., below the 5th percentile of historical entropy values), which could indicate a highly repetitive and potentially malicious sequence of commands, such as repeatedly attempting to change a credential or a very specific, unusual sequence of commands that lacks the diversity of normal operational traffic. The model should also consider the sequence of commands as a feature."
          },
          {
            "description": "A correlated sequence of events indicating suspicious activity on an Engineering Workstation (EWS), including an anomalous user logon (e.g., Windows Event ID 4624 from an unusual source IP or at an atypical time) immediately followed by the execution of ICS engineering software (Windows Event ID 4688) by that user, which then correlates with network communication from that EWS to a critical ICS controller (PLC/RTU/IED) exhibiting ICS protocol commands (e.g., S7COMM, Modbus, EtherNet/IP via Zeek logs) indicative of device credential modification, all occurring outside of scheduled and authorized maintenance periods.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) within the Process Control Network (PCN), Active Directory/Authentication Servers, and network perimeter devices between the IT and OT networks.",
            "action": "1. Symbolic Logic (Rule-based correlation): Create a correlation rule in the SIEM that triggers when: (a) Windows Event ID 4624 (successful logon) on an EWS where the Source Network Address is not on an approved list for that user/EWS, OR the LogonType is '10 - RemoteInteractive' from an unusual source, OR the logon occurs outside of typical work hours for that user. (b) Followed within 5 minutes by Windows Event ID 4688 (process creation) on the same EWS, where NewProcessName matches a known ICS engineering software executable and the SubjectUserName matches the logon. (c) Followed within 10 minutes by Zeek conn.log entries from the EWS's IP to a critical controller's IP on a known ICS protocol port (e.g., 102/tcp, 502/tcp, 44818/tcp), AND Zeek s7comm.log, modbus.log, or enip.log entries showing specific credential modification commands. This chain of events should generate a high-priority alert with supporting evidence. 2. Statistical Method: Establish a multi-dimensional baseline for each user on each EWS, capturing: (i) typical login times, LogonType distributions, and source IP ranges (Windows Event ID 4624); (ii) typical ICS software execution times and durations (Windows Event ID 4688); and (iii) typical frequency and types of ICS protocol commands to controllers (Zeek logs). Calculate a combined deviation score (e.g., Mahalanobis distance or a weighted sum of Z-scores) for each sequence of logon, process execution, and network communication events. Alert when a sequence of events yields a combined deviation score exceeding the 99th percentile, particularly when a credential modification command is present in the network communication, signaling highly anomalous combined activity. 3. Machine Learning/Behavioral Anomaly Detection: Implement a multi-modal behavioral anomaly detection model (e.g., using a sequence model like a Hidden Markov Model or a deep learning autoencoder) that profiles normal user behavior on EWS hosts. Features should include: login patterns (Windows Event ID 4624 fields like LogonType, Source Network Address, TimeCreated), process execution (Windows Event ID 4688 fields like NewProcessName, SubjectUserName, CreationTime), and network communication to controllers (Zeek logs fields like id.orig_h, id.resp_h, proto, service, function codes, specific parameters). Train the model on these multi-dimensional, time-series features over a 60-day period. Flag and alert on any new activity sequence that deviates significantly from established clusters of normal behavior, providing an anomaly score and identifying the contributing features for investigation, indicating a potential compromise and credential modification attempt."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]