[
  {
    "information_requirement": "Is an adversary using hardcoded credentials to move laterally between ICS assets?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "A single non-service account performs successful remote logins (e.g., RDP, SSH, Telnet) from an unapproved source IP to more than 5 distinct ICS assets within a 30-minute window, where the access count also exceeds the account's 99th percentile historical baseline for a 30-minute window.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication and network traffic logs from the Supervisory Control network (Purdue Model Level 3) and Process Control Network (Purdue Model Level 2), including from Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA servers, Historian servers, and network gateways between OT segments.",
            "action": [
              "Correlate successful remote authentications (Windows Event ID 4624 Logon Type 3 or 10; successful Zeek ssh.log/telnet.log events) with network connection logs (Zeek conn.log) on timestamp and IP addresses. Generate an event for any successful login where the 'TargetUserName' is not on the service account watchlist AND the 'IpAddress' (source) is not on the approved remote access IP whitelist.",
              "For each account, ingest successful remote login events and calculate a 30-minute rolling count of distinct destination IPs. Compare this count to a 90-day historical baseline for the account. Generate an alert if the current 30-minute count is greater than 5 AND exceeds the 99th percentile of the account's historical baseline, indicating anomalous fan-out activity.",
              "Apply a pre-trained unsupervised anomaly detection model (e.g., Isolation Forest or Autoencoder) to new login events. The model should be trained on features including source IP, destination IP, protocol, user account, destination asset criticality, and time-of-day. Flag any login with an anomaly score in the top 1% for investigation, prioritizing those where the model identifies simultaneous deviations across multiple features (e.g., rare source IP, unusual time, new destination asset for that user)."
            ]
          },
          {
            "description": "A successful authentication is observed on an ICS asset (e.g., PLC, HMI, SCADA Server) where the username is present on a pre-defined watchlist of known hardcoded or default vendor credentials.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek http.log",
              "Zeek ftp.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication and application layer traffic logs from all OT network segments, with a focus on management interfaces for PLCs, RTUs, and IEDs (Purdue Model Level 1/2), as well as SCADA servers, Historian servers, and Engineering Workstations (Purdue Model Level 2/3).",
            "action": [
              "Execute a continuous query across all specified authentication logs (e.g., Windows Event ID 4624, Zeek ssh.log, telnet.log, http.log) to match the username field against a maintained watchlist of known hardcoded/default ICS credentials. Generate a high-priority alert for any successful authentication event that produces a match.",
              "For each credential on the watchlist that successfully authenticates, track the set of unique destination assets accessed within a 24-hour window. Calculate the Shannon entropy of this set of destination assets. Compare the entropy score to a 30-day historical baseline for that specific credential. Alert if the current entropy score deviates by more than two standard deviations from the baseline, indicating the credential is being used against an unusually diverse set of targets.",
              "Apply a pre-trained classification model (e.g., Random Forest) to all authentication events. The model's features should include username, source/destination IP, protocol, time of day, asset type, and a binary feature 'is_on_watchlist'. Flag any authentication classified as 'suspicious' with high confidence, especially when the 'is_on_watchlist' feature is true and the source IP is not a whitelisted management station."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has an adversary established persistence using hardcoded credentials on an ICS device?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "A series of 10 or more successful remote authentications to a critical ICS asset from a non-whitelisted source/account over a 24-hour period exhibits a time interval standard deviation (jitter) of less than 5 seconds between each login, indicating automated, machine-like timing.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication and network traffic logs from critical ICS assets defined in an asset inventory (e.g., Historians, SCADA servers, Domain Controllers in OT) and network security monitoring points at boundaries between the Enterprise (IT) and OT networks (Purdue Model Level 3.5).",
            "action": [
              "Filter for successful remote logins (Windows Event ID 4624; Zeek ssh.log, telnet.log) to assets tagged as 'critical'. From this subset, generate an event for any login where the source IP is not on the source IP whitelist for that asset OR the user account is not on the authorized account whitelist for that asset.",
              "For logins matching the symbolic logic, group events by source IP, destination IP, and user account. For each group with 10 or more logins in a 24-hour period, calculate the time deltas between consecutive logins. Generate a high-priority alert if the standard deviation of these time deltas is less than 5 seconds, indicating low-jitter, automated access consistent with a C2 beacon.",
              "For each unique user-destination pair, apply a pre-trained time-series anomaly detection model (e.g., STL or Prophet) to the hourly login frequency. The model should be trained on at least 90 days of data to learn normal operational periodicities. Flag as anomalous any time window where the model detects a new, high-frequency periodicity not present in the historical baseline, or where the residual (unexplained) activity is statistically significant."
            ]
          },
          {
            "description": "A successful interactive login (e.g., RDP, VNC, SSH, Telnet) is observed on a field device (e.g., PLC, RTU, IED) that has not had an interactive login for over 90 days, or the login originates from a source IP not on the explicit whitelist for that specific device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek rdp.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic and access logs from the Process Control Network (Purdue Model Level 2) and Basic Control Network (Purdue Model Level 1), specifically from network TAPs or switch SPAN ports monitoring management traffic to PLCs, RTUs, IEDs, and other field controllers.",
            "action": [
              "For any successful interactive login detected (e.g., Zeek rdp.log, ssh.log, telnet.log, Windows Event ID 4624 Logon Type 10) to a device tagged as a 'field device', compare the source IP against a device-specific whitelist of authorized Engineering Workstations. Generate a high-priority alert if the source IP is not on the whitelist.",
              "For each field device, maintain a 90-day rolling count of successful interactive logins. On any new successful login, check the historical count. If the count was zero for the preceding 90 days, generate a high-priority alert for 'First Interactive Login in 90 Days'. This identifies access to dormant or rarely-accessed devices.",
              "Apply a pre-trained unsupervised anomaly detection model (e.g., One-Class SVM) to features from successful interactive logins to field devices: source IP geolocation/ASN, destination device type/model, protocol, and time of day/day of week. The model defines the 'normal context' of legitimate engineering access. Flag any login session that the model scores as a high-confidence anomaly, indicating it falls outside this learned normal behavior (e.g., access from a new country, at 3 AM on a holiday)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]