[
  {
    "information_requirement": "Is an adversary attempting to inhibit response functions by changing credentials on critical ICS devices? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0892",
        "name": "Change Credential",
        "evidence": [
          {
            "description": "Unauthorized or anomalous use of ICS engineering software on an Engineering Workstation (EWS), indicated by a combination of the executing user account, time of day, and source network location for remote sessions. This represents a high-risk precursor to unauthorized configuration changes, including credential modification.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Active Directory Servers, and network gateways within the Process Control Network (PCN) and DMZ.",
            "action": [
              "Implement a SIEM detection rule that triggers an alert when a Windows Event ID 4688 is generated on a designated EWS host, where the 'NewProcessName' (e.g., 'TIA Portal.exe', 'Studio5000.exe') is on a monitored ICS software list and the 'SubjectUserName' is not present in the pre-defined list of authorized users for that specific EWS.",
              "For each authorized user account on an EWS, establish a baseline profile from Windows Event ID 4688 and 4624 logs over a 90-day period. The profile must include: 1) Typical hours of process execution for ICS software. 2) Normal source IP subnets for remote logons (Logon Type 10). Alert when a new event's hour falls more than two standard deviations from the user's mean execution hour, or a remote logon originates from an IP address not within the established subnet profile.",
              "Develop and deploy an Isolation Forest model trained on historical EWS activity logs (Windows Event IDs 4688, 4624). The feature vector for each event should include: User ID (categorical), Process Name (categorical), Day of Week (numerical), Hour of Day (numerical), and for remote logons, Source IP ASN and Country (categorical, enriched from Zeek conn.log). Classify new events in near real-time; events flagged as anomalies by the model indicate a significant deviation from learned normal behavior and should generate an alert for investigation."
            ]
          },
          {
            "description": "Direct observation in network traffic of specific ICS protocol commands known to write or modify device credentials, such as an S7COMM 'Setup Communication' function with password parameters, a Modbus 'Write Multiple Registers' (Function Code 16) command targeting vendor-documented credential addresses, or an EtherNet/IP 'Set Attribute Single' command on a security-related object.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments within the Process Control Network (PCN) where Engineering Workstations (EWS) communicate with Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), or Intelligent Electronic Devices (IEDs), including network taps at aggregation switches and firewalls separating these zones.",
            "action": [
              "Create a SIEM rule that generates a high-priority alert upon detecting specific function codes in Zeek protocol logs (s7comm.log, modbus.log, enip.log) that correspond to credential modification. The rule must check for S7COMM function 0xf0 ('Setup Communication') with password setup parameters, Modbus function 16 targeting known credential registers, or EtherNet/IP 'Set_Attribute_Single' on security class IDs. Integrate with a change management database to suppress alerts originating from authorized IP addresses during scheduled maintenance windows.",
              "For each unique source EWS and destination controller pair, profile the distribution of all ICS function codes observed in Zeek logs over a 30-day baseline period. Calculate the relative frequency of each code. In a 1-hour sliding window, generate an alert if a credential-modifying function code (which is normally in the bottom 1st percentile of frequency) is observed, as this indicates a statistically rare and suspicious command.",
              "Model the sequence of ICS protocol function codes between EWS-controller pairs as a time series. Calculate the Shannon entropy of the function code distribution within a 5-minute non-overlapping window. Train a Long Short-Term Memory (LSTM) autoencoder on the resulting time series of entropy values to learn the normal 'rhythm' of communication. A high reconstruction error (e.g., above the 98th percentile) on a new window's entropy value signals a significant change in command complexity, potentially indicating a simplistic, repetitive, and malicious command sequence, which should trigger an alert."
            ]
          },
          {
            "description": "A correlated sequence of events observed within a 15-minute window: 1) A remote logon (Windows Event ID 4624, Logon Type 10) to an EWS from an anomalous IP address. 2) Subsequent execution of ICS engineering software (Windows Event ID 4688) by the same user. 3) Followed by network traffic from the EWS to a controller containing a credential modification command (observed in Zeek logs).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Active Directory/Authentication Servers, VPN concentrators, and network perimeter devices between the IT and OT networks.",
            "action": [
              "Construct a stateful, multi-stage correlation rule in the SIEM. Stage 1: Trigger on a successful Windows Event ID 4624 (LogonType 10) to an EWS from a source IP not on a predefined allowlist of remote access IPs. Stage 2: If Stage 1 is met, correlate with a Windows Event ID 4688 on the same host by the same 'SubjectUserName' for a monitored engineering process within the next 5 minutes. Stage 3: If Stage 2 is met, correlate with Zeek logs (s7comm, modbus, enip) showing a credential-change command from the EWS's IP to a controller IP within the next 10 minutes. A high-priority alert is generated only when the full sequence is completed.",
              "For each EWS user, develop a composite risk score for any activity sequence (logon -> process -> command). Calculate the score by summing weighted risk factors: 1) Rarity of the source IP's ASN (from Zeek conn.log). 2) Z-score of the login time-of-day compared to the user's baseline. 3) Rarity of the process execution by that user. 4) Rarity score of the observed ICS command. Alert when the total composite score for a sequence exceeds the 99th percentile of all scores calculated over the past 30 days.",
              "Construct and maintain a dynamic interaction graph where nodes are Users, Hosts (EWS), and Controllers. Create directed edges for interactions: 'logs_into' (User -> Host), 'executes' (User -> Host), 'sends_command_to' (Host -> Controller). Enrich edges with attributes like timestamp, source IP geolocation (from Zeek conn.log), process name (from Windows Event ID 4688), and ICS function code (from Zeek protocol logs). Use a graph neural network (GNN) to learn patterns of normal subgraphs and alert on the detection of anomalous edges or subgraphs that deviate from these learned patterns."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]