[
  {
    "information_requirement": "Is an adversary using hardcoded credentials to move laterally between ICS assets?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "A successful remote login (Windows Event ID 4624, Logon Type 3 or 10; or Zeek conn.log for RDP/SMB) from a non-whitelisted source IP (not a known Engineering Workstation or Jump Host) by a non-service account, where the account accesses more than 5 distinct ICS assets within a 30-minute rolling window, and this distinct asset count exceeds the 99th percentile of that account's historical 30-minute distinct asset access count.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA servers, PLCs, RTUs, Historian servers, and network segments connecting control devices within the OT network.",
            "action": "1. Symbolic Logic: Baseline and categorize all user accounts as 'service/automation', 'engineer', 'operator'. Baseline and whitelist authorized source IPs for remote access to ICS assets (EWS, Jump Hosts). Filter successful remote logins from Windows Event ID 4624 (Logon Type 3 or 10) or Zeek conn.log (for RDP/SMB) where the 'Account Name' is not a whitelisted service account AND the 'Source IP' is not a whitelisted authorized EWS/Jump Host. 2. Statistical Method: For each filtered account, within a rolling 30-minute window, count the number of distinct destination IP addresses (ICS assets) accessed via remote login. Alert if this count exceeds 5 AND is above the 99th percentile of that account's historical 30-minute distinct destination count, calculated over the last 90 days. 3. Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest or Autoencoder) on historical remote login data (Windows Event ID 4624 and Zeek conn.log), including features like source/destination IPs, protocols, time of day, and destination asset types. The model should learn normal user-asset access patterns. Flag logins with an anomaly score exceeding a dynamic threshold (e.g., 95th percentile of anomaly scores) for investigation, especially those involving new destination assets or unusual timing/frequency."
          },
          {
            "description": "A successful authentication event (Windows Event ID 4624, Logon Type 3 or 10; Zeek ssh.log, telnet.log, or http.log for web panels) to any ICS asset where the 'Account Name' or 'username' exactly matches an entry in a curated watchlist of known hardcoded vendor credentials specific to the deployed ICS equipment.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic to/from critical controllers (PLCs, RTUs, IEDs), SCADA servers, Historian servers, Engineering Workstations, HMIs, and any network authentication servers within the OT network.",
            "action": "1. Symbolic Logic: Curate and maintain an up-to-date watchlist of known hardcoded usernames and default passwords specific to the ICS equipment deployed in the environment. Configure SIEM rules to generate a high-priority alert for any successful logon event (Windows Event ID 4624, Logon Type 3 or 10) or successful authentication observed in Zeek logs (ssh.log, telnet.log, http.log for web panels, ftp.log) where the 'Account Name' or 'username' field exactly matches an entry in the hardcoded credential watchlist. 2. Statistical Method: Track the frequency of successful authentications using watchlist-matched hardcoded credentials. Alert if a specific hardcoded credential is used successfully more than 3 times within a 24-hour period, or if more than 5 distinct ICS assets are accessed using any watchlist-matched credential within 30 minutes, identifying a high-frequency outlier. 3. Machine Learning: Develop a classification model (e.g., Random Forest or SVM) trained on historical authentication data. Features include username, source/destination IP, protocol, time of day, and asset type. The model should classify authentication attempts as 'normal' or 'suspicious'. Add a feature indicating if the username is on the hardcoded credential watchlist. Flag attempts classified as 'suspicious' with high confidence, particularly if the watchlist feature is positive."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has an adversary established persistence using hardcoded credentials on an ICS device?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "A successful remote authentication (Windows Event ID 4624, Logon Type 3 or 10; Zeek ssh.log, telnet.log) by a non-whitelisted user account (not a known service account) from a non-whitelisted source IP (not a known automation server or authorized management workstation) to a critical ICS asset. This activity must exhibit a consistent login interval with a standard deviation of less than 5 seconds over a period of at least 24 hours, observed for 10 or more consecutive logins.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical control system servers (e.g., Historians, SCADA servers), PLCs, RTUs, Engineering Workstations, and network gateways between IT and OT zones, and within the OT zone.",
            "action": "1. Symbolic Logic: Identify and whitelist all legitimate automated processes and their associated service accounts, source IPs, destination assets, and expected login frequencies/intervals. Filter all successful remote logins (Windows Event ID 4624, Zeek ssh.log, Zeek telnet.log) to critical ICS assets by non-whitelisted accounts or from non-whitelisted source IPs. 2. Statistical Method: For all filtered logins, group by 'Account Name' and 'Destination IP'. Calculate the time difference between consecutive logins. If the standard deviation of these time differences for a sequence of 10 or more logins is less than 5 seconds, and the activity spans more than 24 hours, generate a high-priority alert, identifying highly periodic access. 3. Machine Learning: Implement a time series anomaly detection model (e.g., ARIMA or Prophet) on login patterns for each unique user-destination pair, specifically looking for new or altered periodic access. Train the model on historical data to learn normal periodic behaviors. Flag user-destination pairs where the model detects a new, strong periodicity or a significant deviation from an existing one, especially if the periodicity aligns with machine-like intervals."
          },
          {
            "description": "A successful interactive login (Zeek conn.log for RDP/VNC, Zeek ssh.log, Zeek telnet.log; or Windows Event ID 4624 Logon Type 10 for RDP) to a field device (e.g., PLC, RTU, IED) where either: 1) the device has had zero recorded interactive logins in the preceding 90 days, or 2) the source IP address of the login is not on a whitelist of authorized Engineering Workstations or Jump Hosts for that specific device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing PLCs, RTUs, Intelligent Electronic Devices (IEDs), other field controllers, and any associated management interfaces or local consoles within the deepest levels of the OT network.",
            "action": "1. Symbolic Logic: Create a comprehensive inventory of all field devices (PLCs, RTUs, IEDs) and a whitelist of authorized Engineering Workstations or Jump Hosts for interactive access to each device. Alert on any successful interactive login (Zeek conn.log for RDP/VNC, Zeek ssh.log, telnet.log; Windows Event ID 4624 Logon Type 10) to a field device if the source IP is not on the whitelist for that specific device. 2. Statistical Method: For each field device, track the number of interactive logins over the last 90 days. If a device has a count of zero interactive logins in the preceding 90 days and then records a successful interactive login, generate a high-priority alert, identifying a rare access event. 3. Machine Learning: Train an unsupervised anomaly detection model (e.g., One-Class SVM or Isolation Forest) on historical interactive login data for field devices. Features should include source IP, destination device, protocol, time of day, and user account. The model learns the 'normal' context for interactive sessions to these devices. Flag any interactive session that falls outside of this learned normal context with a high anomaly score (e.g., top 1% anomaly score), indicating potential unauthorized persistence, especially if it's the first interactive login to a device in a long period."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]