[
  {
    "information_requirement": "Is the adversary moving laterally through cloud virtual machines via direct connections?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.008",
        "name": "Direct Cloud VM Connections",
        "evidence": [
          {
            "description": "A network connection from a cloud VM to an external IP address or domain present on a threat intelligence feed of known C2 servers, occurring within 30 minutes of a direct interactive login event.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Provider Management Plane Logs, Cloud VM instances, Virtual Network (VPC/VNet) Flow Logs, Egress Network Gateways",
            "action": [
              "Correlate direct cloud VM connection events (e.g., AWS SSM 'StartSession', Azure Serial Console access) with subsequent outbound network flows (Zeek conn.log) from the target VM. Join the destination IP and FQDN against a threat intelligence feed of known C2 indicators. Alert on any match.",
              "For each VM, profile the historical entropy of destination ports for outbound connections over a 30-day baseline. After a direct interactive login, calculate the entropy of new destination ports within a 1-hour window. Alert if the entropy score deviates by more than 3 standard deviations from the established baseline.",
              "Train a time-series forecasting model (e.g., ARIMA) on the volume of outbound data (e.g., 'orig_bytes' in Zeek conn.log) for each VM. Following a direct interactive login, predict the expected data volume. Alert if the actual observed volume exceeds the predicted confidence interval."
            ]
          },
          {
            "description": "A process creation event on a cloud VM where the process name or command-line arguments match a known signature for a post-exploitation tool or script, occurring within 60 minutes after a direct interactive login.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "AWS CloudTrail",
              "Azure Activity Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud VM instances, Cloud Provider Management Plane Logs, Endpoint Detection and Response (EDR) platform logs",
            "action": [
              "Following a direct cloud VM connection event, monitor process creation events (Windows Event ID 4688). Apply a list of regular expressions to the 'CommandLine' field to detect known hacking tools (e.g., 'mimikatz.exe', 'procdump.exe'), suspicious script execution (e.g., 'powershell.exe -enc'), or discovery commands (e.g., 'nltest', 'net group \"Domain Admins\"'). Alert on any match.",
              "For each VM, establish a baseline of common process command-line argument patterns. Calculate the Jaccard similarity score between the set of arguments for a new process and the historical set of arguments for that same process name. Alert on processes with an unusually low similarity score (e.g., less than 0.2), indicating novel or obfuscated usage.",
              "Use a pre-trained classification model to score the maliciousness of each command line executed after a direct VM connection. The model should be trained on features like command length, character distribution (entropy), presence of special characters, and keyword frequency. Alert on any command line classified as malicious with a confidence score greater than 0.9."
            ]
          },
          {
            "description": "A successful interactive login (Logon Type 2 or 10) to a cloud VM from a source IP address geolocated to a country not seen for that user in the last 90 days, or the use of a local account on a server where only domain accounts are expected.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud VM instances, Cloud Provider Management Plane Logs, Identity and Access Management (IAM) Logs, Authentication Servers",
            "action": [
              "Create a rule that alerts on any successful interactive logon (Windows Event ID 4624, Logon Type 2 or 10) to a production cloud VM where the 'AccountName' is not a member of a predefined list of authorized domain administrator accounts and is not a local account.",
              "For each user, maintain a baseline of typical login attributes (source country, ISP, time of day, day of week). For each new login, calculate a risk score by summing weights for each attribute that deviates from the user's historical norm (e.g., +3 for new country, +1 for unusual hour). Alert if the total risk score exceeds the 98th percentile of all historical scores for that user.",
              "Use a clustering algorithm (e.g., DBSCAN) on historical login data, using features like source IP, user, VM, and time. Treat new logins that do not fall into any existing cluster as outliers (noise). Investigate all outlier logins, as they represent activity that does not conform to any established pattern of behavior."
            ]
          },
          {
            "description": "A greater than 1000% increase in outbound data volume from a cloud VM in the hour following a direct interactive login compared to the hourly average for that VM over the past 30 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 4624",
              "AWS CloudTrail",
              "Azure Activity Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Virtual Network (VPC/VNet) Flow Logs, Egress Network Gateways, Cloud VM instances, DNS resolvers",
            "action": [
              "After a direct interactive login, monitor DNS queries (Zeek dns.log) from the VM. Alert if a query is made for a domain with a known dynamic DNS (DDNS) provider (e.g., '.ddns.net', '.no-ip.com') and the domain is not on an allow-list.",
              "For each VM, calculate the 99th percentile of hourly outbound data transfer ('orig_bytes' in Zeek conn.log) over a 30-day baseline. After a direct interactive login, monitor the hourly outbound volume and alert if it exceeds this established percentile threshold.",
              "Implement a time-series anomaly detection model on key network metrics (e.g., bytes out, connection count, unique destination IPs per hour). Following a direct interactive login, feed the live metrics into the model. Alert on any data point flagged as an anomaly by the model."
            ]
          },
          {
            "description": "A sequence of events on a single cloud VM within a 60-minute window: 1) A direct interactive login, 2) Execution of at least two distinct discovery commands (e.g., 'whoami', 'ipconfig', 'net user'), and 3) An outbound connection attempt to another internal network segment on an administrative port (e.g., RDP/3389, SSH/22, WinRM/5985).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "AWS CloudTrail",
              "Azure Activity Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud VM instances, Cloud Provider Management Plane Logs, Internal Network Segments, Domain Controllers",
            "action": [
              "Define a correlation rule that triggers when, within 30 minutes on the same host: Event A (direct cloud login like 'StartSession') is followed by Event B (process execution of 'whoami.exe', 'net.exe', or 'ipconfig.exe' via Event ID 4688), which is then followed by Event C (outbound network connection to an internal IP on port 3389 or 22 via Zeek conn.log). Alert on a completed sequence.",
              "Calculate the frequency of 'discovery' command sequences (e.g., 'whoami' -> 'net user' -> 'ipconfig') per user session. Alert on user sessions where the frequency of these sequences is in the top 5th percentile, indicating an unusual amount of reconnaissance activity compared to normal administrative behavior.",
              "Model user sessions as a graph of actions (logon, process execution, network connection). Use a graph-based anomaly detection algorithm to identify sessions with unusual structures or sequences of nodes (actions) that deviate from typical administrative session graphs. A session graph showing a login followed by rapid, broad discovery and then multiple failed connection attempts would be flagged as anomalous."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]