[
  {
    "information_requirement": "Is the adversary moving laterally through the network using remote services?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful remote service connection (e.g., RDP, SSH, WinRM) originates from an internal IP address currently on a watchlist of compromised or suspicious hosts.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Servers (e.g., database, application servers), Endpoint Subnets, Network Security Monitoring Sensors",
            "action": [
              "Create and maintain a watchlist of internal IP addresses/hostnames associated with confirmed incidents or high-fidelity alerts. Join this watchlist against the source IP of successful remote interactive logins (Windows Event ID 4624 with Logon Type 10) or remote service network connections (Zeek conn.log with id.resp_p in {3389, 22, 5985, 5986}). Generate a critical alert for any match.",
              "For each host on the watchlist, calculate the baseline rate of remote service connections it initiates per hour. Monitor for statistically significant deviations from this baseline (e.g., a spike exceeding 3 standard deviations above the mean), which could indicate automated lateral movement from the compromised host.",
              "Train a supervised classification model (e.g., Random Forest) using features from hosts that have historically been sources of lateral movement, such as process execution history, network connection patterns, and user account activity. Use the model to score new remote connection events from watchlist hosts, flagging those classified as high-risk."
            ]
          },
          {
            "description": "A process creation event matching known lateral movement tools or suspicious command-line patterns occurs on a destination host within a short time window following a successful remote service login.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations",
            "action": [
              "Correlate a successful remote login (Windows Event ID 4624, Logon Type 3 or 10) with subsequent process creation events (Windows Event ID 4688) on the same host within a 5-minute window. Apply a list of regular expressions to the ProcessName and CommandLine fields to detect known tools (psexec.exe, wmic.exe) and suspicious patterns (powershell -enc, net use \\\\* /user:*). Alert on any match.",
              "For each command line observed after a remote login, calculate the Shannon entropy of the command string. Establish a baseline for typical administrative commands and flag commands with unusually high entropy, as this often indicates obfuscation, encoding, or randomization used by malicious scripts.",
              "Develop a time-series anomaly detection model (e.g., LSTM) on the frequency and type of processes created after remote logins for specific user roles or host groups. A sudden deviation in the sequence or frequency of post-login processes (e.g., cmd.exe followed by whoami.exe and net.exe where this is not normal) would be flagged as an anomaly."
            ]
          },
          {
            "description": "A successful remote service connection is observed between a source-destination pair of hosts, or by a user to a destination host, that has not been seen before or is statistically rare.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Internal Network Segments, Authentication Logs from Domain Controllers, VPN Concentrator Logs",
            "action": [
              "Maintain allow-lists of approved administrative access paths (e.g., user 'db_admin' can RDP to 'db_server_01'). Alert on any successful remote login (Windows Event ID 4624, Logon Type 10) that does not match an entry in the pre-defined allow-list.",
              "Build a graph of normal remote access, where nodes are users and hosts, and edges represent successful logins. Calculate the frequency of each edge over a 30-day baseline period. Assign a rarity score to each new login based on its historical frequency. Flag logins that exceed a percentile threshold for rarity (e.g., top 1%), indicating a first-time or highly unusual access pattern.",
              "Use an unsupervised learning algorithm like DBSCAN to cluster users based on their remote access behavior (e.g., hosts accessed, time of day, session duration). A login event that is classified as noise by the model indicates a significant behavioral deviation and potential account compromise or misuse for lateral movement."
            ]
          },
          {
            "description": "An intermediate host, acting as a pivot, receives a single inbound remote connection and subsequently initiates numerous outbound remote connections to unique internal destinations within a constrained timeframe.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Network Segments (East-West traffic), Network Flow Logs, Endpoint Detection and Response (EDR) agent logs",
            "action": [
              "For any host that is the destination of a remote login (Windows Event ID 4624 Type 10 or Zeek conn.log), trigger a rule that monitors its outbound connections for the next 60 minutes. If this host initiates more than a fixed number (e.g., >5) of new remote service connections (RDP, SSH, WinRM) to unique internal IPs, generate an alert for potential lateral movement fan-out.",
              "For each host, establish a baseline distribution of the number of unique outbound remote service destinations it connects to in a 60-minute window. Monitor for events where the count of unique destinations exceeds a high percentile of this baseline (e.g., the 99th percentile), indicating an abnormal burst of lateral connections.",
              "Apply a time-series forecasting model (e.g., ARIMA) to the count of outbound lateral connections per host. When the observed count significantly exceeds the model's prediction interval for a given time window, flag it as anomalous 'fan-out' behavior, potentially driven by an automated script."
            ]
          },
          {
            "description": "Network traffic is detected between internal hosts using either uncommon remote service ports (e.g., 5985, 5986, 3283, 5900) not part of an established baseline, or common remote service protocols on non-standard ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring Sensors, Core Switches, Datacenter Firewalls",
            "action": [
              "Create a list of standard remote service ports ({22, 3389}) and organization-approved non-standard ports. Monitor all internal network traffic (Zeek conn.log) for connections on remote service ports that are not on the approved list (e.g., WinRM ports 5985/5986 if not used by administration). Additionally, use Zeek protocol analyzers (rdp.log, ssh.log) to identify RDP or SSH traffic occurring on any port not on the allow-list. Alert on any match.",
              "Calculate the frequency of all (destination_port, protocol) tuples for internal-to-internal traffic over a 30-day baseline. Identify tuples that fall below a low frequency threshold (e.g., seen less than 5 times), representing rare or first-seen services. Investigate these rare connections, especially if they are associated with remote administration protocols.",
              "Train an autoencoder on feature vectors representing normal network connections (e.g., src_ip_subnet, dst_ip_subnet, dst_port, protocol, duration, orig_bytes). Use the model to calculate a reconstruction error for each new connection. Connections with a high reconstruction error are anomalous and may represent protocol tunneling or the use of non-standard ports for lateral movement."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]