[
  {
    "information_requirement": "Has the adversary collected data from network shared drives? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1039",
        "name": "Data from Network Shared Drive",
        "evidence": [
          {
            "description": "A process execution event where the process hash or name matches a known indicator of compromise (IOC) associated with data collection tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, Domain Controllers",
            "action": [
              "Symbolic: Maintain and query against a watchlist of known malicious file hashes and process names associated with data collection tools (e.g., secretsdump.py, ncp.exe). Generate an alert upon a match in process creation logs (Windows Event ID 4688, Sysmon Event ID 1).",
              "Statistical: For processes matching a broad rule (e.g., python.exe running with network-related arguments), calculate the rarity of the command line arguments or parent process. A process with a command line in the lowest 1st percentile of historical occurrences for that user or host, which also accesses network shares (Windows Event ID 5145), should be flagged for review.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on labeled process creation events. Features should include process name, parent process, command-line argument structure (length, special characters, presence of UNC paths), and user context. The model will classify new process events as benign or suspicious, specifically flagging those predicted as malicious that also coincide with network share access."
            ]
          },
          {
            "description": "A command-line or script block execution containing syntax patterns used for recursively copying files or enumerating directories from a network share (UNC path).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, File servers hosting network shares",
            "action": [
              "Symbolic: Create and apply regular expressions to process command lines (Windows Event ID 4688) and PowerShell script blocks (Windows Event ID 4104) to detect patterns such as recursive copying from UNC paths (`xcopy \\\\*\\* /s`, `robocopy \\\\*\\* * /e`), use of wildcards (`*.docx`), or PowerShell cmdlets like `Get-ChildItem -Recurse -Path \\\\*\\* | Copy-Item`. An alert is generated on a pattern match.",
              "Statistical: For all command-line executions involving common utilities (`xcopy`, `robocopy`, `powershell.exe`), calculate the entropy of the command line string. A command with an unusually high entropy score, especially when involving UNC paths, can indicate obfuscation or complex, non-standard operations. Flag commands with entropy scores exceeding the 98th percentile of historical values for that utility.",
              "Machine Learning: Use a Natural Language Processing (NLP) model to classify the intent of PowerShell scripts (Windows Event ID 4104). Fine-tune the model on a dataset of benign administrative scripts and malicious data collection scripts. The model will classify new script blocks, flagging those with a high probability of being 'collection' or 'staging' related, especially when they reference remote shares."
            ]
          },
          {
            "description": "Anomalous volume or frequency of file access from a single user or host to one or more network shares, deviating significantly from established baselines.",
            "data_sources": [
              "Windows Event ID 5145",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting network shares, Network egress points",
            "action": [
              "Symbolic: Define a simple threshold rule: Alert if any single host reads more than 10,000 files or transfers more than 1 GB of data from any network share within a 1-hour window. This rule acts as a high-water mark for catching egregious collection activity.",
              "Statistical: For each user-host pair, establish a baseline of data access volume (bytes transferred) and file access frequency (files read per hour) for network shares using a 30-day rolling window of Zeek smb.log and Windows Event ID 5145 data. Use a Z-score calculation to detect significant spikes. An alert is generated if the Z-score for either metric exceeds 3.5.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) for each high-value network share's total read volume (bytes per minute). The model learns the normal access patterns, including daily and weekly seasonality. An alert is triggered when the observed read volume significantly deviates from the model's prediction, indicating an unexpected surge in activity."
            ]
          },
          {
            "description": "A user or host accessing an unusually high number of distinct network shares or sensitive file types that are inconsistent with their normal role-based activity.",
            "data_sources": [
              "Windows Event ID 5145",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting network shares, Active Directory servers, Data classification repositories",
            "action": [
              "Symbolic: Correlate network share access events (Windows Event ID 5145) with a static data classification list that maps user roles to authorized shares. Generate an immediate alert if a user from a non-authorized group (e.g., 'Marketing') successfully accesses a share designated for 'Engineering-Source-Code'.",
              "Statistical: For each user, calculate a daily baseline of (a) the number of unique network shares accessed and (b) the Shannon entropy of the file extensions accessed. A sudden spike in either metric, such as accessing 10 times the normal number of shares or a sharp increase in file extension entropy, should be flagged if it exceeds the 99th percentile of their own historical behavior.",
              "Machine Learning: Use a graph-based clustering algorithm (e.g., Louvain community detection) to model user access patterns where nodes represent users and network shares. The algorithm will identify 'communities' of users with similar access patterns (e.g., the 'Finance Department' community). An alert is triggered when a user node begins creating connections to shares far outside its typical community."
            ]
          },
          {
            "description": "Observation of a 'fan-in' data transfer pattern, where a single host reads files from multiple disparate network shares and writes them to a single local directory.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 11",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, File servers hosting network shares",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when a single host generates more than 10 network share read events (from different UNC paths in Zeek smb.log or Windows Event ID 5145) followed by a high volume of local file creation events (Windows Event ID 11) to a single directory within a 30-minute window.",
              "Statistical: On each host, monitor the ratio of network read operations (bytes from SMB) to local write operations (bytes written to disk) over a 5-minute interval. Establish a baseline for this ratio for each host. A significant deviation where the ratio spikes (indicating large network reads followed by local writes) beyond 3 standard deviations of the host's normal behavior should be flagged as potential staging.",
              "Machine Learning: Develop a sequence analysis model (e.g., using Hidden Markov Models) to identify the 'staging' sequence of events: [enumerate share -> read file from share_A -> read file from share_B -> create local file -> write to local file]. Train the model on event logs from known benign and malicious activities. The model will output a probability score that a given sequence of events on a host constitutes data staging."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]