[
  {
    "information_requirement": "Is an adversary leveraging Unix shell environments for command execution on enterprise assets? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1059.004",
        "name": "Unix Shell",
        "evidence": [
          {
            "description": "A successful interactive SSH login from a high-risk source is immediately followed by network connections from the target host to known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Web Servers, Internal Linux Application Servers, SSH Jump Boxes, VPN Concentrators",
            "action": [
              "Symbolic: Correlate an interactive SSH login (Zeek ssh.log) with subsequent outbound network traffic (Zeek conn.log, dns.log, http.log) originating from the same source IP within a 5-minute window. Alert if the destination IP, domain, or HTTP host header matches a high-confidence threat intelligence feed of C2 servers.",
              "Statistical: For each host, establish a 30-day baseline of outbound connection patterns (destination port, protocol, data volume). Following an SSH login, monitor for statistically significant deviations. Alert if the number of distinct destination ports used in a 1-hour window exceeds the 95th percentile of the baseline, or if the entropy of destination IP addresses increases by more than 3 standard deviations from the norm.",
              "Machine Learning: Employ a time-series forecasting model (e.g., ARIMA) trained on historical data for each host's outbound data volume. After an SSH login event, if the observed outbound data volume exceeds the model's 99% prediction interval for a sustained period (e.g., >10 minutes), flag the session as anomalous for potential data staging or exfiltration."
            ]
          },
          {
            "description": "A Unix shell process is executed via Windows Subsystem for Linux (WSL) containing command-line arguments indicative of downloading and executing a remote payload.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer Workstations, Administrator Workstations, Windows Servers with WSL enabled",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for processes like 'wsl.exe' or 'bash.exe'. Scan command-line arguments using regular expressions for patterns such as 'curl ... | bash', 'wget ... | sh', or base64-encoded strings passed to the shell's '-c' flag. Alert on any match.",
              "Statistical: Calculate the character entropy and length of all command-line arguments for shell processes. Establish a baseline for these metrics. Alert when a command's entropy or length exceeds the 98th percentile of the established baseline, as this often indicates obfuscation or complex, non-interactive commands.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on a labeled dataset of benign and malicious shell commands. Use features such as command length, argument count, presence of URLs, presence of IP addresses, and n-gram frequencies. Use the trained model to score new commands in real-time and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A Unix shell process on a Windows host is spawned by a parent process that does not typically initiate shell activity, such as a web browser or Microsoft Office application.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations (Windows), Virtual Desktop Infrastructure (VDI), Microsoft Office and Web Servers",
            "action": [
              "Symbolic: Create and maintain an explicit allowlist of legitimate parent-child process relationships for shells (e.g., 'explorer.exe' -> 'wsl.exe', 'cmd.exe' -> 'bash.exe'). Generate a high-priority alert for any observed parent-child relationship not on this list, such as 'WINWORD.EXE' -> 'bash.exe'.",
              "Statistical: Profile all parent-child process pairs across the enterprise over a 30-day period to establish frequency counts. Alert on the creation of any shell process whose parent-child relationship falls within the bottom 1% of observed frequencies, indicating a rare and suspicious event.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., K-Means or DBSCAN) on process creation events. Feature sets should include one-hot encoded parent process names, child process names, user context, and host. Clusters identified as small, sparse, or distant from major clusters represent anomalous process chains that warrant investigation."
            ]
          },
          {
            "description": "A Unix host exhibits network scanning or beaconing behavior immediately following an interactive SSH session originating from an atypical geographic location or at an unusual time.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Linux/Unix Servers (e.g., database, application), Network Egress Points, Authentication Servers",
            "action": [
              "Symbolic: Enrich SSH login events (Zeek ssh.log) with GeoIP data. Alert on any interactive login from a country where the organization has no presence or from an IP address not on an approved allowlist for administrative access.",
              "Statistical: For each user, baseline their typical login hours and source IP subnets. Alert if a user logs in outside of their normal time window (e.g., > 3 standard deviations from their mean login hour) or from a new/rare subnet. Correlate this with a post-login spike in the rate of new connections to unique destination IPs, which indicates scanning.",
              "Machine Learning: Model C2 beaconing by applying a Fast Fourier Transform (FFT) to the time series of connection intervals from a host. A strong, sharp peak in the frequency domain indicates periodic, machine-generated traffic (beaconing), as opposed to the irregular patterns of human activity. Alert when such a periodic signal is detected post-login."
            ]
          },
          {
            "description": "Network traffic shows a small file download from a low-reputation source, immediately followed by new, suspicious outbound connections from the same host, consistent with a 'curl-pipe-shell' attack.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal network segments containing potential target hosts (e.g., developer subnets)",
            "action": [
              "Symbolic: Monitor Zeek http.log for HTTP requests where the 'User-Agent' header contains 'curl' or 'wget' and the downloaded file (from files.log) has a MIME type of 'text/plain' or 'application/octet-stream'. Correlate the client IP with any new outbound connection to a known-bad IP/domain within 60 seconds.",
              "Statistical: For each internal IP, establish a baseline for the time delta between an HTTP file download and a subsequent new outbound connection. An observed time delta in the lowest 1st percentile (near-instantaneous) is highly suspicious. Additionally, flag any HTTP download where the server is a raw IP address rather than a fully qualified domain name.",
              "Machine Learning: Implement a state machine or sequence-based model to detect the specific event chain: [1] DNS query for a non-categorized or newly-seen domain, [2] HTTP GET request to that domain, [3] HTTP response with a small payload size (< 50KB) and script-like MIME type, [4] New outbound TCP/UDP connection from the same client to a different destination IP within 30 seconds. Alert when this full sequence is completed."
            ]
          },
          {
            "description": "A new or modified script file is detected in a persistence location on a Unix-like system, such as a cron directory or startup services folder.",
            "data_sources": [
              "auditd logs",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-level persistence locations on critical Linux servers (/etc/cron.d, /etc/init.d), User-specific persistence locations on developer workstations (/var/spool/cron/)",
            "action": [
              "Symbolic: Monitor file creation and modification events (e.g., from auditd) in sensitive directories like '/etc/cron.d', '/etc/rc.local', '/etc/profile.d/', and '/var/spool/cron/'. Alert on any change not associated with an authorized user, system account, or approved change management process.",
              "Statistical: Upon detection of a new script, calculate the Shannon entropy of the file's content. Compare this value to a pre-computed baseline entropy for benign administrative scripts on the system. A score that is a statistical outlier (e.g., > 3 standard deviations above the mean) suggests the script may be packed or obfuscated.",
              "Machine Learning: Use a pre-trained NLP model (e.g., using TF-IDF vectorization and a Naive Bayes classifier) to analyze the text content of new scripts. The model should be trained on a corpus of known-good and known-bad shell scripts to classify the intent of a new script based on the commands it contains (e.g., presence of 'nc', 'base64', 'wget', reverse shell one-liners)."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]