[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by removing network share connections?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.005",
        "name": "Network Share Connection Removal",
        "evidence": [
          {
            "description": "Execution of a process where the file hash is present on a threat intelligence feed of known malicious tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user Workstations, Domain Controllers, File Servers",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) and compare the SHA256 or MD5 hash of the executing process against a list of known-bad hashes from a threat intelligence source. An exact match for a process that subsequently interacts with network resources is a high-fidelity alert.",
              "Statistical: Analyze the prevalence of all file hashes observed executing across the enterprise. A hash that is globally rare (e.g., seen on fewer than 5 hosts) and is associated with command-line arguments for network share deletion (e.g., 'net use /delete') should be prioritized for investigation, as commodity malware often has unique hashes per infection.",
              "Machine Learning: Utilize a supervised machine learning classifier (e.g., gradient boosting, random forest) trained on process metadata (file hash, parent process, command-line arguments, user context). The model can provide a probability score indicating if a given process execution is malicious. A high score for a process performing a share deletion warrants immediate review."
            ]
          },
          {
            "description": "Direct execution of built-in Windows commands or PowerShell cmdlets used to delete network share connections, such as 'net use /delete' or 'Remove-SmbMapping'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104 (PowerShell Script Block Logging)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user Workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule that specifically triggers on command-line process creation (Windows Event ID 4688) containing 'net.exe' or 'net1.exe' along with the arguments 'use' and '/delete'. Similarly, create a rule for PowerShell Script Block logs (Windows Event ID 4104) containing 'Remove-SmbMapping' or 'Remove-PSDrive'.",
              "Statistical: For each user and host, establish a baseline of normal parent processes that spawn 'net.exe'. Calculate the entropy of parent process names associated with 'net.exe' executions. A sudden spike in entropy or the appearance of a statistically rare parent process (e.g., 'wscript.exe', 'mshta.exe', 'wmiprvse.exe') for a share deletion command is a strong anomaly indicator.",
              "Machine Learning: Train a logistic regression classifier on features derived from process creation events, including user account type (standard user vs. service account), parent process name, command-line argument structure, and time of day. Use this model to classify each 'net use /delete' execution as either 'benign' (e.g., part of a standard logoff script) or 'suspicious' (e.g., executed by a web server service account at 3 AM)."
            ]
          },
          {
            "description": "A correlated sequence of events on a host where a network share is accessed, data is potentially exfiltrated or manipulated, and the share connection is then deleted within a short time window (e.g., less than 15 minutes).",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Zeek smb_files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, Network Security Monitoring Sensors, Domain Controllers",
            "action": [
              "Symbolic: Implement a SIEM correlation rule that triggers when the following sequence occurs from the same source host IP and user account within a 10-minute window: 1) An SMB connection is established (Zeek conn.log to port 445), 2) A file is accessed on a share (Windows Event ID 5145 or Zeek smb_files.log), and 3) A share deletion command is executed (Windows Event ID 4688 or 4104).",
              "Statistical: For each user-share combination, calculate the baseline session duration using Zeek conn.log by measuring the time between the start and end of an SMB connection. Flag any session that falls below the 5th percentile of typical duration, especially if the session termination coincides with a share deletion command on the client host.",
              "Machine Learning: Employ a sequence analysis model (e.g., Hidden Markov Model) trained on event logs (file access, process execution, network connections) to learn normal user behavior patterns. A sequence of 'SMB-Connect -> File-Read -> Share-Delete' that deviates significantly from learned benign sequences (like those from logon/logoff scripts) should be flagged as a high-risk anomaly."
            ]
          },
          {
            "description": "An abnormally short SMB session duration or a sudden cessation of SMB traffic from a client that deviates from established baselines and is not associated with a normal logoff event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb_mapping.log",
              "Windows Event ID 4624",
              "Windows Event ID 4634"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring Sensors (e.g., Zeek), Core Switches, File Servers",
            "action": [
              "Symbolic: Monitor Zeek 'smb_mapping.log' for entries where the 'path' field corresponds to a sensitive share. An alert should be generated if a connection to this path is followed by a 'net use /delete' command on the source host within a few minutes, linking the network event to the host-based action.",
              "Statistical: For each source-destination host pair, create a time series of SMB traffic volume (total bytes) in 5-minute intervals from Zeek conn.log. Use a moving average and standard deviation to detect a sudden drop in traffic (e.g., >3 standard deviations below the moving average) that is not correlated with a normal user logoff event (Windows Event ID 4634, Logon Type 3) on the source host.",
              "Machine Learning: Apply a time-series anomaly detection algorithm (e.g., Prophet, Seasonal-Hybrid ESD) to SMB connection duration data aggregated from Zeek conn.log. Train the model on at least 30 days of historical data to learn normal session length distributions. The model can then identify sessions in real-time that are anomalously short, which could indicate an adversary's rapid cleanup operation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]