[
  {
    "information_requirement": "Is the adversary using multi-hop proxy chains for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1090.003",
        "name": "Multi-hop Proxy",
        "evidence": [
          {
            "description": "A direct TCP/UDP connection from an internal host to an external IP address or domain listed on a threat intelligence feed as a known Tor node, public proxy, or adversary-controlled proxy infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Web Proxies)",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) against a threat intelligence list of known Tor nodes, public proxies, and adversary C2 IP addresses/domains. Generate an alert for any resulting match.",
              "Statistical: For hosts communicating with destinations not on an allowlist, calculate the historical rarity of the destination Autonomous System Number (ASN). Flag connections where the destination ASN is in the bottom 5th percentile of all observed ASNs for the organization, suggesting communication with an unusual or specialized service provider.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled network flows, using features like destination port, data volume, connection duration, and threat intelligence hits. Use the model to classify new, unknown outbound connections in real-time as 'benign', 'suspicious-proxy', or 'malicious-proxy'."
            ]
          },
          {
            "description": "An observed TLS handshake where the JA3 or JA3S hash matches a known fingerprint for proxy or C2 tooling, or where the presented X.509 certificate contains default, generic, or randomized values in its subject or issuer fields.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal Server Segments",
            "action": [
              "Symbolic: Scan Zeek ssl.log records for JA3 and JA3S hashes that match a watchlist of fingerprints associated with known proxy tools (e.g., Tor, Psiphon, Cobalt Strike). Alert on any direct matches.",
              "Statistical: Calculate the Shannon entropy of the certificate's Subject Common Name (CN) and Subject Alternative Name (SAN) fields. Flag certificates where the entropy exceeds a high threshold (e.g., > 3.5), indicative of domain generation algorithms (DGAs) or randomized names often used by C2 proxies.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., LSTM Autoencoder) on sequences of JA3 hashes originating from a single client over time. Flag new or rarely seen JA3 hashes that deviate significantly from the client's established baseline of TLS client behaviors."
            ]
          },
          {
            "description": "An internal host exhibiting a low 'fan-in' to high 'fan-out' traffic ratio, defined as receiving one or a few external connections followed by initiating connections to more than 10 unique internal hosts within a 60-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Demilitarized Zone (DMZ), User Workstation Subnets, Critical Server VLANs",
            "action": [
              "Symbolic: For each host, count the number of distinct external source IPs establishing connections to it and the number of distinct internal destination IPs it connects to over a 1-hour window. Alert if the inbound source count is less than 3 and the outbound destination count is greater than 10.",
              "Statistical: Model the distribution of 'fan-out' ratios (number of outbound connections / number of inbound connections) for all hosts. Flag any host whose ratio exceeds the 99th percentile of the population distribution as a potential pivot.",
              "Machine Learning: Construct a network graph where hosts are nodes and connections are edges. Apply a community detection algorithm (e.g., Louvain Modularity) to identify normal traffic clusters, then use an anomaly detection algorithm (e.g., Isolation Forest) on graph-based features (e.g., betweenness centrality) to identify hosts that act as anomalous bridges between communities."
            ]
          },
          {
            "description": "A sequence of outbound connections from a single internal host to a single external destination, where the time delta between connections is nearly constant (+/- 2 seconds), packet sizes are highly uniform, and the destination is not a known, legitimate service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstation Subnets, Server Subnets, Network Egress Points",
            "action": [
              "Symbolic: Identify hosts making outbound connections to non-categorized or newly observed domains on port 443. If a host connects to the same destination IP more than 100 times in 24 hours, flag for review.",
              "Statistical: For each source-destination pair, calculate the standard deviation of the time difference between consecutive connections over a 24-hour period. A standard deviation below a small threshold (e.g., < 2 seconds) indicates highly regular beaconing. Also, calculate the variance of the 'orig_bytes' and 'resp_bytes' fields; low variance indicates uniform beacon sizes.",
              "Machine Learning: Apply a Fast Fourier Transform (FFT) to the time series of connection events for each host. A strong peak in the frequency domain indicates a periodic signal characteristic of C2 beaconing. Use this as a feature in a classifier to distinguish beaconing from normal user traffic."
            ]
          },
          {
            "description": "Observed ICMP packets with a payload size greater than 64 bytes, DNS TXT/NULL queries with a query length exceeding 200 characters, or encrypted TCP traffic (e.g., on port 22 or 443) directed to a network device whose role is not a designated VPN concentrator or management interface.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek icmp.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Infrastructure Segments (Routers, Switches), DNS Servers, Network Egress Points",
            "action": [
              "Symbolic: Create an alert for any ICMP echo-request/reply packet in icmp.log with a payload size greater than 64 bytes. Create a separate alert for any encrypted connection (e.g., port 443, 22) in conn.log where the destination IP belongs to a network device that is not on an approved list of VPN gateways or management servers.",
              "Statistical: For DNS queries in dns.log, calculate the Shannon entropy of the subdomain portion of the query name. Flag any queries where the entropy is above 4.0, which is highly indicative of data exfiltration via DNS tunneling. Also, monitor the ratio of TXT queries to A queries for each client; a ratio significantly above the organizational baseline suggests DNS abuse.",
              "Machine Learning: Train an autoencoder on legitimate network traffic protocol features (e.g., packet sizes, protocol flags, inter-arrival times for ICMP/DNS). Use the trained model to identify anomalous protocol usage by flagging traffic with a high reconstruction error, which indicates it does not conform to learned normal patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]