[
  {
    "information_requirement": "Is the adversary establishing command and control using remote access hardware? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1219.003",
        "name": "Remote Access Hardware",
        "evidence": [
          {
            "description": "A host initiates a connection or resolves a domain matching a known indicator of compromise (IOC) associated with remote access hardware C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, internal DNS resolvers, and internet gateways.",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) against a threat intelligence feed of IPs and domains associated with remote access hardware (e.g., default C2 for PiKVM, TinyPilot). Alert on any match.",
              "Statistical: Calculate the prevalence of all requested domains across the enterprise. Flag domains for review that are requested by only a single host, as this pattern is anomalous for legitimate web services but common for dedicated C2 channels. Rank these single-host domains by their rarity in the global DNS ecosystem (using external datasets).",
              "Machine Learning: Use a pre-trained Domain Generation Algorithm (DGA) classification model to score all newly observed domains in Zeek dns.log. Investigate any domain that receives a high DGA score and is associated with traffic from a single, high-value internal asset."
            ]
          },
          {
            "description": "A new, unrecognized hardware device is detected on a host, identified by its MAC address, DHCP hostname, or USB device properties, which corresponds to known remote access hardware.",
            "data_sources": [
              "Windows Event ID 6416",
              "Windows Event ID 4688",
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical access points to servers (data centers), network closets, and workstations handling sensitive data.",
            "action": [
              "Symbolic: Create a rule to alert when a new external device is detected (Windows Event ID 6416) on a server-class machine, especially if followed within 5 minutes by network configuration commands such as 'ipconfig' or 'netsh' (Windows Event ID 4688).",
              "Statistical: Maintain a baseline of common DHCP client hostnames and MAC address OUIs (Organizationally Unique Identifiers) from Zeek dhcp.log. Alert when a new DHCP request appears with a hostname or OUI that falls outside the 99th percentile of commonality (i.e., is extremely rare) and matches a watchlist of known remote access hardware defaults (e.g., 'pikvm', 'tinypilot', 'lan-turtle').",
              "Machine Learning: Train a classification model (e.g., logistic regression, random forest) using features from DHCP requests (hostname length, character entropy, OUI, requested options) to predict whether a new device is a standard corporate asset or a suspicious, unknown device. Flag devices classified as suspicious for analyst review."
            ]
          },
          {
            "description": "A sequence of events occurs where a new physical device connection is immediately followed by the host initiating a new external network connection, particularly when no interactive user is logged on.",
            "data_sources": [
              "Windows Event ID 6416",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, database servers, and other Tier 0/Tier 1 assets.",
            "action": [
              "Symbolic: Correlate a new device connection event (Windows Event ID 6416) with the initiation of an outgoing network connection (from Zeek conn.log) from the same host to an external IP within a 3-minute window. Escalate the alert priority if there is no corresponding active interactive logon session (Windows Event ID 4624 with Logon Type 2 or 10).",
              "Statistical: For each host, calculate the baseline rate of 'new device -> new external connection' event pairs. Use a Poisson distribution model to identify when the observed count of these correlated events in a short time frame (e.g., 1 hour) significantly exceeds the historically expected rate for that specific host.",
              "Machine Learning: Use a sequence analysis model (e.g., Markov chain or LSTM) to learn common event sequences on endpoints. Flag any sequence containing [New Hardware Detected -> Process Create -> New External Connection] that has a very low probability of occurring based on the learned model, as it represents a novel and suspicious chain of events."
            ]
          },
          {
            "description": "Interactive system activity, such as command-line execution or GUI interaction, occurs on a host without a corresponding active interactive logon session (Logon Type 2, 10) or an established remote session (Logon Type 3).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4634"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers, administrative workstations, and systems with access to sensitive intellectual property.",
            "action": [
              "Symbolic: On critical assets, trigger a high-severity alert for any process creation (Windows Event ID 4688) by a non-service account user that occurs when no active logon session (Type 2, 3, or 10) for that user exists on the host. Exclude known scheduled tasks from the logic.",
              "Statistical: Profile the parent-child process relationships for each host. Calculate the information entropy of parent processes that spawn interactive shells (cmd.exe, powershell.exe). A sudden spike in entropy, or the appearance of a rare parent process (e.g., a non-system service) spawning a shell without a logon session, is a high-confidence statistical indicator of anomalous execution.",
              "Machine Learning: Train an anomaly detection model (e.g., Isolation Forest) on features from process creation events (user account, parent process name, command line arguments, time of day) that occur outside of active user logon sessions. The model will learn the patterns of legitimate background tasks and flag any activity that deviates from this learned 'normal' as a potential 'ghost in the machine' event."
            ]
          },
          {
            "description": "A host establishes a persistent, low-volume, and periodic (heartbeat) network connection to an external destination, which is inconsistent with the host's normal application and user behavior.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic to/from all internal subnets, especially those containing critical servers and segregated networks.",
            "action": [
              "Symbolic: Alert on any TCP connection from a server to an external IP on a non-standard port that remains active for more than 12 hours while transferring less than 50 KB of total data, excluding known and approved services.",
              "Statistical: For each host, baseline the distribution of its outgoing connection durations and total bytes transferred (orig_bytes + resp_bytes) using Zeek conn.log. Continuously monitor for new connections that are statistical outliers (e.g., > 98th percentile for duration and < 5th percentile for bytes transferred), indicating a potential low-and-slow C2 channel.",
              "Machine Learning: Apply time series analysis (e.g., autocorrelation or Fourier transform) to connection logs for each host to detect highly periodic (beaconing) behavior. A strong, regular signal in the time delta between connections to the same destination IP is a primary indicator of an automated C2 implant, common with hardware-based tools."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]