[
  {
    "information_requirement": "Is the adversary maintaining persistence using modified network device firmware? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1542.004",
        "name": "ROMMONkit",
        "evidence": [
          {
            "description": "A file transferred to a network device has a hash matching a known malicious ROMMONkit image, or a network device initiates a connection to a destination IP or domain known to be ROMMONkit C2 infrastructure.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core routers, edge firewalls, TFTP/SCP/FTP management servers, and DNS resolvers.",
            "action": [
              "Symbolic: Continuously hash files transferred via TFTP, FTP, or SCP (from Zeek files.log) and join against a threat intelligence feed of known malicious firmware hashes. Concurrently, monitor Zeek conn.log and dns.log for connections or queries from network device management IPs to destinations on a C2 threat feed. Generate a high-severity alert on any match.",
              "Statistical: For all DNS queries (Zeek dns.log) originating from network devices, calculate the entropy of the queried domain names. Establish a baseline entropy score for legitimate management-related domains. Flag queries with entropy scores exceeding the 99th percentile, as this may indicate DGA-based C2 communication.",
              "Machine Learning: Develop a time-series model (e.g., ARIMA) to forecast the expected volume of outbound connections (Zeek conn.log) from network devices on a per-protocol basis. Generate an anomaly alert when the observed connection volume significantly exceeds the forecast, especially on non-standard ports, which could indicate a newly activated malicious payload."
            ]
          },
          {
            "description": "A sequence of commands executed on a network device, captured in logs, matches a known pattern for firmware modification, correlated with network traffic patterns indicative of ROMMONkit installation tools.",
            "data_sources": [
              "Network Device CLI Logs",
              "Zeek tftp.log",
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device configuration management systems (e.g., TACACS+/RADIUS servers), central syslog aggregators, and core network switches and routers.",
            "action": [
              "Symbolic: Create a rule that detects a specific sequence of commands (e.g., 'copy tftp flash:', setting boot variables, 'reload') from Network Device CLI Logs within a short time window. Alert if this sequence is detected, especially if originating from a non-administrator account or outside a maintenance window.",
              "Statistical: Analyze Zeek tftp.log to establish a baseline of normal TFTP transfer characteristics (e.g., block size, file size) for legitimate firmware updates. Use descriptive statistics to define normal ranges. Flag any TFTP transfers to network devices where parameters like block size fall more than 3 standard deviations from the mean.",
              "Machine Learning: Use a sequence-based classification model (e.g., a Recurrent Neural Network) trained on known legitimate and malicious command sequences. Feed live command streams from Network Device CLI Logs into the model to classify sessions as benign or potentially malicious in real-time."
            ]
          },
          {
            "description": "A file transfer to a network device occurs from an unauthorized source, at a time outside a defined maintenance window, or has a file size that is statistically anomalous compared to historical legitimate updates.",
            "data_sources": [
              "Zeek tftp.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Management VLANs, administrator workstations, jump servers, and TFTP/SCP/FTP servers.",
            "action": [
              "Symbolic: Maintain an allow-list of authorized IP addresses for servers/workstations permitted to transfer firmware to network devices. Monitor Zeek conn.log for TFTP, FTP, or SCP connections to network device management interfaces from any source IP not on this list and generate an alert.",
              "Statistical: For each network device model, build a statistical profile of legitimate firmware file sizes from historical Zeek files.log. Use the Interquartile Range (IQR) method to identify outliers. Flag any new firmware transfer where the file size is outside the range (e.g., < Q1 - 1.5*IQR or > Q3 + 1.5*IQR).",
              "Machine Learning: Train a classification model (e.g., Random Forest) to predict if a file transfer is legitimate using features like source IP, device type, time of day, and file size. A 'malicious' prediction with high confidence should trigger an investigation, correlating with login events (Windows Event ID 4624) on the source host."
            ]
          },
          {
            "description": "A network device reboot, not correlated with scheduled maintenance, is immediately followed by network connections from the device that deviate from established post-reboot traffic baselines.",
            "data_sources": [
              "Network Device CLI Logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Central syslog aggregators, core and edge network devices, and DNS resolvers.",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a 'device reboot' syslog message is received, and within 5 minutes, a connection is seen in Zeek conn.log from that device to an external IP on a non-standard management port. Enrich the destination IP with threat intelligence and alert if high-risk.",
              "Statistical: For each device, baseline normal post-reboot network activity (destination IPs, ports, protocols) within the first 15 minutes. Use frequency analysis to identify rare connections. Alert if a device, post-reboot, contacts a destination or uses a port/protocol pair that has rarely or never been seen in its historical baseline.",
              "Machine Learning: Implement an unsupervised anomaly detection model (e.g., Isolation Forest) on features of post-reboot network connections (destination IP, port, protocol, bytes). Train the model on legitimate reboot events. Any connection flagged as an anomaly after a reboot should be surfaced for review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using modified network device firmware? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1542.004",
        "name": "ROMMONkit",
        "evidence": [
          {
            "description": "A pattern of failed connection attempts (e.g., TCP resets, timeouts) from known security infrastructure (scanners, log collectors) when traffic is routed through a suspect network device, while other non-security traffic passes unimpeded.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Security tool subnets, central log collectors, suspect network devices, and network taps monitoring traffic to/from these devices.",
            "action": [
              "Symbolic: Maintain a list of security infrastructure IPs. Create a rule to alert if Zeek conn.log shows a high rate of rejected ('REJ') or reset ('RST') connections from these IPs to devices behind a specific router, while connections from other IPs to the same destinations succeed.",
              "Statistical: For each core network device, calculate the baseline success rate of connections originating from the security subnet. Alert if the success rate for a specific device drops by a significant percentage (e.g., >50%) compared to its historical baseline and peer devices.",
              "Machine Learning: Use a time-series anomaly detection model on the count of 'REJ' and 'RST' connection states in Zeek conn.log for traffic involving security subnets. A sudden, sustained spike in these failure states not correlated with a known outage should be flagged as an anomaly."
            ]
          },
          {
            "description": "Network traffic traversing a suspect device exhibits specific, low-level artifacts matching threat intelligence on a known ROMMONkit, such as anomalous IP TTL values or non-standard DNS record usage.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs at key aggregation points (e.g., data center core, internet edge), DNS resolvers, and suspect network devices.",
            "action": [
              "Symbolic: Based on threat intelligence, create a signature to detect a ROMMONkit's network fingerprint. For example, use a Zeek script to search for DNS queries (Zeek dns.log) from a network device that use non-standard opcodes or request TXT records with unusually large response sizes.",
              "Statistical: Profile the normal distribution of TTL values in Zeek conn.log for traffic from internal segments. Flag connections where the initial TTL is a statistical outlier (e.g., 99.9th percentile) for its source subnet, as a compromised router may inject traffic with an anomalous TTL.",
              "Machine Learning: Train a classifier (e.g., Gradient Boosting) on labeled network data to distinguish benign traffic from traffic modified by known implants. Features could include IP flags, TTL, and packet size distribution. Deploy the model on live traffic to classify flows in real-time."
            ]
          },
          {
            "description": "A statistically significant and persistent deviation in traffic flow metrics (e.g., volume, protocol mix) through a network device, not attributable to a scheduled network change.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Key network choke points, such as internet gateways, data center core switches, and inter-site VPN routers.",
            "action": [
              "Symbolic: Define critical traffic flows (e.g., production to backup servers). Create a rule that alerts if the volume of this traffic, seen in Zeek conn.log, drops to near-zero for a sustained period outside a maintenance window, indicating potential re-routing.",
              "Statistical: For each major network path, establish a baseline of protocol distribution using Zeek conn.log. Calculate the Shannon entropy of the protocol mix hourly. A sudden, sharp decrease in entropy could signal that traffic is being manipulated or redirected.",
              "Machine Learning: Use a multivariate time-series model to predict expected traffic volumes for multiple protocols across a key network device. Detect anomalies when the actual observed traffic shows a significant residual error (deviation from the forecast), suggesting an unobserved factor is influencing traffic."
            ]
          },
          {
            "description": "A significant decrease or complete cessation of expected management traffic (e.g., syslog, SNMP) from a network device, particularly after an unscheduled reboot, when compared against its historical baseline and peers.",
            "data_sources": [
              "Zeek conn.log",
              "Network Device CLI Logs",
              "Central Syslog Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Central syslog/SNMP trap servers, NTP servers, and network device management interfaces.",
            "action": [
              "Symbolic: Create a 'heartbeat' rule for each critical network device. If no syslog messages are received from a device for a defined period (e.g., 60 minutes), and the device is still reachable via ICMP, generate an alert for potential log suppression.",
              "Statistical: For each network device, model the expected rate of syslog messages per hour. Use a moving average and standard deviation to create an expected range. Alert if the observed rate drops below the lower bound (e.g., mean - 3 * std_dev) for a sustained period.",
              "Machine Learning: Employ a time-series anomaly detection model (e.g., Prophet) for the volume of management traffic (Syslog bytes, SNMP packets) from each device. The model can account for seasonality. Flag any device whose traffic volume deviates significantly from the model's forecast."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]