[
  {
    "information_requirement": "Is the adversary disabling or modifying security tools to evade detection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.001",
        "name": "Disable or Modify Tools",
        "evidence": [
          {
            "description": "A process creation event where the executable's file hash or name matches a known security tool disabler from a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek software.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers.",
            "action": [
              "Symbolic: Continuously monitor for process creation events (Windows Event ID 4688). Compare the file hash and process name of newly created processes against a continuously updated cyber threat intelligence (CTI) feed of known security tool disablers (e.g., PCHunter, GMER, PowerTool, Defeat-Defender scripts). Alert immediately on any confirmed hash or file name match.",
              "Statistical: Analyze the parent-child process relationships for executions matching the CTI feed. Establish a baseline of common parent processes for all software on the network. If a known disabler is executed by a statistically rare parent process (e.g., a parent process in the bottom 5th percentile of observed frequency for that child process), elevate the alert priority.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on process execution features (parent process name, command line length, entropy of command line, user context, file path). Use the model to score all new process executions, flagging those with a high probability of being a security tool disabler, even if the hash is unknown."
            ]
          },
          {
            "description": "A process creation event with a command line containing specific strings or regular expression patterns known to terminate, uninstall, or reconfigure common security tools.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers, especially domain controllers and administrative hosts.",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for command lines containing suspicious patterns targeting security tools. Use regular expressions to detect commands like `net stop <service_name>`, `sc config <service_name> start= disabled`, `taskkill /IM <process.exe>`, `fltmc unload <driver>`, or PowerShell cmdlets such as `Set-MpPreference -DisableRealtimeMonitoring $true`, or `reg.exe` modifying security keys.",
              "Statistical: Calculate the entropy of command-line arguments for all executed commands. Establish a baseline entropy for common administrative commands and user profiles. Alert when a command targeting a security tool exhibits an entropy value that exceeds the 95th percentile for that user or host, which can indicate obfuscation.",
              "Machine Learning: Use a sequence analysis model (e.g., an LSTM) to analyze the sequence of commands executed within a single session. Train the model on benign administrative sessions versus known attack chains. Flag user sessions that contain a command sequence highly indicative of an attack, such as reconnaissance, followed by privilege escalation, and then a command to disable a security tool."
            ]
          },
          {
            "description": "A temporal correlation on a single host where a process creation event from an unsigned binary or unusual file path is followed within a 5-minute window by a service stop or process termination event corresponding to a known security tool.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations, servers, and domain controllers.",
            "action": [
              "Symbolic: Define a SIEM correlation rule that triggers when a process creation event (Windows Event ID 4688) from a non-standard location (e.g., `%TEMP%`, `%APPDATA%`) or an unsigned binary is followed within 5 minutes on the same host by a service stop event (Windows Event ID 7036 for services like 'WinDefend', 'Sysmon', or EDR agents).",
              "Statistical: For each host, calculate the baseline rate of security service stop events (Event ID 7036 for security services). An alert is triggered if the daily rate on a given host exceeds a statistical threshold (e.g., 3 standard deviations above the 30-day moving average), indicating an unusual frequency of service stops.",
              "Machine Learning: Develop a Hidden Markov Model (HMM) where the hidden states are 'Normal Operation' and 'Tampering Activity'. The observed events are sequences of process creations, service stops, and registry modifications. The model learns state transition probabilities and flags event sequences that have a high probability of being generated by the 'Tampering Activity' state."
            ]
          },
          {
            "description": "A registry modification or deletion event targeting a key path known to control security tool settings, such as anti-tampering, logging levels, or service startup type.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The Windows Registry on all enterprise workstations and servers.",
            "action": [
              "Symbolic: Create a specific watchlist of critical security tool registry keys (e.g., `HKLM\\SYSTEM\\CurrentControlSet\\Services\\WinDefend`, `HKLM\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational`). Alert on any modification (Event ID 4657) to these keys by any process other than a trusted installer or the security tool's own update executable.",
              "Statistical: For the watched registry keys, model the distribution of modifying processes over a 30-day baseline period. Alert if a statistically rare process (e.g., a process not seen modifying the key in the baseline period, or one in the bottom 5% of frequency) performs a modification, indicating anomalous behavior.",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) trained on features of registry modification events: process name, process path, user account, parent process, and target key. The model will identify unusual combinations of these features that deviate from normal administrative or system behavior, flagging potential tampering."
            ]
          },
          {
            "description": "The clearing of a security event log, or a statistically significant drop in the event generation rate for a specific host or log source, without a corresponding authorized change record.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log aggregation platform (SIEM), all enterprise workstations and servers, and network sensors generating Zeek logs.",
            "action": [
              "Symbolic: Create a non-suppressible, high-severity alert that triggers immediately upon detection of Windows Event ID 1102 ('The audit log was cleared'). The alert should automatically enrich the event with the responsible user and process that initiated the action for immediate investigation.",
              "Statistical: For each host and critical log source (e.g., Sysmon, Zeek conn.log), ingest log counts into a time series database. Calculate a 30-day rolling average and standard deviation of log volume per hour. Trigger an alert if the current hourly volume drops more than 3 standard deviations below the rolling average for a sustained period (e.g., more than 15 minutes).",
              "Machine Learning: Employ a time series forecasting model (e.g., Prophet) to predict the expected log volume for each host and log source for the next hour, accounting for weekly and daily seasonality. If the actual observed volume is significantly lower than the predicted volume's confidence interval, flag it as a 'log stoppage' anomaly for investigation."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]