[
  {
    "information_requirement": "Is the adversary leveraging compromised or malicious third-party web services against our network, indicating prior resource development? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.006",
        "name": "Web Services",
        "evidence": [
          {
            "description": "A network connection event where the destination IP address, domain (from HTTP Host header or SSL SNI), or full URL matches an entry on a threat intelligence feed of known malicious infrastructure associated with legitimate web services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the network (e.g., firewalls, proxies), DNS resolvers, and web gateways.",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) with HTTP logs (Zeek http.log) and SSL/TLS logs (Zeek ssl.log) on the unique connection ID (uid). Compare the destination IP, HTTP host header, and SSL Server Name Indication (SNI) field against a continuously updated threat intelligence feed of known malicious indicators. Generate a high-priority alert for any match.",
              "Statistical: For all connections to known web service domains (e.g., *.github.com, *.pastebin.com, *.dropbox.com), calculate the historical frequency of connections from each internal source IP. Identify source IPs whose connection frequency to these services is in the top 5th percentile (p95) over a 24-hour rolling window, suggesting anomalous interaction.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled network traffic to web services, using features such as connection duration, bytes sent/received, user-agent, and destination port. Use the model to score new connections in real-time for their likelihood of being malicious C2 or staging activity. Investigate connections with a high malicious probability score."
            ]
          },
          {
            "description": "A file transfer event from a known web service where the file's MIME type (from Zeek files.log) mismatches its file extension, the file's hash matches a known malicious signature, or the file content contains high-entropy strings indicative of obfuscation or encoding.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints receiving file downloads, network egress points where file transfers can be monitored, and sandboxing environments.",
            "action": [
              "Symbolic: For every file identified in Zeek files.log, compare its MD5/SHA256 hash against a threat intelligence feed of known malicious file hashes. For files downloaded via HTTP (from Zeek http.log), use regular expressions to search the URI for known malicious stager filenames (e.g., 'payload.ps1', 'stage1.exe'). Alert on any match.",
              "Statistical: For all downloaded files, calculate the Shannon entropy of the file content. Establish a baseline entropy score for common file types (e.g., .docx, .jpg, .js). Flag files whose entropy score exceeds 3 standard deviations above the mean for their claimed file type, suggesting packing or encryption. Correlate high-entropy file downloads with subsequent process creation (Windows Event ID 4688) by the same user.",
              "Machine Learning: Utilize a time-series anomaly detection model (e.g., LSTM) to monitor the rate of file downloads from web services per host. The model should be trained on historical data to learn normal download patterns. An alert is triggered when the model predicts a significant deviation from the expected download rate, potentially indicating automated fetching of malicious tools."
            ]
          },
          {
            "description": "A network connection to a known cloud storage service where the total data volume (bytes sent or received) for a single session or a 24-hour period exceeds a statistically defined threshold for the source host or user account.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, user endpoint devices, and Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Symbolic: Monitor Zeek ssl.log for Server Name Indication (SNI) values associated with less common or high-risk file sharing services (e.g., mega.nz, sendspace.com, file.io). Create a rule to alert on any connection to these services from servers or sensitive user groups that have no business need for them.",
              "Statistical: For each source host, establish a baseline of data transfer volume (sum of orig_bytes + resp_bytes from Zeek conn.log) to known cloud storage domains over a 30-day period. Calculate the 99th percentile (p99) for daily upload and download volume. Trigger an alert when a host's daily data transfer volume to these services exceeds this threshold.",
              "Machine Learning: Implement a clustering algorithm (e.g., K-Means) on connection features (duration, total bytes, periodicity) for traffic to cloud services. Identify clusters representing normal activity (e.g., small, infrequent syncs) and anomalous activity (e.g., large, sustained, periodic transfers indicative of C2 heartbeating or data exfiltration). New connections are classified into these clusters, and those falling into anomalous clusters are flagged for review."
            ]
          },
          {
            "description": "A network connection event from a non-developer-profiled host to a raw content URL of a code repository (e.g., raw.githubusercontent.com), especially when the HTTP User-Agent is a non-browser client like 'curl', 'wget', or 'PowerShell'.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Non-developer user workstations, production server subnets, and network proxy logs.",
            "action": [
              "Symbolic: Create a watchlist of non-browser User-Agent strings (e.g., 'PowerShell/', 'curl/', 'wget/', 'python-requests/'). In Zeek http.log, alert on any event where the `host` is a known raw content domain (e.g., 'raw.githubusercontent.com', 'pastebin.com/raw/'), the `user_agent` is on the watchlist, and the source IP is not in the predefined set of developer workstations.",
              "Statistical: Profile the set of domains visited by different user groups. Calculate the Jaccard similarity index between the set of domains visited by a user on a given day and the set of domains typical for their role (e.g., 'developer', 'sales'). A low similarity score, coupled with visits to code repositories by a non-developer, indicates a behavioral deviation warranting investigation.",
              "Machine Learning: Apply Natural Language Processing (NLP) topic modeling (e.g., Latent Dirichlet Allocation - LDA) to the URIs and downloaded content from paste sites. Train the model to distinguish between legitimate code snippets and obfuscated attack scripts. Classify new downloads in real-time and flag those identified as likely malicious payloads."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]