[
  {
    "information_requirement": "Has the adversary gathered reconnaissance information via private threat intelligence sources that enables subsequent attacks?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1597.001",
        "name": "Threat Intel Vendors",
        "evidence": [
          {
            "description": "An external IP address, previously unseen in network or authentication logs, attempts to connect or authenticate, and this IP is listed in a threat intelligence feed as malicious infrastructure or associated with a compromised account from a recent data breach.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, VPN Concentrators, External-facing Authentication Services (e.g., ADFS, OWA)",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) and authentication logs (Windows Event ID 4624/4625) on source IP. Query this joined data against a threat intelligence feed of known malicious IPs, domains, and compromised usernames. Generate an alert for any direct match.",
              "Statistical: For each external source IP, calculate the ratio of failed to successful logins (Windows Event ID 4625 vs 4624). Identify source IPs where this ratio is in the 99th percentile of all external IPs over a 1-hour window. Further score these IPs by cross-referencing them against a list of compromised accounts from recent breaches; a higher number of matching accounts increases the risk score.",
              "Machine Learning: Train a logistic regression classifier on historical authentication data, using features such as source IP reputation, time of day, geolocation, user agent, and whether the username appeared in a recent breach list. Use the trained model to score new login events in near real-time. Events with a high probability score (e.g., > 0.9) for being malicious are flagged for investigation."
            ]
          },
          {
            "description": "HTTP requests to public-facing web servers contain User-Agent strings, URI paths, or request header combinations that are signatures for known reconnaissance or vulnerability scanning tools (e.g., Nmap, Metasploit, Nuclei), particularly in a time window immediately following a relevant threat intelligence report.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Gateways, Web Application Firewalls (WAFs)",
            "action": [
              "Symbolic: Query Zeek http.log against a regularly updated list of regular expressions matching User-Agent strings and URI patterns of known scanning tools (e.g., `/(nmap|masscan|zgrab|nuclei)/i` in user_agent). Alert on any match.",
              "Statistical: Calculate the Shannon entropy of URI paths requested by each source IP in a 5-minute window from Zeek http.log. A high entropy score, exceeding the 98th percentile for all external IPs, indicates potential directory scanning or fuzzing. Correlate high-entropy IPs with those making requests to many different ports in Zeek conn.log.",
              "Machine Learning: Use unsupervised learning (e.g., k-means clustering) on features extracted from Zeek http.log, such as request method, response status code, content length, and URI structure. Identify clusters of anomalous activity that deviate from the normal 'user' cluster. Manually inspect these anomalous clusters to identify new or unknown scanning tools."
            ]
          },
          {
            "description": "A sudden spike in scanning or exploitation attempts against a specific service or port, temporally correlated with the publication of a new vulnerability or exploit in a threat intelligence report.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Perimeter Firewalls, Demilitarized Zone (DMZ) services, Public IP address space",
            "action": [
              "Symbolic: When a CTI report announces a new vulnerability for a specific service/port (e.g., TCP/445), create a targeted query to count connection attempts to that port from external IPs in Zeek conn.log. Alert if the count from a single source IP exceeds a predefined threshold (e.g., 100 connections in 5 minutes).",
              "Statistical: For each public-facing service (destination IP and port), maintain a baseline of the number of unique source IPs connecting per hour. Calculate the moving average and standard deviation. Generate an alert when the current count exceeds 3 standard deviations above the moving average, indicating a statistically significant spike in activity.",
              "Machine Learning: Implement a time series anomaly detection model (e.g., ARIMA or Prophet) for connection volume to critical ports. Train the model on historical data from Zeek conn.log. The model will forecast expected traffic volume and flag any observed volume that falls outside the prediction interval, especially within 72 hours of a related vulnerability disclosure."
            ]
          },
          {
            "description": "An increase in login attempts (credential stuffing or password spraying) using usernames or email formats that align with a recently disclosed data breach which threat intelligence indicates is being actively exploited.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN servers, Single Sign-On (SSO) platforms, Externally accessible applications (e.g., Outlook Web Access)",
            "action": [
              "Symbolic: From a single source IP, if the number of failed logins (Windows Event ID 4625) for more than 5 distinct user accounts occurs within a 1-minute window, this indicates a password spraying attack. Alert on the source IP.",
              "Statistical: Calculate the baseline rate of failed logins (Event ID 4625) per source IP per hour. Identify source IPs where the failed login count is a statistical outlier (e.g., >99th percentile or >3 interquartile ranges above the third quartile). For these outlier IPs, check if the targeted usernames follow a common pattern (e.g., `first.last`) that matches a recent breach report.",
              "Machine Learning: Train a classifier to distinguish between normal failed logins and credential stuffing/spraying attacks. Features could include: number of unique usernames per source IP, time between attempts, source IP geolocation, and time of day. Use the model to score incoming authentication failures (Event ID 4625) and flag high-probability attacks."
            ]
          },
          {
            "description": "Targeted reconnaissance or exploitation attempts against specific assets (e.g., servers, applications) shortly after those assets or their technologies were mentioned in a threat intelligence report as part of an organization's externally visible infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Asset Management Database, Public DNS records, Network infrastructure mentioned in public reports or job postings",
            "action": [
              "Symbolic: Maintain a watch list of high-value or recently exposed assets (IPs/hostnames). Create a rule to alert on any connection attempt (Zeek conn.log) to an asset on this list from an IP address found in a CTI feed of known malicious actors.",
              "Statistical: For each asset on the watch list, establish a baseline of daily connection volume. After a CTI report mentions the asset or its underlying technology, perform a change point detection analysis on the connection volume time series. A statistically significant increase in volume post-report indicates targeted reconnaissance.",
              "Machine Learning: Use an anomaly detection model (e.g., an autoencoder) trained on normal network traffic patterns (features like source/destination IP, port, protocol, packet counts) for high-value assets. After a CTI report, monitor for traffic to these assets that generates a high reconstruction error from the autoencoder, suggesting it deviates from normal, learned behavior."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]