[
  {
    "information_requirement": "Has the adversary modified system images to evade defenses? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1601",
        "name": "Modify System Image",
        "evidence": [
          {
            "description": "A file transfer to a network device containing a system image whose file hash or filename matches a known malicious indicator from threat intelligence.",
            "data_sources": [
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress/ingress points, management network segments, threat intelligence platform.",
            "action": [
              "Symbolic: For all files transferred to network device management subnets, extract file hashes (MD5, SHA1, SHA256) from Zeek files.log. Correlate these hashes against a threat intelligence feed of known malicious firmware/image hashes. Generate a high-severity alert on any match.",
              "Statistical: Analyze the entropy of filenames in Zeek files.log and http.log for transfers to network devices. High-entropy or randomized filenames that do not match vendor naming conventions (e.g., c3750e-universalk9-mz.152-4.E10.bin vs upd8374.tmp) can indicate staging. Flag filenames with entropy scores in the 95th percentile for review.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on features from Zeek logs (file MIME type, source/destination IP reputation, filename entropy, transfer protocol, presence of known malicious strings). Use the model to classify each file transfer to a network device as benign or potentially malicious, flagging those with a high probability score."
            ]
          },
          {
            "description": "Command-line execution on an administrative host involving file transfer clients (e.g., tftp, scp, curl) immediately followed by a network connection to a network device's management port.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrative workstations, jump servers, domain controllers.",
            "action": [
              "Symbolic: On administrative hosts, monitor for process creation events (Windows Event ID 4688) for tftp.exe, scp.exe, curl.exe, or wget.exe. If the command line arguments include a file with a .bin, .img, or .swi extension, correlate this with a near-simultaneous outbound connection from the host to a network device on a management port (e.g., 22, 23, 69) in Zeek conn.log. Alert on this event sequence.",
              "Statistical: For each administrative user, establish a baseline of commonly executed command-line processes. Calculate the frequency of file transfer client usage. An execution of a rarely used client (e.g., tftp.exe by a user who has never used it before) that is a statistical outlier (e.g., a z-score > 3 on usage frequency) should increase the risk score of the session.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to learn normal sequences of process execution and network activity on administrative hosts. Feed sequences of process creation events and their corresponding network connections into the model. Flag sequences that have a low probability under the learned model, such as cmd.exe -> curl.exe (downloading .bin) -> tftp.exe (uploading to switch), as anomalous."
            ]
          },
          {
            "description": "A file transfer to a network device's management interface that is anomalously large in byte count or occurs outside of a pre-defined maintenance window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, core network traffic sensors.",
            "action": [
              "Symbolic: Define an explicit rule to alert on any file transfer to a network device management IP over ports 21, 22, 69, or 443 with a filename extension of .bin, .img, .swi, .ios, or .tar that occurs outside of a designated weekly maintenance window (e.g., Sunday 2 AM - 6 AM UTC).",
              "Statistical: For each network device, baseline the volume of data transferred (e.g., orig_bytes + resp_bytes in Zeek conn.log) during management sessions. Use a percentile-based threshold (e.g., 99th percentile) to detect anomalously large transfers. A transfer exceeding 1.5 times the interquartile range (IQR) above the third quartile should be flagged for investigation.",
              "Machine Learning: Apply time-series anomaly detection (e.g., Seasonal-Hybrid ESD) to the volume of data transferred to network device management interfaces, aggregated in 15-minute intervals. The model should account for weekly seasonality (maintenance windows). Flag any time-point that is identified as an anomaly and corresponds to a large file transfer as a potential unauthorized image modification."
            ]
          },
          {
            "description": "A management session (e.g., SSH, HTTPS) to a network device from a source IP not on an established allow-list of administrative hosts, which is immediately followed by a large data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, authentication servers, asset inventory database.",
            "action": [
              "Symbolic: Maintain an explicit allow-list of authorized administrative source IPs. Create a rule that triggers an alert when a connection is made to a network device management port (e.g., 22, 443) from any IP not on this list, and the session's transferred bytes in Zeek conn.log exceeds a static threshold (e.g., 10 MB).",
              "Statistical: For each network device, profile the set of source IPs that connect to its management interface. Calculate the rarity of each source IP. A connection from a source IP that has never been seen before or is in the bottom 5th percentile of connection frequency, followed by a file transfer in the top 5th percentile of size, should be flagged as highly suspicious.",
              "Machine Learning: Use unsupervised clustering (e.g., DBSCAN) on session features from Zeek conn.log and ssh.log (source IP, destination IP/port, protocol, bytes transferred, connection duration). Identify clusters of 'normal' administrative activity. Any new session that does not fit into an existing cluster or forms a new, small cluster of its own should be treated as an anomaly and investigated."
            ]
          },
          {
            "description": "A network device exhibits a change in its network behavior profile, such as initiating connections to new external IPs, using different protocols, or listening on new ports, after a suspected image modification event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors monitoring traffic to/from network devices, DNS servers, threat intelligence feeds.",
            "action": [
              "Symbolic: After a potential image modification alert, monitor all traffic from the target device IP. If the device initiates an outbound connection to an external IP found on a threat intelligence blocklist (C2 servers), or if it initiates a DNS query for a domain on a DGA blocklist, escalate to a high-priority incident.",
              "Statistical: For each network device, establish a baseline of its network activity: set of destination ports, protocol distribution (TCP/UDP/ICMP), and JA3/HASSH fingerprints. After a suspected image modification event, compare the device's subsequent activity against this baseline. A statistically significant deviation, such as the appearance of a new listening port or a new JA3 hash (chi-squared test), indicates a potential compromise.",
              "Machine Learning: Implement a time-series model to forecast the expected number of outbound connections and unique destination IPs for each network device. After a suspected modification, feed the device's actual network activity into the model. If the actual activity consistently falls outside the model's prediction interval for a sustained period (e.g., 1 hour), flag the device for anomalous C2-like beaconing behavior."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]