[
  {
    "information_requirement": "Is an adversary using hooking frameworks to evade defenses on corporate mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1617",
        "name": "Hooking",
        "evidence": [
          {
            "description": "A mobile device exhibits signs of compromise associated with rooting or hooking frameworks, such as the presence of known framework files, anomalous network connections to repositories hosting hooking modules, or repeated failures of system integrity checks.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "MDM Device Integrity Scan Logs",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Network egress points for mobile device traffic, Mobile Device Management (MDM) server",
            "action": [
              "Scan MDM Application Inventory Logs for package names, processes, and file paths associated with known mobile hooking and rooting frameworks (e.g., 'de.robv.android.xposed.installer', 'com.topjohnwu.magisk', 'Cydia Substrate'). Alert on any exact match.",
              "From MDM Device Integrity Scan Logs, calculate a baseline failure rate for system integrity checks (e.g., SafetyNet, Knox Attestation) across the entire mobile fleet. Identify individual devices whose daily integrity check failure count exceeds the 99th percentile of the fleet-wide distribution, suggesting persistent tampering.",
              "Develop a logistic regression classification model to predict the likelihood of a device being compromised by a hooking framework. Use features from MDM logs such as 'developer mode enabled', 'number of non-market applications installed', 'frequency of integrity check failures', and features from Zeek logs like 'entropy of DNS queries' and 'volume of outbound data'. Train the model on known clean and compromised device data. Run the model daily against all managed mobile devices to flag high-probability compromised devices for manual investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-10-01",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]