[
  {
    "information_requirement": "Is the adversary collecting and exfiltrating sensitive data from corporate mobile devices via SMS message access? (TA0035 - Collection)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1636.004",
        "name": "SMS Messages",
        "evidence": [
          {
            "description": "A mobile device, associated with an application having SMS read permissions, is observed exfiltrating data to an unusual or known-malicious external destination over the network.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network egress points and VPN concentrators.",
            "action": [
              "Monitor Zeek dns.log for requests originating from mobile device IP ranges to domains present on a threat intelligence feed of known C2 servers. Correlate positive hits with connection logs (conn.log) from the same source IP to confirm data transfer.",
              "For each mobile device, establish a baseline of normal data transfer volume (e.g., `orig_bytes` in conn.log) to external destinations. Flag any device exhibiting a sudden, high-percentile (e.g., >95th) increase in outbound data volume, especially if the destination IP/domain is new for that device or the organization.",
              "Use a time-series forecasting model (e.g., ARIMA) on individual mobile device outbound traffic volume (bytes sent per hour). Trigger an alert when the observed traffic significantly deviates from the forecasted range, indicating potential unscheduled data exfiltration. Enrich features with destination domain entropy and JA3 hashes to improve model accuracy."
            ]
          },
          {
            "description": "A process on a Windows host, associated with a mobile device syncing application, executes a suspicious child process to stage or exfiltrate collected SMS data. This assumes the adversary uses a compromised PC as a hop point for data from the mobile device.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee workstations with mobile device syncing software installed.",
            "action": [
              "Search for process creation events (Windows Event ID 4688) where a known mobile device helper process (e.g., 'phone_sync.exe') spawns a suspicious child process like 'powershell.exe', 'curl.exe', or 'certutil.exe' with command-line arguments indicating network connectivity or file encoding (e.g., '-enc', 'urlcache').",
              "Analyze the command-line arguments for all processes spawned by mobile syncing applications. Calculate the entropy for all command lines. Flag any process creation event where the command-line entropy is in the top percentile (e.g., >98th), as this often indicates obfuscated or encoded commands used for stealthy execution.",
              "Train a classification model (e.g., Random Forest) on features extracted from Windows Event ID 4688 for processes related to mobile device management. Features can include parent process name, child process name, command-line length, and tokenized arguments. The model will classify each process creation event as benign or suspicious, identifying anomalous behavior indicative of data staging."
            ]
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-10-01",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]