[
  {
    "information_requirement": "Is an adversary manipulating data within critical business applications on corporate mobile devices to disrupt operations or decision-making? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1641",
        "name": "Data Manipulation",
        "evidence": [
          {
            "description": "A non-standard or untrusted application is observed accessing the clipboard immediately after a user copies sensitive information from a trusted corporate application (e.g., password manager, email client, financial app).",
            "data_sources": [
              "Mobile EDR/MDM logs (capturing API calls)",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Corporate Wi-Fi and VPN network gateways",
            "action": [
              "Correlate application process names from Mobile EDR logs that access the clipboard against a threat intelligence feed of known malicious mobile application package names or hashes. Generate an alert upon a direct match.",
              "For each mobile application, establish a baseline of normal clipboard access frequency (reads/writes per hour). Calculate the 95th percentile for this frequency. Alert when an application's clipboard access rate exceeds this threshold, especially for applications that do not typically require frequent clipboard interaction.",
              "Use a time-series model to forecast the expected volume of outbound network traffic (e.g., from Zeek conn.log's 'orig_bytes' field) for each mobile device. Monitor for significant anomalies where observed traffic spikes unexpectedly within a short window (e.g., 60 seconds) after a high-sensitivity clipboard access event is logged by the Mobile EDR (e.g., copying data from a password manager or financial app). A concurrent clipboard access and network anomaly indicates potential data manipulation followed by exfiltration."
            ]
          },
          {
            "description": "An application makes unauthorized or unexpected modifications to locally stored data, such as contacts, calendar entries, or data within another application's container.",
            "data_sources": [
              "Mobile EDR/MDM logs (capturing file system and database modifications)",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Application servers receiving mobile data",
            "action": [
              "Search Mobile EDR logs for any process that modifies a database file (e.g., *.db, *.sqlite) outside of its own designated application sandbox, which is a direct indicator of unauthorized data manipulation. Alert on any such cross-application modification.",
              "For critical data stores (e.g., contacts database), calculate the entropy of data fields before and after modification by an application. A significant, anomalous change in entropy (e.g., a drop indicating encryption or a rise indicating random data injection) that deviates more than 3 standard deviations from the historical norm for that application's write activity suggests malicious manipulation.",
              "Train a classification model (e.g., a Random Forest) using features from Mobile EDR logs, such as the modifying process name, target file path, frequency of writes, and size of data written. The model will classify write events as 'benign' or 'malicious manipulation' based on labeled historical data of known good behavior versus simulated attacks. Apply the model in real-time to score and alert on high-probability malicious data modification events."
            ]
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-10-01",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]