[
  {
    "information_requirement": "Is the adversary attempting to disrupt mobile device operations by destroying data? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1662",
        "name": "Data Destruction",
        "evidence": [
          {
            "description": "Execution of commands associated with mass file deletion or application uninstallation on a mobile device, such as 'rm' with recursive flags or 'pm uninstall'.",
            "data_sources": [
              "Mobile Device Command-line Logs",
              "MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (corporate-owned or BYOD enrolled in MDM)",
            "action": [
              "Create a detection rule to alert on the exact string match for `pm uninstall` or `rm -rf` in command-line logs originating from mobile devices.",
              "For each device, establish a baseline of normal application uninstall and file deletion rates over a 30-day rolling window. Generate an alert when the number of uninstalls or file deletions in a 1-hour period exceeds the 99th percentile of that device's historical activity.",
              "Train a one-class SVM (Support Vector Machine) model on features derived from user activity, such as command frequency, command entropy, and time of day. Use the model to classify new command sequences as either normal or anomalous, flagging command bursts with high deletion/uninstallation content as potential data destruction."
            ]
          },
          {
            "description": "Anomalous network communications from a mobile device immediately preceding or following a suspected data destruction event, potentially indicating C2 communication for command delivery or post-action reporting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring mobile device traffic (e.g., corporate Wi-Fi, VPN gateway)",
            "action": [
              "Correlate host-based alerts for T1662 with any concurrent network connections to known malicious domains, IPs, or user-agents in Zeek logs.",
              "Calculate the entropy of requested domain names (from Zeek dns.log) for each mobile device. Alert on devices exhibiting a sudden, statistically significant spike in DNS entropy, which can indicate connections to DGA domains used for C2, often in conjunction with other malicious activities like data destruction.",
              "Use a time-series forecasting model (e.g., ARIMA) on Zeek conn.log data to predict the expected volume of network connections and bytes transferred for each device. An alert is triggered if the actual network activity shows a sudden, unexplained drop-off immediately following a spike, which could correlate with a device being wiped and taken offline."
            ]
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-10-01",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]