[
  {
    "information_requirement": "Has an unauthorized entity accessed or queried process state data from key ICS components? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0801",
        "name": "Monitor Process State",
        "evidence": [
          {
            "description": "A recorded ICS protocol read request (e.g., Modbus Function Code 0x03/0x04, DNP3 Function Code 0x01/0x02, OPC-UA Read/Browse service calls) targeting a Data Historian or PLC from a source IP address or user account not present in an established allow-list. Alternatively, an allow-listed source IP or user account initiating a daily volume of read requests or total data transfer size that exceeds its 99th percentile baseline, calculated over the past 30 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log",
              "Windows Event ID 4624",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data Historian servers (Level 3), Process Control Network (PCN) gateways (Level 3/2), PLC subnets (Level 1/2), HMI/EWS subnets (Level 2.5/2), DMZ between IT and OT networks.",
            "action": "1. Symbolic Logic: Establish and maintain an allow-list (e.g., in a SIEM lookup table) of authorized source IP addresses, user accounts, and their corresponding destination ICS assets (e.g., Historian IP, PLC IP) permitted to communicate over ICS-specific ports (e.g., Modbus 502, DNP3 20000, OPC-UA 4840). Monitor Zeek conn.log for connections to ICS assets on designated ICS ports where the source IP is not present in the allow-list. Parse Zeek modbus.log, Zeek dnp3.log, and Zeek opc.log for ICS protocol read requests (e.g., Modbus Function Code 0x03/0x04, DNP3 Function Code 0x01/0x02, OPC-UA Read/Browse service calls). Generate an alert if a read request originates from a source IP or is associated with a user account not in the established allow-list. Correlate these network alerts with Windows Event ID 4624 (successful logon) and 4663 (object access) on target Historian or PLC servers to identify unauthorized user authentications or access attempts linked to the observed network activity. 2. Statistical Method: For each authorized source IP and user account, baseline the daily total volume of ICS protocol read requests (e.g., total bytes transferred, total number of read function calls) observed in Zeek modbus.log, Zeek dnp3.log, and Zeek opc.log over the past 30 days. Calculate the 99th percentile for these daily volumes for each source. Generate an alert if the current daily volume of read requests or total data transfer size from an allow-listed source IP or user account exceeds its established 99th percentile baseline, indicating an unusual surge in process state data collection. 3. Machine Learning: Train a supervised machine learning model (e.g., Isolation Forest, One-Class SVM) on historical Zeek logs (conn.log, modbus.log, dnp3.log, opc.log) to identify anomalous patterns in ICS protocol read requests. Features for the model should include source IP, destination IP, destination port, ICS function code/service call, data transfer size, time of day, and day of week. The model should learn the 'normal' communication patterns for process state monitoring. Flag any read request session that significantly deviates from learned normal patterns (e.g., high anomaly score, falling outside a defined normal cluster) as suspicious, potentially indicating unauthorized or excessive process state monitoring."
          },
          {
            "description": "A source IP address, typically an HMI or EWS, establishes network connections on ICS-specific ports (e.g., Modbus 502, DNP3 20000, OPC-UA 4840) to a count of unique destination ICS devices (PLCs, RTUs, IEDs) within a 15-minute rolling window that exceeds its 99th percentile historical count. This includes connections to devices outside its documented operational zone or established communication allow-list.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) (Level 2), Human-Machine Interface (HMI) systems (Level 2), Level 2/3 network boundary devices, PLC/RTU subnets (Level 1/2), ICS application servers (Level 2.5).",
            "action": "1. Symbolic Logic: Maintain a dynamic allow-list (e.g., using a configuration management database or SIEM lookup) of known, authorized peer-to-peer communication relationships between ICS hosts (e.g., EWS, HMI, PLCs) and specific ICS assets on ICS-specific ports (e.g., Modbus 502, DNP3 20000, OPC-UA 4840). Monitor Zeek conn.log for new connections where a source IP initiates communication to an ICS device on an ICS port that is not part of its established communication allow-list or documented operational zone. Generate an alert for such unauthorized communication attempts. Upon alert, query Windows Event ID 4688 (process creation) on the source host within a 60-second window preceding the anomalous connection attempt. Look for new or unusual process executions that might indicate the initiation of unauthorized scanning or communication. 2. Statistical Method: For each unique source IP observed in Zeek conn.log (specifically filtering for ICS ports 502, 20000, 4840), calculate the count of unique destination IPs and unique destination ICS ports contacted within a rolling 10-minute window. Establish a 30-day rolling baseline for these counts (unique destination IPs, unique destination ports) for each source IP. Trigger an alert if the current count of unique destination IPs or unique destination ports for a specific source IP exceeds its calculated 99th percentile within the 10-minute window, indicating a sudden and statistically significant expansion of network interaction. 3. Machine Learning: Apply a clustering algorithm (e.g., K-Means, DBSCAN) to historical Zeek conn.log and ICS protocol-specific logs (Zeek modbus.log, Zeek dnp3.log, Zeek opc.log) data for ICS source IPs. Use features such as source IP, destination IP, destination port, ICS function codes/service calls, and connection duration to group hosts by their typical communication profiles. Continuously monitor live data and assign new connection patterns to existing clusters. Flag a host if its current communication pattern significantly deviates from its assigned cluster's centroid (e.g., a host suddenly communicating with devices across multiple clusters it typically doesn't interact with, or showing a high Mahalanobis distance from its cluster center), suggesting a change in behavior indicative of reconnaissance or widespread data collection."
          },
          {
            "description": "A successful remote interactive login (RDP, SSH, console) to a critical ICS host (HMI, EWS, Data Historian) where the source IP's geolocation is outside an approved region, the login occurs outside defined operational hours, or the user account has no prior history of interactive logins to that specific host. This login is followed within 5 minutes by multiple outbound ICS protocol communications (e.g., Modbus FC 0x03/0x04, DNP3 FC 0x01/0x02, OPC-UA Read/Browse) from the logged-in host to different Level 1/2 ICS devices.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs) (Level 2), Engineering Workstations (EWS) (Level 2), ICS Application Servers (Level 2.5), Jump Servers (Level 3/2.5), Active Directory Domain Controllers (Level 3).",
            "action": "1. Symbolic Logic: Establish an allow-list (e.g., in SIEM lookup tables) of authorized source IP ranges, user accounts, and typical logon times/days for remote interactive logons (Windows Event ID 4624, Logon Type 10 for RDP, 7 for Unlock, or 2 for Interactive Console; Zeek rdp.log for RDP activity) to critical ICS hosts. Generate an alert for any successful remote logon (Windows Event ID 4624, Logon Type 10/7/2) from a source IP with a geolocation outside the approved regional boundary, occurring outside defined operational hours (e.g., 07:00-18:00 M-F), or using an account that has no prior interactive logon history to that specific host within the last 90 days. Upon such an alert, immediately query Zeek conn.log and protocol-specific logs (e.g., modbus.log, dnp3.log, opc.log) for any outbound connections from the affected ICS host to Level 1/2 devices on ICS ports within a 5-minute window post-login. Flag if multiple unique Level 1/2 devices are contacted with ICS protocol read requests following the anomalous logon. 2. Statistical Method: For each critical ICS host, baseline the frequency and average duration of remote interactive logon sessions (Windows Event ID 4624, Logon Type 10) over the past 30 days. Concurrently, baseline the volume of subsequent ICS protocol traffic (total unique destination devices, total data transfer volume) observed in Zeek conn.log and protocol-specific logs (modbus.log, dnp3.log, opc.log) to Level 1/2 devices within a 5-minute post-login window. Calculate the 99th percentile for these metrics (logon frequency, logon duration, unique devices contacted, data volume). Trigger an alert if an interactive logon session, especially one from a source IP or user account with a historically low frequency (e.g., below 5th percentile), is immediately followed by ICS traffic to Level 1/2 devices that exceeds its 99th percentile in terms of unique destination devices contacted or total data transfer volume within that 5-minute window. 3. Machine Learning: Train a supervised classification model (e.g., Random Forest, Gradient Boosting) to classify remote logon sessions on critical ICS hosts as 'normal' or 'anomalous'. Features for the model should include: source IP entropy, time of day, day of week, user account logon history (e.g., last_login_time, login_frequency for that specific host), source IP geolocation (country, ASN), and the number of prior successful logins from that source IP. If a logon is classified as anomalous, then apply a sequential pattern mining algorithm (e.g., GSP, PrefixSpan) to Zeek conn.log and ICS protocol logs (modbus.log, dnp3.log, opc.log) to identify common sequences of events post-login on that host. Flag any sequence that includes connections to a statistically significant high number of unique Level 1/2 devices or a high volume of ICS protocol read requests as suspicious process state monitoring activity, comparing against learned normal sequences."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]