[
  {
    "information_requirement": "Is the adversary attempting to inhibit or disable safety and protection functions? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0800",
        "name": "Activate Firmware Update Mode",
        "evidence": [
          {
            "description": "Successful execution of a vendor-specific firmware update utility or a general-purpose scripting engine (e.g., PowerShell, cmd.exe) on an Engineering Workstation (EWS), identified by Windows Event ID 4688 (Process Creation), where the command-line arguments contain keywords or parameters explicitly designed to initiate a firmware update, maintenance mode activation, or device reset for a specific ICS device (e.g., PLC, RTU, protection relay). This execution is then followed by network activity observed in Zeek logs (e.g., conn.log, ftp.log, http.log, tftp.log) showing: 1) a sudden, anomalous increase in bytes transferred or connection count from the EWS to the ICS device, particularly over common firmware update ports (e.g., TCP 21, 23, 69, 80, 443, or vendor-specific ports); or 2) a subsequent, sustained reduction (e.g., >60 seconds) in the ICS device's normal periodic operational communications (e.g., heartbeats, polling responses, process values).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek ftp.log",
              "Zeek http.log",
              "Zeek tftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and Jump Servers within the Operational Technology (OT) network segment (Purdue Level 3.5/4), and the network egress points of these segments.",
            "action": "1. Symbolic Logic (SIEM Query): Query Windows Event ID 4688 logs from EWS for Process_Name matching powershell.exe, cmd.exe, wscript.exe, or known vendor-specific firmware update executables (e.g., Siemens_TIA_Portal.exe, Rockwell_FactoryTalk.exe, Schneider_UnityPro.exe, ABB_Relay_Configurator.exe). Within these events, search Command_Line for keywords (case-insensitive) like 'firmware', 'update', 'flash', 'reset', 'maintenance mode', 'device mode', '/F', '/M', '/U', '/R', or specific IP addresses/hostnames of critical ICS devices (e.g., 192.168.1.10, PLC-001). Trigger a high-priority alert if such a command is executed on an EWS outside of documented maintenance windows or by a user account not authorized for firmware operations on that specific device. Additionally, correlate with Zeek logs (conn.log, ftp.log, http.log, tftp.log) for immediate (within 10 seconds) detection of data transfer (e.g., bytes_orig > 1MB) from the EWS to the target ICS device on common firmware ports (e.g., TCP 21, 23, 69, 80, 443) or vendor-specific management ports.\n2. Statistical Method (Baseline & Anomaly): For each EWS, establish a 30-day baseline of Windows Event ID 4688 Command_Line values for the identified processes. Calculate the frequency of unique command-line argument tokens. Identify command lines that have a Levenshtein distance greater than 5 from any previously observed benign command line for that process on that EWS. Additionally, calculate the daily average and standard deviation for the count of Windows Event ID 4688 events containing firmware-related keywords on each EWS. Alert if the daily count exceeds the average by 3 standard deviations, indicating an unusual surge in potential firmware activity. Further, if such an anomaly is detected, immediately analyze Zeek conn.log for the target ICS device's communication volume (bytes_orig, bytes_resp) and connection count. Trigger a secondary alert if these metrics show a sudden surge (e.g., >95th percentile of hourly baseline) or a sustained drop (e.g., <5th percentile of hourly baseline for 5 minutes) within 60 seconds of the host-based anomaly, especially on known firmware update ports.\n3. Machine Learning (Correlation & Anomaly Detection): Develop a supervised machine learning model (e.g., Random Forest Classifier) trained on historical Windows Event ID 4688 data (features: Process_Name, Command_Line keyword presence, User_Account, Logon_Time) and correlated Zeek conn.log data (features: Source_IP, Destination_IP, Destination_Port, Protocol, Bytes_Transferred, Duration). The model should classify process executions as 'Normal Firmware Operation', 'Scheduled Maintenance', or 'Anomalous/Suspicious'. Additionally, apply a time-series anomaly detection algorithm (e.g., Isolation Forest or Prophet) to the rate of Zeek conn.log events from EWS to critical ICS devices on common management ports (e.g., TCP 502, TCP 20000, TCP 44818). Alert when the model flags a process execution as 'Anomalous/Suspicious', especially when combined with a sudden, significant increase (e.g., >95th percentile) in network traffic volume or connection count to an ICS device on these ports, relative to its established hourly baseline."
          },
          {
            "description": "Observation of specific ICS protocol commands (e.g., Modbus function code 0x17 (Read/Write Multiple Registers) with specific register addresses for mode changes, DNP3 function code 0xD (Device Restart) with specific object/variation for cold/warm restart, EtherNet/IP 'Set Attribute Single' service (0x10)) in Zeek modbus.log, dnp3.log, or enip.log from an unauthorized source or outside of maintenance windows, directed at a critical ICS device. This command is then followed by a measurable and sustained (e.g., >60 seconds) reduction or complete cessation of the device's normal periodic operational communications (e.g., heartbeats, polling responses, process values), as observed in Zeek conn.log and relevant ICS protocol logs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control network segments (Purdue Level 1 & 2) where PLCs, RTUs, and protection relays reside, and network monitoring points at the boundary of these segments (e.g., span ports on Level 1/2 switches, network taps).",
            "action": "1. Symbolic Logic (SIEM Query): Search Zeek modbus.log, dnp3.log, and enip.log for events targeting critical ICS devices. Specifically, look for: \n    *   modbus.log: function_code 0x17 (Read/Write Multiple Registers) targeting known firmware/mode change register addresses (e.g., register_address = 40001, register_value = 0x01).\n    *   dnp3.log: function_code 0xD (Device Restart) with object_group and variation indicating cold/warm restart or firmware-related operations.\n    *   enip.log: service 0x10 (Set Attribute Single) to a specific class_id, instance_id, and attribute_id associated with device mode changes or firmware updates.\nTrigger a high-priority alert if these commands are observed originating from a source_ip not on the authorized management IP whitelist for that device, or if they occur outside of documented maintenance windows.\n2. Statistical Method (Baseline & Deviation): For each critical ICS device, establish a 7-day rolling baseline for its normal operational communication patterns using Zeek conn.log (e.g., bytes_orig, bytes_resp, duration, connection_count) and relevant ICS protocol logs (e.g., modbus_read_count, dnp3_response_rate). Calculate the moving average and standard deviation for these metrics, and also the inter-arrival time of periodic heartbeat/status messages. Trigger an alert if, within 60 seconds after a suspicious command identified in step 1, the following conditions are met:\n    *   The connection_count or bytes_resp from the ICS device drops below the 5th percentile of its hourly baseline.\n    *   The inter-arrival time of expected periodic messages exceeds the 99th percentile of its baseline for at least three consecutive messages.\n3. Machine Learning (Multivariate Anomaly Detection): Implement a multivariate time-series anomaly detection model (e.g., Isolation Forest, Autoencoder, or Gaussian Mixture Model) for each critical ICS device. The model should ingest aggregated features from Zeek conn.log (e.g., connection_count, bytes_orig, bytes_resp, duration_avg) and specific ICS protocol logs (e.g., modbus.log:function_code_distribution, dnp3.log:object_group_frequency). Train the model on 30 days of benign operational data. Trigger a high-priority alert when the model's anomaly score for an ICS device exceeds a dynamically calculated threshold (e.g., 99th percentile of historical anomaly scores), indicating a significant deviation in its communication profile consistent with an inactive or maintenance state, particularly if this deviation immediately follows a command identified in step 1."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]