[
  {
    "information_requirement": "Is an adversary attempting to impair our process control by manipulating I/O points? (PIR)",
    "tactic_id": "TA0106",
    "tactic_name": "Impair Process Control",
    "indicators": [
      {
        "technique_id": "T0806",
        "name": "Brute Force I-O",
        "evidence": [
          {
            "description": "An observable surge in Modbus/DNP3/S7comm write commands (Zeek modbus.log:func, dnp3.log:func, s7comm.log:func indicating 'write' operations) from a single source IP (Zeek:id.orig_h) targeting a single I/O address (Zeek:addr) on a specific PLC (Zeek:id.resp_h), where the write frequency exceeds both a dynamic 99th percentile baseline and a 3-sigma upper control limit (UCL) established over the preceding 30 days. This anomalous write activity originates from either an IP address not present in the authorized PLC write source whitelist, or from an HMI/EWS where no authorized control application process (e.g., SCADA client, historian client) was actively running (Windows Event ID 4688, process creation) within the 5-minute window surrounding the write surge.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), and Programmable Logic Controllers (PLCs)",
            "action": "1. Statistical (Frequency Anomaly Detection): For each unique (Zeek:id.orig_h, Zeek:id.resp_h, Zeek:addr) tuple from Modbus/DNP3/S7comm write commands (Zeek:func field indicating 'write' or equivalent), calculate the 1-minute write command frequency. Establish a 30-day rolling baseline for each tuple's frequency. Alert if the current 1-minute frequency exceeds both the 99th percentile AND the 3-sigma upper control limit (UCL) of its baseline. This can be implemented using SIEM aggregation and statistical functions. 2. Symbolic Logic (Unauthorized Source/Process Correlation): Upon detection of a frequency anomaly (from Action 1), correlate the source IP (Zeek:id.orig_h) with an authorized IP whitelist for PLC write operations. If the source IP is not whitelisted, flag as unauthorized. Additionally, if the source IP is an HMI/EWS, query Windows Event ID 4688 (Process Creation) for the 5-minute window around the anomaly. Identify if a known, authorized control application (e.g., SCADA.exe, HistorianClient.exe) was active. Flag if no authorized process is found or if an unauthorized process initiated the write connection. 3. Machine Learning (Time Series Anomaly Detection): Develop a time-series anomaly detection model (e.g., Prophet, Isolation Forest) for the '1-minute write command frequency' of critical (source IP, destination PLC IP, I/O address) tuples. Train the model on 90 days of historical Zeek logs to learn normal patterns. Generate an alert when the model detects a statistically significant deviation from the learned normal pattern, indicating an unusual surge. The model should output an anomaly score, triggering an alert if it exceeds a predefined threshold (e.g., top 1% anomaly score)."
          },
          {
            "description": "A single source IP (Zeek:id.orig_h) initiates multiple Modbus/DNP3/S7comm write commands (Zeek:func indicating 'write') targeting I/O addresses (Zeek:addr) on a specific PLC (Zeek:id.resp_h). This activity manifests as either: a) A sequence of I/O addresses exhibiting clear linear (e.g., addr, addr+1, addr+2) or arithmetic progression (e.g., addr, addr+k, addr+2k) within a 30-second window, or b) More than 75% of targeted I/O addresses within a 30-second window are identified as unassigned or invalid based on a known-good PLC configuration, or c) A sudden, sustained increase in the Shannon entropy of targeted I/O addresses by more than 2 standard deviations from its 30-day baseline within a 5-minute sliding window.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Programmable Logic Controllers (PLCs), and ICS field devices",
            "action": "1. Symbolic Logic (Sequential/Invalid Address Targeting): For each source IP (Zeek:id.orig_h), group Modbus/DNP3/S7comm write commands by 30-second sliding windows. Within each window, extract the sequence of I/O addresses (Zeek:addr). Identify if the sequence exhibits linear (e.g., N, N+1, N+2) or arithmetic progression (e.g., N, N+k, N+2k). Concurrently, compare all targeted `addr` values against a pre-configured whitelist of valid I/O points for the destination PLC. Alert if a sequential pattern is detected OR if more than 75% of targeted addresses are invalid/unassigned for that PLC within the window. 2. Statistical Method (Entropy Anomaly): For each source IP (Zeek:id.orig_h), calculate the Shannon entropy of the `addr` field for Modbus/DNP3/S7comm write commands over a 5-minute sliding window. Establish a 30-day rolling baseline for these entropy values. Alert if the current entropy value deviates by more than 2 standard deviations from its baseline, specifically looking for sudden increases (indicating broad scanning) or rapid shifts from low to high entropy followed by a sharp decrease (indicating focused targeting after scanning). This can be calculated using SIEM statistical functions. 3. Machine Learning (Sequence Anomaly Detection): Develop and train a sequence modeling algorithm (e.g., Hidden Markov Model, LSTM) on historical sequences of I/O write command addresses (Zeek:addr) for each PLC. The model should learn normal I/O address traversal patterns. Flag any new sequence of I/O writes that significantly deviates from these learned normal patterns, outputting an anomaly score. Generate an alert if the score exceeds a predefined threshold (e.g., 95th percentile of anomaly scores)."
          },
          {
            "description": "A specific I/O point (Zeek:addr) on a PLC (Zeek:id.resp_h) experiences rapid state changes or 'toggling' (e.g., a discrete output value changing from 0 to 1 and back to 0, or a numerical value oscillating beyond a defined deadband) due to Modbus/DNP3/S7comm write commands (Zeek:func indicating 'write') from a source IP (Zeek:id.orig_h). The frequency of these toggles exceeds a predefined engineering safe operating limit (e.g., >10 discrete state changes per minute). This anomalous toggling is either sourced from an IP not present in the authorized PLC write source whitelist, or correlates with a successful logon event (Windows Event ID 4624) on an HMI/EWS exhibiting at least two simultaneous anomalous characteristics: originating from a geographically rare location for that user/device, occurring outside of typical working hours, or involving a user account with no historical interaction with that specific I/O point.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network segments, Programmable Logic Controllers (PLCs), and critical field devices (e.g., actuators, valves)",
            "action": "1. Statistical (Toggle Frequency Anomaly): For each unique (Zeek:id.resp_h, Zeek:addr) tuple representing a critical I/O point, monitor Modbus/DNP3/S7comm write commands that cause a discrete state change (e.g., 0 to 1, 1 to 0) or significant value oscillation. Calculate the 'toggle frequency' (state changes/minute). Alert if this frequency exceeds a predefined engineering safe operating limit (e.g., >10 toggles/minute for a valve) or exceeds a 30-day rolling baseline by more than 150%. This can be implemented in a SIEM using aggregation and thresholding. 2. Symbolic Logic (Anomalous Authentication/Source Correlation): Upon detection of a toggle frequency anomaly (from Action 1), correlate the source IP (Zeek:id.orig_h) with an authorized IP whitelist for PLC write operations. If not whitelisted, flag as unauthorized. Additionally, if the source IP is an HMI/EWS, query Windows Event ID 4624 (Successful Logon) for the 5-minute window around the anomaly. Identify if the logon session exhibits two or more anomalous characteristics: source IP geolocation is rare for the user, logon occurred outside normal working hours, or the user account has no historical interaction with that specific I/O point (based on 90-day Zeek logs). 3. Machine Learning (Behavioral Anomaly Detection for I/O Toggling): Develop and train a behavioral anomaly detection model (e.g., Isolation Forest, Autoencoder) on historical sequences of I/O point values and their transitions (value changes) from Zeek logs for critical I/O points. The model should learn normal 'value change' behavior and transition frequencies. Generate an alert when the model detects a sequence of rapid toggles or state changes that significantly deviates from learned normal patterns, outputting an anomaly score. Trigger an alert if the score exceeds the 99th percentile of normal anomaly scores."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]