[
  {
    "information_requirement": "Is an adversary collecting data from our ICS information repositories? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0811",
        "name": "Data from Information Repositories",
        "evidence": [
          {
            "description": "Detection of a single user account (TargetUserName from Windows Event ID 5145) or source host (id.orig_h from Zeek smb_files.log) accessing more than 50 unique files (RelativeTargetName from Windows Event ID 5145 or filename from Zeek smb_files.log) within a 15-minute window from ICS-related network shares or Document Management Systems. Also, any access to files where the filename or metadata (RelativeTargetName/ShareName from Event ID 5145, filename/fuid from smb_files.log) contains keywords such as 'SCADA_Schematic', 'PLC_Configuration', 'HMI_Layout', 'RTU_Manual', 'P&ID_Drawing', or 'Historian_Backup'.",
            "data_sources": [
              "Zeek smb_files.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Engineering Workstations, Document Management Systems (DMS), and SharePoint/Confluence instances hosting ICS documentation.",
            "action": "1. Symbolic Logic: For each NAI, monitor Windows Event ID 5145 ('A share object was checked for a client access') and Zeek smb_files.log ('file_open', 'file_read' events). Generate an alert if the 'RelativeTargetName' or 'ShareName' in Event ID 5145, or the 'filename' in Zeek smb_files.log, contains any of the following case-insensitive keywords: 'SCADA_Schematic', 'PLC_Configuration', 'HMI_Layout', 'RTU_Manual', 'P&ID_Drawing', 'Historian_Backup', 'IO_List', 'Network_Diagram'. Additionally, verify that the 'TargetUserName' (Event ID 5145) or the 'user' field (smb_files.log) is NOT a member of an approved Active Directory security group for accessing ICS documentation, such as 'ICS_Doc_Viewers_Allowlist'. 2. Statistical Method: For each unique source host (identified by 'id.orig_h' from Zeek smb_files.log or 'Source_IP' from Windows Event ID 5145), calculate the count of unique file paths accessed (based on 'filename' from Zeek smb_files.log or 'RelativeTargetName' from Windows Event ID 5145) within rolling 15-minute windows. Establish a 30-day rolling baseline for each host, tracking the mean and standard deviation of unique file accesses per 15 minutes. Generate a high-priority alert if a host's current unique file access count within any 15-minute window exceeds its established mean by 3 standard deviations, or if it falls above the 99th percentile of unique file access counts observed across all hosts on the NAI during that same time period. 3. Machine Learning: Implement a User and Entity Behavior Analytics (UEBA) model that ingests Zeek smb_files.log and Windows Event ID 5145 data from NAIs. Train the model using historical data to learn normal patterns of file access by user and host, considering features such as: 'TargetUserName'/'user', 'Source_IP'/'id.orig_h', 'ShareName', 'RelativeTargetName'/'filename', 'file_size', 'access_time', and 'file_type'. The model should identify anomalous access patterns (e.g., a user suddenly accessing a large number of files from previously untouched directories or file types, or accessing files outside of their typical working hours). Generate an alert for any user or host activity that results in an anomaly score exceeding the 99th percentile of all observed scores, indicating a high deviation from learned normal behavior."
          },
          {
            "description": "Outbound data transfer from known ICS information repositories (e.g., Historian Servers, Control System Databases, ICS File Servers) exceeding 100MB in a single network session (resp_bytes from Zeek conn.log) or accumulating more than 500MB from a single source host within a 1-hour window to any destination IP address outside of the defined ICS network segment or to known external cloud storage/file-sharing domains (e.g., Google Drive, Dropbox, OneDrive), utilizing common data transfer protocols (e.g., SMB, MSSQL, HTTP/S, FTP, SCP).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek ftp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historian Servers, Control System Databases (SQL, Oracle), ICS File Servers, and Engineering Workstations acting as data aggregation points.",
            "action": "1. Statistical Method: From Zeek conn.log, identify outbound connections from NAIs. For each unique NAI source IP ('id.orig_h'), establish a 30-day rolling baseline of the mean and 99th percentile for 'resp_bytes' per connection and total 'resp_bytes' per hour. Generate an alert if: 1) a single connection's 'resp_bytes' exceeds 100MB AND is above the 99th percentile for that NAI host, OR 2) the aggregate 'resp_bytes' from a single NAI host to a single destination IP ('id.resp_h') within a 1-hour window exceeds 500MB AND is 3 standard deviations above the NAI host's average hourly outbound transfer. Exclude traffic to explicitly allowlisted internal ICS network segments. 2. Symbolic Logic: Monitor Zeek conn.log for outbound connections from NAIs where 'resp_bytes' > 0. Generate an immediate alert if the destination IP ('id.resp_h') is present in a high-confidence threat intelligence feed (e.g., CISA AIS, commercial C2 feeds). Additionally, correlate 'id.resp_h' with Zeek dns.log and Zeek http.log/ssl.log to identify connections to domains associated with common cloud storage or file-sharing services (e.g., 'drive.google.com', 'dropbox.com', 'onedrive.live.com') that are not explicitly allowlisted for ICS assets. Consider 'resp_bytes' > 0 as a trigger for these connections. 3. Machine Learning: Deploy a time-series anomaly detection model (e.g., ARIMA, Prophet, or an LSTM-based model) on the aggregated 'resp_bytes' (outbound data volume) from Zeek conn.log, segmented by NAI source IP ('id.orig_h') and destination ('id.resp_h'). Train the model on at least 90 days of historical data to learn daily, weekly, and monthly patterns of data transfer. Generate an alert when the predicted 'resp_bytes' deviates from the actual observed 'resp_bytes' by more than 3 standard deviations, or if the model's anomaly score for a given time window (e.g., 1-hour interval) exceeds the 99th percentile, indicating an unusual surge in outbound data volume."
          },
          {
            "description": "Successful interactive (Logon Type 2), network (Logon Type 3), or remote interactive (Logon Type 10) logon (Windows Event ID 4624) to a critical ICS repository host (e.g., Engineering Workstation, Historian Server) by a user account not belonging to an authorized Active Directory group (e.g., 'ICS_Engineers', 'ICS_Admins'). Additionally, any successful logon by a valid account exhibiting multiple anomalous characteristics simultaneously, such as originating from a rare geographic location (derived from Source_IP via Zeek conn.log), using an unfamiliar device ('WorkstationName'), or occurring outside of established normal working hours.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Historian Servers, Domain Controllers, and Jump Servers within the ICS network segment.",
            "action": "1. Symbolic Logic: On NAI hosts, monitor Windows Event ID 4624 (Successful Logon). Generate a high-priority alert for any successful logon where the 'TargetUserName' is NOT a member of explicitly authorized Active Directory groups (e.g., 'ICS_Engineers_Group', 'ICS_Admins_Group') for accessing these systems. Additionally, alert on successful logons with 'LogonType' 4 (Batch), 5 (Service), or 6 (Unlock) if they are not explicitly allowlisted for specific service accounts or scheduled tasks on the target system ('TargetServerName'). 2. Statistical Method: For each unique 'TargetUserName' observed in Windows Event ID 4624 on NAI hosts, establish a 90-day rolling baseline of: 1) typical login times (mean and standard deviation of 'Event.System.TimeCreated'), 2) common source IP geolocations (derived from 'Source_IP' in Event ID 4624, enriched via external GeoIP database lookups using 'id.orig_h' from Zeek conn.log), and 3) frequently used source 'WorkstationName's. For each new logon, calculate a deviation score based on: a) login time outside 2 standard deviations from the user's mean, b) source IP geolocation from a country not observed for that user in the last 90 days, and c) 'WorkstationName' not seen for that user in the last 30 days. Assign weighted points to each deviation (e.g., 2 points for time, 3 for location, 2 for device). Trigger an alert if a single logon's cumulative deviation score exceeds a predefined threshold (e.g., 5 points), or if a user's cumulative score within a 1-hour window exceeds the 99th percentile of all user scores. 3. Machine Learning: Develop a supervised classification model (e.g., Gradient Boosting, Random Forest) trained on historical Windows Event ID 4624 data from NAIs, with expert-labeled 'legitimate' and 'suspicious' logon events. Feature engineering should include: 'TargetUserName', 'LogonType', 'Source_IP', 'WorkstationName', 'LogonProcessName', 'AuthenticationPackage', time-of-day, day-of-week, and derived features such as 'is_first_seen_workstation', 'is_first_seen_country' (from Zeek conn.log geo-enrichment), and 'is_member_of_admin_group'. The model will predict the likelihood of a new logon being 'anomalous'. Generate an alert for any logon event classified as 'anomalous' with a prediction probability above 0.8 (or a similar high confidence threshold), indicating a high probability of a suspicious login."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]