[
  {
    "information_requirement": "Is an adversary using default credentials for lateral movement within the OT network? (TA0109 - Lateral Movement)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0812",
        "name": "Default Credentials",
        "evidence": [
          {
            "description": "A successful network connection (Zeek conn.log proto=TCP, state='ESTABLISHED') to a critical ICS device (e.g., PLC, RTU, HMI) on a management port (e.g., 21, 23, 80, 443, 502, 102, 20000, 44818) is observed. This connection is immediately followed by a successful authentication (Zeek ssh.log, ftp.log, telnet.log) using a common default username (e.g., 'admin', 'root', 'operator', 'user') or a known weak/default password. The source IP address is either new to the ICS device, belongs to an unauthorized network segment, or the connection characteristics (duration, byte volume) significantly deviate from established baselines for that device and port.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek ftp.log",
              "Zeek telnet.log",
              "Zeek modbus.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Level 1 (Process Control) and Level 2 (Supervisory Control) Control Systems Networks (PLCs, RTUs, HMIs, IEDs), DMZ between IT and OT networks (Purdue Model Level 3.5), Network segments connecting IT and OT zones, Engineering Workstations (EWS) directly connected to Level 2/1 devices, SCADA Servers, Historian Servers, Data Gateways.",
            "action": "1. Symbolic Logic: Identify successful network connections (Zeek conn.log: proto=TCP, state='ESTABLISHED') to critical ICS devices (e.g., PLCs, RTUs) on management ports. Correlate these connections with successful authentication events (Zeek ssh.log, ftp.log, telnet.log: success field is true) that use a username from a pre-defined list of common default credentials (e.g., 'admin', 'root', 'operator', 'user', 'guest', 'engineer', 'maintenance') or where the password field (if available and not hashed) matches known default values. Trigger an alert for any successful login using a default credential username, especially if the source IP is not on an approved access whitelist for the target ICS device, or if the source IP has no prior successful connection history to that specific ICS device. 2. Statistical Method: Establish a 30-day baseline for each unique ICS device and management port pair, tracking metrics from Zeek conn.log and authentication logs (ssh.log, ftp.log, telnet.log). Metrics include: count of distinct source IPs, average connection duration, total byte volume, and the ratio of successful to failed authentication attempts. Calculate the 95th and 99th percentiles for these metrics. Generate an alert if any of the following occur: a) The number of distinct source IPs attempting authentication to an ICS device exceeds the 99th percentile of its historical baseline, especially if one of these IPs subsequently achieves a successful login with a default username. b) A sudden increase (e.g., 3 standard deviations above the mean) in authentication failures followed by a successful login using a username from the default credentials list. c) A single source IP successfully authenticates with a default username to more than 3 distinct ICS devices within a 5-minute window, indicating potential lateral movement with default credentials. 3. Machine Learning: Implement an unsupervised anomaly detection model (e.g., Isolation Forest, One-Class SVM) on aggregated Zeek conn.log and authentication logs (ssh.log, ftp.log, telnet.log) for ICS devices. Key features for the model should include: source IP, destination IP, destination port, protocol, connection duration, byte volume, number of authentication attempts (successful/failed), and the presence of usernames from a known default credentials list. The model should learn normal connection and authentication patterns. Alert on sequences or clusters of events with high anomaly scores, particularly those involving new source IPs, attempts with common default usernames, or successful logins with default credentials followed by rapid lateral connections to other ICS assets. Prioritize anomalies where a successful login with a default username is detected from an IP that has not previously authenticated to that device."
          },
          {
            "description": "A successful user login (Windows Event ID 4624) on an Engineering Workstation (EWS) or Jump Server, where the user account is known to use or has recently used default credentials, is immediately followed (within 60 seconds) by the creation of a remote access or file transfer process (Windows Event ID 4688, e.g., `putty.exe`, `ssh.exe`, `telnet.exe`, `ftp.exe`, `winscp.exe`, `mstsc.exe`, `psexec.exe`, `net.exe use`). This process then initiates an outbound network connection (Zeek conn.log proto=TCP, state='ESTABLISHED') from the EWS to an ICS device (e.g., PLC, RTU, HMI) on a management port. This entire sequence of login, process creation, and network connection is anomalous for the user (e.g., occurring outside typical working hours, from an unusual source IP, or targeting an ICS device not typically accessed by that user).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek ftp.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Jump Servers accessing OT network, Historian Servers, SCADA Servers, Application Servers within the OT network, IT/OT DMZ gateways.",
            "action": "1. Symbolic Logic: Correlate successful user logons (Windows Event ID 4624) on EWS or Jump Servers with subsequent process creation events (Windows Event ID 4688) for remote access/transfer tools (e.g., `ssh.exe`, `ftp.exe`, `mstsc.exe`, `psexec.exe`) within a 60-second window, matching the Logon_ID. Further correlate these with successful outbound network connections (Zeek conn.log: proto=TCP, state='ESTABLISHED') from the EWS to known ICS device IPs on management ports. Trigger an alert if the user account involved in the initial successful logon is identified as a default or shared account, or if the account has a known default password, especially when this sequence targets an ICS device not typically accessed by that user or occurs outside of established working hours. 2. Statistical Method: For each user account on EWS or Jump Servers, establish a 60-day behavioral baseline using Windows Event IDs 4624, 4688, and Zeek conn.log. Baseline features include: typical login times (hour of day, day of week), originating source IPs, frequency and type of remote access processes launched, and the specific ICS devices accessed. Calculate a composite deviation score (e.g., sum of Z-scores or Mahalanobis distance) for each user activity sequence against their baseline. Generate an alert for sequences where this score exceeds the 99th percentile, particularly if the involved user account is a default or shared credential account, or if the sequence includes a login from an uncharacteristic IP or at an unusual time, followed by access to multiple new ICS devices. 3. Machine Learning: Train a User and Entity Behavior Analytics (UEBA) model (e.g., a sequence-based recurrent neural network like LSTM or a Transformer model) on historical Windows Event IDs (4624, 4688) and Zeek conn.log data from EWS and Jump Servers. Features for the model should include: user ID, login time, process name, destination IP/port, connection duration, and a flag indicating if the user account is a known default or shared credential. The model should learn normal sequences of user login, process execution, and network connections to ICS devices. Alert on sequences with high anomaly scores that are new, rare, or exhibit patterns indicative of default credential exploitation, such as a default account logging in from an unusual location and then rapidly accessing multiple ICS devices it has never interacted with before."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]