[
  {
    "information_requirement": "Has an adversary's action resulted in a disruption of critical industrial processes, leading to a measurable loss of productivity or revenue?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0836",
        "name": "Modify Parameter",
        "evidence": [
          {
            "description": "A write operation targeting a critical control system parameter (e.g., a Modbus holding register for a temperature setpoint, a DNP3 analog output point for a valve position, an EtherNet/IP explicit message for pump speed) is observed in Zeek ICS protocol logs (modbus.log, dnp3.log, enip.log). The new parameter value falls outside of the documented operational safety limits (e.g., less than minimum_safe_value or greater than maximum_safe_value as specified in the Process Control Domain Network Architecture document or P&ID diagrams), or deviates by more than 20% from its 7-day rolling average, AND the source of the write operation is an unauthorized IP address or user account (not found in the approved operator/engineer whitelist linked to Windows Event ID 4624 on HMI/EWS), OR the write occurs outside of scheduled maintenance windows without an corresponding entry in the change management system logs.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control Network (Purdue Model Level 1/2) segments monitoring PLC, RTU, and HMI communications; Engineering Workstations (EWS) and Operator Stations (HMI) for host-based activity logs; Historian Servers and Process Data Archives for process data integrity and historical context; Authentication Servers for user credential validation.",
            "action": "1. (Symbolic Logic) Identify specific write function codes/messages in Zeek modbus.log, dnp3.log, and enip.log targeting known critical process parameters (e.g., pump speed, valve position, temperature setpoint). Maintain an up-to-date whitelist of authorized source IPs (e.g., specific EWS, HMI) and user accounts (correlating with successful logins in Windows Event ID 4624 on EWS/HMI) permitted to initiate these write operations. Generate an alert for any critical parameter write command originating from a source IP or user account not present on the whitelist, or if the written value is explicitly outside documented hard-coded safety limits. 2. (Statistical Method) For each critical parameter, calculate its historical 5th to 95th percentile operating range and its average modification frequency over a 30-day period from relevant Zeek ICS protocol logs. Trigger an alert if a parameter value is written outside this established percentile range, or if the number of write operations for a specific parameter exceeds 3 standard deviations from its historical 30-day average within a 5-minute rolling window. Also, calculate the moving average and standard deviation of parameter values over 7 days, and alert if a new write deviates more than 20% from the 7-day moving average. 3. (Machine Learning) Apply a supervised classification model (e.g., Random Forest or SVM) trained on historical 'normal' ICS parameter value changes and write operations from Zeek logs, enriched with user login data (Windows Event ID 4624) and process creation data (Windows Event ID 4688) from EWS. The model should classify incoming parameter write events as 'normal' or 'anomalous'. Generate an alert when a write operation is classified as anomalous, especially when correlated with unusual process creation or user activity on associated EWS. Prioritize alerts that also lack a corresponding entry in a change management system log."
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "A critical ICS device (e.g., PLC, RTU, HMI, Historian server) exhibits a sustained increase in network latency (average RTT in Zeek conn.log to the device increases by >100ms or by >50% compared to its 7-day average over a 5-minute window), OR experiences a dramatic increase in connection failures (e.g., >20% of new connections in Zeek conn.log show 'S0', 'S1', or 'REJ' states over a 1-minute window targeting the device), OR receives an unusually high volume of ingress network traffic (>500 packets/second or >100 Mbps for 30 seconds from a single source IP not on the approved whitelist, observed in Zeek conn.log/tcp.log/udp.log), particularly with an elevated rate of failed connection attempts (e.g., >50 SYN packets/second to a single target IP in Zeek tcp.log). This network anomaly is correlated with a lack of expected process data updates in Historian logs or a sustained 'communication loss' alarm on an associated HMI, indicating a disruption to normal operations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek tcp.log",
              "Zeek udp.log",
              "Zeek icmp.log",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control Network (Purdue Model Level 1/2) segments for network traffic monitoring of critical ICS devices (PLCs, RTUs, HMIs); ICS Supervisory Network (Purdue Model Level 2/3) for HMI and Historian server communications; DMZ/Gateway devices between IT and OT networks for boundary traffic analysis.",
            "action": "1. (Statistical Method) Using Zeek conn.log, establish a 30-day baseline for the average connection volume (connections per second), average RTT, and the ratio of failed connections (states 'S0', 'S1', 'REJ') to successful connections ('SF') for each critical ICS device IP. Monitor for any 1-minute rolling window where the connection volume or failure ratio exceeds 3 standard deviations from its established baseline, or where RTT increases by more than 50% or 100ms, triggering an alert for potential DoS. 2. (Symbolic Logic) Analyze Zeek tcp.log and udp.log for an abrupt increase in fragmented packets (e.g., ip_frag_offset != 0) or packet sizes exceeding typical MTU to critical ICS devices, or a sustained high volume of traffic (>500 packets/sec or >100 Mbps for 30 seconds) from a single, unapproved source IP. Specifically, identify patterns indicative of SYN floods (high count of 'S0' states in Zeek conn.log without corresponding 'SF' for a target) or UDP floods (high volume of UDP traffic to common service ports from a single source in Zeek udp.log). Alert if traffic volume from an unknown source to a critical device exceeds 500 packets per second, or if more than 20% of new connections to a critical device fail within a 1-minute window. 3. (Machine Learning) Implement a time series anomaly detection model (e.g., Prophet or LSTM) on network traffic volume (bytes/packets per second), connection failure rates, and RTT to and from critical ICS devices, using Zeek conn.log. Train the model on historical normal operational data (e.g., 90 days). Generate an alert when the model detects an unusual surge or sustained drop in traffic volume, a spike in connection failures, or a significant RTT increase that deviates significantly from the predicted pattern, indicating a potential DoS or network disruption. Correlate these network anomalies with Windows Event ID 4697 (Service Installation) on EWS/HMI to detect newly installed services that could be attack tools, or with a lack of expected process data from Historian logs."
          }
        ]
      },
      {
        "technique_id": "T0855",
        "name": "Unauthorized Command Message",
        "evidence": [
          {
            "description": "A critical command message, such as a Modbus function code 0x05 (Write Single Coil) or 0x06 (Write Single Register) with values indicating an emergency stop or process shutdown, a DNP3 freeze/reset command, or an EtherNet/IP explicit message initiating a device restart or configuration change, is observed in Zeek ICS protocol logs (modbus.log, dnp3.log, enip.log). This command originates from a source IP address or user account (correlated with Windows Event ID 4624 on the originating HMI/EWS) that is not on the documented whitelist of authorized operators/engineering workstations, OR the command occurs outside of the defined normal operational window (e.g., between 10 PM and 6 AM local time, or on weekends/holidays) without a pre-approved change management ticket, OR the command targets a device/parameter that is not typically controlled by the originating source.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and Operator Stations (HMI) for command origination and host activity; ICS Control Network (Purdue Model Level 1/2) for command transmission to PLCs/RTUs; ICS Supervisory Network (Purdue Model Level 2/3) for HMI/SCADA server communications; Authentication Servers for user authentication and authorization logs.",
            "action": "1. (Symbolic Logic) Identify known critical command messages (e.g., Modbus write commands for emergency stops, DNP3 freeze/reset commands, EtherNet/IP shutdown requests) within Zeek modbus.log, dnp3.log, or enip.log. Maintain a strict whitelist of authorized source IPs (e.g., specific EWS, HMI) and authenticated user accounts (from Windows Event ID 4624) permitted to issue these commands. Alert immediately on any identified critical command originating from a non-whitelisted IP or user, or if the command is observed outside of documented operational schedules (e.g., defined work hours for the specific process area) and lacks a corresponding change management ticket. 2. (Statistical Method) Establish a baseline for the frequency and timing of critical command messages from authorized sources over a 30-day period. Calculate the entropy score for the source IPs and command types observed within a 1-hour sliding window. A sudden drop in entropy (e.g., many identical critical commands from a single new source) or commands occurring outside the 99th percentile of normal operational hours for that specific command type should trigger an alert. Additionally, calculate the daily average and standard deviation for critical command frequency per device; alert if the frequency exceeds 3 standard deviations from the 30-day average. 3. (Machine Learning) Utilize a supervised machine learning model (e.g., Isolation Forest, One-Class SVM) to profile typical command sequences and user interaction patterns on HMIs and EWS. Train the model using historical Zeek ICS protocol logs combined with Windows Event ID 4624 (successful logins) and 4663 (object access related to HMI applications/configuration files). Generate an alert when a command message or sequence of commands deviates significantly from the established normal operational sequences or user behavior profiles (e.g., an operator typically only issues read commands but suddenly issues a write command, or a command is issued from an EWS not normally associated with that process area), indicating an anomalous or potentially unauthorized command chain. Prioritize alerts where command messages are correlated with unauthorized file access (Windows Event ID 4663) to critical HMI configuration files."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]