[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via removable media? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0847",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) is observed on an ICS endpoint where the 'New Process Name' or 'Process Command Line' field contains a path prefixed by a removable drive letter (e.g., 'E:\\', 'F:\\', 'G:\\'). This excludes paths from known legitimate software installers or approved removable devices. Additionally, the process's hash (MD5, SHA256) is not found in an approved whitelist.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Data Gateways, SCADA Servers, any Windows-based ICS endpoint with USB/removable media access.",
            "action": "1. Symbolic Logic (IOC Match/Pattern): In your SIEM, query for Windows Event ID 4688 (Process Creation) from all critical ICS assets. Filter events where the 'Process.Image' or 'ParentProcess.Image' field contains a path starting with a removable drive letter (e.g., 'E:\\', 'F:\\', 'G:\\'). Exclude paths matching a known legitimate removable device or approved software location whitelist. Immediately alert if the 'Process.Hash' (MD5, SHA256) matches a known malicious hash from reputable threat intelligence feeds (e.g., VirusTotal, CISA ICS Advisories) or if the process name/path matches a known suspicious pattern (e.g., '*autorun.inf*', '*setup.exe*' in non-standard locations, executables within '*RECYCLER*' or '*System Volume Information*' folders on removable media). 2. Statistical Method (Baseline Deviation): For each ICS asset, establish a 90-day rolling baseline of process executions from removable media, tracking the frequency of unique 'Process.Image' and 'ParentProcess.Image' values. For new events, calculate the percentile rank of the observed 'Process.Image' and 'ParentProcess.Image' against the historical distribution for that asset. Alert if either value falls below the 1st percentile (indicating extreme rarity) or if a 'Process.Image' is entirely new (not observed in the baseline period) and originates from removable media. 3. Machine Learning (Classification): Deploy a supervised ML model (e.g., Random Forest) trained on historical Windows Event ID 4688 data from ICS endpoints, specifically focusing on process executions originating from removable media. The model should be trained to classify processes as 'legitimate' or 'malicious' based on features such as 'Process.Image' entropy, 'ParentProcess.Image', command-line argument suspicious keywords, and user context. In real-time, feed new process creation events from removable media into the model. Trigger a high-fidelity alert if the model outputs a 'malicious' classification with a confidence score exceeding 0.85, indicating a strong likelihood of adversarial activity."
          },
          {
            "description": "Observable network connection events (Zeek conn.log, dns.log, http.log, ssl.log) originating from an ICS asset, where the 'id.orig_h' (source IP) matches the asset where a process was launched from removable media (Windows Event ID 4688), and the 'ts' (timestamp) of the network connection is within 5 minutes after the 'TimeCreated' of the process launch. The connection should be to an external (non-RFC1918) IP address or an unauthorized internal IP/port, or involve a protocol/port outside the asset's normal operational profile, suggesting C2 or data exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The IT/OT network boundary, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Perimeter firewalls (for conn.log/dns.log), Network Intrusion Detection Systems (NIDS) at the IT/OT boundary, ICS network switches and routers (for Zeek sensor placement).",
            "action": "1. Symbolic Logic (IOC Correlation/Pattern Matching): In your SIEM, create a correlation rule: IF (Windows Event ID 4688 where 'Process.Image' or 'ParentProcess.Image' originates from a removable drive letter) THEN LOOKUP for (Zeek conn.log, dns.log, http.log, or ssl.log events from the same 'Source_IP' ('id.orig_h') within the subsequent 5 minutes). Generate a high-severity alert if the 'id.resp_h' (destination IP) or 'query' (DNS query) matches any entry on a known C2 or malicious domain threat intelligence feed, or if the 'id.resp_h' is a non-RFC1918 IP address not present in an approved whitelist for the ICS network segment. Additionally, alert if the 'id.resp_p' (destination port) or 'proto' (protocol) is highly unusual for that specific ICS asset based on established network profiles. 2. Statistical Method (Behavioral Anomaly): For each ICS asset, establish a 30-day rolling baseline of network activity from Zeek conn.log, tracking metrics such as unique destination IPs, total outbound bytes, and the frequency distribution of 'id.resp_p' (destination ports) and 'proto' (protocols). When a process execution from removable media is detected, monitor subsequent network connections from that asset within a 5-minute window. Calculate a Z-score for the observed outbound bytes and unique destination IPs against their historical mean and standard deviation. Additionally, calculate the percentile rank for the destination port and protocol. Trigger an alert if the Z-score for outbound bytes or unique IPs exceeds 3 standard deviations, or if the destination port or protocol falls below the 1st percentile of historical usage for that asset. 3. Machine Learning (Time-Series Anomaly Detection): Implement a time-series anomaly detection model (e.g., Isolation Forest) on aggregated 1-minute interval metrics from Zeek conn.log and dns.log for each ICS asset. Train the model on 60 days of historical data, using features like outbound connection count, unique destination IP count, total data volume (bytes), and the Shannon entropy of destination ports and protocols. Upon detection of a process execution from removable media, apply the trained model to the subsequent 5-minute window of network activity from the same asset. Generate a high-priority alert if the anomaly score produced by the model exceeds a threshold of 0.9, indicating a significant deviation from normal network behavior correlated with the removable media event."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]