[
  {
    "information_requirement": "Is an adversary changing PLC operating modes to bypass security controls or prepare for further action? (TA0103 - Evasion)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0858",
        "name": "Change Operating Mode",
        "evidence": [
          {
            "description": "Detection of an S7comm 'Set CPU Mode' command (Zeek s7comm.log:function_code=0x29) or an EtherNet/IP 'Set Attribute Single' service (Zeek enip.log:service_code=0x4C, Class=0x91, Instance=1, Attribute=8) targeting a PLC, where the `new_mode` field (for S7comm) or the value of Attribute 8 (for EtherNet/IP) indicates 'PROGRAM', 'REMOTE', or 'STOP', AND the timestamp of the command execution (Zeek log:ts) does not align with any pre-approved, scheduled maintenance window documented in the Change Management Database (CMDB) or operational calendar system.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network monitoring points (e.g., network taps, SPAN ports, or industrial firewalls with deep packet inspection capabilities) strategically placed on Level 1 (Control/Process Control Networks) subnets where PLCs and other field devices reside, Level 2 (Supervisory) networks connecting HMI/SCADA systems to PLCs, and the industrial DMZ (IDMZ) segments between the IT and OT networks.",
            "action": "1. Symbolic Logic: Develop a SIEM rule that parses Zeek s7comm.log for function_code=0x29 and Zeek enip.log for service_code=0x4C (Set Attribute Single) targeting Class 0x91, Instance 1, Attribute 8 where the `new_mode` field (for S7comm) or the parsed mode attribute value (for EtherNet/IP) indicates 'PROGRAM', 'REMOTE', or 'STOP'. Correlate these events with a lookup table or external API call to a Change Management Database (CMDB) or operational calendar containing scheduled maintenance windows. Trigger a high-severity alert if a mode change event occurs outside an approved window. 2. Statistical Method: For each PLC, establish a 30-day rolling baseline of the hourly count of mode change commands (Zeek s7comm.log and Zeek enip.log). Calculate the 95th percentile of mode change counts for each hour of the day, excluding known maintenance periods. Generate an alert if the current hourly count for any PLC exceeds its established 95th percentile, indicating an unusual spike in mode change activity. 3. Machine Learning: Implement a time-series anomaly detection model (e.g., Prophet or ARIMA) on historical Zeek s7comm.log and Zeek enip.log data, using features such as `id_orig_h` (source IP), `id_resp_h` (destination PLC IP), `function_code`/`service_code`, and `new_mode`/mode attribute value. The model should learn the expected frequency and timing of mode changes for each PLC. Trigger an alert when a mode change event's probability score falls below a predefined threshold (e.g., 0.01) or when a significant deviation from the forecasted number of events is detected."
          },
          {
            "description": "An ICS protocol command changing a PLC's operating mode, specifically an S7comm 'Set CPU Mode' (Zeek s7comm.log:function_code=0x29, `new_mode` indicating 'PROGRAM', 'REMOTE', 'STOP', 'RUN', 'TEST', or 'MONITOR') or an EtherNet/IP 'Set Attribute Single' service (Zeek enip.log:service_code=0x4C, Class=0x91, Instance=1, Attribute=8) where the source IP address (Zeek log:id_orig_h) or MAC address of the initiating device does not match any entry in the organization's authoritative asset inventory (CMDB) categorized as an authorized Engineering Workstation (EWS), Maintenance Laptop, or approved jump server for the target PLC.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network monitoring points on Engineering Workstation (EWS) subnets, Level 1 (Control/Process Control Networks) and Level 2 (Supervisory) networks for all PLC communications, industrial firewall logs between IT/OT networks, and authentication servers (e.g., Active Directory, RADIUS) managing access to OT environments and EWS.",
            "action": "1. Symbolic Logic: Maintain an up-to-date allowlist of authorized Engineering Workstation (EWS) IP addresses and designated jump server IPs in a lookup table. For every ICS mode change command detected in Zeek s7comm.log (function_code=0x29) or Zeek enip.log (service_code=0x4C), extract the `id_orig_h` (source IP). Compare this source IP against the allowlist. Generate a high-severity alert if the source IP is not present in the authorized list. 2. Statistical Method: For each PLC, establish a 30-day rolling baseline of unique source IPs that initiate mode change commands (Zeek s7comm.log or Zeek enip.log). Calculate the median and interquartile range (IQR) of the daily count of unique source IPs. Trigger an alert if a new source IP (not seen in the last 30 days) initiates a mode change, or if the daily count of unique source IPs for a PLC exceeds `Q3 + 1.5*IQR` (upper fence for outliers). 3. Machine Learning: Train a supervised classification model (e.g., Random Forest or XGBoost) using historical Zeek conn.log entries associated with mode change commands. Features should include `id_orig_h` (source IP), `id_resp_h` (destination PLC IP), `id_orig_p` (source port), `id_resp_p` (destination port), `proto` (protocol), `duration`, `orig_bytes`, `resp_bytes`, and time-based features (hour of day, day of week). Label known authorized connections as 'legitimate' and train the model to identify 'unauthorized' connections. Alert when a connection associated with a mode change is classified as 'unauthorized'."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary executing unauthorized program changes by manipulating PLC operating modes? (TA0104 - Execution)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0858",
        "name": "Change Operating Mode",
        "evidence": [
          {
            "description": "An observed sequence of ICS protocol commands to a single PLC originating from the same source IP and targeting the same destination PLC within a configurable time window (e.g., 15 minutes), consisting of: 1) a 'Set CPU Mode' (S7comm function code 0x29) or 'Set Attribute Single' (EtherNet/IP Class 0x91, Instance 1, Attribute 8) command changing the PLC's operating mode to 'PROGRAM' or 'REMOTE'; 2) a 'Program Download' command (e.g., S7comm 'Download Block' function code 0x1B or EtherNet/IP 'Download Data' service); and 3) a subsequent 'Set CPU Mode' or 'Set Attribute Single' command changing the mode back to 'RUN'.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek enip.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network monitoring points (e.g., network taps, SPAN ports, or industrial firewalls) on Level 1 (Control/Process Control Networks) subnets containing critical PLCs, and Level 2 (Supervisory) networks that facilitate communication between PLCs, SCADA/HMI systems, and Engineering Workstations (EWS).",
            "action": "1. Symbolic Logic: Configure a stateful SIEM correlation rule to detect the specific sequence of events on a single PLC from a single source IP. The sequence is: 1) Zeek s7comm.log (function_code=0x29, `new_mode`=PROGRAM/REMOTE) or Zeek enip.log (service_code=0x4C, mode=PROGRAM/REMOTE); followed by 2) Zeek s7comm.log (function_code=0x1B or 0x1C for program download) or Zeek enip.log (service_code=0x4D for download); followed by 3) Zeek s7comm.log (function_code=0x29, `new_mode`=RUN) or Zeek enip.log (service_code=0x4C, mode=RUN). All events must occur within a 15-minute window and share the same `id_orig_h` and `id_resp_h`. Trigger a high-severity alert upon detection. 2. Statistical Method: Baseline the typical duration for authorized PLC program change sequences (mode change -> program download -> mode change back) over a 90-day period using historical Zeek s7comm.log and Zeek enip.log data. Calculate the median duration and the interquartile range (IQR). For each observed sequence, calculate its total duration. Alert if the observed duration falls outside the expected range (e.g., `Median ± 1.5*IQR`), or if it is significantly shorter than the 5th percentile, potentially indicating an automated or rushed unauthorized activity. 3. Machine Learning: Implement a sequence anomaly detection model (e.g., Hidden Markov Model or a Transformer-based model) trained on historical sequences of ICS commands (Zeek s7comm.log, Zeek enip.log) for each PLC. Features for each event in the sequence should include `id_orig_h`, `id_resp_h`, `function_code`/`service_code`, `new_mode`/mode attribute value, `timestamp`, and the time difference to the previous event. The model will learn the normal order, timing, and command types within legitimate program update sequences. Alert when an observed sequence deviates significantly from the learned patterns, indicating a potential malicious program execution."
          },
          {
            "description": "On an Engineering Workstation (EWS), `Windows Event ID 4688` (Process Creation) indicates a `NewProcessName` that is not on an established whitelist of authorized ICS engineering applications (e.g., `TIA.exe`, `Studio5000.exe`). This non-whitelisted process then initiates an outbound network connection to a PLC IP address (corroborated by `Zeek conn.log` with `id_orig_h` matching the EWS IP and `id_resp_h` matching the PLC IP), immediately followed by a corresponding ICS protocol command from the EWS to that same PLC (e.g., S7comm 'Set CPU Mode' from `Zeek s7comm.log:function_code=0x29` or EtherNet/IP 'Set Attribute Single' from `Zeek enip.log:service_code=0x4C`) to change the PLC's operating mode, all within a short time window (e.g., 60 seconds).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices designated as Engineering Workstations (EWS) and Maintenance Laptops, network segments where EWS are located (e.g., Level 2 Supervisory network), and host-based monitoring agents (e.g., EDR, Sysmon) deployed on all EWS within the OT environment.",
            "action": "1. Symbolic Logic: Maintain a whitelist of authorized ICS engineering application executables (e.g., `TIA.exe`, `Studio5000.exe`) and their expected parent processes and command-line arguments. Implement a SIEM correlation rule that links: 1) `Windows Event ID 4688` (Process Creation) for EWS, filtering for processes *not* in the whitelist; 2) `Windows Event ID 5156` (Windows Filtering Platform Connection) showing an outbound connection from that non-whitelisted process to a PLC IP; and 3) a corresponding ICS mode change command in Zeek s7comm.log or Zeek enip.log originating from the EWS IP. Trigger a high-severity alert if this sequence is observed. 2. Statistical Method: For each EWS, establish a 30-day rolling baseline of the unique processes (from `Windows Event ID 4688`) that initiate outbound network connections to PLCs (identified by Zeek conn.log). Calculate a Shannon entropy score for the diversity of processes observed making these connections over a 24-hour window. Trigger an alert if the entropy score significantly increases (e.g., exceeds the 95th percentile of historical entropy) or if a process with a historically very low frequency (e.g., below the 5th percentile) or a completely new process initiates a connection followed by a mode change command. 3. Machine Learning: Train a supervised classification model (e.g., Gradient Boosting Machines or Random Forest) using a dataset of `Windows Event ID 4688` and Zeek conn.log entries from EWS. Features should include: `NewProcessName`, `ParentProcessName`, `CommandLine`, `SubjectUserName`, `SubjectLogonId` (from 4688); and `id_resp_h` (destination PLC IP), `id_resp_p` (destination port), `proto`, `duration` (from conn.log). Label historical legitimate engineering tool activity as 'benign' and known or simulated malicious activity as 'malicious'. The model will predict the likelihood of a process-initiated connection to a PLC being malicious, especially when followed by a mode change, alerting on high-confidence 'malicious' classifications."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]