[
  {
    "information_requirement": "Has an adversary compromised our OT environment via a trusted supply chain relationship? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0862",
        "name": "Supply Chain Compromise",
        "evidence": [
          {
            "description": "Within 72 hours of a detected software installation (Windows Event ID 4697 for service installation or 4688 for process creation with installer-like arguments) or a reported firmware update event on an OT asset (e.g., HMI, Engineering Workstation, PLC, RTU), the affected asset initiates outbound network connections (Zeek conn.log) to external IP addresses or domains (Zeek dns.log) that are either: 1) explicitly identified as malicious (e.g., C2, malware distribution) in active threat intelligence feeds, or 2) statistically anomalous, exhibiting a significant deviation (e.g., representing a newly observed destination IP or domain that falls within the top 5th percentile of new connections when compared to the asset's established 90-day communication baseline, or a data transfer volume exceeding the 99th percentile of historical outbound traffic for that asset).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 4688",
              "Windows Event ID 4697",
              "Firewall logs (outbound connections)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points from OT segments (e.g., OT DMZ firewalls, industrial routers), Engineering Workstations, Human-Machine Interfaces (HMIs), Historian servers, and any other OT assets capable of outbound network communication, including IT/OT boundary firewalls.",
            "action": "1. Symbolic Logic (IOC): Monitor Windows Event IDs 4697 (Service Installation) and 4688 (Process Creation) on OT assets for software installation events. For any installation or reported firmware update within the last 72 hours, query Zeek conn.log, dns.log, and http.log for outbound connections from the affected host. Cross-reference all destination IPs and queried domains against at least three active threat intelligence feeds (e.g., AlienVault OTX, MISP, specific ICS-focused feeds) for known malicious indicators (e.g., C2 servers, malware distribution sites). Generate a high-severity alert for any direct match. 2. Statistical Method: For each OT asset, establish a 90-day communication baseline using Zeek conn.log, capturing unique destination IP/domain pairs, ports, protocols, and average daily data volume. After a new software installation (Windows Event ID 4697/4688) or reported firmware update, calculate the Jaccard similarity index between the set of unique destination IP/domain pairs observed in the 72 hours post-event and the set of unique pairs from the preceding 90-day baseline. An index value below the 5th percentile of historical Jaccard scores for similar assets should trigger an alert. Additionally, calculate the total outbound data volume; if it exceeds 3 standard deviations from the 90-day mean for a sustained period (e.g., over 30 minutes), trigger an alert. 3. Machine Learning Application: Implement a time-series anomaly detection model (e.g., Isolation Forest or LSTM autoencoder) on the sequence of network connection metadata (e.g., protocol, port, bytes_in, bytes_out, duration, connection state) from Zeek conn.log for critical OT assets. Train the model on at least 90 days of historical 'normal' behavior. After a software installation or firmware update, continuously feed real-time connection data for the affected asset into the model; a sustained anomaly score exceeding the top 1% of historical anomaly scores for connections originating from the recently updated host should generate an alert, indicating potential C2 activity or data exfiltration."
          },
          {
            "description": "An executable process (Windows Event ID 4688), identified by its name as a legitimate ICS vendor application (e.g., 'Siemens_TIA_Portal.exe', 'Rockwell_Studio_5000.exe'), is observed executing from a file path not within its expected, digitally signed installation directory (e.g., 'C:\\Program Files\\Vendor\\App\\'), or from known suspicious user-writable directories (e.g., 'C:\\Users\\<user>\\AppData\\Local\\Temp\\', 'C:\\Windows\\Temp\\', 'C:\\ProgramData\\'), or the executable file (referenced by the 'New Process Name' field in Windows Event ID 4688) is found to have an invalid, expired, or missing digital signature when one is expected from the legitimate vendor.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4697",
              "System application logs (e.g., SCCM, endpoint management logs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices within the Process Control Network (PCN) and Manufacturing Zone (MZ), specifically Engineering Workstations, Human-Machine Interfaces (HMIs), application servers, and any Windows-based OT assets.",
            "action": "1. Symbolic Logic (IOC): Continuously monitor Windows Event ID 4688 (Process Creation) on all OT Windows-based systems. Maintain an allow-list of expected process names for critical ICS vendor applications and their corresponding legitimate, digitally signed file paths (e.g., 'HMI_Client.exe' should only execute from 'C:\\Program Files\\Vendor\\HMI\\'). Immediately alert on any process creation event where a known legitimate ICS executable name is initiated from a file path not present in the allow-list, or from a path identified as suspicious (e.g., 'C:\\Windows\\Temp\\', 'C:\\Users\\Public\\') or matching known malware paths from threat intelligence. Additionally, for any new or suspicious executable, trigger an automated digital signature validation check; alert if the signature is invalid, expired, or missing when one is expected. 2. Statistical Method: For each process creation event (Windows Event ID 4688), extract the full file path. Calculate the Shannon entropy of the file path string (e.g., `length * sum(-p_i * log2(p_i))`). Establish a baseline of entropy scores for legitimate application paths on each system over a 30-day period. Alert on any process execution where the file path entropy exceeds the 95th percentile of the baseline for that system, especially if the process originates from a user-writable or temporary directory (e.g., AppData, Temp). This indicates potential obfuscation or randomized naming. 3. Machine Learning Application: Develop a supervised machine learning classifier (e.g., Random Forest or SVM) trained on historical process creation events (Windows Event ID 4688) with labels for 'benign' and 'malicious' (e.g., known malware executions). Features for the model should include: process name, parent process, command line arguments, file path, directory depth, file path entropy, and whether the path matches a known suspicious directory pattern. Continuously feed new process creation events into the classifier; an alert is generated for any event classified as 'malicious' with a high confidence score (e.g., >0.8), indicating a potential trojanized executable or dropped payload."
          },
          {
            "description": "Within 72 hours of a reported firmware update or maintenance activity on a control system device (e.g., PLC, RTU, IED), the device exhibits statistically significant deviations from its established 90-day network communication baseline (Zeek conn.log, industrial protocol logs), specifically by: 1) initiating connections to previously unobserved internal or external IP addresses (Zeek conn.log) or domains (Zeek dns.log) that represent a new connection for that device type, 2) utilizing non-standard or unexpected industrial protocols (Zeek modbus.log, dnp3.log, enip.log, bacnet.log) or ports (Zeek conn.log) not typically observed for that device's function, or 3) demonstrating unusual data transfer volumes (Zeek conn.log) (e.g., outbound bytes_orig or bytes_resp exceeding the 99th percentile of historical averages for that device type).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek bacnet.log",
              "Industrial Firewall logs",
              "Device-specific logs (e.g., PLC logs, RTU logs, IED logs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing critical control system devices (e.g., Level 0, Level 1 of the Purdue Model), industrial firewalls, network taps near PLCs, RTUs, IEDs, industrial gateways, and any device within the Process Control Network (PCN) or Safety Instrumented System (SIS).",
            "action": "1. Symbolic Logic (IOC): Monitor Zeek conn.log and specific industrial protocol logs (e.g., modbus.log, dnp3.log, enip.log, bacnet.log) for connections originating from control devices (PLCs, RTUs, IEDs). Identify any connections to IP addresses or domains explicitly listed in threat intelligence feeds as known malicious C2 servers, botnet infrastructure, or data exfiltration points. Additionally, identify any usage of non-industrial or unexpected ports/protocols (e.g., outbound HTTP/S to public IPs from a PLC) that are not part of an established allow-list for that specific device or device type. Generate an immediate alert for any direct match or violation. 2. Statistical Method: For each control device, establish a 90-day network communication baseline using Zeek conn.log and relevant industrial protocol logs, detailing unique destination IPs, ports, protocols, average connection frequency per hour, and average data volume (bytes_orig, bytes_resp) per connection. After a reported firmware update, continuously compare the device's real-time network behavior against its baseline. Generate an alert if: a new destination IP or port is observed that falls below the 1st percentile of observed activity for similar devices, or if the connection frequency or data volume for an existing connection pair exceeds 3 standard deviations from its historical mean for a sustained period (e.g., 5 consecutive minutes). 3. Machine Learning Application: Deploy an unsupervised machine learning anomaly detection model (e.g., Autoencoder or Isolation Forest) on the aggregated network flow features (e.g., source/destination IP/port, protocol, byte counts, duration, connection state, industrial protocol-specific fields) from Zeek conn.log and industrial protocol logs for each control device. Train the model on several months of 'normal' device communication data. Post-firmware update, continuously feed the device's network traffic into the trained model. Generate an alert when the model's anomaly score for a device's network activity exceeds a dynamically calculated threshold (e.g., top 1% of historical anomaly scores), indicating a significant shift in communication patterns that could signify compromise."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]