[
  {
    "information_requirement": "Has an adversary successfully executed an action that has resulted in, or is intended to cause, physical damage to operational technology property? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0832",
        "name": "Manipulation of Control",
        "evidence": [
          {
            "description": "An ICS write command, captured in network protocol logs (e.g., Zeek Modbus, DNP3, ENIP, OPC UA), targets a critical control register (e.g., motor speed, valve position, pressure setpoint) and sets its value outside of predefined engineering safety limits (e.g., a motor commanded to 200% maximum RPM, a valve commanded to an impossible intermediate state like 50% open then 0% open within 100ms) or beyond the 99.9th percentile of its historical operational range. Specifically, this includes commands that would induce physical stress, such as rapid, alternating open/close commands to a valve (e.g., 5 state changes within 1 second) or simultaneous, conflicting commands to interdependent systems (e.g., commanding a heater to maximum output while a cooling pump is commanded off). This activity is not correlated with any authorized HMI interaction, EWS program download, or scheduled maintenance activity within a 15-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek opc_ua.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, Safety Instrumented System (SIS) network segments, PLC/RTU network interfaces, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Data Historian servers.",
            "action": "1. Symbolic Logic (IOC Match): Query Zeek ICS protocol logs (e.g., zeek_modbus.log, zeek_dnp3.log, zeek_enip.log) for 'write' commands (e.g., modbus.func=6 or 16, dnp3.func=Write) to known critical PLC registers or coils. Alert if the 'value' field of the write command is outside the documented safe operating range for that specific register (e.g., modbus.reg_value > max_safe_value or < min_safe_value). Additionally, alert on any 'write' attempt to a register explicitly defined as 'read-only' in the asset inventory. Implement a rule to detect rapid oscillation by counting distinct 'write' commands to the same register with alternating values (e.g., value=1 then value=0 then value=1) within a short time window (e.g., 3 or more changes within 5 seconds) and alert if this count exceeds 3 for any single register. 2. Statistical Method: For each critical process parameter (e.g., temperature, pressure, flow_rate) extracted from Zeek ICS protocol logs (e.g., zeek_enip.log for process data), establish a 7-day rolling baseline for its 1st, 5th, 95th, and 99th percentile values. Alert if any current parameter reading falls outside the 1st or 99th percentile of its respective baseline for more than 3 consecutive readings. For a multivariate approach, calculate the Mahalanobis distance for a vector of correlated critical process parameters (e.g., motor RPM, current draw, temperature) from the centroid of their statistically baselined normal operating states. Alert if this distance exceeds the 99.9th percentile of the historical Mahalanobis distances, indicating a highly unusual combined state. 3. Machine Learning Application: Train a One-Class Support Vector Machine (OCSVM) on a 30-day baseline of normal operating values for critical control registers and process parameters (e.g., modbus.reg_value, enip.data_value). Feed live incoming values into the trained OCSVM. A prediction of '-1' (outlier) with a high confidence score (e.g., decision function value below -0.5) indicates a deviation from the learned normal behavior. Additionally, implement a time-series anomaly detection model (e.g., Isolation Forest or Prophet with changepoint detection) on the frequency and type of 'write' commands observed in Zeek ICS logs. Alert on significant, sustained increases in 'write' command frequency or shifts in the distribution of target registers, as these could indicate adversarial manipulation campaigns. 4. Correlation: Upon detection of an anomalous ICS write command, correlate the source IP and timestamp with zeek_conn.log to identify the originating workstation (e.g., HMI, EWS). Further, correlate the timestamp and originating host with Windows Event ID 4624 (successful logon) and Windows Event ID 4688 (process creation) on that workstation within a +/- 5-minute window to identify the user session and specific process that initiated the anomalous command. Cross-reference this information with change management records to confirm if the activity was authorized or scheduled."
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Device Restart/Shutdown",
        "evidence": [
          {
            "description": "An unscheduled or unauthorized shutdown or restart event of a critical ICS asset (e.g., HMI, EWS, SCADA Server, Historian, PLC/RTU with Windows OS) is observed, indicated by Windows Event ID 1074 (user-initiated shutdown/restart) or Windows Event ID 6008 (unexpected shutdown). This event lacks correlation with any pre-approved change management ticket, scheduled maintenance, or system update. The shutdown is either initiated by an unauthorized user, process, or occurs after a preceding chain of suspicious activities like unusual remote access (Zeek rdp.log, Zeek smb.log), privilege escalation (Windows Event ID 4672), or the execution of known malicious binaries (Windows Event ID 4688). Such an event can lead to system unavailability and potentially physical damage if associated with process control equipment.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6008",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Windows Event ID 4672",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Process Historians, SCADA Servers, Engineering Workstations, Domain Controllers within the ICS environment, Network boundary sensors for ICS segments, Remote Terminal Units (RTUs) with logging capabilities.",
            "action": "1. Symbolic Logic (IOC Match): Create an alert for Windows Event ID 1074 where the 'ProcessName' is shutdown.exe and the 'InitiatingProcessName' is not explorer.exe, svchost.exe, or winlogon.exe. Additionally, alert if the 'SubjectUserName' associated with Windows Event ID 1074 is not a member of the local 'Administrators' group or a designated domain administrator group for the asset. For Windows Event ID 6008, alert if this event occurs on a critical ICS server without a preceding Windows Event ID 1074 within the last 5 minutes, indicating an abrupt, unexpected shutdown. 2. Statistical Method: For each critical ICS asset, establish a 30-day rolling baseline for the frequency of Windows Event ID 1074 and 6008 events per 24-hour period. Alert if the current 24-hour count exceeds the 99th percentile of this baseline. Additionally, analyze Zeek rdp.log and Zeek smb.log for each critical server, establishing a baseline for the number of unique source IPs and connection durations per hour. Alert if a Windows Event ID 1074 or 6008 event is preceded, within a 30-minute window, by a count of unique source IPs or average connection duration exceeding the 95th percentile of their respective baselines. 3. Machine Learning Application: Train a binary classification model (e.g., Gradient Boosting Classifier) to distinguish between authorized and unauthorized shutdown events (Windows Event ID 1074). Features for the model should include: SubjectUserName, InitiatingProcessName, TargetServerName, LogonType (from preceding Windows Event ID 4624), time of day, day of week, and a flag for whether the source IP (from Zeek conn.log) is internal/external or on a known whitelist. Additionally, incorporate a feature indicating the presence of a corresponding change management ticket. Flag events with a predicted probability of being unauthorized above 0.8 as high-severity alerts. Use a clustering algorithm (e.g., DBSCAN) on features like Source_IP, User_Account, and Process_Name from Zeek rdp.log and Windows Event ID 4688 events preceding a shutdown to identify distinct, potentially malicious, access patterns that deviate from normal administrative behavior. 4. Correlation: Upon detection of an anomalous shutdown (Windows Event ID 1074 or 6008), automatically gather all Windows Event IDs 4624, 4648, 4672, 4688 from the affected host, and Zeek conn.log, Zeek rdp.log, Zeek smb.log from network sensors, for a 60-minute window preceding the shutdown. Correlate the SubjectUserName, Source_IP, and Target_Host across these logs to reconstruct a timeline of user activities, remote access attempts, privilege changes, and process executions leading up to the shutdown, identifying potential lateral movement, credential access, or execution techniques used by an adversary."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]