[
  {
    "information_requirement": "Is an adversary using remote services to gain initial access to the ICS network? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful remote service connection (RDP on TCP port 3389, VNC on TCP port 5900, or SSH on TCP port 22) is made to a critical OT asset (e.g., HMI, EWS) from a source IP not on the established whitelist of authorized jump hosts or remote access gateways. This also includes connections occurring outside of documented operational hours or scheduled maintenance windows.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log",
              "Windows Event ID 4624",
              "Microsoft-Windows-TerminalServices-LocalSessionManager/Operational Event ID 21"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Network Perimeter (ICS DMZ), Jump Servers, VPN Concentrators, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Networks (PCN).",
            "action": "1. Symbolic Logic: Create and maintain a list of authorized source IPs (jump hosts, admin workstations) for remote access to critical OT assets. Query Zeek conn.log for successful connections where `id.resp_p` is in (3389, 5900, 22) and `id.resp_h` is a critical OT asset. Join with Windows Event ID 4624 (Logon Type 10 for RDP) or Zeek ssh.log (`auth_success` = T) to confirm successful authentication. Generate a high-severity alert if the `id.orig_h` (source IP) is not in the authorized list. 2. Statistical Method: For each critical OT asset, establish a 30-day baseline of remote connection characteristics (source IP, user account, time of day, protocol) using Zeek and Windows logs. Calculate the 95th percentile for connection duration per protocol. Alert on any new connection where the source IP has not been seen in the last 30 days, the connection occurs outside a 2 standard deviation window of the mean login time, or the duration exceeds the 95th percentile. 3. Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on historical remote session data. Use features such as `source_ip`, `destination_ip`, `destination_port`, `user_account`, `time_of_day`, `day_of_week`, `session_duration`, and `protocol`. Apply the model to new connections to identify and alert on sessions that are flagged as anomalous based on a combination of these features."
          },
          {
            "description": "A brute-force or password spraying pattern, characterized by a high volume of failed remote service login attempts (e.g., >20 failed RDP attempts in 5 minutes from one source) followed by a successful login from the same source IP to an OT asset within a short time window (e.g., 15 minutes). This applies to services like RDP, SMB, and SSH.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing remote access servers, Jump Servers, ICS DMZ, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Active Directory Domain Controllers within the OT environment.",
            "action": "1. Symbolic Logic: In a SIEM, create a rule that triggers when a single source IP (`id.orig_h` in Zeek logs) generates over 20 failed login events (Windows Event ID 4625 with Failure Reason not 'Account disabled' or 'Account locked out') to an OT asset within 5 minutes. If this rule triggers, correlate for a subsequent successful login (Windows Event ID 4624, Logon Type 3 or 10; or `auth_success`=T in Zeek ssh.log) from the same source IP within the next 15 minutes. Alert if the sequence is observed. 2. Statistical Method: For each destination host, maintain a 24-hour rolling baseline of the rate of failed login attempts (Windows Event ID 4625 counts, Zeek `ssh.log` `auth_attempts` count) per unique source IP. Calculate the 99th percentile for this rate. Alert when the current rate from a single source IP exceeds the 99th percentile, and escalate the alert priority if a successful login from that source follows. 3. Machine Learning: Implement a sequence analysis model (e.g., a Hidden Markov Model or RNN) trained on login event sequences (`timestamp`, `source_ip`, `destination_ip`, `event_type` where `event_type` is 'fail' or 'success'). The model learns normal login patterns. Apply it to real-time event streams to detect and alert on the specific anomalous sequence of 'many-fails-then-success' from a single entity."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using remote services for lateral movement within the ICS network? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful remote service connection (RDP, VNC, SSH) is observed between two internal OT assets (e.g., HMI to EWS) where this specific source-destination-port combination has not been seen in a 90-day historical baseline. This includes connections that violate the defined OT communication matrix, such as a Data Historian initiating an RDP session to an HMI.",
            "data_sources": [
              "Zeek rdp.log",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), Internal OT network segments.",
            "action": "1. Symbolic Logic: Maintain a state table or lookup file of all authorized internal remote service connections (source IP, destination IP, destination port, user account) based on a 90-day baseline of Zeek conn.log and Windows Event ID 4624. Query for new connections in real-time. Alert on any connection tuple (e.g., `id.orig_h`, `id.resp_h`, `id.resp_p`) that is not present in the baseline state table. 2. Statistical Method: For each internal host, calculate two metrics over a rolling 24-hour window: a) the number of distinct hosts it connects to via remote services ('fan-out'), and b) the Shannon entropy of the destination hosts it connects to. Establish a baseline and standard deviation for each metric per host. Alert if a host's 'fan-out' count exceeds 3 standard deviations above its mean, or if its destination entropy score changes drastically, indicating either scanning (high fan-out) or focused targeting (low entropy). 3. Machine Learning: Model the internal OT network as a directed graph where nodes are hosts and edges represent remote service connections, weighted by frequency and volume. Use a graph-based anomaly detection algorithm to identify the creation of new, rare edges (new communication paths) or significant changes in edge weights. This can detect lateral movement that deviates from the learned 'normal' communication graph structure."
          },
          {
            "description": "An SMB connection is made to an administrative share (e.g., 'C$', 'ADMIN$') on a critical OT asset (EWS, HMI) from a non-administrative workstation. This includes the transfer of executable files (.exe, .ps1), libraries (.dll), or ICS project files (.ACD, .L5K) via SMB to or from an OT asset, where the transfer is inconsistent with established software deployment or project management workflows.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Zeek smb_files.log",
              "Windows Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Domain Controllers within the OT network, File Servers, Internal OT network segments.",
            "action": "1. Symbolic Logic: Monitor Zeek smb_mapping.log for any connection to a share name matching `C$` or `ADMIN$` on hosts designated as critical OT assets. Correlate with Zeek smb_files.log to detect file write actions (`action=SMB::FILE_WRITE`) involving file names with extensions like .exe, .dll, .ps1, or .bat. If such a file write occurs, monitor the destination host for a subsequent process creation (Windows Event ID 4688) of that same filename within 5 minutes. Alert on this sequence. 2. Statistical Method: For each internal host, establish a baseline for the entropy of file extensions it transfers via SMB (from Zeek smb_files.log `fname` field). A sudden drop in entropy (e.g., below the 5th percentile) may indicate a targeted transfer of a specific payload type. Conversely, a sudden spike (e.g., above the 95th percentile) may indicate staging of a diverse toolkit. Alert on significant deviations from the baseline entropy score. Also, baseline the volume of data transferred and alert on transfers exceeding 3 standard deviations from the mean. 3. Machine Learning: Deploy a UEBA model focused on SMB activity. Train the model on features like `user_account`, `source_host`, `destination_host`, `share_name_accessed`, `file_path`, `file_extension`, `file_size`, `time_of_day`, and `is_admin_share`. Use an autoencoder or clustering algorithm (e.g., k-means) to learn normal SMB behavior profiles. Alert on any activity that the model flags with a high reconstruction error or assigns to an anomalous cluster, indicating a deviation from normal user or host behavior."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]