[
  {
    "information_requirement": "Has an adversary captured wireless ICS communications for subsequent use (e.g., replay attacks)? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Detection of ICS process control commands from authorized wireless gateways exhibiting characteristics of a replay attack: (1) command execution timestamps falling outside of documented operational hours (e.g., 18:00-06:00 local time Monday-Friday, or during scheduled maintenance windows), (2) commands that attempt to transition a process variable to its current state without an intervening opposite command (e.g., 'valve open' command when the valve is already in the 'open' state according to historian data, with no preceding 'valve close' command), or (3) commands that are immediately followed by unexpected system-level alerts (e.g., 'emergency stop' command followed by multiple PLC fault codes or HMI critical alarms) within 60 seconds.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek DNP3.log",
              "Zeek Modbus.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "PLC Controller Syslog",
              "ICS Historian Database Logs",
              "HMI Application Event Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting wireless gateways to the ICS network, Wireless Access Points/Gateways, Human-Machine Interfaces (HMIs), and Engineering Workstations (EWS).",
            "action": "1. Symbolic Logic: Query Zeek DNP3.log or Zeek Modbus.log for successful ICS command transmissions (e.g., write commands, control commands) originating from known wireless gateway IPs. For each detected command, check if its timestamp falls outside defined operational hours (e.g., 18:00-06:00 local time) or scheduled maintenance windows. Additionally, cross-reference the command timestamp with HMI Application Event Logs for operator actions or Windows Event ID 4624 (successful logon) on associated HMIs/EWS. Alert if a command is executed without a corresponding authorized operator action within a +/- 1-minute window. Furthermore, for commands affecting discrete states (e.g., valve position), query the ICS Historian Database Logs to verify the current state of the device. Alert if a command attempts to set a device to a state it is already in, without an intervening command to change its state (e.g., an 'open valve' command when the valve is already open, and no preceding 'close valve' command was recorded in the Historian within the last 5 minutes). 2. Statistical Method: For each unique wireless gateway IP and critical ICS asset tag, establish a 30-day rolling baseline of: (a) average command frequency (commands per minute) and (b) the distribution of numerical command parameters (e.g., setpoints, percentages) from Zeek DNP3.log or Zeek Modbus.log. Calculate the 99th percentile for command frequency and the 1st and 99th percentiles for numerical command parameters. Continuously monitor current 5-minute windows. Generate an alert if the current command frequency from a wireless gateway to a critical asset exceeds its 99th percentile, or if any numerical command parameter falls outside its 1st-99th percentile range, indicating an anomalous or potentially replayed command pattern. 3. Machine Learning: Train a Long Short-Term Memory (LSTM) Autoencoder model on 6 months of historical, legitimate ICS command sequences (command type, numerical parameters, and time delta between commands) extracted from Zeek DNP3.log or Zeek Modbus.log for each wireless gateway. The model will learn to reconstruct normal command sequences. In real-time, feed new 5-minute sequences of commands into the trained autoencoder. Calculate the reconstruction error for each sequence. Generate an alert if the reconstruction error for a command sequence exceeds the 95th percentile of historical reconstruction errors, indicating a statistically significant deviation from learned normal command behavior consistent with a replay attack."
          },
          {
            "description": "Detection of unauthorized wireless device identifiers (e.g., MAC addresses, WirelessHART Network IDs, Zigbee EUI-64s) actively transmitting on defined ICS operational frequencies (e.g., 900 MHz, 2.4 GHz, 700 MHz band) that are not registered in the ICS asset inventory. Additionally, authorized ICS wireless devices exhibiting sustained signal characteristics (e.g., Received Signal Strength Indicator (RSSI), operating channel, modulation type) that deviate significantly from their established 7-day baseline for more than 5 minutes, indicating potential impersonation or interference from a rogue device.",
            "data_sources": [
              "Wireless IDS Logs (e.g., Cisco WLC system logs)",
              "Spectrum Analyzer Logs (e.g., Keysight N6841A logs)",
              "ICS Asset Inventory Database",
              "Network Access Control (NAC) Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical airspace surrounding ICS facilities, specifically near wireless field devices, sensors, actuators, and wireless access points/gateways.",
            "action": "1. Symbolic Logic: Query the ICS Asset Inventory Database to retrieve a current list of all authorized wireless device MAC addresses and unique identifiers (e.g., WirelessHART Network IDs, Zigbee EUI-64s) for ICS operational frequencies. Continuously monitor Wireless IDS Logs and Spectrum Analyzer Logs for newly observed MAC addresses or unique wireless device identifiers. Immediately generate an alert if any detected identifier is not found within the authorized ICS Asset Inventory Database, indicating an unauthorized device. 2. Statistical Method: For each authorized wireless device's unique identifier (e.g., MAC address) observed in Wireless IDS Logs, establish a 14-day rolling baseline for its average RSSI, most frequent operating channel, and average packet-per-second rate. Calculate the Z-score for these metrics in 5-minute intervals. Generate an alert if the Z-score for RSSI, operating channel, or packet-per-second rate for an authorized device exceeds 3.0 (3 standard deviations from its baseline mean) for two consecutive 5-minute intervals, indicating a sustained and significant deviation in signal characteristics consistent with impersonation or interference. 3. Machine Learning: Train a K-Means clustering model using 30 days of historical Wireless IDS Logs and Spectrum Analyzer Logs data. Features for clustering should include average RSSI, standard deviation of RSSI, primary operating channel, and average packet size per unique device identifier. Establish clusters representing normal operational profiles for authorized devices. In real-time, for each newly observed or authorized device, calculate its feature vector and determine its distance to the centroid of its expected cluster. Generate an alert if a newly observed device does not fall into any established authorized cluster (e.g., distance to nearest centroid exceeds a predefined threshold) or if an authorized device's current characteristics significantly shift it to a different cluster, indicating a potential rogue device or impersonation attempt."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to discover our wireless ICS protocols and frequencies? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Detection of unknown or unauthorized radio frequency (RF) signals exhibiting characteristics of reconnaissance, such as rapid frequency hopping (e.g., >5 channel changes per minute), broad-spectrum sweeps (e.g., spanning >100 MHz within a 5-second interval), or sudden, uncharacteristic power level changes (e.g., >10 dBm increase/decrease within 1 second), specifically observed within or directly adjacent to licensed/unlicensed bands utilized by ICS protocols (e.g., WirelessHART at 2.4 GHz, Zigbee at 900 MHz/2.4 GHz, 700 MHz public safety spectrum), persisting for more than 30 seconds.",
            "data_sources": [
              "Spectrum Analyzer Logs (e.g., Anritsu Field Master logs)",
              "Wireless IDS Logs (e.g., Cisco WLC system logs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical perimeter and airspace surrounding ICS facilities, focusing on sensitive areas like control rooms, substations, remote terminal units (RTUs), and field device arrays.",
            "action": "1. Symbolic Logic: Maintain an authoritative baseline of known and legitimate RF emissions (e.g., frequency ranges, typical power levels, modulation types, device IDs) within ICS operational bands. Query Spectrum Analyzer Logs for any detected RF signal within ICS operational frequency bands (e.g., 900 MHz, 2.4 GHz, 700 MHz) that does not match any entry in the authorized baseline profile and persists for more than 30 seconds. Additionally, implement rules to alert on signals exhibiting characteristics like: (a) continuous frequency sweeps across a band (e.g., >100 MHz sweep in <5 seconds), (b) rapid power fluctuations (>10 dBm change in <1 second) not associated with authorized devices, or (c) detection of non-standard modulation types within ICS bands. 2. Statistical Method: Continuously calculate the Shannon entropy of observed frequencies, power levels (e.g., in 5 dBm bins), and modulation types from Spectrum Analyzer Logs within defined ICS operational bands over rolling 1-minute windows. Establish a 30-day rolling baseline for these entropy values. Generate an alert if the current entropy value for any of these metrics exceeds the 99th percentile of its respective baseline for two consecutive 1-minute intervals, indicating a sudden and statistically significant increase in varied or unpatterned RF activity consistent with reconnaissance or broad-spectrum scanning. 3. Machine Learning: Train a Random Forest classification model using 90 days of labeled historical Spectrum Analyzer Logs data. Features for training should include frequency range, average power, peak power, bandwidth, modulation type, duration of emission, and rate of frequency change. Label data with categories such as 'legitimate ICS communication', 'environmental noise', or 'reconnaissance/scanning activity'. Continuously feed real-time spectrum data (e.g., 5-second snapshots) into the trained model. Generate an alert when a high-confidence classification (e.g., >90% probability) of 'reconnaissance/scanning activity' is detected within or adjacent to ICS operational frequencies."
          },
          {
            "description": "A sudden and statistically significant increase (e.g., >50% increase over 30-minute average) in failed connection attempts (e.g., Zeek conn_state S0, REJ, RST), authentication failures (e.g., Wireless Gateway Authentication Logs reporting 'invalid credentials'), or malformed ICS protocol packets (e.g., Zeek notice.log 'protocol_violation') observed in network traffic logs. This increase must originate from an IP address or wireless device ID not present in the ICS Asset Inventory Database or from a previously inactive IP/device ID (inactive for >30 days), and specifically target ICS wireless gateways or their associated authentication services, indicative of wireless reconnaissance or brute-forcing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Wireless Gateway Authentication Logs (e.g., RADIUS server logs)",
              "Wireless Gateway Traffic Logs",
              "Active Directory Security Logs (Windows Event ID 4625 for failed logins)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of ICS wireless gateways and associated authentication servers.",
            "action": "1. Symbolic Logic: Query Zeek conn.log for connection attempts to ICS wireless gateways (identified by destination IP and port) where the conn_state is S0 (connection attempt seen, no reply), REJ (connection rejected), or RST (connection reset). Filter for source IP addresses or wireless MAC addresses not present in the ICS Asset Inventory Database. Correlate these with Zeek notice.log for protocol_violation or scanning notices, and with Wireless Gateway Authentication Logs or Active Directory Security Logs (Windows Event ID 4625) for failed authentication attempts. Generate an alert if any single unknown source IP or MAC address generates more than 10 failed connection attempts, 5 protocol violation notices, or 3 failed authentication attempts within a 5-minute rolling window. 2. Statistical Method: For each unique source IP address or wireless device ID observed interacting with ICS wireless gateways, establish a 14-day rolling baseline for the average rate of: (a) failed connections (Zeek conn.log: conn_state=S0, REJ, RST), (b) protocol_violation notices (Zeek notice.log), and (c) failed authentication attempts (Wireless Gateway Authentication Logs or Active Directory Security Logs Windows Event ID 4625). Calculate the Z-score for the current 5-minute rates of these three metrics. Generate an alert for any source IP/device ID where the Z-score for any of these metrics exceeds 3.0 (3 standard deviations above the mean baseline) for two consecutive 5-minute intervals, indicating a statistically significant surge in suspicious activity consistent with reconnaissance or brute-forcing. 3. Machine Learning: Train an Isolation Forest anomaly detection model using 30 days of historical benign traffic data. Features for the model should include aggregated counts of: failed connections (Zeek conn.log), unique destination ports/services targeted, protocol violations (Zeek notice.log), and failed authentication attempts (Wireless Gateway Authentication Logs, Active Directory Security Logs Windows Event ID 4625) per source IP/device ID, aggregated over 1-minute intervals. Continuously feed real-time aggregated features into the trained model. Generate an alert if the anomaly score for any 1-minute interval exceeds the 99th percentile of historical anomaly scores, indicating a highly anomalous probing or reconnaissance attempt."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]