[
  {
    "information_requirement": "Has an adversary leveraged Autorun functionality or virtual disk images to execute malicious code on an ICS system? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0895",
        "name": "Autorun Image",
        "evidence": [
          {
            "description": "A new process (Windows Event ID 4688) is initiated from an executable path residing on a newly enumerated removable media volume (e.g., USB drive assigned a non-persistent drive letter E:\\, F:\\, G:\\) within 30 seconds of the device's insertion. The process's parent is 'explorer.exe' or 'cmd.exe', and the executable file (e.g., 'autorun.exe', 'autoplay.exe', 'start.exe', 'setup.exe') either lacks a valid digital signature, has an execution frequency below the 1st percentile of all observed executables on that specific host over the last 30 days, or its hash matches a known malicious indicator of compromise (IOC).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 2000",
              "Windows Event ID 2001",
              "Windows Event ID 12",
              "Windows Event ID 1006",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows-based Human-Machine Interfaces (HMIs), Engineering Workstations, Data Historians, and other ICS hosts in the control network or ICS DMZ with user-accessible removable media ports. Specifically, endpoints where physical access and removable media introduction are possible.",
            "action": "1. Symbolic Logic (Rule-based): a. Collect Windows Event ID 4688 (Process Creation) and Windows Event ID 2000/2001 (Device Install Start/End) or Windows Event ID 12/1006 (PnP Device Arrival) from all monitored hosts. b. For each Windows Event ID 4688 where 'Parent Process Name' is 'explorer.exe' or 'cmd.exe', verify if 'New Process Name' path contains a drive letter not present in a pre-defined whitelist of fixed system drives (e.g., C:\\, D:\\) or established network shares. c. Correlate these process creation events with a preceding Windows Event ID 2000, 2001, 12, or 1006 from the same host within a 30-second window, indicating recent removable media insertion. d. Immediately alert on any process named 'autorun.exe', 'autoplay.exe', 'start.exe', 'setup.exe', or similar known Autorun executables originating from such a non-whitelisted drive. e. Additionally, check the hash of the executable against a regularly updated threat intelligence feed (IOC list); generate a high-priority alert on any match. f. For any flagged process, check if the executable lacks a valid digital signature; prioritize unsigned executables for further investigation. 2. Statistical Method (Percentile/Entropy): a. Establish a 30-day baseline of process execution frequency for all unique executables on each host using Windows Event ID 4688. b. For any executable identified in step 1.b as originating from removable media, calculate its execution frequency over the last 30 days and determine its percentile rank relative to all other executables on that specific host. Flag executions where the frequency is below the 1st percentile (i.e., very rare or first-time execution). c. Calculate the Shannon entropy of the executable's filename and full path. Establish a baseline of entropy scores for known benign executables. Alert if the entropy score for a flagged executable exceeds the 99th percentile of this benign baseline, indicating high randomness often associated with obfuscation. d. For any process flagged by the above, monitor Zeek conn.log for immediate outbound connections (within 5 seconds) to non-internal IP addresses; calculate the Z-score of the volume of these connections compared to the host's normal outbound connection volume. Alert if the Z-score exceeds 3 standard deviations. 3. Machine Learning (Anomaly Detection/Classification): a. Train a supervised binary classification model (e.g., Random Forest, XGBoost) on historical Windows Event ID 4688 data. Features should include: 'Parent Process Name', 'New Process Name' (extracted path, filename), drive type (fixed/removable/network), digital signature status (boolean), executable hash reputation (from TI feed), Shannon entropy of path/filename, and execution frequency percentile. Label known Autorun abuses as '1' and benign activity as '0'. b. Deploy the trained model to score new process creation events. Alert when the model's prediction score for malicious activity exceeds a predefined threshold (e.g., 0.8), particularly for processes originating from removable media. c. Alternatively, use an unsupervised anomaly detection model (e.g., Isolation Forest) on a feature set including process creation metadata, execution frequency, and digital signature status, combined with the presence of recent removable media insertion events. Alert on process creation events with an anomaly score in the top 1% for a given host."
          },
          {
            "description": "Within an ICS virtual machine, a new process (Windows Event ID 4688) is initiated, particularly one that is unsigned or has an execution frequency below the 1st percentile on that VM over 30 days. This execution occurs within 60 seconds of a virtual disk attachment/mount event (e.g., Windows Event ID 15 for disk initialization, or hypervisor-level storage events indicating a virtual disk attachment). Immediately following this, the process initiates outbound network connections (Zeek conn.log, Zeek http.log, Zeek dns.log) to external IP addresses or domains identified as malicious, unclassified, or outside established baselines.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4697",
              "Windows Event ID 15",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Virtualization hosts (hypervisors) and their managed guest VMs in the ICS DMZ or control network (e.g., virtualized HMIs, data historians, domain controllers); network egress points for the ICS network, including firewalls and intrusion detection systems, and internal network segments within the ICS environment.",
            "action": "1. Symbolic Logic (IOC/Rule-based): a. Collect Windows Event ID 4688 (Process Creation) and Windows Event ID 4697 (Service Creation) from critical ICS VMs. b. Collect Windows Event ID 15 (System log - disk initialization) or integrate with hypervisor-level storage logs for virtual disk attachment events. c. For each new process (4688) or service (4697) creation, check if the executable's hash or filename matches any entry in a known threat intelligence IOC list. d. Correlate any suspicious process/service creation with a preceding virtual disk attachment event (Windows Event ID 15 or hypervisor log) on the same VM within a 60-second window. e. Immediately alert if a correlated event involves an executable lacking a digital signature or originating from an unusual temporary path (e.g., '%TEMP%\\autorun.exe'). f. Further correlate with outbound Zeek conn.log entries where 'id.resp_h' is a known malicious IP, or Zeek dns.log queries for blacklisted domains, or Zeek http.log requests to suspicious URLs within 30 seconds of the process execution. 2. Statistical Method (Percentile/Frequency/Entropy): a. Establish a 30-day baseline of normal process executions, their prevalence, and associated network connections (destination IPs, ports, protocols) for each critical VM using Windows Event ID 4688 and Zeek logs. b. Calculate the Shannon entropy of newly observed executable filenames; flag any executable with an entropy score in the top 5th percentile of all observed filenames on that VM as highly suspicious. c. For any new process execution, calculate the percentile rank of its subsequent outbound network connections (from Zeek conn.log) to previously unseen or unclassified destination IP addresses within a 60-second window. Alert if this percentile exceeds the 99th percentile of normal network activity for that VM. d. Calculate the frequency of unique process-destination IP pairs over time using Windows Event ID 4688 and Zeek conn.log; flag pairs with a Z-score exceeding 3 standard deviations from the historical mean for that VM. e. For any process execution from a newly mounted virtual disk, calculate the frequency of new unique DNS queries (Zeek dns.log) within 30 seconds; alert if this frequency exceeds the 95th percentile of normal activity for that VM. 3. Machine Learning (Time Series Anomaly Detection/Classification): a. Implement a multivariate time series anomaly detection model (e.g., Isolation Forest, Prophet with anomaly detection) on aggregated hourly counts of new process creations (Windows Event ID 4688), unique outbound network connections (Zeek conn.log), and unique DNS queries (Zeek dns.log) for each critical VM. Incorporate features like digital signature status and process prevalence from Windows logs. b. Train the model on historical data to learn normal patterns. Anomaly scores exceeding a dynamic threshold (e.g., top 1% of historical scores) for a given time window, especially when both process creation and network activity increase simultaneously and rapidly *after* a virtual disk mount event (flagged by Windows Event ID 15 or hypervisor logs), should trigger an alert. c. Train a binary classification model (e.g., SVM, Logistic Regression) to classify process execution events from virtual disks as benign or malicious, using features such as executable hash, digital signature, parent process, entropy, and immediate network activity characteristics (new destination IPs, high data volume) from Zeek logs."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "AI Assistant"
    ]
  }
]