[
  {
    "information_requirement": "Is an adversary removing indicators of compromise from mobile devices to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630",
        "name": "Indicator Removal on Host",
        "evidence": [
          {
            "description": "A mobile application clears its own cache or data, or that of another application, to remove forensic artifacts of its execution or user interaction.",
            "data_sources": [
              "MDM Application Activity Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android)",
            "action": "Monitor Mobile EDR/MTP logs for API calls related to clearing application data or cache (e.g., Android's clearApplicationUserData). Establish a baseline for legitimate apps that perform this function (e.g., browsers). Alert when a non-standard or recently installed application triggers this action, especially if it is not a user-initiated event. Use descriptive statistics to identify outlier applications performing this action with high frequency. Correlate the timestamp of the clearing event with network connection logs (Zeek conn.log) from the device's IP to check for preceding data exfiltration activity."
          },
          {
            "description": "A mobile application deletes files it has created, such as staged data, or deletes other system files like logs, messages, or call history to hide its activity.",
            "data_sources": [
              "MDM File Integrity Monitoring Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) server",
            "action": "Analyze file deletion events from MDM or Mobile EDR/MTP logs. Create a statistical baseline for the volume and type of files deleted by legitimate applications on a daily basis. Generate an alert if an application's file deletion activity exceeds a defined threshold (e.g., 95th percentile) or if it deletes files outside of its own sandboxed directory. Correlate high-volume file deletion events with preceding file transfer analysis from network traffic (Zeek files.log) to determine if data was exfiltrated before being deleted from the host."
          },
          {
            "description": "A malicious application removes its own icon from the device's home screen or uninstalls itself completely after achieving its objective to prevent user discovery.",
            "data_sources": [
              "MDM Application Inventory Log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android)",
            "action": "Continuously monitor the application inventory via MDM logs. Alert on any application uninstallation event that occurs within a short time window (e.g., less than 24 hours) of its installation. Calculate the entropy of the package names for recently installed/uninstalled apps; a high entropy score combined with a short lifespan is suspicious. Before the uninstallation record is purged, correlate the application's network activity by examining DNS requests (Zeek dns.log) made by the device during the application's active window to identify potential C2 infrastructure."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]