[
  {
    "information_requirement": "Is an adversary using default credentials for lateral movement within the OT network? (TA0109 - Lateral Movement)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0812",
        "name": "Default Credentials",
        "evidence": [
          {
            "description": "A successful network connection (Zeek conn.log proto is TCP, state is 'ESTABLISHED', and conn_state is not 'REJ' or 'S0') is observed from an IP address not previously associated with successful connections to a critical ICS device (e.g., PLC, RTU, HMI) on a standard or custom management port (e.g., 21, 23, 80, 443, 502, 102, 502, 20000, 44818). This connection originates from an unexpected network segment, a host not authorized for ICS management, or exhibits an unusual connection duration or byte volume compared to historical patterns for that specific destination device and port.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek ftp.log",
              "Zeek telnet.log",
              "Zeek modbus.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Level 1 (Process Control) and Level 2 (Supervisory Control) Control Systems Networks (PLCs, RTUs, HMIs, IEDs), DMZ between IT and OT networks (Purdue Model Level 3.5), Network segments connecting IT and OT zones, Engineering Workstations (EWS) directly connected to Level 2/1 devices, SCADA Servers, Historian Servers, Data Gateways.",
            "action": "1. Symbolic Logic: Query Zeek conn.log for all successful connections (proto=TCP, state=ESTABLISHED, conn_state not 'REJ' or 'S0') to known ICS device IPs (e.g., PLCs, RTUs) on typical management ports (e.g., 21, 23, 80, 443, 502, 102, 502, 20000, 44818). Correlate these connections with authentication logs (e.g., Zeek ssh.log, ftp.log, telnet.log) to identify login attempts using common default usernames (e.g., 'admin', 'operator', 'root', 'user', 'guest', 'engineer', 'maintenance') or with empty/trivial passwords. Flag any successful login using a common default username from an unauthorized or previously unseen source IP as a high-priority alert. Additionally, identify connections where the source IP is not present in an authorized whitelist for the destination ICS device. 2. Statistical Method: For each ICS device and management port, establish a baseline of normal connection characteristics over the past 30 days, including: 1) the count of distinct source IPs, 2) average connection duration, 3) average byte volume, and 4) frequency of authentication attempts (from Zeek ssh.log, ftp.log, telnet.log). Calculate the 95th and 99th percentiles for these metrics. Alert when: a) the number of distinct source IPs connecting to an ICS device exceeds the 99th percentile, b) a single source IP connects to more than 5 distinct ICS devices within a 10-minute window, c) a connection's duration or byte volume significantly deviates (e.g., 3 standard deviations or above 99th percentile) from the historical mean for that device/port, or d) a burst of authentication failures (e.g., >10 failures in 60 seconds) is immediately followed by a successful login using a common default username. 3. Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest, Autoencoder) on aggregated Zeek conn.log and authentication logs (ssh.log, ftp.log, telnet.log) targeting ICS devices. Features for the model should include source IP entropy, destination port, connection duration, byte volume, number of authentication attempts (success/failure), and unique username attempts. Identify connections or login sequences with high anomaly scores that deviate significantly from learned normal behavior, especially those involving new source IPs, unusual ports, or repeated attempts with default usernames. Focus on clusters of activity that might represent brute-force attempts followed by successful logins on multiple ICS assets."
          },
          {
            "description": "A successful user login (Windows Event ID 4624) on an Engineering Workstation (EWS) or Jump Server is immediately followed (within 60 seconds) by the creation of a process (Windows Event ID 4688) associated with remote access or file transfer (e.g., `pl_win.exe`, `putty.exe`, `ssh.exe`, `telnet.exe`, `ftp.exe`, `sftp.exe`, `winscp.exe`, `mstsc.exe`, `psexec.exe`, `net.exe` with `use` command). This process then initiates an outbound network connection (Zeek conn.log `state` is 'ESTABLISHED') from the EWS to an ICS device (e.g., PLC, RTU, HMI) on a standard or custom management port (e.g., 21, 23, 80, 443, 502, 102, 20000, 44818). This sequence of events is either entirely new for the user, occurs outside of their typical working hours, originates from an unusual source IP, or targets an ICS device not usually accessed by that user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek ftp.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Jump Servers accessing OT network, Historian Servers, SCADA Servers, Application Servers within the OT network, IT/OT DMZ gateways.",
            "action": "1. Symbolic Logic: Correlate Windows Event ID 4624 (successful logon) or 4648 (explicit credential logon) on an EWS or Jump Server with Windows Event ID 4688 (process creation) for remote access tools (e.g., `putty.exe`, `ssh.exe`, `telnet.exe`, `ftp.exe`, `sftp.exe`, `winscp.exe`, `mstsc.exe`, `psexec.exe`, `net.exe` with `use`) within 60 seconds, for the same Logon_ID. Link these host events with successful outbound network connections (Zeek conn.log `state` is 'ESTABLISHED') from the EWS to known ICS device IPs on management ports. Alert on any such correlated sequence if the user account used for login is known to have default credentials, if the destination ICS device is not typically accessed by that user, or if the process name is unusual for that user. 2. Statistical Method: Establish a multi-faceted behavioral baseline for each user account on EWS or Jump Servers over the past 60 days. Baseline features include: typical login times (e.g., working hours, day of week), source IP addresses/subnets for logins, frequency and type of remote management processes launched (Windows Event ID 4688), and the set of ICS devices accessed. Calculate a deviation score for each login and subsequent activity by comparing current characteristics against the user's baseline. Use descriptive statistics (e.g., sum of Z-scores for deviations, or a percentile rank) to identify activity sequences where the cumulative deviation score exceeds the 99th percentile, indicating high anomaly. For example, a login at 3 AM from a new IP followed by launching SSH to an ICS device not typically accessed by that user. 3. Machine Learning: Develop a User and Entity Behavior Analytics (UEBA) model using historical Windows Event ID 4624, 4648, 4688, and Zeek conn.log data from EWS and Jump Servers. Train a sequence-based anomaly detection model (e.g., LSTM, Transformer) to identify unusual sequences of user login, process creation, and network connection events. Features should include user ID, login time, process name, destination IP/port, connection duration, and historical frequency of the sequence. The model should learn typical user access patterns to ICS devices and flag sequences that are rare, entirely new, or exhibit characteristics consistent with default credential exploitation, such as a user suddenly accessing multiple new ICS devices."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]