[
  {
    "information_requirement": "Has an adversary caused a loss of availability in a critical ICS component? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0826",
        "name": "Loss of Availability",
        "evidence": [
          {
            "description": "A critical ICS host (e.g., HMI, Engineering Workstation, Historian Server) exhibits a complete cessation of outbound and inbound network communication for a duration exceeding 60 seconds, which correlates within a 5-minute window with the unexpected termination (crash) of a critical SCADA/control application process (e.g., HMI runtime, Historian data collection service) or an unscheduled system shutdown/restart event.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Windows Event ID 7036",
              "Windows Event ID 4608",
              "Windows Event ID 4609"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations, Operator Stations, Historian Servers, Data Gateways, and Domain Controllers located on the Process Control Network or ICS DMZ.",
            "action": "1. Statistical: For each critical ICS host, establish a rolling 7-day baseline for the average and standard deviation of inbound and outbound communication intervals (time between Zeek conn.log entries). Alert if a host fails to log any network communication for a period exceeding 3 standard deviations above its rolling average communication interval, or a fixed threshold of 60 seconds, whichever is greater. 2. Symbolic: Correlate alerts for network communication cessation with Windows Event IDs 1000 (Application Error), 1002 (Application Hang), or 7036 (Service Control Manager - service stopped) for critical ICS applications (e.g., HMI_Runtime.exe, Historian_Service.exe), or Windows Event IDs 4608 (System shutdown) or 4609 (System shutdown initiated by a process), occurring within a 5-minute window preceding the communication cessation. Prioritize alerts where the affected process is known to be critical to ICS operations. 3. Machine Learning: Develop and train a time-series anomaly detection model (e.g., Isolation Forest, LSTM autoencoder) on the frequency of Zeek conn.log entries for each critical ICS host. Retrain weekly. Alert when the model detects a significant anomaly in communication frequency (e.g., a sustained period of zero communication, or an abrupt drop in frequency below a learned threshold) with a high anomaly score, indicating a potential loss of availability."
          },
          {
            "description": "An anomalous and sustained surge (e.g., exceeding 100 events per minute for 5 consecutive minutes) in Windows Event ID 4663 (An attempt was made to access an object) events indicating file write, rename, or delete operations on critical ICS data directories (e.g., C:\\SCADA\\Projects, C:\\HistorianDB, D:\\PLC_Programs) on systems like Historian Servers or Engineering Workstations, particularly when accompanied by changes to file extensions (e.g., '.locked', '.encrypted') or mass deletion of files.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historian Servers, Engineering Workstations, File Servers hosting ICS project files and configurations, and Backup Servers storing critical ICS data, all located within the Process Control Network or ICS DMZ.",
            "action": "1. Statistical: For each critical ICS host, establish a 7-day rolling baseline for the rate of Windows Event ID 4663 events (Object Access: file write/delete/rename) per process, per minute, specifically targeting critical directories. Alert if any process's event rate exceeds the 99th percentile of its historical rate for 3 consecutive minutes. Additionally, calculate the Shannon entropy of file extensions modified by a process over a 5-minute window; alert on a sudden drop in entropy (e.g., below 0.5) indicating a uniform renaming pattern (e.g., all files renamed to '.encrypted'). 2. Symbolic: Correlate high rates of Windows Event ID 4663 events with Windows Event ID 4688 (A new process has been created) to identify the initiating process. Look for known ransomware executable names (e.g., 'conti.exe', 'revil.exe', 'ryuk.exe'), or suspicious command-line arguments (e.g., 'vssadmin.exe delete shadows', 'powershell.exe -enc ...', 'cipher.exe /w'), or the presence of specific file extensions (e.g., '.locked', '.enc', '.crypt', '.ransom') in the target file path recorded in ID 4663 events. 3. Machine Learning: Implement a clustering algorithm (e.g., DBSCAN or K-Means) on Windows Event ID 4663 events, using features such as initiating process name, target file path directory, and event timestamp within 5-minute windows. Train the model on historical benign file activity. Alert when a new cluster emerges that significantly deviates from learned benign clusters (e.g., a single process rapidly modifying files across numerous distinct directories, or renaming a large volume of files with a common, new extension), indicative of mass file manipulation."
          },
          {
            "description": "An abrupt and sustained increase (e.g., exceeding 50 new connections per minute or 100 MB/minute for 30 consecutive seconds) in network traffic volume or connection attempts from a source IP not whitelisted for communication with the Process Control Network, targeting critical ICS field devices (e.g., PLC, RTU, IED) on specific ICS protocol ports (e.g., Modbus TCP 502, EtherNet/IP 44818, DNP3 20000), which may coincide with observed device unresponsiveness or abnormal operational status indicators.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek profinet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The Process Control Network (PCN) segments, specifically network traffic directed at PLCs, RTUs, IEDs, and other field devices. This includes monitoring at network boundaries (e.g., Firewalls between PCN zones) and within specific control segments.",
            "action": "1. Statistical: For each critical ICS field device (PLC, RTU, IED), establish a rolling 7-day baseline for inbound connection rate (new connections/minute), total bytes transferred (bytes/minute), and unique source IPs observed in Zeek conn.log, specifically for ICS protocol ports. Alert if any of these metrics from a single source IP exceeds the 99th percentile of its historical distribution, or 4 standard deviations above a 30-minute moving average, sustained for at least 30 seconds. Focus on traffic destined for ports like 502, 44818, 20000. 2. Symbolic: Identify any source IP communicating with critical ICS devices over ICS protocol ports (e.g., Modbus TCP 502, EtherNet/IP 44818) that is not present on an approved allow-list for the Process Control Network. Correlate high traffic volume alerts with Zeek notice.log for specific notices such as DDoS::Syn_Flood, DDoS::Port_Scan, Scan::Address_Scan, or Protocol::Malformed_Packet originating from the same suspicious source IP, indicating potential denial-of-service or reconnaissance activity. 3. Machine Learning: Deploy a real-time unsupervised anomaly detection model (e.g., Isolation Forest, One-Class SVM) on network flow features extracted from Zeek conn.log (e.g., source/destination IP, port, protocol, byte count, packet count, duration, duration of connections to ICS devices) for traffic destined to critical ICS devices. Train the model on historical benign traffic patterns specific to ICS segments. Alert when the model identifies network flows or patterns of flows that are classified as anomalous with a high anomaly score (e.g., >0.7), indicating a significant deviation from normal communication behavior that could signify a denial-of-service attempt or unusual traffic flood."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]