[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via removable media? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0847",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process (e.g., executable, script, installer) is initiated on an ICS asset, and its execution path (Process.Image) or the parent process's execution path (ParentProcess.Image) is located on a removable drive letter (e.g., E:, F:, G:) that is not a standard fixed drive. This includes processes launched directly from the removable media or spawned by an autorun process from the removable media, indicating potential malware execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Data Gateways, SCADA Servers, any Windows-based ICS endpoint with USB/removable media access.",
            "action": "1. Symbolic Logic (IOC Match/Pattern): Collect Windows Event ID 4688 (Process Creation) from all critical ICS assets. Filter these events to identify processes where the 'New Process Name' or 'Process Command Line' field explicitly contains a removable drive letter prefix (e.g., 'E:\\', 'F:\\', 'G:\\', etc.) and the path is not part of a known legitimate removable device or approved software location. Immediately alert if the executable's hash (MD5, SHA256) matches a known malicious hash from reputable threat intelligence feeds (e.g., VirusTotal, CISA ICS Advisories) or if the process name/path matches a known suspicious pattern (e.g., 'autorun.inf', 'setup.exe' in non-standard locations, executables within 'RECYCLER' or 'System Volume Information' folders on removable media). 2. Statistical Method (Baseline Deviation): For all process creations originating from removable media, establish a statistical baseline over the past 90 days for each ICS asset. The baseline should include the historical frequency of unique executable names, typical parent processes, and execution times of day. Calculate a Z-score for the observed executable names and parent processes against their historical frequency. Generate a high-priority alert if a process executable name or parent process from a removable drive has a Z-score exceeding 3 standard deviations from its historical mean (indicating a statistically rare occurrence), or if it represents a completely novel executable (count of 0 in the baseline period) from removable media. 3. Machine Learning (Classification): Implement a supervised machine learning model (e.g., Random Forest, Gradient Boosting) trained on historical Windows Event ID 4688 data from ICS assets, labeled for legitimate versus malicious process executions from removable media. Features for the model should include: process name entropy, parent process name, drive type (fixed vs. removable), process command-line arguments (e.g., length, suspicious keywords, number of arguments), user context, and time of day. Apply this model to incoming real-time process creation events from removable media and generate an alert when the model classifies an event as 'malicious' with a confidence score above a defined threshold (e.g., 0.85), indicating a high probability of malicious activity."
          },
          {
            "description": "An ICS asset initiates an outbound network connection (TCP/UDP) to an external IP address (non-RFC1918) or an unauthorized internal IP address/port, or utilizes a non-standard application protocol, within 5 minutes of a process being launched from removable media on that same asset. This connection may exhibit characteristics of command and control (C2) or data exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The IT/OT network boundary, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Perimeter firewalls (for conn.log/dns.log), Network Intrusion Detection Systems (NIDS) at the IT/OT boundary, ICS network switches and routers (for Zeek sensor placement).",
            "action": "1. Symbolic Logic (IOC Correlation/Pattern Matching): Continuously correlate Windows Event ID 4688 (process creation from removable media) with Zeek conn.log, dns.log, http.log, and ssl.log entries. Match the 'Source_IP' from the Windows event to 'id.orig_h' in Zeek logs, ensuring the Zeek connection timestamp occurs within 5 minutes after the process launch. Generate a high-severity alert if the destination IP address or domain name observed in the network logs matches any entry on an external threat intelligence blacklist (e.g., known C2 servers, suspicious domains, ICS-specific advisories) or is an IP outside of an approved whitelist for the ICS asset/network segment. Prioritize connections to non-RFC1918 IP addresses, domains that are newly registered or have a low reputation score, or to ports/protocols not typically used by the asset or within the ICS environment. 2. Statistical Method (Behavioral Anomaly): For each critical ICS asset, establish a baseline over the last 30 days for network connections (Zeek conn.log) including: average daily unique destination IPs/ports, average bytes transferred per connection, connection duration, and common protocols. For network connections immediately following a removable media process execution (within the 5-minute window), calculate the percentile rank for the observed bytes transferred, connection duration, and destination port against the historical distribution for that specific asset. Trigger an alert if these metrics exceed the 95th or 99th percentile, or if the connection uses a protocol rarely seen from that asset (e.g., less than 0.5% of historical traffic) or a port that is not part of its normal operational profile. 3. Machine Learning (Time-Series Anomaly Detection): Employ a time-series anomaly detection model (e.g., Isolation Forest, LSTM Autoencoder) on aggregated network flow data (Zeek conn.log, dns.log) from critical ICS assets. Train the model on historical network activity (e.g., last 60 days) to learn normal patterns for metrics such as: outbound connection count, unique destination IP count, total data volume, and entropy of destination ports/protocols, specifically looking for changes in these metrics in 1-minute intervals. After a detected process execution from removable media, apply the model to the subsequent 5-minute window of network activity. Anomaly scores exceeding a predefined threshold (e.g., 0.9) in this post-execution window should trigger a high-fidelity alert, indicating potential C2 or data exfiltration attempts due to unusual network behavior."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]