[
  {
    "information_requirement": "Is an adversary capturing screen data from Human-Machine Interfaces (HMIs) or Engineering Workstations (EWS)? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0852",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "Execution of known screen capture utilities (e.g., psr.exe, SnippingTool.exe, PrintScreen.exe, Screenshot.exe) or scripting tools (e.g., powershell.exe, cmd.exe) with specific screen capture-related command-line arguments (e.g., '-Command \"Add-Type -AssemblyName System.Windows.Forms\"' or 'BitBlt') initiated by a non-whitelisted parent process or user account on an HMI or EWS.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations, Jump Servers within ICS network.",
            "action": "1. Symbolic Logic (IOC/Whitelist): Monitor Windows Event ID 4688 (Process Creation) or Sysmon Event ID 1 on HMIs and EWS. Create a whitelist of legitimate processes, their allowed parent-child relationships, and authorized user accounts specific to these critical assets. Generate an alert for the execution of any process not on the established baseline, paying special attention to built-in Windows tools that can perform screen captures (e.g., 'psr.exe', 'SnippingTool.exe', 'PrintScreen.exe', 'Screenshot.exe') or scripting engines ('powershell.exe', 'cmd.exe') containing known screen capture command-line arguments (e.g., 'Add-Type -AssemblyName System.Windows.Forms', 'BitBlt', 'Get-Screenshot', 'CaptureScreen'). Prioritize alerts where the parent process or user is also non-whitelisted. 2. Statistical Method (Rarity/Frequency): For each unique process path observed on HMIs/EWS, calculate its daily execution count. Establish a 14-day rolling baseline for each process's average daily execution count and standard deviation. Alert when a process's daily execution count exceeds 3 standard deviations above its historical mean. Additionally, calculate the frequency of each unique process name across all HMIs/EWS; flag any process with an execution frequency below the 5th percentile for the asset group, indicating extreme rarity. 3. Machine Learning (Classification): Utilize a pre-trained supervised classification model (e.g., Random Forest or XGBoost), trained on historical legitimate process execution data (including process name, parent process, command-line arguments, user context, and execution path), to evaluate new process creation events. Review model-generated alerts for events classified as 'anomalous' or 'malicious' on ICS assets, focusing on events with a high confidence score (e.g., >0.8) that deviate from established operational baselines."
          },
          {
            "description": "Creation of image files (e.g., .png, .jpg, .bmp, .tiff, .gif) in non-standard or temporary directories (e.g., %TEMP%, %APPDATA%, C:\\Windows\\Temp) or by processes not typically associated with image generation (e.g., cmd.exe, powershell.exe, or unknown executables) on an HMI or EWS.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI/EWS local file systems, particularly temporary directories, user profile folders, and shared network drives accessible by HMIs.",
            "action": "1. Symbolic Logic (IOC/Whitelist): On HMI and EWS endpoints, monitor for file creation events (Sysmon Event ID 11) with image file extensions ('.png', '.jpg', '.bmp', '.tiff', '.gif'). Establish a whitelist of legitimate processes (e.g., HMI software generating reports) and specific directories allowed to create these files (e.g., designated report output folders). Generate an alert when an image file is created in a temporary directory (%TEMP%, %APPDATA%, C:\\Windows\\Temp) or by a process not on the whitelist (e.g., 'cmd.exe', 'powershell.exe', or unknown executables), especially if the creating process is not whitelisted to write to that specific directory. 2. Statistical Method (Entropy/Volume): For each HMI/EWS, establish a 30-day rolling baseline for the average daily count of image file creations. Alert if the daily count exceeds 3 standard deviations above this historical mean. Additionally, calculate the Shannon entropy for filenames of newly created image files; flag filenames with an entropy score exceeding the 95th percentile, as high-entropy (random-looking) filenames can indicate automated tool output. 3. Machine Learning (Anomaly Detection): Deploy a time-series anomaly detection model (e.g., Isolation Forest or Prophet) to monitor the rate of image file creation events per HMI/EWS. Train the model on historical data to predict expected creation rates and review model-generated alerts when actual rates deviate significantly (e.g., a sudden, sustained spike or unusual frequency pattern) from predictions, considering factors like file size and creation time."
          },
          {
            "description": "Outbound network connections from HMIs or EWS exhibiting statistically anomalous 'orig_bytes' values (e.g., exceeding the 99th percentile of historical traffic for that host and destination port) or to external/unapproved internal destinations, indicating potential data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, OT/IT Network Boundary, Purdue Model Level 2/3 systems, ICS DMZ, Internet Gateway.",
            "action": "1. Symbolic Logic (IOC/Whitelist): Analyze Zeek conn.log data for all outbound connections originating from HMIs and EWS. Create a whitelist of approved destination IP addresses, domains (resolved via Zeek dns.log), and ports for these critical assets. Trigger an alert for any connection from an HMI/EWS to an unapproved external IP address, domain, or unapproved internal IP (IOC match). Additionally, monitor Zeek http.log for HTTP POST requests originating from HMIs/EWS with unusually large 'resp_body_len' or 'orig_bytes' (e.g., exceeding 10MB) to non-whitelisted destinations. 2. Statistical Method (Percentile/Standard Deviation): For each HMI/EWS source IP, establish a rolling 7-day baseline for the 'orig_bytes' field across all outbound connections, calculating the mean, standard deviation, and 99th percentile. Trigger an alert for any new connection where the 'orig_bytes' value exceeds the 99th percentile of this baseline, or if the average 'orig_bytes' for a 15-minute window exceeds 3 standard deviations above the historical mean for that host. Enrich alerts with destination IP reputation data to prioritize connections to unknown or suspicious external addresses. 3. Machine Learning (Clustering/Behavioral Anomaly): Apply a clustering algorithm (e.g., K-means or DBSCAN) to group network connections from HMIs/EWS based on features such as 'orig_bytes', 'resp_bytes', destination port, protocol, and time of day. Review alerts for connections that fall into small, isolated clusters and significantly deviate from established normal communication patterns for each HMI/EWS (e.g., large outbound data transfers to a new external IP or domain), indicating possible exfiltration. Prioritize clusters with high 'orig_bytes' and low frequency."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]