[
  {
    "information_requirement": "Is an adversary using a rootkit to hide their presence on ICS assets? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0851",
        "name": "Rootkit",
        "evidence": [
          {
            "description": "A quantitative mismatch between outbound network connections detected in Zeek conn.log from an ICS host and the absence of corresponding process creation events (Windows Event ID 4688) or network filtering platform events (Windows Event ID 5156) on that same host within a 10-second time window, specifically for connections to external or unauthorized internal destinations.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Data Gateways/Firewalls segmenting OT networks",
            "action": "1. **Symbolic Logic:** For each unique ICS `id.orig_h` (e.g., EWS, HMI, Historian), identify all outbound network connections in Zeek conn.log where `id.resp_h` is outside the known ICS network boundary or to an unauthorized internal segment. For each such Zeek connection, search Windows Event ID 4688 (process creation) for a `ProcessId` or Windows Event ID 5156 (network filtering platform event) for a matching `Source Port`/`Destination Port` on the corresponding host (`id.orig_h`) within +/- 10 seconds of the Zeek connection's `ts`. If no corresponding host-side event is found, flag the Zeek connection as 'unattributed network activity'. Generate a high-priority alert for any single instance of unattributed network activity to an external IP or known malicious IP."
          },
          {
            "description": "Observation of a new Windows service installation (Windows Event ID 7045) or an unauthorized modification to an existing service's `Start Type` or `Image Path` (Windows Event ID 7040) on an ICS asset, specifically when the `Service Name` or `Image Path` is unknown, suspicious, or not correlated with an approved change management system entry.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 7040"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Domain Controllers in the OT network, Historian Servers, SCADA Servers, OPC Servers",
            "action": "1. **Symbolic Logic:** Maintain a dynamic baseline of approved Windows services, including `Service Name`, `Image Path`, `Start Type`, and associated `Account Name` for all critical ICS assets. For every Windows Event ID 7045 (`Service Name`, `Image Path`, `Account Name`, `Start Type`) or Windows Event ID 7040 (`Service Name`, `Start Type`, `Image Path`), compare the event details against the approved baseline for the specific host. Generate an immediate high-priority alert if: 1) a new service (Event ID 7045) is installed that is not in the baseline, 2) an existing service's `Image Path` or `Start Type` (Event ID 7040) deviates from the baseline, or 3) a service is installed/modified by an unauthorized `Account Name`. Additionally, flag services with empty or highly obfuscated `Image Path` values."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using a rootkit to inhibit the response function of an ICS device? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0851",
        "name": "Rootkit",
        "evidence": [
          {
            "description": "A statistically significant and sustained increase in failed TCP connection states, specifically 'REJ' (Connection Refused), 'RSTO' (Originator timed out), or 'RSTR' (Responder timed out) in Zeek conn.log, observed between critical ICS supervisory control hosts (e.g., HMIs, SCADA servers) and their managed field devices (e.g., PLCs, RTUs) on known ICS protocol ports, where this increase deviates from established operational baselines.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting Level 2 (Supervisory Control) and Level 1 (Basic Control) devices, DMZ between IT and OT networks, Process Control Networks (PCN)",
            "action": "1. **Symbolic Logic:** Filter Zeek conn.log for connections between known ICS supervisory control hosts (e.g., HMIs, SCADA servers) and field devices (e.g., PLCs, RTUs) on designated ICS protocol ports (e.g., Modbus TCP 502/TCP, Siemens S7Comm 102/TCP, EtherNet/IP 44818/TCP). Identify connections where the `conn_state` field is 'REJ', 'RSTO', or 'RSTR'. For each such event, extract `id.orig_h`, `id.resp_h`, `id.resp_p`, `conn_state`, and `ts`. Immediately generate a medium-priority alert if a single `id.orig_h`-to-`id.resp_h` pair generates more than 5 such failed connections within a 60-second window."
          },
          {
            "description": "Repeated occurrences of critical HMI or SCADA application crashes (Windows Event ID 1000 - Application Error, Windows Event ID 1001 - Application Crashing Events) on operator workstations or HMI servers, specifically when these crashes are preceded by or concurrent with communications (as identified in Zeek conn.log) with specific, potentially compromised, field devices (PLCs/RTUs) on ICS protocol ports. This suggests malformed data transmission, corrupted device responses, or memory integrity issues.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 1001",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Operator Workstations, SCADA Engineering Workstations",
            "action": "1. **Symbolic Logic:** On all HMI/operator workstations and HMI servers, monitor for Windows Event ID 1000 (`Faulting application name`, `Faulting module name`, `Exception Code`, `Computer`, `TimeCreated`) and Windows Event ID 1001 (`Report ID`, `Computer`, `TimeCreated`). Filter for 'Faulting application name' matching known HMI/SCADA software executables (e.g., `FactoryTalkView.exe`, `WinCC.exe`, `Ignition.exe`). For each identified crash, correlate the `Computer`'s IP address and `TimeCreated` (within a +/- 15-second window) with Zeek conn.log entries from that IP, specifically looking for recently active connections to known field device IP addresses (PLCs/RTUs) on ICS protocol ports. Generate a medium-priority alert if an HMI/SCADA application crash is directly preceded by or concurrent with communication to a field device."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]