[
  {
    "information_requirement": "Is the adversary attempting to disable or manipulate the Safety Instrumented System (SIS)? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0880",
        "name": "Loss of Safety",
        "evidence": [
          {
            "description": "A log record showing the transfer of a PLC logic file (e.g., .L5X, .PRO, .SGF) from an Engineering Workstation (EWS) to a Safety Instrumented System (SIS) PLC. The transfer is considered anomalous if it occurs outside of a documented maintenance window, originates from an unauthorized user account or IP address, or uses a non-standard protocol for logic downloads.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4672",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek smb.log",
              "Zeek ftp.log",
              "Zeek s7comm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) within the Process Control Network (PCN), SIS network segment, OT/IT Demilitarized Zone (DMZ) gateways, SIS PLCs.",
            "action": "1. Symbolic Logic: Create and maintain a watchlist of SIS programming software executables (e.g., `Studio5000.exe`, `TriStation.exe`). Monitor EWS hosts for process creation events (Windows Event ID 4688) matching this list. For each match, correlate the process with the user's login session (Windows Event ID 4624) to verify the user is on an authorized list. Simultaneously, monitor network logs (e.g., Zeek files.log, smb.log, s7comm.log) for file transfers from the EWS IP to a known SIS PLC IP within a 5-minute window. Alert if an unauthorized user initiates a transfer or if any transfer occurs outside a scheduled maintenance period.\n2. Statistical Method: Using historical Zeek conn.log and files.log data, establish a 30-day rolling baseline for legitimate logic downloads between EWS-PLC pairs. Calculate the 99th percentile for file transfer sizes (by correlating Zeek's `fuid` between files.log and conn.log to get total bytes) and connection durations. Alert if a new logic file transfer's size or duration exceeds its respective 99th percentile, suggesting an unusually large or prolonged transfer that could indicate a malicious payload or reconnaissance.\n3. Machine Learning Application: Train a classifier model (e.g., Random Forest) to label logic downloads as 'authorized maintenance' or 'anomalous'. Use features such as source IP, destination IP, user account (enriched from host logs), network protocol, file size, hour of day, and day of week. A binary feature indicating if the event occurred within a scheduled maintenance window is critical. An 'anomalous' prediction with a high confidence score should trigger an immediate investigation."
          },
          {
            "description": "A network log showing the use of specific ICS protocol commands or function codes known to inhibit, bypass, or override safety functions, such as forcing a safety relay to an unsafe state or disabling a critical trip alarm. The command is anomalous if it originates from an unauthorized host, an unauthorized user, or occurs outside a predefined operational context like scheduled testing or maintenance.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Safety Instrumented System (SIS) network segment, Process Control Network (PCN), SIS PLCs, Industrial Demilitarized Zones (IDMZ).",
            "action": "1. Symbolic Logic: Implement SIEM rules or Zeek scripts that monitor ICS protocol logs (modbus.log, s7comm.log) for a strict watchlist of commands sent to SIS device IP addresses. This list must include function codes that can alter a safety state (e.g., Modbus function code 5 'Write Single Coil', S7comm 'Write Var') targeting safety-critical memory addresses or tags. Generate a high-severity alert if the command's source IP is not on an explicit whitelist of authorized EWS/HMI devices.\n2. Statistical Method: For each whitelisted source and destination SIS PLC pair, establish a 30-day baseline of command frequencies and parameter value distributions from Zeek ICS logs. Calculate the entropy of function codes observed in 5-minute windows. Alert if the frequency of a critical command exceeds 3 standard deviations from its baseline, or if the command entropy for a device suddenly spikes, indicating a novel and unpredictable sequence of commands inconsistent with normal operations.\n3. Machine Learning Application: Develop a sequence anomaly detection model (e.g., using an LSTM autoencoder) trained on historical sequences of ICS commands ((source IP, destination IP, command, parameters)) captured in Zeek logs. The model learns the legitimate 'grammar' of device communication during normal operations. Alert when a new sequence of commands results in a high reconstruction error, indicating a statistically significant deviation from learned safe and normal operational sequences."
          },
          {
            "description": "A sudden and sustained surge in network traffic directed at a Safety Instrumented System (SIS) PLC, characterized by an abnormally high rate of connection attempts, malformed packets, or unusual protocol usage, which leads to resource exhaustion and unresponsiveness of the safety device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek weird.log",
              "Zeek packet_filter.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIS network segment, SIS PLCs, Industrial Demilitarized Zones (IDMZ), Network firewalls and routers separating process control zones, Core Process Control Network (PCN) switches.",
            "action": "1. Symbolic Logic: Deploy a SIEM rule that queries Zeek conn.log every 30 seconds for connections to the SIS PLC watchlist where the connection state is 'S0' (SYN sent, no reply), 'S1' (SYN-ACK sent, no reply), or 'REJ' (connection rejected). If the count from a single source IP to a single SIS PLC exceeds a threshold (e.g., 300 connections in 30 seconds), generate an alert. Also, monitor Zeek notice.log for `Scan::Address_Scan` or `DoS::Excessive_Connections` notices targeting SIS assets.\n2. Statistical Method: For each SIS PLC, establish a 30-day rolling baseline from Zeek conn.log for the following metrics calculated per minute: total connections, unique source IPs, total inbound bytes, and the entropy of `conn_state` values. Generate an alert if the connection count or unique source IP count exceeds its 99th percentile, or if the connection state entropy drops sharply (indicating a flood of a single state like 'S0'), for two consecutive minutes.\n3. Machine Learning Application: Implement a time-series forecasting model (e.g., ARIMA) for key traffic metrics per SIS PLC, such as inbound packets per second and bytes per second, using Zeek conn.log data. The model should account for known operational seasonality (e.g., shift changes). Generate an alert when the observed traffic volume consistently exceeds the model's predicted upper confidence interval for a sustained period (e.g., >60 seconds), indicating a volumetric anomaly not explained by normal process cycles."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]