[
  {
    "information_requirement": "Is an adversary attempting to execute code via Autorun on an ICS system? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0895",
        "name": "Autorun Image",
        "evidence": [
          {
            "description": "A new process (Windows Event ID 4688) is initiated from an executable path residing on a newly mounted removable media volume (e.g., USB drive assigned a non-persistent drive letter such as E:\\, F:\\, G:\\) or a virtual disk image. The process's parent is 'explorer.exe' or 'cmd.exe', and the executable file (e.g., 'autorun.exe', 'autoplay.exe', 'start.exe', 'setup.exe') lacks a valid digital signature or has an execution frequency below the 1st percentile of all observed executables on that specific host over the last 30 days.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Driver Loaded)",
              "Windows Event ID 7045",
              "Windows Event ID 2000 (Device Install Start)",
              "Windows Event ID 4663 (Attempted Access to Object)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows-based Human-Machine Interfaces (HMIs), Engineering Workstations, Data Historians, and other ICS hosts in the control network or ICS DMZ with user-accessible removable media ports. Specifically, endpoints where removable media is permitted or could be physically introduced.",
            "action": "1. Symbolic Logic (Rule-based): Monitor for Windows Event ID 4688 (Process Creation). Identify events where the 'New Process Name' path contains a drive letter that is not present in a pre-defined whitelist of fixed system drives (e.g., C:\\, D:\\) or established network shares. Additionally, filter for 'Parent Process Name' being 'explorer.exe' or 'cmd.exe', and the 'New Process Name' pointing to an executable directly within the root or a common subfolder (e.g., '\\') of such a non-whitelisted drive. Immediately alert on any process named 'autorun.exe', 'autoplay.exe', 'start.exe', 'setup.exe', or similar known Autorun executables. Correlate with Windows Event ID 2000 (Device Install Start) to confirm recent removable device insertion. 2. Statistical Method (Percentile/Z-score): For processes identified as originating from removable media, calculate the Z-score of the execution frequency for that specific executable and its parent process combination over the last 30 days, per host. Flag executions where the Z-score exceeds 3 standard deviations from the historical average for that specific host. Furthermore, calculate the 95th percentile of observed executable file sizes from removable media on a per-host basis; flag any new executable exceeding this percentile as potentially anomalous. Calculate the Shannon entropy of the executable path and filename; alert if the entropy exceeds the 99th percentile of observed benign executable paths. 3. Machine Learning (Classification): Train a binary classification model (e.g., Random Forest or Gradient Boosting) using features extracted from Windows Event ID 4688, such as process name, parent process, drive type (fixed/removable/network), digital signature status (signed/unsigned), executable file size, entropy of the executable path, and prevalence score (inverse frequency). Label known benign executions as '0' and known malicious (or highly suspicious) as '1'. Deploy this model to score new process creation events. An event with a classification score above a defined threshold (e.g., 0.8) indicates a high probability of malicious Autorun execution, triggering an alert for analyst review."
          },
          {
            "description": "Within an ICS virtual machine, a new process (Windows Event ID 4688) is initiated, particularly one that is unsigned or has an execution frequency below the 1st percentile on that VM over 30 days. This execution occurs within 60 seconds of a virtual disk attachment/mount event (e.g., Windows Event ID 15 from the System log for disk initialization or a hypervisor-specific event for virtual disk changes, if integrated), followed by outbound network connections (Zeek conn.log) to external IP addresses or domains identified as malicious, unclassified, or outside established baselines (Zeek dns.log).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4697",
              "Windows Event ID 15",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Virtualization hosts (hypervisors) and their managed guest VMs in the ICS DMZ or control network (e.g., virtualized HMIs, data historians, domain controllers); network egress points for the ICS network, including firewalls and intrusion detection systems.",
            "action": "1. Symbolic Logic (IOC/Rule-based): Monitor Windows Event ID 4688 for process creations within critical ICS VMs. Immediately alert if the 'New Process Name' matches a hash or filename entry in a known threat intelligence IOC list. Additionally, detect if a new service (Windows Event ID 4697) is installed where the 'Service File Name' points to an executable on a temporary drive letter or an unusual path (e.g., '%TEMP%\\autorun.exe'). Correlate these process/service events with Windows Event ID 15 (System log, disk initialization) within a 60-second window. Further correlate with outbound Zeek conn.log entries where the 'id.resp_h' is a known malicious IP or the 'query' in Zeek dns.log resolves to a blacklisted domain. 2. Statistical Method (Percentile/Frequency): Establish a baseline of normal process executions, their prevalence, and associated network connections for each critical VM. Calculate the Shannon entropy of newly observed executable filenames; flag any executable with an entropy score in the top 5th percentile of all observed filenames on that VM as highly suspicious. For any new process execution, calculate the percentile rank of its subsequent outbound network connections (from Zeek conn.log) to previously unseen or unclassified destination IP addresses within a 60-second window. Alert if this percentile exceeds the 99th percentile of normal network activity for that VM. Calculate the frequency of unique process-destination IP pairs over time; flag pairs with a Z-score exceeding 3 standard deviations from the historical mean. 3. Machine Learning (Time Series Anomaly Detection): Implement a multivariate time series anomaly detection model (e.g., Isolation Forest or LSTM Autoencoder) on aggregated hourly counts of new process creations (Windows Event ID 4688), unique outbound network connections (Zeek conn.log), and unique DNS queries (Zeek dns.log) for each critical VM. Train the model on historical data to learn normal patterns. Anomaly scores exceeding a dynamic threshold (e.g., top 1% of historical scores) for a given time window, especially when both process creation and network activity increase simultaneously and rapidly, should trigger an alert, indicating potential malicious activity following a virtual disk mount event. The model should also incorporate features like digital signature status and process prevalence."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "AI Assistant"
    ]
  }
]