[
  {
    "information_requirement": "Is the adversary establishing persistence using a malicious Port Monitor?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1547.010",
        "name": "Port Monitors",
        "evidence": [
          {
            "description": "A registry value modification to 'Driver' under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors points to a DLL whose file hash matches a known malicious indicator from threat intelligence feeds.",
            "data_sources": [
              "Sysmon Event ID 13",
              "Windows Event ID 4657",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Print Servers, Windows Domain Controllers",
            "action": [
              "Query for registry value set events (Sysmon Event ID 13) where the TargetObject ends with a Print Monitor 'Driver' value. Extract the file path from the Details field. Correlate this path with file creation events (Sysmon Event ID 11) to retrieve the file hash. Alert if the hash matches any entry in the organization's threat intelligence database of known malicious file hashes.",
              "Aggregate all file paths specified in the 'Driver' value of Print Monitor registry keys across all endpoints over a 30-day baseline period. Calculate the prevalence (percentage of endpoints) for each unique DLL path. Alert on any new or modified Print Monitor registration where the specified DLL path has a prevalence below a defined threshold (e.g., <1% of endpoints), excluding known good software and patch-related DLLs.",
              "Implement a pre-trained or develop a classification model (e.g., Random Forest, Gradient Boosting) to score the risk of a new Port Monitor DLL. For each new DLL identified in a Print Monitor registry key, extract features such as file entropy, presence and validity of a digital signature, the file's enterprise-wide prevalence, and characteristics of the process that wrote the registry key. A prediction score exceeding a calibrated threshold (e.g., >0.85) should generate an alert for analyst review."
            ]
          },
          {
            "description": "A new registry subkey is created under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors, and its 'Driver' value is set to a DLL that was created on the host within the preceding 5 minutes.",
            "data_sources": [
              "Sysmon Event ID 12",
              "Sysmon Event ID 13",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Print Servers",
            "action": [
              "Create a correlation search that triggers when a registry key creation (Sysmon Event ID 12) under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors is followed within 5 minutes by a registry value set (Sysmon Event ID 13) to the 'Driver' value within that new key, AND this event is preceded by the creation (Sysmon Event ID 11) of the target DLL file within the same 5-minute window on the same host.",
              "Establish a baseline list of known-good Port Monitor subkey names (e.g., 'Local Port', 'Standard TCP/IP Port'). For each new key creation event (Sysmon Event ID 12) under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors, calculate the Shannon entropy of the new key's name. Alert if the key name is not in the baseline AND its entropy score exceeds a threshold (e.g., >3.5), suggesting a randomly generated name.",
              "Apply a time-series anomaly detection model (e.g., Seasonal-ARIMA) to the count of new Port Monitor registry key creations per host, aggregated into hourly buckets. An alert should be generated when the number of creations on a host spikes significantly beyond the predicted range based on its historical behavior, especially outside of typical software deployment windows."
            ]
          },
          {
            "description": "The Print Spooler service process (spoolsv.exe) loads a DLL module (ImageLoad event) from a non-standard or user-writable directory (e.g., C:\\Users\\*, C:\\Windows\\Temp\\, C:\\ProgramData\\*).",
            "data_sources": [
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Print Servers",
            "action": [
              "Create a detection rule that triggers when a Sysmon Event ID 7 (Image loaded) event shows Image: '...\\spoolsv.exe' loading a DLL (ImageLoaded field) from a user-writable directory like C:\\Users\\*, C:\\ProgramData\\*, or C:\\Windows\\Temp\\*.",
              "Aggregate all DLLs loaded by spoolsv.exe (Sysmon Event ID 7) across the enterprise to create a prevalence baseline. For each new image load event, calculate the prevalence of the loaded DLL's hash. Alert when spoolsv.exe loads a DLL whose hash has a prevalence below a set threshold (e.g., seen on fewer than 10 machines or <0.1% of the fleet).",
              "Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) that scores each spoolsv.exe image load event. Input features should include the loaded DLL's file path entropy, the validity of its digital signature (Signed and SignatureStatus fields), its enterprise-wide prevalence, and whether it was loaded shortly after a registry modification to Print Monitors. Events with high anomaly scores should be flagged for investigation."
            ]
          },
          {
            "description": "The process spoolsv.exe initiates an outbound network connection (not to an RFC1918 address) to a destination IP or domain that does not match an established baseline of legitimate print services, update servers, or known-good destinations.",
            "data_sources": [
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Network Egress Points (Firewalls/Proxies), DNS Servers",
            "action": [
              "Join host-based network connection events (Sysmon Event ID 3) where ProcessImage is '...\\spoolsv.exe' with network logs (Zeek conn.log) on source/destination IP and port. Alert if the destination IP or resolved domain (from Zeek dns.log) matches a known C2 indicator from a threat intelligence feed.",
              "From Zeek conn.log and dns.log data, build a baseline of destination IP addresses, ports, and fully-qualified domain names (FQDNs) contacted by spoolsv.exe processes. Calculate the rarity of each destination FQDN's top-level domain (TLD) and second-level domain (SLD). Alert on connections from spoolsv.exe to destinations with a domain or TLD in the bottom 1st percentile of prevalence.",
              "For each host, apply a time-series anomaly detection model to the orig_bytes and connection frequency in Zeek conn.log for traffic originating from spoolsv.exe. Model features should include bytes sent, connection duration, and inter-arrival time between connections. Flag anomalies such as the emergence of periodic, beacon-like connections (stable inter-arrival time) or unusually large data transfers that deviate from the host's historical baseline."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting privilege escalation using Port Monitors?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1547.010",
        "name": "Port Monitors",
        "evidence": [
          {
            "description": "The execution of a process whose hash or name matches a known privilege escalation tool (e.g., PrintSpoofer) is followed within 60 seconds by a registry modification to a HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors 'Driver' value on the same host.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Servers (Non-Domain Controllers)",
            "action": [
              "Create a correlation rule that triggers when a process creation event (Sysmon Event ID 1 / Windows Event ID 4688) with a file hash matching a known Port Monitor exploit tool (e.g., PrintSpoofer) is observed on a host, and is followed within 60 seconds by a registry value set event (Sysmon Event ID 13) where the TargetObject is a 'Driver' value under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors.",
              "For every process that modifies a Print Monitor registry key, analyze its command line arguments (from Sysmon Event ID 1). Calculate the entropy and length of the command line. Establish a baseline for these metrics from known administrative tools (e.g., reg.exe). Alert when a modification is performed by a process whose command line entropy or length exceeds 2 standard deviations from the established baseline.",
              "Implement a sequence analysis model (e.g., an LSTM-based autoencoder) trained on sequences of Sysmon event IDs (1, 7, 11, 13) from each host. The model learns normal sequences related to software installation. Flag any sequence of events that has a high reconstruction error and matches the pattern: [Process Create (e.g., cmd.exe) -> Process Create (exploit tool) -> File Create (DLL) -> Registry Set (Port Monitor) -> Image Load (spoolsv.exe loads DLL)]."
            ]
          },
          {
            "description": "A registry value modification to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors is performed by a process running with medium or low integrity, or as a user who is not a member of a privileged group (e.g., Administrators, SYSTEM).",
            "data_sources": [
              "Sysmon Event ID 13",
              "Windows Event ID 4657",
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Domain Controllers (for user context lookup)",
            "action": [
              "Create a detection rule that triggers when a registry write event (Sysmon Event ID 13) to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors has a User field value that is not 'NT AUTHORITY\\SYSTEM', 'NT AUTHORITY\\LOCAL SERVICE', or a member of the local 'Administrators' group.",
              "Analyze all registry writes to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors and join with the creating process information (Sysmon Event ID 1) to get the IntegrityLevel. Establish a baseline that shows >99.9% of these events are initiated by processes with 'System' or 'High' integrity. Generate a high-severity alert for any write event initiated by a process with 'Medium' or 'Low' integrity.",
              "Deploy a classification model (e.g., Logistic Regression) to score the risk of each Print Monitor registry write. Features for the model should include: User account type (standard vs privileged), process IntegrityLevel, parent process name (e.g., svchost.exe vs cmd.exe), and session ID (interactive vs non-interactive). A high risk score from the model indicates a likely privilege escalation attempt."
            ]
          },
          {
            "description": "The parent process of a process that modifies the HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors registry is an anomalous process, such as an interactive shell (powershell.exe, cmd.exe) or an Office application (winword.exe), rather than a trusted installer (msiexec.exe, svchost.exe).",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Application Servers",
            "action": [
              "Create a rule that triggers when a registry write (Sysmon Event ID 13) to HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors is performed by a process whose parent process (from Sysmon Event ID 1) is 'cmd.exe', 'powershell.exe', 'winword.exe', 'excel.exe', 'outlook.exe', 'wscript.exe', or 'cscript.exe'.",
              "Maintain a frequency-ranked list of parent process names that initiate modifications to Print Monitor registry keys. Establish a baseline of legitimate parent processes (e.g., 'svchost.exe', 'msiexec.exe', trusted installer services). Alert when a Print Monitor key is modified by a process whose parent is not in the top 95% of this baseline, indicating a rare and suspicious process chain.",
              "Utilize a graph database to model process creation events (Sysmon Event ID 1) as a directed graph. For any process that modifies a Print Monitor registry key, analyze its ancestry chain (parent, grandparent, etc.). Apply a graph-based anomaly detection algorithm to identify and alert on chains that are structurally rare or contain suspicious nodes, such as an Office application spawning a shell that ultimately leads to the registry modification."
            ]
          },
          {
            "description": "The spoolsv.exe process loads a new or low-prevalence DLL (Sysmon Event ID 7) within minutes of the same host exhibiting user-level reconnaissance activity (e.g., execution of 'whoami', 'net user', 'ipconfig') or credential access attempts.",
            "data_sources": [
              "Sysmon Event ID 7",
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Domain Controllers",
            "action": [
              "Create a correlation rule that triggers when a spoolsv.exe image load event (Sysmon Event ID 7) for an unsigned or low-prevalence DLL occurs within 10 minutes after a process access event (Sysmon Event ID 10) targeting 'lsass.exe' on the same host, where the SourceImage is not a known security scanner or EDR agent.",
              "Implement a host-based risk scoring system. Increment a host's score for each observed reconnaissance command ('whoami', 'net user', 'query user', etc.) or credential access attempt (Sysmon Event ID 10 to 'lsass.exe'). If a host's risk score exceeds a dynamic threshold (e.g., 3 standard deviations above the fleet-wide average), and this is followed within an hour by spoolsv.exe loading a new DLL (Sysmon Event ID 7), generate a high-severity alert.",
              "Train a supervised classifier (e.g., Gradient Boosting) using labeled historical data to predict the likelihood of privilege escalation. Features should be aggregated per host over a rolling time window and include counts of recon commands, LSASS access events, and anomalous logins. If the model's predicted probability for a host crosses a high threshold and is followed within minutes by a spoolsv.exe image load of a new DLL, escalate as a high-confidence alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]