[
  {
    "information_requirement": "Is the adversary maintaining persistence using AppCert DLLs?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1546.009",
        "name": "AppCert DLLs",
        "evidence": [
          {
            "description": "The HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs registry key is modified, and the new DLL path, filename, or file hash matches a known malicious indicator.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Tier 0 Servers, Executive Workstations",
            "action": [
              "Create a rule that triggers on any modification to `HKLM\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs` (Windows Event ID 4657 or Sysmon Event ID 13). Extract the new DLL path from the event, retrieve the file hash, and compare the DLL name and hash against a threat intelligence feed of known malicious indicators. Generate a high-severity alert on any match.",
              "For each modification to the AppCertDLLs key, calculate the string entropy of the new DLL file path. Establish a baseline of entropy scores for legitimate AppCert DLLs in the environment from known good software installations. Alert on any new DLL path with an entropy score exceeding the 95th percentile of the baseline, which suggests a randomized or obfuscated name.",
              "Train a classification model (e.g., Random Forest) using features from AppCertDLLs modification events, including the parent process name of the writing process, path characteristics (length, special characters, entropy), and historical frequency of the writing process. Use the model to predict the likelihood that a modification is malicious and alert on high-probability events."
            ]
          },
          {
            "description": "A DLL file is created in a world-writable directory (e.g., C:\\Users\\Public, C:\\ProgramData, %TEMP%), and within 5 minutes, the AppCertDLLs registry key is modified to point to this newly created file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Standard User Workstations, Multi-user Servers (e.g., Citrix, RDS)",
            "action": [
              "Create a correlation rule that triggers when a file creation event for a DLL (Sysmon Event ID 11 or Windows Event ID 4663 with Object Type 'File') in a world-writable directory is followed within 5 minutes by a registry modification (Windows Event ID 4657) to `AppCertDLLs` where the new value contains the path to that DLL. Correlate events on the hostname.",
              "Establish a baseline of common processes that write DLLs to temporary or public directories. For any DLL write event in a such a directory that is followed by an AppCertDLLs modification, calculate the rarity of the parent process (ProcessName from Event ID 4688) performing this sequence. Alert if the process's frequency for this behavior falls below the 5th percentile, indicating it is an extremely rare action for that process.",
              "Use a sequence analysis model (e.g., Hidden Markov Model) to learn common event chains on endpoints. Define 'DLL write to world-writable dir' and 'AppCertDLLs mod' as states. Flag any transition between these states that has a low probability under the trained model, indicating an anomalous and potentially malicious sequence of actions."
            ]
          },
          {
            "description": "Within one hour of an AppCertDLLs registry modification on a host, a process on that host initiates an outbound network connection to a domain or IP address not seen in the last 30 days, or a system process spawns a command-line interpreter.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers, Internet Gateway, DNS Servers",
            "action": [
              "After an alert for an AppCertDLLs modification (Event ID 4657), create a high-severity alert if a system-critical process like `lsass.exe` or `wininit.exe` spawns any child process. For other common processes (`explorer.exe`, `svchost.exe`), alert if they spawn `cmd.exe`, `powershell.exe`, or `rundll32.exe` and the activity is not on a pre-approved allow list.",
              "For a host with a recent AppCertDLLs modification, monitor its outbound TLS connections (`Zeek conn.log`). For each connection, calculate the JA3 and JA3S hash. Establish a baseline of common JA3/JA3S hashes for the environment. Alert if a hash pair is observed that falls in the bottom 5th percentile of rarity, suggesting a non-standard client/server combination.",
              "Implement a time-series anomaly detection model (e.g., LSTM) on key network metrics per host, such as bytes out, connection count, and destination port entropy. After an AppCertDLLs modification event, feed subsequent network data from that host into the model. Alert if the model flags a significant deviation from the forecasted behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary escalated privileges using AppCert DLLs?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1546.009",
        "name": "AppCert DLLs",
        "evidence": [
          {
            "description": "An AppCertDLLs registry modification is followed within 10 minutes on the same host by a user account being added to a privileged group, such as 'Administrators' or 'Domain Admins'.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4720",
              "Windows Event ID 4732",
              "Windows Event ID 4728"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Identity and Access Management Systems, Critical Servers",
            "action": [
              "Create a correlation rule that triggers when an `AppCertDLLs` modification (Event ID 4657) is followed within 10 minutes on the same host by a user being added to a high-privilege group (Event IDs 4732, 4728). The rule should specifically check for target group SIDs or names like 'Administrators', 'Domain Admins', or 'Enterprise Admins'.",
              "Maintain a baseline of which administrator accounts and system processes typically perform privileged group modifications. Following an `AppCertDLLs` modification, if a subsequent privileged group change is initiated by a user or process that has never performed this action before (or does so with a frequency below the 1st percentile), generate an alert.",
              "Train a binary classification model (e.g., Logistic Regression) to predict malicious privilege escalation attempts. Use features such as the process that modified the AppCertDLLs key, the user context of the modification, the time delta to the group membership change, and the rarity of the user performing the group change. Trigger an alert if the model predicts a malicious event with a confidence score above 0.9."
            ]
          },
          {
            "description": "A process running with SYSTEM integrity (e.g., services.exe, lsass.exe) spawns a command-line interpreter (cmd.exe, powershell.exe) within 5 minutes of an AppCertDLLs registry modification on the same host.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, All Windows Servers, Privileged Access Workstations",
            "action": [
              "Create a rule that triggers when an `AppCertDLLs` modification (Event ID 4657) is followed within 5 minutes by a process creation event (Event ID 4688) where the `ParentProcessName` is a high-integrity system process (e.g., `services.exe`, `lsass.exe`, `winlogon.exe`) and the `NewProcessName` is `cmd.exe` or `powershell.exe`.",
              "Profile all parent-child process relationships across the enterprise and calculate the conditional probability $$ P(Child | Parent) $$. Following an `AppCertDLLs` modification, if a parent-child creation event occurs where the probability is below a low threshold (e.g., $$ P(Child | Parent) < 0.01 $$), flag it as a rare and suspicious process chain indicative of injected code execution.",
              "Use a graph-based anomaly detection algorithm on process lineage data. Represent processes as nodes and parent-child relationships as directed edges. After an `AppCertDLLs` modification, analyze the subgraph of newly created processes. Flag any new edges (parent-child relationships) that connect previously disconnected components of the process graph, indicating a malicious DLL has bridged two unrelated process trees."
            ]
          },
          {
            "description": "The AppCertDLLs registry key is modified by a process whose parent is a common user application (e.g., WINWORD.EXE, CHROME.EXE, AcroRd32.exe), indicating a potential exploit chain.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All User Endpoints, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Create a high-priority alert for any successful modification to `HKLM\\System\\CurrentControlSet\\Control\\Session Manager\\AppCertDLLs` (Event ID 4657) where the `ProcessName` that performed the change has a parent process (from Event ID 4688 with command-line logging enabled) in a watchlist of common user applications like `outlook.exe`, `winword.exe`, or browsers.",
              "For every modification to the `AppCertDLLs` key, analyze the integrity level of the writing process from the event data. Establish a baseline that these modifications are typically performed by SYSTEM or High integrity processes (e.g., `msiexec.exe`, `svchost.exe`). Alert if a modification is performed by a process running at a Medium or Low integrity level, as this is a strong deviation from normal behavior.",
              "Train a decision tree classifier to determine if a registry write is suspicious based on the process lineage. Features would include the process name, its parent, its grandparent, and their respective integrity levels. A write to `AppCertDLLs` by a process tree originating from a browser or office application would be classified as highly suspicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]