[
  {
    "information_requirement": "Is the adversary maintaining persistence by hijacking Component Object Model (COM) objects?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1546.015",
        "name": "Component Object Model Hijacking",
        "evidence": [
          {
            "description": "A COM server registry key under the HKCU hive (e.g., HKCU\\Software\\Classes\\CLSID\\...\\InProcServer32) is modified to point to an executable file whose hash is on a threat intelligence blacklist.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Remote Desktop Servers, VDI Environments",
            "action": [
              "Filter Windows Event ID 4657 for modifications where the 'Object Name' contains 'HKCU\\Software\\Classes\\CLSID\\' and either '\\InProcServer32' or '\\LocalServer32'. Extract the file path from the 'New Value' field. Calculate the file's hash and query it against a threat intelligence feed of known-bad hashes. Alert on any match.",
              "For each parent process (e.g., 'reg.exe', 'powershell.exe'), establish an enterprise-wide statistical baseline for the number of HKCU COM modifications it performs per host per day. Alert when a process on a given host exceeds the 95th percentile of its historical modification frequency, indicating an unusual level of registry manipulation.",
              "Train a Random Forest classification model to score the maliciousness of HKCU COM modifications. Use features such as: file path entropy of the new value, presence of keywords like 'temp' or 'appdata' in the path, parent process name, whether the new binary is unsigned, and if the modification occurs outside of standard business hours. Alert on events with a high probability score."
            ]
          },
          {
            "description": "A COM server registry key's value under the HKCU hive is modified to contain a command line that directly executes a script interpreter (e.g., powershell.exe, mshta.exe, wscript.exe) instead of a simple file path.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Remote Desktop Servers",
            "action": [
              "Using regular expressions, search the 'New Value' field in Windows Event ID 4657 events (filtered for COM CLSID paths) for patterns matching script interpreters followed by arguments (e.g., '(powershell|wscript|cscript|mshta|rundll32)\\.exe .*'). Alert on any match, as this is highly irregular for a COM server value.",
              "Calculate the character entropy of the 'New Value' field for all HKCU COM server key modifications. Establish a baseline entropy score for legitimate modifications, which are typically low-entropy file paths. Alert on modifications where the entropy score exceeds the 99th percentile, as this often indicates obfuscated script content passed as an argument.",
              "Implement a time-series anomaly detection model (e.g., ARIMA) to monitor the rate of COM modifications that involve script interpreters on a per-host basis. An anomalous spike in such modifications, even if the scripts themselves are not immediately flagged as malicious, can indicate a broader campaign or automated persistence deployment. Alert on statistically significant spikes."
            ]
          },
          {
            "description": "A registry modification event shows a change to a HKCU\\Software\\Classes\\CLSID key where the new COM server value is a file path pointing to a non-standard or user-writable location (e.g., %APPDATA%, %TEMP%, C:\\Users\\Public\\).",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Multi-user servers (e.g., Citrix, RDS)",
            "action": [
              "Filter Windows Event ID 4657 for HKCU COM key modifications. Use a watchlist of regular expressions to check if the file path in the 'New Value' field points to a suspicious directory (e.g., '\\AppData\\', '\\Temp\\', '\\Downloads\\', '\\Public\\', 'C:\\ProgramData\\'). Alert on any match.",
              "Create a baseline of all unique directory paths observed in legitimate COM server values across the enterprise. Calculate the prevalence (rarity) of each directory. Alert when a COM key is modified to point to a directory that falls below a rarity threshold (e.g., seen on fewer than 0.1% of endpoints or is entirely new).",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN) on COM modification events. Use features such as the target directory path, parent process name, and file extension of the new value. Legitimate software installations will form dense clusters. Identify and alert on sparse, outlier events that do not fit known good patterns, as these may indicate one-off persistence attempts."
            ]
          },
          {
            "description": "A legitimate process known to load COM objects (e.g., explorer.exe, svchost.exe) spawns a suspicious child process or makes a rare network connection shortly after a related COM registry key is modified.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Network Egress Points",
            "action": [
              "Correlate Windows Event ID 4657 (COM modification) with a subsequent Windows Event ID 4688 (process creation) from a common COM-loading process (e.g., 'explorer.exe', 'svchost.exe') on the same host within a 5-minute window. Alert if the child process is a command-line interpreter ('cmd.exe', 'powershell.exe').",
              "Using Zeek conn.log, baseline the destination domains and IP addresses contacted by common system processes (e.g., explorer.exe, svchost.exe) on a per-host basis. After a COM modification alert, monitor network traffic from the associated process. Alert if the process connects to a destination that is in the bottom 5th percentile of prevalence (i.e., very rare) for that process across the enterprise.",
              "Construct event graphs where nodes are processes, registry keys, and network destinations. Train a graph-based neural network to recognize legitimate subgraphs of activity (e.g., `explorer.exe` loading a known COM object). Flag any anomalous subgraph, such as a rare HKCU registry write followed by `explorer.exe` spawning `powershell.exe` which connects to a new external IP, as a high-risk sequence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary escalating privileges by hijacking Component Object Model (COM) objects?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1546.015",
        "name": "Component Object Model Hijacking",
        "evidence": [
          {
            "description": "A COM server registry key under the HKLM hive (HKLM\\SOFTWARE\\Classes\\CLSID\\) is modified to point to a binary whose file hash matches a known-malicious indicator.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Tier 0 Servers, Administrator Workstations",
            "action": [
              "Filter Windows Event ID 4657 for modifications where the 'Object Name' contains 'HKLM\\SOFTWARE\\Classes\\CLSID\\'. Extract the file path from the 'New Value', retrieve the file's hash, and check it against a threat intelligence feed of malicious hashes. Alert on any match.",
              "Baseline the daily count of HKLM COM modifications per host. These events are rare outside of software installations. Alert if the daily count on any host exceeds a low threshold (e.g., > 2) or deviates by more than 3 standard deviations from its historical baseline, especially outside of designated patching windows.",
              "Train a one-class SVM model on features of legitimate HKLM COM modifications (e.g., parent process is 'msiexec.exe' or 'TrustedInstaller.exe', new binary is signed by a reputable vendor). Any modification that falls outside this learned boundary of 'normal' installation behavior is flagged as a potential privilege escalation attempt."
            ]
          },
          {
            "description": "A registry modification event targets a specific, high-risk CLSID under HKLM\\SOFTWARE\\Classes\\CLSID\\ known to be abused in public privilege escalation exploits or loaded by a SYSTEM-level process.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Servers and Workstations",
            "action": [
              "Maintain a watchlist of high-risk CLSIDs under 'HKLM\\SOFTWARE\\Classes\\CLSID\\' known from public exploit proof-of-concepts. Trigger a high-severity alert for any modification (Windows Event ID 4657) to the 'InProcServer32' or 'LocalServer32' subkeys of a CLSID on this list.",
              "Establish a baseline of processes that legitimately modify HKLM COM keys (e.g., 'msiexec.exe', 'setup.exe'). Alert if an HKLM COM key is modified by a statistically rare process for this action, such as 'cmd.exe', 'powershell.exe', or any process running from a user's profile.",
              "Use a community detection algorithm on a process-registry interaction graph. Legitimate installers form dense communities of related processes and key modifications. Flag a single, isolated write to a high-risk HKLM COM key by a non-installer process as an anomalous outlier that does not belong to a known 'good' software installation community."
            ]
          },
          {
            "description": "A process with a 'Medium' or 'Low' integrity level successfully modifies a registry key under HKLM\\SOFTWARE\\Classes\\CLSID\\, indicating a privilege bypass was exploited.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Servers and Workstations",
            "action": [
              "For each Windows Event ID 4657 modifying 'HKLM\\SOFTWARE\\Classes\\CLSID\\', correlate the 'Process ID' to its creation event (Windows Event ID 4688). Alert immediately if the 'Mandatory Label' in the token information is for 'Medium Integrity' (S-1-16-8192) or 'Low Integrity' (S-1-16-4096).",
              "Calculate the enterprise-wide frequency of HKLM registry writes categorized by process integrity level. A successful write to 'HKLM\\SOFTWARE\\Classes\\CLSID\\' by a 'Medium' or 'Low' integrity process is an extreme statistical anomaly (frequency approaches zero in a secure environment) and constitutes a high-confidence alert for privilege escalation.",
              "Deploy a classification model that, upon detection of a low-integrity HKLM write, automatically analyzes subsequent activity by the parent and child processes (e.g., command line arguments, network connections). Use this model to classify the event's intent, such as 'Privilege Escalation for C2' vs. 'Privilege Escalation for Local Discovery', to aid in SOC prioritization."
            ]
          },
          {
            "description": "Following a modification to an HKLM COM key, a high-privilege process (e.g., a service running as SYSTEM) is observed initiating a network connection to a destination that is statistically rare for that process or the host.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Tier 0 Servers, Domain Controllers, Network Egress Points",
            "action": [
              "Create a rule that correlates an HKLM COM key modification (Event ID 4657) with subsequent network connections (Zeek conn.log) made by a high-privilege process (e.g., `services.exe`, `lsass.exe`) on the same host within a 10-minute window. Alert if the connection is to an external IP address not on an allowlist.",
              "Using Zeek conn.log, create a statistical baseline of destination IPs and domains contacted by high-privilege processes on critical servers. Following an HKLM COM modification event (Event ID 4657), alert if a high-privilege process initiates a connection to a destination IP that falls into the bottom 1st percentile of prevalence (i.e., is extremely rare) for that server or process type.",
              "Apply a time-series anomaly detection model (e.g., LSTM) to the network connection patterns (e.g., bytes transferred, connection frequency, destination port) of high-privilege processes. A successful COM hijack for privilege escalation may manifest as a new, periodic beaconing pattern emerging from a SYSTEM-level process, which the model would flag as an anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]