[
  {
    "information_requirement": "Has the adversary escalated privileges using Setuid/Setgid?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1548.001",
        "name": "Setuid and Setgid",
        "evidence": [
          {
            "description": "A process creation event is recorded where the executed binary possesses SUID/SGID permissions, and the binary's file hash is present on a threat intelligence feed of known-malicious indicators.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "auditd EXECVE records",
              "Threat intelligence hash feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux endpoints and servers; Centralized log management platform (e.g., SIEM).",
            "action": [
              "Query process creation logs (Sysmon for Linux EID 1, auditd) to find events where the effective user ID (e.g., EUID=0) is different from the real user ID (e.g., UID!=0). For these events, extract the file hash of the executed binary and match it against a known-malicious hash feed. Trigger a high-severity alert on any match.",
              "For all processes executed with SUID/SGID privileges, extract and calculate the Shannon entropy of their command-line arguments. Establish a baseline entropy distribution for each SUID binary. Flag any execution whose command-line entropy exceeds the 95th percentile for that specific binary, indicating potential obfuscation or exploit code.",
              "Develop an unsupervised clustering model (e.g., DBSCAN) using features from SUID/SGID process executions, including the executing user, parent process name, binary path, and command-line argument patterns. Identify and investigate clusters that are flagged as noise or small, isolated groups, as they represent anomalous execution patterns not seen in the larger, benign clusters."
            ]
          },
          {
            "description": "A process creation event is recorded for a file system utility, such as 'find' or 'chmod', with command-line arguments used to discover ('-perm -4000') or apply ('+s', '4755') SUID/SGID permissions.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "auditd EXECVE records",
              "osquery process_events table"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux endpoints and servers, particularly multi-user systems and developer workstations; Centralized log management platform.",
            "action": [
              "Create a detection rule that triggers on process creation events where ProcessName is 'find' or 'chmod' and the command line contains strings such as '-perm', '+s', 'u+s', 'g+s', '4000', or '2000'. Escalate the alert if the target file is a shell interpreter or located in a world-writable directory like '/tmp' or '/dev/shm'.",
              "For each host and user, create a historical baseline of the daily count of SUID/SGID-related 'find' and 'chmod' commands. Calculate the Z-score for the current day's count against this baseline. Trigger an alert if the Z-score for any user or host exceeds 3, indicating an abnormal frequency of this activity.",
              "Implement time-series forecasting (e.g., using a Prophet or ARIMA model) on the environment-wide aggregate count of SUID/SGID discovery and modification commands. Configure the model to alert when the observed count significantly exceeds the forecasted upper confidence interval, indicating a potential coordinated or widespread campaign."
            ]
          },
          {
            "description": "A process tree shows a non-root user executing a legitimate SUID binary (e.g., 'pkexec', 'sudo', 'passwd'), which then spawns a shell process (e.g., 'sh', 'bash') as a child, with the child process running with an effective user ID of 0 (root).",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "auditd SYSCALL and EXECVE records",
              "EDR process tree data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Linux infrastructure, authentication servers, and standard user endpoints; Centralized log management platform.",
            "action": [
              "Construct a SIEM query that joins process creation events on ParentProcessID and ProcessID to build process trees. Alert when a known SUID binary (Parent) executed by a non-root user has a shell (Child) as a direct descendant, and the Child process has an EffectiveUserID of 0.",
              "For each legitimate SUID binary on your allowlist, profile its normal child processes over a 30-day period to create a frequency map. Trigger an alert if a SUID binary spawns a child process that is statistically rare or has never been observed before (e.g., 'passwd' spawning 'bash'), as this represents a strong anomaly.",
              "Utilize a graph-based anomaly detection algorithm to model normal process execution graphs originating from SUID binaries. Represent each execution as a directed graph of processes. Flag any execution graph that has a different structure, node count, or node attributes (e.g., ending in a root shell) compared to the learned baseline models."
            ]
          },
          {
            "description": "A process running with root privileges (EUID=0), spawned via SUID/SGID from a non-root user context, initiates an outbound network connection to an IP address outside of the organization's network space.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "Sysmon for Linux Event ID 3",
              "Zeek conn.log",
              "auditd network-related SYSCALL records"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS servers, all Linux hosts, and the centralized log management platform where network and host logs are correlated.",
            "action": [
              "Correlate process logs (Sysmon EID 1) with network logs (Sysmon EID 3, Zeek conn.log) on process ID and host. Alert when a process with EUID=0 and a non-root parent UID establishes an external network connection to an IP address present on a threat intelligence blocklist.",
              "Using Zeek conn.log, analyze all external connections from root processes spawned via SUID. Calculate the enterprise-wide prevalence of the destination IP, destination port, and destination ASN. Flag connections where the destination is rare across the organization (e.g., seen <5 times in 30 days) or the destination ASN has a low reputation score.",
              "Apply time-series analysis to the volume of outbound data (`orig_bytes` in Zeek conn.log) for each process associated with SUID-based privilege escalation. Train a model to learn the baseline data transfer patterns and alert on anomalous spikes in data volume, which could indicate data exfiltration after a successful escalation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using Setuid/Setgid?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1548.001",
        "name": "Setuid and Setgid",
        "evidence": [
          {
            "description": "A file on a Linux filesystem with SUID or SGID permissions has a SHA256 or MD5 hash that matches a known indicator of compromise (IOC) for malware or hacking tools.",
            "data_sources": [
              "Filesystem scan results (e.g., from osquery)",
              "File Integrity Monitoring (FIM) alerts",
              "EDR file inventory",
              "Threat intelligence hash feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Filesystems of all Linux servers and endpoints, particularly standard executable paths ('/bin', '/usr/bin') and world-writable directories ('/tmp', '/var/tmp', '/dev/shm').",
            "action": [
              "Schedule a recurring job to scan all filesystems for files with SUID/SGID bits set (`find / -perm /6000 -type f`). For each file found, compute its hash and compare it against a threat intelligence database of malicious file hashes. Generate a high-severity alert for any match.",
              "When a hash match occurs, enrich the alert by querying an external service (e.g., VirusTotal API) for the file's global prevalence. Prioritize investigation of alerts for files that are both malicious and statistically rare globally, reducing noise from common, well-detected malware.",
              "Deploy a static file analysis model trained on ELF file features (e.g., headers, section names, imported libraries, string entropy). Scan all SUID/SGID files and flag any file that the model classifies as 'malicious' or 'suspicious' with high confidence, enabling detection of zero-day malware not yet present in hash feeds."
            ]
          },
          {
            "description": "A file with SUID/SGID permissions exists that is not on an established allowlist of known-good binaries, is a script instead of a compiled binary, or is located in a non-standard, user-writable directory (e.g., '/tmp', '/home/user').",
            "data_sources": [
              "Filesystem scan results (e.g., from osquery `suid_bin` table)",
              "Configuration Management Database (CMDB) baseline",
              "FIM change logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Filesystems of all Linux servers and endpoints; Configuration Management Database (CMDB).",
            "action": [
              "Create and maintain an allowlist of approved SUID/SGID binaries, including their full path and expected hash. Run a periodic scan to find all SUID/SGID files and compare them against the allowlist. Alert on any file not on the list or any file on the list whose hash has changed.",
              "For all SUID/SGID files discovered, calculate the prevalence of their file path across the enterprise. Flag files located in directories that are statistically uncommon for SUID/SGID binaries (e.g., a path present on less than 1% of hosts), indicating a potential non-standard placement.",
              "Train a classification model (e.g., logistic regression or a decision tree) to predict if a SUID/SGID file is 'suspicious'. Use features such as file path depth, presence in a world-writable directory, file extension (or lack thereof), and file age. Use the model to score and prioritize newly discovered SUID/SGID files for review."
            ]
          },
          {
            "description": "A file creation event is followed in a short time window (e.g., under 60 seconds) by a process execution of 'chmod' that applies the SUID or SGID bit to that newly created file.",
            "data_sources": [
              "Sysmon for Linux Event ID 11",
              "Sysmon for Linux Event ID 1",
              "auditd SYSCALL records for 'creat' and 'chmod'"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux endpoints and servers, via real-time monitoring agents; Centralized log management platform.",
            "action": [
              "Implement a correlation rule in the SIEM that triggers when a FileCreate event (Sysmon EID 11) is followed by a ProcessCreate event (Sysmon EID 1) for 'chmod' targeting the same file path within a 60-second window, where the 'chmod' command line includes '+s' or an octal mode with the SUID/SGID bit set.",
              "Analyze the time delta between file creation and subsequent SUID/SGID permission changes. Establish a baseline for normal software installation packages. Flag sequences where the time delta is a statistical outlier (e.g., falls in the fastest 1% of all such events), as this rapid, isolated change is characteristic of manual attacker activity.",
              "Use a sequence mining algorithm to learn common sequences of file operations (create, write, execute, modify permissions) associated with legitimate software management tools (e.g., 'apt', 'yum', 'dpkg'). Flag any sequence involving SUID/SGID permission changes that does not match a known-good installation pattern, such as a file being created by 'curl' and then immediately having its permissions changed."
            ]
          },
          {
            "description": "A SUID/SGID binary is executed by a user or service account with no legitimate reason to use it, or the frequency of execution by a specific user is a statistical outlier compared to their own baseline or that of their peers.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "auditd EXECVE records",
              "Identity and Access Management (IAM) role definitions"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux hosts, particularly those hosting sensitive applications or data; Identity and Access Management (IAM) system.",
            "action": [
              "Define access control policies that map high-risk SUID binaries (e.g., 'nmap', 'pkexec') to user roles that are authorized to use them. Create a SIEM rule to alert whenever a user executes a binary that is not authorized for their role, especially for service accounts.",
              "For each user and each SUID/SGID binary, establish a baseline of execution frequency (e.g., hourly or daily counts) over a rolling 30-day window. Use a moving average and standard deviation to identify when a user's execution count for a specific binary exceeds a dynamic threshold (e.g., 3 standard deviations above the average), indicating unusual activity.",
              "Employ peer group analysis by clustering users based on their roles or departments. For each cluster, model the collective SUID/SGID binary usage profile. Identify and alert on any user whose execution behavior is a significant outlier compared to the centroid of their peer group, indicating a potential compromised account or insider threat."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]