[
  {
    "information_requirement": "Is the adversary attempting to blend command and control traffic by impersonating legitimate protocols or services?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1001.003",
        "name": "Protocol or Service Impersonation",
        "evidence": [
          {
            "description": "A successful network connection (TCP/UDP) from an internal host to an external IP, domain, or ASN that is present on a high-confidence threat intelligence feed of known C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Continuously inner-join destination IP addresses from Zeek conn.log, 'host' headers from Zeek http.log, and queried domains from Zeek dns.log with a high-confidence, frequently updated CTI feed of known C2 servers and malicious autonomous systems. Alert on any matches.",
              "Statistical: Calculate the frequency of connections to newly observed domains or IPs across the enterprise. Flag destinations that receive connections from a statistically unusual number of internal hosts within a short time frame (e.g., > 95th percentile of new destination fan-out), as this may indicate a new C2 campaign.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from Zeek logs (conn, dns, http) enriched with CTI data (e.g., IP reputation, domain age, ASN). The model classifies each connection as benign or malicious. A high probability score for 'malicious' for a connection to a destination not on a static IOC list indicates a potential emerging C2 server."
            ]
          },
          {
            "description": "A TLS or HTTP connection exhibiting specific, hardcoded artifacts associated with known C2 frameworks, such as a matching JA3/JA3S hash, a known malicious User-Agent string, a specific URI pattern, or default/anomalous SSL certificate fields.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Web Proxies, TLS-terminating Firewalls",
            "action": [
              "Symbolic: Scan Zeek ssl.log for JA3/JA3S hashes and Zeek http.log for User-Agent strings or URI patterns present on a curated list of known C2 framework indicators. Alert on any matches.",
              "Statistical: For SSL certificates observed in Zeek x509.log, calculate the entropy of the subject and issuer fields. Flag certificates with very low entropy (indicating default or simplistic values, e.g., in the 5th percentile) or unusually short validity periods (e.g., < 90 days, in the 5th percentile of all certificate durations).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from Zeek http.log and ssl.log, such as User-Agent string similarity, URI structure, and JA3 hash. Identify small clusters of traffic that are distinct from the large clusters of legitimate browser and application traffic, as these may represent a specific C2 framework's activity."
            ]
          },
          {
            "description": "A network connection to an external destination is initiated by a process (e.g., svchost.exe, lsass.exe) or from a parent-child process chain (e.g., WINWORD.EXE -> powershell.exe) that does not normally exhibit external networking behavior.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, User Workstations",
            "action": [
              "Symbolic: Maintain a watchlist of sensitive system processes that should never initiate external network connections (e.g., lsass.exe, smss.exe). Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 5156 (Network Connection) and alert immediately if a process on this watchlist makes an outbound connection.",
              "Statistical: For each process name, build a historical baseline of legitimate parent processes and command-line arguments. Use a scoring model where a rare parent process (e.g., winword.exe spawning powershell.exe) or high-entropy command line contributes to a risk score. Alert when the score for a networking process exceeds the 98th percentile of its historical scores.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA) for the volume of network connections initiated by each critical process on a per-host basis. A sudden, sustained spike in outbound connections from a process like 'svchost.exe' that deviates significantly from its forecasted pattern could indicate C2 activity."
            ]
          },
          {
            "description": "A series of connections from a single internal host to a single external destination, where the time interval between connections is nearly constant (low jitter) and the connection duration is uniform, indicating automated, non-interactive beaconing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Network Taps/Sensors, Firewall Logs",
            "action": [
              "Symbolic: Scan connection logs for known C2 beaconing intervals and jitter. For example, search for source-destination pairs communicating every 60 seconds +/- 5 seconds, a common default for Cobalt Strike.",
              "Statistical: For each internal source IP, group connections by destination IP and port. Calculate the standard deviation of the time delta between consecutive connections within each group over a rolling 24-hour window. A standard deviation in the bottom 1st percentile of all observed standard deviations indicates highly regular, machine-generated beaconing.",
              "Machine Learning: Apply a Fourier Transform to the time series of connection events for each source-destination pair. Use an anomaly detection model on the frequency spectrum to automatically flag pairs with an unusually strong peak in the frequency domain, which indicates a dominant, periodic signal characteristic of C2 beaconing."
            ]
          },
          {
            "description": "A TCP connection on a well-known service port that does not conform to the expected application-layer protocol, such as non-TLS data transmitted over port 443, or a TLS session with a malformed or suspicious handshake.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Internal Network Segments via Zeek sensors, DMZ",
            "action": [
              "Symbolic: Join Zeek conn.log and Zeek ssl.log on the connection UID. Identify and alert on any connection where conn.log.id.resp_p is 443 but for which no corresponding entry exists in ssl.log. Also, alert on any 'active_protocol_violation' notices in Zeek weird.log.",
              "Statistical: Profile the 'validation_status' field in Zeek ssl.log. Establish a baseline for the normal rate of TLS errors. Alert when the rate of a specific error, or the overall error rate from a specific internal host, exceeds 3 standard deviations above the mean hourly rate.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) on feature vectors representing legitimate TLS handshakes from Zeek ssl.log (e.g., selected cipher, TLS version, certificate validity period, extensions present). Feed new handshakes into the model; those identified as outliers are anomalous and may represent a custom C2 handshake designed to mimic TLS."
            ]
          },
          {
            "description": "A network connection where the ratio of bytes sent from the client to bytes received from the server is highly atypical for the protocol in use on that port, such as a large data upload over DNS or a high client-to-server data ratio over HTTP without a corresponding POST request.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Define strict rules for protocols with expected low upload volumes. For example, alert on any DNS query (UDP/53) seen in Zeek dns.log where the query length is greater than 255 bytes, or any connection in Zeek conn.log on port 53 where orig_bytes is greater than resp_bytes and is not a zone transfer.",
              "Statistical: For each destination port (e.g., 80, 443, 53), calculate the historical distribution of the ratio R = orig_bytes / (orig_bytes + resp_bytes). For new connections, calculate this ratio and flag any that fall in the extreme percentiles (e.g., > 99th or < 1st) for that specific port's baseline.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on a 2D plot of orig_bytes vs. resp_bytes for each common port. Legitimate traffic will form dense clusters. Points that do not belong to any cluster (noise points) are anomalous connections that can represent C2 channels with atypical data exchange patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]