[
  {
    "information_requirement": "Has an adversary attempted to access or exfiltrate a copy of the Active Directory NTDS database for credential theft?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003.003",
        "name": "NTDS",
        "evidence": [
          {
            "description": "A file transfer originating from a Domain Controller to an external destination with characteristics matching an NTDS database file, such as filename or size, is detected at a network egress point.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Domain Controllers",
            "action": [
              "Symbolic: Query Zeek conn.log for connections where `id.orig_h` is a Domain Controller IP and `id.resp_h` is an external IP on a threat intelligence blocklist. Correlate with Zeek files.log for `tx_hosts` matching the DC IP and `filename` matching patterns like 'ntds.dit', '*.dit.bak', or '*.dmp'.",
              "Statistical: For all connections from Domain Controllers to external IPs, calculate the 95th and 99th percentiles of outbound data volume (`orig_bytes` in conn.log) over a 30-day rolling window. Alert on any connection exceeding the 99th percentile, especially to destinations not seen in the past 30 days.",
              "Machine Learning: Train a classification model (e.g., Random Forest) to score the maliciousness of outbound connections from Domain Controllers. Features should include destination port, data volume, protocol, destination ASN, and whether the destination IP is on a threat intelligence feed. A high score triggers an alert."
            ]
          },
          {
            "description": "Execution of a process on a Domain Controller with a process name or command-line arguments matching known NTDS dumping utilities or native Windows tools used for that purpose.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: Create a SIEM rule to alert on Windows Event ID 4688 from a Domain Controller host where `ProcessName` is 'ntdsutil.exe', 'vssadmin.exe', or 'powershell.exe' AND `CommandLine` contains strings like 'ifm', 'create shadow', 'secretsdump.py', 'Invoke-NinjaCopy', or 'dcsync'.",
              "Statistical: For all command-line executions on Domain Controllers, calculate the frequency of each unique command-line string over a 30-day baseline. Alert on the execution of any command-line that is statistically rare (e.g., seen less than 5 times across the entire DC fleet) and matches partial patterns of known dumping tools.",
              "Machine Learning: Utilize a sequence analysis model to analyze parent-child process relationships (e.g., powershell.exe spawning ntdsutil.exe). Model normal execution chains on Domain Controllers and alert on sequences that deviate significantly from the learned benign sequences, indicating an anomalous execution flow."
            ]
          },
          {
            "description": "A process not associated with normal Active Directory operations (e.g., lsass.exe) attempts to read the NTDS.dit file on a Domain Controller.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller file systems, specifically %SystemRoot%\\NTDS\\Ntds.dit",
            "action": [
              "Symbolic: Configure a SACL on the NTDS.dit file and create a SIEM rule to alert on Windows Event ID 4663 where `ObjectName` is '...\\NTDS\\Ntds.dit' and `ProcessName` is NOT 'lsass.exe' or other known legitimate backup processes. The rule should trigger for any access by processes like 'powershell.exe', 'cmd.exe', or 'rundll32.exe'.",
              "Statistical: Establish a baseline of all processes that access the NTDS.dit file over a 30-day period. Calculate the access frequency for each process. Alert if a process whose historical access frequency is in the bottom 5th percentile (a rare process) accesses the file.",
              "Machine Learning: Implement an isolation forest or one-class SVM model to profile normal access to the NTDS.dit file. Use features such as `ProcessName`, `SubjectUserName`, time of day, and day of week. The model will identify and alert on any access events that are classified as outliers."
            ]
          },
          {
            "description": "A Volume Shadow Copy is created on a Domain Controller, where the creation event is not correlated with a scheduled backup job and is initiated by an interactive user or non-standard process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: Create a SIEM rule to alert on Windows Event ID 4688 from a Domain Controller where `ProcessName` is 'vssadmin.exe' and `CommandLine` includes 'create shadow', and the `SubjectUserName` is not a designated backup service account.",
              "Statistical: Model the time series of Volume Shadow Copy service start events (Event ID 7036) and `vssadmin create` commands (Event ID 4688) on Domain Controllers. Alert on any event that occurs outside of the historically established backup windows (e.g., 10 PM - 4 AM) or deviates from the expected daily/weekly frequency by more than two standard deviations.",
              "Machine Learning: Develop a decision tree classifier to determine if a VSS creation event is malicious. Features should include the initiating `ProcessName`, `SubjectUserName`, time of day, and whether the event is followed by file access to NTDS.dit (Event ID 4663) or large network egress (Zeek conn.log) within a 10-minute window."
            ]
          },
          {
            "description": "A network host that is not an authorized Domain Controller sends a 'DsGetNcChanges' request, indicative of a DCSync attack, to a Domain Controller.",
            "data_sources": [
              "Zeek dce_rpc.log",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting Domain Controllers, Authentication Servers",
            "action": [
              "Symbolic: Create a SIEM rule to alert on any Zeek dce_rpc.log event where the `operation` is 'DsGetNcChanges' and the `id.orig_h` (source IP) is not on a pre-defined allowlist of Domain Controller IP addresses.",
              "Statistical: Maintain a baseline of user accounts that legitimately perform replication activity. Calculate the entropy of user accounts making 'DsGetNcChanges' requests over time. A sudden spike in entropy, indicating new or diverse accounts performing this action, should trigger an alert for investigation.",
              "Machine Learning: Use a graph-based anomaly detection algorithm to model the network graph of DC-to-DC replication. Nodes are hosts and edges represent replication requests. The sudden appearance of a new node (a non-DC) creating a replication edge to a DC would be flagged as a structural anomaly in the graph."
            ]
          },
          {
            "description": "A Domain Controller exhibits a temporal correlation between a host-based credential dumping indicator (e.g., VSS creation, ntdsutil execution) and a subsequent anomalous outbound network transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Egress Points/Internet Gateway",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a high-severity host alert for T1003.003 (e.g., from Evidence 2, 3, or 4) on a Domain Controller is followed within 5 minutes by a network connection from that same host to an external IP with `orig_bytes` > 10MB.",
              "Statistical: For each Domain Controller, monitor the rate of change (first derivative) of the outbound data volume time series. A sharp, statistically significant spike in outbound data volume immediately following a potential credential dumping event (e.g., vssadmin execution) should generate a high-priority alert.",
              "Machine Learning: Use a Hidden Markov Model (HMM) where the hidden states are 'Benign Activity' and 'Exfiltration'. Observe host events (VSS creation, tool execution) and network events (data volume). The model would learn transition probabilities, such as the high probability of transitioning to 'Exfiltration' after observing 'vssadmin create shadow'. An alert is fired when the model enters the 'Exfiltration' state with high confidence."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]