[
  {
    "information_requirement": "Has an adversary attempted to acquire credentials from Linux hosts by accessing /etc/passwd or /etc/shadow files? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003.008",
        "name": "/etc/passwd and /etc/shadow",
        "evidence": [
          {
            "description": "A network connection from a Linux server to an external destination IP or domain with a threat intelligence category of 'malicious C2' or 'malware distribution', potentially indicating exfiltration or tool download.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and DNS resolvers monitoring traffic from Linux server subnets.",
            "action": [
              "Symbolic: Continuously join network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) against a threat intelligence feed. Generate an alert for any connection or query from a Linux server to an IP, domain, or URL with a 'malicious' or 'C2' category.",
              "Statistical: For each Linux server, profile the historical distribution of destination Autonomous System Numbers (ASNs) and countries. Calculate a rarity score for each new connection. Alert when a connection is made to an ASN or country that falls within the 99th percentile of rarity for that host.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled network connection data (Zeek conn.log records) to predict malicious C2 traffic. Use features such as connection duration, bytes sent, protocol, destination port, and the statistical rarity of the destination IP. Alert on connections classified as malicious with high confidence."
            ]
          },
          {
            "description": "A process execution event on a Linux host where the command line contains keywords and file paths associated with reading, copying, or manipulating '/etc/passwd' or '/etc/shadow'.",
            "data_sources": [
              "AuditD logs",
              "Sysmon for Linux Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Linux servers, including web servers, database servers, and authentication servers.",
            "action": [
              "Symbolic: Monitor process execution logs for command lines matching specific regular expressions indicative of credential dumping, such as 'cat /etc/shadow', 'unshadow /etc/passwd /etc/shadow', or 'cp /etc/shadow /tmp/'.",
              "Statistical: Calculate the Shannon entropy of command-line arguments. Flag commands with unusually high entropy, which may indicate obfuscation, especially when combined with access to sensitive files. Separately, establish a frequency baseline for parent processes (e.g., 'bash', 'sshd') that access these files and alert on access from statistically rare parent processes (e.g., 'java', 'nginx').",
              "Machine Learning: Use a sequence analysis model (e.g., an LSTM) trained on historical terminal session data to learn normal command sequences for users and system accounts. Flag command sequences that deviate significantly from learned baselines, particularly if they include access to '/etc/passwd' or '/etc/shadow' as part of an anomalous sequence."
            ]
          },
          {
            "description": "The content of an outbound network flow or file transfer contains data matching the specific format and structure of '/etc/passwd' or '/etc/shadow' entries.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with full packet capture or deep packet inspection capabilities.",
            "action": [
              "Symbolic: Deploy and monitor network IDS signatures or Zeek scripts that use regular expressions to match the structure of '/etc/passwd' (e.g., '^\\w+:[x*]:[0-9]+:[0-9]+:.*:.*:.*$') and '/etc/shadow' (e.g., '^\\w+:\\$[156y]\\$.*') within network payloads.",
              "Statistical: For all outbound file transfers identified in Zeek files.log, profile the typical MIME types and file extensions originating from the Linux server farm. Alert on transfers of plain text files or files with no extension, especially if their size is between 1KB and 100KB, which is characteristic of credential files and statistically anomalous compared to baseline transfers.",
              "Machine Learning: Train a text classification model to distinguish between legitimate and exfiltrated content. Use features like n-gram frequency, character distribution, and the presence of specific patterns (e.g., ':/bin/bash', ':$6$') to identify content that is structurally similar to '/etc/passwd' or '/etc/shadow' files, even if lightly obfuscated."
            ]
          },
          {
            "description": "A file access event on a Linux host for '/etc/passwd' or '/etc/shadow' where the accessing user, process, or frequency of access deviates from an established historical baseline.",
            "data_sources": [
              "AuditD logs",
              "Sysmon for Linux Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The local file systems of all production Linux servers.",
            "action": [
              "Symbolic: Create an explicit allowlist of legitimate processes (e.g., 'login', 'sshd', 'crond', 'useradd') and users (root) permitted to read '/etc/shadow'. Configure file access auditing to generate a high-severity alert for any read access by a process or user not on this allowlist.",
              "Statistical: For each host, establish a baseline for the hourly access count to '/etc/shadow'. Use a moving average and standard deviation to model normal activity. Alert when the access count in a given hour exceeds a dynamic threshold, such as the mean plus 3 standard deviations.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on file access events, using features like process name, parent process name, user ID, and time of day. Identify clusters of normal activity. Flag any access event that is marked as a noise point or outlier by the algorithm, as it represents a rare and potentially suspicious access pattern."
            ]
          },
          {
            "description": "A suspicious file access event for '/etc/passwd' or '/etc/shadow' on a host is followed within a five-minute window by an anomalous outbound network connection from the same host.",
            "data_sources": [
              "AuditD logs",
              "Sysmon for Linux Event ID 11",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM or data analytics platform capable of correlating host logs from Linux servers with network logs from egress points.",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when an AuditD event for '/etc/shadow' access by a non-allowlisted process is observed. The rule then searches for any Zeek conn.log event from the same host IP within 5 minutes where the destination IP is on a CTI blocklist.",
              "Statistical: Upon detection of an anomalous '/etc/shadow' access, trigger a secondary query to analyze all outbound network connections from that host in the subsequent 10 minutes. Calculate the rarity of the destination port and ASN. If the destination is statistically rare (e.g., <1% historical probability for that host) and the data volume sent is small (1KB-100KB), escalate the event priority.",
              "Machine Learning: Develop a time-series model that jointly analyzes host event streams (file access) and network event streams (connections). The model should learn the typical temporal relationship between host activities and subsequent network traffic. Alert when a high-risk host event (like '/etc/shadow' access) is followed by a network connection that the model flags as a significant deviation from the learned temporal baseline."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]