[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using obfuscated files or information?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1027",
        "name": "Obfuscated Files or Information",
        "evidence": [
          {
            "description": "A file transferred over the network or created on an endpoint matches a known signature for a packer, crypter, or obfuscated malware family.",
            "data_sources": [
              "Zeek file.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, Email servers, User endpoints, File servers",
            "action": [
              "Symbolic: Query for file creation events (Windows Event ID 4688) or network file transfers (Zeek file.log) and scan the associated file hashes against a threat intelligence database of known packed or obfuscated malware. Alert on any match.",
              "Statistical: For files identified by Zeek file.log, calculate the frequency of specific file magic numbers (e.g., 'UPX!') associated with common packers. Establish a baseline frequency for your environment. Alert when the observation of these magic numbers in a given time window exceeds the 95th percentile of the historical baseline.",
              "ML: Train a time-series model (e.g., ARIMA) on the volume of signature-based alerts for packed/obfuscated files. Use the model to predict the expected number of alerts for the next time interval. An actual count that significantly exceeds the prediction's confidence interval indicates a potential campaign or widespread attack."
            ]
          },
          {
            "description": "A process is created with command-line arguments containing patterns indicative of obfuscation, such as PowerShell Base64 encoding flags, excessive CMD escape characters, or string concatenation.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User endpoints, Application servers, Web servers",
            "action": [
              "Symbolic: Create a detection rule that uses regular expressions to search process command lines (Windows Event ID 4688) for known obfuscation indicators, such as `powershell -e`, `powershell -enc`, `cmd.exe /c` with multiple carets (`^`), or `certutil -decode`.",
              "Statistical: For each process command line, calculate the character entropy. Establish a baseline entropy score for common processes (e.g., svchost.exe, explorer.exe). Alert when a process is executed with a command-line entropy score that is more than three standard deviations above its specific baseline.",
              "ML: Develop a classification model (e.g., Logistic Regression, Random Forest) trained on a labeled dataset of benign and obfuscated command lines. Use features like command length, character frequency, entropy, and the presence of special characters. Apply the model to new process creation events (Windows Event ID 4688) to classify them as likely obfuscated or benign in real-time."
            ]
          },
          {
            "description": "A known deobfuscation utility (e.g., certutil.exe, expand.exe) is executed on a file that was recently downloaded or created on an endpoint.",
            "data_sources": [
              "Zeek file.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Developer workstations, System administrator consoles",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Windows Event ID 4688) for a known deobfuscation tool (e.g., `certutil.exe` with `-decode` switch) is observed on a host within 60 seconds of a file download event to that same host (from Zeek file.log or http.log).",
              "Statistical: Analyze process parent-child relationships from Windows Event ID 4688 data. Calculate the conditional probability of a specific parent process (e.g., `outlook.exe`, `chrome.exe`) spawning a deobfuscation tool process. Alert when a low-probability parent-child relationship is observed, such as `winword.exe` spawning `certutil.exe -decode`.",
              "ML: Use a sequence analysis model (e.g., Hidden Markov Model) to identify anomalous process execution chains. Train the model on normal user behavior sequences derived from Windows Event ID 4688. An observed sequence of `Network Connection -> File Write -> Deobfuscation Tool Execution` would be flagged as a low-probability, high-risk sequence."
            ]
          },
          {
            "description": "A file, network payload segment, or process command line exhibits Shannon entropy significantly higher than the established baseline for its type, suggesting unexpected compression or encryption.",
            "data_sources": [
              "Zeek file.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, User endpoints, Critical servers hosting sensitive data",
            "action": [
              "Symbolic: Define static entropy thresholds for sensitive file types. For example, create a rule to alert if any file with a `.ps1` or `.vbs` extension (from Zeek file.log or Windows file auditing) has a calculated Shannon entropy score greater than 7.5.",
              "Statistical: For all process command lines from Windows Event ID 4688, calculate the entropy. Group by process name (e.g., `powershell.exe`, `cmd.exe`) and establish a rolling 30-day baseline distribution (mean, standard deviation) for each. Alert when a new command line's entropy exceeds the 99th percentile for that specific process.",
              "ML: Implement an anomaly detection model (e.g., Isolation Forest) on multi-dimensional data points including file entropy, file size, and file type (from Zeek file.log). Train the model on historical data to learn normal combinations. The model can then identify anomalous combinations, such as a small text file with unusually high entropy, which would be flagged as an outlier."
            ]
          },
          {
            "description": "A file's observed magic number or MIME type (e.g., 'application/x-dosexec') is inconsistent with its declared file extension (e.g., '.jpg', '.txt'), indicating potential masquerading.",
            "data_sources": [
              "Zeek file.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web servers, Email gateways, User endpoints, Network file shares",
            "action": [
              "Symbolic: Create a lookup table mapping common 'benign' file extensions (`.txt`, `.jpg`, `.png`, `.gif`) to their expected MIME types. Query Zeek file.log and alert every time a file is transferred with one of these extensions but has a mismatched MIME type, especially `application/x-dosexec`, `application/octet-stream`, or `application/zip`.",
              "Statistical: For each user, establish a baseline of file type mismatches observed over a 30-day period (most users should have near zero). Use a Z-score to detect when a user's count of file type mismatches in a 24-hour period significantly deviates from their personal baseline and the overall population baseline, potentially indicating targeted phishing.",
              "ML: Train a decision tree classifier to predict the likelihood of a file being malicious based on features like: `(mismatch_present: boolean)`, `(file_source_ip: categorical)`, `(file_size: integer)`, `(MIME_type: categorical)`. A file with a mismatch from an external source that is of a size typical for executables would be classified as high-risk."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]