[
  {
    "information_requirement": "Has the adversary moved laterally within the network using Remote Desktop Protocol?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.001",
        "name": "Remote Desktop Protocol",
        "evidence": [
          {
            "description": "A successful RDP logon (Windows Event ID 4624, Logon Type 10) where the source IP address or user account is present on a watchlist of known compromised indicators.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek rdp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, Threat Intelligence Feeds",
            "action": [
              "Symbolic: Maintain a watchlist of compromised user accounts and host IP addresses. Create a SIEM rule that triggers an alert when a successful RDP login (Windows Event ID 4624 with Logon Type 10) occurs where the 'TargetUserName' or 'IpAddress' field matches an entry on the watchlist.",
              "Statistical: For each RDP connection from a source IP on the watchlist, calculate the historical frequency of that source connecting to the specific destination. Alert if the connection is new or has a z-score greater than 3 compared to the source's historical connection patterns, indicating an anomalous target for a known-bad host.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on labeled historical RDP logs, using features such as source/destination IP, user account, time of day, and a binary feature 'IsSourceOnWatchlist'. Use the model to predict the likelihood of a new RDP session from a watchlisted entity being malicious."
            ]
          },
          {
            "description": "A registry modification enabling RDP (`HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnections` set to 0) or disabling security features, followed within a short time window by an outbound RDP connection from the same host.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Zeek rdp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Servers not typically configured for RDP access",
            "action": [
              "Symbolic: Create a SIEM correlation rule that alerts when a registry modification event (Windows Event ID 4657) for the key `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnections` with value `0` is followed within 5 minutes by an outbound network connection event (Zeek conn.log) from the same host to destination port 3389.",
              "Statistical: For hosts that trigger the symbolic rule, analyze the command line arguments of processes (Windows Event ID 4688) spawned around the time of the RDP connection. Calculate the entropy of the command line; a high entropy score (e.g., > 4.5) may indicate obfuscated commands used by malware to launch the RDP client.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) trained on sequences of host-based events (registry changes, process creations, network connections). Identify anomalous sequences that match the pattern of 'Enable RDP -> Connect Outbound', which deviate from normal administrative behavior."
            ]
          },
          {
            "description": "A single user account or source IP address establishing successful RDP connections to a number of distinct destination hosts that exceeds a statistically determined baseline within a defined time window (e.g., 10 hosts in 30 minutes).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Chokepoints (e.g., Core Switches), All Subnets",
            "action": [
              "Symbolic: Create a SIEM rule that counts distinct destination hosts per source IP for RDP connections (port 3389) in a 30-minute window. Alert if the count exceeds a hard threshold (e.g., > 10 hosts), which is indicative of scanning or spraying activity.",
              "Statistical: For each source IP, calculate a baseline of the number of unique RDP destinations connected to per hour. Use a sliding window to continuously monitor this metric. Generate an alert if the count for a given source in any window exceeds the 99th percentile of its own historical behavior or the 99th percentile of all sources' behavior.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on RDP connection data, with features like source IP, number of unique destinations, and time between connections. The algorithm will group normal RDP activity into clusters; connections that fall outside these clusters (noise points) are flagged as anomalous fan-out behavior."
            ]
          },
          {
            "description": "An RDP connection is established between two network segments that typically do not communicate, or between a source/destination host pair that has never or rarely communicated via RDP before (e.g., a connection from a developer workstation to a finance server).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Firewalls, Network Taps/Spans, Core Switches, All Servers and Endpoints",
            "action": [
              "Symbolic: Define network segment policies in a SIEM (e.g., 'DEV_NET' cannot RDP to 'FINANCE_NET'). Create a rule that alerts on any RDP connection (Zeek conn.log on port 3389) where the source and destination IP addresses violate a defined policy.",
              "Statistical: Build a communication graph or a simple lookup table of all historical source-destination RDP pairs. For each new RDP connection, check its frequency in the historical data. Alert on any connection pair that has a frequency of zero (first time seen) or falls below a low-frequency threshold (e.g., seen < 5 times in 90 days).",
              "Machine Learning: Apply community detection algorithms (e.g., Louvain Modularity) to the network RDP graph to automatically identify clusters of hosts that frequently interact. An RDP connection that bridges two distinct and normally separate communities is flagged as a potentially malicious lateral movement event."
            ]
          },
          {
            "description": "Following a successful RDP login (Logon Type 10), the same logon session (identified by Logon ID) is used to execute discovery commands (e.g., `net group`, `whoami`), credential dumping tools, or establish new C2 network connections.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Servers, Privileged Access Workstations, DNS Servers",
            "action": [
              "Symbolic: Correlate a successful RDP login (Windows Event ID 4624, Logon Type 10) with subsequent process creation events (Event ID 4688) under the same Logon ID. Alert if the process name or command line contains keywords associated with reconnaissance or credential access (e.g., 'whoami', 'net group', 'mimikatz', 'procdump').",
              "Statistical: For each RDP session, analyze the DNS queries (Zeek dns.log) made by processes spawned within that session. Calculate the rarity of the requested domains compared to a 30-day baseline for the entire organization. A query for a domain in the bottom 1% of prevalence could indicate C2 activity.",
              "Machine Learning: Train a time-series forecasting model (e.g., LSTM) on the normal sequence of process executions and network connections that follow a typical RDP login for a specific user or role. If the sequence of events following a new RDP login significantly deviates from the predicted 'normal' sequence, flag the session for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]