[
  {
    "information_requirement": "Is the adversary attempting to gain access to credentials using API hooking?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1056.004",
        "name": "Credential API Hooking",
        "evidence": [
          {
            "description": "A process is created from an executable file whose hash is a known indicator of compromise (IOC) for malware that performs API hooking.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Domain Controllers, Critical application servers (e.g., HR, Finance)",
            "action": [
              "Symbolic Logic: Correlate the SHA256 hash of every created process (from Windows Event ID 4688) against a threat intelligence feed of hashes known to be associated with credential API hooking malware. A direct match triggers a high-severity alert.",
              "Statistical Method: Calculate the prevalence of each process hash across all endpoints over a 30-day window. A hash observed on a very small number of systems (e.g., < 5 hosts or < 0.1% of the fleet) that is not part of a targeted software deployment is a statistical anomaly requiring investigation.",
              "Machine Learning Application: Utilize a supervised classification model (e.g., Random Forest) trained on process creation event features (parent process, command-line entropy, hash prevalence, username) to predict if a process is malicious. A high probability score for a low-prevalence process indicates likely malicious activity."
            ]
          },
          {
            "description": "A process is executed with command-line arguments or parent-child relationships indicative of in-memory injection or the loading of a hooking module.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Servers with administrative tools, Development environments",
            "action": [
              "Symbolic Logic: Use regular expressions on process command lines (Windows Event ID 4688) to detect patterns associated with hooking tools (e.g., 'SetWindowsHookEx', 'LdrLoadDll', use of rundll32.exe to load a non-system DLL). Maintain and alert on a list of forbidden parent-child relationships, such as lsass.exe spawning cmd.exe.",
              "Statistical Method: Calculate the Shannon entropy of command-line arguments for each process. Establish a baseline entropy score for common processes (e.g., svchost.exe, powershell.exe) and alert on significant positive deviations (e.g., a score > 3 standard deviations from the mean for that process name), which can indicate obfuscation or packed commands.",
              "Machine Learning Application: Employ an unsupervised clustering algorithm (e.g., DBSCAN) on vectorized command-line arguments. This can identify novel clusters of anomalous command-line structures that deviate from established patterns of benign activity, potentially revealing new or unknown hooking tools."
            ]
          },
          {
            "description": "A legitimate credential-handling process (e.g., chrome.exe, mstsc.exe, winlogon.exe) spawns an anomalous child process or initiates a network connection to a rare destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for lsass.exe), User workstations (for browsers, RDP clients), Jump boxes",
            "action": [
              "Symbolic Logic: Define and enforce a strict allow-list of legitimate child processes for sensitive applications like lsass.exe, winlogon.exe, and mstsc.exe. Any process creation (Windows Event ID 4688) that violates this defined parent-child relationship is a high-confidence indicator of compromise.",
              "Statistical Method: For each sensitive process, build a statistical profile of its network destinations (IPs, domains, ports) using Zeek conn.log and dns.log. Alert when the process initiates a connection to a destination that falls into a rare percentile (e.g., a domain seen for the first time, or an IP in the bottom 1% of connection frequency).",
              "Machine Learning Application: Use a time-series anomaly detection model (e.g., LSTM Autoencoder) on sequences of network events (e.g., connections per minute, data volume) originating from credential-handling processes. The model learns the normal rhythm of network activity and flags significant deviations that could represent a hooked process initiating C2 communications."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary collecting sensitive data via API hooking?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1056.004",
        "name": "Credential API Hooking",
        "evidence": [
          {
            "description": "Network traffic originating from a host with suspected API hooking activity is directed to a destination IP or domain known to be associated with malicious C2 or data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS servers, Proxy servers",
            "action": [
              "Symbolic Logic: Match all destination IPs and domains from network logs (Zeek conn.log, Zeek dns.log) against a threat intelligence feed of known malicious C2 infrastructures. A match from a host with other concurrent indicators of hooking is a high-confidence sign of active collection.",
              "Statistical Method: Profile the JA3/JA3S TLS fingerprints from outbound connections (Zeek ssl.log) to establish a baseline of legitimate client software. Identify and alert on rare or previously unseen fingerprints, as adversary tooling often uses non-standard TLS libraries, making their fingerprints statistical outliers.",
              "Machine Learning Application: Use a supervised classifier (e.g., Gradient Boosting) to assign a risk score to every outbound network connection based on features like destination ASN, port, JA3 fingerprint, data volume, and domain reputation. A high score for a connection from a process suspected of hooking indicates likely data collection."
            ]
          },
          {
            "description": "An unusual process initiates the creation of an archive file (e.g., .zip, .rar) that includes data from temporary locations or user directories where hooked credentials may be staged.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, File servers, Staging servers",
            "action": [
              "Symbolic Logic: Monitor process creations (Windows Event ID 4688) for archiving utilities (e.g., 7z.exe, tar.exe, Compress-Archive). Alert if the command's source path targets sensitive locations (e.g., browser profile folders, temporary directories) and the parent process is anomalous (e.g., not explorer.exe or cmd.exe).",
              "Statistical Method: For each user, establish a baseline of normal archiving activity (e.g., frequency, typical parent processes, time of day). An execution that is a statistical outlier (e.g., a developer's account running 7z.exe at 3 AM with svchost.exe as the parent) should trigger an alert.",
              "Machine Learning Application: Use an unsupervised anomaly detection model like Isolation Forest on process event features (process name, parent process, command-line entropy, user context) to identify anomalous archival activities that do not conform to learned patterns of benign behavior."
            ]
          },
          {
            "description": "A process spawned by a hooked, credential-handling parent (e.g., lsass.exe) accesses or creates files in temporary staging directories or initiates network connections consistent with data exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication servers, User workstations with privileged access",
            "action": [
              "Symbolic Logic: Create a critical alert that triggers if the lsass.exe process spawns any child process, as captured by Windows Event ID 4688. This behavior is almost exclusively malicious and is a strong indicator of credential theft and collection.",
              "Statistical Method: For child processes of other sensitive parents (e.g., winlogon.exe), analyze the destination of their network connections (Zeek conn.log). A connection to a destination IP/port combination that is statistically rare for the enterprise (<0.1% prevalence) is a strong indicator of collection activity.",
              "Machine Learning Application: Use a graph-based anomaly detection model where nodes are processes and network endpoints. Identify anomalous subgraphs, such as a critical process spawning a previously unseen child process that connects to a new external destination, which deviates significantly from the learned 'normal' enterprise activity graph."
            ]
          },
          {
            "description": "A host exhibits a significant, anomalous increase in outbound data volume to a new or rare destination shortly after the execution of a process potentially associated with API hooking.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Core network switches, Host-based firewalls",
            "action": [
              "Symbolic Logic: Alert when the total outbound data (orig_bytes from Zeek conn.log) from a single host to a single destination IP exceeds a hard threshold (e.g., 100MB in 1 hour), provided the destination is not on a pre-approved allow-list for services like cloud backup or large file transfers.",
              "Statistical Method: For each host, model the expected daily outbound data volume using a time-series analysis (e.g., Holt-Winters). An observation that exceeds a dynamic threshold, such as the 99th percentile of the trailing 30-day distribution, indicates a statistically significant spike in traffic warranting investigation for data exfiltration.",
              "Machine Learning Application: Use a K-Means clustering algorithm on network flow features (total bytes, duration, packets per second, destination ASN) to group flows into 'normal' behaviors. Flows that fall into a 'high-volume, long-duration' outlier cluster, especially to a rare destination, are flagged as potential exfiltration channels for collected data."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]