[
  {
    "information_requirement": "Is an adversary leveraging Visual Basic for code execution?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1059.005",
        "name": "Visual Basic",
        "evidence": [
          {
            "description": "A Windows Script Host process (wscript.exe or cscript.exe) initiates a network connection to a destination IP address or domain matching a known malicious indicator.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 5156",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Network Egress Points",
            "action": [
              "Symbolic: Correlate process execution data (Windows Event ID 4688 or Sysmon Event ID 1) for 'wscript.exe' or 'cscript.exe' with network connection data (Zeek conn.log, Windows Event ID 5156, or Sysmon Event ID 3) by process ID and timestamp. Join the destination IP or domain with a threat intelligence feed of known malicious C2 infrastructure. Alert on any match.",
              "Statistical: For all network connections originating from 'wscript.exe' or 'cscript.exe', calculate the statistical rarity of the destination domain using a domain generation algorithm (DGA) score or by checking against a list of the top 1 million most popular domains. Alert on connections to domains that are both statistically rare (e.g., not in the top 1M) and have a high entropy score on the domain name, exceeding the 95th percentile of typical domain entropy.",
              "Machine Learning: Develop a time-series model to forecast the expected volume of network connections from script hosts per hour. Alert on significant deviations where the observed connection count exceeds the forecasted upper bound (e.g., > 3 standard deviations above the mean forecast). Additionally, use a trained classification model to score the likelihood of a connection being malicious based on features such as destination port, bytes sent/received, connection duration, and destination domain reputation."
            ]
          },
          {
            "description": "A wscript.exe or cscript.exe process is executed with command-line arguments containing strings or patterns indicative of malicious activity, obfuscation, or specific offensive tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Web Servers",
            "action": [
              "Symbolic: Scan command-line arguments from process creation events (Windows Event ID 4688, Sysmon Event ID 1) for 'wscript.exe' and 'cscript.exe'. Apply a set of regular expressions to detect keywords ('CreateObject', 'WScript.Shell', 'ADODB.Stream'), execution flags ('//B', '//E:VBScript'), and signatures of known VBS-based tools. Alert on any match.",
              "Statistical: For all 'wscript.exe' and 'cscript.exe' executions, calculate the Shannon entropy and the character frequency distribution of the command-line arguments. Establish a baseline for these metrics across the environment. Alert when the entropy of a command line exceeds the 98th percentile, or when its length is more than 3 standard deviations above the mean for that script host.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) on a labeled dataset of benign and malicious VBS command lines using features such as command length, n-gram frequency, entropy, and keyword presence. Deploy the model to score all new script host command lines in real-time and alert on those classified as malicious with a high confidence score (e.g., > 0.9)."
            ]
          },
          {
            "description": "A Microsoft Office parent process (e.g., winword.exe, excel.exe, powerpnt.exe, outlook.exe, msaccess.exe) creates a child process identified as a Windows Script Host (wscript.exe or cscript.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Email Gateways, File Servers",
            "action": [
              "Symbolic: Create a detection rule that triggers an alert for any process creation event (Windows Event ID 4688, Sysmon Event ID 1) where the ParentProcessName is one of 'winword.exe', 'excel.exe', 'powerpnt.exe', 'outlook.exe', or 'msaccess.exe' and the NewProcessName is 'wscript.exe' or 'cscript.exe'.",
              "Statistical: For all parent-child process relationships, maintain a frequency count. Identify the relationship 'Office App -> Script Host'. Calculate the rarity of this specific relationship per user and per host. Alert if this relationship occurs for a user for the first time, or if the frequency for a specific host places it in the 99th percentile of all hosts.",
              "Machine Learning: Use an unsupervised learning model, such as a one-class SVM or isolation forest, trained on features of legitimate parent-child process relationships (e.g., parent name, child name, user context). Apply the model to all new process creations and flag any 'Office App -> Script Host' event that the model identifies as a significant outlier."
            ]
          },
          {
            "description": "A file with a .vbs or .vbe extension is created in a user-writable directory (e.g., %TEMP%, %APPDATA%), and is subsequently executed by wscript.exe or cscript.exe within a short time window.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Temporary File Directories, User Profile Directories",
            "action": [
              "Symbolic: Correlate file creation events (Sysmon Event ID 11) for files ending in '.vbs' or '.vbe' in directories like '%APPDATA%', '%TEMP%', or 'C:\\Users\\Public' with process creation events (Sysmon Event ID 1) where the command line contains the path to the newly created file. Trigger an alert if the execution occurs within 60 seconds of file creation.",
              "Statistical: Analyze the paths of all '.vbs' and '.vbe' files being executed. Build a baseline of common, legitimate script locations. Calculate the frequency of execution from different directory paths. Alert when a script is executed from a statistically rare location (e.g., a path seen on less than 1% of endpoints) or a high-risk location like a user's Downloads folder.",
              "Machine Learning: Implement a sequence analysis model (e.g., using Hidden Markov Models) to learn normal sequences of events (file write, process execute, network connection). Alert when the model flags the sequence '(Browser/Email Client Process) -> (File Write .vbs) -> (Process Execute wscript.exe)' as a low-probability, anomalous sequence."
            ]
          },
          {
            "description": "The vbscript.dll module is loaded by a process not on an established allow-list of legitimate script hosts, such as rundll32.exe, svchost.exe, or a custom compiled executable.",
            "data_sources": [
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, System32 Directory",
            "action": [
              "Symbolic: Monitor Sysmon Event ID 7 (Image Loaded) events. Create an allow-list of legitimate processes known to load 'vbscript.dll' (e.g., 'wscript.exe', 'cscript.exe', 'mshta.exe'). Generate a high-severity alert for any process not on this list that loads 'vbscript.dll'.",
              "Statistical: For every process that loads 'vbscript.dll', track its prevalence across the enterprise. Build a frequency distribution of processes loading the DLL. Alert when a process that is statistically rare (e.g., observed on < 5 endpoints in the last 30 days) loads 'vbscript.dll'.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on Sysmon Event ID 7 data, clustering events based on features like the process name, process path, and user context. Normal activity will form dense clusters. Flag any 'vbscript.dll' load event that is identified as a noise point or part of a very small, sparse cluster as a potential anomaly."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]