[
  {
    "information_requirement": "Has the adversary executed commands via the hypervisor CLI? (TA0002 - Execution)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1059.012",
        "name": "Hypervisor CLI",
        "evidence": [
          {
            "description": "Observed execution of a process or command whose file hash or command-line arguments exactly match a known indicator of compromise (IOC) associated with hypervisor malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management servers (e.g., vCenter), designated administrator workstations, and jump boxes with hypervisor management tools installed.",
            "action": [
              "Symbolic Logic: Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for command-line arguments containing hypervisor CLI tools (`esxcli`, `vim-cmd`, `PowerCLI`) and match the full command line, process name, or associated file hash against a threat intelligence feed of known hypervisor malware IOCs. Generate a high-severity alert upon any match.",
              "Statistical Method: For all hypervisor CLI command executions, calculate the historical frequency of each unique command-line string per user. Alert on the execution of a command string that is statistically rare for the environment (e.g., in the bottom 5th percentile of historical frequency), even if not explicitly matching a known IOC.",
              "Machine Learning: Develop a supervised classification model (e.g., a random forest) trained on a labeled dataset of benign and malicious hypervisor CLI command-line strings. Feed all new command-line executions into the model for real-time classification. An execution classified as 'malicious' with a high confidence score should trigger an automated investigation workflow."
            ]
          },
          {
            "description": "Execution of a hypervisor CLI command containing specific keywords or argument patterns associated with destructive actions (e.g., `vm process kill`, `snapshot.removeall`, `firewall set --enabled false`), where the execution is not correlated with a scheduled change request.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management servers (e.g., vCenter), designated administrator workstations, and jump boxes with hypervisor management tools installed.",
            "action": [
              "Symbolic Logic: Create a watchlist of high-risk command-line patterns for hypervisor CLIs (e.g., `esxcli vm process kill`, `vim-cmd vmsvc/snapshot.removeall`, `esxcli network firewall set --enabled false`). Scan all process creation logs (Windows Event ID 4688, Sysmon Event ID 1) in real-time and alert on any command that contains a string from this watchlist.",
              "Statistical Method: For each high-risk command pattern, establish a baseline of normal execution frequency per user and per host. Monitor for statistical outliers, such as a user executing `esxcli vm process kill` significantly more often than their historical average (e.g., > 3 standard deviations above the mean within a 1-hour window), which could indicate a scripted, widespread attack.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on the features of command executions (user, host, command keywords, time of day). Identify clusters of activity that represent normal administrative behavior. Flag any command execution that does not fall into a known 'benign' cluster as an anomaly for analyst review."
            ]
          },
          {
            "description": "A sequence of hypervisor CLI commands executed by a single user or parent process within a defined time window (e.g., under 30 minutes) that matches a known attack chain, such as VM enumeration followed by iterative process termination or file deletion.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management servers (e.g., vCenter), designated administrator workstations, and jump boxes with hypervisor management tools installed.",
            "action": [
              "Symbolic Logic: Define and search for specific, ordered sequences of commands in process logs from the same source user/host. For example, trigger an alert if `vim-cmd vmsvc/getallvms` is followed within 30 minutes by multiple instances of `esxcli vm process kill` or `vmkfstools` targeting VMDK files. This requires a stateful detection engine.",
              "Statistical Method: Calculate the entropy of command types executed by a user within a rolling 15-minute time window. A sudden drop in entropy, indicating a user is repetitively running the same or similar destructive commands (e.g., `esxcli vm process kill` in a loop), could signal a malicious script. Alert when entropy falls below a dynamically calculated baseline for that user.",
              "Machine Learning: Apply a sequence analysis model (e.g., a Hidden Markov Model or a Recurrent Neural Network) trained on known benign and malicious command sequences. Feed streams of user command activity into the model to calculate the probability of the current sequence being malicious. Alert when this probability exceeds a predefined threshold."
            ]
          },
          {
            "description": "Execution of a hypervisor CLI command by a user account not on the authorized administrator list, from a source host not designated for management, or at a time outside of established business hours or maintenance windows, where the deviation exceeds a statistical threshold.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management servers (e.g., vCenter), designated administrator workstations, domain controllers, and jump boxes.",
            "action": [
              "Symbolic Logic: Maintain an explicit allow-list of authorized user accounts and source hostnames/IPs for hypervisor administration. Query process logs (Windows Event ID 4688, Sysmon Event ID 1) and alert on any hypervisor CLI execution where the `UserName` or `SourceHost` is not on the respective allow-list.",
              "Statistical Method: For each authorized user, profile the typical hours of activity (using logon events from Event ID 4624) and frequency of CLI usage. Use percentile-based alerting to flag deviations, such as a command executed at a time that falls in the 1st percentile of the user's activity distribution, or from an IP address that is statistically rare for that user.",
              "Machine Learning: Use an anomaly detection model (e.g., an Isolation Forest) on a feature set including user, source IP, time of day, and command executed. The model learns the 'normal' manifold of administrative activity. Any data point with a high anomaly score is flagged for investigation."
            ]
          },
          {
            "description": "A network connection originating from a hypervisor's management IP address to a destination IP or domain that is either on a known-bad CTI list or is statistically rare for that hypervisor's typical communication patterns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors monitoring traffic to/from hypervisor management interfaces, core network switches, and internet gateways.",
            "action": [
              "Symbolic Logic: Continuously monitor `Zeek conn.log` for connections where `id.orig_h` is a hypervisor management IP. Join this with `Zeek dns.log` to get domain names. Match the `id.resp_h` (destination IP) or queried domain against a CTI feed of known malicious IPs/domains. Alert on any match.",
              "Statistical Method: For each hypervisor management IP, create a baseline of all destination IPs, ports, and domains it communicates with over a 30-day period. Calculate the frequency of each connection. Alert when a new connection is made to a destination IP/port/domain that has never been seen before or is in the bottom 1st percentile of connection frequency (a 'long tail' connection).",
              "Machine Learning: Use a community detection algorithm (e.g., Louvain method) on a graph where nodes are IPs and edges are connections from `Zeek conn.log`. Identify normal communication communities (e.g., hypervisors talking to storage, vCenter, DNS servers). A connection from a hypervisor to a node outside of its normal community is an anomaly that should be investigated."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]