[
  {
    "information_requirement": "Is the adversary relocating malware to evade defenses? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.010",
        "name": "Relocate Malware",
        "evidence": [
          {
            "description": "A known malicious executable, identified by its file hash, is created or executed from any location on disk.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All managed endpoints and servers, particularly user workstations and critical servers hosting sensitive data.",
            "action": [
              "Symbolic: Query SIEM for file creation (Windows Event ID 4663) or process creation (Windows Event ID 4688) events where the file hash matches a list of known malicious hashes from threat intelligence feeds. Alert on any match.",
              "Statistical: For any process execution (Windows Event ID 4688), calculate the prevalence of its file hash across the enterprise over the last 30 days. Flag any hash that is present on fewer than 1% of endpoints (low prevalence) for further analysis, as malware often has a limited distribution compared to legitimate software.",
              "Machine Learning: Use a supervised classification model (e.g., a pre-trained model integrated into an EDR platform) that uses file hashes, along with other features like file path and signer info, to predict the probability of a file being malicious. Alert when the probability score exceeds a predefined threshold (e.g., > 0.9)."
            ]
          },
          {
            "description": "An executable file is created or a process is initiated where the filename exhibits high entropy, matches known malware naming conventions, or uses a double extension.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Common staging directories (%APPDATA%, %TEMP%, %PUBLIC%, Downloads), and user profile directories on all endpoints.",
            "action": [
              "Symbolic: Using SIEM queries on process creation events (Windows Event ID 4688), apply a set of regular expressions to the ProcessName or NewProcessName field to detect patterns like double extensions (e.g., \\.pdf\\.exe$), typosquatting of system executables (e.g., scvhost\\.exe), or names used by known tools (e.g., mimikatz\\.exe).",
              "Statistical: For each new executable name observed in file creation (Windows Event ID 4663) or process creation (Windows Event ID 4688) events, calculate the Shannon entropy of the filename (excluding the extension). Establish a baseline entropy for legitimate software names in your environment. Alert on filenames whose entropy score is in the top 5th percentile (e.g., d8a9b7c6d5e4f3a2.exe), as this indicates a high degree of randomness.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) using features extracted from filenames (length, character distribution, entropy, presence of dictionary words). Use this model to score new process names in real-time, flagging those classified as 'suspicious' or 'malware-like' for analyst review."
            ]
          },
          {
            "description": "A process executes using a legitimate system file name (e.g., svchost.exe, lsass.exe) but from a non-standard file path where it does not normally reside.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-critical directories (e.g., C:\\Windows\\System32, C:\\Windows\\SysWOW64) and common user-writable directories (%TEMP%, %APPDATA%).",
            "action": [
              "Symbolic: Create a watchlist of critical Windows process names (e.g., svchost.exe, lsass.exe, csrss.exe) and their legitimate, absolute paths (e.g., C:\\\\Windows\\\\System32\\\\svchost.exe). Query process creation events (Windows Event ID 4688) where the ProcessName is on the watchlist but the ImagePath is NOT in the list of legitimate paths. Alert on any match.",
              "Statistical: For each process name, build a historical baseline of all parent processes and execution paths seen in the environment over the past 90 days. Using process creation events (Windows Event ID 4688), identify any execution of a common system process from a path that has never been seen before or is seen less than 0.1% of the time (a rare path).",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on process creation events. The model should be trained on features including the process name, image path, parent process name, and command-line arguments. The model will learn normal combinations and flag new executions that deviate significantly from the established baseline, such as a known process running from an anomalous location."
            ]
          },
          {
            "description": "A sequence of events on a single host within a short time window (<5 minutes) shows: 1) a file create event, 2) a second file create event in a new location, 3) a process execution from the new location, and 4) a file delete event for one of the two files.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4660",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint and server file systems, with a focus on correlating activity between download/staging directories (Downloads, Temp) and persistence/execution directories (ProgramData, AppData, Startup folders).",
            "action": [
              "Symbolic: Create a stateful correlation rule in the SIEM that triggers on a specific sequence of events per host within a 2-minute window: (File Create in Path A) -> (File Create in Path B) -> (Process Create from Path B) -> (File Delete of Path A or B). Enrich this by checking if Path B is a known persistence location.",
              "Statistical: Analyze sequences of file and process events. Calculate the frequency of different event chains (e.g., create->execute->delete vs. create->execute). Identify sequences that are statistically rare in the environment. A high-risk score can be assigned to the create->move->execute->delete sequence, especially if the file has a high-entropy name and the execution path is uncommon.",
              "Machine Learning: Use a sequence analysis model, such as a Recurrent Neural Network (RNN), trained on benign sequences of file system and process events from user workstations. Feed real-time event streams into the model to detect anomalous sequences that deviate from learned normal behavior, indicative of malware relocation and execution."
            ]
          },
          {
            "description": "A process, originating from a directory known to be used for evasion or commonly excluded from AV scans, establishes an external network connection to a destination not on an allowlist.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process execution logs, network egress points (firewalls, proxies), and Zeek sensors monitoring north-south traffic.",
            "action": [
              "Symbolic: Join process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log) on the host IP and a short time window. Alert if a process's ImagePath is in a high-risk directory (e.g., %APPDATA%, %TEMP%, C:\\\\Users\\\\Public\\\\) AND the destination IP in the corresponding conn.log entry is external and not on an organizational allowlist.",
              "Statistical: For all processes executing from high-risk directories, analyze their corresponding network connections from Zeek conn.log. Profile the destination IPs, ports, and data volumes. Alert when a connection is made to a destination IP that falls in the 99th percentile of rarity (i.e., a very infrequently contacted IP from that process/path combination) or when the data sent (orig_bytes) exceeds 3 standard deviations from the established baseline for that process.",
              "Machine Learning: Implement a time-series anomaly detection model on network traffic volume (bytes_out) for processes originating from high-risk directories. The model should learn the normal 'heartbeat' or pattern of network activity. An alert is generated when a sudden, unexpected spike in outbound traffic is detected that cannot be explained by the model, suggesting C2 communication from a relocated malicious process."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]