[
  {
    "information_requirement": "Is the adversary collecting sensitive information from email services? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114.002",
        "name": "Remote Email Collection",
        "evidence": [
          {
            "description": "A successful (Windows Event ID 4624) or failed (Windows Event ID 4625) authentication event to an email service where the source IP address is present on a threat intelligence feed of known malicious IPs, anonymizing proxies, or TOR exit nodes.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory Domain Controllers), Cloud Identity Provider (e.g., Azure AD), Mail Servers (e.g., on-prem Exchange), Network Egress Points",
            "action": [
              "Symbolic Logic: Join email service authentication logs (Windows Event IDs 4624, 4625) with a Cyber Threat Intelligence (CTI) feed. Generate an alert for any authentication attempt where the source IP address matches an entry on the CTI list (e.g., known C2, TOR exit node, malicious proxy).",
              "Statistical Method: Calculate the rarity of the source Autonomous System Number (ASN) and country for each login. Create a risk score by summing rarity scores (e.g., inverse frequency). If a login's source IP matches a CTI feed AND the ASN/country combination is in the bottom 5th percentile of historical logins for that user, escalate the alert priority.",
              "Machine Learning: Train a binary classification model (e.g., Logistic Regression, Random Forest) on historical login data, labeling events based on matches with historical CTI feeds. Use features like source IP, ASN, country, time of day, and protocol. Use the model to predict the likelihood of a new, unseen login being malicious, even if the IP is not yet on a CTI feed."
            ]
          },
          {
            "description": "Observed network traffic containing HTTP User-Agent strings (from Zeek http.log) or MAPI/EWS API call sequences (inferred from Zeek conn.log traffic patterns) that match signatures of known email collection tools like MailSniper or Ruler.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (e.g., on-prem Exchange), Web Application Firewalls (WAFs), Network Egress Points",
            "action": [
              "Symbolic Logic: Create and apply a set of regular expression rules to Zeek http.log `user_agent` fields to detect known User-Agents associated with tools like MailSniper (e.g., 'MailSniper'). Alert on any match.",
              "Statistical Method: For each user, calculate the entropy of their User-Agent strings over a 30-day rolling window. A sudden drop in entropy for a user, indicating the repeated use of a single, non-browser User-Agent, should trigger an alert. Flag User-Agents that are statistically rare across the entire organization (e.g., seen in <0.1% of sessions).",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) on API call patterns or protocol commands extracted from session data (Zeek conn.log). Train the model on benign user sessions to learn normal sequences. Apply the model to new sessions to detect anomalous sequences that deviate from normal behavior and may represent automated tool activity."
            ]
          },
          {
            "description": "A successful authentication event (Windows Event ID 4624) for a user account that deviates from its established baseline across multiple dimensions simultaneously, including: source geolocation, time of day, and sequential login velocity ('impossible travel').",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory Domain Controllers), Cloud Identity Provider (e.g., Azure AD), VPN Concentrators, Network Egress Points",
            "action": [
              "Symbolic Logic: For each new login, compare its timestamp and geolocation (derived from the source IP in Zeek conn.log) with the previous login for that same user (from Windows Event ID 4624). If `(distance / time_delta) > 600 mph`, trigger an 'impossible travel' alert.",
              "Statistical Method: For each user, create a historical baseline profile including: 1) a set of common source countries/ASNs, and 2) a distribution of login hours. For each new login, score deviations from this baseline (e.g., +1 for rare country, +1 for login hour > 2 standard deviations from the user's mean hour). An aggregate score exceeding a predefined threshold triggers an alert.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on user login data, with features like geolocation (latitude/longitude), time of day, and day of week. The algorithm will form clusters of 'normal' activity for each user. Any login that falls outside these clusters is flagged as an outlier/anomaly for investigation."
            ]
          },
          {
            "description": "A user's network session to a known mail service (identified via Zeek conn.log) where the total bytes sent from the server to the client (`resp_bytes`) significantly exceeds the user's historical per-session data transfer baseline.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (e.g., on-prem Exchange), Network Egress Points, Cloud Tenant (e.g., O365, Google Workspace)",
            "action": [
              "Symbolic Logic: For sessions involving mail protocols (IMAP/S, POP3/S, MAPI) or connections to known cloud mail IP ranges, create a rule that alerts if the `resp_bytes` in a single Zeek conn.log entry exceeds a hard threshold (e.g., 1 GB).",
              "Statistical Method: For each user, calculate the 95th percentile of their session data volume (`resp_bytes`) to mail services over the last 30 days. Trigger an alert if a new session's data volume for that user exceeds this 95th percentile value.",
              "Machine Learning: Implement a time series forecasting model (e.g., ARIMA) for each user's daily aggregate data transfer volume to mail services. The model predicts the expected volume for the next day with a confidence interval. If the actual observed volume exceeds the upper bound of the forecast's confidence interval, flag it as an anomaly."
            ]
          },
          {
            "description": "A single user session exhibiting characteristics of automation, such as an abnormally high count of distinct requests or an unusually low and consistent inter-request timing, when compared to a baseline of normal human-driven activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (e.g., on-prem Exchange), Web Application Firewalls (WAFs), Cloud Tenant (e.g., O365, Google Workspace)",
            "action": [
              "Symbolic Logic: Within a single session to a webmail service (from Zeek http.log), count the number of distinct URLs accessed that correspond to opening mail folders or items. If the count exceeds a fixed threshold (e.g., 200 folders in 10 minutes), trigger an alert for programmatic access.",
              "Statistical Method: For a given email protocol session (inferred from Zeek conn.log), calculate the standard deviation of the inter-packet-arrival times. A very low standard deviation suggests automated, machine-paced requests rather than human-driven clicks. Alert on sessions in the lowest 1st percentile of this metric across all user sessions.",
              "Machine Learning: Train a classifier on session-level features to distinguish between 'human' and 'bot' activity. Features could include: request count, session duration, standard deviation of inter-request times, and entropy of requested URLs. Use this model to score new sessions and alert on those classified as 'bot' with high confidence."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]