[
  {
    "information_requirement": "Is the adversary using ClickOnce applications for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1127.002",
        "name": "ClickOnce",
        "evidence": [
          {
            "description": "A ClickOnce execution event is observed where the associated URL, domain, IP address, or file hash matches an entry in a high-confidence threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Internet Gateway/Proxy Servers, SIEM/Threat Intelligence Platform",
            "action": [
              "Symbolic: Create a detection rule that joins network logs (Zeek http.log, dns.log) with process execution logs (Windows Event ID 4688). Alert if the domain/URL from a request for a '.application' or '.appref-ms' file, or the command line of a 'dfshim.dll' execution, matches a known malicious indicator from a threat intelligence feed. Separately, check the hash of any downloaded executable (from Zeek files.log or endpoint EDR logs) against a malicious hash repository.",
              "Statistical: For all domains hosting ClickOnce applications, calculate the domain's age, popularity (e.g., Tranco rank), and historical prevalence in the organization. Calculate a risk score based on these features (e.g., new domain + low popularity + rare in environment = high score). Alert on executions where the domain's risk score exceeds a statistical threshold, such as the 99th percentile of all observed software source domains.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features extracted from ClickOnce execution events, including URL string entropy, number of subdomains, presence of keywords (e.g., 'update'), domain age, and file signer information. Use the model to classify each new ClickOnce execution as benign or malicious, alerting on high-probability malicious classifications."
            ]
          },
          {
            "description": "A process creation event is observed where the command line contains the substring 'rundll32.exe dfshim.dll,ShOpenVerbApplication'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Application Servers",
            "action": [
              "Symbolic: Create a high-severity detection rule that triggers on any process creation event (Windows Event ID 4688) where the command line contains the literal string 'rundll32.exe' and 'dfshim.dll,ShOpenVerbApplication'. This pattern is highly specific and almost always suspicious.",
              "Statistical: Profile the parent processes that spawn 'rundll32.exe dfshim.dll...'. Establish a baseline of normal parent processes (e.g., explorer.exe). Alert when a statistically rare parent process, such as an Office application (winword.exe, excel.exe) or a web browser, initiates this command. Use frequency analysis to identify parents that fall below a low percentile threshold (e.g., <1% of occurrences).",
              "Machine Learning: Develop a sequence analysis model (e.g., an LSTM or Hidden Markov Model) to analyze the chain of process executions leading up to the 'rundll32.exe dfshim.dll...' command. Train the model on benign user activity sequences. Flag any execution sequence that has a low probability score according to the model, indicating a deviation from normal behavior, such as being spawned from a macro-enabled document."
            ]
          },
          {
            "description": "The 'dfsvc.exe' process spawns a child process that is not on an established allowlist of expected application installers or updaters.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Servers with .NET applications",
            "action": [
              "Symbolic: Create an allowlist of known-good child process names that are legitimately spawned by 'dfsvc.exe' in your environment. Create a detection rule to alert on any process creation event (Windows Event ID 4688) where the parent process is 'dfsvc.exe' and the child process name is not on the allowlist. Pay special attention to scripting engines (powershell.exe, cmd.exe, wscript.exe) and LOLBAS binaries.",
              "Statistical: For each child process of 'dfsvc.exe', compute the entropy of its command-line arguments. Establish a baseline entropy score for each legitimate child process. Alert when a new execution's command-line entropy deviates significantly (e.g., > 3 standard deviations) from its historical baseline, as this can indicate obfuscated or unusual parameters.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features of child processes spawned by 'dfsvc.exe', including process name, command-line length, and argument structure. The algorithm will group legitimate executions into clusters. Flag any new execution that is identified as a noise point or falls outside of established clusters as an anomaly requiring investigation."
            ]
          },
          {
            "description": "An endpoint makes a network request to download a '.application' or '.appref-ms' file from a non-allowlisted domain, and this event is temporally correlated (e.g., within 60 seconds) with a 'dfsvc.exe' or 'rundll32.exe dfshim.dll...' process execution on the same endpoint.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Proxy Servers, User Workstations, DNS Resolvers",
            "action": [
              "Symbolic: Create an organizational allowlist of trusted domains for software distribution. Join network logs (Zeek http.log, dns.log) with endpoint logs (Windows Event ID 4688) on the client IP address and a short time window (e.g., 2 minutes). Alert when an endpoint downloads a '.application' or '.appref-ms' file from a domain not on the allowlist, and this is followed by a 'dfsvc.exe' process execution.",
              "Statistical: For each source IP address serving ClickOnce files, calculate the number of distinct endpoints in the organization that it serves. Establish a baseline for legitimate software distribution points (which should serve many endpoints). Alert when a ClickOnce file is downloaded from a source IP that has only ever served one or a very small number of endpoints (e.g., falls in the 1st percentile of 'clients served'), as this is characteristic of targeted attacks.",
              "Machine Learning: Implement a time-series analysis model to forecast the expected volume of ClickOnce downloads from specific domains or the network overall. Anomaly detection on this time series can identify sudden spikes in downloads from a new or unusual source, which could indicate a widespread phishing campaign delivering a malicious ClickOnce application."
            ]
          },
          {
            "description": "A file creation event for a file with a '.appref-ms' extension is observed within a known persistence location, such as a user's Startup folder.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Startup Folders on Endpoints, File System Audit Logs",
            "action": [
              "Symbolic: Configure file system auditing (SACL) on all user Startup folders ('%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'). Create a detection rule to alert on any file creation event (Windows Event ID 4663 with 'WriteData' or 'AppendData' access mask) where the object name ends in '.appref-ms' within these monitored directories. This is a highly specific indicator of persistence.",
              "Statistical: Periodically scan or query all user Startup folders across the enterprise. Calculate the prevalence of '.appref-ms' files. While some may be legitimate, any file that is statistically rare (present on only a few machines) and not part of a known software deployment package warrants investigation. Rank all found '.appref-ms' files by their prevalence (count of endpoints) and investigate those in the lowest percentiles.",
              "Machine Learning: Use a clustering model on the properties of files in Startup folders. Features can include file extension, signer information, file name entropy, and whether the file is an LNK, URL, or APPREF-MS. Train the model to identify clusters of common, legitimate startup items. Any '.appref-ms' file that is flagged as an outlier or forms a new, small cluster should be automatically submitted to a sandbox for dynamic analysis."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]