[
  {
    "information_requirement": "Is the adversary maintaining persistence using Outlook Home Pages? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1137.004",
        "name": "Outlook Home Page",
        "evidence": [
          {
            "description": "A network connection initiated by the Outlook.exe process to a destination URL, domain, or IP address that is present on a threat intelligence feed of known command and control (C2) servers or malicious sites.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Network egress points (e.g., firewalls, proxies), DNS resolvers",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) with DNS query logs (Zeek dns.log) on the client IP address. Correlate the destination IP and queried domain against a high-confidence threat intelligence feed of known malicious indicators. Generate an alert for any connection from OUTLOOK.EXE (identified via Windows Event ID 5156 or host agent) to a matched indicator.",
              "Statistical: For all domains resolved in network traffic originating from OUTLOOK.EXE, calculate the public suffix + 1 (e.g., evil.com from a.b.evil.com). Establish a baseline of the most frequently accessed domains by the organization's Outlook clients. Alert on connections to domains that fall below a low frequency threshold (e.g., 5th percentile), indicating rarity.",
              "Machine Learning: Develop a time-series model for the volume of network connections made by OUTLOOK.EXE per user. Flag user accounts where the connection volume exhibits a sudden, anomalous spike that deviates significantly from their historical pattern, which could indicate a malicious homepage making repeated callbacks."
            ]
          },
          {
            "description": "A modification event for a registry value within the `\\Software\\Microsoft\\Office\\<version>\\Outlook\\WebView\\` key path, where a URL is written to the value.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Citrix/VDI servers, Microsoft Exchange Servers",
            "action": [
              "Symbolic: Create a detection rule that triggers on any Windows Event ID 4657 (A registry value was modified) where the 'Object Name' contains `\\Outlook\\WebView\\` and the process name is not a legitimate installer or patch management tool (e.g., 'msiexec.exe'). Alert if the modifying process is a script interpreter (e.g., 'powershell.exe', 'cscript.exe') or an unknown executable.",
              "Statistical: Establish a baseline of processes that normally modify the `\\Outlook\\WebView\\` registry key path. Using process stacking across the enterprise, identify any modifying process that is statistically rare (e.g., seen on <1% of endpoints). A rare process making this specific modification is a high-fidelity indicator.",
              "Machine Learning: Train a decision tree or random forest classifier on registry modification events, using features such as the process name, parent process name, registry key path, and time of day. Label known-good events (e.g., Office updates) and known-bad events (e.g., from penetration testing). Use the trained model to classify new `\\Outlook\\WebView\\` modifications as benign or malicious."
            ]
          },
          {
            "description": "Spawning of script interpreters or command shells by Outlook.exe containing command-line arguments indicative of malicious script execution or downloaders.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Citrix/VDI servers",
            "action": [
              "Symbolic: Monitor for Windows Event ID 4688 (A new process has been created) where 'ParentProcessName' is 'OUTLOOK.EXE' and 'NewProcessName' is a script interpreter ('powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe'). Scan the 'CommandLine' field using regular expressions for suspicious arguments such as 'IEX', 'DownloadString', '-enc', 'http://', or 'https://'. Trigger an alert on a match.",
              "Statistical: For all command lines executed by child processes of OUTLOOK.EXE, calculate the entropy of the command-line string. Establish a baseline entropy score for normal commands. An unusually high entropy score can indicate obfuscated or encoded commands (e.g., Base64 encoded PowerShell), warranting an alert.",
              "Machine Learning: Use a Natural Language Processing (NLP) model, such as a bag-of-words or TF-IDF vectorizer, to transform command-line arguments into numerical features. Train a logistic regression or SVM classifier to distinguish between benign and malicious command lines spawned from Outlook. Use the model to score new command lines in real-time."
            ]
          },
          {
            "description": "A network connection from the Outlook.exe process to a destination domain that is newly registered (e.g., within the last 30 days) or is associated with a dynamic DNS service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Network egress points, DNS resolvers, Threat intelligence platforms (for domain enrichment)",
            "action": [
              "Symbolic: For every DNS query (Zeek dns.log) associated with traffic from OUTLOOK.EXE, enrich the query with domain registration data (WHOIS). Create a rule to alert on any connection to a domain registered within the last 30 days or whose domain registrar is a known dynamic DNS provider.",
              "Statistical: Create a profile for each user of the domains their Outlook client typically connects to. Use a Jaccard similarity score to compare the set of domains accessed in a given time window (e.g., one hour) to the user's historical profile. A low similarity score indicates a significant deviation in behavior and should be investigated.",
              "Machine Learning: Implement a one-class SVM (Support Vector Machine) model for each user, trained on features of their normal network connections from Outlook (e.g., destination IP, port, domain, country). Use the model to identify outlier connections that do not fit the established profile of benign activity."
            ]
          },
          {
            "description": "The creation of a child process by the Outlook.exe parent process, where the child process executable is not on an established allowlist of expected applications (e.g., Word, Excel, browsers).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Citrix/VDI servers",
            "action": [
              "Symbolic: From Windows Event ID 4688 logs, create an explicit allowlist of legitimate child processes for 'OUTLOOK.EXE' (e.g., 'WINWORD.EXE', 'EXCEL.EXE', 'POWERPNT.EXE', 'msedge.exe', 'chrome.exe', 'acrord32.exe'). Generate a high-priority alert for any child process spawned by Outlook that is not on this list.",
              "Statistical: Perform enterprise-wide process stacking on all child processes of 'OUTLOOK.EXE'. Calculate the frequency of each parent-child relationship. Any child process that is a statistical outlier, appearing in a low percentile of frequency (e.g., seen on fewer than 1% of endpoints), should be flagged for analysis.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on process creation events from Outlook. Feature vectors can include the child process name, command-line length, and file path. Normal behavior (opening documents, clicking links) will form dense clusters. The algorithm can identify outlier processes that do not belong to any known cluster, representing potentially malicious and anomalous activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]