[
  {
    "information_requirement": "Is the adversary attempting to discover enterprise password policies? (PIR)",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1201",
        "name": "Password Policy Discovery",
        "evidence": [
          {
            "description": "A process creation event is logged where the executable's file hash matches a known malicious tool associated with password policy discovery, such as a PowerSploit module or BloodHound ingestor.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations",
            "action": [
              "Symbolic: Continuously correlate file hashes from process creation events (Sysmon Event ID 1, Windows Event ID 4688 with hash enabled) against a threat intelligence feed of known malicious file hashes for discovery tools. Generate a high-severity alert upon any match.",
              "Statistical: For processes not matching known-good hashes, calculate the prevalence of each hash across the environment. Flag hashes that are rare (e.g., seen on <1% of endpoints) and are associated with command-line arguments related to discovery for further investigation.",
              "Machine Learning: Develop and apply a binary classification model (e.g., Random Forest, Gradient Boosting) trained on process metadata (file path, parent process, user context, hash prevalence) to predict whether an unknown executable is malicious. Use known discovery tools as positive examples and legitimate admin tools as negative examples in the training set."
            ]
          },
          {
            "description": "A command-line execution is observed containing specific strings and arguments used for discovering password policies, such as 'net accounts /domain', 'Get-ADDefaultDomainPasswordPolicy', 'chage -l', or 'pwpolicy getaccountpolicies'.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek syslog.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Linux/macOS Servers, End-user Workstations",
            "action": [
              "Symbolic: Create a detection rule in the SIEM to search process command-line logs (Windows Event ID 4688) and PowerShell script block logs (Event ID 4104) for the literal strings: 'net accounts /domain', 'Get-ADDefaultDomainPasswordPolicy', 'chage -l', 'cat /etc/pam.d/common-password', and 'pwpolicy getaccountpolicies'. Alert on any match originating from a non-administrative workstation or user.",
              "Statistical: For each user, establish a baseline frequency of password policy discovery command usage over a 30-day rolling window. Alert when a user's daily execution count exceeds the 99th percentile of their own historical baseline or the 95th percentile of their peer group's baseline (e.g., other developers, other system administrators).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on command-line arguments to identify anomalous or obfuscated variations of known discovery commands. Cluster commands based on tokenized arguments and flag clusters that are small and contain keywords like 'password', 'policy', or 'accounts'."
            ]
          },
          {
            "description": "A password policy discovery command is executed from a parent process not typically associated with administrative activity (e.g., 'winword.exe', 'outlook.exe') or by a user account outside of that account's established normal working hours.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Windows Security Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user Workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a rule to alert when a password policy discovery command (e.g., 'net.exe' with 'accounts' argument) is spawned by a parent process on a denylist, including 'winword.exe', 'excel.exe', 'outlook.exe', 'acrord32.exe', or any browser process.",
              "Statistical: For each user, model their typical command execution times using a time-of-day and day-of-week distribution. Calculate a Z-score for the timing of a password policy discovery command. Flag any execution with a Z-score > 3 (i.e., more than 3 standard deviations from the user's mean activity time) for that day of the week.",
              "Machine Learning: Train a one-class SVM or Isolation Forest model on legitimate executions of discovery commands, using features like (user, parent_process, host, time_of_day). Use the model to score new executions; scores indicating high deviation from the learned 'normal' profile should be flagged as anomalous."
            ]
          },
          {
            "description": "Execution of a password policy discovery command (T1201) occurs immediately before or after other Discovery (TA0007) or Credential Access (TA0006) techniques by the same user on the same host within a 60-minute window.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All hosts within the enterprise network, network egress points",
            "action": [
              "Symbolic: Implement a correlation rule that triggers when a T1201 command-line match is observed from a specific user/host pair within 60 minutes of another discovery command (e.g., 'net user', 'net group', 'whoami') or a credential access tool execution (e.g., process dump of 'lsass.exe').",
              "Statistical: Calculate the conditional probability of co-occurrence for different ATT&CK techniques within a user session. If the observed probability P(Credential Access | T1201) for a given session significantly exceeds the environmental baseline probability, escalate the risk score for that session.",
              "Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM), to learn common sequences of benign administrative commands. Flag command sequences that include a T1201 event and have a low probability under the learned 'benign' model, as this indicates a likely adversarial TTP chain."
            ]
          },
          {
            "description": "Anomalous network activity is observed, such as API calls to a cloud provider's password policy endpoint (e.g., AWS IAM 'GetAccountPasswordPolicy') or CLI commands to network devices (e.g., 'show aaa'), originating from an IP address or user account not associated with security administration.",
            "data_sources": [
              "Zeek http.log",
              "Zeek syslog.log",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network backbone switches/routers, Cloud IAM infrastructure, Internet gateway",
            "action": [
              "Symbolic: Monitor PowerShell script block logs (Event ID 4104) and Zeek HTTP logs for API calls containing strings like 'GetAccountPasswordPolicy' or 'Get-MgDomain'. Alert if the source user or IP is not on an allowlist of administrative accounts or systems.",
              "Statistical: Calculate the Shannon entropy of source IPs making password policy queries via network logs over a 1-hour window. A sudden drop in entropy may indicate a single host scanning multiple sources. A sudden spike could indicate a distributed effort. Alert on significant entropy changes from the established baseline.",
              "Machine Learning: Use time series analysis (e.g., ARIMA) to forecast the expected volume of cloud password policy API calls from the environment. Generate an alert when the observed volume exceeds the forecasted upper confidence interval, indicating an anomalous spike in activity that may correspond to reconnaissance."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]