[
  {
    "information_requirement": "Is the adversary establishing command and control using remote desktop software? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1219.002",
        "name": "Remote Desktop Software",
        "evidence": [
          {
            "description": "An outbound network connection (TCP/UDP) from an internal host to an external IP address or domain that is present on a threat intelligence feed for malicious C2 or a curated list of non-standard remote desktop services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, DNS servers",
            "action": [
              "Symbolic: Query Zeek dns.log for requests to domains and Zeek conn.log for connections to destination IPs found on threat intelligence feeds for known malicious C2 or lists of unsanctioned remote desktop software (e.g., AnyDesk, TeamViewer). Generate an alert for any match.",
              "Statistical: Calculate the Shannon entropy of requested subdomains for known remote desktop services (e.g., *.teamviewer.com). A high entropy score (e.g., > 3.5) for a subdomain, compared to the baseline entropy for legitimate subdomains, may indicate the use of domain generation algorithms (DGA) for C2. Alert on hosts querying high-entropy subdomains.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from Zeek conn.log such as connection duration, bytes sent/received, protocol, and destination port. Label historical data with known legitimate remote access and malicious C2 connections. Use the model to classify new, long-lived connections to unknown external IPs and flag those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A process execution event where the process name matches a known remote desktop application (e.g., anydesk.exe, tv_w32.exe) and the process image path is an atypical location (e.g., %TEMP%, %PUBLIC%), or the parent process is not a standard user-initiated process (e.g., explorer.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Critical servers (e.g., domain controllers, database servers)",
            "action": [
              "Symbolic: Using Windows Event ID 4688 logs, create a detection rule that alerts when a process name from a predefined list of remote desktop tools (e.g., anydesk.exe, rustdesk.exe, screenconnect.exe) is executed from a non-standard directory (e.g., C:\\Users\\*\\Downloads\\, C:\\Temp\\, C:\\ProgramData\\).",
              "Statistical: For each host, build a baseline of normal parent-child process relationships over a 30-day period. Calculate the frequency of each relationship. Alert when a rare parent-child relationship is observed, such as powershell.exe or wscript.exe spawning teamviewer.exe, if this relationship falls below a low frequency threshold (e.g., 1st percentile).",
              "Machine Learning: Develop a one-class SVM (Support Vector Machine) model trained on features from legitimate process executions (e.g., user context, parent process, file path, command line arguments). Use this model to identify anomalous remote desktop software executions that deviate significantly from the established 'normal' profile for the environment."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a known remote desktop application that includes specific command-line arguments associated with silent installation, password setting, or service startup (e.g., --silent, --set-password).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Managed servers",
            "action": [
              "Symbolic: Create a SIEM rule that uses regular expressions to search the command line field in Windows Event ID 4688 logs for known silent installation or configuration flags associated with remote desktop tools (e.g., /S, --silent, --install, --set-password, --get-id). Alert on any match.",
              "Statistical: For each remote desktop application, calculate the frequency of observed command-line arguments across the enterprise. Identify and alert on the use of statistically rare arguments or combinations of arguments, particularly those associated with unattended access, which fall outside the top 95% most common arguments.",
              "Machine Learning: Use a topic modeling technique like Latent Dirichlet Allocation (LDA) on the command-line arguments from all process executions. Identify topics corresponding to malicious activity (e.g., a topic with high probabilities for terms like '--set-password', '--silent', 'wget'). Classify new remote desktop process executions based on their command-line topic mixture and alert if they fall into a malicious topic."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host within a short time window (e.g., < 15 minutes): 1) Network logs show a file download of an executable from a domain associated with remote desktop software. 2) Host logs show a process creation event for that executable. 3) Network logs show a subsequent new outbound connection to the remote desktop service's known IP ranges.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Network egress points, Web proxies",
            "action": [
              "Symbolic: Create a correlation rule that triggers when, for a single host IP, a file download is logged in Zeek files.log (with mime_type 'application/x-dosexec') from a known remote desktop software domain, followed within 10 minutes by a process creation event (Windows Event ID 4688) with a matching filename, followed by a new connection in Zeek conn.log to that service's C2 infrastructure.",
              "Statistical: Maintain a historical set of all executable files downloaded and run on each host. For a given host, identify the first-time observation of a download-execute-connect sequence for a specific remote desktop tool. Calculate the rarity of this sequence across the entire organization. A sequence that is rare for both the host and the organization (e.g., seen on <1% of endpoints) is highly suspicious.",
              "Machine Learning: Use a sequence analysis model (e.g., a Hidden Markov Model or Recurrent Neural Network) trained on event logs (network, process, file). Define the 'malicious installation' state as the target sequence. Feed streams of host events into the model to calculate the real-time probability of a host being in this state and alert when the probability crosses a predefined threshold."
            ]
          },
          {
            "description": "A long-lived network connection to a known remote desktop service IP/port where the total outbound bytes (orig_bytes) significantly exceeds the established baseline for that user or host, or where the connection duration is an outlier.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors, Network TAPs at egress points",
            "action": [
              "Symbolic: Identify active connections to known remote desktop services in Zeek conn.log. During the session window, monitor for concurrent connections from the same source host to other IP addresses on a threat intelligence list (e.g., known drop zones for exfiltrated data). Alert on any such concurrent connection.",
              "Statistical: For each user, establish a baseline of normal outbound data volume (orig_bytes) and connection duration for remote desktop sessions using a 30-day rolling window. Calculate the 95th percentile for both metrics. Generate an alert when a new session exceeds this percentile threshold for either data volume or duration, indicating potential data exfiltration or unusual C2 activity.",
              "Machine Learning: Apply time-series anomaly detection (e.g., using an LSTM autoencoder) to the orig_bytes and resp_bytes data streams within an active remote desktop connection. Train the model on benign session traffic. The model learns the normal 'heartbeat' of a session; flag sessions where the reconstruction error spikes, indicating a pattern deviation that could represent file transfers or other non-interactive C2."
            ]
          },
          {
            "description": "A successful remote interactive logon (Windows Event ID 4624, Logon Type 10) for a user account that is anomalous based on time-of-day, source workstation, or source IP geolocation when compared to the user's established historical baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication servers, User workstations",
            "action": [
              "Symbolic: Maintain a list of user-to-host mappings for authorized remote access (e.g., administrators to specific servers). Create a rule to alert on any remote interactive logon (Windows Event ID 4624, Logon Type 10) that violates this explicit allow-list policy.",
              "Statistical: For each user, create a historical baseline of logon hours, source IP subnets, and source hostnames from Windows Event ID 4624. Use a scoring system for new logons: add points for logon hours outside of the user's established baseline, for a source IP from a new or rare country/ASN (enriched from Zeek conn.log), or for a source hostname not seen in the user's last 30 days. Alert when the cumulative score exceeds a statistically derived threshold.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on user logon events, using features like hour-of-day, day-of-week, and source IP geolocation. Identify clusters representing 'normal' activity for each user. Classify new logon events as noise/outliers if they do not fit into any existing cluster, indicating a significant deviation from established behavior patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]