[
  {
    "information_requirement": "Has the adversary collected sensitive data from information repositories? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1213",
        "name": "Data from Information Repositories",
        "evidence": [
          {
            "description": "A host accesses a sensitive information repository and, within a 15-minute window, establishes an outbound network connection to a destination IP or domain present on a threat intelligence feed of known malicious C2 servers or data drop zones.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint sites containing PII or financial data, network file shares with intellectual property, Confluence spaces with system architecture diagrams, corporate VPN servers, network egress points.",
            "action": [
              "Symbolic: Create a rule that triggers when a user's session (defined by user, host, and a 15-minute window) contains both a file access event (Windows Event ID 4663) on a designated sensitive repository and a network connection event (Zeek conn.log) where the destination IP is on a known-bad IOC list.",
              "Statistical: For each host, calculate the Shannon entropy of destination IP addresses for outbound connections over a 5-minute rolling window. Alert if the entropy drops significantly after a repository access event, as this may indicate tunneling to a single C2 destination.",
              "Machine Learning: Use a supervised learning model (e.g., a Gradient Boosting Classifier) trained on labeled historical data to classify sessions as benign or malicious. Features should include repository access time, time to first egress connection, destination IP reputation, destination ASN, and data volume transferred (orig_bytes from Zeek conn.log)."
            ]
          },
          {
            "description": "The execution of a database dump utility (e.g., sqlcmd, mysqldump, pg_dump) or a data transfer tool (e.g., rclone) on a database server or user endpoint, where the process is initiated by a non-standard user account (e.g., a service account, a non-DBA user) or from an anomalous parent process (e.g., w3wp.exe, tomcat.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Production database servers (SQL, Oracle, PostgreSQL), development database servers, endpoints of database administrators and developers.",
            "action": [
              "Symbolic: Alert on any process creation event (Windows Event ID 4688) for `sqlcmd.exe`, `bcp.exe`, `mysqldump.exe`, `pg_dump.exe`, or `rclone.exe` where the parent process is not `explorer.exe`, `cmd.exe`, `powershell.exe`, or a known database management tool, or where the command line includes redirection to a file in a world-writable directory like C:\\Temp.",
              "Statistical: Profile the command-line arguments used with database utilities per user. Calculate the Jaccard similarity or Levenshtein distance between a new command and the user's historical set of commands. Alert on commands with low similarity scores, indicating a novel or unusual usage pattern.",
              "Machine Learning: Train a classifier (e.g., Logistic Regression) to predict the likelihood of a command-line execution being malicious based on features like: command length, presence of special characters, presence of IP addresses, file output redirection, parent process name, and user account type. Flag executions with a high predicted probability of being malicious."
            ]
          },
          {
            "description": "A single user account accesses a number of distinct files or pages from an information repository that exceeds the 98th percentile of their individual 30-day baseline, or accesses repositories unrelated to their job function as defined by their Active Directory group membership.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek http.log",
              "Application-specific audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Online tenant, Confluence server, network file shares categorized by department (e.g., 'Finance', 'HR', 'Engineering').",
            "action": [
              "Symbolic: Create a rule that alerts when a user account belonging to the 'Sales' AD group accesses a file on a network share designated for the 'Engineering-SourceCode' department.",
              "Statistical: For each user, establish a 30-day rolling baseline of daily distinct file access counts. Use the Inter-Quartile Range (IQR) method to define an anomaly threshold (e.g., Q3 + 1.5 * IQR). Alert when a user's daily access count exceeds this threshold.",
              "Machine Learning: Employ a peer group analysis model. Cluster users based on their departmental role and access patterns using an algorithm like K-Means. For each user, compare their current repository access activity (e.g., vector of repositories accessed) to the centroid of their cluster. A large cosine distance from the cluster centroid indicates anomalous behavior relative to their peers."
            ]
          },
          {
            "description": "A user session on a server or endpoint involves reading over 1000 files from a designated sensitive network share within 30 minutes, immediately followed by the creation of a single compressed archive file (e.g., .zip, .7z, .rar) in a staging directory (e.g., C:\\Users\\Public, C:\\Temp).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network file shares containing sensitive intellectual property, customer PII, or financial records; user endpoints, especially those of privileged users or executives.",
            "action": [
              "Symbolic: Correlate file share access events (Windows Event ID 5145) with process creation events (Windows Event ID 4688). Alert if a session shows access to a high number of files on a sensitive share, followed by the execution of `7z.exe`, `rar.exe`, or `tar.exe` by the same user on the same host.",
              "Statistical: Monitor the ratio of file reads to file writes per user session on a given host. Establish a baseline for this ratio. A sudden, sharp increase in the read-to-write ratio, especially when the total read volume is high and the write volume is low but concentrated in a single file, is anomalous and should be flagged.",
              "Machine Learning: Develop a Hidden Markov Model (HMM) where the states represent stages of data staging: 'Normal Activity', 'Mass File Read', 'Compression', and 'Exfiltration Prep'. Use sequences of system events (file reads, file writes, process creations) as observations to infer the hidden state sequence. A transition into the 'Compression' state following 'Mass File Read' would trigger a high-confidence alert."
            ]
          },
          {
            "description": "An endpoint exhibits a data transfer volume to a single external IP address that is more than 3 standard deviations above its 30-day average daily egress volume, occurring within one hour of accessing a known sensitive information repository.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, proxy servers.",
            "action": [
              "Symbolic: After a host accesses a sensitive repository, monitor its outbound traffic. Alert if Zeek dns.log shows DNS requests for known dynamic DNS or cloud storage providers not on an allow-list, immediately followed by a large data transfer (orig_bytes > 100MB in Zeek conn.log) to the resolved IP.",
              "Statistical: For each host, calculate a 30-day rolling baseline of total daily outbound data volume (sum(orig_bytes) from Zeek conn.log). Alert if a host's daily egress volume exceeds its mean by more than 3 standard deviations, and enrich the alert with information about any repository access within the preceding hour.",
              "Machine Learning: Use a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) on the `orig_bytes` field in Zeek conn.log for each host, aggregated into 5-minute buckets. This can identify sudden, uncharacteristic spikes in outbound traffic that deviate from the host's normal daily and weekly traffic patterns (seasonality)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]