[
  {
    "information_requirement": "Is an adversary evading defenses by executing malicious scripts embedded in XSL files? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1220",
        "name": "XSL Script Processing",
        "evidence": [
          {
            "description": "The wmic.exe or msxsl.exe process initiates a network connection to a remote URL or IP address that is present on a threat intelligence feed of known malicious hosts [3, 6].",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points (e.g., Web Proxies, Firewalls), DNS Servers, and all Endpoints/Servers.",
            "action": [
              "Symbolic: Create a detection rule that joins process creation logs (Windows Event ID 4688) with network connection logs (Zeek conn.log). Alert when `wmic.exe` or `msxsl.exe` is the initiating process and the destination IP or domain (from Zeek dns.log or http.log `host` field) matches an entry in a high-fidelity threat intelligence feed categorized as malware C2 or malicious script hosting.",
              "Statistical: For each unique destination domain contacted by `wmic.exe` or `msxsl.exe`, calculate its prevalence across the entire enterprise over the last 30 days. Flag connections to domains that fall into the bottom 1st percentile of prevalence, as these are statistically rare and potentially adversarial.",
              "Machine Learning: Develop a supervised classification model (e.g., Logistic Regression) to predict if a `wmic.exe` or `msxsl.exe` network connection is malicious. Features can include destination IP reputation score, JA3/JA3S hash of the TLS connection (from Zeek ssl.log), entropy of the domain name, and whether the domain was registered within the last 90 days."
            ]
          },
          {
            "description": "The wmic.exe process is executed with the '/FORMAT' command-line switch, and the argument specifies an XSL file located at a remote URL or a non-standard local file path [5, 6].",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, particularly those of standard users and application servers.",
            "action": [
              "Symbolic: Search process execution logs (Windows Event ID 4688) for any command line containing `wmic.exe` and the string `/FORMAT:`. Specifically, trigger high-severity alerts for patterns like `/FORMAT:http` or `/FORMAT:https`, indicating remote file execution.",
              "Statistical: Establish a baseline of all file paths used with the `wmic.exe /FORMAT:` switch. Calculate the entropy of the file path string for each execution. Alert on executions where the path entropy is in the top 5th percentile, which can indicate randomized or obfuscated file paths in user-writable directories (e.g., C:\\Users\\...\\AppData\\Local\\Temp\\ajk29s.xsl).",
              "Machine Learning: Use an unsupervised anomaly detection algorithm, like Isolation Forest, on `wmic.exe` executions. Features should include: command-line length, number of special characters, presence of a URL, and the parent process name. The model will learn normal execution patterns and flag outliers that represent potentially malicious use of the `/FORMAT` switch."
            ]
          },
          {
            "description": "The msxsl.exe process is executed where the command-line arguments point to an XSL file hosted remotely or an XSL file with an unusual extension (e.g., .jpeg) [3, 5].",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers. The presence of msxsl.exe itself is an NAI, as it is not installed by default [2].",
            "action": [
              "Symbolic: Create a detection rule for process creation events (Windows Event ID 4688) where the process name is `msxsl.exe`. Alert on any execution where a command-line argument contains `http://` or `https://`. Also, alert if the file extensions of the arguments are not `.xml` or `.xsl`, such as `.jpeg` or `.txt`.",
              "Statistical: Since `msxsl.exe` is not a default binary [4], its presence is anomalous. Create a daily statistical report of all hosts where `msxsl.exe` is present. Any host that is not part of a pre-defined developer or build server group should be flagged. Calculate the frequency of parent processes for `msxsl.exe`; a parent like `outlook.exe` or `winword.exe` is highly suspicious and should be an alert.",
              "Machine Learning: Train a time-series model to forecast the number of `msxsl.exe` executions per day across the enterprise. A sudden, unexpected spike in executions that significantly exceeds the forecast's confidence interval would indicate a potential campaign and trigger a priority investigation."
            ]
          },
          {
            "description": "A process execution chain is observed where a non-developer application (e.g., Microsoft Office application, browser) or a script interpreter (e.g., cscript.exe) is the parent or grandparent process of `wmic.exe` or `msxsl.exe` used for XSL processing [7].",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, particularly those in non-technical departments like Finance or HR.",
            "action": [
              "Symbolic: Using process creation logs (Windows Event ID 4688) with parent process information, create a rule that alerts when the parent process of `wmic.exe` or `msxsl.exe` is `winword.exe`, `excel.exe`, `powerpnt.exe`, `outlook.exe`, `cscript.exe`, or `wscript.exe`, and the child process command line contains `/FORMAT:` or references an `.xsl` file.",
              "Statistical: Build a table of all parent-child process relationships observed over a 30-day baseline period. For every new execution of `wmic.exe` or `msxsl.exe`, check if its parent process exists in the baseline for that child. If the parent-child pair is new or has a frequency below a low threshold (e.g., 1st percentile), flag it as a rare and suspicious process chain.",
              "Machine Learning: Apply a graph-based anomaly detection algorithm on the process execution graph. Represent hosts and processes as nodes and parent-child relationships as edges. The algorithm can identify anomalous subgraphs, such as a rare chain originating from an Office application that leads to `wmic.exe` executing a remote script, which then spawns a shell."
            ]
          },
          {
            "description": "Within a short time window (e.g., 5 minutes) following a `wmic.exe` or `msxsl.exe` execution, the same host initiates network connections exhibiting C2 characteristics, such as regular beaconing, long connection durations, or high-entropy data transfers to a single destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points (e.g., Web Proxies, Firewalls), File Servers, and hosts that have recently executed `wmic.exe` or `msxsl.exe`.",
            "action": [
              "Symbolic: Correlate process execution logs (Windows Event ID 4688) with network logs (Zeek conn.log). If a `wmic.exe` or `msxsl.exe` execution (matching previous evidence) is observed on a host, trigger an alert if that same host initiates an outbound connection on a non-standard port (e.g., not 80/443) within the next 5 minutes.",
              "Statistical: For any host that executes `wmic.exe` or `msxsl.exe` suspiciously, analyze its subsequent network traffic in `Zeek conn.log`. Calculate the standard deviation of the time intervals between connections to a single destination IP. A very low standard deviation indicates periodic beaconing (C2). Also, calculate the total outbound data volume and flag if it exceeds the 99th percentile for that host's daily average.",
              "Machine Learning: Use a time-series analysis on the network flow data (`Zeek conn.log`) for a host following a suspicious XSL processing event. A model can detect anomalies in connection frequency, data volume, or connection duration that deviate from the host's established baseline, which can identify the start of C2 communications or data exfiltration activities initiated by the executed script."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]