[
  {
    "information_requirement": "Has the adversary escalated privileges by modifying domain or tenant policy? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1484",
        "name": "Domain or Tenant Policy Modification",
        "evidence": [
          {
            "description": "A Group Policy Object (GPO) modification is observed deploying a scheduled task, service, or script containing a known malicious hash, domain, or IP address, or pulling content from a non-standard URL.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5137",
              "Windows Event ID 5141",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Domain-joined Workstations and Servers",
            "action": [
              "Symbolic: Parse GPO modification events (Windows Event ID 5136, 5137, 5141) to extract file paths, domain names, IP addresses, and URLs from script content or task definitions. Correlate these extracted indicators against a threat intelligence feed of known malicious entities. Generate a high-severity alert for any match.",
              "Statistical: Calculate the Shannon entropy for any script content embedded within GPO modifications. Establish a baseline entropy score for legitimate administrative scripts used in the environment. Flag any script with an entropy score exceeding the 95th percentile of the baseline, as this suggests potential obfuscation or packing.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features extracted from GPO modifications, including the presence and content of scripts, OU linkage, modifying account, and time of day. The model will predict the probability of a modification being malicious. Flag modifications classified as malicious with a confidence score above a set threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A GPO modification event alters the 'gPCUserRightsAssignment' attribute to add a non-standard user or group to a privileged local group on domain systems (e.g., adding a helpdesk account to 'Backup Operators').",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5141"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Organizational Units (OUs) containing high-value systems",
            "action": [
              "Symbolic: Monitor GPO modification events (Windows Event ID 5136, 5141) for changes to the 'gPCUserRightsAssignment' attribute. Alert if a user or group not on a pre-defined list of administrators is granted a sensitive right from a watchlist (e.g., SeBackupPrivilege, SeDebugPrivilege, SeTakeOwnershipPrivilege, SeTcbPrivilege).",
              "Statistical: For each sensitive user right, baseline the number of accounts and groups assigned to it. Track the count of assigned principals over time using a moving average. An increase in assigned principals that is more than two standard deviations above the moving average indicates an anomalous, widespread privilege assignment.",
              "Machine Learning: Use a graph-based anomaly detection model representing the Active Directory structure (users, groups, GPOs as nodes; memberships/links as edges). A newly created edge representing a non-standard user being granted high privileges via a GPO link would be identified by the model as a low-probability structural anomaly."
            ]
          },
          {
            "description": "Modification, creation, or linking of a critical GPO (e.g., Default Domain Policy) or a GPO linked to a high-value OU by an account not on an approved list of administrators or outside of standard change windows.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5137",
              "Windows Event ID 5139",
              "Windows Event ID 5141"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstations",
            "action": [
              "Symbolic: Maintain an explicit allow-list of user accounts authorized to modify a watchlist of critical GPOs (e.g., Default Domain Policy, Default Domain Controllers Policy). Trigger an alert for any modification, creation, or link event (Windows Event ID 5136, 5137, 5139, 5141) on a watched GPO where the subject user is not on the allow-list.",
              "Statistical: For each authorized administrator, baseline their GPO modification activity by hour of day and day of week. Use a percentile-based approach to flag modifications occurring at unusual times (e.g., outside the 5th-95th percentile of their historical activity timestamps), indicating a potential account compromise or insider threat.",
              "Machine Learning: Apply a one-class SVM (Support Vector Machine) model trained on legitimate GPO modification events. Use features including the modifying account, target GPO distinguished name, OU link path, and time of day. Any new modification that the model classifies as an outlier is flagged as a suspicious deviation from normal administrative behavior."
            ]
          },
          {
            "description": "An event is logged indicating a change in domain authentication settings from 'Managed' to 'Federated', the modification of federation trust settings, or the addition of a new federated identity provider trust.",
            "data_sources": [
              "Windows Event ID 307",
              "Windows Event ID 510"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Federation Services (ADFS) Servers, Identity Provider (IdP) infrastructure",
            "action": [
              "Symbolic: Create a high-severity rule to alert on any event indicating the 'Set federation settings on domain' or 'Set domain authentication' ActionTypes (e.g., in Azure AD logs) or the creation of a new Claims Provider Trust (Windows Event ID 510). As these are exceptionally rare, high-impact administrative actions, any occurrence warrants immediate investigation.",
              "Statistical: Establish a baseline of zero for the count of domain authentication method changes per month. Any non-zero value is a critical anomaly. Separately, track the number of trusted identity providers; any increase from the established baseline count is also a critical alert.",
              "Machine Learning: Use a state-change anomaly detection model. Model the domain's authentication state ('Managed' vs. 'Federated') and the set of trusted providers as a finite state machine. Any state transition that does not match a pre-approved change request in a change management system is flagged as a high-confidence anomaly, suggesting unauthorized modification."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by modifying domain or tenant policy? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1484",
        "name": "Domain or Tenant Policy Modification",
        "evidence": [
          {
            "description": "A GPO modification adds a file path, process name, or signature to the exclusion list of an endpoint security tool (e.g., Windows Defender) that matches a known malicious indicator.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5141"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Domain-joined Workstations and Servers",
            "action": [
              "Symbolic: Continuously parse GPO modification events (Windows Event ID 5136, 5141) that alter registry keys associated with security tool exclusions (e.g., `SOFTWARE\\Policies\\Microsoft\\Windows Defender\\Exclusions`). Match the added exclusion values against a threat intelligence feed of known malicious file paths or process names. Alert on any match.",
              "Statistical: Establish a baseline for the frequency of GPO-based exclusion modifications, which should be near zero in a well-managed environment. An event count exceeding a statistical threshold (e.g., > 3 standard deviations above the mean, or any non-zero count) in a given time window (e.g., 24 hours) indicates anomalous activity.",
              "Machine Learning: Train a text classification model to distinguish between benign (e.g., `C:\\Program Files\\App`) and suspicious (e.g., `C:\\Users\\Public\\`) exclusion paths. Features can include path depth, use of environment variables, and character distribution. A path classified as 'suspicious' with high confidence triggers an alert for review."
            ]
          },
          {
            "description": "A GPO modification deploys a startup, logon, or immediate scheduled task script containing commands known to disable or tamper with security features like AMSI, ETW, or security logging.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5141",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstations, Domain-joined Workstations and Servers",
            "action": [
              "Symbolic: Scan the script content within GPO modification events (Windows Event ID 5136, 5141) using YARA rules designed to detect known defense evasion techniques. Include patterns for disabling AMSI, manipulating ETW providers, or modifying registry keys related to PowerShell Script Block Logging. Alert on any rule match.",
              "Statistical: Calculate the Jaccard similarity between the tokenized content of new GPO scripts and a baseline set of known-good administrative scripts. Scripts with a similarity score below a certain percentile (e.g., 10th percentile) are flagged as dissimilar and potentially malicious.",
              "Machine Learning: Use a Natural Language Processing (NLP) based classifier trained on a labeled dataset of benign and malicious PowerShell scripts. The model analyzes the sequence of cmdlets, arguments, and obfuscation patterns to predict the script's intent. A script classified as 'defense evasion' with high probability generates an alert."
            ]
          },
          {
            "description": "A GPO modification disables or degrades security audit policies, such as reducing log file size, clearing SACLs, or turning off critical audit subcategories like 'Process Creation' or 'Security Group Management'.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5141"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Organizational Units (OUs) with sensitive systems",
            "action": [
              "Symbolic: Define a 'Golden Configuration' for audit policy settings within key GPOs. Monitor GPO modification events (Windows Event ID 5136, 5141) and alert on any deviation from this baseline, such as a change that disables 'Audit Process Creation' or sets 'Audit Logon' to 'No Auditing'.",
              "Statistical: Monitor the volume of critical security events (e.g., Windows Event ID 4688, 4732) from endpoint populations by OU. Correlate a GPO audit policy change event with a subsequent, statistically significant drop (e.g., > 3 standard deviations below the moving average) in the expected event log volume from the targeted OU.",
              "Machine Learning: Implement a multivariate time-series anomaly detection model for event log volumes, segmented by event ID and host group (OU). The model learns the normal daily and weekly seasonality of logging. An unexplainable drop in log volume following a GPO modification event (5136) would be flagged as a correlated anomaly, suggesting successful log tampering."
            ]
          },
          {
            "description": "A GPO is modified and then reverted to its previous state within a time window of less than 30 minutes, indicating a temporary change intended to execute a malicious action while minimizing forensic evidence.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5141"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: For each GPO modification event (Windows Event ID 5136, 5141), cache the GPO's GUID and version number. If a subsequent modification event for the same GPO occurs within a 30-minute window and the version number reverts to a previously seen value, trigger a high-severity 'Flash GPO Modification' alert.",
              "Statistical: Analyze the time delta between consecutive modification events for the same GPO across the environment. Establish a baseline distribution of these deltas for normal administrative activity. Flag any modification-reversion sequence where the time delta falls below the 5th percentile of the normal distribution, indicating an unusually rapid change.",
              "Machine Learning: Use a sequence analysis model (e.g., an LSTM autoencoder) to learn normal sequences of administrative actions related to GPOs. A sequence such as 'modify policy -> wait 5 minutes -> modify policy back' would be flagged as an anomalous sequence when compared to normal patterns like 'modify policy -> wait 24 hours -> link policy'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]