[
  {
    "information_requirement": "Has the adversary encrypted data to impact system availability?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1486",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A process creates files with extensions or names matching known ransomware indicators, or a process executes with a hash matching a known ransomware binary.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, File servers, Domain Controllers, Web servers",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688) and file creation logs (Windows Event ID 4663, Zeek files.log) for matches against a threat intelligence feed of known ransomware process names, file hashes, ransom note filenames (e.g., DECRYPT_INSTRUCTIONS.txt, README.txt), and file extensions (e.g., .lockbit, .conti, .crypt). Create a high-severity alert for any match.",
              "Statistical: For file creation events (Windows Event ID 4663), calculate the entropy of filenames created by a single process within a 1-minute window. A sudden spike in filename entropy, especially for files with new or rare extensions, may indicate the randomized naming convention used by some ransomware. Alert when the entropy score for a process exceeds the 99th percentile of its historical baseline.",
              "Machine Learning: Train a classification model (e.g., a Random Forest or Gradient Boosting Classifier) on features extracted from process creation events (Windows Event ID 4688). Features should include process name characteristics (length, entropy), command-line arguments, parent process, and file hash reputation. The model should classify each process execution as benign or malicious (ransomware). Deploy the model to score new processes in real-time."
            ]
          },
          {
            "description": "A process executes commands to disable system recovery (e.g., deleting Volume Shadow Copies) and is immediately followed by an anomalously high rate of file modification events from the same process or host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., database, application), Domain Controllers, Administrator workstations",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Windows Event ID 4688) for `vssadmin.exe delete shadows`, `wbadmin.exe delete catalog`, or `bcdedit.exe /set {default} recoveryenabled No` is observed from a host, and is followed within 10 minutes by more than 100 file write events (Windows Event ID 4663) from the same host.",
              "Statistical: For each host, create a baseline of hourly file write operations (count of Windows Event ID 4663). Monitor for the execution of recovery-disabling commands. If such a command is detected, monitor the host's file write count for the next hour. Alert if the file write count exceeds 4 standard deviations above the host's established hourly baseline.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model or Recurrent Neural Network) to learn common sequences of process executions from Windows Event ID 4688 logs. A sequence containing `vssadmin.exe` or `bcdedit.exe` followed by processes associated with high file I/O would be flagged as a low-probability, high-risk sequence indicative of ransomware preparation and execution."
            ]
          },
          {
            "description": "A single, non-system process generates an anomalously high count of file write, rename, or delete operations within a short time frame, targeting multiple file extensions associated with user data.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User home directories, Shared network drives, Document management system repositories",
            "action": [
              "Symbolic: Create a rule that triggers if a single process (identified by Process ID in Windows Event ID 4663) performs more than 500 file write or rename operations in a 1-minute window on files with extensions like .docx, .xlsx, .pdf, .jpg, .zip. Exclude known-good processes like backup agents or system indexers.",
              "Statistical: For each host, aggregate file modification events (Windows Event ID 4663) by process name and calculate the number of unique file extensions modified per minute. Establish a baseline for each process. Alert if a process modifies a number of unique file extensions that is more than 3 standard deviations above its normal behavior, indicating indiscriminate file targeting.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA or LSTM) for each host, based on the volume of file modification events (Windows Event ID 4663) per minute. The model will learn the normal rhythm of file I/O. An alert is generated when the observed file modification rate sharply deviates from the forecasted range, which is characteristic of a ransomware encryption routine."
            ]
          },
          {
            "description": "A single source host initiates an anomalously high number of file write or rename operations across multiple distinct network shares or servers in a short period.",
            "data_sources": [
              "Windows Event ID 5145",
              "Zeek smb_files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, Network Attached Storage (NAS) devices, SMB/CIFS shares",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a single source IP (`id.orig_h` in Zeek logs) is observed performing `SMB::FILE_WRITE` or `SMB::FILE_RENAME` actions (`action` in `smb_files.log`) on more than 10 distinct destination IPs within a 5-minute window.",
              "Statistical: For each source host, create a baseline of the number of distinct network shares it accesses per hour (using `Share Name` from Windows Event ID 5145 or destination IP from Zeek `smb_files.log`). Alert when a host accesses a number of shares exceeding the 98th percentile of its own historical behavior or the global 99th percentile across all hosts.",
              "Machine Learning: Use unsupervised learning (e.g., a DBSCAN clustering algorithm) on network file access data (Zeek smb_files.log). Features should include source IP, destination IP, count of writes, and count of renames. The algorithm will cluster normal network file access patterns. Hosts that do not fit into any cluster (noise points) or form their own small, dense cluster of high-write activity across many destinations should be flagged as potential ransomware spreaders."
            ]
          },
          {
            "description": "A file write, rename, or delete operation is detected on a designated canary file, which has no legitimate business use and is deployed for the sole purpose of detecting unauthorized modification.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Designated canary file directories on high-value file shares, Hidden directories in user profiles, Root directories of mapped network drives",
            "action": [
              "Symbolic: Deploy canary files (e.g., passwords.xlsx) with specific SACLs to generate Windows Event ID 4663 on any modification. Create a critical, zero-tolerance alert that triggers immediately upon the generation of Event ID 4663 for any of these specific file paths. The alert should include the source host, user, and process name.",
              "Statistical: While the primary detection is symbolic, maintain statistics on access attempts to canary file directories. A sudden increase in read attempts (Object Access: ReadData) to the directory containing canary files, even without modification, could be an early statistical indicator of a reconnaissance phase before encryption. Alert if the read count for these directories from a single process exceeds a threshold of 10 in one minute.",
              "Machine Learning: The alerting data from canary file modifications can be used as a highly reliable feature (e.g., a binary flag `triggered_canary_file`) to improve the accuracy of other ML models designed to detect ransomware. When a canary file alert fires, this event can be used to automatically raise the risk score of the associated host, user, and process in a broader behavioral analytics system."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]