[
  {
    "information_requirement": "Is the adversary impacting system or service availability by hijacking resources? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1496",
        "name": "Resource Hijacking",
        "evidence": [
          {
            "description": "An internal host establishes a network connection where the destination IP address, DNS query, or TLS Server Name Indication (SNI) matches a known indicator of compromise (IOC) associated with cryptocurrency mining pools or resource hijacking command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS servers, Core network switches",
            "action": [
              "Symbolic: Correlate destination IP addresses (Zeek conn.log), DNS queries (Zeek dns.log), and TLS SNI values (Zeek ssl.log) against a high-confidence threat intelligence feed of known cryptomining pools and C2 nodes. Alert on any matches.",
              "Statistical: Calculate the rate of IOC matches per host over a rolling 24-hour window. Use a percentile threshold (e.g., 99th percentile) to identify hosts with an anomalously high rate of connections to suspicious destinations, which may indicate scanning or persistent communication.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) using features from Zeek logs (destination port, protocol, connection duration, bytes transferred) and threat intelligence labels (malicious/benign). Use the model to score new connections in real-time to predict the probability of a connection being related to resource hijacking."
            ]
          },
          {
            "description": "A process is created with a process name, file path, or command-line arguments matching signatures of known resource hijacking or cryptomining software.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., web servers, database servers), user workstations, virtual desktop infrastructure (VDI) fleet",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 process creation events. Match the 'NewProcessName' and 'CommandLine' fields against a curated list of regular expressions for known cryptomining software (e.g., xmrig, t-rex) and their arguments (e.g., --wallet, --pool, stratum+tcp).",
              "Statistical: For each process execution event, calculate the prevalence of the 'NewProcessName' and its parent process across the enterprise using an inverse frequency model. Flag processes with a high rarity score for investigation, as they may represent custom-named miners.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features from process creation events (e.g., command-line length, argument count, entropy of process name). Identify and investigate small clusters or outliers that do not group with common, legitimate process execution patterns."
            ]
          },
          {
            "description": "A process with a name common to legitimate system utilities (e.g., svchost.exe, lsass.exe) is executed from an atypical file path (e.g., %TEMP%, %APPDATA%), or a process runs for a duration that is statistically abnormal compared to its historical behavior.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers, Application servers, User workstations",
            "action": [
              "Symbolic: Create and maintain an allowlist of legitimate file paths for common system processes (e.g., svchost.exe in C:\\Windows\\System32). Monitor Windows Event ID 4688 and alert whenever a process from this list executes from a path not on the allowlist.",
              "Statistical: Correlate process creation (Event ID 4688) and termination (Event ID 4689) to calculate runtimes. Establish a baseline of runtimes for each unique process name. Use a z-score or 95th percentile threshold to identify processes with statistically significant outlier durations.",
              "Machine Learning: Apply time series forecasting (e.g., ARIMA) to the frequency of creation events for specific processes (e.g., powershell.exe, cscript.exe) on a per-host basis. An unexplained spike in process creations that deviates significantly from the forecast can indicate a dropper script deploying a miner."
            ]
          },
          {
            "description": "An internal host maintains a network connection to a single external IP address for a duration that is statistically anomalous for the host or its peer group, particularly when using non-standard ports or occurring outside of business hours.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), Core network switches",
            "action": [
              "Symbolic: Filter Zeek conn.log for TCP connections with a 'duration' field exceeding a static threshold (e.g., > 12 hours) and a destination port ('id.resp_p') matching common mining ports (e.g., 3333, 4444, 5555, 14444). Alert on any matches.",
              "Statistical: For each host, establish a 30-day baseline distribution of connection durations. Identify new connections where the duration exceeds the 99th percentile of the historical baseline for that host or its functional peer group. Also, calculate the entropy of destination ports per host; a sharp decrease in entropy coupled with long-duration connections indicates suspicious single-purpose communication.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means) on connection data from Zeek conn.log, using features like duration, total bytes, destination port, and protocol. Profile clusters as 'normal' (e.g., web browsing) and investigate hosts contributing to small, anomalous clusters characterized by long durations and high, symmetric data transfer."
            ]
          },
          {
            "description": "Network traffic exhibits characteristics of mining protocols, such as JSON-RPC method calls ('login', 'submit') within HTTP/S traffic, or connection patterns typical of the Stratum protocol on non-standard ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Web proxies, Core network switches",
            "action": [
              "Symbolic: Search Zeek http.log for POST requests where the URI or request body contains keywords associated with mining protocols, such as 'jsonrpc', 'getjob', 'submit', 'stratum', 'monero', or 'ethproxy'.",
              "Statistical: Analyze the packet inter-arrival times for long-duration connections in Zeek conn.log. Calculate the variance of these times; a near-zero variance indicates a highly periodic 'heartbeat' common in mining protocols but rare in user-driven traffic.",
              "Machine Learning: For each internal host, create a time series of total outbound data volume per hour. Use a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) to identify hosts with a sustained, anomalous increase in outbound traffic that does not correlate with business hours or known backup schedules, potentially indicating a high volume of submitted 'shares'."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]