[
  {
    "information_requirement": "Is the adversary attempting to disrupt network availability? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1498",
        "name": "Network Denial of Service",
        "evidence": [
          {
            "description": "Inbound network traffic originates from a source IP address present on a threat intelligence feed specializing in DoS/DDoS botnets, C2 servers, or stresser/booter services.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Firewall, Edge Routers",
            "action": [
              "Symbolic Logic: Continuously ingest and update threat intelligence feeds specializing in known DoS/DDoS infrastructure. Create a watch list of these malicious IPs. Join inbound traffic source IPs from Zeek conn.log against this watch list. Generate a high-severity alert for any match, as this traffic is a strong indicator of malicious intent.",
              "Statistical: For each matched IP from the threat intelligence feed, calculate the frequency and volume of traffic over time. Use descriptive statistics to identify the top 10 most active malicious IPs targeting the network within the last hour. This helps prioritize response and understand the scale of the reconnaissance or attack.",
              "Machine Learning: Use a classification model (e.g., Logistic Regression, Random Forest) trained on features from Zeek conn.log (duration, protocol, service, byte counts) and the threat intel match (is_known_dos_source). The model can learn to predict the likelihood that a flow is part of a coordinated DoS attack, even at low volumes, providing a risk score instead of a binary alert."
            ]
          },
          {
            "description": "Anomalous HTTP/S session characteristics are observed, such as incomplete requests, extremely slow data transfer rates, or the presence of user-agents associated with known application-layer DoS tools (e.g., Slowloris, R.U.D.Y., LOIC).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Load Balancers, API Gateways",
            "action": [
              "Symbolic Logic: Scan Zeek http.log for specific User-Agent strings or other HTTP headers known to be used by DoS tools (e.g., 'LOIC', 'HOIC', 'Hulk'). Create a rule to alert on any exact match. Additionally, identify TCP connections in Zeek conn.log that remain in a 'half-open' state for an abnormally long duration, which could indicate a SYN flood.",
              "Statistical: For each HTTP session in Zeek http.log, calculate the data transfer rate (bytes/duration). Establish a baseline for normal transfer rates. Alert on sessions falling below a low percentile threshold (e.g., 1st percentile) while having a long duration, indicative of a slow-rate attack. Also, for POST requests, calculate the ratio of 'Content-Length' to the actual bytes sent; a very high ratio suggests a R.U.D.Y.-style attack.",
              "Machine Learning: Train a K-Means clustering model on features from Zeek http.log and conn.log, such as request_body_len, response_body_len, connection duration, and number of requests per connection. Normal traffic should form distinct clusters. Identify and alert on new clusters that appear during a suspected attack, or on traffic points that are statistical outliers (far from any normal cluster centroid), as these often represent the anomalous behavior of application-layer DoS."
            ]
          },
          {
            "description": "A high ratio of outbound to inbound traffic volume is observed for connectionless protocols (e.g., UDP) on services known to be abusable for amplification, such as DNS, NTP, or Memcached.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ntp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public DNS Servers, NTP Servers, Other UDP-based application servers",
            "action": [
              "Symbolic Logic: Create a rule that triggers if an internal server sends a UDP response to an external IP on a common amplification port (e.g., 53, 123, 11211) where no corresponding internal request to that IP was logged within a short time window. This is a simple check for unsolicited, potentially amplified responses.",
              "Statistical: For each session in Zeek conn.log on UDP ports like 53 or 123, calculate the amplification factor (resp_bytes / orig_bytes). Establish a baseline for the 95th and 99th percentile of this factor for each service. Generate an alert when the amplification factor for a session exceeds this statistical threshold, especially if the source IP is external.",
              "Machine Learning: Use an Isolation Forest algorithm on session data (protocol, port, amplification factor, packet count). This unsupervised learning method is effective at anomaly detection and can identify sessions that are highly irregular compared to the baseline of normal traffic, which is characteristic of reflection/amplification attacks."
            ]
          },
          {
            "description": "Anomalous surge in traffic volume (packets/sec or bytes/sec) or connection rate targeting a specific service, host, or network segment, significantly deviating from established baselines.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dstats.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Choke Points (e.g., firewalls, core switches), Critical Application Servers, Entire Subnets",
            "action": [
              "Symbolic Logic: Define static, high-watermark thresholds for key metrics (e.g., 10,000 connections/sec, 1 Gbps inbound traffic) on critical interfaces or servers. While brittle, these 'circuit breaker' rules can provide a last-resort, unambiguous alert when a massive attack is underway.",
              "Statistical: Using Zeek dstats.log or aggregated conn.log data, create rolling time-window baselines (e.g., 5-minute intervals) for traffic volume (bytes, packets) and new connection rates for critical services. Model seasonality (e.g., hour-of-day, day-of-week). Generate an alert when current traffic exceeds a dynamic threshold, such as 3 standard deviations above the mean for that time window or the 99th percentile.",
              "Machine Learning: Implement a time-series forecasting model (e.g., ARIMA, Prophet) to predict expected traffic volume for the next N minutes. Continuously compare the actual observed traffic volume against the predicted volume and its confidence interval. An alert is generated when the actual traffic significantly and persistently exceeds the upper bound of the forecast, indicating an anomalous surge that the model did not expect based on historical patterns."
            ]
          },
          {
            "description": "Statistically significant deviation in traffic composition or topology, such as a sudden shift in protocol distribution, abnormal TCP flag combinations, or a sharp change in source IP entropy indicating a distributed, coordinated attack.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Firewall, Load Balancers, Any network segment receiving external traffic",
            "action": [
              "Symbolic Logic: Create a rule to alert on unusual or illegitimate TCP flag combinations seen in Zeek conn.log history field, such as 'ShAD' (SYN, FIN, ACK, PSH) or a packet with no flags set. While not always malicious, these are highly irregular and warrant investigation during a suspected incident.",
              "Statistical: In rolling 1-minute windows, calculate the Shannon entropy of the source IP addresses targeting a specific service. Establish a baseline of normal entropy values. A sudden and significant drop in entropy suggests a low-and-slow attack or an attack from a small number of sources. Conversely, a massive increase in the count of distinct source IPs indicates a highly distributed source attack. Alert when entropy or distinct IP count moves beyond 3 standard deviations from the norm.",
              "Machine Learning: Use Principal Component Analysis (PCA) on a feature set derived from aggregated Zeek conn.log data (e.g., protocol distribution [%TCP, %UDP, %ICMP], TCP flag distribution, average packet size, source IP entropy). In normal conditions, the data points should cluster tightly when projected onto the first two principal components. During a DoS attack that changes traffic composition, the projected data points will shift dramatically into a new area of the component space, allowing for visual or automated detection of the regime change."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]