[
  {
    "information_requirement": "Has an adversary impacted system or device availability by corrupting firmware?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1495",
        "name": "Firmware Corruption",
        "evidence": [
          {
            "description": "A file matching the hash or name of a known malicious firmware modification tool is observed being transferred over the network or executed on a host.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Endpoints, Domain Controllers, Core Network Switches, Internet Gateway",
            "action": [
              "Symbolic: Continuously monitor Zeek files.log for file transfers and Windows Event ID 4688 for process executions. Alert if the file hash (MD5, SHA1, SHA256) or process name matches a threat intelligence feed of known firmware modification tools (e.g., Lojax, TrickBoot components, MosaicRegressor).",
              "Statistical: Profile the entropy of filenames for executables transferred over the network. Alert on files with unusually high entropy names, which may indicate packed or randomly generated malware names, that are also destined for sensitive systems.",
              "Machine Learning: Train a classification model (e.g., Random Forest, Gradient Boosting) using features from file transfers (file size, MIME type, source/destination subnet reputation) and process execution (parent process, user context) to predict the likelihood that a file is a malicious utility, even if its hash is not yet known."
            ]
          },
          {
            "description": "A legitimate firmware update utility is executed with anomalous parameters, from an unauthorized directory, or outside of a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Endpoints, Mission Critical Servers (e.g., Database, Application), Virtualization Hosts",
            "action": [
              "Symbolic: Create a SIEM rule to alert on the execution of known firmware update utilities (e.g., vendor-specific flashers, `flashrom.exe`) when the process path is an unauthorized location (e.g., `C:\\Users\\*`, `C:\\Windows\\Temp\\*`) or the process is not signed by the expected hardware vendor.",
              "Statistical: For each firmware utility, establish a baseline of normal command-line argument structure and length. Calculate the Jaccard distance or Levenshtein distance between observed arguments and the established baseline. Flag executions where the arguments deviate by more than two standard deviations from the norm.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on process execution events, using features like process name, command-line arguments, parent process, and user context. An execution of a firmware utility that falls into a small, sparse cluster, or is classified as a noise point, indicates a highly anomalous and suspicious event."
            ]
          },
          {
            "description": "A sequential chain of events is observed on a host: hardware reconnaissance, tool acquisition, and privileged execution, immediately preceding system shutdown or boot failure events.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Windows Event ID 1074",
              "Windows Event ID 6006"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Endpoints, Virtualization Hosts, Core Network Infrastructure",
            "action": [
              "Symbolic: Implement a correlation rule that triggers when the following sequence is observed on a single host within a 60-minute window: 1) Execution of hardware discovery commands (`wmic baseboard get`, `dmidecode`). 2) Network connection to an uncategorized external IP to download an executable. 3) Privileged execution of a new or unsigned executable. 4) An unexpected shutdown event (Event ID 1074 or 6006).",
              "Statistical: Analyze the distribution of time deltas between the steps in the defined attack chain across the environment. Prioritize alerts for sequences where the time between steps is an outlier (e.g., in the 99th percentile for speed), suggesting automated execution rather than manual administration.",
              "Machine Learning: Train a sequence-aware model, such as a Hidden Markov Model (HMM) or Recurrent Neural Network (RNN), on normal host event sequences. An alert from the model indicating a low-probability sequence that contains the key events (recon, download, execute, crash) provides high-confidence evidence of an attack chain."
            ]
          },
          {
            "description": "Anomalous network traffic to a network device's management interface, characterized by unusual protocols or data volume, is observed prior to device failure.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Management Interfaces (Switches, Routers, Firewalls), Out-of-Band Management Network",
            "action": [
              "Symbolic: Create an allow-list rule for traffic to network device management interfaces. Alert on any connection attempts using protocols other than approved ones (e.g., SSH, HTTPS) or originating from IP ranges outside of designated administrative subnets.",
              "Statistical: For each network device, create a baseline of inbound data volume (`resp_bytes` in Zeek conn.log) to its management port over 30 days. Alert if the data volume in a single session or 1-hour window exceeds the 98th percentile, which could indicate the transfer of a large firmware image.",
              "Machine Learning: Apply time-series anomaly detection (e.g., ARIMA, Prophet) to the volume of traffic to management interfaces. An observed traffic spike that falls outside the model's predicted confidence interval, especially when correlated with device health alerts, should be flagged as a potential firmware corruption attempt."
            ]
          },
          {
            "description": "A statistically significant increase in the number of systems experiencing unexpected reboot or shutdown events occurs within a short time frame and is not correlated with any authorized change activity.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6005",
              "Windows Event ID 6006"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Enterprise Endpoints and Servers, Change Management Database/System",
            "action": [
              "Symbolic: Create a rule that alerts when the distinct count of hosts reporting an unexpected shutdown (Event ID 1074) or unclean shutdown (Event ID 6006) exceeds a threshold (e.g., 25 hosts) within a 30-minute window. Cross-reference the event timestamp with change management records; if no authorized reboot is found, escalate the alert.",
              "Statistical: Aggregate unexpected shutdown events into 15-minute time buckets. Calculate a moving average and standard deviation for this count. An alert is generated when the count in any bucket exceeds the mean plus three standard deviations, indicating a statistically significant cluster of failures.",
              "Machine Learning: Use spatial-temporal clustering (e.g., ST-DBSCAN) on shutdown events, using event time and host subnet as dimensions. This can identify if the failures are propagating through a specific network segment or occurring in a coordinated fashion, which is a strong indicator of a targeted attack versus random, unrelated hardware failures."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]