[
  {
    "information_requirement": "Is the adversary maintaining persistence on web servers using malicious IIS components? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.004",
        "name": "IIS Components",
        "evidence": [
          {
            "description": "The IIS worker process (w3wp.exe) initiates an outbound network connection to an IP address or domain present on a threat intelligence list.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IIS Web Servers, DMZ Network Segment, Network Egress Points",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) with process-specific network events (Windows Event ID 5156) to identify connections made by the 'w3wp.exe' process. Cross-reference the destination IP addresses and associated DNS queries (Zeek dns.log) against a high-confidence threat intelligence feed of known malicious C2 servers. Alert on any match.",
              "Statistical: For each IIS server, calculate the entropy of requested domain names over a 1-hour window. A sudden, sharp increase in entropy can indicate DGA activity. Also, calculate the 95th percentile for daily outbound data volume per destination port. Alert if a new connection's data volume exceeds this threshold for a non-standard port.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA) on the number of outbound connections per hour from 'w3wp.exe'. Alert when the observed connection count significantly exceeds the model's predicted upper confidence interval, indicating an anomalous spike in activity."
            ]
          },
          {
            "description": "The execution of AppCmd.exe or PowerShell IIS cmdlets with arguments indicating the installation or modification of an IIS module, handler, or ISAPI filter.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IIS Web Servers, Administrator Workstations, Jump Servers",
            "action": [
              "Symbolic: Create a detection rule that searches process creation logs (Windows Event ID 4688) for `AppCmd.exe` executions containing keywords such as 'install module', 'add module', 'set config', or 'unlock section'. Similarly, search PowerShell script block logs (Event ID 4104) for cmdlets like 'New-IISModule', 'Set-WebConfigurationProperty', or 'Add-WebConfiguration' targeting module configurations.",
              "Statistical: For each host, establish a baseline frequency of `AppCmd.exe` and IIS-related PowerShell cmdlet executions. Calculate the mean and standard deviation of these commands per user account. Flag any user whose execution count for these commands in a 24-hour period exceeds 3 standard deviations from their own or the peer group's baseline.",
              "Machine Learning: Use a classification model to score the maliciousness of command-line arguments. Train the model on known-good administrative scripts and public examples of malicious commands. A high maliciousness score for an IIS-related command execution should generate an alert."
            ]
          },
          {
            "description": "A new DLL file is created in a sensitive IIS directory, or the primary IIS configuration file (applicationhost.config) is modified by an unauthorized process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 11 (Sysmon)",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of IIS Web Servers, specifically the directories '%windir%\\System32\\inetsrv\\', '%windir%\\assembly\\', and application-specific 'bin' folders.",
            "action": [
              "Symbolic: Monitor for file creation events (Sysmon Event ID 11) where a new DLL is written to `%windir%\\System32\\inetsrv\\` or a web application's `bin` directory by a process other than trusted installers (e.g., `msiexec.exe`). Also, alert on write access (Event ID 4663) to `%windir%\\System32\\inetsrv\\config\\applicationhost.config` by any process not on an explicit allow list.",
              "Statistical: Profile the set of processes that normally write files to IIS-related directories. Create a frequency table of parent processes and file types. Alert when a rare process (e.g., `w3wp.exe`, `cmd.exe`) writes a DLL file, representing a statistically improbable event based on historical data.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on file modification events. Features could include the process name, user context, target file path, and time of day. Clusters of events that are distant from the large, dense clusters of 'normal' administrative activity can be flagged as anomalous."
            ]
          },
          {
            "description": "The IIS worker process (w3wp.exe) spawns a child process that is not part of a pre-defined allow list of expected applications.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution environment on all IIS Web Servers.",
            "action": [
              "Symbolic: Create an alert that triggers whenever a process creation event (Windows Event ID 4688) has `w3wp.exe` as the parent process and the child process is a command shell (`cmd.exe`, `powershell.exe`), a scripting engine (`cscript.exe`, `wscript.exe`), or a known reconnaissance tool (`whoami.exe`, `net.exe`).",
              "Statistical: For each IIS server, build a historical baseline of all child processes spawned by `w3wp.exe`. Calculate the rarity of each child process across the fleet of servers. Alert when a child process is spawned that has either never been seen before or is in the bottom 5th percentile of frequency.",
              "Machine Learning: Employ a sequence analysis model (e.g., an LSTM) to learn normal sequences of process executions following an initial web request. If a malicious IIS module spawns a child process, this will create a process execution sequence that deviates significantly from the learned normal patterns, allowing the model to flag it as an anomaly."
            ]
          },
          {
            "description": "Outbound network traffic from an IIS worker process (w3wp.exe) exhibits characteristics that deviate significantly from an established behavioral baseline, such as unusual destination port, data volume, or connection timing.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Network Segment, Network Egress Points, IIS Web Servers",
            "action": [
              "Symbolic: Alert when the IIS worker process (`w3wp.exe`), identified via Windows Event ID 5156, initiates an outbound connection (Zeek conn.log) to a non-standard port (e.g., any port not in the set {80, 443, 53} or other business-approved ports) or to a raw IP address without a preceding DNS query.",
              "Statistical: For each server's `w3wp.exe` process, model the distribution of outbound connection durations and total bytes transferred. Use the Inter-Quartile Range (IQR) method to identify outliers. A connection whose duration or byte count is greater than Q3 + 1.5*IQR should be flagged for review.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means) on network connection features (destination port, protocol, bytes out, connection duration, destination ASN) from `w3wp.exe`. A new, small cluster forming with unusual characteristics (e.g., long-lived connections on a high port to a rare ASN) can indicate the emergence of a C2 channel."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]