[
  {
    "information_requirement": "Is the adversary establishing persistence by manipulating screensaver configurations?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1546.002",
        "name": "Screensaver",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable image path ends in '.scr' and the SHA256 hash of the executable matches a value on a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers",
            "action": [
              "Symbolic: Create a detection rule that triggers on any process creation event (Windows Event ID 4688) where the 'ProcessName' or 'ImagePath' ends with '.scr'. Upon trigger, calculate the SHA256 hash of the executable and query a threat intelligence platform API or local hash set for a match. An alert is generated upon a positive match.",
              "Statistical: For all observed '.scr' file executions, calculate the enterprise-wide execution frequency for each unique file hash. Flag any execution where the hash is a singleton (seen only once) or falls below the 5th percentile of frequency, indicating a rare occurrence that warrants investigation.",
              "Machine Learning: Develop a supervised classification model (e.g., Random Forest) trained on features from process creation events, including file path characteristics (length, depth, presence of user-writable directory strings), parent process details, and file hash prevalence. Use this model to score each '.scr' execution for its likelihood of being malicious."
            ]
          },
          {
            "description": "A registry modification event is logged for the key 'HKCU\\Control Panel\\Desktop\\SCRNSAVE.exe' where the new value is a path outside of standard system directories ('C:\\Windows\\System32\\', 'C:\\Windows\\SysWOW64\\'), or for 'HKCU\\Control Panel\\Desktop\\ScreenSaverIsSecure' where the value is set to '0'.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Registry on all enterprise workstations",
            "action": [
              "Symbolic: Deploy a detection rule that monitors for registry write events (Windows Event ID 4657) to 'HKCU\\Control Panel\\Desktop\\SCRNSAVE.exe'. Alert if the new value data does not contain 'C:\\Windows\\System32\\' or 'C:\\Windows\\SysWOW64\\'. Additionally, alert on any write event that sets 'HKCU\\Control Panel\\Desktop\\ScreenSaverIsSecure' to the DWORD value '0'.",
              "Statistical: Establish a baseline of processes that modify screensaver registry keys (e.g., 'explorer.exe', 'rundll32.exe'). Alert if a process not in the top 95th percentile of common modifiers makes a change. Calculate the Shannon entropy of the 'SCRNSAVE.exe' path value; a high entropy score may indicate a randomized path used by malware.",
              "Machine Learning: Use time-series analysis (e.g., ARIMA) on the volume of modification events for screensaver-related registry keys per user or host. An anomalous spike in modification activity, deviating significantly from the established forecast, could indicate automated manipulation by an adversary."
            ]
          },
          {
            "description": "A process creation event for an executable ending in '.scr' is correlated within a 60-second window with an outbound network connection event from the same source host, where the connection is initiated by that process's ID.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers; Network egress points (e.g., firewalls, proxies)",
            "action": [
              "Symbolic: Join host process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log) on the host's IP address and a time window under 60 seconds. Create a high-severity alert if the process name in the host event ends with '.scr' and a corresponding outbound connection is found. Legitimate screensavers should not initiate network connections.",
              "Statistical: For any '.scr' process that makes a network connection, analyze the destination IP and port. Flag connections to IPs with low reputation scores or those belonging to autonomous systems (ASNs) in the bottom 10th percentile of connection frequency for the organization.",
              "Machine Learning: Train a one-class SVM or Isolation Forest model on legitimate network traffic features (destination IP, port, protocol, ASN, connection duration, bytes transferred). Apply this model to network connections initiated by '.scr' processes to detect anomalous outliers that do not conform to the profile of normal network activity."
            ]
          },
          {
            "description": "A process creation event is logged for an executable ending in '.scr' where the file path is a non-standard, user-writable location such as '%APPDATA%', '%TEMP%', 'C:\\Users\\<user>\\Downloads\\', or a temporary internet files folder.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on all enterprise workstations and servers, specifically user profile directories",
            "action": [
              "Symbolic: Create a detection rule that triggers on process creation events (Windows Event ID 4688) where the image path ends with '.scr' and the path string matches patterns for user-writable locations (e.g., 'AppData', 'Temp', 'Downloads'). Exclude the standard 'C:\\Windows\\System32' and 'C:\\Windows\\SysWOW64' paths.",
              "Statistical: Across the enterprise, compute the frequency of all execution paths for '.scr' files. Identify the least common paths using a stacking algorithm. Any path that falls into a low percentile (e.g., bottom 5%) is considered rare and suspicious. Calculate the string entropy of the filename; unusually high entropy can indicate randomized filenames.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on the feature vectors of '.scr' execution paths, using features like path depth and directory name tokens. Identify small clusters or noise points as anomalous execution locations that deviate from the large, dense clusters of legitimate screensaver paths."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary elevating privileges through the execution of a malicious screensaver?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1546.002",
        "name": "Screensaver",
        "evidence": [
          {
            "description": "A process creation event is logged where the parent process image path ends in '.scr' and the child process's executable hash (SHA256) matches a known indicator for a privilege escalation tool (e.g., Mimikatz, PrintSpoofer, BadPotato).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers",
            "action": [
              "Symbolic: Filter for process creation events (Windows Event ID 4688) where the 'ParentProcessName' ends in '.scr'. For each such event, compute the hash of the child 'ProcessName' executable. Match this hash against a curated list of known privilege escalation tool hashes. Generate a critical alert on any match.",
              "Statistical: Create a baseline of all parent-child process relationships where the parent is a '.scr' file. Calculate the frequency of each unique child process name. Any child process that is statistically rare (e.g., appearing in less than 1% of all screensaver-spawned process instances) should be flagged for review.",
              "Machine Learning: Develop a graph-based anomaly detection model on process lineage. A subgraph initiated by a '.scr' process that contains nodes (processes) or edges (relationships) that are rare or have anomalous features (e.g., unusual command lines) can be classified as malicious."
            ]
          },
          {
            "description": "A process creation event is logged for a legitimate screensaver executable (e.g., 'scrnsave.scr', 'logon.scr') that includes command-line arguments known to be associated with UAC bypass or other exploitation techniques.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for known screensaver executables. Apply a regular expression to the 'CommandLine' field to search for suspicious patterns, such as encoded commands or arguments that don't match the standard '/s' or '/p' switches. Alert on a pattern match.",
              "Statistical: For each legitimate screensaver executable, establish a baseline of normal command-line arguments. Calculate the Shannon entropy of the command-line string for each execution. An execution with an entropy score significantly higher than the baseline (e.g., > 3 standard deviations above the mean) may indicate obfuscated payloads.",
              "Machine Learning: Train a classifier on command-line arguments, using features like argument count, length, character distribution, and the presence of special characters or encoded strings. Use this model to score the likelihood that the command-line arguments for a screensaver execution are malicious."
            ]
          },
          {
            "description": "A process creation event is logged where the parent process is a '.scr' file and the child process is an interactive shell (e.g., 'cmd.exe', 'powershell.exe') or the child process is running with a higher integrity level (e.g., 'High' or 'System') than the parent.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers",
            "action": [
              "Symbolic: Create a detection rule that triggers on process creation events (Windows Event ID 4688) where 'ParentProcessName' ends in '.scr' and the child 'ProcessName' is 'cmd.exe', 'powershell.exe', 'wscript.exe', or 'cscript.exe'. Also, alert if the child process's 'IntegrityLevel' is higher than the parent's.",
              "Statistical: Build a probability model of parent-child process pairs. Calculate the conditional probability P(Child | Parent). If P('powershell.exe' | 'bubbles.scr') is exceptionally low (below a 0.1% threshold), it represents a highly anomalous and suspicious event.",
              "Machine Learning: Use a process tree anomaly detection model. For each tree rooted at a '.scr' process, extract features for the entire tree (e.g., depth, breadth, presence of shells). Train a model like an autoencoder on benign process trees. Trees with high reconstruction error are flagged as anomalous."
            ]
          },
          {
            "description": "A file or registry access event is logged where the process performing the action is a '.scr' executable (or its immediate child) and the target object is a sensitive resource, such as the 'lsass.exe' process memory, the SAM hive, or the 'HKLM\\SECURITY' registry hive.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for SAM hive), all enterprise workstations and servers (for lsass.exe and registry)",
            "action": [
              "Symbolic: Correlate process creation events (4688) for '.scr' files with subsequent object access events (4663, 4657) initiated by the same Process ID. Create a critical alert if the target of the access attempt is 'lsass.exe' (with access mask for memory reading), '%SystemRoot%\\System32\\config\\SAM', or any key under 'HKLM\\SECURITY'.",
              "Statistical: Establish a baseline of all object access attempts made by legitimate screensaver processes, which should be near zero. Any access to files or registry keys outside of expected configuration or resource files (e.g., a screensaver accessing a user's Documents folder) is a statistical outlier and should be flagged.",
              "Machine Learning: Train a sequence-based model (e.g., LSTM) on sequences of system calls or object access events following a process launch. A sequence of events initiated by a '.scr' process that deviates from the learned normal patterns (e.g., process launch -> process access on lsass.exe) would be flagged as anomalous."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]