[
  {
    "information_requirement": "Has the adversary successfully escalated privileges on a macOS host using an execution prompt?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1548.004",
        "name": "Elevated Execution with Prompt",
        "evidence": [
          {
            "description": "Execution of '/usr/libexec/security_authtrampoline' on a macOS endpoint by an unsigned or uncommon parent process, which is the underlying mechanism for the AuthorizationExecuteWithPrivileges API call.",
            "data_sources": [
              "macOS Process Execution Logs (e.g., Endpoint Security Framework, osquery)",
              "macOS Unified Logs (log stream)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "macOS Endpoints (laptops, desktops)",
            "action": [
              "Create a rule to alert on any process execution of '/usr/libexec/security_authtrampoline' where the parent process is unsigned, has a low reputation score, or is located in a non-standard path like '/tmp/' or '~/Downloads/'.",
              "For each 'security_authtrampoline' execution, calculate the historical frequency of the parent process initiating this call across the enterprise. Flag parent processes that are statistical outliers, such as those in the bottom 5th percentile of prevalence or seen for the first time.",
              "Train a decision tree classifier on features of the parent process (e.g., is_signed, path_entropy, reputation_score, has_network_connection) to predict whether an 'AuthorizationExecuteWithPrivileges' call is malicious. A positive classification triggers an alert."
            ]
          },
          {
            "description": "A macOS host initiates a network connection to an external IP address or domain with a known-bad reputation score or category (e.g., C2, malware) within minutes of a suspected privilege escalation event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies)",
            "action": [
              "Correlate destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log against a threat intelligence feed of known C2 servers. Generate a high-severity alert on any match originating from a macOS host.",
              "Calculate the entropy and character distribution of all requested domain names in Zeek dns.log. Alert on domains with an entropy score above a set threshold (e.g., > 4.0) or that match patterns of Domain Generation Algorithms (DGAs), which are statistical outliers compared to legitimate domains.",
              "Use a time-series model (e.g., ARIMA) to forecast the expected volume of outbound connections per macOS host. Generate an alert if the observed connection count to new or rare external IPs significantly exceeds the forecasted value (e.g., > 3 standard deviations) in a short time window."
            ]
          },
          {
            "description": "HTTP or TLS traffic from a macOS host contains artifacts (User-Agent, URI, JA3/JA3S hash) strongly associated with known macOS C2 frameworks or post-exploitation toolkits.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Network Segments",
            "action": [
              "Create detection rules that match specific User-Agent strings, URI patterns, or JA3/JA3S hashes found in Zeek http.log and ssl.log that are unique to macOS C2 frameworks like Mythic, Sliver, or Shlayer.",
              "Profile the distribution of JA3/JA3S hashes across the enterprise. Identify and alert on hashes that are rare (e.g., seen on < 1% of hosts) or have never been seen before, as this indicates non-standard client software.",
              "Train a classifier on Zeek SSL/TLS log features (e.g., certificate validity period, issuer, subject, SNI length, JA3S hash) to distinguish between legitimate and malicious C2 traffic. Use the model to score new connections for potential maliciousness."
            ]
          },
          {
            "description": "A macOS host establishes a remote logon session (Logon Type 3 or 10) on a Windows system for the first time or after a long period of inactivity, particularly on a high-value asset like a domain controller.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Alert when a Windows Event ID 4624 (Logon Type 3 or 10) is generated on a server, and the Source Network Address corresponds to a macOS device, if that device has never logged into that server before.",
              "For each user, maintain a statistical profile of typical source hosts and destination servers for remote logons. Alert if a logon occurs from a macOS host when the user's historical logons are exclusively from Windows hosts, representing a statistically significant deviation from their baseline.",
              "Use a peer group analysis or clustering algorithm (e.g., K-Means) to group users with similar remote access patterns. Flag a user whose macOS-to-Windows logon behavior causes them to deviate significantly from their assigned cluster, indicating anomalous lateral movement."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of data transferred from a macOS host to an external destination, especially involving file types commonly used for staging (e.g., .zip, .rar, .tgz).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal File Shares",
            "action": [
              "Create a rule to alert when Zeek files.log shows a file transfer from a macOS host to an external IP where the file MIME type is 'application/zip' or similar, and the file size exceeds a defined threshold (e.g., 100MB).",
              "For each macOS host, establish a baseline of daily outbound data volume (bytes_out from Zeek conn.log). Alert when the daily volume exceeds a dynamic threshold, such as the 99th percentile of the host's historical 30-day traffic.",
              "Apply a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the outbound byte count per host. The model will learn the normal 'rhythm' of data transfers and alert on spikes that are not explained by normal seasonality or trends."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses following a privilege escalation event originating from a macOS host?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1548.004",
        "name": "Elevated Execution with Prompt",
        "evidence": [
          {
            "description": "A macOS host resolves DNS queries for domains categorized as anonymization services (VPN, Tor, Proxy), dynamic DNS providers, or known hosting sites for offensive security tools.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Resolvers",
            "action": [
              "Match DNS queries from Zeek dns.log against threat intelligence category lists for 'Anonymization', 'Dynamic DNS', and 'Hacking Tools'. Generate an alert for any match from a macOS endpoint.",
              "Calculate the prevalence of each resolved domain across the enterprise. Alert on queries for domains that are statistically rare (e.g., resolved by fewer than 5 hosts), as this can indicate use of bespoke or less common evasion infrastructure.",
              "Use a pre-trained Domain Generation Algorithm (DGA) detection model to classify all queried domains. An alert is generated if a domain from a macOS host is classified as algorithmically generated, suggesting C2 communication designed to evade blocklists."
            ]
          },
          {
            "description": "A remote process creation (Event ID 4688) on a Windows host, originating from a macOS system, executes commands to disable security tools, clear logs, or modify firewall rules.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1102",
              "Windows Event ID 4719",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Windows Servers",
            "action": [
              "Create a correlation rule that triggers when a Windows Event ID 4624 (Remote Logon) from a macOS IP is followed within minutes by Event ID 4688 containing command-line arguments like 'wevtutil cl', 'netsh advfirewall set', 'sc config', or 'Set-MpPreference -Disable'. Also monitor for Event ID 1102 (Audit log cleared).",
              "Establish a baseline for the frequency of security policy changes (e.g., Event ID 4719) or log clearing events (Event ID 1102) on servers. An event originating from a session tied to a macOS host is a high-confidence statistical anomaly and should be alerted on.",
              "Train a sequence analysis model (e.g., Hidden Markov Model) on streams of security events from high-value servers. The model learns normal sequences of administrative activity. An alert is triggered when a sequence involving a logon from a macOS host followed by defense disabling commands is observed, as this is a highly improbable and anomalous sequence."
            ]
          },
          {
            "description": "A TLS session from a macOS host exhibits multiple anomalous characteristics simultaneously, such as a self-signed certificate, a non-standard port, a rare JA3 hash, and high data payload entropy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Create a rule that alerts if a TLS session from a macOS host in Zeek ssl.log uses a non-standard port (not 443), AND the associated certificate in x509.log has a self-signed issuer, OR the JA3 hash matches a known malicious hash.",
              "For each TLS session, calculate a risk score. Add points for anomalous features: rare JA3 hash (+1), non-443 port (+1), self-signed certificate (+2), short certificate validity period (+1). Alert on any session with a score exceeding a threshold, such as 3.",
              "Use a one-class SVM (Support Vector Machine) trained on features from legitimate TLS traffic (port, JA3, cert issuer, duration). The model will create a boundary around 'normal' traffic and alert on any new connection from a macOS host that falls outside this boundary."
            ]
          },
          {
            "description": "A new service (Event ID 7045) or scheduled task (Event ID 4698) is created on a Windows system, where the creation event is linked to a remote session originating from a macOS host.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 4698",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations with Admin Rights",
            "action": [
              "Create a correlation rule that alerts when a Windows Event ID 7045 or 4698 occurs, and the security context of the event can be traced back to a recent logon (Event ID 4624, Logon Type 3 or 10) from an IP address belonging to a macOS device.",
              "Analyze the frequency of service or task creation on servers by source host type. The creation of persistence from a macOS host is a zero-frequency event in most environments and is therefore a high-confidence statistical anomaly.",
              "Use a graph-based anomaly detection model where nodes are hosts and edges are actions (logon, service creation). A new edge representing 'service creation' from a 'macOS node' to a 'Windows Server node' would be flagged as a structurally anomalous pattern in the graph."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]