[
  {
    "information_requirement": "Is the adversary bypassing authentication mechanisms using stolen hashes?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1550.002",
        "name": "Pass the Hash",
        "evidence": [
          {
            "description": "An NTLM LogonType 3 event involves a source or destination IP address present on an active threat intelligence feed or internal list of known compromised hosts.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Threat Intelligence Platforms, Centralized Log Aggregator",
            "action": [
              "Symbolic: Create a rule to join the source and destination IP addresses from all NTLM LogonType 3 events (Windows Event ID 4624) against a watchlist of IPs from threat intelligence and internal incident response cases. An exact match should trigger a high-severity alert.",
              "Statistical: Calculate a risk score for each logon based on the reputation of the source and destination IPs. For example, assign scores based on the number of threat feeds an IP appears on or its age on the list. Analyze the distribution of these scores over time and alert when a logon's score exceeds the 95th percentile, indicating an unusually high-risk connection.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to predict the likelihood of a logon being malicious. Use features such as 'IsSourceOnThreatList', 'IsDestinationOnThreatList', 'UserPrivilegeLevel', and 'IsFirstTimeConnection'. A prediction probability above a set threshold (e.g., 0.85) indicates a likely PtH attempt."
            ]
          },
          {
            "description": "A successful NTLM LogonType 3 event is immediately followed on the target system by the creation of a service or named pipe with a high-entropy name or a name matching known hacking tool artifacts.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint and Server Process, Service, and Authentication Logs",
            "action": [
              "Symbolic: After a successful NTLM LogonType 3 event (Event ID 4624) on a target, monitor for subsequent Service Creation (Event ID 7045) or Process Creation (Event ID 4688) events within 5 minutes. Use regular expressions to match known malicious service names (e.g., 'PSEXESVC') or process command-line arguments associated with tools like Impacket or Mimikatz.",
              "Statistical: For every new service or named pipe created following a network logon, calculate the Shannon entropy of its name. Establish a baseline for entropy in legitimate names. Alert when a new name's entropy score is a statistical outlier (e.g., > 3 standard deviations above the mean or > 4.0), suggesting a randomly generated name used by a tool.",
              "Machine Learning: Utilize a sequence analysis model (e.g., Hidden Markov Model or LSTM) trained on event logs. The model learns normal sequences of events following a network logon. An anomalous sequence, such as [LogonType 3 -> Service Creation (High Entropy Name) -> Process Create (cmd.exe)], would be flagged with a high anomaly score."
            ]
          },
          {
            "description": "An NTLM LogonType 3 authentication for a user originates from a source workstation where that same user has no preceding interactive logon (LogonType 2 or 10) within a recent time window.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Logs from all Workstations and Servers",
            "action": [
              "Symbolic: For every successful NTLM LogonType 3 event for a user from a source host to a destination host, query the source host's logs for a successful interactive logon (LogonType 2 or 10) by the same user within the last 24 hours. If no such event exists, trigger an alert.",
              "Statistical: For each user, establish a baseline ratio of their interactive logons (Type 2/10) to their network logons (Type 3) on a daily basis. Monitor this ratio and alert if it drops dramatically (e.g., falls below the 5th percentile of the user's historical values), indicating a spike in network logons without a user being physically or remotely logged on.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on logon events, using features like user, source host, logon type, and time. A cluster of LogonType 3 events that is not associated with a corresponding cluster of LogonType 2/10 events for the same user/host pairs would be identified as an anomalous cluster requiring investigation."
            ]
          },
          {
            "description": "A machine account (name ending in '$') is used for an NTLM LogonType 3 authentication from a source host that is not a domain controller or an authorized management server.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller and Member Server Authentication Logs, Asset Inventory/CMDB",
            "action": [
              "Symbolic: Maintain an explicit allow-list of hostnames and IP addresses for domain controllers and authorized administrative servers. Create a rule that alerts on any Windows Event ID 4624 where the LogonType is 3, the Account Name ends with '$', and the Source Network Address is not in the allow-list.",
              "Statistical: Profile the frequency of all source hosts that perform network logons with machine accounts. Any source host that is statistically rare (e.g., its logon frequency falls in the bottom 1st percentile) should be flagged for review, as it represents a deviation from normal machine-to-machine communication patterns.",
              "Machine Learning: Train a one-class SVM model on legitimate machine account logon activity, using features like source/destination hostname, subnet, and time of day. New logons that the model classifies as anomalies (i.e., falling outside the learned 'normal' boundary) indicate potentially malicious use of a machine account."
            ]
          },
          {
            "description": "A user account, especially a privileged or service account, performs an NTLM LogonType 3 authentication from a source host or to a destination host for the first time.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historical Authentication Logs (minimum 90 days), User and Asset Role Databases",
            "action": [
              "Symbolic: For each user, maintain a baseline of historically accessed source-destination host pairs from logon data over the last 90 days. Alert on any new NTLM LogonType 3 event that introduces a source-destination pair not present in the user's baseline, with severity escalated for privileged accounts.",
              "Statistical: For each user, profile the set of hosts they access. On a daily basis, compare the set of hosts accessed to their historical baseline using a Jaccard similarity index. If the similarity score drops below a threshold (e.g., 0.5), it indicates a significant and sudden change in access patterns that warrants investigation.",
              "Machine Learning: Model user-host logon relationships as a graph. Use a link prediction algorithm to forecast likely future connections. If an observed logon occurs between a user and host where the model predicted a very low probability of connection, flag the event as a high-risk anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary moving laterally using stolen credentials/hashes?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1550.002",
        "name": "Pass the Hash",
        "evidence": [
          {
            "description": "An NTLM LogonType 3 authentication targets a high-value asset, such as a domain controller or critical server, from a source that is not an authorized administrative workstation.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-Value Asset Inventory (CMDB), Domain Controller Security Logs, Critical Server Security Logs",
            "action": [
              "Symbolic: Maintain a list of high-value asset IP addresses and a list of authorized administrative source IPs. Trigger a high-severity alert for any NTLM LogonType 3 event where the destination IP is on the high-value list and the source IP is not on the authorized admin list.",
              "Statistical: Assign a criticality tier (e.g., 1-5) to every asset. For each network logon, calculate a risk score by multiplying the source asset's tier by the destination asset's tier. Monitor the distribution of these risk scores and alert on any logon whose score exceeds a dynamic threshold (e.g., 99th percentile), indicating an unusually risky connection.",
              "Machine Learning: Train a classification model to predict the risk of a lateral movement event based on features such as source asset criticality, destination asset criticality, user privilege level, and the historical frequency of the connection path. Flag any logon with a high predicted risk score."
            ]
          },
          {
            "description": "A successful NTLM LogonType 3 authentication is followed within minutes by remote process execution or service creation on the target host, originating from the source host.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Process Creation Logs, Network Inspection Points (for DCE/RPC traffic), Server Authentication Logs",
            "action": [
              "Symbolic: Create a time-series correlation rule that triggers if Event A (NTLM LogonType 3 from Source S to Target T) is followed within 2 minutes by Event B (Process Create on T for 'cmd.exe' or 'powershell.exe' with a parent of 'services.exe' or 'wmiprvse.exe') or Event C (Zeek dce_rpc.log shows service creation call from S to T).",
              "Statistical: Analyze the time delta between an NTLM logon and subsequent remote execution activity from the same source to the same target. Automated tools exhibit very short, consistent time deltas. Flag any source-target pair where this time delta is a statistical outlier (e.g., in the lowest 1st percentile of observed deltas across the environment).",
              "Machine Learning: Use a sequence model trained on streams of security events per host. A sequence like [NTLM_Logon, DCE_RPC_SVC_Create, Process_Create_From_Service] that deviates from learned normal behavior patterns would be flagged by the model as an anomalous lateral movement sequence."
            ]
          },
          {
            "description": "A single source host or user account performs NTLM LogonType 3 authentications to an abnormally high number of distinct destination hosts in a short time frame.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized Authentication Logs from all Endpoints and Servers",
            "action": [
              "Symbolic: Create a rule that triggers an alert if a single source IP or user account generates successful NTLM LogonType 3 events to more than 20 unique destination hosts within a 10-minute window.",
              "Statistical: For each source host, create a baseline of the number of unique destinations it connects to via NTLM LogonType 3 per hour. Use a sliding window to monitor this count and alert if it exceeds a dynamic threshold, such as 3 standard deviations above the host's own average or the average of its peer group.",
              "Machine Learning: Apply time-series forecasting (e.g., using a SARIMA model) to the count of unique NTLM destinations per source host. An alert is generated when the observed count significantly exceeds the forecasted upper confidence bound, indicating a fan-out activity spike consistent with automated lateral movement."
            ]
          },
          {
            "description": "A chain of NTLM LogonType 3 authentications (e.g., Host A -> Host B -> Host C) is observed, especially if the path violates network segmentation policies.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Flow Logs, Centralized Authentication Logs, Network Architecture Policies",
            "action": [
              "Symbolic: Codify network segmentation rules (e.g., 'UserVLAN cannot connect to ServerVLAN'). Ingest logon events and enrich them with network zone information for the source and destination. Alert on any logon event that directly violates a defined segmentation rule.",
              "Statistical: Construct a directed graph of NTLM logons between hosts. Analyze the graph to find logon chains (paths of length > 1). Calculate the frequency and length of all paths. Alert on the appearance of paths longer than a baseline maximum (e.g., > 2 hops) or paths that are statistically rare.",
              "Machine Learning: Use a graph embedding algorithm like Node2Vec to learn vector representations of each host based on its connection patterns. A compromised host used as a pivot point will have its vector change significantly as it starts connecting to new host clusters. Use anomaly detection on these vectors to identify such behavioral shifts."
            ]
          },
          {
            "description": "A successful NTLM LogonType 3 authentication to a domain controller from a source IP is immediately followed by Kerberos TGT (Ticket Granting Ticket) or TGS (Ticket Granting Service) requests from the same source IP for the same user, indicating an Overpass-the-Hash attack.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4768",
              "Windows Event ID 4769"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller Security Logs",
            "action": [
              "Symbolic: On a domain controller, create a correlation rule that alerts if a successful NTLM LogonType 3 (Event ID 4624) for a user from a source IP is followed within 10 seconds by a Kerberos TGT request (Event ID 4768) or Service Ticket request (Event ID 4769) from the same user and source IP.",
              "Statistical: Analyze the time delay between NTLM logons to a DC and subsequent Kerberos requests from the same source. An automated Overpass-the-Hash attack will have a very small and consistent delay. Flag any source IP whose average time delay is a low-percentile outlier (e.g., < 1st percentile or < 1 second).",
              "Machine Learning: Train a Bayesian network to model the conditional probabilities of different authentication event sequences on a domain controller. An attack would create a sequence where the conditional probability P(Kerberos Request | NTLM Logon) is anomalously high for a given user/source, which the model would flag."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]