[
  {
    "information_requirement": "Is the adversary establishing persistence by modifying account properties for reversible encryption?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.005",
        "name": "Reversible Encryption",
        "evidence": [
          {
            "description": "One or more Active Directory user accounts have the 'userAccountControl' attribute flag for 'Password stored using reversible encryption' (ADS_UF_ENCRYPTED_TEXT_PASSWORD_ALLOWED) enabled.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4720",
              "LDAP Query Results"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Database (NTDS.dit)",
            "action": [
              "Symbolic: Periodically query Active Directory via LDAP for all user objects where the 'userAccountControl' attribute has the '0x80' (UF_ENCRYPTED_TEXT_PASSWORD_ALLOWED) flag set. Create an alert for any account found with this setting enabled that is not on an approved exception list.",
              "Statistical: For all accounts with reversible encryption enabled, establish a baseline of login activity (Windows Event ID 4624). Calculate the 95th percentile for days since last login across all active accounts. Flag any account with reversible encryption that attempts a login after a dormancy period exceeding this threshold, as it may indicate the reactivation of a persistent account.",
              "Machine Learning: Correlate account creation events (Windows Event ID 4720) or modification events (Windows Event ID 4738) that enable reversible encryption with immediate subsequent successful logon events (Windows Event ID 4624) from a new or rare location (geolocated from Zeek conn.log source IP). A time-series model can identify this pattern occurring within a short window (e.g., under 5 minutes) as a high-confidence indicator of a newly staged persistent account."
            ]
          },
          {
            "description": "A Fine-Grained Password Policy (FGPP) object is created or modified where the 'msDS-PasswordReversibleEncryptionEnabled' attribute is set to 'TRUE'.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5137",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SYSVOL Share, Active Directory Administrative Center",
            "action": [
              "Symbolic: Monitor for directory service object creation (Windows Event ID 5137) where Object Class is 'msDS-PasswordSettings'. For these events, and for modification events (Windows Event ID 5136) on existing FGPP objects, trigger an alert if the 'msDS-PasswordReversibleEncryptionEnabled' attribute is set to TRUE.",
              "Statistical: Maintain a list of users and groups authorized to create or modify FGPPs. Profile the frequency of FGPP modifications by these users. Generate an alert if an FGPP modification enabling reversible encryption is performed by a user who has never done so before, or if the rate of FGPP modifications by any single user exceeds a statistical baseline (e.g., 2 standard deviations above their weekly average).",
              "Machine Learning: Use a classification model to score the risk of an FGPP modification. Features should include the user performing the change, the time of day, the source workstation, and the specific settings being changed (e.g., enabling reversible encryption). Train the model on historical administrative activity to identify anomalous changes that deviate from established safe patterns."
            ]
          },
          {
            "description": "A successful authentication event (Windows Event ID 4624) occurs for an account with reversible encryption enabled, where the authentication follows a password change (Windows Event ID 4723) within a short time window or after a statistically significant period of account inactivity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4723",
              "LDAP Query Results",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Logs, Internet Gateway",
            "action": [
              "Symbolic: For all accounts identified with reversible encryption enabled, create a rule that alerts if a password change event (Windows Event ID 4723) is followed by a successful interactive logon (Windows Event ID 4624, Logon Type 2 or 10) from a non-standard IP address (not within private RFC1918 space) within 5 minutes.",
              "Statistical: For each account with reversible encryption, calculate the mean and standard deviation of its login frequency. Use a time-series analysis to detect a successful login (Windows Event ID 4624) that occurs after a period of dormancy greater than 3 standard deviations from the account's historical norm. This identifies the use of a dormant account as a persistence backdoor.",
              "Machine Learning: Chain events together using a sequence analysis model: an account modification to enable reversible encryption (Windows Event ID 4738), followed by a password reset by an administrator (Windows Event ID 4724), followed by a successful logon by that user (Windows Event ID 4624). Detect this specific chain of events occurring in a short time window as it is highly indicative of an adversary taking control of an account for persistent access."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to evade defenses by enabling reversible password encryption?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.005",
        "name": "Reversible Encryption",
        "evidence": [
          {
            "description": "The Group Policy Object (GPO) for 'Default Domain Policy' or 'Default Domain Controllers Policy' is modified to set 'Store passwords using reversible encryption' to 'Enabled', with the change originating from an unrecognized administrative host or process.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SYSVOL Share (policy files), Administrative Workstations",
            "action": [
              "Symbolic: Monitor for modification events (Windows Event ID 5136) on the well-known GUIDs for 'Default Domain Policy' {31B2F340-016D-11D2-945F-00C04FB984F9} and 'Default Domain Controllers Policy' {6AC1786C-016F-11D2-945F-00C04FB984F9}. If a change is detected, inspect the policy file modification on the SYSVOL share. Alert if the reversible encryption setting is enabled.",
              "Statistical: Maintain a baseline of hosts and user accounts that normally modify GPOs. Calculate the entropy of the source hostnames that modify GPOs daily. An alert should be generated if a GPO modification enabling reversible encryption originates from a host that has never modified GPOs before, or if the daily source host entropy significantly increases.",
              "Machine Learning: Correlate GPO modification events (Windows Event ID 5136) with preceding remote access logs (e.g., WinRM traffic in Zeek conn.log on port 5985/5986). Use an anomaly detection model to flag GPO changes that are preceded by remote connections from IP addresses with low reputation scores or from unusual geographic locations, indicating an external actor making policy changes."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) or PowerShell script block log (Windows Event ID 4104) is observed containing command-line arguments or script content that sets the 'AllowReversiblePasswordEncryption' property on an AD user object, particularly if obfuscation techniques are present.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstations, PowerShell Transcript Logs",
            "action": [
              "Symbolic: Create a detection rule for process command lines (Windows Event ID 4688) and PowerShell script blocks (Event ID 4104) that matches the regex pattern `/(Set-ADUser|Set-ADAccountControl).*-AllowReversiblePasswordEncryption\\s+\\$true/i`. Alert on any match.",
              "Statistical: Analyze the entropy of PowerShell commands executed on Domain Controllers. A command with unusually high entropy may be obfuscated. Calculate the character frequency distribution of normal PowerShell scripts and flag any script containing `AllowReversiblePasswordEncryption` whose distribution deviates significantly (e.g., high chi-squared distance) from the norm.",
              "Machine Learning: Train a classifier on PowerShell script blocks (Event ID 4104) to distinguish between benign administrative scripts and malicious ones. Features should include command length, presence of specific cmdlets (Set-ADUser), use of reflection or encoding (e.g., FromBase64String), and script entropy. A high-scoring classification of a script that also contains reversible encryption keywords indicates a likely evasive action."
            ]
          },
          {
            "description": "An Active Directory user account modification event (Windows Event ID 4738) enabling reversible encryption is attributed to a user account or source host that has no historical record of performing such changes, or the event occurs at a statistically anomalous time.",
            "data_sources": [
              "Windows Event ID 4738",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstation Event Logs",
            "action": [
              "Symbolic: Maintain an explicit list of 'AD Security Admin' accounts. Generate a high-priority alert if a user account is modified to enable reversible encryption (detected via Windows Event ID 4738 by checking the 'User Account Control' field) by any account NOT on this list.",
              "Statistical: For each administrator, create a time-of-day/day-of-week histogram for when they perform account modifications (Event ID 4738). If a modification enabling reversible encryption occurs at a time with a very low probability (e.g., outside the 95% confidence interval of their normal activity hours), flag it as suspicious activity outside of a change window.",
              "Machine Learning: Use clustering (e.g., DBSCAN) to group administrative sessions based on features like source IP, user, processes run, and types of AD objects modified. A session where reversible encryption is enabled that falls into a small cluster or is labeled as a noise/outlier by the algorithm is a strong candidate for an evasive, non-standard administrative action."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting credential access by enabling reversible password encryption?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.005",
        "name": "Reversible Encryption",
        "evidence": [
          {
            "description": "A process is executed on a Domain Controller or administrative host whose file hash or name matches a known credential access tool (e.g., PowerSploit, Mimikatz) and whose execution includes command-line parameters for modifying AD user account properties.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Windows Defender Event ID 1116"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstations, Tier 0 Servers",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) and Antivirus detection logs (e.g., Defender Event ID 1116). Alert immediately if a process hash matches a known threat intelligence indicator for tools like Mimikatz, or if the command line contains strings like 'Invoke-Mimikatz' or 'Set-ADDBReplicationAccount' found in PowerShell logs (Event ID 4104).",
              "Statistical: Profile the parent-child process relationships on Domain Controllers. A common process like `powershell.exe` spawning from an unusual parent (e.g., an Office application or web server process) and subsequently loading the Active Directory module is statistically anomalous. Flag such instances, especially if followed by account modification events.",
              "Machine Learning: Use a supervised learning model trained to identify malicious PowerShell execution. Features should include script block content (from Event ID 4104), invocation of suspicious APIs, command-line arguments (from Event ID 4688), and parent process information. A classification as 'malicious' for a script that also contains logic for enabling reversible encryption is a high-fidelity alert."
            ]
          },
          {
            "description": "A directory service audit event (Windows Event ID 4738) shows a change to a user's 'User Account Control' attribute where the new value indicates the 'UF_ENCRYPTED_TEXT_PASSWORD_ALLOWED' flag (0x80) has been added.",
            "data_sources": [
              "Windows Event ID 4738"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Audit Logs",
            "action": [
              "Symbolic: Create a rule to monitor Windows Event ID 4738. For each event, perform a bitwise AND on the 'User Account Control' field's old and new values with the mask '0x80'. Alert if the result for the old value is 0 and the result for the new value is 128 (0x80), indicating the flag was newly set.",
              "Statistical: Track the rate of 'userAccountControl' modifications across the domain that enable reversible encryption. A sudden spike in the number of accounts having this flag set within a short period (e.g., >5 accounts in 1 minute) is a statistical anomaly. Calculate a moving average and standard deviation of these events and alert when the rate exceeds a threshold (e.g., 3 standard deviations above the mean).",
              "Machine Learning: Use a peer group analysis model. Group users by role, department, and normal activity. If an account (e.g., a marketing user) has its 'userAccountControl' attribute modified in a way that is typical only for a different peer group (e.g., legacy application service accounts), flag it as an anomaly. This can detect when an adversary modifies a standard user account for credential access purposes."
            ]
          },
          {
            "description": "A sequence of events occurs in a short time window: 1) A user account is modified to enable reversible encryption (Windows Event ID 4738), followed by 2) a password change for that same account (Windows Event ID 4723), and then 3) an attempt to access LSA secrets (e.g., `G$MSRADIUSCHAPKEY`) on a Domain Controller (Windows Event ID 4656/4663).",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4723",
              "Windows Event ID 4656",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, LSA Security Audit Logs",
            "action": [
              "Symbolic: Create a stateful detection rule that triggers on Event ID 4738 where reversible encryption is enabled. If, within the next 10 minutes, a password change (Event ID 4723) for the same target user occurs, followed by an LSA secret access attempt (Event ID 4656 for handle request, 4663 for object access) from the same source user/host, generate a critical alert for a credential access sequence.",
              "Statistical: Establish a baseline for the frequency of LSA secret access events (4656/4663) from different users and hosts. An account modification enabling reversible encryption followed by LSA access from a user or host that is in the 99th percentile for such access (i.e., very rarely or never performs this action) is a high-confidence statistical anomaly.",
              "Machine Learning: Model the attack chain using a graph-based correlation engine. Define nodes for entities (user, host) and edges for actions ('Enable Reversible Encryption', 'Change Password', 'Access LSA Secret'). An alert is triggered when a path representing this specific attack sequence is completed within a predefined time window, linking the setup to the payoff action."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]