[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by hiding files or directories? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.001",
        "name": "Hidden Files and Directories",
        "evidence": [
          {
            "description": "Execution of the 'attrib.exe' utility with the '+h' argument to programmatically set the hidden attribute on a file or directory.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule to search process creation command lines (Windows Event ID 4688) for the string 'attrib.exe' and arguments containing '+h'. Exclude known legitimate scripts or administrative tools by whitelisting parent processes (e.g., Configuration Manager client) or specific command line patterns used in software deployment.",
              "Statistical: For all 'attrib.exe +h' executions, calculate the historical frequency of execution per user and per host. Establish a baseline (e.g., 95th percentile) for this activity over a 30-day window. Flag any user or host whose execution count exceeds this baseline, which could indicate anomalous scripting or manual hiding of files.",
              "Machine Learning: Train a logistic regression classifier using features from the process creation event. Features should include: parent process name (e.g., 'explorer.exe', 'cmd.exe', 'WINWORD.EXE'), user context, time of day, and the directory path of the target file. The model will classify each 'attrib.exe +h' execution as either benign (e.g., part of a software installation in 'Program Files') or suspicious (e.g., executed by a Microsoft Office application in a user's 'AppData\\Local\\Temp' directory)."
            ]
          },
          {
            "description": "Execution of a PowerShell command, such as 'Set-ItemProperty' or direct attribute manipulation, to set the hidden attribute on a file or directory.",
            "data_sources": [
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Exchange Servers, Web Servers",
            "action": [
              "Symbolic: Using PowerShell script block logs (Windows Event ID 4104), search for commands containing the strings 'Set-ItemProperty' and '-Name IsHidden -Value $true', or the regex pattern '\\.Attributes\\s*=\\s*.*'Hidden''. Alert on any match not associated with known administrative scripts.",
              "Statistical: Calculate the Shannon entropy of PowerShell script blocks that set the hidden attribute. High entropy often indicates obfuscation or randomized file names. Establish a baseline entropy score for legitimate administrative scripts and flag any script block whose entropy score is a significant outlier (e.g., greater than 2 standard deviations from the mean).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from PowerShell commands that modify file attributes. Features can include the command length, presence of Base64-encoded strings, and the target directory. The goal is to group legitimate administrative scripts together and identify anomalous commands as outliers, which likely represent malicious activity."
            ]
          },
          {
            "description": "Creation or renaming of a file or directory on a Windows system where the name begins with a period ('.'), mimicking the Unix convention for hidden files.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User profile directories (e.g., 'C:\\Users\\<username>\\'), temporary directories ('%TEMP%'), web server root directories",
            "action": [
              "Symbolic: Search process command lines (Windows Event ID 4688) and file creation/renaming events (Windows Event ID 4663) for file paths containing a segment that starts with a dot (e.g., using regex for '\\\\.\\\\filename' or '\\\\foldername\\\\.'). Since this is highly unusual on Windows outside of specific developer tools, any match from an unexpected parent process should trigger an alert.",
              "Statistical: Create a stack count of parent processes that create dot-files. Establish a baseline of normal parent processes (e.g., 'git.exe', 'code.exe'). Any process outside this baseline (e.g., 'powershell.exe', 'mshta.exe', 'rundll32.exe') creating a dot-file is a high-confidence indicator of malicious activity.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., SARIMA) on the count of dot-file creations per hour across the enterprise. A sudden spike in the creation of these files, deviating from established daily or weekly patterns, could indicate a coordinated campaign spreading across the network and should be flagged for investigation."
            ]
          },
          {
            "description": "A process executes from a file with the hidden attribute and subsequently initiates an outbound network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (Firewall, Proxy), DNS servers, endpoint devices",
            "action": [
              "Symbolic: Join process creation events (Windows Event ID 4688) with network connection events (Windows Event ID 5156 or Zeek conn.log) on the Process ID and hostname. Trigger an alert if the process image path from Event 4688 is known to be hidden (by correlating with a prior attribute change event or matching a known hidden path) and it initiates a connection to an external IP address not on an allowlist.",
              "Statistical: For processes executing from hidden paths that make network connections, analyze the destination port in Zeek conn.log. Calculate the frequency distribution of destination ports for these processes. Flag connections to ports that are statistically rare for this type of activity (e.g., a process in a hidden temp folder connecting to port 22) compared to common ports like 80/443.",
              "Machine Learning: Use a graph-based analysis model. Create nodes for processes, files, and remote IP addresses, with edges representing 'executed from' and 'connected to'. Apply a 'hidden' attribute to file nodes based on prior events. Use a graph query to find all paths of 'File(hidden) <- Process -> IP(external)'. A supervised model can then score the risk of these paths based on features like the reputation of the destination IP, the prevalence of the file hash, and the parent process."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]