[
  {
    "information_requirement": "Is the adversary moving laterally through RDP session hijacking?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1563.002",
        "name": "RDP Hijacking",
        "evidence": [
          {
            "description": "A process creation event is recorded containing command-line arguments that exactly match known RDP hijacking tool signatures, such as those from Metasploit, Mimikatz, or other red team frameworks.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical infrastructure servers (e.g., Domain Controllers, database servers), bastion hosts or jump servers, and workstations of privileged users (e.g., system administrators, developers).",
            "action": [
              "Create a detection rule that triggers on process creation events (Windows Event ID 4688) where the `CommandLine` field contains exact string matches for known RDP hijacking commands (e.g., 'tscon.exe [0-9]+ /dest:[a-zA-Z0-9]+', 'rundll32.exe tsclient.dll,Shadow', or specific argument patterns from public adversary tools).",
              "For all `tscon.exe` executions, calculate the historical frequency of execution per user and host. Flag any execution by a non-administrative user or on a host where `tscon.exe` has never been seen before (first occurrence). Also, calculate the entropy of parent processes for `tscon.exe`; a high-entropy or unusual parent process (e.g., `powershell.exe`, `wscript.exe`) is anomalous and should increase the event's risk score.",
              "Train a classification model (e.g., a Random Forest or Gradient Boosting) on process command-line arguments, using features like argument count, presence of numeric session IDs, and n-grams from the command line string. Label known benign administrative scripts and known malicious tool signatures to classify new `tscon.exe` executions as either 'benign-admin-activity' or 'suspicious-hijack-attempt'."
            ]
          },
          {
            "description": "A process creation event for `tscon.exe` with a numeric session ID argument is observed on a host within a short time window (e.g., < 5 minutes) following a process creation event for `quser.exe` or `query.exe session` on the same host.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical infrastructure servers (e.g., Domain Controllers, database servers), bastion hosts or jump servers, and workstations of privileged users (e.g., system administrators, developers).",
            "action": [
              "Implement a correlation rule that triggers when a process creation event for `quser.exe` or `query.exe` (with 'session' or 'user' arguments) is followed by a `tscon.exe` execution on the same host by the same user within a 5-minute window. The rule must validate that the `tscon.exe` command line contains a numeric argument.",
              "Analyze process sequences on each host. Calculate the conditional probability of the transition from `quser.exe` to `tscon.exe`. Identify host-user pairs where this transition probability significantly exceeds the 99th percentile of all observed two-step process transitions on the network, indicating an unusually strong and potentially scripted sequence of actions.",
              "Use a sequence modeling algorithm (e.g., a Hidden Markov Model or LSTM) trained on sequences of process creation events per user session. The model should learn normal administrative workflows. Flag any session sequence that has a low probability score under the trained model, particularly sequences containing the `quser`/`query` -> `tscon` pattern."
            ]
          },
          {
            "description": "An RDP session, identified by its unique LogonId, is disconnected (Event ID 4779) and is immediately reconnected by a different user or from a new source IP address (Event ID 4778), indicating a session takeover.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4779",
              "Windows Event ID 4634",
              "Windows Event ID 4778",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, authentication servers, and remote access gateways (e.g., RDP gateways).",
            "action": [
              "Create a rule that joins Windows Event ID 4779 (disconnect) with Event ID 4778 (reconnect) on the `TargetLogonId`. Trigger an alert if the `AccountName` or `ClientAddress` in the reconnect event does not match the original session's user or source address. Also, correlate `LogonId` from logon events (4624, Type 10) with Zeek `conn.log` records to find new source IPs connecting to the RDP port (3389) that are associated with an existing, active `LogonId` without a new preceding 4624 event.",
              "For each `LogonId` associated with an RDP session, maintain a stateful record of the source IP address. Calculate the number of distinct source IPs associated with a single `LogonId` over its lifetime. Flag sessions where this count is greater than 1, as a session should not typically migrate between source IPs. This is a low-frequency event that is highly suspicious.",
              "Develop a time-series anomaly detection model on the RDP session event stream for each host (logon, logoff, disconnect, reconnect). The model should learn normal session durations and event sequences. An alert should be generated for an anomalous sequence, such as a logoff/disconnect followed by an immediate reconnect from a different user or IP, which deviates from the learned temporal patterns."
            ]
          },
          {
            "description": "Anomalous process execution or network activity originates from an established RDP session (linked by `LogonId`) that deviates from the user's historical baseline, particularly when the activity is characteristic of lateral movement (e.g., `psexec`, `wmic`, `powershell remoting`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices of high-value targets, critical servers, and network segments containing sensitive data.",
            "action": [
              "For every process creation event (4688) occurring within an RDP session (Logon Type 10), check if the process name or command line matches a watchlist of dual-use or lateral movement tools (e.g., `psexec.exe`, `wmic.exe`, `at.exe`, `schtasks.exe`, `powershell.exe -enc`). If a match occurs, enrich the event with the user and source IP from the parent RDP session and escalate for review.",
              "For each user, build a statistical baseline of normal activity within RDP sessions. This includes the set of commonly executed processes and the distribution of destination ports/IPs for network connections (from Zeek `conn.log` linked by source IP). Use a scoring system to flag sessions where activity falls outside the user's 95th percentile baseline, such as executing a rare process or connecting to a new subnet for the first time.",
              "Employ an unsupervised learning model (e.g., Isolation Forest or One-Class SVM) on features extracted from RDP session activity. Features should include process execution frequency vectors, network connection properties (bytes sent/received, protocols, destination prevalence), and command-line argument patterns. The model will identify sessions that are outliers from the general population of RDP sessions, indicating potentially hijacked or malicious use."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]