[
  {
    "information_requirement": "(PIR) Has the adversary exfiltrated sensitive data using cloud storage services?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567.002",
        "name": "Exfiltration to Cloud Storage",
        "evidence": [
          {
            "description": "A network connection from an internal host to a domain or IP address that is present on a threat intelligence list of known malicious infrastructure or is an unsanctioned cloud storage provider.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway / Egress Points",
            "action": [
              "Symbolic: Continuously join destination IP addresses from Zeek conn.log and Server Name Indication (SNI) values from Zeek ssl.log against a CTI feed of known malicious domains/IPs. Alert on any matches.",
              "Statistical: Profile the frequency of connections to all cloud storage provider domains across the enterprise. Alert on connections to domains that are statistically rare (e.g., <0.1% of all cloud connections) or have not been seen in the last 90 days.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from Zeek logs (SNI, JA3/JA3S hash, destination ASN, connection duration, data volume) to predict if a connection to a previously unknown cloud storage domain is malicious. The model would be trained on historical data labeled by CTI feeds."
            ]
          },
          {
            "description": "The execution of a command-line utility with syntax known for uploading data to cloud storage services, such as 'rclone copy' or 'curl --upload-file'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Production Servers",
            "action": [
              "Symbolic: Use regular expression matching on process command lines (Windows Event ID 4688) to detect known exfiltration tool syntax, such as 'rclone copy', 'aws s3 cp', 'curl -T', or PowerShell's 'Write-S3Object'.",
              "Statistical: Calculate the Shannon entropy of command-line arguments for processes making network connections. High-entropy arguments can indicate the presence of obfuscated scripts or long API keys used for unauthorized cloud access. Alert when entropy scores exceed a baseline established for normal commands (e.g., > 3 standard deviations from the mean).",
              "Machine Learning: Use an NLP model (e.g., TF-IDF vectorization followed by a one-class SVM) on command-line logs to identify anomalous command structures that deviate from a learned baseline of normal administrative and user activity. This can detect novel or obfuscated variations of exfiltration commands."
            ]
          },
          {
            "description": "The creation of a large compressed file (e.g., .zip, .rar, .7z) on a host, immediately followed by a high-volume data upload from that same host to a cloud storage provider within a 15-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Asset Subnets, File Servers",
            "action": [
              "Symbolic: Create a stateful rule that triggers when a process creation event for an archiving utility (e.g., 7z.exe, WinRAR.exe, zip.exe) is followed within 15 minutes by an outbound network connection from the same host to a cloud provider IP with sent bytes greater than 100MB.",
              "Statistical: For each host, calculate the baseline probability of a large upload event occurring within 15 minutes of a file archiving event. If the observed conditional probability for a host is a statistical outlier compared to its own history or its peer group (e.g., top 5%), flag it for review.",
              "Machine Learning: Model the sequence of events (archive process execution, large file creation, outbound connection) as a state transition graph. Use an anomaly detection algorithm to find rare sequences, such as 'archive -> large upload to a new or rare cloud destination'."
            ]
          },
          {
            "description": "An internal host exhibiting an anomalously large data upload volume or a highly asymmetric network traffic ratio (bytes sent >> bytes received) when communicating with a known cloud storage provider domain.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway / Egress Points, Enterprise DNS Resolvers",
            "action": [
              "Symbolic: Create a rule to alert on any single connection to a cloud storage provider where the total bytes sent ('orig_bytes' in Zeek conn.log) exceeds a hard threshold, such as 1 GB.",
              "Statistical: For each internal host, establish a daily baseline of bytes sent to cloud storage domains. Alert if a host's daily upload volume exceeds the 99th percentile of its own 30-day historical distribution. Also, calculate the sent-to-received byte ratio for each connection and alert if the ratio exceeds a high threshold (e.g., > 100:1) for a significant data volume.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) for each host's hourly upload volume to cloud storage providers. An alert is generated when the actual observed volume significantly exceeds the forecasted volume's confidence interval, indicating a break from established behavior."
            ]
          },
          {
            "description": "A data upload to a cloud storage service is initiated by a non-interactive process, a system account (e.g., NT AUTHORITY\\SYSTEM), or an application not typically associated with user-driven file sharing (e.g., a web server process).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Production Servers, User Workstations",
            "action": [
              "Symbolic: Create a watchlist of system accounts (e.g., NT AUTHORITY\\SYSTEM, LOCAL SERVICE) and server application processes (e.g., svchost.exe, sqlserver.exe, w3wp.exe). Alert if a process creation event (Windows Event ID 4688) from this list is correlated with an outbound connection to a cloud storage provider (from Zeek conn.log).",
              "Statistical: Profile legitimate process-to-destination cloud pairings. Use frequency analysis to identify and alert on rare pairings. For example, if 'powershell.exe' on a web server connects to 'dropbox.com' for the first time, this is a high-confidence indicator.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on a dataset of connection events including features like process name, user account, destination domain, and data volume. Benign activity will form dense clusters, while malicious, anomalous uploads initiated by system processes will be flagged as noise or outliers."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]