[
  {
    "information_requirement": "Has the adversary disabled or modified cloud logging to evade detection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.008",
        "name": "Disable or Modify Cloud Logs",
        "evidence": [
          {
            "description": "A network connection recorded in Zeek conn.log where the source IP is present on a threat intelligence feed of known malicious actors and the destination IP belongs to a known cloud provider's API endpoint range.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway and network egress points",
            "action": [
              "Symbolic Logic: Join Zeek conn.log records with a threat intelligence feed of known malicious IPs. Alert if a source IP from the feed connects to a destination IP within the published IP ranges for AWS, Azure, or GCP API endpoints.",
              "Statistical Method: For all connections to cloud API endpoints, calculate the frequency of each source country and ASN over a 30-day baseline. Flag any connection originating from a country or ASN that is in the bottom 5th percentile of frequency (i.e., extremely rare) for that specific API endpoint.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on enriched Zeek conn.log data. Use features like source ASN, geographic location, time of day, connection duration, and threat intel score to predict the likelihood that a connection to a cloud API endpoint is malicious. Alert on high-probability predictions."
            ]
          },
          {
            "description": "An HTTP request URI or TLS SNI value containing strings explicitly related to disabling logging, such as 'DeleteTrail', 'StopLogging', 'UpdateSink', or 'diagnostic-settings/delete', directed at a cloud provider's management endpoint.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and proxy servers",
            "action": [
              "Symbolic Logic: Create a detection rule that uses regular expressions to search Zeek http.log URIs and Zeek ssl.log SNI fields for exact API call names related to disabling logs (e.g., /(DeleteTrail|StopLogging|UpdateTrail|diagnostic-settings.delete|projects.sinks.update)/i). Generate a high-severity alert on any match.",
              "Statistical Method: For all observed cloud API calls, calculate a baseline frequency for each call per user role. Use entropy scoring on the sequence of API calls within a single session. A sudden, low-entropy sequence containing a rare logging-modification API call should be flagged as suspicious.",
              "Machine Learning: Develop a sequence-based anomaly detection model (e.g., using an LSTM Autoencoder) trained on normal sequences of API calls per user role. Feed real-time API call sequences into the model. A high reconstruction error indicates a deviation from normal behavior, such as an adversary inserting a 'DeleteTrail' call into an otherwise standard administrative workflow."
            ]
          },
          {
            "description": "A sustained drop in the volume of incoming logs from a specific cloud data source (e.g., AWS CloudTrail) that exceeds 3 standard deviations below the 30-day rolling average for that time of day, and is not correlated with a scheduled maintenance window.",
            "data_sources": [
              "SIEM internal performance logs",
              "Log forwarder status logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM/Log aggregation platform",
            "action": [
              "Symbolic Logic: Create a 'heartbeat' rule that expects at least one log from each critical cloud source (e.g., CloudTrail, Azure Activity Logs) every 15 minutes. If no log is received within the time window and it's outside a known maintenance period, trigger an alert for a potential outage or tampering.",
              "Statistical Method: For each cloud log source, calculate a 30-day rolling average and standard deviation of log volume per hour. Generate an alert if the current hour's volume drops more than 3 standard deviations below the average for that hour and day of the week for a sustained period (e.g., 3 consecutive intervals).",
              "Machine Learning: Implement a time series forecasting model (e.g., Prophet) for each cloud log source's data volume. The model will predict the expected log volume and a confidence interval for the next hour. Generate an alert if the actual volume falls significantly below the model's prediction confidence interval."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a cloud CLI tool (e.g., aws.exe, az.cmd) with arguments related to logging, originating from a user or host not in the 'Cloud Administrators' group, immediately followed by a network connection (Zeek conn.log) from that host to a cloud API endpoint within 5 minutes.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, developer endpoints, and CI/CD servers",
            "action": [
              "Symbolic Logic: Create a correlation rule that triggers when a Windows Event ID 4688 shows a process (e.g., aws.exe, az.cmd) with a command line containing 'delete-trail' or 'stop-logging' AND the executing user is not a member of the 'Cloud Admins' Active Directory group. Correlate with Zeek conn.log to confirm outbound connection to cloud IPs.",
              "Statistical Method: Profile the command-line arguments used with cloud CLIs for each user. Calculate the rarity of each command/argument pair. A user executing a command that is in the bottom 5th percentile of frequency for their role (e.g., a developer using 'az monitor diagnostic-settings delete') should be flagged for review.",
              "Machine Learning: Use a peer group analysis model. Cluster users based on their command-line activity (e.g., using TF-IDF on commands and arguments). Flag a user as an outlier if they execute a log-modification command that is common for a different cluster (e.g., 'Cloud Admins') but highly anomalous for their own cluster (e.g., 'Marketing Users')."
            ]
          },
          {
            "description": "A confirmed log modification alert (e.g., for 'DeleteTrail') followed by a high-risk activity alert from a non-cloud data source (e.g., endpoint or network sensor) related to the same asset, such as a new process creation (Windows Event ID 4688) or anomalous data transfer (Zeek conn.log), within a 60-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "SIEM Alerts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM alert database and high-value asset endpoints",
            "action": [
              "Symbolic Logic: Create a meta-alert rule. If an alert for 'Cloud Log Tampering' fires for a specific user/asset, automatically increase the risk score of all subsequent alerts from that same user/asset for the next 24 hours. A second high-severity alert within this window escalates the incident to a higher tier.",
              "Statistical Method: Upon detecting a log modification event, initiate a focused statistical analysis on the associated user/asset. Compare their network traffic volume (bytes_out in Zeek conn.log) and process creation count (Windows Event ID 4688) in the hour after the event to their historical hourly baseline. A spike exceeding the 99th percentile indicates likely follow-on activity.",
              "Machine Learning: Implement a graph-based analysis model where nodes are assets (users, hosts) and edges are activities (logins, API calls). When a 'log tampering' edge is added, the model should re-evaluate the risk of connected nodes and predict the most likely next-hop in an attack path (e.g., 'IAM Role Creation' or 'S3 Bucket Access') to direct proactive threat hunting efforts."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]