[
  {
    "information_requirement": "Has the adversary manipulated data in transit to compromise its integrity? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1565.002",
        "name": "Transmitted Data Manipulation",
        "evidence": [
          {
            "description": "Network traffic between sensitive internal systems (e.g., payment processors, database servers) and their clients is routed through an external IP address associated with known malicious proxies, anonymizers, or man-in-the-middle (MitM) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Core network switches, DNS servers, DMZ",
            "action": [
              "Symbolic: Continuously join destination IPs from Zeek conn.log against a high-confidence threat intelligence feed of known malicious proxy/MitM IPs. Generate a high-priority alert for any successful connection from a critical internal asset to a matched IP.",
              "Statistical: For each critical internal asset, profile its typical external communication destinations over a 30-day baseline. Calculate the rarity of each destination IP/ASN. Generate a medium-priority alert if a connection is made to a destination in the bottom 5th percentile of frequency.",
              "Machine Learning: Train a classification model (e.g., logistic regression) using features from Zeek conn.log (duration, service, originator bytes, responder bytes) and IP context (is it a known threat, ASN, geolocation) to assign a risk score to each connection. Alert when the score exceeds a dynamically tuned threshold, indicating a high probability of malicious redirection."
            ]
          },
          {
            "description": "SSL/TLS connections for internal or critical services present anomalous certificate attributes, such as a different issuer than expected, a self-signed certificate where a trusted CA is standard, or JA3/JA3S hashes matching known MitM tools.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application servers, Load balancers, VPN concentrators, Web proxies",
            "action": [
              "Symbolic: Maintain a watchlist of certificate fingerprints, issuers, and JA3/JA3S hashes associated with MitM tools (e.g., Burp Suite, Fiddler, mitmproxy). Scan Zeek ssl.log and x509.log in real-time and alert on any match.",
              "Statistical: For each critical service, establish a baseline of its normal SSL/TLS certificate attributes (issuer, subject, public key algorithm, validation status). Alert if a new connection presents a certificate with attributes that deviate from this established baseline (e.g., a new, previously unseen issuer).",
              "Machine Learning: Use clustering algorithms (e.g., DBSCAN) on vectors derived from Zeek ssl.log and x509.log features (cipher suite, certificate validity period, issuer, subject). Identify and alert on outlier clusters that do not conform to the dominant, legitimate traffic patterns, as these may represent intercepted sessions."
            ]
          },
          {
            "description": "An unauthorized process accesses the memory of or injects a thread into a critical application responsible for data transmission (e.g., database client, file transfer utility, financial transaction software) immediately before a network connection is initiated.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 8",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical application servers (e.g., financial, ERP), Database servers, Developer workstations with access to sensitive data repositories",
            "action": [
              "Symbolic: Create a detection rule that triggers when a Sysmon Event ID 10 (ProcessAccess) from a non-standard source process (e.g., powershell.exe) targets a critical application (e.g., `saplogon.exe`) with access rights allowing memory modification (e.g., `0x1F0FFF`), followed within seconds by a network connection from the target process.",
              "Statistical: Profile the baseline of processes that normally access the memory of critical applications using Sysmon Event ID 10. Calculate the frequency of each source/target/access-mask combination. Alert when a combination is observed that falls outside the 99th percentile of normalcy.",
              "Machine Learning: Train a sequence-based model on event logs to learn normal chains of events (e.g., process A starts, accesses process B, process B makes network connection). An alert is triggered when a new sequence of events deviates significantly from learned legitimate sequences, indicating anomalous process interaction prior to data transmission."
            ]
          },
          {
            "description": "A sensitive data transfer exhibits a statistically significant deviation in network traffic characteristics (e.g., data volume, timing, protocol fields) compared to a historical baseline, suggesting unauthorized modification.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data center network fabric, Connections between application and database tiers, Primary and backup data replication links",
            "action": [
              "Symbolic: For critical API endpoints monitored in Zeek http.log, create a rule to alert if the `Content-Length` header in a POST request does not match the actual `resp_bytes` seen for the corresponding connection in Zeek conn.log.",
              "Statistical: For critical data flows (defined by source/destination IP/port pairs), model the typical distribution of `resp_bytes` in Zeek conn.log. Alert if a new connection's byte count is more than 3 standard deviations from the historical mean for that specific flow.",
              "Machine Learning: Apply a time series forecasting model (e.g., ARIMA) to the data volume (sum of `orig_bytes` + `resp_bytes`) per hour between a critical application and database server pair. Generate an alert if the observed volume significantly deviates from the forecasted confidence interval, which could indicate data injection or removal."
            ]
          },
          {
            "description": "A sharp, anomalous increase is observed in the rate of data integrity failures, such as transaction rollbacks in a database, hash mismatches on file transfers, or replication errors between systems.",
            "data_sources": [
              "Application Logs",
              "Zeek files.log",
              "Windows Event Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, Database servers logging transaction failures, Application servers processing data uploads",
            "action": [
              "Symbolic: Ingest application logs into a SIEM and create a high-severity alert for any log message containing specific error strings like 'Data Integrity Error', 'Transaction Rollback due to Mismatch', or 'Checksum validation failed'.",
              "Statistical: Monitor the count of integrity failure events from application logs over a 1-hour rolling window. Establish a baseline mean and standard deviation for this count. Alert if the current count exceeds the mean by more than 4 standard deviations.",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on a time series of integrity failure counts. This can identify subtle, non-linear increases in the error rate that may precede a larger-scale integrity attack and would be missed by simple statistical thresholds."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]