[
  {
    "information_requirement": "Is the adversary communicating with command and control infrastructure using non-standard ports? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1571",
        "name": "Non-Standard Port",
        "evidence": [
          {
            "description": "A successful TCP connection is established from an internal asset to an external IP address on a destination port not commonly used for egress traffic (e.g., not 80, 443, 53), and the destination IP is present on a high-confidence threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways and internet-facing proxies",
            "action": [
              "Symbolic: Filter Zeek conn.log for successful outbound connections (`conn_state`='SF') on ports other than 80, 443, 25, 53, 22. Join the destination IP (`id.resp_h`) with a threat intelligence list of known C2 servers. Generate an alert for every match.",
              "Statistical: For all connections on non-standard ports, calculate the frequency of each destination IP. Flag IPs that appear in the top 99th percentile of connection frequency but are not associated with known business partners or cloud services. This identifies potentially new or uncatalogued C2 infrastructure.",
              "Machine Learning: Develop a classification model (e.g., Logistic Regression, Random Forest) trained on labeled historical data (malicious/benign connections). Use features such as destination port, connection duration, bytes sent/received, and threat intel reputation score. Use the model to predict the probability of a new, non-standard port connection being malicious C2."
            ]
          },
          {
            "description": "A TLS session on a non-standard port uses a JA3/JA3S hash, SSL certificate subject/issuer, or X.509 certificate parameters (e.g., validity period, self-signed status) that match known fingerprints of malicious C2 frameworks (e.g., Cobalt Strike, Metasploit, Sliver).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways and TLS/SSL inspection points",
            "action": [
              "Symbolic: For connections on non-standard ports identified in conn.log, correlate with ssl.log and x509.log. Match the `ja3`, `ja3s`, certificate `issuer`, and `subject` fields against a curated list of indicators for known C2 frameworks. For HTTP-based C2, inspect http.log for anomalous User-Agent strings or URI patterns matching C2 signatures. Alert on any match.",
              "Statistical: Calculate the entropy of SSL certificate subject and issuer strings for all traffic on non-standard ports. Unusually high entropy can indicate domain generation algorithms (DGAs), while very low entropy (many certs with the same generic subject) can indicate default C2 configurations. Flag subjects/issuers in the top and bottom 5th percentile of entropy scores for review.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means, DBSCAN) on features extracted from ssl.log and x509.log for non-standard port traffic. Features can include certificate validity duration, public key length, signature algorithm, and JA3 hash. Analyze the resulting clusters to identify groups of connections exhibiting similar, anomalous characteristics that represent a coordinated C2 campaign."
            ]
          },
          {
            "description": "The application-layer protocol dynamically identified by a network sensor (e.g., Zeek's `service` field) for traffic on a specific destination port does not align with the IANA-registered service for that port (e.g., 'ssl' on port 80, 'http' on port 443, or 'ssh' on port 53).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (East-West traffic) and egress network gateways (North-South traffic)",
            "action": [
              "Symbolic: Create a detection rule that queries Zeek conn.log and alerts when the `service` field does not match the expected protocol for the `id.resp_p` (destination port). For example, alert if (`id.resp_p` = 53 AND `service` != 'dns') OR (`id.resp_p` = 80 AND `service` != 'http') OR (`id.resp_p` = 443 AND `service` != 'ssl').",
              "Statistical: For each internal host, calculate the ratio of mismatched protocol-port connections to total connections over a rolling 24-hour window. Establish a baseline mean and standard deviation for this ratio across all hosts. Flag any host whose mismatch ratio exceeds 3 standard deviations above the mean, indicating potential C2 tunneling or evasion.",
              "Machine Learning: Implement a time series anomaly detection model (e.g., ARIMA, LSTM) on the count of protocol-port mismatch events per hour for the entire network. The model will learn the normal rhythm of such events and alert on statistically significant spikes that deviate from the forecasted pattern."
            ]
          },
          {
            "description": "A process on a Windows host (e.g., powershell.exe, rundll32.exe, a non-browser application) initiates an outbound network connection on a destination port that has never been used by that process image name or its parent process before.",
            "data_sources": [
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, application servers, and Domain Controllers",
            "action": [
              "Symbolic: Join Windows Event ID 5156 (`Application` field for process path) with Event ID 4688 (`New Process Name` and `Creator Process Name`) on Process ID. Create a rule to alert when a process not typically associated with network activity (e.g., regsvr32.exe, mshta.exe) initiates any outbound network connection.",
              "Statistical: For each process image name (e.g., `svchost.exe`), build a historical baseline of legitimate destination ports it communicates with. Use a set-based approach to identify first-seen process-port pairings. Calculate the rarity of each port across the enterprise. A process using a port in the bottom 1st percentile of prevalence should receive a higher risk score.",
              "Machine Learning: Train a One-Class SVM (Support Vector Machine) model on baseline data of normal {process name, destination port, parent process} tuples. This model learns the boundary of normal behavior. During inference, any new connection that falls outside this learned boundary is classified as an anomaly, indicating a potentially malicious process-port relationship."
            ]
          },
          {
            "description": "An outbound connection on a non-standard port exhibits a combination of anomalous characteristics, such as a periodic, low-volume 'heartbeat' pattern; a high byte-entropy value indicating encrypted or packed data; an unusually long session duration; or a highly asymmetric data flow.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways and internal network core switches",
            "action": [
              "Symbolic: Monitor Zeek `weird.log` for events like `active_connection_without_data`, `data_before_established`, or `inappropriate_fin` that are correlated by UID with connections on non-standard ports in `conn.log`. An alert on these specific protocol violations provides high-fidelity evidence of malformed traffic.",
              "Statistical: For each long-lived connection (`duration` > 1 hour) on a non-standard port, analyze the inter-arrival time of packets. Calculate the standard deviation of these times. A very low standard deviation suggests a machine-generated, periodic heartbeat characteristic of C2. Flag connections where the standard deviation of inter-arrival times is below a tuned threshold (e.g., < 1 second).",
              "Machine Learning: Use a time series analysis on the `orig_bytes` and `resp_bytes` fields from Zeek conn.log for connections on non-standard ports. An autoencoder neural network can be trained on patterns of normal traffic flow. The model's reconstruction error will be low for normal traffic but high for anomalous patterns like C2 heartbeating or low-and-slow data exfiltration, triggering an alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]