[
  {
    "information_requirement": "Has an adversary established an encrypted Command and Control channel using asymmetric cryptography? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1573.002",
        "name": "Asymmetric Cryptography",
        "evidence": [
          {
            "description": "An outbound SSL/TLS connection is established with a destination IP, domain, certificate fingerprint, or JA3/JA3S hash that matches a high-confidence threat intelligence feed of known C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Symbolic (IOC Match): Join Zeek conn.log with ssl.log on the 'uid' field. Continuously compare the 'id.resp_h' (destination IP) from conn.log and the 'server_name' (SNI) from ssl.log against a threat intelligence feed of known malicious IPs and domains. Separately, compare the 'certificate.serial' and 'certificate.fingerprint' from x509.log and the 'ja3'/'ja3s' hashes from ssl.log against lists of known malicious indicators. Generate a high-priority alert on any match.",
              "Statistical (Frequency Analysis): For each external destination IP and SNI observed, calculate its prevalence across the entire organization over a 24-hour window. Flag any destination that is present in the threat intelligence feed but also has a very low internal prevalence (e.g., seen by < 5 hosts), indicating a targeted and non-widespread connection.",
              "Machine Learning (Classification): Train a supervised classification model (e.g., Random Forest) using labeled historical data where features include JA3/JA3S hash, certificate details (issuer, validity period), SNI, and destination IP/ASN. The model should predict the likelihood of a connection being malicious C2. Use this model to score new connections in real-time."
            ]
          },
          {
            "description": "An SSL/TLS connection uses a self-signed certificate, a certificate with generic subject fields (e.g., 'localhost', 'ACME'), or is established on a non-standard port for TLS (i.e., not 443, 8443, 993, 995).",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Network Segments",
            "action": [
              "Symbolic (Rule-Based): From Zeek x509.log, create a rule to alert when 'certificate.issuer' is identical to 'certificate.subject' (indicating self-signed). Create another rule to flag certificates where subject fields (e.g., 'CN', 'O') match a list of generic values. Correlate these alerts with Zeek conn.log to identify connections where 'service' is 'ssl' but 'id.resp_p' is not in a list of standard TLS ports.",
              "Statistical (Rarity Scoring): For each JA3/JA3S hash observed in ssl.log, calculate its frequency across the enterprise. Establish a rarity score (e.g., inverse of frequency). Create a composite risk score for each connection by combining the JA3 rarity score with flags for self-signed certificates and non-standard ports. Alert on connections exceeding a statistically determined risk threshold (e.g., 99th percentile of risk scores).",
              "Machine Learning (Clustering): Use an unsupervised clustering algorithm (e.g., DBSCAN) on features extracted from Zeek ssl.log and x509.log, such as certificate validity duration, public key length, JA3 hash, and SNI length. Analyze the resulting clusters to identify anomalous groups of connections that deviate from the large, dense clusters representing legitimate web traffic."
            ]
          },
          {
            "description": "An encrypted connection exhibits anomalous flow characteristics, such as a data upload-to-download ratio greater than 1, an unusually long duration, or highly periodic 'heartbeat' communication patterns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Symbolic (Threshold Alert): For each connection in Zeek conn.log where 'service' is 'ssl', calculate the ratio of 'orig_bytes' to 'resp_bytes'. Generate a low-priority alert if this ratio is greater than 1.0 and the connection duration exceeds a fixed threshold (e.g., 10 minutes), excluding known backup or file-sharing services.",
              "Statistical (Outlier Detection): For each internal host, establish a baseline of key connection metrics from Zeek conn.log over a 30-day period, including mean connection duration and byte ratios. Use a Z-score or Inter-Quartile Range (IQR) method to identify new connections where any of these metrics fall outside a normal range (e.g., Z-score > 3). Prioritize hosts with multiple outlier connections.",
              "Machine Learning (Time Series Analysis): For each source-destination IP pair, create a time series of connection start times. Apply a Fast Fourier Transform (FFT) or autocorrelation function to this time series to detect strong periodic signals (beaconing). Flag pairs that exhibit a consistent, repeating interval (e.g., every 60 seconds +/- 5 seconds) with low jitter, characteristic of automated C2 heartbeats."
            ]
          },
          {
            "description": "A process that is not a web browser or known network application (e.g., powershell.exe, wscript.exe, a process running from a temporary directory) initiates an outbound SSL/TLS connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstation Subnets",
            "action": [
              "Symbolic (Whitelist/Blacklist): Correlate Windows Event ID 5156 (Firewall connection) with Process Creation events (Event ID 4688) on the Process ID. Create a whitelist of approved application names (e.g., 'chrome.exe', 'firefox.exe', 'outlook.exe') permitted to make outbound SSL/TLS connections. Alert on any process not on this list that initiates a connection identified as SSL/TLS in Zeek conn.log.",
              "Statistical (Process Rarity): For each process name making an outbound encrypted connection, calculate its prevalence across all endpoints. Create a risk score based on the rarity of the process name (e.g., 1 / count(process_name)). Also, analyze parent-child process relationships from Event ID 4688. Flag relationships that are statistically rare (e.g., 'winword.exe' spawning 'powershell.exe'). Combine these scores to prioritize suspicious process activity.",
              "Machine Learning (Graph Analysis): Model process lineage (from Event ID 4688) and network connections (from Event ID 5156 and Zeek conn.log) as a graph. Use graph algorithms to identify anomalous nodes or subgraphs. A process node with a suspicious command line, spawned from an unusual parent, that connects to a rare external IP address would be flagged as a high-risk anomaly."
            ]
          },
          {
            "description": "A host generates DNS queries for subdomains with high character-level entropy, or a single host rapidly connects to a large number of unique external IP addresses over SSL/TLS within a short time frame.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers",
            "action": [
              "Symbolic (DGA Signature Match): Scan DNS query names in Zeek dns.log using a list of known DGA (Domain Generation Algorithm) regular expressions and patterns. If a query matches a pattern, correlate the resolved IP address with outbound connections in Zeek conn.log and ssl.log to confirm C2 activity.",
              "Statistical (Entropy and Uniqueness): For each base domain, calculate the Shannon entropy of its subdomains queried by internal hosts (from Zeek dns.log). Alert on domains where the subdomain entropy exceeds a high threshold (e.g., > 3.5), indicating potential DGA. Separately, for each internal host, count the number of unique destination IPs for SSL connections over a rolling 1-hour window. Flag hosts where this count exceeds a percentile-based threshold (e.g., 99th percentile).",
              "Machine Learning (Time Series Forecasting): For each internal host, create a time series of the number of new unique destination IPs it connects to per hour. Train a time series forecasting model (e.g., ARIMA or LSTM) on this data. Use the model to predict the expected number of new IPs for the next hour. If the actual count significantly exceeds the predicted value and its confidence interval, flag the host for anomalous 'domain fluxing' or 'IP rotation' behavior."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]