[
  {
    "information_requirement": "Is the adversary maintaining persistence using an unquoted service path?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1574.009",
        "name": "Path Interception by Unquoted Path",
        "evidence": [
          {
            "description": "An executable file is created in a directory (e.g., C:\\, C:\\Program Files) that is a parent to a legitimate service executable's location, where the filename could be misinterpreted by the OS due to an unquoted service path, leading to the service restarting and executing the new file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 7036",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application Servers, User Workstations, Core file system directories (e.g., C:\\, C:\\Program Files), Network Egress Points",
            "action": [
              "Symbolic: Create a correlation rule that chains events in a 10-minute window: 1. A file creation (Windows Event ID 4663) of an executable (e.g., Program.exe) in a vulnerable path (e.g., C:\\). 2. The associated legitimate service stops/starts (Windows Event ID 7036). 3. A new process is created (Windows Event ID 4688) matching the malicious executable's path and name. 4. The host of the new process initiates an outbound network connection (Zeek conn.log) to an IP on a threat intelligence feed.",
              "Statistical: For all executable file creations (Windows Event ID 4663) in top-level directories (e.g., C:\\, C:\\Program Files), calculate the entropy of the filename. Alert if a filename has unusually high entropy (e.g., 'd7fhg6s.exe') or a low-entropy name matching a directory name (e.g., 'Program.exe'), and the entropy score is in the >95th percentile for filenames historically observed in that directory.",
              "Machine Learning: Develop a time-series anomaly detection model for service behavior. Monitor event sequences for services with known unquoted paths. Flag a sequence as anomalous if a file creation (Windows Event ID 4663) in a vulnerable path is followed by a service stop/start cycle (Windows Event ID 7036) and a new process creation (Windows Event ID 4688) from that path within a short time window (e.g., 5 minutes), as this deviates from baseline service operation."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary escalated privileges from a low-privileged user to a high-privileged context using an unquoted service path?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1574.009",
        "name": "Path Interception by Unquoted Path",
        "evidence": [
          {
            "description": "A non-administrative user account creates an executable file in a directory that is a parent to a legitimate high-privilege service executable's location, followed by the service restarting and executing the new file under its elevated security context.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 7036",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Windows Registry on all hosts, Critical system directories (C:\\, C:\\Program Files)",
            "action": [
              "Symbolic: Create a rule that triggers when a file creation event (Windows Event ID 4663) has a SubjectUserName not in a predefined administrators group, the file is an executable, and the file path (e.g., C:\\Program.exe) could intercept a service known to run as NT AUTHORITY\\SYSTEM.",
              "Statistical: Monitor the delta between the privilege level of the user creating a file (from Windows Event ID 4663 SubjectUserName) and the user context of the process that subsequently executes it (from Windows Event ID 4688). A sequence of events resulting in a privilege delta from 'Standard User' to 'SYSTEM' for a file in a vulnerable path should be assigned a high risk score. Alert when this score exceeds a defined threshold.",
              "Machine Learning: Use a graph-based analysis model to detect privilege escalation chains. Create nodes for users, processes, and files, and edges for actions (e.g., 'created', 'executed by'). Train a model to recognize and alert on the specific graph pattern: [Low-Privilege User Node] -> 'created' -> [File Node in Vulnerable Path] -> 'executed by' -> [High-Privilege Process Node running as SYSTEM]."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to disable or bypass security controls by exploiting an unquoted service path of a security product?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1574.009",
        "name": "Path Interception by Unquoted Path",
        "evidence": [
          {
            "description": "A security service (e.g., EDR, AV) terminates unexpectedly or stops sending telemetry, immediately following the creation of an executable file in a directory that could intercept that service's unquoted path.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 7034",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Installation directories of all security tools (EDR, AV, SIEM agents), Service Control Manager logs on endpoints, Log aggregation platform (SIEM)",
            "action": [
              "Symbolic: Maintain a high-priority list of security product services with unquoted paths. Create a zero-tolerance rule: any executable file creation (Windows Event ID 4663) in a vulnerable parent directory for one of these services must generate a critical alert. Correlate this with a subsequent service stop (Event ID 7036) or crash (Event ID 7034) event for that same service.",
              "Statistical: Monitor the volume of logs received from each security agent in the SIEM. If the log volume for an agent drops below the 5th percentile of its rolling 24-hour average and this drop correlates within minutes to a file write event (Windows Event ID 4663) in that agent's vulnerable path on the source host, generate a high-severity alert.",
              "Machine Learning: Use an autoencoder model to learn the normal file state of directories containing security products. The model is trained on features like file counts, file types, and modification times. A significant reconstruction error, caused by the addition of a new, unexpected executable file in one of these protected directories, would trigger an anomaly alert for potential tampering."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]