[
  {
    "information_requirement": "Is an adversary leveraging compromised or purpose-built serverless infrastructure for command and control or data exfiltration against our network? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.007",
        "name": "Serverless",
        "evidence": [
          {
            "description": "An internal host establishes a network connection to a serverless URL, domain, or IP address present on a threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet egress points (e.g., firewalls, web proxies), Enterprise DNS resolvers",
            "action": [
              "Symbolic (IOC Match): Join network DNS logs (Zeek dns.log) and HTTP logs (Zeek http.log) against a threat intelligence feed of known malicious serverless domains and URLs. Alert on any matches found in the 'query' or 'host' fields.",
              "Statistical (Frequency Analysis): For all domains queried that match known serverless patterns (e.g., *.workers.dev, *.lambda-url.*.on.aws), calculate the frequency of requests per source host. Flag hosts whose request count to these domains falls into the 99th percentile, indicating unusually high interaction.",
              "Machine Learning (DGA Detection): Develop a DGA (Domain Generation Algorithm) detection model. Train a classifier (e.g., Random Forest, LSTM) on features extracted from domain names (entropy, n-gram frequency, character distribution). Apply this model to all queried serverless domains to identify and score algorithmically generated C2 domains."
            ]
          },
          {
            "description": "An outbound HTTP/S request to a known serverless provider domain contains a URI, query parameter, or User-Agent string that matches a known C2 framework signature.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet egress points (e.g., firewalls, web proxies), TLS/SSL inspection points",
            "action": [
              "Symbolic (Signature Match): Apply regular expression rules to Zeek http.log URI and User-Agent fields to detect patterns associated with C2 frameworks like Sliver or Covenant when using serverless redirectors. Additionally, match JA3/JA3S hashes from Zeek ssl.log against a known-bad list for C2 toolkits.",
              "Statistical (Entropy Analysis): For traffic to serverless domains, calculate the Shannon entropy of the URI path and query string. Establish a baseline of entropy scores for legitimate traffic. Flag requests where the entropy score exceeds 3 standard deviations from the mean, suggesting encoded or randomized data typical of C2 communications.",
              "Machine Learning (Request Classification): Train a supervised classification model (e.g., Support Vector Machine) to distinguish malicious from benign HTTP requests to serverless domains. Use features such as URI length, query parameter count, User-Agent string entropy, and presence of specific keywords. Use the trained model to score all new requests in real-time."
            ]
          },
          {
            "description": "An internal host sends repetitive, periodic outbound connections (beacons) to a serverless domain, characterized by consistent time intervals and/or consistent payload sizes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet egress points (e.g., firewalls, web proxies), Network tap or SPAN port monitoring Zeek sensors",
            "action": [
              "Symbolic (Threshold Rule): For each source-destination pair involving a serverless domain, create a rule that triggers if the connection count exceeds a simple threshold (e.g., >100 connections in an hour) and the payload size for each connection is within a narrow range (e.g., 50-250 bytes).",
              "Statistical (Jitter/Beacon Analysis): For each source host communicating with a serverless destination, calculate the standard deviation of the inter-arrival time between connections over a 24-hour window. A very low standard deviation (e.g., < 1 second for a 60-second beacon) indicates robotic, non-human beaconing activity. Also calculate the coefficient of variation for connection byte counts to identify low variance.",
              "Machine Learning (Time-Series Analysis): Apply a time series analysis model (e.g., Fourier Transform) to the connection timestamps for each source-destination pair. A strong peak in the frequency domain indicates a periodic signal (beacon). Use clustering algorithms (e.g., DBSCAN) on features like connection frequency, duration, and data volume to group and identify anomalous beaconing clusters."
            ]
          },
          {
            "description": "An outbound network connection to a serverless domain is initiated by a process that is not on an approved allowlist, is executing from a non-standard file path, or has a suspicious parent-child process relationship.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., Domain Controllers, database servers), User endpoint devices, SIEM or log aggregation platform",
            "action": [
              "Symbolic (Correlation Rule): Correlate network connection events (Windows Event ID 5156) to serverless domains with process creation events (Windows Event ID 4688). Alert if the 'Application' field in 5156 is an unauthorized process (e.g., not chrome.exe) or if the corresponding process in 4688 has a suspicious command line.",
              "Statistical (Rarity Analysis): Build a baseline of parent-process relationships for all processes that make network connections. Calculate the frequency of each (parent, child) pair that communicates with serverless domains. Flag rare or previously unseen pairs (e.g., 'winword.exe' spawning 'powershell.exe' which connects to a *.workers.dev domain) as high-risk anomalies.",
              "Machine Learning (Anomaly Detection): Use an anomaly detection algorithm (e.g., Isolation Forest) on enriched process execution data. Features should include process name, command-line entropy, parent process name, and a binary feature indicating if the process connects to a serverless domain. The model will learn normal behavior and score new events, flagging those that are highly anomalous."
            ]
          },
          {
            "description": "A host initiates an outbound connection to a serverless domain, and within a short time window, the same host begins internal discovery, lateral movement attempts, or data aggregation activities.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM or log aggregation platform, Domain Controllers (for auth logs), File servers (for access logs), User endpoint devices",
            "action": [
              "Symbolic (Sequence Rule): Create a SIEM correlation rule that triggers when Event A (outbound connection to a serverless domain from Host X) is followed within 5 minutes by Event B (e.g., execution of 'whoami', 'net user' from Host X via Event ID 4688) or Event C (failed logon attempt Type 3 from Host X to another internal host via Event ID 4624).",
              "Statistical (Behavioral Rate Spike): For hosts that communicate with serverless domains, monitor the rate of subsequent suspicious events (e.g., internal port scanning, failed authentications, file share access). Calculate a baseline rate for these events across all hosts. If a host's rate of these subsequent events spikes into the 99th percentile immediately after a serverless connection, flag it for investigation.",
              "Machine Learning (Attack Grammar): Model adversary behavior as a sequence of events. Use a sequence analysis model (e.g., Hidden Markov Model) where states represent adversary actions (C2, Discovery, Lateral Movement). Train the model on known attack sequences and apply it to streams of host and network events to calculate the probability that an observed sequence matches a malicious chain of events."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]