[
  {
    "information_requirement": "Is an adversary actively gathering information about our organization's domain properties for targeting? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.001",
        "name": "Domain Properties",
        "evidence": [
          {
            "description": "A DNS query for a corporate domain or a connection attempt to a public-facing corporate service originates from an external IP address present on a high-confidence threat intelligence feed of known reconnaissance scanners or malicious actors.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External DNS Servers, Network Egress/Ingress Points (Perimeter Firewalls)",
            "action": [
              "Symbolic: Cross-reference the source IP address (`id.orig_h`) in Zeek conn.log and dns.log against a threat intelligence list of known scanners or malicious IPs. Generate an alert for any match.",
              "Statistical: For IPs not on a threat list, calculate the historical connection frequency from their source ASN to sensitive ports (e.g., 25, 389, 443). Alert if a new connection from a rare or previously unseen ASN is observed.",
              "Machine Learning: Use a supervised classification model (e.g., Logistic Regression, Random Forest) trained on labeled historical data to predict the likelihood that a new, unseen IP is performing reconnaissance based on features like ASN, geolocation, and connection patterns."
            ]
          },
          {
            "description": "An HTTP/S request targeting a public-facing web server or cloud API contains a User-Agent string or URI pattern matching a known domain enumeration or reconnaissance tool signature (e.g., 'aquatone', 'ffuf', 'sublist3r').",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Cloud Service Endpoints (e.g., Office 365, Azure AD)",
            "action": [
              "Symbolic: Scan the `user_agent` and `uri` fields in Zeek http.log using a regularly updated list of regular expressions for reconnaissance tools. Alert on any match.",
              "Statistical: Calculate the Shannon entropy of the `uri` path components for requests from a single source IP over a 5-minute window. A high entropy score, exceeding the 99th percentile of the baseline for all sources, suggests automated scanning.",
              "Machine Learning: Develop a character-level NLP model to classify User-Agent strings as 'benign-browser', 'benign-bot', or 'malicious-tool'. Apply the model to incoming requests to flag suspicious activity that signature-based methods might miss."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) is logged for a common network reconnaissance utility (e.g., nslookup.exe, whois.exe, Resolve-DnsName) with command-line arguments targeting external domains, especially when executed by a non-interactive or service account.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Workstations, Member Servers",
            "action": [
              "Symbolic: Create a detection rule that alerts on the creation of processes like `nslookup.exe` or `whois.exe` when the parent process is not `cmd.exe`, `powershell.exe`, or `explorer.exe`, or when the executing user is a service account.",
              "Statistical: For each host, establish a baseline for the frequency of network utility executions. Alert when the daily execution count for `Resolve-DnsName` from a specific host exceeds 3 standard deviations above its 30-day moving average.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on process execution data, using features like process name, command-line length, parent process, and user context. Identify clusters of anomalous executions that deviate from normal administrative or user activity."
            ]
          },
          {
            "description": "A single external source IP address generates a statistically significant volume of DNS queries for subdomains, characterized by a high ratio of NXDOMAIN responses, over a short time period.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External DNS Servers",
            "action": [
              "Symbolic: For each source IP, trigger an alert if the count of DNS queries with an `NXDOMAIN` response code for the same second-level domain exceeds a hard threshold (e.g., 100 queries in 5 minutes).",
              "Statistical: For each external source IP, calculate the ratio of `NXDOMAIN` responses to total queries within a 1-minute window. Alert if this ratio exceeds the 98th percentile of the historical distribution for all external IPs. Additionally, calculate the Shannon entropy of the queried subdomains; a high query rate combined with high entropy is a strong indicator.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA) on the volume of DNS queries per source IP. Anomaly scores that coincide with high NXDOMAIN ratios should be flagged for investigation."
            ]
          },
          {
            "description": "An external source IP establishes connections to an unusually high number of distinct hosts or ports within the corporate network over a short time frame, targeting services like SMTP (25) or LDAP (389) that may be used for enumeration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek portscan.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points (Perimeter Firewalls), Public-facing Application Servers, Mail Servers",
            "action": [
              "Symbolic: Leverage Zeek's built-in portscan detection. Alert on any event logged in `portscan.log` originating from an external IP address.",
              "Statistical: From Zeek conn.log, group by source IP (`id.orig_h`) and count the distinct destination ports (`id.resp_p`) and destination hosts (`id.resp_h`) within a 10-minute window. Alert if the count of distinct ports or hosts exceeds 4 standard deviations above the mean for external traffic.",
              "Machine Learning: Use an unsupervised clustering model (e.g., K-Means) on connection metadata (source IP, destination port count, packet count, total bytes). Identify clusters representing 'scan' behavior (low bytes, high connection counts to many ports/hosts) versus 'normal' behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]