[
  {
    "information_requirement": "Is the adversary conducting reconnaissance by leveraging information from public scan databases?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.005",
        "name": "Scan Databases",
        "evidence": [
          {
            "description": "A pattern of inbound connection attempts (successful or blocked) where the source IP address is present on a threat intelligence feed specifically tracking internet-wide scanning services (e.g., Shodan, Censys) or known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing firewalls, web servers, and VPN concentrators.",
            "action": [
              "Symbolic: Correlate the `id.orig_h` (source IP) field in Zeek `conn.log` against a threat intelligence feed of known internet scanners and malicious IPs. Generate an alert for any matched IP address initiating a connection.",
              "Statistical: For each external-facing service, calculate the daily count of unique source IPs from known scanner subnets (as defined by threat intelligence). Alert if this count exceeds the 95th percentile of the daily historical baseline for that service, indicating an unusual level of targeted scanning from these sources.",
              "Machine Learning: Train a logistic regression classifier on historical `conn.log` data, using features like `id.orig_h`, `id.resp_p`, `proto`, `duration`, and a label indicating if the source IP was on a scanner list at the time. Use the trained model to predict the probability that a new, unseen inbound connection originates from a scanner, allowing for detection of previously unknown scanning infrastructure."
            ]
          },
          {
            "description": "Observed inbound HTTP/S requests containing URI paths, user-agent strings, or request body payloads that match signatures of tools (e.g., Nuclei, Metasploit) used to exploit vulnerabilities recently publicized and indexed by scan databases.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web applications, API gateways, and load balancers.",
            "action": [
              "Symbolic: Deploy and monitor signatures (e.g., Suricata rules) that detect specific user-agents, URI patterns, and payloads associated with common scanning/exploitation tools (e.g., `User-Agent: Nuclei`, `GET /?a=../../../../etc/passwd`). Correlate alerts with Zeek `http.log` for full request details.",
              "Statistical: For each web server, calculate the Shannon entropy of the URI path for all inbound requests from a single source IP within a 5-minute window. A sudden spike in entropy from an IP can indicate directory traversal or fuzzing attempts common in automated exploitation. Alert when entropy for a source IP exceeds 3 standard deviations above the mean entropy for all sources.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA or Prophet) on the frequency of specific vulnerability-related keywords (e.g., 'log4j', 'jndi', 'cve-2021-44228') appearing in `http.log` URIs and request bodies. An observed frequency that significantly deviates from the forecasted trend indicates a potential exploitation wave, possibly driven by scan database findings."
            ]
          },
          {
            "description": "A single external source IP establishes connections to a set of destination ports on internal hosts that has a high degree of overlap (>75%) with the ports listed for those hosts in a public scan database (e.g., Shodan), performed within a condensed timeframe.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter and DMZ, specifically monitoring traffic to all registered public IP addresses.",
            "action": [
              "Symbolic: Proactively query a scan database API for the organization's public IP space to create a 'known exposed ports' list. Create a rule that triggers if an external IP connects to >5 distinct ports on this list for a single host within 10 minutes.",
              "Statistical: For each external source IP, create a set of destination ports it connected to in a 10-minute window. Calculate the Jaccard similarity index between this set and the 'known exposed ports' set for the target host. Alert if the Jaccard index exceeds a threshold (e.g., 0.8), indicating the source IP is likely iterating through a pre-compiled list from a scan database.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on `conn.log` data, with features such as source IP, destination IP, and destination port. A small, dense cluster of connections from a single source IP to multiple ports on one or more internal hosts, where the port set is anomalous compared to normal traffic patterns, can identify targeted reconnaissance that mirrors scan database results."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of inbound connection attempts or authentication failures from multiple disparate IP addresses, targeting a specific service port, occurring within 24-48 hours of a network or firewall configuration change that exposed that service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory Domain Controllers), VPN gateways, Remote Desktop gateways, and change management logs for network devices.",
            "action": [
              "Symbolic: Integrate firewall change logs into the SIEM. Create a rule that, upon detection of a 'permit' rule change for a new service, initiates a 48-hour heightened monitoring period for that destination port. Alert on any connection attempts from IPs on a threat intelligence list during this window.",
              "Statistical: Establish a baseline of hourly connection counts and unique source IPs per destination port using historical `conn.log` data. Alert if the connection count for any port exceeds the 99th percentile of its historical baseline, especially if correlated with a recent configuration change.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the volume of traffic to each external-facing service port. The model will learn the normal daily and weekly traffic patterns and automatically flag significant, unexpected spikes in activity that could correspond to a service being discovered and targeted post-exposure."
            ]
          },
          {
            "description": "A high volume of failed authentication events (Windows Event ID 4625) against an external service where the attempted usernames follow a consistent, predictable pattern (e.g., `first.last`, `f.lastname`) and the source IP is external, indicating an adversary is using a list of potential users against a service discovered via scanning.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services such as Microsoft Exchange (OWA), RDP Gateways, and Active Directory Federation Services (ADFS).",
            "action": [
              "Symbolic: Create a detection rule that alerts when a single external source IP generates more than 20 failed login events (Windows Event ID 4625) across more than 5 different user accounts within 10 minutes against a single host.",
              "Statistical: For a given source IP, aggregate all failed login usernames from Event ID 4625 over a 1-hour window. If the number of unique usernames exceeds a threshold (e.g., 10), calculate the percentage of those usernames that match known employee name formats. Alert if this percentage is high (e.g., >80%), indicating a targeted guessing attack rather than a random brute-force.",
              "Machine Learning: Train a classifier to distinguish between legitimate failed logins and credential stuffing attacks. Features could include: rate of attempts from a source IP, number of distinct accounts targeted by the IP, time of day, and user-agent from associated web logs. A model can score each login attempt, and a high cumulative score from one IP would trigger an alert for a credential stuffing attack."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]