[
  {
    "information_requirement": "Is the adversary conducting reconnaissance to determine the organization's physical locations? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1591.001",
        "name": "Determine Physical Locations",
        "evidence": [
          {
            "description": "An external IP address, known to be associated with malicious or reconnaissance activity via threat intelligence, establishes a connection with a public-facing web server.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway firewalls, DMZ network segment, Public-facing web server logs",
            "action": [
              "Symbolic: Create a detection rule that continuously joins Zeek conn.log id.orig_h with a cyber threat intelligence (CTI) feed of known malicious IPs. Generate an alert for any match where id.resp_h is a registered public-facing asset and id.resp_p is a web port (e.g., 80, 443).",
              "Statistical: For all IPs that connect to public web servers, calculate the ratio of connections from known-bad CTI-flagged subnets vs. non-flagged subnets over a 24-hour window. A significant increase in this ratio above a 95th percentile baseline indicates a targeted campaign.",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on historical Zeek conn.log data. Features should include CTI flags, IP reputation scores, ASN information, and connection history. The model will classify each inbound connection as 'benign' or 'reconnaissance'."
            ]
          },
          {
            "description": "HTTP requests to public-facing servers contain User-Agent strings of known reconnaissance tools or exhibit automated, non-human browsing patterns, such as accessing location-related pages without fetching linked resources.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web application servers, Web application firewalls (WAFs), Reverse proxy servers",
            "action": [
              "Symbolic: Develop a signature-based rule to scan the user_agent field in Zeek http.log for strings associated with reconnaissance tools (e.g., 'sqlmap', 'nmap', 'Recon-ng', 'FOCA'). Alert on any match.",
              "Statistical: For each source IP, calculate the entropy of the uri field requested over a 5-minute window. A very low entropy score combined with a high request rate to pages like '/about', '/contact', or '/locations' suggests automated scanning. Flag IPs with entropy scores in the bottom 5th percentile and request counts in the top 5th percentile.",
              "Machine Learning: Implement a time series anomaly detection model (e.g., ARIMA or LSTM) on the request rate from individual source IPs. Train the model on baseline traffic. An alert is triggered when the model flags a sudden, sharp spike in requests that deviates significantly from the forecasted pattern, especially if those requests target location-specific URIs."
            ]
          },
          {
            "description": "An internal host generates a statistically anomalous volume or frequency of DNS queries and subsequent connections to external services related to geolocation, mapping, or public records.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Egress network traffic points, Proxy server logs",
            "action": [
              "Symbolic: Maintain a watchlist of domains related to mapping, real estate, and public records (e.g., 'google.com/maps', 'zillow.com', public record search portals). Create a rule to alert when an internal host makes more than 50 DNS queries for domains on this list within a 1-hour period.",
              "Statistical: For each internal host, establish a 30-day rolling baseline of daily data volume sent to the categorized location-related domains. Use a Z-score to detect anomalies. Flag any host where the daily data sent exceeds 3 standard deviations from its own baseline.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from internal host network behavior, such as total bytes sent, number of unique domains queried, and session duration. A small cluster of hosts exhibiting high activity towards location-related services, distinct from the large 'normal user' cluster, would be highly suspicious."
            ]
          },
          {
            "description": "A user account accesses an unusually high number of sensitive internal files or repositories containing physical location information, deviating from established individual and peer group baselines.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting Facilities, Security, or HR data, SharePoint sites for corporate planning, Domain Controllers for audit policies",
            "action": [
              "Symbolic: Tag sensitive files and folders containing keywords like 'blueprint', 'facility', 'address list', 'evacuation plan' and enable SACL auditing. Create a rule to trigger a high-severity alert if a user account accesses more than 3 of these tagged resources within a 10-minute window.",
              "Statistical: For each user, calculate a weekly baseline of access counts to the sensitive file share (Event ID 4663). Compare the user's daily activity against their own baseline and the baseline of their peer group (department). An alert is generated if a user's access count is in the 99th percentile for both their individual and group baselines.",
              "Machine Learning: Train a One-Class SVM (Support Vector Machine) model on 'normal' file access behavior for users who regularly access sensitive location data. This model creates a boundary around normal activity. Any access pattern (features: time of day, number of files, file types) that falls outside this boundary is flagged as a potential anomaly."
            ]
          },
          {
            "description": "A process, spawned from a non-standard parent (e.g., an Office application or script interpreter), is immediately followed by network connections to location-related websites or access to sensitive internal location files.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Critical application servers, Virtual Desktop Infrastructure (VDI) instances",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Event ID 4688) with a parent process of 'winword.exe', 'excel.exe', or 'powershell.exe' is followed within 60 seconds by a network connection from the same host to a domain on the location-reconnaissance watchlist (from Zeek conn.log) or a file access event (Event ID 4663) for a tagged sensitive location file.",
              "Statistical: Analyze process lineages from Event ID 4688. Calculate the rarity of a specific parent-child-network destination triad. A triad with a historically low probability of occurrence (e.g., less than 0.01%) should be flagged for investigation. For example, the sequence winword.exe -> cmd.exe -> maps.google.com would be statistically rare.",
              "Machine Learning: Use a graph-based analysis model where hosts, users, processes, and network destinations are nodes. Events (process creation, network connection) form the edges. An algorithm can identify anomalous subgraphs or paths, such as a short path from a newly created suspicious process to an external domain, which deviate from typical graph structures."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]