[
  {
    "information_requirement": "Is an adversary actively gathering information about our organization's host and device firmware?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1592.003",
        "name": "Firmware",
        "evidence": [
          {
            "description": "An inbound connection attempt from a source IP address listed in a threat intelligence feed as a known internet scanner (e.g., Shodan, Censys, ZoomEye) or a malicious reconnaissance actor.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway firewalls, DMZ network sensors, public-facing application servers.",
            "action": [
              "Symbolic: For all inbound connections in Zeek conn.log, correlate the id.orig_h (source IP) against a threat intelligence feed of known internet scanners and malicious IPs. Generate an alert for any match.",
              "Statistical: Aggregate connection attempts by source IP over a 24-hour window. Calculate the percentage of connections from each source IP that are flagged by the symbolic logic. Flag source IPs where this percentage exceeds a high threshold (e.g., 90th percentile of all flagged source IP ratios) to identify IPs predominantly used for scanning.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) using features from Zeek conn.log (protocol, service, duration, byte counts) and the threat intelligence label (scanner/malicious vs. benign). Use the model to score and classify new, unseen source IPs to proactively identify potential scanning behavior not yet on a static list."
            ]
          },
          {
            "description": "An HTTP/S request to an externally-facing service contains a User-Agent string or request path pattern associated with known reconnaissance or vulnerability scanning tools (e.g., Nmap, Nuclei, ZGrab).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers, API gateways, management interfaces for network appliances.",
            "action": [
              "Symbolic: Filter Zeek http.log for requests where the user_agent field matches a list of known scanner tool signatures (e.g., 'Nmap Scripting Engine', 'masscan', 'ZGrab'). Also, search for URI paths containing common firmware or version-related keywords (e.g., '/version.asp', '/firmware.bin', '/.git/config'). Alert on any match.",
              "Statistical: For each source IP, calculate the Shannon entropy of the User-Agent strings observed in Zeek http.log over a 1-hour window. A very low entropy score indicates the use of a single, repeated (potentially malicious) User-Agent. Flag IPs with entropy scores in the bottom 5th percentile.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from Zeek http.log requests, such as URI structure, header counts, and User-Agent strings. Identify and investigate clusters of anomalous requests that deviate from normal user traffic to find new scanning tools."
            ]
          },
          {
            "description": "A single external source IP establishes connections to a statistically anomalous number of unique destination hosts (horizontal scan) or unique destination ports on a single host (vertical scan) within a defined time period.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, network tap at the internet edge, cloud VPC flow logs.",
            "action": [
              "Symbolic: Define a rule to alert if a single source IP (id.orig_h) connects to more than 50 unique destination IPs (id.resp_h) or more than 100 unique destination ports (id.resp_p) within a 5-minute window.",
              "Statistical: For each source IP in Zeek conn.log, calculate the count of distinct destination ports and destination hosts over a rolling 1-hour window. Establish a baseline distribution for these counts across all source IPs. Flag any source IP where the distinct port or host count exceeds 3 standard deviations above the mean or the 99th percentile.",
              "Machine Learning: Apply time series analysis to the inter-arrival time (delta) between connection attempts from each source IP. Train an anomaly detection model (e.g., ARIMA) on the baseline of normal connection patterns. Use the model to detect 'low-and-slow' scanning, which would be flagged as a temporal anomaly."
            ]
          },
          {
            "description": "An external source IP makes repeated, targeted connection attempts to non-standard or management-related ports (e.g., 161/SNMP, 1900/UPnP, 623/IPMI) or generates protocol-specific events that indicate enumeration (e.g., SNMP get-request queries).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log",
              "Zeek snmp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments hosting IoT/OT devices, data center management networks, network appliance management interfaces.",
            "action": [
              "Symbolic: Create a watchlist of high-risk ports associated with firmware exposure (e.g., 161, 162, 1900, 623, 5000, 8080). Alert on any connection from an external IP to these ports in Zeek conn.log. Specifically monitor Zeek snmp.log for get-request commands targeting system description OIDs.",
              "Statistical: For each source IP, calculate the ratio of connections to high-risk ports versus connections to standard ports (e.g., 80, 443). Establish a baseline for this ratio. Flag source IPs where this ratio is a statistical outlier (e.g., exceeds the 98th percentile), indicating targeted enumeration.",
              "Machine Learning: Use Zeek weird.log as a source of anomalous protocol behavior. Train a classifier to distinguish between benign 'weird' events and those indicative of malicious enumeration (e.g., malformed packets for fingerprinting). Apply the model to live weird.log events to prioritize investigation."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]