[
  {
    "information_requirement": "Is the adversary attempting to use externally acquired access or credentials to compromise the organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1650",
        "name": "Acquire Access",
        "evidence": [
          {
            "description": "A successful or failed authentication event (Windows Event ID 4624 or 4625) involves a username that matches a list of known-compromised corporate credentials from a Cyber Threat Intelligence (CTI) feed.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN gateways, ADFS, M365/Entra ID), Domain Controllers, CTI feed aggregation platforms",
            "action": [
              "Symbolic: Create and maintain a watchlist of usernames sourced from CTI feeds that report on breached credentials. Join authentication logs (Windows Event IDs 4624, 4625) against this watchlist in real-time. Trigger a high-priority alert for any successful or failed authentication attempt involving an account on the watchlist.",
              "Statistical: For accounts on the CTI watchlist that successfully authenticate, calculate the rarity of the source IP address based on the user's historical login data over the last 90 days. If the IP's appearance frequency is below the 1st percentile (i.e., extremely rare for that user), escalate the alert severity for immediate review.",
              "Machine Learning: Train a supervised classification model (e.g., Logistic Regression) on labeled historical authentication data. Features should include source IP reputation, time of day, day of week, and a binary feature indicating if the account is on a known breach list. Use the model to predict the probability of each new login being malicious and alert on high-probability scores."
            ]
          },
          {
            "description": "A high rate of failed authentication events (Windows Event ID 4625) originates from a single source IP address, targeting a large number of distinct user accounts within a short time frame (e.g., >50 unique accounts from one IP in <5 minutes).",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, VPN concentrators, Web Application Firewalls (WAFs), Externally-facing authentication services",
            "action": [
              "Symbolic: From authentication failure logs (Windows Event ID 4625), group events by source IP in 5-minute windows. Trigger an alert if a single source IP generates failed logins for more than a predefined threshold of distinct accounts (e.g., 50).",
              "Statistical: For each source IP, calculate the Shannon entropy of the set of unique usernames targeted in failed login attempts over a 15-minute window. A high entropy score indicates a wide, non-targeted distribution of usernames. Alert when the entropy for a source IP exceeds 3 standard deviations above the rolling 24-hour average entropy for all sources.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA) to monitor the aggregate rate of failed logins (Windows Event ID 4625) per minute across the enterprise. Generate an alert when the observed failure rate significantly deviates from the forecasted rate, indicating a potential large-scale attack like credential stuffing."
            ]
          },
          {
            "description": "A successful authentication (Windows Event ID 4624) from an IP address whose properties (geolocation, ASN, ISP) are highly anomalous compared to the authenticating user's established historical baseline and are associated with high-risk network segments.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services, CTI data feeds, Geolocation databases, Network flow log collectors",
            "action": [
              "Symbolic: For each successful external login (Windows Event ID 4624), enrich the source IP from Zeek conn.log with CTI data. Trigger an immediate alert if the IP is tagged as a known TOR exit node, anonymous proxy, or a malicious C2 server.",
              "Statistical: For each user, maintain a historical baseline of login source countries and ASNs from the past 90 days. For each new successful login, calculate a rarity score based on its source attributes. If a user has never logged in from the observed country or ASN, assign a high score. An aggregate score exceeding the 98th percentile of all historical login scores for that user triggers an alert.",
              "Machine Learning: Develop an unsupervised anomaly detection model (e.g., Isolation Forest) for each user's login behavior, trained on features such as time-of-day (as sine/cosine transformations), day-of-week, source country, and source ASN. Use the model to flag any new login that it classifies as an outlier, indicating a significant deviation from the user's established pattern of life."
            ]
          },
          {
            "description": "A user account successfully authenticates (Windows Event ID 4624) for the first time after its credentials were published in a CTI-reported data breach, followed by high-risk post-authentication activity such as MFA device registration or privilege escalation within the same session.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4732",
              "Windows Event ID 4672",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, CTI data feeds, Privileged Access Management (PAM) systems, Certificate Authority servers",
            "action": [
              "Symbolic: Correlate successful login events (Windows Event ID 4624) with a CTI database of breached credentials and their exposure dates. Create a rule to alert on the first successful login for any account where the login timestamp is after the credential exposure date.",
              "Statistical: For a session initiated by a 'first use post-breach' account, establish a session risk score. Increment the score for each subsequent high-risk action (e.g., +10 for a new MFA registration, +20 for adding a user to a local admin group via Event ID 4732). If the session score exceeds a statistically determined threshold (e.g., 3 standard deviations above the user's mean session score), trigger a high-severity alert.",
              "Machine Learning: Use a sequence analysis model (e.g., an LSTM-based autoencoder) to learn normal sequences of user actions post-login. Feed the sequence of event IDs for a 'first use post-breach' session into the model. A high reconstruction error from the autoencoder indicates the sequence of actions is abnormal and potentially malicious, triggering an alert for security review."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]