[
  {
    "information_requirement": "Is an adversary capturing sensitive information from user screens on corporate mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1513",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "A mobile application not on the corporate allowlist is granted screen recording permissions (e.g., via MediaProjectionManager API), possesses internet access, and subsequently transmits more than 10MB of data to a destination IP with a low reputation score within a 24-hour period.",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM permission grant logs",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/EMM servers, managed mobile device endpoints, network data collection points (e.g., Zeek sensors at internet gateway), and internal DNS servers.",
            "action": [
              "Create a correlation rule that triggers when an MDM/EMM log shows a screen capture permission grant to an application not on the approved software allowlist, and that application also has the `android.permission.INTERNET` permission.",
              "For any application triggering the symbolic alert, query Zeek conn.log to profile its network behavior. Calculate the 98th percentile of daily outbound data volume (`orig_bytes`) over the preceding 30 days. Alert if the current 24-hour volume exceeds this threshold. Concurrently, analyze Zeek dns.log requests from the device and calculate the Shannon entropy of requested subdomains for a given parent domain using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. A sharp increase in entropy suggests potential DGA activity for C2.",
              "Ingest Zeek conn.log data associated with the alerted application into a pre-trained anomaly detection model, such as an Isolation Forest. Use features including connection duration, `orig_bytes`, `resp_bytes`, periodicity, destination port, and a categorical feature for the destination IP's reputation score. An application's network flow classified as an outlier with a high anomaly score within one hour of receiving screen recording permissions should be escalated for immediate investigation."
            ]
          },
          {
            "description": "An application not on a pre-approved allowlist is granted Android Accessibility Service privileges, and its subsequent network activity shows a deviation in outbound data volume greater than three standard deviations from its historical baseline.",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM security policy compliance logs",
              "Android logcat",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/EMM servers, central log aggregator (SIEM/Data Lake), and managed mobile device endpoints.",
            "action": [
              "Define and enforce a compliance policy in the MDM/EMM platform with an explicit allowlist of applications approved for Accessibility Service privileges (e.g., known password managers). Configure an automated high-severity alert to trigger for any device where an unlisted application is granted these services.",
              "For any device triggering the symbolic alert, query Zeek conn.log to compare the total outbound data volume (`orig_bytes`) in the 24 hours post-alert to the device's 30-day rolling average. Flag any increase greater than three standard deviations from the mean. Additionally, calculate the ratio of `orig_bytes` to `resp_bytes`; a ratio where outbound traffic is an order of magnitude greater than inbound is indicative of data exfiltration.",
              "For each managed device, implement a time-series forecasting model (e.g., ARIMA) on its hourly outbound data volume using Zeek conn.log. An actual data volume that significantly exceeds the model's 95% upper confidence interval constitutes a temporal anomaly. Correlate this network anomaly in the SIEM with an MDM alert for a newly enabled, non-allowlisted accessibility service on the same device within a 1-hour window to increase detection confidence."
            ]
          },
          {
            "description": "The execution of `screencap` or `screenrecord` command-line utilities is logged on a mobile endpoint, or unauthenticated network traffic is observed on TCP port 5555, characteristic of a remote Android Debug Bridge (adb) session.",
            "data_sources": [
              "Mobile EDR logs",
              "Android logcat",
              "Zeek conn.log",
              "Firewall logs",
              "MDM/EMM developer mode/USB debugging logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device endpoints with EDR/logging agents, network infrastructure (firewalls, IDS/IPS), and specific network segments designated for developer access.",
            "action": [
              "Create an IDS/firewall rule to block and alert on all inbound traffic to TCP port 5555 at the network perimeter, with exceptions only for authorized developer IP ranges. On Mobile EDR agents, create a detection rule to alert on any process execution of `screencap` or `screenrecord`.",
              "For allowed adb connections (TCP/5555), query Zeek conn.log to establish a baseline of normal developer session metrics. Flag sessions where the total data volume (`orig_bytes` + `resp_bytes`) exceeds the 95th percentile, or where session duration is more than two standard deviations above the mean. Monitor for automated beaconing by calculating the variance of time deltas between consecutive connections from the same source; a low variance suggests non-interactive, automated activity.",
              "Train a supervised classification model (e.g., Gradient Boosting) to distinguish between benign developer adb sessions and malicious sessions using features from Zeek conn.log such as `duration`, `orig_bytes`, `resp_bytes`, `history`, and `conn_state`. A session classified as 'malicious', particularly one originating from an IP not on the developer allowlist, should trigger a SOAR playbook to isolate the device from the network."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]