[
  {
    "information_requirement": "Is the adversary attempting to gain credential access via DHCP spoofing?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1557.003",
        "name": "DHCP Spoofing",
        "evidence": [
          {
            "description": "A DHCPv4 Offer/Ack or DHCPv6 Reply message assigns a client a configuration parameter (e.g., DNS server, default gateway) with an IP address present on a current, high-confidence threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek dhcp.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing client endpoints, Core network switch SPAN/TAP ports, DNS resolvers",
            "action": [
              "Join Zeek dhcp.log records (where msg_types is 'Offer' or 'Ack') against a threat intelligence feed of known malicious IPs. Alert if an IP address in the 'assigned_ip', 'dns_servers', or 'routers' fields matches the feed.",
              "For each subnet, build a historical frequency distribution of all IPs assigned as DNS servers or gateways over the last 90 days. Alert if a newly assigned DNS or gateway IP falls below the 1st percentile of frequency for its assigned subnet, indicating a statistically rare assignment.",
              "Train a supervised classification model (e.g., Random Forest) on labeled DHCP transactions. Features should include: IP reputation of assigned DNS/gateway, historical frequency of the offering server's MAC address, lease time offered, and whether the transaction is part of a race condition. Deploy the model to score new DHCP transactions and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A DHCP Offer or ACK message originates from an IP address not on the authoritative list of approved DHCP servers for a given network segment or VLAN.",
            "data_sources": [
              "Zeek dhcp.log",
              "Windows DHCP Server Audit Logs",
              "syslog"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DHCP Server Infrastructure, Core network switch SPAN/TAP ports, VLAN interfaces on routers and switches, Network Access Control (NAC) logs",
            "action": [
              "Maintain an allow list of authorized DHCP server IP addresses ('server_addr') for each VLAN/subnet. Ingest Zeek dhcp.log and create a rule that alerts on any DHCP 'Offer' or 'Ack' message where the 'server_addr' is not on the allow list for the client's source subnet.",
              "For each network segment, create a time-series baseline of DHCP 'Offer' counts per source server IP ('server_addr'). Alert if a new, previously unseen server IP appears and generates offers, or if a known server's offer volume exceeds 3 standard deviations from its hourly/daily baseline.",
              "Apply a clustering algorithm (e.g., DBSCAN) to active DHCP servers, using features such as IP address, MAC address vendor OUI (if available from packet captures), subnets served, and typical lease times offered. A rogue server will likely be identified as a noise point or form a new, distinct singleton cluster, triggering an alert."
            ]
          },
          {
            "description": "A single DHCP transaction ID ('trans_id'), associated with a single client MAC address, receives DHCP Offer messages from more than one unique server IP address within a short time window (e.g., 2 seconds).",
            "data_sources": [
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint subnets, Core network switch SPAN/TAP ports",
            "action": [
              "Group Zeek dhcp.log events by 'trans_id' over a 2-second sliding window. Create a rule to alert if any 'trans_id' has a distinct count of 'server_addr' greater than 1 in the 'Offer' messages. The alert must contain the client MAC, transaction ID, and all offering server IPs.",
              "Calculate the network-wide frequency distribution of the number of unique server offers per transaction ID. The vast majority of transactions will have exactly one offer. Alert on any transaction ID where the count of unique offering servers exceeds the 99.9th percentile of this distribution.",
              "Model the rate of 'multi-offer transactions' (transactions with >1 offering server) per minute across the network using a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD). A sudden spike in this rate, flagged as an anomaly, indicates a new rogue server is actively competing with legitimate ones."
            ]
          },
          {
            "description": "An authoritative DHCP server logs a high rate of error events indicating IP address pool exhaustion, such as Windows Event ID 1020, 1063, or 'dhcpd: DHCPDISCOVER... no free leases' in syslog for ISC DHCP.",
            "data_sources": [
              "Windows Event ID 1020",
              "Windows Event ID 1063",
              "Zeek dhcp.log",
              "syslog"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DHCP servers",
            "action": [
              "Create a high-severity alert rule that triggers on the presence of Windows DHCP Event ID 1020 ('Scope is full') or 1063 ('DHCP Service is low on available addresses'), or on syslog messages from ISC DHCP servers containing the string 'no free leases'.",
              "For each subnet, baseline the hourly rate of DHCP 'Discover' messages ('msg_types' in Zeek dhcp.log) using a 30-day moving average. Alert if the current rate exceeds the baseline by 5 standard deviations, which may indicate a DHCP starvation attack in progress.",
              "Ingest DHCP server scope statistics (e.g., via PowerShell 'Get-DhcpServerv4ScopeStatistics' or parsing the ISC 'dhcpd.leases' file). Use a time-series forecasting model (e.g., Prophet, ARIMA) to predict the expected number of available IPs for each scope. Alert when the actual number of available addresses drops significantly below the forecasted value's confidence interval."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to collect data as a result of successful DHCP spoofing?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1557.003",
        "name": "DHCP Spoofing",
        "evidence": [
          {
            "description": "A client initiates a network connection to a destination IP or resolves a domain name present on a threat intelligence feed within a short time window (e.g., 15 minutes) following the receipt of a new DHCP lease.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek dhcp.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, Endpoint subnets",
            "action": [
              "Correlate Zeek dhcp.log 'Ack' messages with subsequent Zeek conn.log and dns.log events from the same client IP ('id.orig_h'). Alert if, within 15 minutes of the DHCP event, the client connects to a destination IP ('id.resp_h') or resolves a domain ('query') that matches a high-confidence threat intelligence feed.",
              "For each client IP, upon receiving a new DHCP lease, compare the set of requested domains (from dns.log) in the hour after the lease with the set from the hour before. Calculate the Jaccard similarity. Alert if the score is below a threshold (e.g., 0.2) and the number of new, unique domains is high (e.g., > 90th percentile of user activity), indicating a significant behavior change.",
              "Apply a pre-trained C2 detection model (e.g., a classifier trained on features like connection duration, data volume, periodicity, JA3/JA3S hashes) to all outbound traffic. Prioritize alerts from clients that have recently received a DHCP lease, especially if the lease originated from a server flagged by other rogue DHCP detections."
            ]
          },
          {
            "description": "Authentication credentials, such as NTLM hashes or cleartext passwords, are observed in unencrypted network traffic (e.g., HTTP, FTP, Telnet) destined for an unauthorized or suspicious server.",
            "data_sources": [
              "Zeek http.log",
              "Zeek smb_cmd.log",
              "Zeek ntlm.log",
              "Zeek ftp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, Application server segments, Authentication servers",
            "action": [
              "Create rules to detect cleartext credentials in transit to non-approved servers. Alert on: 1) Zeek http.log events with 'Authorization: Basic' headers to external or non-standard internal servers. 2) Zeek ftp.log events with 'PASS' commands to non-approved FTP servers. 3) Zeek ntlm.log events showing NTLM authentication to IPs not on an allow list of domain controllers and application servers.",
              "Baseline the volume of authentication attempts per protocol (Kerberos, NTLM, cleartext HTTP/FTP) between client subnets and server resources. Alert if there is a statistically significant increase (e.g., > 3 standard deviations from the daily mean) in the volume of unencrypted authentication protocols, especially to new or unusual destinations.",
              "Use unsupervised learning (e.g., k-means clustering) on network session metadata from Zeek conn.log, enriched with protocol-specific details (e.g., presence of HTTP 'Authorization' header). A small, new cluster representing sessions with cleartext authentication features directed at an unusual destination IP should be flagged as a high-risk anomaly."
            ]
          },
          {
            "description": "A client's outbound internet traffic is routed through a 'next hop' IP address that is not the authorized default gateway for its network segment.",
            "data_sources": [
              "NetFlow/IPFIX data",
              "Router/Firewall logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, Network Egress Points, Router flow data sources",
            "action": [
              "Using NetFlow/IPFIX data, maintain a mapping of client subnets to their authorized default gateway IPs. Create a rule to alert if a flow record shows a client IP communicating with an external IP via a 'next_hop' IP that is not the authorized gateway for that client's source subnet.",
              "Using NetFlow/IPFIX data, baseline the set of 'next_hop' IPs used by each client subnet for external traffic. Alert if a new, un-baselined 'next_hop' IP appears and is used by more than a small percentage (e.g., >1%) of clients in a subnet within one hour.",
              "From NetFlow/IPFIX data, construct a directed graph where nodes are IPs and edges represent flows. Use a community detection algorithm (e.g., Louvain Modularity) to identify normal traffic patterns. A rogue gateway will manifest as a new 'choke point' node through which a community's external traffic is suddenly rerouted, significantly altering the graph structure. Flag such structural changes."
            ]
          },
          {
            "description": "A client exhibits anomalous DNS query patterns after receiving a new DHCP lease, such as a high rate of NXDOMAIN responses, an unusual distribution of query types, or unusually high query name entropy.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Resolvers, Endpoint subnets, Network Egress Points",
            "action": [
              "Correlate Zeek dhcp.log 'Ack' events with subsequent dns.log events for the same client IP. Alert if, within 10 minutes of the lease, the client's ratio of NXDOMAIN responses to total queries exceeds a fixed threshold (e.g., 60%), which can indicate malicious DNS server behavior.",
              "For each host, create a multi-metric baseline of DNS activity (e.g., query volume, NXDOMAIN rate, Shannon entropy of queried 2LDs, ratio of A to AAAA records). After a new DHCP lease is acquired, re-calculate these metrics for the host. Alert if any metric deviates by more than 3 standard deviations from its established 30-day profile.",
              "Train an autoencoder neural network on feature vectors derived from benign per-host, per-hour DNS traffic (features: query entropy, TLD distribution, query type counts, NXDOMAIN ratio). For traffic following a new DHCP lease, feed the corresponding feature vector into the trained autoencoder. Alert if the reconstruction error exceeds a learned threshold, indicating an anomalous DNS activity profile."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]