[
  {
    "information_requirement": "Is the adversary maintaining persistence by manipulating conditional access policies?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "A successful authentication event is observed from an external IP address with a known malicious reputation (e.g., a known TOR exit node, C2 server, or anonymizing proxy) that should have been blocked by risk-based conditional access policies.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Entra ID Sign-in logs",
              "Okta System Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Edge Firewalls, VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta), Threat Intelligence Platforms",
            "action": [
              "Implement a SIEM rule to join successful authentication events (e.g., Windows Event ID 4624, Entra ID Sign-in logs) with a threat intelligence feed. Alert on any successful login where the source IP (`id.orig_h` in Zeek conn.log, `IpAddress` in event logs) has a high-risk reputation.",
              "For all successful external authentications, enrich source IPs with a numerical risk score from a threat intelligence provider. Calculate a rolling 24-hour 99th percentile of these scores across the organization. Flag any login whose source IP risk score exceeds this dynamic threshold, indicating a policy bypass for an unusually risky login.",
              "Train a classification model (e.g., Random Forest) to predict malicious logins. Use features including source IP geolocation, ASN, time of day, user's historical behavior, device information, and the threat intelligence risk score. A high-probability score for a login that was successfully authenticated indicates a potential policy failure."
            ]
          },
          {
            "description": "A sustained pattern of successful logins is observed from a previously unseen or rare Autonomous System (AS) or IP range, suggesting a new, overly-permissive 'trusted location' has been added to a conditional access policy.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Entra ID Sign-in logs",
              "AWS CloudTrail logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta), Network Gateway, Cloud IAM configuration portals",
            "action": [
              "Maintain an allow-list of approved corporate, partner, and VPN provider ASNs. Implement a rule to correlate the source ASN of all successful external logins against this list. Alert on any successful login from an ASN not on the allow-list.",
              "For each user, create a baseline of historically used source ASNs over the last 90 days. Calculate the Shannon entropy of the source ASN distribution for each user's logins within a rolling 24-hour window. A sharp decrease in entropy for a user, coupled with the new ASN being rare organization-wide, signals a suspicious consolidation of access to a new location.",
              "For each source ASN, model the time series of successful login counts using a forecasting model (e.g., ARIMA). An observed count that is a significant anomaly compared to the forecast (which would be zero or near-zero for a new ASN) flags a potential new trusted location being used for access."
            ]
          },
          {
            "description": "A measurable decrease in the rate of multi-factor authentication (MFA) challenges for a user or user group that historically required it, indicating a policy modification to weaken authentication controls.",
            "data_sources": [
              "Entra ID Sign-in logs",
              "Okta System Log",
              "Windows ADFS Event Logs",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider Portals (e.g., Entra ID, Okta), Active Directory Federation Services (ADFS) Servers, RADIUS Servers",
            "action": [
              "Design a correlation search that triggers when a successful login event (e.g., Entra ID Sign-in success) for a user in an MFA-required group lacks a corresponding MFA completion status (e.g., `mfaDetail` in Entra logs) or event (e.g., ADFS Event ID 1201) within a 5-minute window.",
              "For each critical user group, calculate a rolling 7-day baseline (mean and standard deviation) of the MFA success ratio (MFA-enforced logins / total successful logins). Alert if the current day's ratio drops more than 3 standard deviations below this rolling average.",
              "Train a time series anomaly detection model (e.g., Isolation Forest) on the MFA enforcement ratio for critical user groups. The model learns the normal fluctuations of this metric. An anomalous point detected by the model signals a sudden, unexpected change that could be a policy modification."
            ]
          },
          {
            "description": "Successful logins are observed from devices with client fingerprints (e.g., User-Agent string, JA3/JA3S hash) that are inconsistent with managed corporate assets, especially if policy is meant to block unmanaged devices.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 4624",
              "Entra ID Sign-in logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Application Frontends, VPN Portals, Endpoint Devices, Web Proxies",
            "action": [
              "Maintain an allow-list of known-good JA3 hashes and User-Agent strings from corporate-managed devices. Create a rule to alert on any successful login correlated with network traffic from a client whose fingerprint is not on this list.",
              "Profile the rarity of User-Agent strings and JA3 hashes across all successful logins over the last 30 days. A successful login using a client fingerprint that falls below a rarity threshold (e.g., seen in less than 0.1% of all authentications) is anomalous and warrants investigation.",
              "Use clustering algorithms (e.g., DBSCAN) on login event features, including User-Agent, JA3 hash, IP geolocation, and time of day. A small, dense cluster of successful logins with unusual features may represent a group of non-compliant devices that are now permitted access due to a policy change."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by manipulating conditional access policies?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "A successful authentication is observed from an IP address, IP range, or country that is explicitly defined on a policy deny list, indicating the policy is disabled, misconfigured, or has been maliciously modified.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Entra ID Sign-in logs",
              "Okta System Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Edge Firewalls, VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Implement a high-priority SIEM rule to compare the source IP and geolocated country of every successful authentication against the organization's explicit deny lists. Any match signifies a critical policy failure and requires immediate investigation.",
              "For each country or IP range on the deny list, the expected count of successful logins is zero. Monitor the count of successful logins from these geolocations. Any count greater than zero is a statistically significant deviation from the policy-defined baseline and should be alerted on.",
              "Train a simple binary classifier (e.g., Decision Tree) where the target variable is `is_login_allowed` (should be 0 for deny-listed IPs) and features are source IP, country, and ASN. A prediction of `is_login_allowed=0` for an event that was actually a successful login represents a false negative for the policy, indicating it was evaded."
            ]
          },
          {
            "description": "A pattern of successful logins is observed originating from public cloud provider IP ranges (e.g., Azure, AWS, GCP) that are not associated with legitimate corporate services, suggesting use to bypass geo-fencing or IP reputation blocks.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "AWS CloudTrail logs",
              "GCP Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta), Public Cloud Tenant (AWS, Azure, GCP)",
            "action": [
              "Maintain an allow-list of sanctioned public cloud IP ranges used for legitimate business purposes. Tag all successful logins with their source IP's hosting provider and alert on any successful login from a cloud IP range not on the sanctioned list.",
              "Calculate the proportion of successful logins per user that originate from non-sanctioned cloud IP ranges. Establish a baseline for each user (which should be near zero). Alert if this proportion for any user exceeds a predefined threshold (e.g., 5% of their logins in 24 hours) or is a statistical outlier compared to their peers.",
              "Use a time series anomaly detection model on the aggregate volume of successful logins originating from non-sanctioned cloud providers. The model learns the normal (near-zero) baseline. A sudden spike in this volume is an anomaly that indicates an adversary may be using cloud infrastructure to bypass controls."
            ]
          },
          {
            "description": "A successful login for a single user account occurs from two geographically distant locations within a time frame that would make travel between them impossible, indicating location-based controls have been bypassed or are not in effect.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Entra ID Sign-in logs",
              "Okta System Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider Portals (e.g., Entra ID, Okta), VPN Concentrators, Authentication Servers",
            "action": [
              "For each successful login, cache the user, timestamp, and geolocated source IP. Upon the next login for the same user, calculate the distance and time difference to compute the required travel speed. If the speed exceeds a physically impossible threshold (e.g., 1000 km/h), flag it as an 'impossible travel' event.",
              "Instead of a fixed speed threshold, calculate the distribution of all observed travel speeds between logins across the organization. Flag any event where the calculated speed is a statistical outlier (e.g., exceeds the 99.9th percentile), accounting for legitimate but fast commercial air travel.",
              "Model each user's sequence of login locations as a trajectory. Use a sequence anomaly detection model (e.g., an LSTM-based autoencoder) to learn a user's normal travel patterns. A new login that results in a high reconstruction error from the model is anomalous and could represent impossible travel that bypasses simpler checks."
            ]
          },
          {
            "description": "A sudden and statistically significant volume of successful logins is observed from a geographic location or Autonomous System (AS) that historically had zero or near-zero successful authentications.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Entra ID Sign-in logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Edge Firewalls, VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Define a list of 'zero-login' countries/ASNs where no business is conducted. Create a rule to alert on any successful login where the source IP's geolocated country or ASN is on this list.",
              "For each source country/ASN, establish a 30-day baseline of successful login counts using a moving average and standard deviation. Alert if the login count in a 1-hour window exceeds the baseline by a significant margin (e.g., >4 standard deviations), indicating a sudden surge.",
              "Apply change point detection algorithms (e.g., CUSUM, Bayesian Change Point) to the time series of login volumes from each country/ASN. These algorithms can automatically detect an abrupt and persistent shift in the statistical properties of the time series, which would signify a new pattern of activity from a specific location."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary facilitating credential access by manipulating conditional access policies?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "A successful authentication is observed for a user account whose credentials are known to be compromised (e.g., from haveibeenpwned), where a risk-based conditional access policy should have blocked the attempt or forced a password reset.",
            "data_sources": [
              "Windows Event ID 4624",
              "Entra ID Sign-in logs",
              "Okta System Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Domain Controllers), Cloud Identity Provider Portals (e.g., Entra ID, Okta), Threat Intelligence Platforms",
            "action": [
              "Integrate a feed of known-compromised credentials into the SIEM. Create a critical alert to fire upon any successful authentication event where the username matches an entry in this high-risk watchlist.",
              "Assign a risk score to each user account, with a higher score for those on the compromised list. For successful logins from these accounts, analyze the login parameters (location, time, device). A login that is also a statistical outlier based on the user's normal behavior (e.g., >3 standard deviations from their typical login time) dramatically increases the likelihood of abuse.",
              "Train a classifier to predict malicious logins, including a binary feature `is_credential_compromised`. A successful login where this feature is true, but where conditional access policies should have enforced a block, indicates a policy failure. The model's high confidence score for a successful login from a compromised account is a strong indicator."
            ]
          },
          {
            "description": "A successful external login is observed using a legacy authentication protocol (e.g., POP, IMAP, SMTP AUTH) that cannot enforce modern controls like MFA, indicating a policy to block such protocols has been disabled or was never implemented.",
            "data_sources": [
              "Entra ID Sign-in logs",
              "Okta System Log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (Exchange, O365), Legacy Application Servers, Edge Firewalls",
            "action": [
              "Filter identity provider logs (e.g., Entra ID Sign-in logs `clientApp` field) for successful authentications identified as a legacy protocol. Alert on any such authentication from an external IP address not on an explicit exception list.",
              "Establish a baseline of legacy vs. modern authentication protocol usage for each user. Alert if a user who normally has 0% legacy usage suddenly has a successful legacy authentication, or if the organization-wide percentage of legacy authentications suddenly spikes above a percentile threshold (e.g., 95th percentile).",
              "Use a time series anomaly detection model on the volume of successful legacy protocol authentications across the enterprise. A sudden spike or a sustained increase from the learned baseline would indicate that a policy disabling legacy auth has been weakened or removed."
            ]
          },
          {
            "description": "A high number of successful logins to distinct user accounts is observed originating from a single external IP address in a short period, indicating a successful credential stuffing or password spraying attack where MFA was not enforced.",
            "data_sources": [
              "Windows Event ID 4624",
              "Entra ID Sign-in logs",
              "Okta System Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Domain Controllers), Web Application Firewalls, Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Create a rule that triggers if a single external source IP address successfully authenticates as more than N distinct user accounts within a T time window (e.g., N=10 accounts in T=1 hour).",
              "For each 1-hour window, calculate the number of unique successful logins per source IP. Identify any source IP whose count exceeds a dynamic threshold, such as 4 standard deviations above the mean or the 99th percentile for that time window, to detect outliers.",
              "Use clustering (e.g., DBSCAN) on login events, with features like source IP, User-Agent, and time. A dense cluster of successful logins from a single IP to many different accounts would be identified as an anomalous cluster indicative of a large-scale attack that bypassed MFA or other controls."
            ]
          },
          {
            "description": "A sequence of numerous failed login attempts for a user from an IP is immediately followed by a successful login from the same IP that also exhibits anomalous characteristics (e.g., new location, time, device), suggesting credential acquisition was followed by policy manipulation or bypass.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Entra ID Sign-in logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Domain Controllers), Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Create a stateful rule that tracks failed logins (Windows Event ID 4625 or Entra failure status) per user/IP. If a threshold of failures is met, and a subsequent success (Windows Event ID 4624 or Entra success) occurs from the same IP within 15 minutes, trigger an alert for investigation.",
              "For each user, maintain a baseline profile of login attributes (source country, ASN, time of day). After a brute-force sequence (e.g., >10 failures in 5 minutes), score the subsequent successful login against this baseline. If multiple attributes are statistical outliers (e.g., beyond the 95th percentile of rarity for that user), it indicates a high-risk success.",
              "Model user login sequences using a Hidden Markov Model (HMM), where states could be 'Normal Login', 'Failed Login Spree', and 'Anomalous Success'. A transition from 'Failed Login Spree' to 'Anomalous Success' would be a low-probability sequence, flagging a likely compromise and policy bypass."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]