[
  {
    "information_requirement": "Is the adversary establishing persistence by modifying account properties for reversible encryption?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.005",
        "name": "Reversible Encryption",
        "evidence": [
          {
            "description": "An Active Directory user account modification event (Windows Event ID 4738) is observed where the 'User Account Control' field indicates the 'Password stored using reversible encryption' flag (ADS_UF_ENCRYPTED_TEXT_PASSWORD_ALLOWED / 0x80) was enabled for a user account.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Create a detection rule to monitor Windows Event ID 4738 ('A user account was changed'). For each event, parse the 'User Account Control' field to check if the 'Password stored using reversible encryption' flag (0x80) was added. Trigger an alert if this change is made to any account not on a pre-approved exception list.",
              "For all accounts with reversible encryption enabled, query authentication logs (Windows Event ID 4624) to establish a baseline of login activity. Calculate the 95th percentile of login dormancy (days since last login) across all active accounts in the domain. Generate an alert if an account with reversible encryption enabled successfully authenticates after being dormant for a period exceeding this percentile, suggesting the activation of a staged persistent account.",
              "Implement a time-series anomaly detection model that monitors event sequences per user. The model should flag the sequence: [Event 4738 enabling reversible encryption] -> [Event 4624 successful logon] occurring within a short window (e.g., less than 5 minutes), especially when the logon event's source IP address is identified as anomalous (e.g., rare geolocation, new ASN) by a separate user-behavior model."
            ]
          },
          {
            "description": "A Fine-Grained Password Policy (FGPP) object is created (Event ID 5137) or modified (Event ID 5136) where the 'msDS-PasswordReversibleEncryptionEnabled' attribute is set to 'TRUE'.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 5137"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SYSVOL Share",
            "action": [
              "Monitor for directory service object creation (Windows Event ID 5137) where Object Class is 'msDS-PasswordSettings' and for modification events (Windows Event ID 5136) on existing FGPP objects. Trigger an alert if the 'msDS-PasswordReversibleEncryptionEnabled' attribute is set to TRUE.",
              "For all FGPP modification events (Windows Event ID 5136), maintain a statistical profile for each administrator account, tracking the frequency and time-of-day of such changes. Generate an alert if an administrator modifies an FGPP to enable reversible encryption and the event occurs outside of their typical activity window (e.g., more than 2 standard deviations from their mean modification time) or if the modifying account has no history of FGPP management.",
              "Train a classification model (e.g., Random Forest) to score the risk of each FGPP modification (Windows Event ID 5136). Features should include: the user making the change (SubjectUserName), the source workstation, time of day, day of week, and the specific attributes being changed. A high-risk classification for a change that sets 'msDS-PasswordReversibleEncryptionEnabled' to TRUE indicates a likely malicious modification."
            ]
          },
          {
            "description": "A successful authentication event (Windows Event ID 4624) occurs for an account with reversible encryption enabled, immediately following a password change (Windows Event ID 4723) or after a statistically significant period of account inactivity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4723",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Servers, Internet Gateway",
            "action": [
              "For all accounts identified with reversible encryption enabled, create a stateful rule that alerts if a password change event (Windows Event ID 4723) is followed by a successful interactive logon (Windows Event ID 4624, Logon Type 2 or 10) from an external IP address (not within RFC1918 space) within 5 minutes.",
              "For each user account, model the time between logon events (Windows Event ID 4624) to establish a baseline of normal logon cadence. If an account with reversible encryption enabled authenticates after a period of inactivity that falls in the 99th percentile of its typical 'time between logons', generate an alert for potential dormant account abuse.",
              "Utilize a sequence analysis model (e.g., a Hidden Markov Model or LSTM) trained on event log sequences per user. The model should be trained to recognize the malicious sequence: [Event 4738: Reversible encryption enabled on User A] -> [Event 4724: Password reset on User A] -> [Event 4624: Successful logon by User A from a new host]. Flagging this specific sequence within a short time frame (e.g., under 30 minutes) provides a high-confidence alert for account takeover for persistence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to evade defenses by enabling reversible password encryption?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.005",
        "name": "Reversible Encryption",
        "evidence": [
          {
            "description": "The Group Policy Object (GPO) for 'Default Domain Policy' or 'Default Domain Controllers Policy' is modified to set 'Store passwords using reversible encryption' to 'Enabled', with the change originating from a source host or user account that does not typically perform GPO modifications.",
            "data_sources": [
              "Windows Event ID 5136",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SYSVOL Share, Administrative Workstations",
            "action": [
              "Monitor for modification events (Windows Event ID 5136) on the well-known GUIDs for 'Default Domain Policy' ({31B2F340-016D-11D2-945F-00C04FB984F9}) and 'Default Domain Controllers Policy' ({6AC1786C-016F-11D2-945F-00C04FB984F9}). If a change is detected, inspect the policy file modification on the SYSVOL share. Alert if the reversible encryption setting is enabled.",
              "Profile the set of hosts and user accounts that historically modify GPOs (Event ID 5136). If a modification enabling reversible encryption is initiated from a host or by a user not in this historical set (a 'first seen' event), generate an alert. Additionally, monitor the daily entropy of source hostnames modifying GPOs; a sharp increase indicates anomalous activity.",
              "Deploy an anomaly detection model that scores remote administration sessions. The model should ingest features like source IP reputation and geolocation (from Zeek conn.log), protocol used (e.g., WinRM, RDP), and user account. If a session is scored as anomalous and is immediately followed by a GPO modification (Event 5136) that enables reversible encryption, generate a high-priority alert for likely external actor compromise."
            ]
          },
          {
            "description": "A PowerShell script block log (Windows Event ID 4104) is observed containing script content that sets the 'AllowReversiblePasswordEncryption' property on an AD user object, especially if the script exhibits signs of obfuscation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstations, PowerShell Transcript Logs",
            "action": [
              "Create a detection rule for PowerShell script blocks (Event ID 4104) that matches the regex pattern `/(Set-ADUser|Set-ADAccountControl).*-AllowReversiblePasswordEncryption\\s+\\$true/i`. Alert on any match, particularly on Domain Controllers.",
              "For every PowerShell script block (Event ID 4104) executed on a Domain Controller, calculate its character entropy. Establish a baseline of entropy scores for typical administrative scripts. Alert on any script that both contains the string 'AllowReversiblePasswordEncryption' and has an entropy score exceeding the 98th percentile of the baseline, indicating probable obfuscation.",
              "Train a supervised learning classifier (e.g., Gradient Boosting) on PowerShell script blocks (Event ID 4104) to identify malicious scripts. Features should include AST (Abstract Syntax Tree) feature hashing, cmdlet co-occurrence matrices, presence of encoding functions (e.g., 'FromBase64String'), and string obfuscation metrics. A high-confidence 'malicious' classification on a script that also includes the 'Set-ADUser' cmdlet and 'AllowReversiblePasswordEncryption' parameter is a high-fidelity indicator of evasive activity."
            ]
          },
          {
            "description": "An Active Directory user account modification event (Windows Event ID 4738) enabling reversible encryption is attributed to a user account or source host with no history of such changes, or the event occurs at a statistically anomalous time.",
            "data_sources": [
              "Windows Event ID 4738",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstation Event Logs",
            "action": [
              "Maintain an explicit allow-list of 'AD Security Admin' accounts authorized to make security-sensitive changes. Generate a high-priority alert if a user account is modified to enable reversible encryption (detected via Windows Event ID 4738) by any account NOT on this list.",
              "For each administrative user, build a statistical baseline of activity hours for account modifications (Event ID 4738). If a modification enabling reversible encryption is performed by an administrator at a time that falls outside of two standard deviations from their mean activity time (e.g., 3 AM for a 9-5 admin), generate an alert for anomalous administrative behavior.",
              "Apply a clustering algorithm (e.g., DBSCAN) to group administrative actions based on features such as the administrator account, source host, target object class, and attributes modified. A modification event (Event ID 4738) that enables reversible encryption and is classified as a noise point (outlier) by the clustering model indicates a deviation from all established patterns of administrative behavior and should be investigated."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting credential access by enabling reversible password encryption?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.005",
        "name": "Reversible Encryption",
        "evidence": [
          {
            "description": "A process is executed on a Domain Controller that is associated with known credential access tools or frameworks, such as Mimikatz or PowerSploit, following a recent modification to user account encryption properties.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Windows Defender Event ID 1116"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative Workstations, Tier 0 Servers",
            "action": [
              "Monitor process creation events (Windows Event ID 4688) and Antivirus detection logs (e.g., Defender Event ID 1116). Alert immediately if a process hash matches a known threat intelligence indicator for credential dumping tools, or if a command line contains strings like 'Invoke-Mimikatz' or 'lsadump::dcsync' in PowerShell logs (Event ID 4104).",
              "Profile parent-child process relationships on Domain Controllers. A process like `powershell.exe` or `rundll32.exe` spawning from an unusual parent (e.g., `spoolsv.exe`, a web server worker process) and subsequently loading the Active Directory module or making suspicious network connections is a statistical anomaly that warrants investigation.",
              "Train a classifier to detect credential dumping behavior by analyzing sequences of network connections and process API calls. If an account has recently had reversible encryption enabled, and a subsequent session using that account is classified as 'credential dumping' (e.g., initiating a DCSync request), trigger a critical alert."
            ]
          },
          {
            "description": "A directory service audit event (Windows Event ID 4738) shows that the 'UF_ENCRYPTED_TEXT_PASSWORD_ALLOWED' flag (0x80) has been added to a user's 'User Account Control' attribute, particularly for a high-privilege account.",
            "data_sources": [
              "Windows Event ID 4738"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Audit Logs",
            "action": [
              "Create a rule to monitor Windows Event ID 4738. For each event, perform a bitwise AND on the 'User Account Control' field's old and new values with the mask '0x80'. Alert if the result for the old value is 0 and the result for the new value is 128 (0x80), indicating the flag was newly set. Escalate priority if the target account is a member of a privileged group.",
              "Track the rate of 'userAccountControl' modifications across the domain that enable reversible encryption. A sudden spike in the number of accounts having this flag set within a short period (e.g., >5 accounts in 1 minute) is a statistical anomaly. Calculate a moving average and standard deviation of these events and alert when the rate exceeds a threshold (e.g., 3 standard deviations above the mean).",
              "Use a peer group analysis model. Group users by role, department, and normal activity. If a standard user account (e.g., a marketing user) has its 'userAccountControl' attribute modified in a way that is typical only for a different peer group (e.g., legacy application service accounts), flag it as an anomaly. This can detect when an adversary hijacks and modifies a standard user account for credential access purposes."
            ]
          },
          {
            "description": "A sequence of events occurs in a short time window: 1) A user account is modified to enable reversible encryption (Windows Event ID 4738), followed by 2) a password change for that account (Windows Event ID 4723), and then 3) an attempt to access LSA secrets (e.g., `G$MSRADIUSCHAPKEY`) on a Domain Controller (Windows Event ID 4656/4663).",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4723",
              "Windows Event ID 4656",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, LSA Security Audit Logs",
            "action": [
              "Create a stateful detection rule that triggers on Event ID 4738 where reversible encryption is enabled. If, within the next 10 minutes, a password change (Event ID 4723) for the same target user occurs, followed by an LSA secret access attempt (Event ID 4656 for handle request, 4663 for object access) from the same source user/host, generate a critical alert for a credential access sequence.",
              "Establish a baseline for the frequency of LSA secret access events (4656/4663) from different users and hosts. An account modification enabling reversible encryption followed by LSA access from a user or host that is in the 99th percentile for such access (i.e., very rarely or never performs this action) is a high-confidence statistical anomaly.",
              "Model the attack chain using a graph-based correlation engine. Define nodes for entities (user, host) and edges for actions ('Enable Reversible Encryption', 'Change Password', 'Access LSA Secret'). An alert is triggered when a path representing this specific attack sequence is completed within a predefined time window, linking the setup to the payoff action."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]