[
  {
    "information_requirement": "Has the adversary accessed credentials stored in Group Policy Preferences?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1552.006",
        "name": "Group Policy Preferences",
        "evidence": [
          {
            "description": "A process creation event is observed where the process name, command-line arguments, or file hash corresponds to a known Group Policy Preferences (GPP) credential dumping tool.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution logs on all endpoints, including Domain Controllers, Member Servers, and User Workstations.",
            "action": [
              "Implement a SIEM rule that triggers an alert on process creation events (Windows Event ID 4688) or PowerShell script block logs (Windows Event ID 4104) where the command line or script block content contains strings indicative of GPP dumping tools, such as 'Get-GPPPassword', 'gpprefdecrypt.py', 'Gpp-Decrypt.ps1', or 'cpassword'. Correlate process hashes against a threat intelligence feed of known malicious tool hashes.",
              "For each process creation event, calculate the Shannon entropy of the process name string. Establish a baseline of process name entropy for each host. Generate an alert when a newly observed process name has an entropy score that exceeds the 95th percentile of the baseline for that host, especially if the process is seen accessing the SYSVOL share.",
              "Deploy a pre-trained machine learning model (e.g., Random Forest, Gradient Boosting) for malicious process detection. The model should be fed features from process creation events, including parent process name, command-line arguments, user context, and file path. Escalate alerts for any process classified as malicious with high confidence that is also observed making a network connection to a Domain Controller's SYSVOL share (e.g., \\\\<DOMAIN>\\SYSVOL\\)."
            ]
          },
          {
            "description": "A command-line execution is observed using a text-searching utility (e.g., findstr, grep, Select-String) to find the string 'cpassword' within XML files on a SYSVOL network share.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution logs on all endpoints, and file access audit logs on Domain Controllers hosting the SYSVOL share.",
            "action": [
              "Create a SIEM detection rule using a regular expression to search process command lines (Windows Event ID 4688) and PowerShell script blocks (Windows Event ID 4104). The pattern should detect the use of search utilities targeting the 'cpassword' string in XML files on the SYSVOL share, such as `.*(findstr|grep|Select-String).*cpassword.*\\\\\\\\SYSVOL\\\\.*\\\\.xml`.",
              "For each user, create a statistical profile of their command-line activity, including the commands and arguments used. Generate a user behavior analytics (UBA) alert when a user executes a command with a combination of arguments (e.g., `findstr` + `cpassword` + `SYSVOL`) that is historically anomalous, falling below the 5th percentile of their typical command patterns or those of their peer group.",
              "Apply a time-series anomaly detection model (e.g., ARIMA, Seasonal-Trend decomposition using Loess) to the frequency of command-line executions that specifically target the SYSVOL path. The model should be trained on historical data to learn normal patterns and flag sudden, anomalous spikes in this activity, which could indicate automated discovery scripts."
            ]
          },
          {
            "description": "A user account or host machine is observed reading specific GPP XML files (e.g., Groups.xml, Services.xml, ScheduledTasks.xml) from the SYSVOL share, and this access is inconsistent with its established baseline of behavior.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145",
              "Zeek smb_files.log",
              "Zeek smb_mapping.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File access audit logs on Domain Controllers; Network traffic monitoring points capturing SMB traffic to and from Domain Controllers.",
            "action": [
              "Implement a SIEM rule that generates a high-priority alert when a user account not belonging to a Domain Administrators or Enterprise Administrators group is observed reading GPP-related XML files (e.g., `Groups.xml`, `Services.xml`, `ScheduledTasks.xml`, `DataSources.xml`, `Printers.xml`, `Drives.xml`) from the SYSVOL share. This can be detected via Windows Event ID 5145/4663 or Zeek smb_files.log.",
              "For each user, establish a statistical baseline of their typical SYSVOL file access, profiling metrics such as the number of files accessed per hour and the specific file names. Generate an alert if a user's access count to GPP-related XML files in a 1-hour window exceeds three standard deviations from their personal or peer group's baseline mean.",
              "Employ an unsupervised clustering algorithm (e.g., DBSCAN) to group users based on feature vectors derived from their SMB access patterns to the SYSVOL share (e.g., access frequency, time of day, file types accessed). Generate an alert when a user's activity profile causes them to shift from a benign cluster (e.g., 'no access' or 'infrequent access') to a suspicious one characterized by targeted GPP XML file reads."
            ]
          },
          {
            "description": "An access pattern is observed where a source host or user first performs a broad directory enumeration of the SYSVOL share, followed by a targeted read of a specific GPP XML file within a short time frame.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File and network share audit logs on all Domain Controllers; Process execution logs on endpoints initiating the access.",
            "action": [
              "Create a stateful correlation rule in the SIEM that triggers when a single `Source Network Address` (from Windows Event ID 5145) generates over 100 directory listing events (`Accesses: ReadData (or ListDirectory)`) on the SYSVOL share, and this is followed within 5 minutes by a read event (`Accesses: ReadData` from Event ID 4663/5145) for an object name ending in `.xml` (e.g., `Groups.xml`) from the same source address.",
              "Analyze file access events on the SYSVOL share to calculate the rate of directory enumerations versus targeted file reads per user per minute. Flag users whose activity shows a rate of directory listing events in the 99th percentile, immediately followed by a low number of highly specific XML file reads, as this pattern deviates from normal browsing.",
              "Train a sequence analysis model, such as a Hidden Markov Model (HMM) or a Long Short-Term Memory (LSTM) network, on event sequences representing normal administrative access to SYSVOL. The model should learn valid state transitions (e.g., read policy file A, then modify policy file B). Flag any observed sequence, such as 'broad directory listing -> targeted XML read', that has a low probability under the trained model, indicating anomalous behavior."
            ]
          },
          {
            "description": "An access event of any type (e.g., read, write, or access denied) is logged for a purpose-built honeypot GPP XML file placed within a SYSVOL policy directory.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "A designated honeypot GPP XML file within a Group Policy folder on the SYSVOL share of all Domain Controllers.",
            "action": [
              "Deploy a honeypot file (e.g., `c:\\\\Windows\\\\SYSVOL\\\\sysvol\\\\<DOMAIN>\\\\Policies\\\\{GUID}\\\\User\\\\Preferences\\\\Groups\\\\honey.xml`) with a System Access Control List (SACL) that logs all access attempts. Create a critical-priority SIEM alert that triggers on any Windows Event ID 4663 or 4656 where the `Object Name` matches the full path of the honeypot file and the `SubjectUserName` is not on a pre-defined allow-list of security scanners.",
              "Although any single access is an alert, use descriptive statistics to enrich the finding. If access attempts against the honeypot file originate from more than one distinct user or host within a 24-hour period, automatically escalate the incident priority. This pattern indicates potentially widespread, automated discovery, placing the event in the 100th percentile of expected activity (which is zero).",
              "Implement a one-class SVM model, an anomaly detection algorithm ideal for high-fidelity alerts. Train the model exclusively on the 'no-access' state of the honeypot file. Any generated access event (e.g., Windows Event ID 4663) will be, by definition, an outlier. The model's classification of the event as an anomaly provides an automated, machine-validated high-confidence alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]