[
  {
    "information_requirement": "Has an adversary accessed or exfiltrated credentials from macOS Keychains, potentially leading to unauthorized network access? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1555.001",
        "name": "Keychain",
        "evidence": [
          {
            "description": "A process executes on a macOS host, where the process's file hash, name, or path is associated with known keychain enumeration malware or offensive security tools (e.g., KeySteal, Chain-Reactor).",
            "data_sources": [
              "Apple Endpoint Security Framework (ESF) process execution events",
              "Sysmon for macOS Event ID 1",
              "Antivirus/EDR detection logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate macOS endpoints, developer workstations",
            "action": [
              "Symbolic: Write a SIEM query that joins process execution events (e.g., Sysmon for macOS Event ID 1) with a threat intelligence feed of file hashes and process names known to be associated with keychain theft tools. Generate a high-severity alert for any match.",
              "Statistical: For all executed processes not on an enterprise-wide allowlist, calculate the prevalence of each process hash across all macOS endpoints. Flag any process that accesses keychain-related files (e.g., `~/Library/Keychains/login.keychain-db`) and has a prevalence below a 1% threshold for manual investigation.",
              "Machine Learning: Develop and apply a supervised classification model (e.g., Gradient Boosting) trained on labeled process metadata (e.g., parent process, file path, code signature status, file entropy). Use the model to score new process executions, flagging those with a high probability of being malicious for automated response or analyst review."
            ]
          },
          {
            "description": "The macOS 'security' command-line utility is executed with arguments used for credential dumping (e.g., 'dump-keychain', 'find-generic-password', 'find-internet-password'), especially when spawned by an unexpected parent process.",
            "data_sources": [
              "Apple Endpoint Security Framework (ESF) process execution events with command-line arguments",
              "Sysmon for macOS Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate macOS endpoints, particularly those of privileged users",
            "action": [
              "Symbolic: Create a detection rule using regular expressions to find command-line executions of `security` containing `dump-keychain`, `find-generic-password`, or `find-internet-password`. Suppress alerts where the parent process is known-good (e.g., Terminal.app, iTerm2.app, approved administrative scripts) and alert on all others, such as a web browser or document editor.",
              "Statistical: For each host, establish a 30-day rolling baseline of the hourly execution count for these specific `security` commands. Generate an alert if the count in any given hour exceeds the 99th percentile of the baseline for that host, indicating an unusual burst of activity.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA) on the aggregated count of `security dump-keychain` command executions across the entire fleet of macOS devices. An anomalous spike in the time-series that deviates significantly from the forecast indicates a potential widespread campaign and should trigger a high-priority incident."
            ]
          },
          {
            "description": "An application process, characterized as anomalous by being unsigned, recently compiled, or running from a non-standard path (e.g., `/tmp/`), makes API calls to access keychain data (e.g., SecItemCopyMatching) or triggers a SecurityAgent prompt for the keychain password.",
            "data_sources": [
              "macOS API Monitoring logs (e.g., from an EDR agent)",
              "macOS Unified Log events for `Security` and `SecurityAgent` subsystems"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate macOS endpoints",
            "action": [
              "Symbolic: Write a query to inventory all processes making keychain access API calls. Generate an alert for any process that meets a combination of suspicious criteria: is unsigned, runs from a user-writable directory like `~/Downloads`, and is not on an established allowlist of legitimate keychain-accessing applications (e.g., Safari, Chrome, Mail).",
              "Statistical: For each unique application (by name or bundle ID), calculate the rarity of it making keychain access API calls across the environment. An application for which keychain access is rare (e.g., performed by <0.5% of its instances enterprise-wide) that suddenly attempts access on a host should be flagged as a statistical anomaly.",
              "Machine Learning: Train a Random Forest classifier using features of the accessing process, such as its parent process, process name entropy, age on disk, and whether it has open network connections. Apply the model to classify each keychain access attempt as 'benign' or 'suspicious' and generate alerts for suspicious classifications."
            ]
          },
          {
            "description": "A successful network authentication (Kerberos, NTLM, or Radius) for a user whose primary device is macOS occurs from a source IP address, at a time, or from an Autonomous System (AS) that is inconsistent with the user's established 90-day baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek kerberos.log",
              "VPN logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Gateway, VPN Concentrators, RADIUS servers",
            "action": [
              "Symbolic: Write a correlation query to detect a successful network logon (Windows Event ID 4624, Logon Type 3 or 10) where the source IP address, found in the event or by correlating timestamps with Zeek conn.log, is present on a threat intelligence blocklist of malicious IPs or TOR exit nodes.",
              "Statistical: For each user, build a historical baseline of login features from the last 90 days, including source country, ISP/ASN, and typical login hours. Implement a scoring system where deviations add to a risk score (e.g., rare country=+3, unusual ISP=+2, login at 3 AM=+1). A cumulative score exceeding the 95th percentile of all user risk scores for that day indicates a high-risk login requiring investigation.",
              "Machine Learning: For each user, apply a clustering algorithm (e.g., DBSCAN) to historical login data using features like source ASN, target service, and time of day. New logins that are classified as noise (outliers) by the model do not fit any of the user's normal behavior clusters and should be flagged as anomalous."
            ]
          },
          {
            "description": "Following a successful network logon (Windows Event ID 4624) from an account associated with a macOS user, a process chain on the target Windows host includes the execution of lateral movement tools (e.g., psexec.exe, wmic.exe) or obfuscated PowerShell commands within a short time window (e.g., 5 minutes).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows PowerShell Script Block Logging (Event ID 4104)",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Servers, Windows Endpoints, Domain Controllers",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when a successful network logon (Windows Event ID 4624, Logon Type 3) is followed within 5 minutes on the same host by a process creation (Windows Event ID 4688) for `psexec.exe`, `wmic.exe`, or `powershell.exe` containing obfuscated command-line arguments (e.g., `-enc`, `-w hidden`).",
              "Statistical: For any PowerShell script block (Event ID 4104) executed within 10 minutes of a network logon, calculate the character entropy of the script block content. Alert if the entropy score is more than 2 standard deviations above the mean entropy calculated from a baseline of legitimate administrative scripts.",
              "Machine Learning: Train a sequence model, such as a Hidden Markov Model (HMM), on chains of process creations (Event ID 4688) that typically follow successful logons. Flag any logon session that results in a process execution sequence with a very low probability score from the model, indicating a deviation from normal post-login activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]