[
  {
    "information_requirement": "Is the adversary leveraging stolen authentication material to bypass access controls and evade defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1550",
        "name": "Use Alternate Authentication Material",
        "evidence": [
          {
            "description": "The execution of a process, or network access to a named pipe, that matches signatures of known credential theft tools (e.g., Mimikatz, Rubeus) is observed on a host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 17 (Sysmon)",
              "Windows Event ID 18 (Sysmon)",
              "Zeek smb.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations, File Servers",
            "action": [
              "Create and apply a watchlist of known credential theft tool indicators. Query Windows Event ID 4688 for process names like 'mimikatz.exe' or command-line arguments containing 'sekurlsa::logonpasswords'. Query Sysmon Event IDs 17 and 18 for named pipe creation or access events matching pipes like '\\\\.\\pipe\\mimi'. Query Zeek smb.log and dce_rpc.log for connections to named pipes like 'psexesvc'. Generate a critical alert upon any match.",
              "For common parent processes like 'powershell.exe' and 'services.exe', establish a 30-day baseline of command-line argument length and entropy using Windows Event ID 4688 data. Calculate the mean and standard deviation for each process. Generate an alert when a new command-line argument's length or entropy exceeds three standard deviations from the established mean, indicating potential obfuscation or injection.",
              "Train a Random Forest classification model using labeled process creation events (Windows Event ID 4688 and Sysmon Event ID 1). Engineer features including: command-line argument length, entropy, presence of special characters, parent process name, user context (system vs. user), and process integrity level. Deploy the model to score new process events in real-time. Events classified as malicious with a confidence score above 0.9 should be escalated for immediate investigation."
            ]
          },
          {
            "description": "A Kerberos Service Ticket (TGS-REQ) is requested for a user account from an IP address, where no corresponding Kerberos Ticket-Granting Ticket (TGT-REQ) was recently issued to that same user from the same IP, indicating a stolen ticket is being used.",
            "data_sources": [
              "Windows Event ID 4769",
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "For each Windows Event ID 4769 (A Kerberos service ticket was requested), extract the 'Account Name', 'Client Address', and 'Ticket Encryption Type'. Perform a stateful lookup for a Windows Event ID 4768 (A Kerberos authentication ticket (TGT) was requested) for the same Account Name and Client Address within the last 10 hours. If no corresponding Event ID 4768 is found, or if the Ticket Encryption Type in the 4769 event is '0x17' (RC4-HMAC), generate a high-severity alert for a potential Pass-the-Ticket attack.",
              "Using Zeek kerberos.log or Windows Event ID 4769, create a historical profile for each user account of the Service Principal Names (SPNs) they typically request. Calculate the request frequency for each user-SPN pair. Generate an alert when a user requests an SPN that falls into the bottom 5th percentile of their historical request frequency, indicating an anomalous service access attempt.",
              "For each user, model the volume of Kerberos TGS requests (Event ID 4769) over time using a time-series anomaly detection algorithm like Seasonal-ARIMA. The model should learn the typical daily and weekly request cadence. Generate an alert when the observed request volume for a user deviates significantly from the model's forecast, suggesting automated ticket usage by a tool like Rubeus."
            ]
          },
          {
            "description": "A successful logon event (Windows Event ID 4624) with Logon Type 9 (NewCredentials) is observed, where a process authenticates with explicit credentials other than the account under which it is running.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, especially developer workstations and administrative servers.",
            "action": [
              "Filter Windows Event ID 4624 for 'Logon Type' equal to 9. Extract the 'Process Name' and 'Account Name' fields. Alert if the Process Name is not on an approved list of applications known to use this functionality (e.g., 'runas.exe' used by an administrator, specific backup software). Correlate with process creation events (Event ID 4688) to analyze the parent process and command line for additional context.",
              "Group Logon Type 9 events by the combination of 'Process Name' and 'Account Name'. Establish a 30-day baseline of the frequency of each combination. Alert when a new, previously unobserved combination appears, or when the frequency of an existing combination exceeds the 99th percentile of its historical baseline, indicating unusual or excessive use of explicit credentials.",
              "Implement an unsupervised Isolation Forest model to detect anomalous Logon Type 9 events. Use features from Windows Event ID 4624 including: 'Process Name', 'Account Name', 'Workstation Name', and hour-of-day. The model will identify unusual combinations of these features that deviate from baselined administrative or application behavior, flagging them as potential credential abuse."
            ]
          },
          {
            "description": "A single user account generates successful network logons (Logon Type 3) from an anomalously high number of distinct source systems within a compressed timeframe.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log Aggregation Platform (SIEM), Domain Controllers, Network Flow Data Collectors",
            "action": [
              "For each unique user account, count the number of distinct source IP addresses associated with successful network logons (Windows Event ID 4624, Logon Type 3) within a sliding 10-minute window. If the count exceeds a static threshold (e.g., 5 distinct hosts), generate an alert for rapid lateral movement.",
              "For each user, create a 30-day historical baseline of the number of distinct source systems they log on from per hour. Calculate the 95th percentile for this count. Generate an alert if the user's logon activity in any given hour exceeds this personal 95th percentile threshold. Also compare against a peer group baseline (e.g., other users in the same department) for additional context.",
              "Model user-host logon activity as a bipartite graph. Apply a community detection algorithm (e.g., Louvain) to identify clusters of users and the hosts they typically access. Train a classifier to predict the community a user belongs to based on their logon patterns. An alert is triggered when a user's logon activity causes the model to classify them into a different community, indicating a significant behavioral shift."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary using stolen authentication material to execute code or move between systems in the environment?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1550",
        "name": "Use Alternate Authentication Material",
        "evidence": [
          {
            "description": "Remote process execution is initiated using a stolen credential, identified by the correlation of network traffic to remote administration pipes (e.g., svcctl, psexesvc) with subsequent process creation on the target host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek dce_rpc.log",
              "Zeek smb.log",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Member Servers, Privileged Access Workstations, Domain Controllers, Network Choke Points",
            "action": [
              "Correlate network and host data in near real-time. Trigger an alert if Zeek dce_rpc.log shows a call to the 'svcctl' endpoint to create a service, or if Zeek smb.log shows access to the '\\\\.\\pipe\\psexesvc' named pipe, AND within 5 seconds, the target host logs a new service creation (Event ID 7045) or process creation (Event ID 4688) by the source user.",
              "For each host, profile the frequency of parent-child process relationships over a 30-day period (e.g., 'services.exe' spawning 'cmd.exe'). Alert when a statistically rare relationship is observed, such as a web server process ('w3wp.exe') spawning a shell ('powershell.exe') or a remote administration tool, indicating a potential pivot from a compromised application.",
              "Develop a Hidden Markov Model (HMM) to analyze sequences of events per user session, including network logon, RPC calls, named pipe access, and process creation. Train the model on benign administrative sessions. Use the trained model to score new sessions, flagging sequences that have a low probability of being generated by the benign model, indicating a likely malicious toolchain (e.g., PsExec)."
            ]
          },
          {
            "description": "A network logon (Logon Type 3) using the NTLM authentication package is immediately followed by a process or service creation event on the target host, initiated by the same user account, which is a strong indicator of a Pass-the-Hash attack.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, particularly those not configured to disable NTLM.",
            "action": [
              "On each host, trigger a stateful rule on a successful Windows Event ID 4624 with 'Logon Type' 3 and 'Authentication Package' as 'NTLM'. If, within 2 seconds, a Windows Event ID 4688 (process creation) or 7045 (service creation) is logged with the same 'Security ID' as the logon event, generate a critical alert for a high-confidence Pass-the-Hash attempt.",
              "Across the enterprise, calculate the baseline ratio of NTLM vs. Kerberos authentications for network logons (Type 3) per user and per host. Monitor for a statistically significant increase in the NTLM ratio for any user or host, as this may indicate an attacker is unable to use Kerberos and is forcing a downgrade to NTLM to conduct a Pass-the-Hash attack.",
              "Train a supervised decision tree classifier on event pairs: a Logon Type 3 event and a subsequent process/service creation event. Use features like: time delta between events, authentication package (NTLM/Kerberos), user privilege level, source/destination hostnames. The model will learn to classify pairs as benign admin activity or likely Pass-the-Hash, providing a risk score for prioritization."
            ]
          },
          {
            "description": "A chain of sequential network logons (Logon Type 3) is observed across multiple hosts, where the target of one logon becomes the source of the next, forming a 'hop' pattern indicative of an adversary moving through the network.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log Aggregation Platform (SIEM), Domain Controllers, Network Flow Collectors",
            "action": [
              "Using a SIEM, join Windows Event ID 4624 (Logon Type 3) events where the 'Workstation Name' of a logon event at time T2 matches the 'Computer' name of another logon event at time T1 (T1 < T2), and the 'Account Name' is the same. Alert when a chain of 2 or more such hops is detected for a single user within a 60-minute window.",
              "Model logon activity as a directed graph where hosts are nodes and logons are edges. For each host, calculate its 'out-degree' (number of other hosts it logs into) and 'in-degree' (number of hosts logging into it) per hour. Establish a baseline for these metrics. Alert when a host's out-degree or in-degree exceeds 3 standard deviations from its historical norm, indicating it may be a pivot point or a convergence point for lateral movement.",
              "Apply a pathfinding algorithm like Breadth-First Search (BFS) to the logon graph daily to discover all unique lateral movement paths. Use a time-series anomaly detection model (e.g., Prophet) to forecast the expected number of new paths of length > 1. Alert when the actual number of new paths significantly exceeds the forecast, indicating a potential widespread lateral movement campaign."
            ]
          },
          {
            "description": "A privileged or service account authenticates from an endpoint, or at a time, that is inconsistent with its established pattern of behavior, suggesting the credential has been compromised and is being used by an adversary.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged Access Workstations (PAWs), Tier 0/1 Servers, Log Aggregation Platform (SIEM)",
            "action": [
              "For any account in a 'Domain Admins' or equivalent privileged group, generate a high-severity alert if a Windows Event ID 4624 (Logon Type 3 or 10) is logged where the 'Workstation Name' is not on a pre-defined, strictly enforced list of approved Privileged Access Workstations (PAWs).",
              "For each privileged account, baseline its logon behavior (Event ID 4624) across several dimensions: source workstation, destination server, protocol, and hour-of-day. Create a profile of the top 95% of activity for each dimension. Generate an alert if a new logon occurs that falls outside of this established profile, such as a logon from a non-standard workstation or during a weekend for a 9-5 administrator.",
              "For each privileged user, train a One-Class SVM model on their historical logon data (Windows Event ID 4624). Use features such as source IP geolocation, destination hostname, logon type, and time of day. This model creates a high-dimensional boundary of normal behavior. Any new logon event that the model classifies as an outlier (outside the boundary) is flagged as a potential credential compromise."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]