[
  {
    "information_requirement": "Is the adversary executing code using Component Object Model (COM)? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1559.001",
        "name": "Component Object Model",
        "evidence": [
          {
            "description": "A Windows process creation event (Event ID 4688) is observed where the 'CommandLine' field contains a known malicious COM CLSID or ProgID, or where the process hash matches a known malicious COM server binary.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688) for command lines containing known malicious CLSIDs or ProgIDs from a threat intelligence feed. Also, compare the process hash against a blocklist of known malicious COM server executables or DLLs. Generate a high-severity alert on any match.",
              "Statistical: For each process creation event (Windows Event ID 4688), parse the command line to extract any GUIDs formatted as CLSIDs. Calculate the enterprise-wide prevalence of each observed CLSID over a 30-day rolling window. Flag any CLSID that falls below the 5th percentile of prevalence as rare and requiring investigation.",
              "Machine Learning: Train a classification model (e.g., Random Forest, Gradient Boosting) on labeled features from process creation events. Features should include parent process name, command-line entropy, presence and rarity of a CLSID, and process path. Use the trained model to score new events in real-time and alert on those classified as malicious with a confidence score above 0.9."
            ]
          },
          {
            "description": "A common COM host process (e.g., svchost.exe, dllhost.exe, explorer.exe, wmiprvse.exe) spawns a script interpreter (e.g., powershell.exe, cmd.exe, cscript.exe) or a known Living Off the Land Binary (LOLBAS) as a child process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Web Servers, Domain Controllers",
            "action": [
              "Symbolic: Define and monitor for a list of high-risk parent-child process relationships using Windows Event ID 4688. Examples include parent processes like 'dllhost.exe', 'svchost.exe', or 'explorer.exe' spawning child processes like 'powershell.exe', 'cmd.exe', 'cscript.exe', 'mshta.exe', or 'certutil.exe'. Trigger an immediate alert for any observed match.",
              "Statistical: For each known COM host process (e.g., dllhost.exe), build a statistical baseline of its child processes and their command-line arguments over a 30-day period. Calculate the frequency of each parent-child-argument combination. Alert when a new, previously unseen combination is detected or when a combination with a historical probability below a set threshold (e.g., <1%) occurs.",
              "Machine Learning: Apply a clustering algorithm (e.g., DBSCAN) to feature vectors derived from child processes spawned by COM hosts. Features should include command-line length, argument count, and character entropy. Investigate any processes that fall into small, isolated clusters or are classified as noise, as they represent statistically significant deviations from normal execution patterns."
            ]
          },
          {
            "description": "A COM server process (e.g., dllhost.exe, svchost.exe) initiates a network connection to an external IP address, a domain with a low reputation score, or an internal host on a non-standard port, where such activity deviates from a statistically established baseline for that process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Network Egress Points (Firewalls/Gateways), DNS Servers",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log) by host and timestamp. Generate an alert if a common COM host process (e.g., 'dllhost.exe', 'wmiprvse.exe') initiates a network connection to a destination IP or domain present on a threat intelligence feed.",
              "Statistical: For each COM host process, establish a baseline of network behavior over 30 days, including destination ports, data volume (orig_bytes), and destination prevalence. Calculate the 95th percentile for data volume and maintain a set of common destination ports. Alert if a connection exceeds the data volume threshold or uses a port not in the established common set.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., Seasonal-ARIMA, LSTM) to monitor the volume of outbound data (sum of 'orig_bytes' in Zeek conn.log) and the number of connections per hour from known COM host processes. A sharp, unexplainable spike that deviates significantly from the forecasted pattern should trigger an alert for potential C2 communication or data exfiltration."
            ]
          },
          {
            "description": "A network logon event (Windows Event ID 4624, Logon Type 3) on a server is observed shortly after inbound connection traffic on the RPC Endpoint Mapper port (TCP/135) from a source host that is not on an approved list of administrative workstations or servers.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Internal Network Segments, VPN Concentrators",
            "action": [
              "Symbolic: Maintain a list of authorized administrative source IP addresses for critical servers. Join network connection logs (Zeek conn.log) on port TCP/135 with logon events (Windows Event ID 4624, Logon Type 3) on the destination server. Alert if a logon event occurs within 5 minutes of a TCP/135 connection from a source IP not on the authorized list.",
              "Statistical: Build a graph of source-destination host interactions involving TCP/135 (from Zeek conn.log) over a 30-day baseline. Calculate the frequency and regularity of each edge (connection). Alert on the first occurrence of a new source-destination edge, or if an edge's frequency falls into a rare percentile (e.g., bottom 5%), indicating an unusual lateral movement path.",
              "Machine Learning: Model the network as a graph where nodes are hosts and edges represent DCOM/RPC interactions. Apply a community detection algorithm (e.g., Louvain Modularity) to identify normal operational clusters (e.g., a cluster of web servers, a cluster of domain controllers). Generate an alert when an edge is created that bridges two previously disconnected communities, as this may represent an adversary moving laterally between network segments."
            ]
          },
          {
            "description": "A registry modification event (Windows Event ID 4657 with Object Name containing '\\Software\\Classes\\CLSID\\') is followed within a short time window by a process creation event (Windows Event ID 4688) for a legitimate application that uses that COM object.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Enterprise Registry Hives",
            "action": [
              "Symbolic: Create a rule that triggers when a registry write event (Windows Event ID 4657) to a key path under `HKEY_CLASSES_ROOT\\CLSID` or `HKEY_CURRENT_USER\\Software\\Classes\\CLSID` is followed within 5 minutes on the same host by a process creation event (Windows Event ID 4688) for the application associated with that COM object. This sequence is a strong indicator of COM hijacking.",
              "Statistical: For each host, baseline the frequency of registry modifications to COM-related keys. Calculate a moving average and standard deviation of these modifications over a 7-day window. Generate an alert when a host's COM registry modification count in a 1-hour period exceeds 3 standard deviations above its baseline, indicating potentially anomalous or automated tampering.",
              "Machine Learning: Train a sequence analysis model, such as a Hidden Markov Model (HMM) or an LSTM-based autoencoder, on typical sequences of user and system events (process creation, file access, registry modification). Feed real-time event sequences into the model. Flag sequences that have a very low probability of occurrence under the trained model, such as a rare registry write to a CLSID key followed by an application launch, as highly suspicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]