[
  {
    "information_requirement": "Has the adversary bypassed Mark-of-the-Web (MOTW) protections to execute code?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1553.005",
        "name": "Mark-of-the-Web Bypass",
        "evidence": [
          {
            "description": "A container file (e.g., ISO, VHD, IMG, RAR, ZIP) is downloaded from a source IP address or domain matching a threat intelligence feed, or the file's hash is known to be malicious.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Network egress points, DNS servers, Threat Intelligence Platform",
            "action": [
              "For each file identified in Zeek logs (files.log, http.log) with a MIME type of 'application/zip', 'application/x-rar-compressed', 'application/x-iso9660-image', 'application/octet-stream', or a file extension of '.iso', '.img', '.vhd', '.zip', '.rar', compare its SHA256 hash, the source IP address (id.orig_h), and the server name (host) against threat intelligence feeds. Generate an alert upon a match.",
              "For all downloaded container files, calculate the prevalence of the file hash and the source domain across the enterprise over the last 30 days. Flag files where the hash prevalence is below the 5th percentile and the source domain is younger than 30 days or has a low reputation score. Prioritize alerts for downloads by multiple hosts in a short time frame.",
              "Train a supervised classification model (e.g., XGBoost) to produce a risk score for each container file download. Features should include: file size, source IP ASN and geolocation, domain age and reputation from enrichment, file name entropy, and historical prevalence of the file hash and source domain. Trigger an investigation for files exceeding a predefined risk score threshold."
            ]
          },
          {
            "description": "A process (e.g., powershell.exe, explorer.exe) is created to mount a disk image or extract an archive file, and the parent process is a web browser or Microsoft Office application.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Virtual Desktop Infrastructure (VDI) instances, Application servers",
            "action": [
              "Create a detection rule for process creation events (Windows Event ID 4688, Sysmon Event ID 1) where ParentProcessName is in (`chrome.exe`, `msedge.exe`, `firefox.exe`, `winword.exe`, `excel.exe`, `powerpnt.exe`, `outlook.exe`) and ProcessName is in (`powershell.exe`, `explorer.exe`, `7z.exe`, `winrar.exe`, `tar.exe`) AND the command line includes terms like 'Mount-DiskImage', 'hdiutil attach', '.iso', '.vhd', '.img', or archive extraction flags like 'x', 'e'.",
              "Establish a baseline of parent-child process relationships by calculating the frequency of each pair over a 30-day period. Generate a statistical alert if a rare parent-child relationship is observed (e.g., `outlook.exe` spawning `7z.exe`), defined as a pair occurring below the 1st percentile of all observed relationships in the environment.",
              "Implement a time-series anomaly detection model (e.g., SARIMA) on the rate of disk image mounting events per host and per user. A sudden spike in the frequency of `Mount-DiskImage` cmdlet usage or `explorer.exe` mounting an ISO, which deviates significantly (e.g., >3 standard deviations) from the established seasonal baseline for that entity, should be flagged as anomalous activity."
            ]
          },
          {
            "description": "A network download of a container file to a host is followed within 10 minutes by the mounting or extraction of that file, which is then followed by a process execution originating from a path created by the extraction.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM/Data analytics platform, User workstations, Network sensors at egress points",
            "action": [
              "In a SIEM, create a correlation rule that joins network and host events. Trigger: A Zeek file transfer event for a container file. Correlate by host IP and time. Condition 1: Within 10 minutes, a process creation event (Sysmon EID 1) for an archive/mount utility is observed on the same host. Condition 2: Within 2 minutes of Condition 1, another process creation event occurs where the Image path is on a new drive letter or within a temporary directory. Alert on the complete sequence.",
              "Calculate the distribution of 'Time-To-Execution' (TTE), defined as the delta between the container file's network write time and the first process execution from within the container. Flag sequences where the TTE falls into the lowest 10th percentile (e.g., less than 15 seconds), as this indicates automated execution rather than user interaction.",
              "Utilize a graph database to model host-level activity, where nodes represent files, processes, and network connections. Apply a graph-based anomaly detection algorithm to identify subgraphs that match the known malicious pattern: [External IP -> Host] -> [File Write: container] -> [Process: mount/extract utility] -> [File Write: executable] -> [Process: executable]. The model can score the anomalousness of such subgraphs based on learned normal activity."
            ]
          },
          {
            "description": "An executable process is created from a file path on a newly mounted disk image or in a temporary directory, and the executable is unsigned or was recently compiled.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Servers, Domain Controllers, Code signing certificate authorities",
            "action": [
              "Create a detection rule for process creation events (Sysmon EID 1) where the executable's `Image` path is on a non-C: drive letter or within `\\Users\\*\\AppData\\Local\\Temp\\*` AND (`SignatureStatus` is 'Unsigned' or 'Invalid') OR the `Image` path matches a known IOC. This requires Sysmon or a similar EDR tool.",
              "For all process creation events (Sysmon EID 1), calculate the Shannon entropy of the file path in the `Image` field. Establish a baseline entropy score for common software paths. Flag any execution where the path entropy exceeds the 98th percentile for the environment, particularly if the parent process is an archive utility or web browser.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) on process creation event features. Use features like: file path entropy, parent process name, a boolean for execution from a temp/removable media path, a boolean for being unsigned, and the ratio of uppercase to lowercase characters in the filename. The model will assign an anomaly score to each process start, with high scores indicating a deviation from normal behavior warranting investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]