[
  {
    "information_requirement": "Has the adversary accessed credentials from the Windows Credential Manager?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1555.004",
        "name": "Windows Credential Manager",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable's file hash matches a known hash of a credential dumping tool (e.g., Mimikatz, LaZagne) that is known to interact with the Windows Credential Manager API or file-based vaults.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Privileged Access Workstations (PAWs), Domain Controllers, Member Servers",
            "action": [
              "Create a detection rule to query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for executable file hashes. Compare each hash against a curated threat intelligence feed of known malicious hashes for credential dumping tools. Generate a high-severity alert upon any match.",
              "For all newly observed process hashes not on an organizational allowlist, calculate the prevalence of the hash across the enterprise over the last 30 days. Flag hashes with an extremely low prevalence (e.g., seen on < 0.1% of endpoints) that are executed by non-system accounts for further investigation.",
              "Develop a supervised classification model (e.g., a Gradient Boosting Classifier) trained on features from process creation events (e.g., process name entropy, parent process, command-line length and entropy, user context, is signed). Use the model to predict the likelihood that a given process execution is a credential dumping tool. Flag processes with a high probability score for analyst review."
            ]
          },
          {
            "description": "The 'vaultcmd.exe' process is executed with command-line arguments indicative of credential enumeration, such as '/list', '/listcreds', '/listschema' or '/listproperties', particularly when spawned by a non-standard parent process (e.g., not explorer.exe or an interactive cmd.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Application Servers",
            "action": [
              "Create a detection rule to monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) where the process name is 'vaultcmd.exe' and the command line contains '/list', '/listcreds', '/listschema', or '/listproperties'. Alert on any match, as legitimate administrative use is rare and should be validated.",
              "For each user, establish a baseline of the frequency and parent processes of 'vaultcmd.exe' executions. Alert when the execution count for a user exceeds a statistical threshold (e.g., > 3 standard deviations above their mean) within a 24-hour period. Additionally, flag any execution where the parent process is not in the top 95th percentile of common parent processes for 'vaultcmd.exe' across the enterprise.",
              "Use an anomaly detection model (e.g., Isolation Forest) on process parent-child relationships. Train the model on legitimate process chains across the environment. Flag any 'vaultcmd.exe' execution that is identified as an anomaly, particularly chains originating from Office applications, web browsers, or scripting engines (e.g., winword.exe -> cmd.exe -> vaultcmd.exe)."
            ]
          },
          {
            "description": "A process that is not on a pre-defined allowlist (e.g., 'lsass.exe', 'explorer.exe') accesses files within the Windows Vault directories ('%APPDATA%\\..\\Local\\Microsoft\\Vault\\*'), specifically targeting credential files ('.vcrd') or the key policy file ('Policy.vpol').",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Servers hosting user profiles, Domain Controllers",
            "action": [
              "Enable file system object access auditing (SACL) on Windows Vault directories. Create a detection rule to monitor for file access events (Windows Event ID 4663) or file creation events for copies (Sysmon Event ID 11) where the Object/Target Filename matches '*\\Microsoft\\Vault\\*\\*.vcrd' or '*\\Policy.vpol' and the Process Name is not in an allowlist of 'lsass.exe', 'explorer.exe', or 'vaultcmd.exe'. Alert on any non-allowlisted access.",
              "Profile the set of processes that access Vault files on a per-host basis. Calculate the entropy of the set of unique processes accessing these files over a rolling 7-day window. A sudden increase in entropy, indicating new, previously unseen processes are accessing the files, should trigger an alert for that host.",
              "Train a time-series forecasting model (e.g., ARIMA or LSTM) on the volume of access events to Vault directories per host. An observed volume of access that significantly exceeds the forecasted volume with its confidence interval indicates an anomaly, potentially a tool attempting to brute-force or enumerate vault contents."
            ]
          },
          {
            "description": "A host exhibits evidence of Windows Credential Manager access (via 'vaultcmd.exe' execution, direct file access, or suspicious API calls) followed within a short time window by an anomalous outbound network connection, suggesting credential exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Internet Gateway, DNS Servers, Proxy Servers",
            "action": [
              "Create a correlation rule that triggers when a host generates an alert for T1555.004 (from prior evidence) and, within 5 minutes, initiates a network connection (Zeek conn.log) to an IP address or domain on a threat intelligence blocklist, or initiates a DNS query (Zeek dns.log) for a known C2 domain. This indicates a 'smash and grab' operation.",
              "Following a T1555.004-related event on a host, monitor its subsequent outbound connections (Zeek conn.log). Calculate the rarity of the destination IP/domain compared to the host's 30-day baseline. If the destination is in the bottom 1st percentile of frequency, and the 'orig_bytes' (data sent) is greater than the 95th percentile of the host's typical outbound connection size, flag it as suspicious exfiltration.",
              "Implement a sequence analysis model (e.g., a Hidden Markov Model) where states represent different TTPs. Define a state transition from 'Credential Access' (e.g., vaultcmd execution) to 'Exfiltration' (e.g., outbound connection with high entropy DNS query or to a non-categorized IP). An observed sequence of events that matches this high-risk state transition path with a high probability would generate an alert."
            ]
          },
          {
            "description": "A process associated with initial access or lateral movement (e.g., 'winword.exe', 'powershell.exe', 'wscript.exe') spawns a child process that directly interacts with the Windows Credential Manager (e.g., 'vaultcmd.exe', 'rundll32.exe keymgr.dll KRShowKeyMgr').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Email Gateway Servers, Web Servers, Terminal Servers",
            "action": [
              "Create a detection rule for process creation events (Windows Event ID 4688, Sysmon Event ID 1) where the Parent Process Name is in a list of suspicious parents ('winword.exe', 'excel.exe', 'outlook.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe') and the Process Name is 'vaultcmd.exe' or 'rundll32.exe' with 'keymgr.dll' in the command line. This pattern is highly indicative of macro or script-based attacks.",
              "Build a frequency table of all parent-child process pairs in the environment. Any pair involving 'vaultcmd.exe' or 'rundll32.exe' with 'keymgr.dll' as the child that has a frequency below a low threshold (e.g., seen less than 5 times enterprise-wide) should be flagged for review. This highlights rare and potentially malicious execution chains.",
              "Use a graph-based anomaly detection algorithm on the process execution graph of the entire enterprise. Represent processes as nodes and parent-child relationships as directed edges. Identify anomalous edges or short paths (e.g., 2-3 hops) that deviate from the normal graph structure, such as a path from 'winword.exe' to 'cmd.exe' to 'vaultcmd.exe', which would have a high anomaly score."
            ]
          },
          {
            "description": "A process not on a pre-defined allowlist programmatically enumerates credentials by making suspicious Windows API calls, such as 'CredEnumerateA' or 'VaultEnumerateItems', which are used to list credentials from the Credential Manager.",
            "data_sources": [
              "EDR Telemetry (API Calls)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Privileged Access Workstations (PAWs), Critical Servers",
            "action": [
              "Create a detection rule to monitor EDR logs for calls to `CredEnumerateA`, `CredReadA`, or `VaultEnumerateItems` originating from processes not on an allowlist (e.g., 'lsass.exe', 'explorer.exe'). Alert on any process such as 'powershell.exe', 'cscript.exe', or any unsigned binary making these calls.",
              "For each host, baseline the frequency and source processes of credential-related API calls. Alert if the daily count of these API calls from a single process exceeds a statistical threshold (e.g., 99th percentile of its own historical behavior) or if the call originates from a process that has never made such a call before on that host.",
              "Train a supervised classifier (e.g., Random Forest) on API call sequences from various processes. Use features like the sequence of APIs called (e.g., `OpenProcess` -> `CredEnumerateA` -> `Socket`), the time between calls, and the parent process name. Flag sequences that the model classifies as malicious with a high confidence score."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]