[
  {
    "information_requirement": "Is the adversary attempting to impact system availability or recovery using shutdown/reboot?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1529",
        "name": "System Shutdown-Reboot",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) where the new process's file hash matches a known malicious binary (e.g., wiper, ransomware) and the command line initiates a system shutdown.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Scan process creation events (Windows Event ID 4688) in real-time. Alert if the ProcessHash or OriginalFileName matches a threat intelligence feed of known impact-related malware (e.g., NotPetya, Olympic Destroyer).",
              "Statistical: For processes initiating shutdown commands, calculate the Shannon entropy of the process name. Alert if the entropy score is anomalously high (e.g., > 95th percentile of historical process name entropy), suggesting a randomized or packed malware executable name.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from process creation events (parent process, command-line arguments, file path, name entropy). Use the model to predict the likelihood that a given shutdown event is malicious. Alert on high-probability classifications."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for `shutdown.exe` or `Restart-Computer` where the parent process is a scripting interpreter (e.g., `powershell.exe`, `cmd.exe`, `wscript.exe`) and the command line includes parameters for immediate (`/t 0`) or forced (`/f`) execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers, particularly administrative jump boxes",
            "action": [
              "Symbolic: Create a rule to alert when a `shutdown.exe` process is spawned by `powershell.exe` or `cmd.exe` and contains the arguments `/f` or `/t` with a value less than 60 seconds.",
              "Statistical: Establish a baseline of command-line argument combinations for `shutdown.exe`. Calculate the frequency of each observed combination. Alert when a rare combination is used (e.g., a combination seen in < 1% of historical executions), particularly if it includes a custom comment (`/c`).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on vectorized command-line arguments for all observed shutdown commands to identify clusters of normal administrative behavior. Alert on any shutdown command that is classified as an outlier or does not belong to a known 'normal' cluster."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a remote administration tool (e.g., `psexec.exe`, `wmic.exe`, `ssh.exe`) whose command line targets a remote system with a shutdown command, correlated with a corresponding network connection (Zeek conn.log) to that target on a management port (e.g., 445, 22).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrative Workstations, Jump Servers, Management Networks",
            "action": [
              "Symbolic: Alert when a process creation event for `wmic.exe` contains the arguments `node:<IP>` and `os call shutdown`, and the source host is not a designated administrative server.",
              "Statistical: Build a statistical profile for each administrator account, tracking the typical number of systems they reboot in a given time window (e.g., per hour). Alert if an account's reboot activity exceeds a dynamic threshold, such as 3 standard deviations above their personal average.",
              "Machine Learning: Construct a graph of remote administration activity, where nodes are hosts and edges represent remote commands. Use a community detection algorithm to find normal administrative patterns. Alert when a new edge appears that bridges disparate communities (e.g., a user workstation issuing a shutdown to a domain controller)."
            ]
          },
          {
            "description": "A successful remote logon event (Windows Event ID 4624, Logon Type 3 or 10) is followed within a short time window (e.g., under 2 minutes) by a system shutdown initiation event (Windows Event ID 1074) on the same host, attributed to the same logged-on user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 1074",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Servers (Domain Controllers, Database Servers, Application Servers)",
            "action": [
              "Symbolic: Create a stateful rule that triggers on a successful remote logon (Event ID 4624, Type 3 or 10) and alerts if an associated shutdown event (Event ID 1074) occurs for the same Logon ID within 5 minutes.",
              "Statistical: For each user, calculate the baseline median session duration for remote logons. Alert if a session duration preceding a shutdown is a statistical outlier (e.g., in the bottom 5th percentile of all session durations), indicating an automated 'login-and-shutdown' action.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) trained on sequences of security events per user session. Define 'remote logon' and 'system shutdown' as states. Alert if the model observes a transition from 'remote logon' to 'system shutdown' with a probability that is anomalously high compared to the learned normal sequences of user behavior."
            ]
          },
          {
            "description": "A number of system shutdown events (Windows Event ID 1074) or event log service stopped events (Windows Event ID 6006) across multiple distinct hosts that exceeds a statistical threshold within a short time window (e.g., 10 minutes), and is not correlated with a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6006"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire Enterprise Network, segmented by asset groups (e.g., Workstations, VDI, Web Servers)",
            "action": [
              "Symbolic: Query for the count of distinct hosts reporting shutdown event ID 1074 within a 15-minute sliding window. Alert if the count exceeds a hardcoded threshold (e.g., >50 hosts) and the time does not fall within a pre-defined maintenance schedule.",
              "Statistical: For the entire environment, establish a baseline of shutdown events per hour. Use a Z-score or modified Z-score to detect outliers in the event count. Alert if the number of shutdowns in a given hour is more than 4 standard deviations above the mean.",
              "Machine Learning: Apply time-series anomaly detection (e.g., Seasonal-Hybrid ESD) to the stream of shutdown event counts. The model will learn the daily and weekly seasonality of reboots (e.g., Patch Tuesday). Alert when a spike in reboots is flagged as an anomaly that does not fit the learned seasonal pattern."
            ]
          },
          {
            "description": "A sudden, statistically significant drop in the volume of network traffic (e.g., total bytes, connection counts) from multiple critical subnets, as observed in network flow data (Zeek conn.log), indicating a mass system outage.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Core Switches, Subnet Aggregation Points, Internet Gateway",
            "action": [
              "Symbolic: Create a rule that alerts if the number of active connections from a critical subnet (e.g., 10.1.10.0/24 for database servers) drops by more than 90% in a 5-minute window compared to the previous 5-minute window.",
              "Statistical: For each monitored subnet, calculate a rolling 30-day baseline of average bytes and packets per minute. Alert if the current traffic volume drops below the 1st percentile of the historical distribution for that time of day.",
              "Machine Learning: Use a time-series forecasting model (e.g., Prophet or ARIMA) for each critical network segment to predict the expected traffic volume with confidence intervals. Alert if the observed traffic volume falls below the lower bound of the model's prediction for a sustained period (e.g., > 3 consecutive minutes)."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]