[
  {
    "information_requirement": "Is the adversary attempting to destroy data or disrupt availability by wiping disk content? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1561.001",
        "name": "Disk Content Wipe",
        "evidence": [
          {
            "description": "A process is created whose SHA256 hash or file name matches a known wiper malware signature in the threat intelligence database.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, particularly mission-critical systems like Domain Controllers and database servers.",
            "action": [
              "Symbolic: Continuously correlate the SHA256 hash from process creation events (Sysmon Event ID 1, Windows Event ID 4688) against a threat intelligence feed of known wiper malware hashes. Alert on any match.",
              "Statistical: Analyze file creation events (Sysmon Event ID 11) for file names matching known wiper patterns using regular expressions. Calculate the frequency of matches per host and alert if the rate exceeds the 99th percentile of the host's historical baseline.",
              "Machine Learning: Deploy a pre-trained machine learning classifier (e.g., Random Forest) that uses static file features (e.g., imports, string entropy, section names) to score newly observed executables for similarity to known wiper families. Alert on any file with a high-confidence malicious score."
            ]
          },
          {
            "description": "Legitimate system utilities (e.g., cipher.exe, vssadmin.exe, format.com) are executed with command-line arguments indicative of destructive disk wiping activity.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows servers and workstations, especially those with administrative privileges.",
            "action": [
              "Symbolic: Create a detection rule that triggers when a sequence of commands, such as `vssadmin.exe delete shadows /all` followed by `cipher.exe /w:C:` or `sdelete.exe -z`, occurs on the same host within a 5-minute window using process creation logs (Sysmon Event ID 1).",
              "Statistical: Establish a baseline for the execution frequency of utilities like `cipher.exe`, `sdelete.exe`, and `format.com` per host. Alert when the execution count for any of these utilities on a single host exceeds 3 standard deviations above its 30-day rolling average, especially outside of business hours.",
              "Machine Learning: Use a sequence analysis model (e.g., a Hidden Markov Model) trained on benign administrative command sequences. Feed real-time command-line execution data (Sysmon Event ID 1) into the model and alert when a sequence has a low probability of being benign, indicating a deviation from normal administrative behavior."
            ]
          },
          {
            "description": "A non-system or non-backup process reads from or writes to a physical drive object (e.g., `\\\\.\\PhysicalDriveN`), bypassing the file system.",
            "data_sources": [
              "Sysmon Event ID 9",
              "Windows Event ID 4656",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers hosting sensitive data, Domain Controllers, and virtualization hosts.",
            "action": [
              "Symbolic: Create an allow-list of legitimate processes (e.g., `chkdsk.exe`, specific backup agent executables, `System`) authorized to perform raw disk access. Monitor RawAccessRead events (Sysmon Event ID 9) and alert on any process performing this action that is not on the allow-list.",
              "Statistical: For each process performing raw disk access (Sysmon Event ID 9), calculate the entropy of the process name. An otherwise unknown process with a high-entropy name (e.g., `a7b2c9d4.exe`) performing this action is highly suspicious. Alert if a process's name has a character entropy score greater than $$ 3.5 $$.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using features from the process performing raw access, such as parent process, user context, process path, and signature status. Use the model to classify each raw access event as either 'benign administrative task' or 'suspicious wiper activity' and alert on the latter."
            ]
          },
          {
            "description": "A single process generates a statistically anomalous volume of file deletion or file overwrite events within a short time frame.",
            "data_sources": [
              "Sysmon Event ID 23",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, user workstations, and code repositories.",
            "action": [
              "Symbolic: Monitor for processes that delete critical system files or directories (e.g., `C:\\Windows\\System32\\*.*`) using file delete events (Sysmon Event ID 23). Alert immediately if a non-system, non-patching process attempts these actions.",
              "Statistical: For each host, establish a baseline of file deletion events (Sysmon Event ID 23) per minute per process. Alert when a single process generates a count of deletions exceeding the 99th percentile of the host's normal activity. Correlate with the entropy of deleted file extensions; a low entropy score indicates indiscriminate wiping.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA) on the stream of file modification/deletion events per host. The model will learn the normal 'rhythm' of file I/O. Alert when the observed activity significantly deviates from the model's forecast, indicating a potential mass-wiping event."
            ]
          },
          {
            "description": "A single host initiates an abnormally high number of new SMB connections to administrative shares (C$, ADMIN$) on other hosts in the network.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb_files.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at core switches and internet gateways, Endpoint and server SMB logs.",
            "action": [
              "Symbolic: Monitor for a single source IP establishing SMB connections (port 445) to more than 20 unique destination IPs within one minute where the share accessed is `\\\\*\\C$` or `\\\\*\\ADMIN$`. Query this from Zeek conn.log and Windows Event ID 5145.",
              "Statistical: For each host, create a baseline of the number of unique hosts it connects to via SMB over a 5-minute window. Use a sliding window to calculate this count and alert if the count exceeds 4 standard deviations from the host's historical mean, indicating fan-out behavior.",
              "Machine Learning: Use graph analysis to model the SMB communication network. A node (host) that suddenly starts connecting to a large number of nodes outside its usual community is anomalous. Monitor for and alert on hosts with a rapidly increasing 'betweenness centrality' score in the SMB graph, indicating it is becoming a critical hub for propagation."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]