[
  {
    "information_requirement": "Is an adversary attempting to disrupt operator visibility of the industrial process? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0815",
        "name": "Denial of View",
        "evidence": [
          {
            "description": "A complete cessation or significant reduction (e.g., >90% drop) in expected periodic Modbus/EtherNet/IP/DNP3 status updates or keep-alive messages from a specific field device IP to a specific HMI IP, lasting longer than a predefined threshold (e.g., 30 seconds to 5 minutes), outside of scheduled maintenance windows.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 2 (Control System) network segment, specifically between HMI/SCADA servers and Level 1 (Basic Control) PLCs/RTUs.",
            "action": "1. **Symbolic Logic:** Identify critical HMI-to-PLC/RTU communication pairs and their expected ICS protocol (e.g., Modbus, EtherNet/IP, DNP3) and polling intervals. Alert if `Zeek <ics_protocol>.log` shows a complete absence of expected periodic function codes (e.g., Modbus Read Holding Registers) or a high volume of specific ICS protocol error codes (e.g., Modbus exception responses) from a known PLC IP to a known HMI IP for a duration exceeding 2x the normal poll interval. 2. **Statistical Method:** Establish a moving average baseline of packets/bytes per 30-second window for each critical HMI-to-PLC communication pair using `Zeek conn.log` or specific protocol logs. Trigger an alert if the current window's traffic volume from the PLC/RTU to the HMI drops below the 1st percentile of its historical baseline for three consecutive windows. 3. **Machine Learning:** Implement a time-series anomaly detection model (e.g., ARIMA or Prophet-based) on the aggregate packet count per minute between critical HMI-to-PLC pairs. Flag deviations that fall outside the learned expected range with a high anomaly score as potential Denial of View, especially when coupled with a complete lack of expected ICS traffic."
          },
          {
            "description": "An unexpected termination (e.g., exit code non-zero, not initiated by OS shutdown or known administrator action) of a critical HMI application process (e.g., `ftview.exe`, `cimplicity.exe`, `rsview32.exe`) on an operator workstation, as identified by process monitoring logs.",
            "data_sources": [
              "Windows Event ID 4689",
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon Process Create)",
              "Windows Event ID 5 (Sysmon Process Terminate)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 2 (Control System) HMI Workstations and Engineering Workstations.",
            "action": "1. **Symbolic Logic:** Monitor for Windows Event ID 4689 (process terminated) or Sysmon Event ID 5 (process terminate) targeting critical HMI processes (e.g., `ftview.exe`, `cimplicity.exe`). Alert if the `InitiatingProcessName` (or `ParentProcessName` for Sysmon) is `taskkill.exe`, `powershell.exe`, `cmd.exe`, or an unknown executable, and the `SubjectUserName` is not a whitelisted administrative account or system process. 2. **Statistical Method:** Baseline the average daily termination count for each critical HMI process on each workstation. Alert if the termination count for a specific process on a workstation exceeds the 99th percentile of its historical daily average, or if a termination occurs outside of the 95th percentile of normal operational hours. 3. **Machine Learning:** Use a process behavior analytics model, trained on normal process lifecycles and parent-child relationships, to identify anomalous termination events for HMI processes. Flag terminations with unusual parent processes, command-line arguments, or execution paths as anomalous, indicating potential malicious activity."
          }
        ]
      },
      {
        "technique_id": "T0814",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "Sustained and sudden increase (e.g., >5x baseline) in inbound SYN packets or established connections (TCP/UDP) directed towards critical ICS assets (HMI/Historian IP addresses) from unusual source IPs or exceeding normal thresholds, resulting in a high ratio of incomplete connections (SYN-ACK not received) or connection rejections.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 3 (Manufacturing Operations) and Level 2 (Control System) network boundaries, Data Historian servers, HMI Workstations.",
            "action": "1. **Symbolic Logic:** Alert on any source IP initiating >1000 SYN packets per minute towards a critical HMI/Historian IP if that source IP is not a known internal SCADA server or whitelisted management workstation. Additionally, identify sustained periods (e.g., >60 seconds) in `Zeek conn.log` where the `conn_state` for connections to critical ICS assets is predominantly 'S0' (SYN sent, no reply) or 'REJ' (connection rejected) from multiple disparate source IPs. 2. **Statistical Method:** Calculate the 99th percentile for the rate of new TCP connections (SYN packets) and UDP packets per minute for each critical HMI/Historian IP. Trigger an alert if either metric exceeds this percentile for more than 60 seconds. Furthermore, calculate the Shannon entropy of source IP addresses connecting to critical assets; a sudden drop in entropy could indicate a concentrated attack. 3. **Machine Learning:** Apply a clustering algorithm (e.g., K-means) to network flow data (`Zeek conn.log`) over a sliding window, using features like source IP, destination IP, port, and packet count. Identify clusters that represent unusually high connection attempts or traffic volumes directed at ICS assets that deviate significantly from learned normal clusters, indicating a DoS attempt."
          },
          {
            "description": "An unscheduled or unexpected termination of a critical ICS-related Windows service (e.g., OPC Data Access Server, SCADA Runtime Service, Historian Collector Service), identified by its service name or executable path, not correlated with system shutdown or administrator-initiated restarts.",
            "data_sources": [
              "Windows Event ID 7034",
              "Windows Event ID 7036",
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon Process Create)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Level 2 (Control System) HMI Workstations, Engineering Workstations, and SCADA/Historian Servers.",
            "action": "1. **Symbolic Logic:** Create a whitelist of critical ICS service names (e.g., `OpcEnum`, `RsLinxService`, `ModbusGatewayService`). Monitor for Windows Event ID 7034 (Service Control Manager: A service terminated unexpectedly) for any service on this whitelist. Alert if the termination is not immediately followed by a successful restart (Windows Event ID 7036) within 30 seconds, or if the termination is initiated by `sc.exe` or `net stop` commands from non-standard users/processes (correlate with Windows Event ID 4688 or Sysmon Event ID 1). 2. **Statistical Method:** Establish a baseline of normal service uptime and restart frequency for each critical ICS service. Trigger an alert if a service terminates outside of its 95th percentile of normal operating hours or if the number of terminations for a service within an hour exceeds the 99th percentile of its historical hourly average. 3. **Machine Learning:** Utilize a classification model trained on historical service event logs (Event ID 7034, 7036, etc.) to predict the likelihood of a termination being malicious or accidental. Features could include time of day, preceding process creation or user login events, and service dependency relationships. Flag terminations with a high 'malicious' score for analyst review."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]