[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via external remote services? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0822",
        "name": "External Remote Services",
        "evidence": [
          {
            "description": "A successful login (Windows Event ID 4624) to an ICS-facing remote access service (e.g., VPN, RDP gateway) originating from a source IP address with no prior successful login history in the last 90 days, or from a geolocated country/ASN not observed for that user/service within the last 90 days, or occurring outside the 95th percentile of typical login hours for that specific user/service.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Demarcation Zone (DMZ), VPN Concentrators, Remote Access Gateways, Jump Boxes, Authentication Servers within ICS DMZ",
            "action": "1. (Symbolic Logic) Correlate successful logins (Windows Event ID 4624) on remote access servers with network connection logs (Zeek conn.log) using timestamp and IP addresses. Alert if a successful login originates from an IP address that generated more than 5 failed login attempts (Windows Event ID 4625) within the preceding 60 seconds, or if the source IP is present on a known threat intelligence blacklist. 2. (Statistical Method) For each user account, establish a 90-day baseline of normal activity including typical login hours (mean and standard deviation), source countries/ASNs (top 95th percentile), and login frequency using descriptive statistics. Trigger an alert when a successful login occurs from a new country/ASN not seen in the baseline, or if the login time is more than 3 standard deviations from the user's established average login time. 3. (Machine Learning) Employ a supervised classification model (e.g., Random Forest) trained on historical successful login features (e.g., time of day, day of week, source IP reputation, source geolocation, login frequency, user agent string from Zeek http.log for web-based portals) to predict the likelihood of an anomalous login; flag logins with an anomaly score above a learned threshold (e.g., top 1% of scores)."
          },
          {
            "description": "A single source IP address (from Zeek conn.log) generating a high rate of failed login attempts (Windows Event ID 4625) exceeding a defined threshold (e.g., 10 attempts in 60 seconds) against a single account, or failed attempts against more than 15 distinct user accounts within a 10-minute window, indicative of brute force or password spraying.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers for Remote Access, VPN Concentrators, Domain Controllers, Remote Access Gateways",
            "action": "1. (Symbolic Logic) From Zeek conn.log, count the number of failed login events (Windows Event ID 4625) originating from a single source IP address over a 60-second sliding window. Alert if this count exceeds 10. Additionally, identify when a single source IP generates failed logins for more than 15 distinct user accounts (Windows Event ID 4625) within a 10-minute window. 2. (Statistical Method) Calculate the hourly rate of failed login attempts per remote access service. Alert if the current hourly rate exceeds the 99th percentile of historical rates for that service over the last 30 days. Furthermore, calculate the Z-score for failed login attempts from a given source IP; alert if the Z-score exceeds 3.0. 3. (Machine Learning) Implement a time series anomaly detection model (e.g., ARIMA or Prophet) on the aggregated rate of failed login attempts per remote access service, alerting on statistically significant deviations from predicted patterns. Additionally, use a clustering algorithm (e.g., K-Means or DBSCAN) on source IPs based on the number of failed login attempts and unique target accounts to identify clusters of suspicious activity that deviate from normal behavior."
          },
          {
            "description": "Following a successful remote access login (Windows Event ID 4624), the associated source IP initiates network connections (Zeek conn.log) to an unusually high number of distinct internal ICS hosts/ports, or transfers an anomalous volume of data (orig_bytes + resp_bytes) that exceeds established baselines for typical remote maintenance sessions, or connects to known malicious external IPs (Zeek dns.log, Zeek http.log, Zeek conn.log).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal ICS Network Segments, ICS Engineering Workstations, Human-Machine Interfaces (HMIs) Servers, SCADA Servers, Data Historian Servers, Programmable Logic Controllers (PLCs)",
            "action": "1. (Symbolic Logic) After a successful remote login (Windows Event ID 4624), monitor subsequent network activity from the associated source IP in Zeek conn.log. Alert if the user connects to known sensitive ICS assets (e.g., HMIs, PLCs, Historians) that are outside their established access baseline or if `Zeek dns.log` entries show queries for known C2 domains or `Zeek http.log` shows connections to known malicious URLs. 2. (Statistical Method) For each active remote session, calculate the number of unique internal destination IPs contacted and the total data volume (orig_bytes + resp_bytes from Zeek conn.log). Establish baselines (e.g., 99th percentile or N standard deviations) for these metrics per user/role from historical data. Alert if current session metrics exceed the 99th percentile. Calculate the entropy of destination ports and protocols contacted by the source IP in 10-minute windows; a sudden spike in entropy (e.g., 2 standard deviations above the mean) indicates potential scanning. 3. (Machine Learning) Train an unsupervised anomaly detection model (e.g., Isolation Forest or Autoencoder) on features extracted from Zeek logs post-login (e.g., unique internal hosts contacted, data volume, protocol distribution, connection duration, entropy of destination ports/protocols, frequency of new internal connections). Flag sessions with an anomaly score above a pre-defined threshold (e.g., top 0.5% of scores) as suspicious activity."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]