[
  {
    "information_requirement": "Has an adversary caused a sustained loss of control over a critical industrial process? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0827",
        "name": "Loss of Control",
        "evidence": [
          {
            "description": "Observed failure rate of operator commands from specific HMI workstations to critical PLCs/RTUs exceeds a statistically significant threshold, evidenced by application error logs on HMIs (e.g., Windows Event ID 1000 with specific error strings) and an absence of corresponding successful ICS protocol commands (e.g., Modbus Function Code 0x05/0x06/0x0F/0x10 'Write' operations) or an increase in ICS protocol error responses (e.g., Modbus Exception Responses) in network logs.",
            "data_sources": [
              "Windows Event ID 1000",
              "Zeek conn.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Operator Workstations / HMIs, Process Control Network (PCN) Segments, Engineering Workstations",
            "action": "1. **Symbolic Logic:** Identify HMI application crash events (Windows Event ID 1000 with specific error codes related to communication failures) or process control application errors, AND simultaneously observe an absence of corresponding successful ICS protocol 'Write' commands (e.g., Modbus Function Codes 0x05, 0x06, 0x0F, 0x10) from the HMI's IP address in Zeek modbus.log. 2. **Statistical Method:** Establish a rolling 7-day baseline for the average rate and standard deviation of failed operator commands (derived from HMI error logs and absence of successful ICS writes). Alert if the current 5-minute average failure rate for a specific HMI exceeds 3 standard deviations from its established baseline. Additionally, calculate the ratio of Modbus exception responses (e.g., error codes in Zeek modbus.log) to successful responses; alert if this ratio increases above the 99th percentile of historical values. 3. **Machine Learning Application:** Employ a time-series anomaly detection model (e.g., LSTM Autoencoder) on the aggregated rate of failed operator commands and Modbus exception responses per HMI. Train the model on historical data to predict normal operational ranges and alert on deviations classified as anomalous with a confidence score above 0.8."
          },
          {
            "description": "Critical process variables (e.g., reactor temperature, boiler pressure, flow rate to a safety valve) are observed to sustain deviations beyond 1.5 times their normal operational thresholds for a period exceeding 5 minutes, without corresponding authorized 'Write' commands to adjust setpoints or process values logged in ICS protocol traffic (Zeek modbus.log, dnp3.log) from approved sources.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Process Historian Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) Segments, Programmable Logic Controllers (PLCs), Process Historian Server",
            "action": "1. **Symbolic Logic:** Identify 'Write' commands (e.g., Modbus Function Codes 0x05, 0x06, 0x0F, 0x10) in Zeek modbus.log or dnp3.log targeting critical process setpoint registers (from a pre-defined asset register) that originate from source IPs NOT present on an approved whitelist of authorized HMIs or engineering workstations. 2. **Statistical Method:** For each critical process variable (PV), calculate its 99th percentile operating range over the last 30 days from historian data. Alert if the current PV value continuously exceeds this 99th percentile for a duration longer than 5 minutes without a corresponding authorized 'Write' command being logged in Zeek ICS protocol logs from an approved source. Additionally, calculate the entropy score of destination registers for 'Write' commands; a sudden decrease below the 5th percentile of historical values could indicate highly targeted, repetitive manipulation. 3. **Machine Learning Application:** Utilize a multi-variate anomaly detection model (e.g., Isolation Forest) that ingests critical process variable data (from historian) and correlated ICS command logs (Zeek modbus.log, dnp3.log). Train the model on normal operating conditions to detect deviations in PVs that are not explained by legitimate control actions, classifying such events as potential loss of control. Implement a predictive model (e.g., Prophet) on key process variables to forecast expected values and alert when actual values deviate significantly from predictions (e.g., outside 95% prediction interval) for a sustained period without authorized commands."
          },
          {
            "description": "An alarm indicating an unexpected activation of the Safety Instrumented System (SIS) is observed, triggering an emergency shutdown or transition to a safe state, without any preceding authorized manual operator action or legitimate process condition that would necessitate such an activation.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "SIS System Logs (if available)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Safety Instrumented System (SIS) Workstations, SIS Controllers, Demilitarized Zone (DMZ) between the Process Control Network and Safety Network",
            "action": "1. **Symbolic Logic:** Detect an SIS activation alarm event (e.g., specific alarm code in SIS HMI logs, or a specific network message indicating trip status). Immediately correlate this with any successful logins (Windows Event ID 4624) to SIS engineering workstations from an IP address not on the approved whitelist within the preceding 30 minutes, OR any new or anomalous TCP connections (Zeek conn.log) to SIS network segments (e.g., specific ports for SIS protocols) that were not observed in the last 7 days. 2. **Statistical Method:** Establish a 90-day baseline for normal login times and source IP addresses for SIS workstations using Windows Event ID 4624. Calculate the statistical rarity (e.g., using a z-score) of any login event occurring within 30 minutes prior to an SIS trip. For network connections to SIS segments, calculate the frequency distribution of source/destination IP pairs and ports; alert on any connection with a frequency below the 1st percentile of historical traffic that occurs within 5 minutes of an SIS trip. 3. **Machine Learning Application:** Develop a classification model (e.g., Gradient Boosting Classifier) to differentiate between legitimate SIS activations (e.g., during scheduled maintenance, or in response to a pre-defined process safety condition) and anomalous activations. Features would include preceding network activity (Zeek conn.log), authentication events (Windows Event ID 4624), and process variable data (from historian). Utilize unsupervised anomaly detection (e.g., DBSCAN for clustering network flows) on network traffic patterns to SIS segments to identify unusual communication bursts or protocols immediately preceding an SIS trip, which might indicate an adversary attempting to interfere."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]