[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via removable media? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0847",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "Detection of a new process execution where the parent process or the new process's image path originates from a removable storage device (e.g., USB drive, external HDD) on an ICS asset. This activity may be indicative of malware execution via autorun or manual user action.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Data Gateways, SCADA Servers.",
            "action": "1. Collect Windows Event ID 4688 (Process Creation) from all critical ICS assets. Filter these events to identify processes where the 'New Process Name' or 'Process Command Line' field indicates execution from a removable drive letter (e.g., E:, F:, G:, etc., excluding known fixed drives like C:, D:). Immediately alert if the executable's hash (MD5, SHA256) matches a known malicious hash from threat intelligence feeds or if the process name/path matches a known suspicious pattern (e.g., 'autorun.inf', 'setup.exe' in non-standard locations). 2. For all process creations originating from removable media, establish a statistical baseline for each ICS asset based on: frequency of unique executable names, typical parent processes, and execution times. Calculate a Z-score for observed executable names and parent processes against their historical frequency. Generate a high-priority alert if a process executable name or parent process from a removable drive has a Z-score exceeding 3 standard deviations from its historical mean, or if it represents a completely novel executable (never seen before) from removable media. 3. Implement a supervised machine learning model (e.g., Random Forest, SVM) trained on historical Windows Event ID 4688 data, labeled for legitimate versus malicious process executions from removable media. Features for the model should include process name entropy, parent process, drive type, process command-line arguments, and user context. Apply this model to incoming real-time process creation events from removable media and generate an alert when the model classifies an event as 'malicious' with a confidence score above a defined threshold (e.g., 0.8)."
          },
          {
            "description": "Detection of outbound network connections from an ICS asset to external or unauthorized internal IP addresses, non-standard ports, or using unusual protocols, occurring within a short time window (e.g., 5 minutes) after a process launch from removable media. This behavior suggests potential C2 beaconing or lateral movement.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The IT/OT network boundary, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Perimeter firewalls, Network Intrusion Detection Systems (NIDS) at the IT/OT boundary, ICS network switches and routers.",
            "action": "1. Continuously correlate Windows Event ID 4688 (process creation from removable media) with Zeek conn.log and dns.log entries from the same source IP within a 5-minute window. Generate a high-severity alert if the destination IP address or domain name observed in the network logs matches any entry on an external threat intelligence blacklist (e.g., known C2 servers, suspicious domains). Prioritize connections to non-RFC1918 IP addresses or to domains that are newly registered or have a low reputation score. 2. For each critical ICS asset, establish a baseline for network connections (Zeek conn.log) including: average daily unique destination IPs/ports, average bytes transferred per connection, and common protocols. For network connections immediately following a removable media process execution, calculate the percentile rank for the observed bytes transferred and connection duration against the historical distribution for that asset. Trigger an alert if these metrics exceed the 99th percentile, or if the connection uses a protocol rarely seen from that asset (e.g., less than 0.1% of historical traffic). 3. Employ a time-series anomaly detection model (e.g., ARIMA, Isolation Forest) on aggregated network flow data (Zeek conn.log) from critical ICS assets, specifically monitoring for spikes in outbound connections, data volume, or changes in protocol distribution following a detected process execution from removable media. Train the model on historical network activity to learn normal patterns. Anomaly scores exceeding a predefined threshold (e.g., 0.9) in the post-execution window should trigger a high-fidelity alert, indicating potential C2 or data exfiltration."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]