[
  {
    "information_requirement": "Is an adversary capturing screen data from Human-Machine Interfaces (HMIs) or Engineering Workstations (EWS)? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0852",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "Detection of process execution events for known screen capture utilities (`psr.exe`, `SnippingTool.exe`, `PrintScreen.exe`, `Screenshot.exe`) or scripting tools (`powershell.exe`, `cmd.exe`) with screen capture-related command-line arguments, initiated by non-whitelisted parent processes on an HMI or EWS.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon Process Create)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations, Jump Servers within ICS network.",
            "action": "1. **Symbolic Logic (IOC/Whitelist):** Monitor for process creation events (Windows Event ID 4688 or Sysmon Event ID 1) on critical ICS assets like HMIs and EWS. Establish a strict whitelist of allowed applications and parent-child process relationships. Generate an alert for the execution of any process not on the established baseline, paying special attention to built-in Windows tools that can perform screen captures (e.g., 'psr.exe', 'SnippingTool.exe', 'PrintScreen.exe', 'Screenshot.exe') or scripting engines ('powershell.exe', 'cmd.exe') containing known screen capture command-line arguments (e.g., 'Add-Type -AssemblyName System.Windows.Forms'). 2. **Statistical Method (Rarity/Frequency):** For each unique process observed on HMIs, calculate its execution frequency and compare it to the overall population of similar ICS devices. Alert on processes exhibiting a frequency below the 1st percentile for the asset group, indicating extreme rarity. Continuously calculate the rolling 7-day average execution count for each whitelisted process; alert if a whitelisted process shows a sudden spike in execution (e.g., 3 standard deviations above its historical mean) without a corresponding change in operational context. 3. **Machine Learning (Classification):** Apply a supervised classification model (e.g., Random Forest or XGBoost), trained on historical legitimate process execution data (including process name, parent process, command-line arguments, user context, and execution path), to classify new process creation events. Flag events classified as 'anomalous' or 'malicious' based on deviations from learned normal behavior on ICS assets."
          },
          {
            "description": "Creation of image files (`.png`, `.jpg`, `.bmp`, `.tiff`, `.gif`) in temporary directories (`%TEMP%`, `%APPDATA%`, `C:\\Windows\\Temp`) or other non-standard locations, or by non-whitelisted processes, on an HMI or EWS.",
            "data_sources": [
              "Windows Event ID 11 (Sysmon File Create)",
              "Windows Event ID 1 (Sysmon Process Create)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI/EWS local file systems, particularly temporary directories, user profile folders, and shared network drives accessible by HMIs.",
            "action": "1. **Symbolic Logic (IOC/Whitelist):** On HMI and EWS endpoints, monitor for file creation events (Sysmon Event ID 11) with image file extensions (`.png`, `.jpg`, `.bmp`, `.tiff`, `.gif`). Establish a whitelist of legitimate processes and directories allowed to create these files (e.g., HMI software saving a report to a specific output folder). Generate an alert when an image file is created in a temporary directory (`%TEMP%`, `%APPDATA%`, `C:\\Windows\\Temp`) or by a process not on the whitelist, such as 'cmd.exe' or 'powershell.exe', especially if the creating process is not whitelisted to write to that directory. 2. **Statistical Method (Entropy/Volume):** Calculate the Shannon entropy of the filenames for newly created image files; alert on filenames exceeding the 95th percentile entropy score, as high-entropy (random-looking) filenames can indicate automated tool output. Additionally, establish a 30-day rolling baseline for the average daily count of image file creations per HMI/EWS; alert if the daily count exceeds 3 standard deviations above this historical mean. 3. **Machine Learning (Anomaly Detection):** Implement a time-series anomaly detection model (e.g., Isolation Forest or Prophet) on the rate of image file creation events per HMI/EWS. Train the model on historical data to predict expected creation rates and alert when actual rates deviate significantly (e.g., a sudden, sustained spike) from predictions, considering factors like file size and creation time."
          },
          {
            "description": "Outbound network connections from HMIs or EWS exhibiting a 'orig_bytes' value that is statistically anomalous (e.g., exceeding the 99th percentile of historical traffic for that host and destination port), particularly to external or unusual destinations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, OT/IT Network Boundary, Purdue Model Level 2/3 systems, ICS DMZ, Internet Gateway.",
            "action": "1. **Symbolic Logic (IOC/Whitelist):** Analyze Zeek conn.log data for all outbound connections originating from HMIs and EWS. Create a whitelist of approved destination IP addresses, domains, and ports for these critical assets. Trigger an alert for any connection from an HMI/EWS to an unapproved external IP address or domain (IOC match). Additionally, monitor Zeek http.log for HTTP POST requests originating from HMIs/EWS with unusually large 'resp_body_len' or 'orig_bytes' to non-whitelisted destinations. 2. **Statistical Method (Percentile/Standard Deviation):** For each HMI/EWS source IP, establish a rolling 7-day baseline for the 'orig_bytes' field across all outbound connections, calculating the mean, standard deviation, and 99th percentile. Trigger an alert for any new connection where the 'orig_bytes' value exceeds the 99th percentile of this baseline, or if the average 'orig_bytes' for a 15-minute window exceeds 3 standard deviations above the historical mean for that host. Enrich alerts with destination IP reputation data to prioritize connections to unknown or suspicious external addresses. 3. **Machine Learning (Clustering/Behavioral Anomaly):** Apply a clustering algorithm (e.g., K-means or DBSCAN) to group network connections from HMIs/EWS based on features such as 'orig_bytes', 'resp_bytes', destination port, protocol, and time of day. Connections falling into small, isolated clusters that deviate significantly from established normal communication patterns for each HMI/EWS (e.g., large outbound data transfers to a new external IP) should be flagged as potentially anomalous, indicating possible exfiltration."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]