[
  {
    "information_requirement": "Is an adversary leveraging standard application layer protocols (e.g., DNP3, Modbus, HTTP) for command and control within the ICS network? (PIR)",
    "tactic_id": "TA0101",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T0869",
        "name": "Standard Application Layer Protocol",
        "evidence": [
          {
            "description": "Observation of an ICS or enterprise protocol's traffic on a port other than its IANA-assigned standard port or a site-approved alternative, specifically when originating from or destined for external IP addresses, or crossing pre-defined IT/OT network segmentation boundaries.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter Firewalls (IT/OT Demarcation), ICS Zone Gateways, Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers.",
            "action": "1. **Symbolic Logic:** Define a baseline of standard port assignments for common ICS/enterprise protocols (e.g., DNP3 on TCP 20000, Modbus on TCP 502, RDP on TCP 3389) and a list of approved alternative ports. Create a rule to alert when `Zeek conn.log` entries show a `service` field matching a known protocol (e.g., 'dnp3', 'modbus', 'rdp', 'http', 'smb') but the `id.resp_p` (destination port) or `id.orig_p` (source port) is NOT in the defined baseline for that protocol. Prioritize alerts where the connection's `id.orig_h` or `id.resp_h` is an external IP or crosses the IT/OT boundary. 2. **Statistical Method:** For each `service` observed in `Zeek conn.log`, calculate the frequency distribution of `id.resp_p` over the last 30 days. Identify ports that fall below the 1st percentile of observed activity for that service. Trigger an alert if traffic for a critical ICS protocol (e.g., DNP3, Modbus) is observed on a port identified as statistically rare for that service, especially if the connection crosses IT/OT boundaries or involves external IPs. 3. **Machine Learning:** Develop a machine learning model (e.g., an unsupervised anomaly detection algorithm like Isolation Forest) trained on historical `Zeek conn.log` data, using features such as `service`, `id.resp_p`, `id.orig_h`, `id.resp_h`, `orig_bytes`, `resp_bytes`, and `duration`. Alert on connections that are flagged as anomalous, particularly if they involve known ICS protocols on unusual ports or communicate with assets outside their typical communication patterns."
          },
          {
            "description": "Significant deviation in the volume, frequency, or structural characteristics (e.g., payload size, command types, request patterns, entropy of data fields) of standard protocol traffic (e.g., HTTP, DNP3, Modbus) from established baselines, indicative of C2 tunneling.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), SCADA Servers, Historian Servers, DMZ Web Servers, Process Control Networks (PCN), Data Diodes, Network Boundary Sensors.",
            "action": "1. **Symbolic Logic:** Establish an allowlist of expected DNP3 function codes and object groups for each master-outstation pair within `Zeek dnp3.log`. Create a rule to alert on any `dnp3.log` entry where the `function_code` or `object_group` is not present in the pre-approved allowlist for the given `id.orig_h` and `id.resp_h` pair. Additionally, monitor `Windows Event ID 4688` (process creation) on ICS assets for suspicious processes (e.g., `cmd.exe`, `powershell.exe`, `nc.exe`) immediately preceding or following unusual DNP3 traffic, especially if the parent process is a legitimate ICS application. 2. **Statistical Method:** For `Zeek http.log`, calculate the 95th percentile of `orig_bytes` (request size) and `resp_bytes` (response size) for HTTP POST requests per source host (`id.orig_h`) over a 30-day rolling window. Alert when any host's `orig_bytes` or `resp_bytes` for a POST request exceeds its established 95th percentile. Furthermore, calculate the Shannon entropy of `uri` and `user_agent` fields in `Zeek http.log` for all outbound connections. Flag connections where entropy values exceed a statistical threshold (e.g., 2 standard deviations above the mean for a 24-hour period), indicating potential algorithmically generated domains (DGA) or obfuscated C2. 3. **Machine Learning:** Apply a multivariate time-series anomaly detection model (e.g., using LSTM Autoencoders or Prophet) to `Zeek dnp3.log` data, tracking features like `num_messages`, `num_objects`, and `function_code` distributions over time for each master-outstation pair. Train the model on historical data to learn normal operational patterns. Generate an alert when the model detects significant deviations from the learned patterns (e.g., sudden spikes in message volume, unexpected changes in function code usage, or rapid shifts in object group counts), indicating potential DNP3 C2 activity."
          },
          {
            "description": "Successful RDP logon (Logon Type 10) originating from an external IP address not on an approved allowlist, or an internal RDP session occurring outside of established operational hours, to/from an unusual source/destination asset, or involving a non-standard user account for that asset.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Jump Servers/Bastion Hosts (for IT/OT access), Domain Controllers, Remote Access VPN Concentrators.",
            "action": "1. **Symbolic Logic:** Maintain a strict allowlist of approved external IP addresses and VPN ranges permitted to initiate RDP connections into the ICS network. Create a rule to alert on `Windows Event ID 4624` with `Logon Type 10` (RemoteInteractive) where the `Source Network Address` is external and not present in the allowlist. Additionally, define approved internal RDP source-destination pairs and corresponding user accounts. Alert on `Windows Event ID 4624` where an RDP session occurs between unapproved internal hosts or involves unapproved user accounts. 2. **Statistical Method:** For each ICS asset, establish a baseline of normal RDP logon times (day of week, hour of day) and typical user accounts observed via `Windows Event ID 4624` (Logon Type 10) over a 60-day period. Calculate the `Z-score` for each RDP logon's `TimeCreated` relative to its baseline. Alert when an RDP logon occurs with a `Z-score` exceeding 2.5, indicating a statistically significant deviation from normal operational hours. Also, track the frequency of RDP connections between specific host pairs from `Zeek rdp.log` and alert on pairs exhibiting a sudden, statistically significant increase (e.g., 3 standard deviations above the mean) in connection frequency. 3. **Machine Learning:** Utilize a graph-based anomaly detection algorithm (e.g., Node2vec or a community detection algorithm) on historical RDP connection data from `Zeek rdp.log` and `Windows Event ID 4624`. Represent hosts as nodes and RDP sessions as edges, enriched with features like `user`, `time_of_day`, and `duration`. Train the model to identify normal RDP communication patterns and relationships between ICS assets. Alert when new, uncharacteristic RDP connections (new edges) or anomalous communication patterns (e.g., an HMI connecting to a PLC directly via RDP when it normally uses a SCADA server) are detected, indicating potential lateral movement or C2."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]