[
  {
    "information_requirement": "Is an adversary causing physical damage to ICS assets or the surrounding environment?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0832",
        "name": "Manipulation of Control",
        "evidence": [
          {
            "description": "Observed values for critical process parameters (e.g., motor current, tank pressure, furnace temperature) reported by PLCs or RTUs exceeding predefined operational safety thresholds (e.g., static maximum safe values, or statistically derived 99th percentile of normal operating range) following a write command originating from an HMI, engineering workstation, or directly to a PLC/RTU, indicating an attempt to operate equipment outside safe limits. This includes instances where a process parameter's rate of change (e.g., temperature increase per minute) dramatically exceeds historical norms, leading to equipment stress.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, PLC/RTU network interfaces, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Data Historian servers.",
            "action": "1. **Symbolic Logic (IOC Match):** Monitor `Zeek modbus.log`, `dnp3.log`, and `enip.log` for write commands (e.g., Modbus function codes 0x06, 0x10, DNP3 Function Code 0x0C) targeting critical PLC registers that are typically configured as read-only or have highly restricted write access. Establish a whitelist of authorized source IPs and associated write commands for these critical registers. Generate an alert for any write command from an unauthorized source IP or to a blacklisted register, or a write command containing values known to be outside absolute safety limits. 2. **Statistical Method:** From historical `Zeek modbus.log` (or `dnp3.log`, `enip.log`), establish a 30-day rolling baseline of normal value ranges for write commands to critical physical actuators (e.g., motor speed, valve position, heating element power). Calculate the mean and 3-sigma standard deviation for these values. Immediately alert when a new write command is observed with a value that falls outside 3 standard deviations of the historical mean or explicitly exceeds a hard-coded, documented maximum safe operating limit. Additionally, calculate the rate of change for critical process values and alert if the rate exceeds the 99th percentile of historical rates. 3. **Machine Learning Application:** Develop a time-series anomaly detection model (e.g., Isolation Forest, LSTM autoencoder) trained on the sequence and magnitude of process parameter changes (from `Zeek modbus.log` or OPC UA logs if available) following write commands. Flag and alert on significant deviations from normal operational sequences or magnitudes that indicate an abrupt, non-standard manipulation of control, especially when combined with a sudden increase in `Zeek conn.log` activity from an HMI/EWS to a PLC. 4. **Correlation:** For any identified anomalous write command, correlate its timestamp with `Windows Event ID 4688` (process creation) and `Windows Event ID 4624` (successful login) on the source HMI/EWS to identify the specific user and process that initiated the command."
          }
        ]
      },
      {
        "technique_id": "T0816",
        "name": "Device Restart/Shutdown",
        "evidence": [
          {
            "description": "Detection of an unexpected system shutdown (Windows Event ID 6008) or a user-initiated shutdown (Windows Event ID 1074) on a critical ICS asset (e.g., HMI, SCADA server, Historian, Engineering Workstation), lacking correlation with a pre-approved change management ticket, scheduled maintenance, or documented facility power event. This includes sudden, ungraceful loss of network connectivity from critical devices (observed in `Zeek conn.log` as a sudden termination without typical TCP teardown) that is not attributable to normal network events or power cycles.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6008",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Process Historians, SCADA Servers, Engineering Workstations, Domain Controllers within the ICS environment, Network boundary sensors for ICS segments, Remote Terminal Units (RTUs) with logging capabilities.",
            "action": "1. **Symbolic Logic (IOC Match):** Monitor critical Windows-based ICS assets for `Windows Event ID 6008` (Unexpected Shutdown) or `Windows Event ID 1074` (Shutdown Initiated). Immediately alert if such an event occurs and no corresponding entry exists in the change management system for that asset within a +/- 15-minute window. Also, alert if a shutdown is initiated by a process name not on an approved whitelist (e.g., `shutdown.exe` directly invoked without proper parameters/context) or by a user account that is not authorized for system administration on that specific asset. 2. **Statistical Method:** For each critical ICS asset, establish a 90-day rolling baseline of the mean and standard deviation for the frequency of `Windows Event ID 1074` and `6008` events (e.g., daily or weekly counts). Generate an alert if the current period's count for an asset exceeds 2 standard deviations from its historical mean, indicating an anomalous increase in shutdown events. Additionally, analyze `Zeek conn.log` for sudden, ungraceful termination (e.g., lack of FIN/ACK packets) of long-lived connections from critical ICS devices, and flag devices with an unusually high rate of such terminations compared to their historical 99th percentile. 3. **Machine Learning Application:** Train a binary classification model (e.g., Random Forest, SVM) using historical `Windows Event ID 1074` and `6008` events, enriched with features like initiating user (`Windows Event ID 4624`), source IP from `Zeek rdp.log` or `smb.log`, time of day, day of week, and the specific asset. Label known authorized shutdowns as 'normal' and unauthorized as 'anomalous'. Use the model to predict the likelihood of an observed shutdown being anomalous, triggering an alert for high-confidence predictions. 4. **Correlation:** Upon detection of an anomalous shutdown, correlate the event's timestamp with inbound remote connections (`Zeek rdp.log`, `Zeek smb.log`) and successful logon events (`Windows Event ID 4624`, `4648`) to the device in the 30 minutes prior, to identify potential adversarial access leading to the shutdown."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]