[
  {
    "information_requirement": "Is an adversary attempting to hide their presence on critical ICS hosts? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0872",
        "name": "Indicator Removal on Host",
        "evidence": [
          {
            "description": "Detection of Windows Event ID 1102 (The audit log was cleared) on an ICS host, occurring outside of documented and approved maintenance schedules or by an unauthorized user.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, and OT Domain Controllers.",
            "action": "1. **Symbolic Logic (IOC)**: Create a critical alert for any instance of Windows Event ID 1102. Correlate the event with a whitelist of authorized user accounts, processes, and predefined maintenance windows. Any occurrence outside this whitelist triggers an immediate alert. 2. **Statistical Method**: Establish a historical baseline (e.g., 60-day rolling window) for Windows Event ID 1102 occurrences, which should ideally be zero or near-zero on production ICS hosts. Generate an alert if any instance of Event ID 1102 is detected, as it represents a significant deviation from the norm (e.g., exceeding the 99.9th percentile of historical activity). 3. **Machine Learning**: Implement a User and Entity Behavior Analytics (UEBA) model that profiles normal administrative activity on ICS hosts. A sudden occurrence of Windows Event ID 1102 from an account or process with no historical precedent for such actions, or at an anomalous time, would flag a high-risk anomaly using a classification algorithm, triggering an alert."
          },
          {
            "description": "Detection of a statistically significant surge in file deletion events (Windows Event ID 4663, Accesses: DELETE) originating from a single user account or process on an ICS host, especially targeting critical directories such as `C:\\Windows\\System32\\winevt\\Logs\\`, user profile temporary directories, or known application log paths.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek fileinfo.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on Engineering Workstations, HMIs, Process Control Servers, and Historian Servers, specifically directories containing logs (e.g., C:\\Windows\\System32\\winevt\\Logs\\), temporary files, and user profiles.",
            "action": "1. **Symbolic Logic (IOC)**: Monitor Windows Event ID 4688 for process command lines containing known log clearing utilities or commands (e.g., `wevtutil.exe cl`, `del /s /q`, `sdelete.exe -z`, `rm -rf`) executed against sensitive log directories (`C:\\Windows\\System32\\winevt\\Logs`, application-specific log paths). Generate a high-severity alert for any match. 2. **Statistical Method**: For Windows Event ID 4663 (Object Access - Handle Closed, with DELETE access), establish a rolling 7-day baseline of unique file deletion counts per user and per process on each critical ICS host. Generate an alert if the number of deletions within a 15-minute window exceeds the 99th percentile or three standard deviations above the average for that user/process/host combination. 3. **Machine Learning**: Apply a time-series anomaly detection model (e.g., Isolation Forest or ARIMA) to the rate of file deletion events (Windows Event ID 4663) over time for each ICS host. Anomalous spikes or sustained high rates of deletion, especially when correlated with low-reputation processes or unusual user activity, should trigger a high-fidelity alert."
          },
          {
            "description": "Detection of explicit deletion or modification commands targeting known command-line history files (e.g., PowerShell ConsoleHost_history.txt, bash_history) on ICS hosts, identified through process creation logs.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and other ICS hosts where operators or administrators might use command-line interfaces, specifically user profile directories containing history files.",
            "action": "1. **Symbolic Logic (IOC)**: Create a high-severity alert for Windows Event ID 4688 where `CommandLine` contains keywords like `del`, `erase`, `rm`, `shred`, `sdelete` combined with file paths for known history files (e.g., `*ConsoleHost_history.txt*`, `*.bash_history*`, `*history.log*`, `*psreadline.log*`). 2. **Statistical Method**: Establish a baseline for how often known command history files are legitimately deleted or modified by authorized users/scripts (which should be extremely rare, ideally zero). Any occurrence outside this baseline, or an increase exceeding the 99th percentile of historical activity, should trigger an alert. 3. **Machine Learning**: Use a classification model trained on normal and anomalous process execution patterns to identify Windows Event ID 4688 events that target history files. Features could include process name, parent process, user, command line arguments, and execution time. A high anomaly score for such an event would indicate suspicious activity requiring immediate investigation."
          },
          {
            "description": "Detection of a service state change event (Windows Event ID 7036) indicating the 'Windows Event Log' service has stopped, or a service configuration change event (Windows Event ID 7040) altering its startup type to disabled, on an ICS host.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 7040",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Services running on critical ICS hosts like EWS, HMIs, Historians, and OT Domain Controllers.",
            "action": "1. **Symbolic Logic (IOC)**: Create a critical alert for Windows Event ID 7036 where `ServiceName` is 'Windows Event Log' and `ServiceState` is 'stopped'. Similarly, alert for Windows Event ID 7040 where `ServiceName` is 'Windows Event Log' and `NewStartType` is 'Disabled'. Correlate these events with recent `Zeek conn.log` entries for preceding RDP, SMB, or SSH sessions originating from unusual sources. 2. **Statistical Method**: Establish a historical baseline (e.g., 90 days) for occurrences of Windows Event ID 7036 and 7040 for the 'Windows Event Log' service across all ICS hosts. Since these events should be extremely rare or non-existent, any occurrence (exceeding the 99.9th percentile) immediately triggers a critical alert. 3. **Machine Learning**: Implement a host-based anomaly detection model that profiles normal service state changes and configurations (Windows Event ID 7036, 7040). A sudden, unapproved stop or disablement of the 'Windows Event Log' service, especially from an unusual user context or at an anomalous time, would be flagged with a high-confidence anomaly score and trigger a high-priority alert."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]