[
  {
    "information_requirement": "Has an unauthorized program modification been made to a critical ICS controller to establish persistence?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0889",
        "name": "Modify Program",
        "evidence": [
          {
            "description": "Detection of specific ICS protocol function codes indicating a program download, online edit, or other logic modification command (e.g., S7COMM 'Program Download', Modbus 'Write Multiple Registers') sent from an originating asset to an ICS controller. This activity is considered anomalous if the source is not an authorized Engineering Workstation (EWS), occurs outside a predefined maintenance window, or targets a critical controller without a corresponding change management ticket.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4634"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network Segment (Level 2/3), Engineering Workstations (Level 3), Critical PLC/Controller Network Interfaces (Level 1/2), Network Intrusion Detection Systems (NIDS) in the DMZ and Process Control Network",
            "action": "1. **Symbolic Logic**: Identify specific ICS protocol function codes in Zeek logs (e.g., `s7comm.log` function code `0x1B` for Program Download, `modbus.log` function code `0x10` for Write Multiple Registers, `enip.log` for Write Tag service code `0x4C`) originating from an IP address *not* on the authorized Engineering Workstation (EWS) allowlist. Correlate with Windows Event ID 4688 on EWSs to ensure the specific programming software (e.g., `TIA_Portal.exe`, `Studio5000.exe`, `RSLogix5000.exe`) was executed prior to the network command. Flag any program modification command lacking this preceding authorized software execution.\n2. **Statistical Method**: Establish a 30-day baseline of program modification commands per EWS-to-PLC pair, including the time of day and typical command types, using Zeek ICS protocol logs. Calculate the mean and standard deviation for the frequency of these commands. Trigger an alert if the current number of program modification commands for a specific EWS-to-PLC pair exceeds 3 standard deviations from its historical mean, or if the activity occurs outside the 99th percentile of typical operating hours.\n3. **Machine Learning**: Develop a time-series anomaly detection model using a technique like Isolation Forest or an autoencoder on the volume and type of program modification commands observed in Zeek ICS logs (e.g., `s7comm.log`, `modbus.log`) per controller. Train the model on historical benign activity. Flag any significant deviation from the learned normal pattern, particularly sudden spikes or changes in the distribution of command types, as a potential unauthorized program modification attempt."
          },
          {
            "description": "An ICS controller's operational mode is commanded to change from 'RUN' to a program-enabling state (e.g., 'PROGRAM', 'REMOTE', 'STOP') via network protocol, where the command originates from an unauthorized source IP address or occurs without a corresponding change management approval.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical PLC/Controller Network Interfaces (Level 1/2), Process Control Network Segment (Level 2/3), Demilitarized Zone (DMZ) Network Segment (for remote access points)",
            "action": "1. **Symbolic Logic**: Monitor Zeek ICS protocol logs (e.g., `s7comm.log` for CPU Control function with `PLC_STOP` or `PLC_PROGRAM` state, `modbus.log` for Write Coil/Register commands affecting operational mode, `enip.log` for Set Attribute Single commands) for any commands attempting to change a critical controller's mode from 'RUN' to 'PROGRAM', 'STOP', or 'REMOTE'. Generate a high-priority alert if the source IP of this command is *not* present in the authorized EWS IP allowlist or if the destination controller is a designated critical PLC.\n2. **Statistical Method**: For each critical controller, establish a 60-day moving average baseline for the frequency and duration of time spent in non-'RUN' modes (e.g., 'PROGRAM', 'STOP'). Calculate the average duration and count of mode changes per day. Trigger an alert if the current day's total duration in non-'RUN' modes or the count of mode changes exceeds the 99th percentile of its historical baseline, indicating an unusual operational state.\n3. **Machine Learning**: Employ a sequence analysis model (e.g., Hidden Markov Model or a Recurrent Neural Network) on Zeek ICS logs to learn typical sequences of PLC mode changes and subsequent network interactions (e.g., 'RUN' -> 'PROGRAM' -> 'Program Download' -> 'RUN'). Detect and flag deviations from these learned benign sequences, such as an unexpected mode change to 'PROGRAM' without a corresponding program download from an authorized EWS, or a rapid succession of mode changes."
          },
          {
            "description": "A discrepancy is detected between the current program logic checksum/hash/size on an ICS controller and its last known authorized 'golden image' or baseline, as reported by an ICS integrity monitoring system or via direct verification. This includes unauthorized changes to configuration files or firmware.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 1 (Sysmon for file hash changes)",
              "Specific ICS Integrity Monitoring System logs (e.g., X-Guard, Verve, Dragos Platform logs)",
              "Windows Event ID 4663 (File System Auditing)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Integrity Monitoring Servers (Level 3.5), Engineering Workstations (Level 3), Critical PLC/Controller File Systems (Level 1/2 - if accessible for direct monitoring), Central Log Management System",
            "action": "1. **Symbolic Logic**: Configure alerts to trigger on specific log messages from ICS integrity monitoring systems (e.g., `X-Guard: Program Hash Mismatch`, `Verve: Controller Logic Deviation`) or Sysmon Event ID 1 (File Creation/Modification) on EWSs or servers hosting controller logic, indicating a deviation from the established 'golden hash' for critical PLC programs or firmware. Additionally, create a watch list for known malicious file hashes (e.g., using a threat intelligence feed) if any project files are transferred via Zeek `files.log`.\n2. **Statistical Method**: Establish a 90-day baseline for the size and entropy of transferred ICS project files (e.g., `.ACD`, `.S7P`, `.L5X`) observed in Zeek `files.log` for each EWS and PLC. Calculate the mean and standard deviation for these metrics. Generate an alert if a transferred project file's size or entropy deviates by more than 3 standard deviations from its historical mean, or if its entropy falls below the 1st percentile of observed benign project files, potentially indicating obfuscation or packing.\n3. **Machine Learning**: Implement a binary classification model (e.g., Support Vector Machine or Random Forest) using features extracted from Zeek `files.log` for transferred project files (e.g., file size, entropy, file type, source/destination, protocol) to differentiate between authorized and unauthorized program file transfers. Train the model on historical authorized transfers and known malicious samples. Flag any transfer classified as 'unauthorized' with a high confidence score as a potential program modification."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]