[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via an internet-exposed device?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0883",
        "name": "Internet Accessible Device",
        "evidence": [
          {
            "description": "Detection of any inbound TCP/UDP connection attempt from an external, non-whitelisted IP address to a destination IP within the ICS network segment, specifically targeting common ICS protocol ports (e.g., S7, Modbus, DNP3, EtherNet/IP) or remote access service ports (e.g., VNC, RDP).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Perimeter Firewall, ICS DMZ Segment, ICS Data Historian Network",
            "action": "1. **Symbolic Logic:** Filter `Zeek conn.log` for connections where `id.orig_h` is an external IP address (not RFC1918 or known internal/partner ranges) and `id.resp_h` is within the ICS network IP space. Further filter for `id.resp_p` matching known ICS protocol ports (e.g., 102, 502, 20000, 44818) or common remote access ports (e.g., 5900, 3389). Immediately alert if `id.orig_h` is not present in a pre-approved external IP whitelist.\n2. **Statistical Method:** Establish a daily baseline of connection attempts from external IPs to ICS-specific ports on internal ICS assets using `Zeek conn.log`. Calculate the 99th percentile for connection volume for each destination port. Generate an alert if the current daily connection volume to any ICS port from external IPs exceeds this 99th percentile. Additionally, enrich `id.orig_h` with GeoIP data and alert on connections originating from countries that fall outside the 95th percentile of historical connection sources.\n3. **Machine Learning Application:** Implement a time-series anomaly detection model (e.g., Prophet, Isolation Forest) on the aggregated hourly or daily count of inbound connection attempts to ICS ports from external IPs. Train the model on at least 90 days of `Zeek conn.log` data. Alert when the model identifies a significant deviation (e.g., 3 standard deviations) from the predicted connection volume, indicating a potential scanning or reconnaissance phase."
          },
          {
            "description": "Observation of a minimum of 5 failed remote authentication attempts (Logon Type 10 - RemoteInteractive) from a single external IP address to an internet-facing Windows-based ICS asset (e.g., HMI, EWS) within a 60-second window, indicating potential brute-force or password spraying activity.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-exposed HMIs, Engineering Workstations, and Jump Servers within the ICS DMZ",
            "action": "1. **Symbolic Logic:** Monitor `Windows Event ID 4625` for `Logon Type 10` (RemoteInteractive) where `Source Network Address` is an external IP. Group events by `Source Network Address` and `Target Account Name` within a sliding 60-second window. Trigger an alert if the count of failed logins from a single external IP to any account on an ICS asset exceeds 5. Correlate the `Source Network Address` and timestamp with `Zeek conn.log` to confirm external origin and `Zeek rdp.log` for RDP-specific session failures.\n2. **Statistical Method:** For each internet-facing ICS asset, establish a baseline of normal `Windows Event ID 4625` occurrences (Logon Type 10) from external IPs. Calculate the rolling 99th percentile for the hourly rate of unique failed login attempts per source IP. Generate an alert when the current hourly rate from a single external IP exceeds this 99th percentile, indicating a statistically anomalous volume of failed attempts.\n3. **Machine Learning Application:** Train a classification model (e.g., Logistic Regression, Random Forest) using features extracted from `Windows Event ID 4625` (e.g., source IP entropy, target account diversity, login attempt velocity, time of day). Label historical brute-force and password spraying attempts. Continuously classify new incoming `Windows Event ID 4625` events, alerting on classifications indicative of malicious authentication attacks."
          },
          {
            "description": "A successful remote interactive login (Logon Type 10) to an ICS asset (e.g., HMI, EWS, PLC programming workstation) originating from an IP address not present on an approved external access whitelist, confirmed by `Windows Event ID 4624` and `Zeek conn.log`.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-exposed HMIs, Engineering Workstations, Jump Servers, Domain Controllers within the ICS DMZ, and any ICS asset configured for remote access",
            "action": "1. **Symbolic Logic:** Filter `Windows Event ID 4624` for `Logon Type 10` (RemoteInteractive). Extract `Source Network Address` and `Target Account Name`. Correlate with `Zeek conn.log` to confirm the external origin and `Zeek rdp.log` for RDP session details. Immediately alert if the `Source Network Address` is not found in a pre-approved external IP whitelist specific to that `Target Account Name` or destination ICS asset.\n2. **Statistical Method:** Enrich successful logins from `Windows Event ID 4624` with `GeoIP` and ASN data from `Zeek conn.log`. Establish a baseline of typical login locations (country, ASN) for each user account and ICS asset over a 60-day period. Alert if a successful login originates from a location (country/ASN) that falls outside the 99th percentile of historically observed login locations for that specific user or asset.\n3. **Machine Learning Application:** Implement a User and Entity Behavior Analytics (UEBA) model (e.g., unsupervised anomaly detection like Isolation Forest or One-Class SVM) on `Windows Event ID 4624` data. Train the model on features such as login time, source IP characteristics (e.g., new IP, rare ASN), device characteristics, and target asset. Alert when a successful login exhibits a high anomaly score (e.g., exceeding the 95th percentile of normal scores), indicating a significant deviation from established user/asset behavior patterns."
          },
          {
            "description": "Observation of an outbound data transfer volume from an ICS asset to an external IP address (not on a known-good whitelist) that significantly deviates from established baseline behavior, defined as exceeding the 99th percentile of `resp_bytes` for a single connection or the 95th percentile of cumulative daily `resp_bytes` for the asset over a 30-day rolling window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Perimeter Firewall, ICS DMZ Segment, Internet-facing ICS assets, any ICS asset capable of outbound internet communication",
            "action": "1. **Symbolic Logic:** Filter `Zeek conn.log` for connections where `id.orig_h` is an ICS internal IP and `id.resp_h` is an external IP not on an approved whitelist. Check `id.resp_h` or `query` from `Zeek dns.log` against threat intelligence feeds for known C2 domains or malicious IPs. Immediately alert on any matches (IOC match). Additionally, identify connections to unusual outbound ports or non-standard protocols not typically used for ICS communication.\n2. **Statistical Method:** For each ICS asset, establish a baseline for `resp_bytes` (outbound data volume) to external destinations over a 30-day rolling window using `Zeek conn.log`. Calculate the 99th percentile for `resp_bytes` of individual connections and the 95th percentile for cumulative daily `resp_bytes` per asset. Generate an alert if any single connection's `resp_bytes` exceeds its 99th percentile, or if the cumulative daily `resp_bytes` for an asset exceeds its 95th percentile.\n3. **Machine Learning Application:** Apply a time-series anomaly detection model (e.g., ARIMA, Prophet, or Isolation Forest) to the `resp_bytes` (outbound data volume) from each ICS asset to external destinations, aggregated hourly or daily. Train the model on historical `Zeek conn.log` data for at least 60 days. Alert on significant, sustained deviations from the predicted outbound data volume (e.g., a sudden, uncharacteristic increase), which could indicate data exfiltration or active C2 communications."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]