[
  {
    "information_requirement": "Is an adversary using remote services to gain initial access to the ICS network? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful RDP connection (TCP port 3389) originates from an IP address not authorized for direct access to the OT network (e.g., non-jump host IT asset, external IP) or occurs outside of defined operational hours/maintenance windows, targeting a critical OT asset (e.g., HMI, PLC, EWS).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Security Event ID 4624",
              "Microsoft-Windows-TerminalServices-LocalSessionManager/Operational Event ID 21"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Network Perimeter (ICS DMZ), Jump Servers, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Networks (PCN).",
            "action": "1. **Symbolic Logic**: Identify successful RDP connections (Zeek conn.log, TCP port 3389, and Windows Event ID 4624 with Logon Type 10) where the source IP is *not* within the known list of authorized jump hosts or IT/OT gateway devices. Cross-reference destination IPs against a list of critical OT assets (HMIs, PLCs, EWS). Alert on any direct connections from non-authorized sources to critical OT assets. 2. **Statistical Method**: For each OT asset, establish a baseline of typical RDP connection times and durations over the past 30 days. Calculate the 95th percentile for connection frequency and duration. Flag connections that occur outside of a predefined operational window (e.g., 08:00-17:00 M-F) or whose duration exceeds the 95th percentile, especially if originating from a non-standard internal source. 3. **Machine Learning**: Train a user behavior analytics (UBA) model on historical RDP login patterns (source IP, user account, time, day of week, duration) using Zeek rdp.log and Windows Event ID 4624 data. Use a clustering or classification algorithm (e.g., Isolation Forest, One-Class SVM) to detect RDP sessions that are statistically anomalous compared to the learned 'normal' behavior for specific users or destination hosts, indicating a potential compromise or unauthorized access."
          },
          {
            "description": "A rapid succession (e.g., >50 attempts within 5 minutes) of failed login attempts (Windows Security Event ID 4625) to remote services (RDP, SMB) from a single source IP, immediately followed by a successful login (Windows Security Event ID 4624) to the same or another OT asset.",
            "data_sources": [
              "Windows Security Event ID 4625",
              "Windows Security Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing remote access servers (e.g., VPN concentrators), Jump Servers, ICS DMZ, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs).",
            "action": "1. **Symbolic Logic**: Identify any source IP in Zeek conn.log (ports 3389 or 445) that generates more than 20 failed login attempts (Windows Event ID 4625) to a specific destination host within a 5-minute window, and subsequently records a successful login (Windows Event ID 4624, Logon Type 10) from the *same* source IP to *any* host within the OT network within the next 15 minutes. 2. **Statistical Method**: For each destination host, calculate the 99th percentile for the rate of failed RDP/SMB logins (Event ID 4625) from unique source IPs over a 24-hour rolling window. Alert when the current rate from a single source IP significantly exceeds this percentile (e.g., >3 standard deviations), particularly if followed by a successful login, indicating potential brute-force or password spraying. 3. **Machine Learning**: Implement a time-series anomaly detection model (e.g., ARIMA, Prophet) on the aggregate count of failed RDP/SMB login attempts (Event ID 4625) across all OT assets. Detect sudden, uncharacteristic spikes in failed login volumes that deviate significantly from predicted normal ranges. Further, use a sequence classification model to identify attack patterns like 'multiple failures followed by a single success' across different users or hosts from the same source IP."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using remote services for lateral movement within the ICS network? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0886",
        "name": "Remote Services",
        "evidence": [
          {
            "description": "A successful RDP connection (TCP port 3389) is observed between two hosts within the OT network where no such connection has been recorded in the historical baseline (e.g., past 90 days), or where the source/destination host role combination is highly unusual (e.g., HMI to HMI, PLC to EWS).",
            "data_sources": [
              "Zeek rdp.log",
              "Zeek conn.log",
              "Windows Security Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Programmable Logic Controllers (PLCs) with RDP capabilities, Remote Terminal Units (RTUs).",
            "action": "1. **Symbolic Logic**: Maintain a whitelist of all authorized internal RDP source-destination IP pairs and associated user accounts within the OT network, based on a 90-day historical baseline from Zeek conn.log and Windows Event ID 4624. Alert on any RDP connection that is not present in this whitelist, especially if it involves administrative user accounts or critical OT assets. 2. **Statistical Method**: For each internal OT host, calculate the entropy of destination hosts it connects to via RDP (Zeek conn.log, port 3389) over a rolling 24-hour window. Flag connections where the entropy score drops significantly (e.g., below the 5th percentile) or if a single source initiates RDP connections to an unusually high number of distinct destination hosts (e.g., >3 standard deviations from the mean for that source). 3. **Machine Learning**: Build a network communication graph using RDP session data (Zeek conn.log, Zeek rdp.log) and Windows Event ID 4624 for internal OT hosts. Apply a graph anomaly detection algorithm (e.g., node2vec with Isolation Forest) to identify new or unusual RDP communication paths (new edges) or sudden changes in communication patterns that deviate from the established normal graph structure over time."
          },
          {
            "description": "An SMB connection (TCP port 445) to an administrative share (e.g., 'C$', 'ADMIN$') or a non-standard share is observed on a critical OT asset (e.g., EWS, HMI), or the transfer of known malicious file types (e.g., .exe, .dll, .bat, .ps1, .vbs) or ICS project files (.ACD, .L5K, .PRO) occurs via SMB to/from an unusual source/destination within the OT network.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Zeek smb_files.log",
              "Windows Security Event ID 4624",
              "Windows Security Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Data Historians, Process Control Servers, Domain Controllers within the OT network, File Servers within the OT network, PLC programming terminals.",
            "action": "1. **Symbolic Logic**: Monitor Zeek smb_mapping.log for access to administrative shares (e.g., 'C$', 'ADMIN$') or other highly sensitive shares on critical OT assets (EWS, HMIs). Additionally, monitor Zeek smb_files.log for the transfer of executable files (e.g., .exe, .dll, .ps1, .bat, .vbs) or ICS project files (.ACD, .L5K, .PRO, .RSLogix) from any internal OT host to another, where the source or destination is not a designated software update server or known engineering repository. Correlate with Windows Event ID 4688 for suspicious process creation after file transfer. 2. **Statistical Method**: Establish a 60-day baseline of SMB file transfer volumes and frequencies (Zeek smb_files.log) between specific source-destination pairs within the OT network. Calculate the 99th percentile for daily transfer volume and file count for each pair. Alert when current SMB activity significantly exceeds these baselines (e.g., >2 standard deviations) or when the entropy of file extensions transferred from a single source host drops unexpectedly low, indicating repetitive, potentially malicious transfers. 3. **Machine Learning**: Develop a user-entity behavior analytics (UEBA) model using SMB audit data (Zeek smb_mapping.log, smb_files.log, Windows Event ID 5145) to profile normal SMB access patterns for each user and host within the OT network. Use an unsupervised anomaly detection algorithm (e.g., autoencoders, DBSCAN) to identify SMB sessions that exhibit unusual characteristics in terms of accessed shares, file types, transfer sizes, or source/destination pairs, flagging potential lateral movement or data exfiltration attempts."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]