[
  {
    "information_requirement": "Is an adversary inhibiting our response function by blocking critical reporting messages? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0804",
        "name": "Block Reporting Message",
        "evidence": [
          {
            "description": "Unexpected termination of a whitelisted critical ICS application process (e.g., opcserver.exe, hmi_client.exe) on a Windows-based HMI or historian, followed by a statistically significant and sustained drop in associated ICS protocol traffic (e.g., Modbus, DNP3) originating from or destined for that host, indicating a loss of reporting messages.",
            "data_sources": [
              "Windows Event ID 4689",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Historian Servers, OPC Servers within the Process Control Network (PCN) segments.",
            "action": "1. Symbolic Logic: Create a rule that triggers on Windows Event ID 4689 (A process has exited) for any process name on a watchlist of critical ICS applications (e.g., opcserver.exe, rslinx.exe). Upon trigger, query for Windows Event ID 4688 (A new process has been created) from the same host within the prior 30 seconds to identify the parent process. Generate a high-priority alert if the parent process is an interactive shell or remote administration tool (e.g., cmd.exe, powershell.exe, psexec.exe) and the event occurs outside of a documented maintenance window. 2. Statistical Method: For each critical ICS application host, establish a 14-day rolling baseline of expected network traffic volume (e.g., sum of orig_bytes + resp_bytes per minute) on its specific ICS protocol port (e.g., TCP 502) using Zeek conn.log. Upon detection of a critical process termination (Event ID 4689), query the traffic volume for the subsequent 5-minute interval. Generate an alert if the average traffic volume drops below the 5th percentile of the historical baseline, indicating a statistically significant loss of reporting capability directly correlated with the process termination. 3. Machine Learning/Time-Series Anomaly Detection: For each critical reporting host, develop a time-series forecasting model (e.g., ARIMA, Prophet) trained on historical Zeek conn.log data (e.g., total bytes per minute on ICS ports). The model will predict the expected traffic volume for the next time interval. Generate an alert when the observed traffic volume falls below the model's prediction interval (e.g., the lower bound of the 95% confidence interval) for a sustained period (e.g., > 3 minutes), especially if this anomaly is temporally correlated with a critical process termination event (Windows Event ID 4689) on the same host."
          },
          {
            "description": "A new or modified host-based firewall rule is created on a critical ICS asset that explicitly blocks an ICS protocol port (e.g., TCP 502 for Modbus). This change is immediately followed by a sustained and measurable cessation of expected reporting traffic on that port, which is not correlated with a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 4947",
              "Windows Event ID 4950",
              "Windows Event ID 4956",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMIs, Historian Servers, Application Servers in the Process Control Network (PCN), and Industrial Demilitarized Zone (IDMZ) servers that bridge IT/OT networks.",
            "action": "1. Symbolic Logic: Create and maintain a watchlist of critical ICS assets and their associated ICS protocol ports. Monitor these assets for Windows Event IDs 4947 (Rule Added), 4950 (Setting Changed), or 4956 (Rule Modified). Upon detection, parse the event to identify the Rule Action ('Block'), Direction, and Port. Generate a high-priority alert if a 'Block' rule is applied to a monitored ICS port on a critical asset. Cross-reference the alert timestamp with the change management database to suppress alerts for authorized activities. 2. Statistical Method: For each critical asset and ICS port, establish a 14-day rolling baseline of traffic volume (e.g., sum of orig_bytes + resp_bytes per minute) from Zeek conn.log. Upon detection of a firewall rule change matching the symbolic logic, query the traffic volume for the 10 minutes following the event. Generate an alert if the post-event average traffic volume has dropped by more than three standard deviations or below the 5th percentile compared to the baseline, signifying a statistically significant traffic disruption. 3. Machine Learning/Classification: Train a supervised classification model (e.g., Random Forest) to distinguish between benign and malicious firewall changes using historical Windows Event IDs 4947/4950/4956. Engineer features such as: is_ics_port (boolean), is_critical_asset (boolean), time_of_day_bucket (e.g., business_hours, off_hours), user_is_service_account (boolean), and is_in_change_window (boolean). Deploy the model to score new firewall change events in real-time. Generate an alert for any change classified as 'malicious' with a confidence score > 0.85, providing the top contributing features to the analyst for faster investigation."
          },
          {
            "description": "A denial-of-service condition targeting a critical ICS reporting endpoint (e.g., HMI, Historian) is identified by a sudden, anomalous surge in network traffic that overwhelms the endpoint's capacity to process legitimate reporting messages. This results in a measurable cessation or severe degradation of valid ICS protocol communications from expected sources.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of HMIs, Historians, and Control Servers; network segments/VLANs dedicated to process control.",
            "action": "1. Symbolic Logic: From Zeek conn.log, monitor the ratio of failed connections (conn_state = 'S0', 'REJ', 'RSTR') to total connection attempts for critical ICS endpoints on their reporting ports. Generate an alert if this ratio exceeds 80% over a 5-minute window. As a secondary condition, confirm that the volume of legitimate traffic (e.g., service = 'modbus') from known, trusted SCADA sources to the same endpoint has dropped by more than 90% compared to the previous 1-hour average. 2. Statistical Method: Establish a 30-day baseline for each critical ICS endpoint, calculating the mean and standard deviation of a) total inbound connections per minute, and b) the Shannon entropy of source IP addresses connecting to ICS ports. Trigger an alert if the connection count exceeds the baseline mean by 5 standard deviations AND the source IP entropy score drops significantly (indicating a flood from few sources). Correlate this with a simultaneous drop in established connection durations ('duration' field in conn.log) for legitimate traffic, suggesting service degradation. 3. Machine Learning/Anomaly Detection: Implement an unsupervised anomaly detection model, such as an Isolation Forest, on a stream of feature vectors derived from Zeek conn.log data, aggregated per minute for each critical ICS endpoint. Features should include: connection_count, failed_connection_ratio, source_ip_entropy, avg_packet_size, total_byte_volume, and protocol_mix_entropy. Train the model on at least 30 days of normal operational traffic. An alert is triggered if the anomaly score for a new 1-minute vector surpasses a dynamic threshold (e.g., the 99th percentile of scores from the training data), indicating a significant deviation from normal network behavior characteristic of a DoS attack."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]