[
  {
    "information_requirement": "Is the adversary attempting to inhibit response functions by blocking command messages? (TA0107 - Inhibit Response Function)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0803",
        "name": "Block Command Message",
        "evidence": [
          {
            "description": "A critical control command is logged as initiated by an HMI application (e.g., via a custom application log or Windows Event ID 4688 showing the HMI process execution with specific parameters), but within a defined time window (e.g., 5-10 seconds), no corresponding outbound network connection is observed in Zeek conn.log from the HMI to the target PLC on the expected ICS protocol port (e.g., TCP 502, 20000, 44818). Alternatively, the connection is established, but no corresponding stateful application-layer response from the PLC (e.g., a Modbus response function code in modbus.log) is recorded. This command failure correlates with a sustained, anomalous increase (e.g., exceeding the 99th percentile of a historical baseline) in network traffic volume (bytes or packets per second) on the control network segment, suggesting a resource exhaustion or denial-of-service attack is preventing command delivery.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek s7comm.log",
              "Zeek ethernetip.log",
              "Windows Event ID 4688",
              "HMI Application Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network Zone (between HMIs/SCADA Servers and PLCs/RTUs), HMI/SCADA Server Endpoints",
            "action": "1. Symbolic Logic: Correlate HMI application logs or Windows Event ID 4688 (Process Creation) events indicating a command initiation with network logs. For each command event, execute a time-bound query (e.g., within 10 seconds) against Zeek logs. Alert with high severity if a join on source IP (HMI), destination IP (PLC), and timestamp fails to find either: (a) a corresponding Zeek conn.log entry with `orig_bytes` > 0 on the expected ICS port (e.g., 502, 44818), or (b) a corresponding entry in a protocol-specific log (e.g., `modbus.log`, `s7comm.log`) showing a valid response from the PLC. The absence of both indicates a potential block. 2. Statistical Method: For each critical network segment (defined by VLAN or subnet), establish a 30-day rolling baseline of key network metrics from Zeek conn.log, including `bytes_per_second`, `packets_per_second`, and the Shannon entropy of source/destination port pairs. Continuously monitor these metrics. Generate a medium-severity alert if any metric exceeds the 99th percentile of its historical baseline for a sustained period (e.g., >60 seconds). Correlate this alert with a symbolic logic alert for command failure to increase confidence to high. 3. Machine Learning Application: Deploy a multivariate time-series anomaly detection model (e.g., VAE or LSTM-based autoencoder) on aggregated Zeek conn.log data for critical HMI-to-PLC communication flows. Features should include traffic volume (bytes, packets), connection duration, protocol, and connection state. Train the model on at least 30 days of benign operational data. Trigger a high-confidence alert when the model's reconstruction error for a live traffic window exceeds a dynamically tuned threshold, indicating a significant deviation from learned normal behavior suggestive of a network flood or disruption."
          },
          {
            "description": "An unauthorized or anomalous new or modified host-based firewall rule is observed on an Engineering Workstation (EWS) or Human-Machine Interface (HMI). The rule explicitly denies outbound communication to a critical PLC's IP address or subnet over standard ICS protocol ports (e.g., TCP 502, TCP/UDP 44818), preventing legitimate control commands. This is detected by monitoring Windows security event logs for firewall configuration changes and correlating with subsequent blocked connection events.",
            "data_sources": [
              "Windows Event ID 4945",
              "Windows Event ID 4947",
              "Windows Event ID 4950",
              "Windows Event ID 5157"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Control Servers",
            "action": "1. Symbolic Logic: Maintain a version-controlled whitelist of approved host-based firewall rules for critical HMI/EWS assets. Monitor for Windows Event ID 4947 (rule modified) or 4945 (rule added). For any such event, parse the rule details. Generate a high-severity alert if a new or modified rule contains an 'Action: Block', targets a 'RemoteAddress' within a critical PLC subnet, and specifies a 'RemotePort' used for ICS protocols (e.g., 502, 20000, 44818). Enrich the alert with the 'UserID' from the event and cross-reference against a list of authorized administrators. 2. Statistical Method: For each critical HMI/EWS, establish a 30-day rolling baseline for the hourly count of firewall change events (IDs 4945, 4947, 4950). Calculate the mean and standard deviation. Generate a medium-severity alert if the count of these events in a one-hour window exceeds 3 standard deviations from the mean, indicating an unusual level of configuration activity that warrants investigation. 3. Machine Learning Application: Train a classification model (e.g., Gradient Boosting) using historical Windows firewall event logs (IDs 4945, 4947) labeled as 'authorized' or 'unauthorized' based on change control records. Features should include categorical representations of RuleName, Action, Direction, Protocol, RemoteAddress (as a subnet category), RemotePort, and the User making the change. Deploy the model to score all new firewall changes in real-time, alerting on any change classified as 'unauthorized' with high confidence. Correlate with subsequent Windows Event ID 5157 (WFP blocked a connection) events matching the rule's criteria."
          },
          {
            "description": "An unapproved change in the MAC address associated with a critical PLC's static IP address is detected in network traffic (e.g., Zeek arp.log), indicating a potential ARP spoofing/poisoning attack. This is often accompanied by a high volume of gratuitous ARP messages from an attacker-controlled host, intended to redirect and drop legitimate command traffic.",
            "data_sources": [
              "Zeek arp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control Network Switches, Control Network Gateways, Critical PLC Network Interfaces",
            "action": "1. Symbolic Logic: Maintain a static, authoritative IP-to-MAC address mapping table for all critical ICS devices. Continuously monitor Zeek arp.log. Generate a high-severity alert immediately if an ARP event shows a 'mac' for a critical 'id.orig_h' (IP address) that does not match the authoritative table. Additionally, alert if a gratuitous ARP reply (opcode: 2) for a critical IP originates from an IP or MAC address not authorized to do so. 2. Statistical Method: For each critical PLC IP address, establish a 7-day rolling baseline of ARP event frequency from Zeek arp.log. Alert if the rate of ARP events for a single IP exceeds 3 standard deviations from the baseline in a 5-minute window. Separately, count the number of unique MAC addresses observed for each critical IP in a 5-minute sliding window. Generate a high-severity alert if this count is greater than 1, as static devices should only have one MAC address. 3. Machine Learning Application: Use an unsupervised anomaly detection model (e.g., Isolation Forest) on Zeek arp.log data. Key features should include the source IP, destination IP, MAC address, ARP opcode, and the time delta since the last ARP for that IP. Train the model on at least 30 days of normal network operation. The model will learn the normal patterns of ARP traffic. Alert when a new event or sequence of events receives a high anomaly score, indicating a deviation like ARP flooding, rapid IP-MAC changes, or unusual gratuitous ARP activity. Calculate the Shannon entropy of MAC addresses seen per IP over a time window and alert on sudden drops, which can indicate a successful poisoning where one MAC dominates."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.4",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]