[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via external remote services? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0822",
        "name": "External Remote Services",
        "evidence": [
          {
            "description": "A successful login event (Windows Event ID 4624) to an ICS-facing remote access service, where the Logon Type is 10 (RemoteInteractive), 3 (Network), or 7 (Unlock), and one or more of the following conditions are met: 1. The `Source_Network_Address` has no successful login history for the `Target_User_Name` in the last 90 days. 2. The geolocated country or ASN of the `Source_Network_Address` (from Zeek conn.log correlated with geoIP data) is new for the `Target_User_Name` in the last 90 days. 3. The `Logon_Time` is anomalous, falling outside the 95th percentile of the user's established login hour distribution for that day of the week.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Demarcation Zone (DMZ), VPN Concentrators, Remote Access Gateways, Jump Boxes, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Authentication Servers within ICS DMZ",
            "action": "1. (Symbolic Logic) For each successful login (Windows Event ID 4624 with Logon Type 3, 7, or 10) to a designated ICS remote access asset, perform the following checks: a) Correlate the `Source_Network_Address` with Zeek conn.log and geoIP data. b) Verify if the `Source_Network_Address` or its geolocated country/ASN is on an explicit allowlist for that `Target_User_Name` or role. c) Check if the `Source_Network_Address` or its country/ASN has been seen for that `Target_User_Name` in a 90-day lookback. d) Cross-reference the `Source_Network_Address` against a threat intelligence feed of known malicious IPs. Generate a high-priority alert if the source is not on the allowlist, is 'first-seen' for the user, or matches a malicious IP, especially for privileged accounts. 2. (Statistical Method) For each `Target_User_Name`, maintain a 90-day rolling baseline of remote access activity. This baseline must include: a) A set of historically observed source countries and ASNs. b) A distribution of login times (hour of day, day of week). c) A set of user-agents from web-based access portals (from Zeek http.log). Generate a risk score for each new login. Increment the score for deviations: +N for a new country, +M for a login time >2 standard deviations from the mean for that day, +K for a new user-agent. Alert when the composite risk score exceeds a dynamically tuned threshold. 3. (Machine Learning) Develop a supervised classification model (e.g., Random Forest) trained on historical login data (Windows Event ID 4624). Features should include: `Logon_Time` (cyclical features for hour/day), `Source_Network_Address` (as a categorical feature or its reputation score), geolocated country/ASN, `Target_User_Name` role/privilege level, and the criticality of the target asset (from a CMDB). The model will predict a probability of the login being malicious. Flag logins with a probability score in the top 1% for analyst review."
          },
          {
            "description": "A single `Source_Network_Address` generates a high volume of failed login attempts (Windows Event ID 4625) against an ICS remote access service. This is characterized by: 1. Brute Force: More than 10 failed login attempts against a single `Target_User_Name` within 60 seconds. 2. Password Spraying: Failed login attempts against more than 15 distinct `Target_User_Name` accounts from the same source IP within a 10-minute window. Look for `Status` code 0xC000006D and `Sub_Status_Code` 0xC000006A (bad password) or 0xC0000064 (user not found).",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers for Remote Access (e.g., Active Directory Domain Controllers), RADIUS servers, VPN Concentrators, Remote Access Gateways, ICS/OT Firewalls",
            "action": "1. (Symbolic Logic) From Windows Event ID 4625 logs, trigger an alert if a single `Source_Network_Address` generates failed logins where: a) The count for a single `Target_User_Name` with `Sub_Status_Code` 0xC000006A exceeds 10 in a 60-second window (brute force). b) The count of distinct `Target_User_Name`s with `Sub_Status_Code` 0xC000006A exceeds 15 in a 10-minute window (password spray). Prioritize alerts for sources targeting privileged ICS accounts (e.g., engineers, administrators). 2. (Statistical Method) For each remote access gateway, establish a 30-day baseline for the rate of failed logins (Windows Event ID 4625). Alert if the current 5-minute rate exceeds the 99th percentile of the historical distribution. Additionally, for each `Source_Network_Address`, calculate the Shannon entropy of `Target_User_Name`s attempted in a 10-minute window. A sharp increase in entropy (e.g., >3 standard deviations from the IP's historical average) indicates a password spraying attempt. 3. (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) on Windows Event ID 4625 data. Features for each `Source_Network_Address` should include: total failed login count, number of unique `Target_User_Name`s, ratio of `bad password` (0xC000006A) to `user not found` (0xC0000064) failures, and time-of-day patterns. This can identify clusters of coordinated or automated attack traffic that deviate from the benign noise of normal failed logins."
          },
          {
            "description": "Following a successful remote access login (Windows Event ID 4624), the session exhibits anomalous post-access behavior, such as: 1. The user's source IP (`id.orig_h` in Zeek) initiates connections to an unusually high number of distinct internal ICS hosts (`id.resp_h`) or ports (`id.resp_p`). 2. The session involves communication using unexpected ICS protocols (e.g., Modbus, DNP3) or administrative ICS protocol function codes. 3. The session's total data transfer volume (`orig_bytes` + `resp_bytes` in Zeek conn.log) significantly exceeds the user's historical average for a remote session. 4. The session generates DNS queries (`query` in Zeek dns.log) or HTTP requests (`host`/`uri` in Zeek http.log) to known malicious or newly-observed external domains.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal ICS Network Segments, ICS Engineering Workstations, Human-Machine Interfaces (HMIs) Servers, SCADA Servers, Data Historian Servers, Programmable Logic Controllers (PLCs)",
            "action": "1. (Symbolic Logic) Correlate a successful remote login (Windows Event ID 4624) with subsequent network traffic from that `Source_Network_Address` (`id.orig_h` in Zeek logs). Alert if: a) The session communicates with a critical ICS asset (e.g., PLC, safety controller) that is not on the user's explicit access allowlist. b) The session uses ICS protocol function codes (e.g., Modbus 'Write Single Coil') that are restricted for that user. c) DNS or HTTP logs show connections to domains on a threat intelligence feed. d) File transfers (Zeek files.log) involving executable or script files are observed. 2. (Statistical Method) For each `Target_User_Name`, establish a 30-day baseline of post-login behavior. Metrics should include: a) 99th percentile of unique internal hosts (`id.resp_h`) contacted per session. b) 99th percentile of total session data volume (`orig_bytes` + `resp_bytes`). c) Distribution of protocols (`proto`) and destination ports (`id.resp_p`). d) Shannon entropy of destination ports. Alert if a live session exceeds these statistical thresholds by a significant margin (e.g., >3 standard deviations or outside the 99th percentile). 3. (Machine Learning) Employ an unsupervised anomaly detection model (e.g., Isolation Forest or Autoencoder) on session-based features from Zeek logs, following a successful remote login. Features should include: count of unique `id.resp_h`, total data volume, protocol distribution, destination port entropy, connection duration statistics (mean, max, stddev), connection state distribution (e.g., count of `S0`, `S1`, `REJ` states), and counts of specific ICS protocol commands (from `modbus.log`, etc.). Flag sessions with high anomaly scores for immediate analyst investigation as potential lateral movement or reconnaissance."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]