[
  {
    "information_requirement": "Is the adversary attempting to blind operators to the state of the industrial process by causing a Loss of View? (TA0105 - Impact) (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0829",
        "name": "Loss of View",
        "evidence": [
          {
            "description": "A critical Human-Machine Interface (HMI) process (e.g., view.exe, iFIX.exe, FactoryTalkView.exe) exhibits signs of instability or abnormal termination. This is evidenced by: a high frequency of application error or hang events (Windows Event ID 1000, 1002); a process terminating (Windows Event ID 4689) without an immediate and corresponding restart (Windows Event ID 4688); or a complete cessation of application-specific log entries where they are normally expected.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Windows Event ID 4688",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Operator Workstations and HMI Servers within the Level 2 (Supervisory) and Level 3 (Control) zones of the Process Control Network (PCN), including any associated DMZ for remote HMI access.",
            "action": "1. Symbolic Logic: Define a watchlist of critical HMI process names. Query for Windows Event IDs 1000 or 1002 where the faulting process name is on the watchlist. Trigger a high-priority alert if the count exceeds 3 events on one host within a 60-second window. Separately, trigger an alert if a Windows Event ID 4689 (Process Termination) for a watched process is not followed by a Windows Event ID 4688 (Process Creation) for the same process on the same host within 30 seconds, indicating an unrecovered crash. 2. Statistical Method: For each critical HMI process, establish a 7-day baseline of the count of Event IDs 1000/1002 per 5-minute interval and calculate the 99th percentile. In real-time, monitor the 5-minute count and trigger an alert if it exceeds this threshold. Separately, for HMI processes that auto-restart, baseline the time delta between termination (4689) and restart (4688). Trigger an alert if a process terminates and is not restarted within a period exceeding 3 standard deviations from the mean restart time. 3. Machine Learning: 1. Feature Engineering: Create a time-series dataset from HMI hosts with features per 1-minute interval: count of Event ID 1000, count of Event ID 1002, and count of Event ID 4689. 2. Model Training: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on at least 30 days of historical data to learn normal HMI stability patterns. 3. Inference & Alerting: Apply the trained model to live data streams. Generate an alert if the model outputs an anomaly score exceeding a tuned threshold (e.g., > 0.7), indicating a significant deviation from learned normal behavior."
          },
          {
            "description": "A sustained and statistically significant reduction in expected periodic network traffic from Level 0/1 devices (PLCs, RTUs) to Level 2/3 systems (Data Historian, HMI). This is observed as a complete stop in communication or a drop in data volume or frequency below a historical baseline in Zeek logs for protocols such as Modbus, DNP3, or EtherNet/IP.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek opcua.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical network segments (e.g., managed switches, industrial firewalls) at the Level 1.5 (Industrial Demilitarized Zone/IDMZ) and Level 2 (Supervisory) boundaries within the Process Control Network (PCN), specifically those carrying traffic between Level 0/1 devices (PLCs, RTUs) and Level 2/3 systems (HMI, Historian, Engineering Workstations).",
            "action": "1. Symbolic Logic: Define a list of critical communication pairs (e.g., PLC_IP -> Historian_IP on port 502/TCP for Modbus). Establish the expected maximum polling interval for each pair (e.g., 5 seconds). Query Zeek conn.log or protocol logs (e.g., modbus.log) in real-time. Trigger an alert if no communication is seen for a specific pair for a duration exceeding 3 times its normal interval (e.g., > 15 seconds). 2. Statistical Method: For each critical communication flow, establish a 7-day rolling baseline for metrics per 1-minute interval: total bytes (orig_bytes + resp_bytes) from conn.log, and message count from protocol-specific logs. Calculate the 5th percentile for these baseline metrics. Trigger an alert if the current 1-minute value for any metric drops below its 5th percentile threshold for 3 consecutive minutes. Additionally, calculate the Shannon entropy of the 'function_code' field in modbus.log over a 5-minute window; an alert is triggered if the entropy drops below the 10th percentile of its baseline, indicating a loss of operational command diversity. 3. Machine Learning: 1. Feature Engineering: For each critical flow, create a time-series dataset with features per 5-minute interval: total bytes, packet count, connection duration variance, and protocol-specific message counts. 2. Model Training: Train a time-series forecasting model (e.g., SARIMA) on 30+ days of historical data to predict the expected traffic volume and its confidence interval. 3. Inference & Alerting: Compare real-time traffic volume against the model's forecast. Generate an alert if the observed volume falls below the lower bound of the 99% prediction interval for a sustained period (e.g., > 10 minutes)."
          },
          {
            "description": "An anomalous surge in failed or incomplete network connections targeting a critical HMI server, indicative of a Denial-of-Service (DoS) or resource exhaustion attack. This is evidenced by a high volume of failed connection states (e.g., 'S0', 'REJ') in Zeek conn.log or a high rate of blocked packets (Windows Event ID 5156) on the HMI server itself, preventing legitimate operator access.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments (e.g., industrial firewall interfaces, core switches) hosting critical HMI Servers within the Level 2 (Supervisory) zone of the Process Control Network (PCN) and any associated IDMZ or enterprise DMZ enabling remote access to HMI systems.",
            "action": "1. Symbolic Logic: Define a list of HMI server IPs and their application ports. Query Zeek conn.log for connections to these assets with a 'conn_state' of 'S0', 'REJ', or 'RSTO'. Trigger an alert if a single source IP generates >30 such connections in 30 seconds OR if the total count from all sources exceeds >100 in 60 seconds. Separately, query Windows Event ID 5156 on HMI servers and trigger an alert if inbound blocked packet counts from a single source exceed >50 in 60 seconds. 2. Statistical Method: For each HMI server, establish a 7-day baseline for the 5-minute rolling average of: (a) total new connections, and (b) the ratio of failed connections ('S0', 'REJ', 'RSTO') to total connections. Calculate the 99th percentile for metric (a) and the 95th percentile for metric (b). Trigger an alert if the current 5-minute average for total connections exceeds its 99th percentile AND the failed connection ratio exceeds its 95th percentile simultaneously. 3. Machine Learning: 1. Feature Engineering: From Zeek conn.log traffic to HMI servers, create feature vectors per 1-minute interval including: connection rate, Shannon entropy of source IPs, Shannon entropy of source ports, ratio of 'S0' to 'SF' states, and average connection duration. 2. Model Training: Train an unsupervised anomaly detection model (e.g., One-Class SVM) on at least 30 days of normal traffic patterns. 3. Inference & Alerting: Apply the model to live traffic. Generate an alert if a data point is classified as an outlier (anomaly), indicating a pattern consistent with a DoS attack or aggressive network scanning."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.4",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]