[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS environment via spearphishing attachments? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0865",
        "name": "Spearphishing Attachment",
        "evidence": [
          {
            "description": "An email is received by a high-value ICS target (e.g., a member of the 'ICS_Engineers' AD group) from an external source, where the sender's domain is not on an organizational allowlist. The email, identified in Zeek smtp.log, contains an attachment, identified by correlating the 'fuid' to Zeek files.log. The attachment has a suspicious file type (e.g., .exe, .vbs, .docm, .xlsm, or ICS-specific project files like .ACD, .PCV, .S7P) or the attachment filename or email subject line contains ICS-specific keywords (e.g., 'PLC Update', 'SCADA Alert', 'HMI Configuration', 'firmware').",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway, OT Network Mail Relay (if present), Corporate-to-OT DMZ, Engineering Workstations (local email client logs), Control System Network (for internal email traffic if applicable)",
            "action": "1. Symbolic Logic: Create and maintain watchlists for: a) high-risk ICS personnel email addresses, b) suspicious file extensions (including .exe, .scr, .lnk, .docm, .xlsm, .ACD, .PCV), and c) ICS-specific keywords ('PLC', 'HMI', 'firmware', 'SCADA'). Construct a query to join Zeek smtp.log and files.log on the 'fuid' field. Generate a high-priority alert if an email meets all the following criteria: 'rcpt_to' is on the personnel watchlist, sender's domain is external, and the attachment's 'filename' or 'mime_type' is on the suspicious file list OR the 'subject' or 'filename' contains a keyword from the ICS watchlist.\n2. Statistical Method: For all external emails to high-risk ICS personnel, calculate the Shannon entropy of the attachment filename from Zeek files.log. Establish a 90-day rolling baseline of filename entropy for legitimate attachments. Alert when an attachment's filename entropy exceeds the 99th percentile of this baseline. Additionally, track the historical frequency of sender domains to this user group. Alert if an email with a suspicious attachment comes from a domain that is new or falls below the 1st percentile of observed frequency (i.e., is extremely rare).\n3. Machine Learning: Implement a supervised classification model (e.g., Gradient Boosting, Random Forest) trained on historical email metadata to predict if an email is phishing. Features should include: sender domain age and reputation (via enrichment), presence of ICS keywords, attachment MIME type, attachment filename entropy, and historical communication frequency between sender and recipient. Generate a critical alert when the model classifies an incoming email to a high-risk user as 'phishing' with a confidence score > 0.90."
          }
        ]
      },
      {
        "technique_id": "T0863",
        "name": "User Execution",
        "evidence": [
          {
            "description": "On an ICS asset (e.g., Engineering Workstation, HMI), a Windows Event ID 4688 shows a process creation where the 'ParentProcessName' is a common document handler or email client (e.g., 'WINWORD.EXE', 'ACROBAT.EXE', 'OUTLOOK.EXE') and the 'NewProcessName' is a command-line interpreter, scripting engine, or Living Off the Land Binary (LOLBAS) (e.g., 'cmd.exe', 'powershell.exe', 'wscript.exe', 'certutil.exe', 'mshta.exe'). This event occurs within 5 minutes of an interactive user login (Windows Event ID 4624, LogonType 2) by the same 'SubjectUserName' on the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, Human-Machine Interfaces (HMIs), Operator Consoles, Jump Servers within the OT network",
            "action": "1. Symbolic Logic: On all hosts within the NAI, monitor Windows Event ID 4688. Maintain an explicit baseline of approved parent-child process relationships for the environment. Generate a critical alert if a process pair is observed where 'ParentProcessName' is in ('WINWORD.EXE', 'EXCEL.EXE', 'ACROBAT.EXE', 'OUTLOOK.EXE') and 'NewProcessName' is in ('cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', 'rundll32.exe', 'certutil.exe'), and this specific pair is not on the approved baseline. Correlate the event timestamp with recent email delivery (Zeek smtp.log) to the user within the last 15 minutes to increase confidence.\n2. Statistical Method: For each host in the NAI, calculate the historical frequency of all unique parent-child process pairs from Windows Event ID 4688 over a 30-day baseline. Alert when a new, never-before-seen pair is observed that involves a document handler spawning a scripting engine or LOLBAS. Additionally, for each process creation event, calculate the entropy of the 'CommandLine' field. Alert if the command line entropy for a process like 'powershell.exe' or 'cmd.exe' spawned from an office application exceeds the 98th percentile of its historical baseline, indicating potential obfuscation.\n3. Machine Learning: Deploy a process tree anomaly detection model (e.g., using graph-based algorithms or a Recurrent Neural Network) trained on benign process sequences from Windows Event ID 4688 on ICS workstations. The model should analyze features like process names, parent-child relationships, command-line arguments, and process integrity levels. Generate a high-severity alert when the model flags a process execution chain originating from a document handler or email client with an anomaly score greater than 0.9, indicating a significant deviation from learned safe behavior."
          },
          {
            "description": "A process, identified by the previous evidence as suspicious (e.g., 'powershell.exe' with a parent of 'WINWORD.EXE'), initiates an outbound network connection from an ICS asset. This connection, observed in Zeek logs, exhibits one or more anomalous characteristics: 1) The destination IP ('id.resp_h' in conn.log) or domain ('query' in dns.log) is present on a threat intelligence feed. 2) The TLS Server Name Indication ('server_name' in ssl.log) is a newly observed domain or uses a self-signed certificate ('issuer' matches 'subject' in x509.log). 3) The connection uses a non-standard port or protocol combination for the source host. 4) The JA3/JA3S TLS fingerprint in ssl.log is associated with known malware tooling.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, HMIs, Operator Consoles, OT Network Egress Firewalls, Industrial Demilitarized Zone (IDMZ) Firewalls, Corporate-to-OT DMZ",
            "action": "1. Symbolic Logic: Correlate the ProcessID from a suspicious Windows Event ID 4688 with network connection logs. Join this with Zeek logs on source IP and a short time window (+/- 60 seconds). Generate a critical alert if the 'id.resp_h' (destination IP), 'query' (DNS query), or 'server_name' (TLS SNI) matches an entry in a threat intelligence feed. Also, alert if the 'validation_status' in Zeek ssl.log is 'self-signed' for a connection initiated by a suspicious process.\n2. Statistical Method: For each host in the NAI, establish a 30-day baseline of normal network behavior, including common destination ports, protocols, and data transfer volumes (from Zeek conn.log). Alert if a connection from a suspicious process uses a destination port that falls below the 1st percentile of historical usage for that host (indicating rarity). Additionally, monitor the ratio of outbound to inbound bytes ('resp_bytes' / 'orig_bytes'). Alert if this ratio for a connection deviates by more than 3 standard deviations from the host's baseline, which could indicate data exfiltration.\n3. Machine Learning: Use an unsupervised anomaly detection model (e.g., Isolation Forest, One-Class SVM) on aggregated Zeek log data (conn, dns, ssl, x509) from NAI hosts. The model should be trained on features like connection duration, byte counts, protocol, port, JA3 hash, SNI length/entropy, and DNS query type. Generate a high-severity alert for any connection originating from a process deemed suspicious by prior evidence that receives a high anomaly score from the model, indicating it does not conform to learned normal network patterns."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]