[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via an internet-exposed device?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0883",
        "name": "Internet Accessible Device",
        "evidence": [
          {
            "description": "Detection of inbound TCP connection attempts from an internet IP address (not RFC1918 or on an approved allowlist) to an ICS asset on a designated ICS network segment, targeting common ICS protocol ports (e.g., TCP 102 for S7, TCP 502 for Modbus, TCP 20000 for DNP3, TCP 44818 for EtherNet/IP) or remote access ports (e.g., TCP 5900 for VNC, TCP 3389 for RDP). This includes connections with a Zeek conn_state of 'S0' (SYN sent, no reply) or 'SF' (normal establishment, but with total bytes transferred (orig_bytes + resp_bytes) less than 100 bytes within 5 seconds), indicating scanning or brief exploratory connection attempts.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Zeek sensor at ICS network perimeter",
            "action": "1. Symbolic Logic: Filter Zeek conn.log for new connections (ts >= NOW - 5m) where id.orig_h is an external IP (not RFC1918 or on an approved internal/partner range) and id.resp_h is an IP within the ICS network IP space. Further filter for id.resp_p matching known ICS protocol ports (e.g., 102, 502, 20000, 44818) or common remote access ports (e.g., 5900, 3389). Alert if conn_state is 'S0' (SYN sent, no reply) or if conn_state is 'SF' and total bytes transferred (orig_bytes + resp_bytes) is less than 100 bytes. Cross-reference id.orig_h against a threat intelligence feed for known malicious IPs.\n2. Statistical Method: For each destination port (id.resp_p) within the ICS network, establish a 7-day rolling baseline for the hourly count of unique external source IPs (id.orig_h) initiating 'S0' or 'SF' connections. Calculate the 99th percentile of this hourly count. Generate an alert if the current hourly unique external source IP count for any ICS port exceeds its 99th percentile. Additionally, enrich id.orig_h with GeoIP data and alert on connections originating from countries that fall outside the 95th percentile of historical connection sources for ICS assets (e.g., a new country appearing in the top 5 source countries).\n3. Machine Learning Application: Implement a time-series anomaly detection model (e.g., Prophet, Isolation Forest) on the aggregated hourly count of inbound 'S0' or 'SF' connection attempts to ICS ports from external IPs. Train the model on at least 90 days of Zeek conn.log data. Alert when the model identifies a significant deviation (e.g., 3 standard deviations) from the predicted connection volume for a specific port or asset, indicating a potential scanning or reconnaissance phase."
          },
          {
            "description": "Detection of 5 or more failed remote interactive login attempts (Windows Event ID 4625, Logon Type 10) originating from a single external IP address (not RFC1918 or on an approved allowlist) to a Windows-based ICS asset (e.g., HMI, Engineering Workstation, Jump Server) within a 60-second sliding window, indicating potential brute-force or password spraying activity against an internet-facing ICS system.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint logging on internet-facing ICS assets (HMI, Engineering Workstation, Jump Server)",
            "action": "1. Symbolic Logic: Monitor Windows Event ID 4625 for Logon Type 10 (RemoteInteractive) where Source Network Address is an external IP (not RFC1918 or on an approved internal/partner range). Group events by Source Network Address and Target Account Name within a sliding 60-second window. Trigger an alert if the count of failed logins from a single external IP to any account on an ICS asset exceeds 5. Correlate the Source Network Address and timestamp with Zeek conn.log to confirm external origin and Zeek rdp.log for RDP-specific session failures and RDP client details. Cross-reference the Source Network Address against a threat intelligence feed.\n2. Statistical Method: For each internet-facing ICS asset, establish a 7-day rolling baseline of the hourly rate of unique failed login attempts (Windows Event ID 4625, Logon Type 10) from external IPs per source IP. Calculate the 99th percentile for this hourly rate. Generate an alert when the current hourly rate from a single external IP exceeds this 99th percentile, indicating a statistically anomalous volume of failed attempts. Additionally, track the entropy of target account names attempted by a single source IP over a 5-minute window; a low entropy score (e.g., less than 0.5 for 5+ attempts) suggests targeting a small set of accounts, while high entropy (e.g., greater than 2.0) suggests password spraying across many accounts.\n3. Machine Learning Application: Train a classification model (e.g., Random Forest, Gradient Boosting) using features extracted from Windows Event ID 4625 and Zeek logs (e.g., source IP velocity, unique target account count, time of day, geographic origin, conn_state, RDP protocol version). Label historical brute-force and password spraying attempts. Continuously classify new incoming Windows Event ID 4625 events, alerting on classifications indicative of malicious authentication attacks with a high confidence score (e.g., >0.9)."
          },
          {
            "description": "Detection of a successful remote interactive login (Windows Event ID 4624, Logon Type 10) to an ICS asset (e.g., HMI, Engineering Workstation, PLC programming workstation, or Jump Server) originating from an internet IP address (not RFC1918 or on an approved allowlist) that is not explicitly pre-approved or whitelisted for the specific target user account or destination ICS asset.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint logging on internet-facing ICS assets (HMI, Engineering Workstation, Jump Server)",
            "action": "1. Symbolic Logic: Filter Windows Event ID 4624 for Logon Type 10 (RemoteInteractive). Extract Source Network Address, Target Account Name, and Workstation Name. Correlate with Zeek conn.log to confirm the external origin of the Source Network Address and Zeek rdp.log for RDP session details (e.g., client IP, RDP cookie, duration). Immediately alert if the Source Network Address is not found in a pre-approved external IP whitelist specific to that Target Account Name or destination ICS asset. Cross-reference the Source Network Address against a threat intelligence feed for known malicious IPs.\n2. Statistical Method: For each user account and ICS asset, establish a 90-day rolling baseline of typical login locations (country, ASN from GeoIP/ASN enrichment of Zeek conn.log for id.orig_h), typical login times (hour of day, day of week), and typical source devices/IPs. Alert if a successful login (Windows Event ID 4624, Logon Type 10) exhibits a score exceeding a threshold (e.g., 3 standard deviations) based on a weighted combination of deviations from the baseline (e.g., new country/ASN, login outside typical hours, new source IP). For example, calculate a deviation score for each login based on how far it is from the historical mean for each feature.\n3. Machine Learning Application: Implement a User and Entity Behavior Analytics (UEBA) model (e.g., unsupervised anomaly detection like Isolation Forest or One-Class SVM) on aggregated successful login data (Windows Event ID 4624 and Zeek logs). Train the model on features such as login time, source IP characteristics (e.g., new IP, rare ASN, GeoIP distance from usual logins), target asset, user account, and RDP session duration. Alert when a successful login exhibits a high anomaly score (e.g., exceeding the 95th percentile of normal scores), indicating a significant deviation from established user/asset behavior patterns."
          },
          {
            "description": "Detection of an outbound data transfer from an ICS asset to an internet IP address (not RFC1918 or on an approved allowlist) where the volume of data significantly deviates from established baseline behavior. This deviation is defined as a single connection's resp_bytes (outbound data) exceeding the 99th percentile of historical single connection resp_bytes for that asset, or the cumulative daily resp_bytes for the asset exceeding the 95th percentile of its historical daily total over a 30-day rolling window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Zeek sensor at ICS network perimeter",
            "action": "1. Symbolic Logic: Filter Zeek conn.log for connections where id.orig_h is an ICS internal IP and id.resp_h is an external IP (not RFC1918 or on an approved internal/partner range). Check id.resp_h (or query from Zeek dns.log for resolved IPs) against threat intelligence feeds for known C2 domains or malicious IPs. Immediately alert on any matches (IOC match). Additionally, identify connections to unusual outbound ports (e.g., high/ephemeral ports not typically used for ICS communication) or non-standard protocols that lack corresponding Zeek logs (e.g., no Zeek http.log for port 80/443 traffic).\n2. Statistical Method: For each ICS asset (id.orig_h), establish a 30-day rolling baseline for resp_bytes (outbound data volume) to external destinations using Zeek conn.log. Calculate the 99th percentile for resp_bytes of individual connections. Calculate the 95th percentile for cumulative daily resp_bytes per asset. Generate an alert if any single connection's resp_bytes exceeds its 99th percentile, or if the cumulative daily resp_bytes for an asset exceeds its 95th percentile. Additionally, calculate the entropy of destination ports and protocols for outbound connections from an ICS asset; a sudden increase in entropy could indicate unusual communication patterns.\n3. Machine Learning Application: Apply a time-series anomaly detection model (e.g., ARIMA, Prophet, or Isolation Forest) to the resp_bytes (outbound data volume) from each ICS asset to external destinations, aggregated hourly or daily. Train the model on historical Zeek conn.log data for at least 60 days. Alert on significant, sustained deviations from the predicted outbound data volume (e.g., a sudden, uncharacteristic increase exceeding 3 standard deviations), which could indicate data exfiltration or active C2 communications. Consider clustering outbound connections by destination, volume, and protocol to identify new or unusual clusters of activity."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]