[
  {
    "information_requirement": "Is an adversary using hardcoded credentials to move laterally between ICS assets?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "A single non-service account performs successful remote logins (e.g., RDP, SSH, Telnet) from an unapproved source IP to an anomalously high number of distinct ICS assets within a 30-minute window. Anomaly is defined as an access count exceeding both a fixed threshold (e.g., 5 assets) and the account's historical 99th percentile baseline for that time window.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic and authentication logs from Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA servers, Historian servers, and network segments connecting control devices (PLCs, RTUs, IEDs) within the OT network.",
            "action": "1. Symbolic Logic: Create and maintain whitelists of authorized source IPs (e.g., EWS, Jump Hosts) and service/automation accounts based on asset inventory and user roles. Correlate successful remote authentications (Windows Event ID 4624 Logon Type 3 or 10) with network connection logs (Zeek conn.log) on timestamp and IP addresses. Trigger an initial event for any successful login where the account is not on the service account whitelist and the source IP is not on the authorized source IP whitelist. 2. Statistical Method: For each account triggering the symbolic logic, ingest the destination IP addresses from the connection logs. Calculate a rolling 30-minute count of distinct destination IPs accessed by the account. Establish a 90-day baseline of this metric for each account. Generate a high-priority alert if the current 30-minute count exceeds a hard threshold of 5 AND is greater than the 99th percentile of the account's historical baseline. 3. Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on historical login data features, including source IP, destination IP, protocol, user account, destination asset criticality, and time-of-day. Apply the model to new login events. Flag logins with an anomaly score in the top 1% for investigation, especially when the model highlights deviations in multiple features simultaneously (e.g., rare source IP, unusual time, new destination asset for that user)."
          },
          {
            "description": "A successful authentication to an ICS asset using a username that is on a watchlist of known hardcoded or default vendor credentials.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek http.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic and authentication logs from all OT network segments, with a focus on management interfaces for critical controllers (PLCs, RTUs, IEDs), SCADA servers, Historian servers, and Engineering Workstations.",
            "action": "1. Symbolic Logic: Maintain a watchlist of known hardcoded and default usernames for ICS equipment present in the environment, sourced from vendor documentation, public vulnerability databases (e.g., CISA, CVEs), and internal research. Create a SIEM rule to generate a high-priority alert for any successful authentication (e.g., Windows Event ID 4624, successful logins in Zeek ssh.log, telnet.log, http.log, ftp.log) where the provided username exactly matches an entry in the watchlist. 2. Statistical Method: For each watchlist-matched credential, track the set of unique destination assets accessed within a 24-hour window. Calculate the Shannon entropy of the destination asset set. Establish a 30-day baseline of this entropy score for each credential. Generate an alert if the entropy for a given credential's access pattern increases by more than two standard deviations from its baseline, indicating use against a wider, more diverse set of assets than is typical. 3. Machine Learning: Develop a classification model (e.g., Random Forest) trained on historical authentication data. Engineer features including username, source/destination IP, protocol, time of day, asset type, and a binary feature 'is_on_watchlist'. The model classifies attempts as 'benign' or 'suspicious'. Flag authentications classified as 'suspicious' with high confidence, particularly when the 'is_on_watchlist' feature is true and the source IP is not a whitelisted management station."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has an adversary established persistence using hardcoded credentials on an ICS device?",
    "tactic_id": "TA0110",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T0891",
        "name": "Hardcoded Credentials",
        "evidence": [
          {
            "description": "A series of remote authentications to a critical ICS asset from a non-whitelisted source or by a non-whitelisted account exhibits highly regular, machine-like timing. This is defined as 10 or more consecutive logins over a 24-hour period where the standard deviation of the time interval between logins (jitter) is less than 5 seconds.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs and network traffic from critical control system assets (e.g., Historians, SCADA servers, Domain Controllers in OT) and network security monitoring points at boundaries between IT/OT zones and key OT segments.",
            "action": "1. Symbolic Logic: Define critical ICS assets (e.g., Historians, SCADA servers) in an asset inventory. Maintain whitelists of authorized user accounts and source IPs for automated processes that access these assets. Create a rule to flag any successful remote login (Windows Event ID 4624; Zeek ssh.log, telnet.log) to a critical asset that does not originate from a whitelisted source or use a whitelisted account. 2. Statistical Method: For logins matching the symbolic logic, group events by source IP, destination IP, and user account. Calculate the time deltas (in seconds) between consecutive logins within each group. For any group with 10 or more logins in a 24-hour period, calculate the standard deviation of the time deltas. Generate a high-priority alert if the standard deviation is less than 5 seconds, indicating a non-human, periodic beacon. 3. Machine Learning: For each unique user-destination pair, implement a time-series anomaly detection model (e.g., Seasonal-Trend decomposition using LOESS - STL) on the frequency of logins per hour. Train the model on at least 90 days of historical data to learn normal periodicities (e.g., daily backups). Flag as anomalous any period where the residual component of the decomposition is statistically significant, or where the model detects a new, high-frequency periodicity not seen in the training data."
          },
          {
            "description": "A successful interactive login (e.g., RDP, VNC, SSH, Telnet) occurs on a field device (PLC, RTU, IED) that rarely receives such access. This is defined as an access event where either: 1) the device has a historical 90-day interactive login count of zero, or 2) the login originates from a source IP not on the explicit whitelist of authorized Engineering Workstations for that specific device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic and access logs from the Process Control Network (Purdue Model Level 1/2), specifically targeting management traffic to PLCs, RTUs, IEDs, and other field controllers. Data may be collected from network TAPs or span ports connected to switches in these segments.",
            "action": "1. Symbolic Logic: Maintain a strict, device-specific whitelist of authorized source IPs (EWS, Jump Hosts) for interactive access to each field device (PLC, RTU, etc.). Generate a high-priority alert for any successful interactive login (identified in Zeek conn.log for RDP/VNC, Zeek ssh.log/telnet.log, or Windows Event ID 4624 Logon Type 10) to a field device where the source IP is not on its specific whitelist. 2. Statistical Method: For each field device, maintain a 90-day rolling count of successful interactive logins. For all devices of the same type (e.g., all PLCs of model X), calculate the distribution of login counts. Generate a high-priority alert if a successful interactive login is recorded for a device whose 90-day historical count is in the 1st percentile (e.g., a count of 0 or 1) for its device type, flagging a statistically rare access event. 3. Machine Learning: Train an unsupervised anomaly detection model (e.g., One-Class SVM) using features from successful interactive logins to field devices: source IP geolocation/ASN, destination device type, protocol, time of day, and day of week. The model learns the 'normal context' of legitimate engineering access. Flag any session with a high anomaly score, indicating it falls outside this normal context (e.g., access from a new ASN, at 3 AM on a holiday, to a device that is typically only accessed during business hours)."
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]