[
  {
    "information_requirement": "Is an adversary using web protocols for command and control on corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1437.001",
        "name": "Web Protocols",
        "evidence": [
          {
            "description": "Network traffic from a managed mobile device exhibits one or more of the following measurable C2 characteristics: (1) Periodic 'heartbeat' connections to a single destination, identified by a standard deviation of inter-arrival times below 1.5 seconds. (2) HTTP/S requests to domains with low reputation scores (e.g., below 20 on a 1-100 scale) or that are newly registered (e.g., within the last 90 days). (3) HTTP User-Agent strings that are statistically rare (e.g., seen less than 5 times enterprise-wide) or do not match an established allowlist for corporate mobile apps. (4) High entropy in URI paths or query parameters, with Shannon entropy scores exceeding the 98th percentile for the user or destination, suggesting encoded data. (5) An asymmetric ratio of bytes sent vs. received (e.g., orig_bytes / resp_bytes > 10.0 or < 0.1), deviating from typical browsing patterns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network egress points, VPN concentrators, Mobile Device Management (MDM) gateways, forward/reverse proxies, and central DNS resolvers that process traffic from managed mobile device subnets or enrolled devices.",
            "action": "1. (Symbolic) Continuously correlate destination FQDNs and IPs from `Zeek dns.log` and `http.log` against threat intelligence feeds for known C2 infrastructure. Generate a high-priority alert on any match. 2. (Statistical) For each mobile device IP, analyze `Zeek conn.log` over a rolling 24-hour window to detect beaconing. Calculate the standard deviation of time deltas between connections to the same destination; a value < 1.5s indicates periodicity. Simultaneously, calculate the ratio of sent to received bytes (`orig_bytes` / `resp_bytes`); a ratio > 10.0 or < 0.1 indicates asymmetry. Also, analyze `Zeek http.log` to calculate the Shannon entropy of the `uri` and `host` fields; flag requests where entropy exceeds the 98th percentile for that specific source device, suggesting DNS tunneling or DGA. 3. (Machine Learning) Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) on features extracted from `Zeek conn.log`, `http.log`, and `ssl.log` (e.g., duration, byte counts, URI length, User-Agent rarity, JA3 hash prevalence). Train the model on a baseline of normal mobile traffic and use it to score new sessions. Separately, develop a per-device time-series forecasting model (e.g., Prophet) for total hourly outbound data volume; trigger an alert if observed volume significantly exceeds the model's predicted confidence interval, indicating potential exfiltration."
          },
          {
            "description": "A TLS session originating from a managed mobile device presents a client fingerprint (JA3 hash) or is answered with a server fingerprint (JA3S hash) that meets one of the following criteria: (1) The JA3 or JA3S hash is present on a threat intelligence feed of known malicious fingerprints. (2) The JA3 hash is statistically rare, appearing in less than 1% of all enterprise sessions, and is not on an established allowlist for approved corporate applications. (3) The JA3S hash corresponds to a self-signed or newly issued certificate for a low-reputation domain.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at key chokepoints with visibility into traffic from managed mobile devices, including corporate Wi-Fi egress points, VPN concentrators, Mobile Device Management (MDM) gateways, and forward proxies capable of inspecting TLS handshakes to generate Zeek log data.",
            "action": "1. (Symbolic) Ingest threat intelligence feeds of malicious JA3 and JA3S hashes. Continuously compare the `ja3` and `ja3s` fields from `Zeek ssl.log` against these feeds. Generate a high-confidence alert upon any direct match. 2. (Statistical) Maintain a 30-day rolling frequency distribution of all `ja3` hashes observed in `Zeek ssl.log`. For each new TLS connection from a mobile device, if its JA3 hash is not on a pre-approved allowlist, generate an alert if its frequency falls below the 1st percentile. Correlate this alert with data from `Zeek x509.log` to check if the server certificate is self-signed or recently issued. 3. (Machine Learning) Train a supervised classification model (e.g., XGBoost) on a labeled dataset of JA3 hashes from known-good (allowlisted apps) and known-malicious (malware samples) traffic. Use features derived from the TLS client hello (e.g., cipher suites, extensions, elliptic curves) in addition to the hash itself. Deploy the model to classify new, unknown JA3 hashes and assign a probability score of maliciousness. A score exceeding a tuned threshold (e.g., 0.90) triggers an alert for analyst review."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]