[
  {
    "information_requirement": "Is an adversary using scheduled tasks for persistence on mobile devices? (PIR)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task/Job",
        "evidence": [
          {
            "description": "A single mobile device generates repetitive network connections to the same destination IP address. This pattern is characterized by a time-series analysis showing statistically significant periodicity, an inter-arrival time standard deviation (jitter) below 5 seconds, and a low Gini coefficient (< 0.2) for both connection duration and total bytes transferred, indicating automated, non-interactive traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Network egress points, Cloud Access Security Brokers (CASB), Mobile Device Management (MDM) platforms.",
            "action": "1. (IOC Match) For all outbound connections from mobile device IP ranges in `Zeek conn.log`, correlate destination IPs with domains from `Zeek dns.log` and the `server_name` field from `Zeek ssl.log`. Compare domains, IPs, and JA3/JA3S hashes against threat intelligence feeds of known C2 servers and malicious TLS fingerprints. Alert on any match. 2. (Statistical Analysis) For each source mobile IP, group outbound connections by destination IP. Calculate the inter-arrival times between consecutive connections for each group. Identify groups where the standard deviation of these times (jitter) is in the bottom 5th percentile network-wide or below an absolute threshold of 5 seconds. For these same groups, calculate the Gini coefficient for connection duration and total bytes transferred; a value near 0 indicates high uniformity. Flag devices exhibiting both low jitter and a low Gini coefficient (<0.2) as potentially automated. 3. (Time-Series Analysis) For connection patterns flagged by the statistical analysis, apply a Seasonal-ARIMA (SARIMA) or Fast Fourier Transform (FFT) model to the connection timestamp series. A model that accurately predicts future connection timestamps or shows a strong periodic signal confirms automated, scheduled behavior. An accurate prediction for a connection to a low-reputation destination is a high-fidelity alert."
          },
          {
            "description": "A mobile device's network traffic profile is a statistical outlier compared to its peer group (e.g., devices with the same OS and role). The anomalous profile includes a high ratio (> 95th percentile) of traffic on non-standard ports or evidence of DNS tunneling, such as an abnormally high volume of TXT/NULL queries or DNS query sizes exceeding 2 standard deviations from the peer group mean.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Network egress points, Internal DNS resolvers.",
            "action": "1. (Rule Match) In `Zeek conn.log`, create a rule to flag traffic from mobile devices to destination ports > 1024 that are not on an approved list of services. In `Zeek weird.log`, generate alerts for notices such as `dns_unmatched_reply`, `possible_split_routing`, or `data_after_close` that originate from mobile device IP ranges. 2. (Statistical Analysis) For each device, establish a peer group based on OS, department, or MDM-provided device profile. Calculate a feature set including the ratio of traffic on non-standard ports and the average size of DNS TXT/NULL record queries. Flag any device where these metrics exceed the 98th percentile or 2 standard deviations from its peer group's baseline. 3. (Clustering Analysis) Construct a feature vector for each mobile device using normalized values for: protocol distribution (TCP/UDP/ICMP), port entropy, average connection duration, total bytes transferred, DNS query characteristics (query length entropy, A/AAAA vs TXT/NULL ratio), and JA3 hash distribution. Apply a density-based clustering algorithm like DBSCAN to identify outliers. Devices classified as noise points represent anomalous network behavior and are primary candidates for investigation for covert C2 channels established by a scheduled task."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using a scheduled task to execute malicious code on mobile devices? (PIR)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task/Job",
        "evidence": [
          {
            "description": "A mobile device periodically downloads files identified by MIME types for mobile executables (e.g., 'application/vnd.android.package-archive', 'application/octet-stream' for IPAs). These downloads originate from a domain with a low reputation score (e.g., newly registered, not in Tranco Top 1M) and the download events exhibit statistically significant periodicity when analyzed over time.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek intel.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, Web Proxies.",
            "action": "1. (IOC Match) In `Zeek files.log`, compare file hashes (MD5, SHA1) of all downloads against malware databases. In `Zeek http.log`, check the `host`, `uri`, and `user_agent` fields against threat intelligence feeds. In `x509.log`, check the certificate issuer against a list of non-standard CAs. Alert on any match found in `Zeek intel.log`. 2. (Statistical Analysis) Isolate download events for mobile-specific MIME types (e.g., `application/vnd.android.package-archive`). For each source device, apply an autocorrelation function (ACF) to the time series of these download events; a significant spike at a non-zero lag indicates periodicity. Separately, analyze the `User-Agent` string from `http.log`; flag agents with low prevalence across the enterprise or those matching known malicious patterns. 3. (Classification Model) Train a gradient boosting classifier (e.g., XGBoost) to produce a 'malicious download' score. Use features including: domain age and reputation of the host (`http.log`), filename entropy (`files.log`), User-Agent string prevalence, file MIME type (`files.log`), presence of `seen.indicator` in `intel.log`, a binary feature for 'outside business hours', the rarity of the JA3/JA3S hash, and the certificate validity period from `x509.log` (short-lived certs are suspicious). A high score, especially when correlated with periodic behavior from the statistical analysis, constitutes a high-confidence alert."
          },
          {
            "description": "A mobile device makes DNS queries at regular intervals (inter-query time standard deviation < 10 seconds for a specific domain) for a domain that is algorithmically generated. The domain exhibits high lexical entropy, is absent from organizational allowlists, and has a recent registration date (< 30 days).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek intel.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Network egress points, DNS firewalls.",
            "action": "1. (IOC Match) Continuously check all domains in `Zeek dns.log` from mobile device subnets against threat intelligence feeds (C2, DGA) and a list of Newly Registered Domains (NRDs), flagging domains registered in the last 7 days. Create a rule to detect when a mobile device's DNS query is resolved by a non-corporate DNS server. 2. (Statistical Analysis) For each queried domain not on an enterprise allowlist, calculate its lexical features: Shannon entropy, length, and n-gram score (by comparing its 2-gram profile to a baseline from the Tranco Top 1M list). Create a composite anomaly score from these features. Then, for domains in the 99th percentile of this score, group by source device and domain, and calculate the standard deviation of inter-query arrival times. A low standard deviation (<10s) indicates periodic polling. 3. (DGA Classification) Feed all non-allowlisted domains queried by mobile devices into a pre-trained DGA detection model (e.g., a random forest or LSTM-based classifier). For domains that receive a high DGA probability score (e.g., >0.90), correlate the query timestamps. A periodic pattern in these timestamps for a single source device is a high-fidelity indicator of a scheduled callback for C2."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]