[
  {
    "information_requirement": "Is an adversary abusing elevation control mechanisms to escalate privileges on managed mobile devices? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1626",
        "name": "Abuse Elevation Control Mechanism",
        "evidence": [
          {
            "description": "A mobile application is granted device administrator privileges where the application's package ID is not on an established allowlist, or the application's installation prevalence across the device fleet is statistically rare (e.g., below the 5th percentile).",
            "data_sources": [
              "MDM Device Administrator Event Log",
              "MDM Application Inventory Report",
              "Corporate App Store Metadata"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized MDM/EMM log platform, Corporate Application Store database, and the population of managed mobile devices.",
            "action": "Symbolic: Query MDM logs for all device administrator grant events. For each event, compare the application's package ID against a curated allowlist of approved administrative applications (e.g., MDM client, security agents). Trigger a high-severity alert for any application not on the allowlist. Statistical: From MDM application inventory reports, calculate the prevalence of every application across the entire mobile fleet (count of installs / total devices). For each new device administrator grant event, look up the application's prevalence score. Trigger a medium-severity alert if the prevalence score is in the bottom 5th percentile, indicating a rare application is gaining high privileges. Machine Learning: Train a logistic regression classifier on historical administrator grant events using features such as application category (from app store metadata), developer signature reputation, number of requested permissions, application prevalence score, and application age in the environment. Score all new grant events in real-time. Automatically escalate events with a predicted malicious probability score greater than 0.85 for immediate analyst review."
          },
          {
            "description": "A mobile device initiates suspicious network connections, characterized by communication with known malicious endpoints or exhibiting statistically anomalous data patterns, within a 5-minute window after a device administrator privilege grant event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM Device Administrator Event Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs or switch SPAN ports feeding Zeek sensors at the network egress, centralized DNS server logs, and the centralized MDM/EMM log platform.",
            "action": "Symbolic: Join MDM device administrator grant events with network logs (Zeek conn.log, Zeek dns.log) on the device's source IP and a 5-minute time window. Scan all DNS requests and outbound connections within this window against threat intelligence feeds for known malicious domains and IPs. Generate a high-severity alert that correlates the privilege grant event with the matching threat intelligence. Statistical: In the 5-minute post-grant window, calculate the Shannon entropy of requested FQDNs in the device's Zeek dns.log data; an entropy score above 4.0 indicates potential DGA and should trigger an alert. Simultaneously, calculate the total outbound data volume (sum of 'resp_bytes' in Zeek conn.log) and alert if the volume exceeds the 99th percentile of the device's 30-day historical baseline for a 5-minute window. Machine Learning: Deploy a time-series anomaly detection model (e.g., LSTM autoencoder) trained on each device's historical network telemetry (e.g., bytes out, connection count, protocol mix per minute). Analyze the network data from the 5-minute window following a privilege grant using the model. A high reconstruction error, indicating a significant deviation from the learned normal behavior, should be flagged as an anomaly and escalated for investigation with the context of the privilege grant."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]