[
  {
    "information_requirement": "Is an adversary maintaining command and control over a compromised mobile device via dynamic resolution? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637",
        "name": "Dynamic Resolution",
        "evidence": [
          {
            "description": "A DNS query from a mobile device is for a domain whose Shannon entropy exceeds the 98th percentile of a 30-day baseline for mobile traffic, and whose 2-gram frequency distribution deviates by more than 3 standard deviations from the established norm for legitimate domains [1].",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and Mobile Device Management (MDM) platform logs.",
            "action": "Symbolic: Create a detection rule to continuously match the 'query' field in Zeek dns.log against a threat intelligence feed of known DGA domains. A direct match must trigger a high-priority alert for immediate investigation. Statistical: For each unique domain name observed in the 'query' field from mobile device IP ranges, calculate its Shannon entropy, the ratio of numerical characters to total characters, and the 2-gram frequency distribution. Establish a 30-day rolling baseline for these metrics across all mobile device traffic by calculating the mean, standard deviation, and key percentiles (e.g., 95th, 98th, 99th). Flag any domain where the entropy and numerical ratio exceed the 98th percentile and whose 2-gram frequencies deviate significantly (e.g., a cosine similarity score below 0.2 when compared to the baseline 2-gram vector) from the established norm. Machine Learning: Train a random forest classifier using a labeled dataset composed of public DGA domain lists (positive class) and a domain prevalence list like Tranco [2] (negative class). Engineer features including domain length, entropy, numerical ratio, vowel-to-consonant ratio, and the mean length of consecutive consonant substrings. Apply this model in near-real-time to classify new DNS queries originating from mobile device IP ranges. Queries classified as 'DGA' with a model confidence score above 0.90 should be escalated for analyst review."
          },
          {
            "description": "A mobile device establishes a network connection to a domain that was registered less than 30 days prior, is not ranked within the Tranco Top 1 Million list [2], and for which the connection pattern shows a mean data volume per connection below the 20th percentile and a standard deviation of inter-arrival times below the 10th percentile of all mobile device connections.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and external WHOIS services.",
            "action": "Symbolic: For each domain resolved in Zeek dns.log, query a threat intelligence platform via API to check if the domain or its resolved IP address is on a blocklist of known C2 infrastructure. An exact match must generate a critical alert. Statistical: Automate a process to enrich each unique domain from Zeek dns.log with its WHOIS registration date and its rank from a domain prevalence list [2]. Calculate a risk score where $$ risk = (10 * is\\_new) + (5 * is\\_unpopular) $$, where $$ is\\_new $$ is 1 if registered less than 30 days ago, and $$ is\\_unpopular $$ is 1 if not in the top 1 million. For connections in Zeek conn.log to domains with a risk score greater than 10, analyze the connection patterns for the source IP. Flag source IPs that exhibit both low data volume (e.g., total bytes sent/received is less than the 20th percentile for all connections) and a low standard deviation in the time interval between connections over a 24-hour period, suggesting automated activity. Machine Learning: For traffic directed to high-risk domains (as identified by the statistical method), perform a time-series analysis on the connection timestamps for each source IP. After creating a time series of connection events, apply an autocorrelation function (ACF) to the data to detect strong periodic signals. A clear, dominant peak in the ACF plot at a non-zero lag indicates automated beaconing and should be classified as a likely C2 channel requiring investigation. The lag at which the peak occurs represents the beaconing interval."
          },
          {
            "description": "A single domain name queried by a mobile device resolves to more than 10 unique IP addresses within a 60-minute window, where the DNS Time-To-Live (TTL) is consistently below 300 seconds, and the resolved IPs belong to at least 3 distinct Autonomous Systems (ASNs).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and DNS resolution infrastructure.",
            "action": "Symbolic: Maintain and apply a watchlist of domain patterns associated with known dynamic DNS providers (e.g., *.ddns.net, *.no-ip.com, *.duckdns.org). Create a rule to flag any DNS query from a mobile device for a hostname that matches this watchlist for analyst review. Statistical: For each domain in Zeek dns.log, count the number of unique IP addresses and unique ASNs it resolves to over a rolling 1-hour window, grouping by the 'query' field. Calculate the 99th percentile for these counts across all domains in the mobile environment. Domains exceeding this threshold, especially those with a low average DNS Time-To-Live (TTL) value (e.g., < 300 seconds), should be considered potential fast-flux C2 domains. Correlate these domains with Zeek conn.log to identify all internal devices communicating with the associated IPs. Machine Learning: For each mobile device IP, extract all outbound connection metadata from Zeek conn.log over a 15-minute window. Apply a clustering algorithm like DBSCAN using features such as destination IP, destination port, protocol, and destination ASN. A distinct cluster of connections to a large number of disparate IPs across multiple ASNs, especially on non-standard ports, indicates a high likelihood of a fast-flux C2 channel and should be alerted for further analysis. This can be distinguished from legitimate CDNs which often use many IPs but within a small number of ASNs."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]