[
  {
    "information_requirement": "Is an adversary attempting to elevate privileges by injecting code into a higher-privileged process on a mobile device? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1631.001",
        "name": "Ptrace System Calls",
        "evidence": [
          {
            "description": "An `auditd` event of type `SYSCALL` with `syscall=101` (ptrace) is recorded in the Android audit.log. The event shows a source process (`exe`) not present on a curated allow-list of legitimate debugging or system applications, and the target process's effective user ID (`euid`) is privileged (e.g., 0 for root or 1000 for system).",
            "data_sources": [
              "Android audit.log",
              "MDM application inventory log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Android auditd log streams forwarded from managed mobile endpoints via an MDM agent to a central SIEM; Application inventory data from a Mobile Device Management (MDM) platform.",
            "action": "1. (Symbolic) Maintain a threat intelligence feed of known malicious mobile application package names and their corresponding SHA256 hashes. Ingest Android audit.log events into the SIEM. Create a rule that triggers a high-severity alert when an event with `syscall=101` (ptrace) is observed where the source process hash or package name matches the threat intelligence feed and the target process `euid` is 0 or 1000. 2. (Statistical) Using MDM application inventory logs, create and maintain an allow-list of package names authorized to use `ptrace` (e.g., legitimate EDR/MDM agents, approved developer tools). For each mobile device, establish a 30-day hourly baseline of `ptrace` call frequency per source application package. Create a rule that triggers an alert if: (a) a `ptrace` syscall is initiated by a process (`exe`) not on the allow-list and the target process `euid` is 0 or 1000, OR (b) an authorized application initiates `ptrace` calls at a rate exceeding the 99th percentile of its 30-day hourly baseline for that specific device. 3. (ML) Train a classification model (e.g., Gradient Boosting) on labeled `ptrace` events from Android audit logs. Extract features such as: source package name (categorical), source UID (numerical), target process name (categorical), target UID (numerical), parent process of source (categorical), time of day (cyclical encoding), and a binary flag indicating if the source app is on the 'developer tools' allow-list. Deploy the model to score all new `ptrace` events in real-time. Generate a high-severity alert for any event classified as 'malicious' with a confidence score above 0.9, particularly when the target process UID is 0 or 1000."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to evade defenses by executing malicious code within the context of a legitimate mobile application process? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1631.001",
        "name": "Ptrace System Calls",
        "evidence": [
          {
            "description": "A correlation of events within a 5-minute window shows: 1) An Android audit.log record of a `ptrace` syscall (`syscall=101`) targeting a process on a device. 2) Zeek conn.log or dns.log records from the same device source IP show network activity that is anomalous. Anomalous activity is defined as: a) a connection to an IP/domain on a threat intelligence list, b) a DNS query for a domain with high Shannon entropy (e.g., > 3.5), or c) an outbound connection to a non-standard port not seen in the device's historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Android audit.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors at corporate Wi-Fi egress points, VPN concentrators, and DNS resolvers used by mobile devices.",
            "action": "1. (Symbolic) Create a correlation rule that joins Android audit.log events with Zeek logs on the device's IP address. Trigger a high-priority alert if a `ptrace` event is observed, and within a 5-minute trailing window, a `conn.log` or `dns.log` entry for the same IP shows a connection or query to a destination matching a high-confidence C2 threat intelligence feed. 2. (Statistical) For each device IP, create a 30-day rolling baseline of network activity from Zeek logs. Key metrics include: (a) a set of historically observed destination ports, (b) the 95th percentile of Shannon entropy for requested DNS domains per hour (from dns.log), and (c) the 95th percentile of outbound data volume (`orig_bytes`) per connection (from conn.log). Create a rule that triggers if a `ptrace` event is logged for a device. If, within the following 60 minutes, the same device IP generates traffic that violates its baseline (e.g., connects to a new destination port, exhibits DNS entropy above its 95th percentile, or a connection's `orig_bytes` exceeds its 95th percentile), generate a medium-severity alert. 3. (ML) For each mobile device IP, train a time-series anomaly detection model (e.g., LSTM Autoencoder) on 1-minute aggregations of network features from Zeek logs. Features should include: count of new connections, total `orig_bytes`, total `resp_bytes`, number of unique destination ports, and average DNS query entropy. After a `ptrace` event is detected on a device, feed its subsequent network feature vectors into the trained model. A reconstruction error score that exceeds the 99th percentile of its historical error distribution for three consecutive minutes indicates a significant behavioral deviation and should trigger a high-severity alert."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]