[
  {
    "information_requirement": "Is an adversary leveraging legitimate remote access software for Command and Control on corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1663",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "A network connection from a corporate mobile device resolves a domain or connects to an IP address present on a threat intelligence feed for remote access software, while the Mobile Device Management (MDM) platform reports the initiating application is not on an approved software list for that specific device.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "MDM application inventory logs",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Corporate DNS servers, Windows-based web proxies, VPN concentrators, Mobile Device Management (MDM) platform",
            "action": "1. (Symbolic Logic) Create and maintain a watchlist of domains, IP addresses, and SSL certificate subjects associated with unapproved remote access software. Create a SIEM rule that queries Zeek logs (dns.log for 'query', conn.log for 'id.resp_h', and ssl.log for 'server_name') for traffic from the mobile device IP range that matches the watchlist. Upon a match, query the MDM platform using the device's IP address to retrieve its installed application list. Generate a high-severity alert if the application list does not contain approved remote access software that could explain the traffic. 2. (Statistical Method) For each connection matching the remote access watchlist, analyze its metadata in Zeek conn.log. Calculate the 95th and 99th percentiles for connection duration and total bytes transferred ('orig_bytes' + 'resp_bytes') across all mobile device traffic over a rolling 30-day baseline. Generate a medium-severity alert if a watchlist-matched connection exceeds the 95th percentile for either metric and a high-severity alert if it exceeds the 99th percentile, suggesting unusually large data transfer or a persistent connection. 3. (Machine Learning) Train a supervised classification model (e.g., Random Forest or Gradient Boosting) using labeled historical Zeek conn.log data, enriched with MDM and threat intelligence context. Features should include protocol, duration, orig_bytes, resp_bytes, conn_state, history, destination port, a binary feature indicating if the destination is on the remote access watchlist, and a binary feature indicating if the source device has approved remote access software installed. Deploy the model to classify new connections from mobile devices in near-real-time as 'benign' or 'suspicious-remote-access', triggering an alert on the latter."
          },
          {
            "description": "A long-lived TCP connection from a corporate mobile device, with a duration exceeding the 95th percentile of all mobile device connections, uses a protocol dynamically identified by network sensors as remote access (e.g., VNC, RDP) on a non-standard port. The session also exhibits a packet-to-byte ratio in the top 5% of all sessions, indicating interactive traffic rather than bulk data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Network segments hosting corporate mobile devices, Core network switches, Wi-Fi access points",
            "action": "1. (Symbolic Logic) Create a SIEM rule to search for Zeek conn.log entries where the 'service' field contains a remote access protocol (e.g., 'vnc', 'rdp', 'teamviewer') and the 'id.resp_p' field is not the standard IANA-assigned port for that service. Heighten the alert priority if Zeek also generates a 'Protocol_Mismatch' or 'Long_Connection' notice in notice.log for the same session identifier ('uid'). 2. (Statistical Method) For all successful TCP connections ('conn_state' = 'SF') from the mobile device IP range, calculate an interactivity score defined as the ratio of total packets ('orig_pkts' + 'resp_pkts') to total bytes ('orig_bytes' + 'resp_bytes'). Establish a baseline for this score and for connection duration over a 30-day period. Flag connections where both the duration and the interactivity score exceed their respective 95th percentiles and the connection involves a non-standard port for a dynamically detected remote access protocol. Additionally, calculate the Shannon entropy of destination ports used by each mobile device over a rolling 24-hour window; a sharp increase in entropy can indicate precursor scanning or tunneling behavior. 3. (Machine Learning) Deploy a time-series anomaly detection model (e.g., an LSTM-based autoencoder) trained on vectors of per-minute network telemetry for each mobile device (e.g., total outgoing bytes, number of new connections, average connection duration). An alert is generated when the model's reconstruction error for a device's activity exceeds a dynamically determined threshold, indicating a significant deviation from its normal network behavior. Correlate this anomaly in time with the appearance of a long-duration connection on a non-standard port in Zeek conn.log to increase confidence."
          },
          {
            "description": "A successful and unsolicited inbound TCP connection is established from an external (non-RFC1918) IP address to a corporate mobile device on a port commonly associated with remote access software (e.g., 5900/TCP, 5938/TCP), in direct violation of established firewall and device policies that forbid such connections.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek known_services.log",
              "Firewall logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Demilitarized Zone (DMZ), Wi-Fi network segments, Firewall appliances, Mobile VPN termination points",
            "action": "1. (Symbolic Logic) Implement a critical-priority SIEM alert that triggers on any successful connection ('conn_state' of 'SF' or 'RSTO') in Zeek conn.log or firewall logs where the originating IP ('id.orig_h') is external/non-RFC1918 and the destination IP ('id.resp_h') is within the designated mobile device IP range. Since policy should block all unsolicited inbound traffic to these devices, any such alert represents a critical policy violation or misconfiguration and requires immediate investigation. 2. (Statistical Method) On a daily basis, query Zeek known_services.log to inventory all services observed listening on mobile devices. For each listening port, calculate its prevalence as a percentage of the total mobile device fleet. Generate an alert for any device found listening on a port that is statistically rare (e.g., present on less than 1% of the mobile fleet) or is on a watchlist of high-risk ports associated with remote access tools. 3. (Machine Learning) Apply a density-based clustering algorithm (e.g., DBSCAN) to mobile devices, using features derived from their inbound network profiles over a 24-hour period. Features should include the set of listening ports, the ratio of inbound to outbound connections, the number of distinct external source IPs, and the geographic diversity of inbound connection sources. Devices that the algorithm identifies as noise points (outliers), particularly those with unique listening ports or an unusually high number of inbound connection attempts, should be automatically flagged for analyst review as potential peer group deviants."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]