[
  {
    "information_requirement": "Is the adversary using Windows Remote Management for lateral movement?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.006",
        "name": "Windows Remote Management",
        "evidence": [
          {
            "description": "A WinRM network connection (TCP/5985, TCP/5986) originates from a source IP address present on an active watchlist of compromised or suspicious internal hosts.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, Authentication logs on destination servers, Network traffic sensors at segment boundaries",
            "action": [
              "Symbolic: Maintain a dynamic watchlist of internal IP addresses from hosts confirmed as compromised or associated with high-confidence alerts. Create a SIEM rule that generates a high-severity alert by joining network flow logs (e.g., Zeek conn.log) where the destination port is 5985 or 5986 with the watchlist on the source IP field. Correlate with successful network logons (Windows Event ID 4624, Logon Type 3) on the destination host originating from the watchlist IP.",
              "Statistical: For each user, establish a baseline of typical source hosts for WinRM activity. Calculate the frequency of each source-destination-user tuple for WinRM connections. Flag any connection originating from a source host that is statistically rare for a given user or destination server (e.g., in the bottom 5th percentile of frequency).",
              "Machine Learning: Train a graph-based anomaly detection model on the network graph of WinRM connections (nodes are hosts, edges are connections). The model should learn normal communication patterns, such as admin workstations connecting to servers. Use the model to score the anomalousness of new connections in real-time, flagging edges that significantly deviate from the learned graph structure, such as new workstation-to-workstation connections."
            ]
          },
          {
            "description": "A process created by the WinRM service (WsmPrvSE.exe) contains command-line arguments or script block content that matches known malicious patterns or has unusually high entropy.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Command line process auditing logs on endpoints and servers, PowerShell script block logging on endpoints and servers",
            "action": [
              "Symbolic: Filter for process creation events (Windows Event ID 4688) where the parent process is 'WsmPrvSE.exe'. On these events, apply a ruleset of regular expressions to the command line field to detect signatures of malicious tools and techniques. Examples include: '-enc', '-w hidden', 'IEX(New-Object Net.WebClient).DownloadString', 'rundll32', or arguments associated with Mimikatz, BloodHound, or Cobalt Strike.",
              "Statistical: For all commands executed via WinRM (child processes of 'WsmPrvSE.exe'), calculate the Shannon entropy and length of the command line string from Windows Event ID 4688. Establish a baseline distribution for these metrics. Generate an alert for any command whose entropy or length exceeds a high percentile (e.g., 95th percentile) of the established baseline, as this is often indicative of obfuscated or packed commands.",
              "Machine Learning: Develop a supervised classification model (e.g., Logistic Regression, Random Forest) trained on a labeled dataset of benign and malicious commands. Ingest PowerShell Script Block logs (Event ID 4104) and command lines (Event ID 4688) spawned by WinRM. Use the trained model to classify each new command as either benign or malicious based on its lexical features (e.g., n-grams, function calls, string literals)."
            ]
          },
          {
            "description": "The pattern of WinRM connections (TCP/5985, TCP/5986) deviates from established baselines, showing new source-destination pairings (e.g., workstation-to-workstation), a sudden increase in connection volume, or connections at anomalous times.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors at key network chokepoints (e.g., core switches, data center entry points), Internet gateway",
            "action": [
              "Symbolic: Define a policy that explicitly forbids certain types of WinRM connections, such as any workstation-to-workstation traffic or any connections originating from a non-administrative VLAN to a server VLAN. Create a SIEM rule to alert on any network traffic in Zeek conn.log that matches these forbidden pathing rules on destination ports 5985 or 5986.",
              "Statistical: For the entire network, baseline the hourly volume of WinRM connections using Zeek conn.log. Use descriptive statistics to calculate the mean and standard deviation of connection counts per hour. Alert when the connection count in a given hour exceeds a predefined threshold, such as 3 standard deviations above the mean for that hour of the day and day of the week, to detect potential automated scanning or lateral movement.",
              "Machine Learning: Apply time-series forecasting (e.g., ARIMA or Prophet) to the volume of WinRM connections between network segments. The model will predict the expected connection volume for the next interval. Generate an alert when the actual observed volume significantly exceeds the model's prediction confidence interval, indicating a statistically significant and unexpected surge in activity."
            ]
          },
          {
            "description": "A remote logon session via WinRM (Logon Type 3) is immediately followed by a sequence or volume of process executions anomalous for the user or the target host, such as rapid execution of multiple discovery commands.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs and process creation logs on critical servers (e.g., Domain Controllers, Certificate Authorities, key application servers)",
            "action": [
              "Symbolic: Correlate a successful WinRM network logon (Windows Event ID 4624, Logon Type 3) with subsequent process creation events (Windows Event ID 4688) occurring under the same Logon ID. Create a rule that alerts if this session spawns known sensitive processes like 'ntdsutil.exe', 'vssadmin.exe', or 'diskshadow.exe', which are rarely used in legitimate remote administration and are indicative of credential dumping or volume shadow copy manipulation.",
              "Statistical: For each user and target host pair, profile the sequence of commands typically run within a WinRM session. Calculate the frequency of different command n-grams (sequences of 2 or 3 commands) using data from Event ID 4688 and 4104. Alert when a session contains a command sequence that is statistically rare (e.g., frequency below a 1% threshold). Also, track the count of discovery commands ('whoami', 'net', 'ipconfig', 'nltest', etc.) per session and flag sessions exceeding the 99th percentile for that user.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on session-level features. For each WinRM session (grouped by Logon ID from Event ID 4624), create a feature vector including: session duration, number of processes created, entropy of process names, and counts of specific command categories (discovery, execution, defense evasion). The model will cluster sessions into groups of 'normal' behavior. Flag any session that is marked as a noise point or belongs to a very small, anomalous cluster."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]