[
  {
    "information_requirement": "Has the adversary exfiltrated sensitive data using automated methods? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1020",
        "name": "Automated Exfiltration",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to an IP address or domain present on a threat intelligence feed categorized for C2 or data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points, Internal DNS Resolvers",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) with a threat intelligence feed of known malicious domains/IPs. Alert on any match where the category is 'C2', 'exfiltration', or 'malware'.",
              "Statistical: For all connections matching a low-reputation category (e.g., 'dynamic DNS', 'newly registered domain'), calculate the total outbound bytes (orig_bytes). Alert if the total bytes transferred exceeds the 95th percentile for all connections to that category.",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on features such as destination IP reputation, port, protocol, connection duration, and bytes transferred to classify each connection as 'benign' or 'exfiltration'. Alert on high-confidence 'exfiltration' classifications."
            ]
          },
          {
            "description": "A series of DNS queries from a single host where subdomain labels are abnormally long (e.g., > 64 characters) and exhibit high entropy, or HTTP POST requests containing headers or body content with high-entropy, Base64-encoded strings.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Web Proxies, Application Servers",
            "action": [
              "Symbolic: Scan Zeek http.log for POST requests where the User-Agent or Cookie headers match regular expression patterns of known exfiltration tools (e.g., Iodine, DNSCat2). Alert on any match.",
              "Statistical: For each DNS query in Zeek dns.log, calculate the Shannon entropy of the query name (subdomain portion). Establish a baseline entropy for normal traffic (typically < 3.5). Alert on any query where the entropy exceeds 4.5. Additionally, monitor the ratio of TXT records to A records per source host; alert if this ratio exceeds the 98th percentile of the host's historical baseline.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features extracted from DNS queries (query length, entropy, character distribution, query type). Investigate clusters that are distinct from the main 'benign traffic' cluster as potential DNS tunneling."
            ]
          },
          {
            "description": "The execution of an archiving utility (e.g., 7z.exe, tar.exe, rar.exe) with command-line arguments targeting sensitive user or system directories, followed within a short time window (e.g., < 15 minutes) by a large outbound network transfer (> 50MB) from the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, File Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a rule that triggers when a process creation event (Windows Event ID 4688) shows a known archiver process (7z.exe, rar.exe, zip.exe) with a command line targeting directories like 'C:\\Users\\', 'C:\\inetpub\\', or a mapped network drive, AND this event is followed within 15 minutes by a Zeek conn.log entry from the same source IP with orig_bytes > 50,000,000 to an external destination.",
              "Statistical: For each host, establish a 30-day baseline of daily outbound data volume (orig_bytes sum from Zeek conn.log). After observing an archive process execution (Windows Event ID 4688), monitor the host's outbound traffic. Alert if the outbound traffic in the next hour exceeds 3 standard deviations above the host's daily average.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., LSTM) for each host's outbound network traffic profile. Feed process creation events for archivers as an exogenous variable into the model. An alert is generated if the model flags a significant anomaly in network traffic immediately following the archival event."
            ]
          },
          {
            "description": "A single process instance accesses an anomalously high number of files (>1000) or a high variety of distinct file extensions (>10) within a short time frame (< 5 minutes), particularly if the process is not a known backup or indexing service.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive Data Repositories, User Workstations, Source Code Repositories",
            "action": [
              "Symbolic: Alert when powershell.exe or cscript.exe (Windows Event ID 4688) is observed accessing more than 100 files with extensions like '.docx', '.pdf', '.xlsx' (Windows Event ID 4663) within a 1-minute window, and the same host initiates an outbound connection to an IP not seen in the last 30 days (Zeek conn.log).",
              "Statistical: For each process on each host, create a baseline of file access counts per minute. Alert if a process instance's file access count (Windows Event ID 4663) exceeds the 99th percentile of its historical baseline. Further enrich the alert if the entropy of the file extensions accessed by that process instance is also above its 99th percentile.",
              "Machine Learning: Use an unsupervised learning model (e.g., Isolation Forest) to profile normal process behavior based on features like parent process, command-line arguments, file access count, and accessed directory paths. The model will identify outliers that represent anomalous process behavior indicative of data staging."
            ]
          },
          {
            "description": "File access events (Windows Event ID 4663) targeting similar file paths or types occur across multiple hosts (>5) in a narrow time window (<10 minutes), followed by a correlated spike in outbound traffic from those hosts to a single, shared external destination IP address.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire Workstation Subnet, Server Farm, Internet Egress Points",
            "action": [
              "Symbolic: Define a rule that looks for a specific exfiltration script name (e.g., 'data_grabber.ps1') being executed (Windows Event ID 4688) on more than 5 hosts within 10 minutes. If this occurs, query Zeek conn.log for any common external destination IP that all of these hosts communicated with shortly after execution.",
              "Statistical: Group hosts by department or role. For each group, monitor the number of hosts concurrently accessing network shares (Windows Event ID 4663 on file servers). Alert if the number of concurrently active hosts exceeds 3 standard deviations from the hourly baseline for that group. Correlate this with a spike in traffic to a single external IP from the same group of hosts.",
              "Machine Learning: Use graph analysis to model relationships between internal hosts and external destinations. A sudden convergence where multiple host nodes (that are not typically related) all create new edges to a single external destination node within a short time window would be flagged as a high-risk anomaly, indicative of coordinated exfiltration."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]