[
  {
    "information_requirement": "Is the adversary moving laterally through the network using Windows admin shares?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.002",
        "name": "SMB-Windows Admin Shares",
        "evidence": [
          {
            "description": "A file is transferred over SMB to an administrative share (e.g., C$, ADMIN$) and the file's hash matches a known malicious signature, or a new process is executed on a host and the process image's hash matches a known malicious signature.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers, Database Servers, Developer Workstations, Executive Laptops",
            "action": [
              "Symbolic (IOC Match): For every file transfer observed in Zeek smb_files.log, calculate the file hash. Correlate this with process creation events (Windows Event ID 4688) on the destination host. Compare the file hash and process image hash against a threat intelligence feed of known malware and hacking tools. An exact match triggers a high-severity alert.",
              "Statistical (Entropy Analysis): Calculate the entropy of all executable files transferred over SMB to administrative shares. Establish a baseline for typical file entropy in the environment. Flag files with unusually high entropy scores (e.g., greater than 7.5), as this often indicates packed or encrypted malicious payloads. Correlate high-entropy file transfers with subsequent process execution from the same file.",
              "Machine Learning (Classification): Train a supervised classification model (e.g., Random Forest) using features extracted from file transfers and subsequent process executions. Features can include file entropy, file size, source/destination subnets, user account, time of day, and PE header characteristics. Use the model to classify each file transfer/execution sequence as 'benign' or 'malicious' and alert on 'malicious' classifications."
            ]
          },
          {
            "description": "A new service or named pipe is created on a host, and its name matches a known pattern associated with lateral movement tools (e.g., PsExec, Cobalt Strike), within a short time window following an inbound SMB connection (Logon Type 3).",
            "data_sources": [
              "Windows Event ID 7045",
              "Sysmon Event ID 17",
              "Sysmon Event ID 18",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers, Critical Application Servers, Privileged User Workstations",
            "action": [
              "Symbolic (Signature Match): Monitor for new service creation events (Windows Event ID 7045) and named pipe creation events (Sysmon Event ID 17). Apply a list of regular expressions to the 'ServiceName' and 'PipeName' fields to detect signatures of known lateral movement tools (e.g., `^PSEXESVC$`, `^msagent_[0-9a-f]{4}`, `^postex_`). Correlate a signature match with a preceding inbound network logon (Windows Event ID 4624, Logon Type 3) from the same source host within a 5-minute window.",
              "Statistical (N-gram Frequency Analysis): For all newly created service names and named pipes, calculate the n-gram frequency of the names. Establish a baseline of common n-grams from legitimate software in the environment. Identify and alert on names that contain rare or anomalous n-grams, or have a low overall probability score based on the baseline model, especially when created by a non-system account.",
              "Machine Learning (Clustering): Use an unsupervised learning model, such as DBSCAN, on features extracted from service and named pipe creation events. Features should include the user account that created the object, parent process name, name length, and character-type distribution (alpha, numeric, special). Identify and investigate clusters of activity that are separate from the large, dense clusters of normal administrative and software behavior, as these outliers represent potentially malicious tool artifacts."
            ]
          },
          {
            "description": "A successful network logon (Logon Type 3) occurs, followed by access to a default administrative share (e.g., C$, ADMIN$, IPC$), where the source-destination-account triplet is anomalous compared to a historical baseline. Anomalies include workstation-to-workstation admin share access or access from a user account that has never performed this action before.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 5145",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Servers, All Windows Workstations, Network East-West traffic monitoring points, VPN Concentrators",
            "action": [
              "Symbolic (Rule-based Filtering): Create a rule that triggers an alert for any successful network logon (Windows Event ID 4624, Logon Type 3) followed by access to an administrative share (Windows Event ID 5145, ShareName ending in '$') where the source and destination are both classified as 'workstation' assets, or where the authenticating account is not part of a pre-approved 'Remote Admins' security group.",
              "Statistical (Rarity Scoring): For each user, build a historical profile of hosts they typically access via SMB admin shares. For each new admin share access event, calculate a rarity score based on the historical frequency of the (user, source_host, destination_host) triplet. Flag events that fall into the 99th percentile of rarity. Additionally, monitor the number of distinct hosts a single source connects to via admin shares in a 1-hour window and alert if this count exceeds 3 standard deviations above the population's baseline.",
              "Machine Learning (Graph Analysis): Model the network as a graph where nodes are hosts and directed edges represent administrative share connections. Use a time-series analysis on graph metrics, such as the daily count of new edges (new source-destination pairs). Train a forecasting model (e.g., ARIMA) on these metrics. An alert is generated when the observed value significantly deviates from the forecasted value's confidence interval, indicating a potential lateral movement sweep."
            ]
          },
          {
            "description": "The behavioral sequence of an SMB connection to an administrative share, immediately followed by a file write, and then remote process execution of that same file on the destination host, all originating from the same source user/host.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek smb_files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, East-West traffic monitoring points, Domain Controllers, Critical Servers",
            "action": [
              "Symbolic (Sequence Detection): Implement a SIEM correlation rule that triggers when the following sequence of events occurs from the same source IP to the same destination host within a 2-minute window: 1. Successful network logon (Windows Event ID 4624, Logon Type 3). 2. A file is written to an administrative share (e.g., `\\hostname\\C$\\...`) observed via Zeek smb_files.log. 3. A new process is created (Windows Event ID 4688) on the destination host, where the `NewProcessName` matches the filename written in step 2.",
              "Statistical (Risk Scoring): For every observed file-write-then-process-execution sequence over SMB, calculate a risk score. Assign points for suspicious characteristics: file written to a non-standard directory (e.g., `C:\\Windows\\Temp`), executable file extension (.exe, .dll, .ps1), process executed by a system account shortly after being written by a user account, and source host is a workstation connecting to another workstation. Sum the points and alert on any sequence exceeding a predefined threshold.",
              "Machine Learning (Sequence Modeling): Develop a Hidden Markov Model (HMM) where the hidden states are 'Benign Admin Activity' and 'Lateral Movement TTP'. The observed events are the sequence of logs: logon, file write, process creation. Train the model on labeled data. Apply the trained model to new event sequences to find the most likely sequence of hidden states. A transition to and persistence in the 'Lateral Movement TTP' state would trigger a high-confidence alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]