[
  {
    "information_requirement": "Is the adversary exfiltrating data using scheduled transfers? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1029",
        "name": "Scheduled Transfer",
        "evidence": [
          {
            "description": "A time series of outbound network connections from a single internal host to a single external destination exhibits a fixed, repeating interval, and the destination IP address or resolved domain is present on a high-confidence threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Proxies), DNS Servers",
            "action": [
              "Symbolic Action: Query Zeek dns.log and conn.log for connections where the destination IP (`id.resp_h`) or queried domain (`query`) matches a list of known malicious C2 servers from a threat intelligence feed. Group by source IP (`id.orig_h`) and destination, then inspect for recurring connection timestamps.",
              "Statistical Action: For each source-destination IP pair in Zeek conn.log, calculate the time difference (delta) between consecutive connections. Compute the standard deviation of these deltas. A standard deviation near zero ($$\\sigma_{\\Delta t} \\approx 0$$) indicates a highly regular interval (beaconing). Flag pairs with low standard deviation and connections occurring outside of standard business hours.",
              "Machine Learning Action: Use a time series clustering algorithm (e.g., K-Shape) on connection logs for each host to group periodic network traffic patterns. Manually inspect clusters exhibiting high regularity (low intra-cluster variance) to identify potential scheduled exfiltration channels that were not previously known."
            ]
          },
          {
            "description": "A newly created or modified scheduled task (Windows Event ID 4698, 4702) is registered, and the associated command line or script content contains command-line arguments, tools, or encoded strings associated with data compression and/or network transfer.",
            "data_sources": [
              "Windows Event ID 4698",
              "Windows Event ID 4702",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for GPO-based tasks), Critical Application Servers, User Workstations, File Servers",
            "action": [
              "Symbolic Action: Scan the 'Command' and 'Arguments' fields within Windows Event ID 4698/4702 for known exfiltration tool names (`rclone`, `curl`, `wget`, `bitsadmin`), compression utilities (`tar`, `zip`, `7z`), or suspicious PowerShell commandlets (`Invoke-WebRequest`, `Start-BitsTransfer`). Alert on any match.",
              "Statistical Action: Calculate the Shannon entropy of the command-line arguments field for all newly created scheduled tasks. A high entropy score ($$ H(X) > 6.0 $$) can indicate the presence of obfuscated or encoded commands (e.g., PowerShell Base64). Flag high-entropy commands for manual review, especially those created by non-system accounts.",
              "Machine Learning Action: Train a classification model (e.g., Logistic Regression, Random Forest) on a labeled dataset of benign and malicious scheduled task command lines. Use features like command length, character distribution, presence of special characters, and keyword counts. Use the trained model to assign a 'suspicion score' to all new scheduled tasks created in the environment."
            ]
          },
          {
            "description": "A sequence of connections between a specific internal host and an external destination shows a statistically regular inter-arrival time, with a payload size ($$ orig\\_bytes $$) that is an outlier compared to the host's typical outbound traffic profile.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, VPN Concentrators",
            "action": [
              "Symbolic Action: Create a watchlist of sensitive internal hosts (e.g., domain administrators, finance department). Monitor all outbound connections from these hosts during non-business hours (e.g., 10 PM - 5 AM local time). Alert on any recurring connection to the same destination that is not on an approved application allowlist.",
              "Statistical Action: For each internal host, establish a baseline of outbound data transfer sizes (`orig_bytes` in Zeek conn.log) per protocol. Identify recurring connections (using time delta analysis) where the average transfer size is a statistical outlier (e.g., exceeds the 95th percentile of the host's baseline). Prioritize alerts where the connection interval is highly periodic.",
              "Machine Learning Action: Apply time series forecasting (e.g., ARIMA or Prophet) to the connection events for each source-destination pair. The model will predict the timestamp of the next expected connection. An actual connection occurring precisely as predicted strengthens the hypothesis of a scheduled task. Flag connections that are both highly predictable and have anomalous payload sizes."
            ]
          },
          {
            "description": "The total volume of data exfiltrated from a host to an external destination over a specific protocol (e.g., DNS, ICMP) or non-standard port exceeds a baseline by a significant margin, and this activity reoccurs at a regular time of day or day of week.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers",
            "action": [
              "Symbolic Action: Monitor Zeek conn.log for large outbound transfers ($$ orig\\_bytes > 1MB $$) over non-standard ports (ports not in the IANA-assigned list for common services) or protocols not designed for bulk transfer (e.g., ICMP). Alert if the same source-destination-port combination is seen multiple times at a similar time of day across several days.",
              "Statistical Action: Profile daily data transfer volumes per host and protocol. For each host, calculate the 99th percentile for daily bytes sent. Flag any day where the total bytes sent over a specific protocol (especially DNS or ICMP) exceeds this threshold. Correlate flagged days to see if they occur at a regular interval (e.g., every Tuesday).",
              "Machine Learning Action: Use an anomaly detection algorithm (e.g., Isolation Forest) on connection metadata from Zeek logs. Features should include `id.resp_p` (destination port), `proto` (protocol), `orig_bytes`, and hour of day. The model will learn 'normal' combinations of these features. Flag connections that the model scores as highly anomalous, then use time series analysis to check if these anomalies recur on a schedule."
            ]
          },
          {
            "description": "An unsigned process (Windows Event ID 4688) executes and subsequently accesses an unusually high number of files (Windows Event ID 4663) within a short time frame, followed by the initiation of a periodic outbound network connection (Zeek conn.log) from the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, User Workstations with access to sensitive data, Code Repositories",
            "action": [
              "Symbolic Action: Correlate a process execution event (4688) for an executable that is not signed by a trusted publisher with subsequent file access events (4663) from the same Process ID. If the process accesses files with sensitive extensions (`.docx`, `.xlsx`, `.sql`) in user directories and is followed by a new outbound network connection within 5 minutes, flag for review.",
              "Statistical Action: For each process on a host, count the number of unique file access events (4663) within a 1-minute window. Establish a baseline for common processes (`explorer.exe`, `svchost.exe`). Alert when a non-standard or unsigned process exhibits file access counts that are statistical outliers (e.g., > 3 standard deviations above the mean for that user/host). Correlate these 'file access bursts' with subsequent periodic network beaconing from the same host.",
              "Machine Learning Action: Use a sequence analysis model to identify the pattern of: [Unsigned Process Execution] -> [High-Volume File Access] -> [Periodic Network Connection]. Train the model on known benign and simulated malicious sequences. Deploy the model to score real-time event sequences on endpoints and flag those that match the malicious pattern with a high probability."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]