[
  {
    "information_requirement": "Is the adversary exfiltrating data over an established C2 channel? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1041",
        "name": "Exfiltration Over C2 Channel",
        "evidence": [
          {
            "description": "A connection from an internal host to a known malicious IP address, domain, or URL is observed with an outbound data volume greater than 1MB, indicating potential data transfer beyond standard beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) with a threat intelligence feed of known C2 indicators. Alert on any connection where the `id.resp_h` IP address, `dns.log` query, or `http.log` host header matches the feed.",
              "Statistical: For connections matching the C2 feed, calculate the 95th percentile of outbound bytes (`orig_bytes`) for all traffic to that C2 indicator over the last 30 days. Flag any new connection exceeding this established percentile, suggesting anomalous data transfer.",
              "Machine Learning: Train a logistic regression classifier on labeled historical data (C2 vs. benign traffic) using features like `orig_bytes`, `resp_bytes`, `duration`, and protocol. Use the model to score new connections to known C2 IPs and alert on high-probability exfiltration events."
            ]
          },
          {
            "description": "An HTTP or TLS connection exhibits a User-Agent, URI path, or JA3/S hash that matches signatures for known C2 framework file transfer functions, and the outbound byte count exceeds the inbound byte count by a factor of 10.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Application Servers, Web Proxies",
            "action": [
              "Symbolic: Scan `http.log` for User-Agent strings and URI patterns (e.g., '/download.php') and `ssl.log` for JA3/S hashes matching a list of known C2 frameworks. Generate an alert on any match.",
              "Statistical: For traffic matching a C2 signature, calculate the Shannon entropy of the URI path in `http.log`. Compare the entropy score to a baseline of normal web traffic; flag URIs with entropy scores greater than 3 standard deviations above the mean, suggesting randomized or encoded data in the path.",
              "Machine Learning: Use a pre-trained Random Forest model to classify SSL/TLS sessions based on features from `ssl.log` (e.g., `ja3`, `ja3s`, `version`, `cipher`) and `conn.log` (e.g., `duration`, `orig_bytes`). Flag sessions classified as known C2 frameworks with high confidence."
            ]
          },
          {
            "description": "The total outbound data volume from a single host over a common protocol (HTTP, DNS) exceeds its historical 99th percentile for a 1-hour window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Core Network Switches, Servers hosting sensitive data",
            "action": [
              "Symbolic: Create a rule to alert when a single DNS response in `dns.log` has a payload size greater than 1024 bytes, which is unusually large for typical DNS traffic and may indicate tunneling.",
              "Statistical: For each host, establish a baseline of outbound bytes (`orig_bytes`) per hour for each service (e.g., port 80, 443, 53). Calculate the 99th percentile for each baseline. Trigger an alert if a host's hourly outbound volume exceeds this threshold.",
              "Machine Learning: Apply a time-series forecasting model (e.g., ARIMA) to the `orig_bytes` for each host's outbound traffic. Flag any observation where the actual data volume significantly deviates from the forecasted volume and its confidence interval, indicating an unexpected spike in traffic."
            ]
          },
          {
            "description": "A process creation event for a known archiving utility (e.g., 7z.exe, rar.exe) on a host is followed within 15 minutes by an outbound network connection from the same host with a data volume greater than 100MB.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, File Servers, Domain Controllers",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 for process names like `7z.exe`, `rar.exe`, or `tar.exe` with subsequent `Zeek conn.log` records from the same source IP within a 15-minute window. Alert if the correlated connection has `orig_bytes` > 100MB.",
              "Statistical: For hosts where staging activity (archive tool usage) is detected, calculate the mean and standard deviation of their subsequent outbound connection sizes. Flag any connection that is more than 3 standard deviations larger than the host's average connection size.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) trained on event sequences (process creation, file access, network connection). Flag host activity sequences that match a learned pattern for 'staging-then-exfiltration' with a high probability."
            ]
          },
          {
            "description": "A network connection persists for more than 10 minutes and maintains an outbound-to-inbound byte ratio greater than 20:1, which is uncharacteristic of normal interactive sessions.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, VPN Concentrators, Egress Firewalls",
            "action": [
              "Symbolic: For all connections in `Zeek conn.log` with a duration greater than 600 seconds, create an alert if the ratio of `orig_bytes` to `resp_bytes` is greater than 20. Exclude known backup or data replication services by IP or port.",
              "Statistical: Calculate a rolling average of the byte ratio (`orig_bytes` / `resp_bytes`) for all long-lived connections. Flag any connection where this ratio remains consistently above the 99th percentile of all connection ratios for that destination port.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection features from `Zeek conn.log` such as `duration`, `orig_bytes`, `resp_bytes`, and the byte ratio. Investigate clusters identified as outliers, as they may represent anomalous traffic patterns like C2 exfiltration."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]