[
  {
    "information_requirement": "Is an adversary exfiltrating data from the network over an encrypted, non-C2 channel? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048.002",
        "name": "Exfiltration Over Asymmetric Encrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "An outbound encrypted connection (TLS/SSL) is established with an external destination IP address or domain known to be associated with malicious activity or data exfiltration services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Internal DNS Resolvers",
            "action": [
              "Symbolic: Join Zeek conn.log, dns.log, and ssl.log data on UID. Correlate the destination IP (`id.resp_h`), requested domain (`query`), and Server Name Indication (`server_name`) against a threat intelligence feed of known malicious indicators. Generate an alert upon a match.",
              "Statistical: Calculate the frequency of connections to newly observed domains or IPs across the enterprise. Flag destinations that are rare (e.g., contacted by <1% of hosts) and correlate with high outbound byte counts (`orig_bytes` in conn.log). Alert if a rare destination receives data in the top 5th percentile of all outbound transfers.",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on features from Zeek logs (JA3/JA3S hash, certificate details, connection stats) and threat intel labels (malicious/benign) to predict the likelihood of a new connection being malicious. Alert on connections classified as malicious with high confidence."
            ]
          },
          {
            "description": "An outbound encrypted connection uses a TLS certificate with anomalous attributes, such as being self-signed, having a short validity period (< 90 days), or using a generic subject, and is associated with a high-volume data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Endpoints initiating TLS traffic",
            "action": [
              "Symbolic: Filter Zeek ssl.log for connections where `validation_status` is 'self-signed certificate' or `validation_status` contains 'error'. Join with conn.log on UID and alert if `orig_bytes` exceeds a static threshold (e.g., 10MB).",
              "Statistical: For each TLS connection, calculate an anomaly score. Increment the score for self-signed status, low-entropy subject/issuer names (using Shannon entropy), and short validity duration. Alert on connections where the score exceeds the 98th percentile of all outbound TLS connections and the `orig_bytes` to `resp_bytes` ratio is greater than 10:1.",
              "Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on a feature set derived from Zeek ssl.log, including certificate validity duration, public key length, and categorical features for issuer and subject. Flag connections identified as outliers by the model, especially when correlated with high outbound byte counts from conn.log."
            ]
          },
          {
            "description": "The total volume of outbound data from a single host to a single external destination over an encrypted protocol exceeds the host's established 30-day baseline by a statistically significant margin (e.g., > 3 standard deviations).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, High-Value Asset Servers, User Workstations",
            "action": [
              "Symbolic: For outbound connections in Zeek conn.log, alert if `orig_bytes` exceeds a predefined, large static threshold (e.g., 500MB in a single session) to a non-sanctioned destination category.",
              "Statistical: For each internal host, calculate a daily rolling baseline (mean and standard deviation) of total outbound bytes (`orig_bytes`) per destination. Alert if the daily outbound volume to any single destination exceeds 3 standard deviations above the mean for that host-destination pair.",
              "Machine Learning: Apply a time series forecasting model (e.g., ARIMA) to each host's aggregate outbound data volume. Generate an alert when the observed volume significantly exceeds the model's predicted volume (i.e., falls outside the forecast's confidence interval), indicating a sudden, unpredicted spike in data transfer."
            ]
          },
          {
            "description": "An encrypted connection exhibits a data-flow ratio where outbound bytes are an order of magnitude greater than inbound bytes (e.g., > 20:1), deviating from typical interactive patterns.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Symbolic: From Zeek conn.log, filter for all completed connections (`history` field contains 'f') where `orig_bytes` > 1MB and the ratio of `orig_bytes` to `resp_bytes` is greater than 50. Alert on these connections.",
              "Statistical: Calculate the ratio of `orig_bytes / resp_bytes` for all outbound encrypted connections. Establish a baseline of this ratio for different services (e.g., web browsing, API calls). Flag any connection where the ratio exceeds the 99th percentile for its observed service type or for all traffic if the service is unknown.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means or DBSCAN) on connection features from Zeek conn.log, including `duration`, `orig_bytes`, `resp_bytes`, and the byte ratio. Identify and investigate clusters characterized by high `orig_bytes`, low `resp_bytes`, and short `duration`, as these are indicative of data dumping."
            ]
          },
          {
            "description": "An outbound encrypted network connection with significant data transfer is initiated by a process not on an established allowlist of network-enabled applications or a process running from a temporary or suspicious directory.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Servers, Domain Controllers",
            "action": [
              "Symbolic: Correlate Zeek conn.log outbound connections with Windows Event ID 4688 process creation events. Alert if the process name (e.g., `powershell.exe`, `wscript.exe`) or path (e.g., `C:\\Windows\\Temp\\`) matches a predefined list of suspicious indicators and `orig_bytes` is > 1MB.",
              "Statistical: Create a baseline of all network-communicating processes across the enterprise. Calculate the frequency of each process. Alert when a statistically rare process (e.g., seen on <1% of endpoints) initiates an outbound encrypted connection with a high `orig_bytes` count.",
              "Machine Learning: Develop a classification model to score the maliciousness of a process based on features from Event ID 4688 (process name, parent process, command line arguments). If a process classified as suspicious creates a network connection, and that connection in Zeek conn.log shows a high outbound byte count, escalate with a high-priority alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]