[
  {
    "information_requirement": "Has the adversary accessed credentials via web portal capture?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1056.003",
        "name": "Web Portal Capture",
        "evidence": [
          {
            "description": "Modification of a web portal's HTML or JavaScript files (e.g., login.aspx, vpn.js) to include a new, external script source URL or a form action URL pointing to a domain not on an approved list.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing web servers hosting login portals (VPN, OWA, SharePoint)",
            "action": [
              "Rule-based: Monitor file modification events (Windows Event ID 4663) on login portal files. For any change, extract all external script source URLs and form action URLs. Compare these against a threat intelligence feed of known malicious domains and an allowlist of legitimate partner domains. Alert on any match to the malicious feed or any URL not on the allowlist.",
              "Statistical: For all external domains referenced in login page files, calculate the domain's age and popularity using percentile ranking from public sources. Create a risk score based on low age, low popularity, and high-entropy domain names (e.g., shannon_entropy(domain_name) > 3.5). Alert on domains exceeding a risk score threshold.",
              "Machine Learning: Use a time-series model to monitor the rate of change for login page files. Generate an alert if a file modification event occurs outside of a predicted maintenance window based on historical update patterns. Correlate this temporal anomaly with process creation events (Windows Event ID 4688) to identify unauthorized update mechanisms."
            ]
          },
          {
            "description": "HTTP POST or GET requests originating from the web portal server to an external destination, where the URI or request body contains key-value pairs matching common credential formats (e.g., 'username=', 'password=') and the destination IP is not on an established allowlist.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for the DMZ hosting the web portal servers",
            "action": [
              "Rule-based: Create a SIEM rule that triggers on Zeek http.log events where `id.orig_h` is the web portal server's IP, `id.resp_h` is not an internal IP, and the `uri` or `post_body` field contains regex matches for credential patterns like `/(user|pass|token)=[^&]+/i`. Alert if the destination IP is not on a pre-defined allowlist.",
              "Statistical: Maintain a 90-day rolling baseline of all outbound destination IP addresses, ASNs, and countries from the web portal server using Zeek conn.log. Calculate the frequency of each destination. Alert if the server connects to a destination IP that falls below the 5th percentile of frequency and the connection involves data transfer patterns (e.g., small, repeated uploads) that deviate more than 2 standard deviations from the server's typical outbound traffic profile.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) classifier on legitimate outbound connection features from Zeek conn.log (e.g., destination port, bytes sent, connection duration, destination ASN). Use the trained model to classify new outbound connections in real-time. Any connection flagged as an outlier, especially if correlated with a preceding login attempt, should generate a high-priority alert."
            ]
          },
          {
            "description": "A file modification event on a web portal login page, initiated by a process not on the authorized process allowlist, is followed within a short time window (e.g., 5 minutes) by an outbound network connection to a new or rare destination IP/domain.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web portal application servers and their associated host-based monitoring agents",
            "action": [
              "Rule-based: Create a correlation rule that triggers when a Windows Event ID 4663 on a login page file is followed within 5 minutes by a Zeek conn.log event from the same host to an external IP not seen in the last 30 days. The rule should trigger only if the process name in the 4663 event is not on an allowlist of deployment scripts.",
              "Statistical: For each process that modifies a login page file (identified via Windows Event ID 4663/4688), calculate the Shannon entropy of the command line. A high entropy score (e.g., > 4.0) may indicate obfuscated commands. Correlate high-entropy process executions with subsequent rare outbound connections from the host.",
              "Machine Learning: Use a sequence analysis model (e.g., a Hidden Markov Model) trained on typical sequences of events (process creation -> file modification -> network connection) for legitimate software updates. Generate an alert when an observed sequence of events has a low probability under the trained model, indicating an anomalous chain of activity."
            ]
          },
          {
            "description": "The outbound network traffic profile of a web portal server deviates significantly from its established baseline, showing new destination geolocations or ASNs, or a shift in traffic patterns towards small, periodic data transmissions characteristic of beaconing or trickled exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensor data at the DMZ egress point",
            "action": [
              "Rule-based: Maintain an allowlist of countries and ASNs to which the web portal server is expected to connect. Monitor Zeek conn.log and alert on any successful connection (`conn_state` = 'SF') to a country or ASN not on this list.",
              "Statistical: Profile the baseline for each server's outbound traffic in Zeek conn.log, creating distributions for `orig_bytes` and `duration`. Alert if the 95th percentile of `orig_bytes` in a 1-hour window drops by more than 50% while the connection count increases, suggesting a shift to small, frequent transmissions.",
              "Machine Learning: Apply time-series decomposition to the volume of outbound data. Analyze the residual component of the time series; a spike in the residual, indicating a sudden change not explained by trend or seasonality, should be flagged as an anomaly. Cluster connections by features (bytes, duration, port) to identify the emergence of a new cluster representing exfiltration behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary collecting data via web portal capture?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1056.003",
        "name": "Web Portal Capture",
        "evidence": [
          {
            "description": "A new file is created on the web server (e.g., in `wwwroot` or a temp directory) whose filename, hash, or content matches signatures of known web shells or credential harvesting scripts.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of externally-facing web servers, particularly web root and temporary directories",
            "action": [
              "Rule-based: Monitor file creation events (Windows Event ID 4663/4688) in web-accessible directories. For each new file, calculate its hash and compare it against a threat intelligence feed of known malicious file hashes. Scan file content for regex matches of known malicious functions (e.g., `passthru`, `eval`, `shell_exec`).",
              "Statistical: Profile the entropy of files in the web root. Calculate the average entropy for different file types (e.g., .js, .html, .aspx). Alert if a new file is created with an entropy score that is more than 3 standard deviations above the mean for its file type, as this often indicates packed or encrypted malicious code.",
              "Machine Learning: Use a trained classifier (e.g., Gradient Boosting) on file-based features (file size, entropy, count of suspicious keywords, presence of long strings) to predict whether a new file is malicious. A prediction score above a certain threshold (e.g., 0.85) triggers an alert."
            ]
          },
          {
            "description": "A web server process (e.g., w3wp.exe) spawns a command-line interpreter or scripting engine to write captured data into a temporary file.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution logs on web portal servers",
            "action": [
              "Rule-based: Create a SIEM rule to alert on any Windows Event ID 4688 where the `ParentProcessName` is a legitimate web server process (e.g., `w3wp.exe`, `httpd.exe`) and the `NewProcessName` is a command-line interpreter (e.g., `cmd.exe`, `powershell.exe`, `bash`). This is highly anomalous.",
              "Statistical: Establish a baseline of all parent-child process relationships on web servers and calculate their frequency. Alert when a relationship occurs that is in the bottom 1st percentile of frequency (i.e., extremely rare), such as `w3wp.exe` spawning `whoami.exe`.",
              "Machine Learning: Model command-line arguments using NLP techniques like TF-IDF. Train a classification model to distinguish between benign and malicious command lines spawned by web servers. Anomaly detection can also be applied to the sequence of commands executed, flagging unusual chains of activity."
            ]
          },
          {
            "description": "A file in an unexpected directory (e.g., an image folder) or a hidden file experiences repeated write operations, causing its size to grow in small, regular increments that correlate with user login attempts on the web portal.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File system audit logs for web server directories, including temporary, image, and document root folders",
            "action": [
              "Rule-based: Monitor Windows Event ID 4663 (write access) in non-standard log directories (e.g., `/images`, `/css`, `C:\\Windows\\Temp`). Alert if a file is written to by a web server process and has a file extension that does not match its expected content (e.g., a .jpg file containing text).",
              "Statistical: For any file receiving multiple write events from a web process, perform a time-series analysis on its file size. If the standard deviation of the size deltas is low (indicating consistent, small additions) and the writes correlate with login POST requests in Zeek http.log, generate an alert.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on file write events, using features like file path, process name, and write frequency. This can automatically group normal logging behavior. Any file write event that does not belong to a known 'normal' cluster is flagged as an outlier."
            ]
          },
          {
            "description": "A web server process is observed accessing sensitive files (e.g., web.config, .env, SAM hive) and is subsequently observed writing to a new or unusual file within a short time window, suggesting staging of collected configuration data or secrets.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-level audit logs on web servers, with SACLs configured for sensitive configuration files and registry hives",
            "action": [
              "Rule-based: Configure SACLs on sensitive files (e.g., `web.config`). Create a SIEM rule to trigger if a web server process generates a read access event (4663) on one of these files, followed within 1 minute by a write access event (4663) from the same process to a file in a temporary directory.",
              "Statistical: Build a baseline of all files typically read by the web server process. Alert if the process attempts to read a file that falls into a 'rare access' category (e.g., accessed less than 0.01% of the time by this process), especially if it's a system or configuration file.",
              "Machine Learning: Use graph analysis to model interactions between processes and files. By training a graph-based anomaly detection model on normal process-file interaction graphs, novel or suspicious paths (e.g., web process reads config file, then writes to temp file) can be identified and alerted on."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]