[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by clearing mailbox data?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.008",
        "name": "Clear Mailbox Data",
        "evidence": [
          {
            "description": "Execution of a command-line process that exactly matches a known malicious signature from threat intelligence feeds or internal incident reports for tools used to clear mailbox data.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers, Mail Gateway Servers, Administrator Workstations",
            "action": [
              "Symbolic: Maintain a list of highly specific, full command-line strings and script block hashes (SHA256) known to be used by malicious tools for clearing mailbox data. Use exact string and hash matching against the command-line field in Windows Event ID 4688 and script block text in PowerShell Event ID 4104. Alert on any exact match as a high-confidence indicator.",
              "Statistical: Aggregate all command-line executions by their SHA256 hash across the enterprise over a 30-day rolling window. Calculate the rarity of each command-line hash. Flag command-lines that are executed on mail servers and fall below a low prevalence threshold (e.g., seen on < 0.01% of systems), indicating a rare and potentially suspicious command.",
              "Machine Learning: Train a one-class Support Vector Machine (SVM) model on a dataset of benign command-lines and PowerShell script blocks executed on mail servers, using features like command length, character distribution (entropy), and argument count. Apply the trained model to new executions in real-time to detect outliers that do not conform to the learned pattern of normal administrative activity."
            ]
          },
          {
            "description": "Execution of specific PowerShell cmdlets or command-line arguments indicative of mailbox data deletion, export request removal, or mail rule manipulation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers, Microsoft 365 / Exchange Online tenancy, Domain Controllers (for PowerShell remoting logs)",
            "action": [
              "Symbolic: Using regular expressions, search process command-lines (Windows Event ID 4688) and PowerShell script block logs (Event ID 4104) for keywords such as 'Remove-MailboxExportRequest', 'Search-Mailbox -DeleteContent', 'New-ComplianceSearchAction -Purge', 'Set-InboxRule -Delete', and 'Remove-InboxRule'. Create high-fidelity alerts for matches, especially when executed by non-administrative accounts or service accounts.",
              "Statistical: For each user, establish a baseline of the frequency and types of Exchange management cmdlets they execute. Calculate the 95th percentile for the daily count of deletion-related cmdlets per user. Generate an alert when a user's daily count exceeds this personal percentile, indicating an anomalous volume of activity. Also, calculate the entropy of cmdlet names used by a user in a session; a sudden drop in entropy may indicate repetitive, scripted execution.",
              "Machine Learning: Develop a sequence analysis model, such as a Long Short-Term Memory (LSTM) network, trained on sequences of cmdlets executed by administrators during normal operations. Feed real-time cmdlet execution sequences into the model. An alert is triggered if the model predicts a low probability for the observed sequence (e.g., `Search-Mailbox` followed immediately by `Remove-MailboxExportRequest`), indicating a deviation from normal administrative workflows."
            ]
          },
          {
            "description": "An access event indicating a 'DELETE' operation on a file object whose path and extension match those of mail server databases, transaction logs, or user-specific mail archives.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 23"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Server database and log directories, User profile directories containing PST/OST files on endpoints and servers",
            "action": [
              "Symbolic: Configure and monitor for Windows Event ID 4663 (with 'Accesses' field containing 'DELETE') or Sysmon Event ID 23 (FileDelete). Create a high-priority alert where the target file path matches critical mail data files (e.g., *.edb, *.log, *.jrs in Exchange directories, or *.pst, *.ost in user directories), especially when the deleting process is not a standard mail client or backup service (e.g., `powershell.exe`).",
              "Statistical: For critical mail directories, establish a baseline for the rate of file deletions per hour. Use time series analysis to monitor this rate. An alert is generated if the deletion rate for a given time window exceeds a dynamic threshold, such as three standard deviations above the moving average, suggesting a bulk deletion event.",
              "Machine Learning: Use an unsupervised clustering algorithm like DBSCAN on file deletion events. Feature vectors should include the deleting process name, user account, file extension, and time of day (e.g., business hours vs. non-business hours). The model can identify anomalous clusters of activity, such as deletions initiated by an unusual process (e.g., `rundll32.exe`) in the middle of the night, which would be isolated from the dense clusters of normal activity."
            ]
          },
          {
            "description": "A statistically significant spike in the volume of mail deletion commands or file delete operations originating from a single user, host, or process within a compressed timeframe, exceeding established behavioral norms.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Exchange Servers, User endpoints, Microsoft 365 / Exchange Online tenancy audit logs",
            "action": [
              "Symbolic: Create a rule that triggers when a single user or source host generates more than a fixed number (e.g., >50) of 'Search-Mailbox -DeleteContent' or 'Remove-InboxRule' events within a 10-minute window. This simple threshold acts as a tripwire for brute-force clearing activity.",
              "Statistical: For each user, aggregate mail deletion events (from PowerShell logs and file access logs) per hour. Calculate a historical baseline distribution of these counts for each user over the last 30 days. Generate an alert if a user's hourly deletion count exceeds their personal 99th percentile, which is more effective than a global threshold.",
              "Machine Learning: Implement a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the stream of mail deletion events aggregated per minute for the entire organization. This model can learn the normal rhythm of deletions (e.g., higher during business hours) and detect sudden, anomalous bursts of activity that deviate from learned seasonal patterns, indicating an automated script."
            ]
          },
          {
            "description": "The occurrence of a confirmed mailbox clearing event within a predefined time window (e.g., +/- 60 minutes) of other suspicious security alerts, such as credential dumping, lateral movement, or large volume data transfers to an external destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire enterprise network, including Domain Controllers, Exchange Servers, and Internet Gateway",
            "action": [
              "Symbolic: Create a correlation rule in the SIEM that triggers if a high-confidence mailbox clearing alert is followed within 30 minutes by an alert for lsass.exe memory access (credential dumping), a successful remote login (Event ID 4624, Logon Type 3 or 10) to a new host, or a `net use` command from the same source host or user.",
              "Statistical: For each host, calculate a composite risk score. Increment the score when suspicious events occur. A mailbox clearing event adds a significant value. Other events, like a login from a rare geolocation (from Zeek conn.log + GeoIP) or an unusually large data upload (from Zeek conn.log `orig_bytes` > 95th percentile), also add points. If a host's risk score crosses a statistically determined threshold, trigger an alert.",
              "Machine Learning: Use a graph-based analysis model to construct event graphs where nodes are users, hosts, and processes, and edges represent actions. Train a graph neural network (GNN) to identify subgraphs representing malicious attack chains. A subgraph containing a process node connected to a 'deletes-mail' edge that is also connected to a 'credential-dump' node and an 'external-connection' node would be flagged as a high-confidence multistage attack."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]