[
  {
    "information_requirement": "Is the adversary using mail protocols for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1071.003",
        "name": "Mail Protocols",
        "evidence": [
          {
            "description": "A mail protocol connection (SMTP, POP3, IMAP) where the source or destination IP address or domain matches an entry on a threat intelligence feed of known malicious C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Symbolic: Continuously cross-reference destination IPs from Zeek conn.log (on ports 25, 110, 143, 465, 587, 993, 995) and SMTP HELO/MAIL FROM domains from Zeek smtp.log against a high-confidence CTI feed of known C2 indicators. Generate an alert on any match.",
              "Statistical: For domains not on a CTI list, calculate the rarity of the effective top-level-domain-plus-one (eTLD+1) across a 30-day baseline of all network traffic. Flag connections to domains in the bottom 5th percentile of prevalence, as C2 domains are often new or rare.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) using features like domain age, lexical features of the domain name (length, character ratios), and DNS query history to predict if a domain is malicious. Apply the model to all new mail server domains and alert on high-probability predictions."
            ]
          },
          {
            "description": "The presence of specific, non-standard email headers, subject line formats, or message body structures that match known signatures of malware C2 communications.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek pop3.log",
              "Zeek imap.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Relays",
            "action": [
              "Symbolic: Apply a set of regular expressions (regex) against email metadata fields (e.g., smtp.log 'subject', 'from', 'to', 'user_agent') to detect patterns matching known C2 tool signatures (e.g., base64 strings, GUIDs, fixed keywords). Alert on any regex match.",
              "Statistical: Calculate the Shannon entropy for the subject line and `x_originating_ip` header fields for all outbound mail. Establish a baseline entropy score. Flag any email where the subject line entropy exceeds the 99th percentile, suggesting encoded data rather than human-readable text.",
              "Machine Learning: Use a Natural Language Processing (NLP) topic modeling algorithm (e.g., Latent Dirichlet Allocation - LDA) on email subject lines. Identify anomalous topics that are semantically incoherent or comprised of random-looking character strings, which may represent C2 channels."
            ]
          },
          {
            "description": "Mail protocol connections from a single host to a single destination that occur at regular, periodic intervals with low jitter, or consistently outside of profiled user activity hours.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices",
            "action": [
              "Symbolic: For any given source-destination IP pair using a mail protocol, if the time between connections is consistently N seconds +/- a small tolerance (e.g., 60s +/- 5s) for more than 10 consecutive connections, flag as potential beaconing.",
              "Statistical: For each source-destination-port tuple, collect connection timestamps over a 24-hour period. Calculate the standard deviation of the inter-arrival times (time delta between connections). A very low standard deviation indicates machine-like periodicity. Flag tuples with a standard deviation below a determined threshold (e.g., < 10 seconds).",
              "Machine Learning: Apply a time-series decomposition model to the connection frequency data for each host. Isolate the periodic component of the time series. If a strong, consistent periodic signal is detected that cannot be attributed to legitimate background activity, classify it as anomalous beaconing behavior."
            ]
          },
          {
            "description": "A mail protocol session with an anomalous data transfer volume or a client-to-server byte ratio that deviates significantly from an established baseline.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Symbolic: Create a rule to flag any single SMTP transaction where the outbound data size (`orig_bytes`) exceeds a hard threshold (e.g., 50MB) that is considered abnormal for a single email in the environment.",
              "Statistical: For each host, profile the distribution of `orig_bytes` and the ratio of `orig_bytes` to `resp_bytes` for mail protocol connections over a 30-day period. Flag any new connection where the byte count or the ratio exceeds the 98th percentile of the host's historical baseline.",
              "Machine Learning: Use an unsupervised anomaly detection algorithm like Isolation Forest on session data, using features such as `orig_bytes`, `resp_bytes`, and `duration`. The model will learn normal patterns and flag sessions that are easily isolated as outliers, which may represent data exfiltration over a mail channel."
            ]
          },
          {
            "description": "Mail protocol network traffic originating from a process not on an allowlist of approved mail clients, or a connection to an external mail server not on an organizational allowlist.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices",
            "action": [
              "Symbolic: Correlate network connections from Zeek conn.log with process creation events (Windows Event ID 4688) by host and timestamp. Alert if the initiating process name for traffic on mail ports is not in a defined allowlist (e.g., 'OUTLOOK.EXE', 'thunderbird.exe').",
              "Statistical: Maintain a list of processes that initiate mail protocol traffic for each host. Calculate the frequency of each process initiating such traffic. Flag any process that is statistically rare for a given user or host (e.g., a process that appears for the first time or has a frequency in the bottom 1st percentile).",
              "Machine Learning: Train a classification model based on process parent-child relationships and command-line arguments (from Windows Event ID 4688). Use the model to predict if a process initiating network activity is legitimate or suspicious. Apply this model to processes making mail protocol connections and flag those classified as suspicious."
            ]
          },
          {
            "description": "Data within specific, human-readable email fields (e.g., subject, headers) exhibits a high Shannon entropy score, indicating the presence of non-textual, potentially encrypted or encoded, C2 data.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Relays",
            "action": [
              "Symbolic: Scan the subject line of emails in smtp.log for long strings (e.g., > 50 characters) that contain no spaces and are composed of only base64 characters ([A-Za-z0-9+/=]). Alert on a match.",
              "Statistical: For each outbound email, calculate the Shannon entropy of the subject line and the SMTP HELO string. Establish a baseline mean and standard deviation for these fields across the organization. Flag any email where the entropy score for either field is more than 3 standard deviations above the mean.",
              "Machine Learning: Train a binary classifier (e.g., Logistic Regression) with features like string length, character frequency distribution, and Shannon entropy to distinguish between normal text and encoded C2 payloads. Apply this model to subject lines and other relevant fields to identify covert channels."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]