[
  {
    "information_requirement": "Has the adversary gained initial access using default accounts?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078.001",
        "name": "Default Accounts",
        "evidence": [
          {
            "description": "A successful remote authentication (e.g., RDP, VPN, SSH) from an external IP address uses a known default account name.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Application/Appliance Authentication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ-hosted application servers, VPN Concentrators, Internet-facing network appliances (firewalls, routers), Domain Controllers",
            "action": [
              "Symbolic: Maintain a watch list of known default usernames (e.g., 'admin', 'administrator', 'root', 'guest', 'vpxuser'). Ingest and query authentication logs (Windows Event ID 4624) for successful remote logins (Logon Type 3 or 10) where the target username is on the watch list and the source IP address is external (not within RFC 1918 ranges). Cross-reference the source IP with Zeek conn.log data to confirm it originated from outside the corporate network.",
              "Statistical: For all successful external authentications, calculate the historical login frequency for each username over the last 90 days. Flag any successful login from an external IP for a username that has a login frequency in the bottom 5th percentile, especially if that username is a known default account. This highlights the anomalous use of rarely used or dormant default accounts.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on enriched authentication events. Features should include: username on default list (boolean), source IP geolocation (country, ASN), time of day, day of week, and historical login success/failure ratios from that IP/ASN. The model will classify each external login as 'benign' or 'suspicious default account abuse'. A high-probability 'suspicious' classification triggers an alert."
            ]
          },
          {
            "description": "Network traffic from a single external source IP exhibits patterns of scanning for common services or login pages, identified by User-Agent strings or high connection diversity.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internet-facing web servers, DMZ",
            "action": [
              "Symbolic: Create and apply a ruleset against Zeek http.log data to detect User-Agent strings associated with common scanning and exploitation tools (e.g., 'metasploit', 'nmap', 'hydra', 'feroxbuster'). Alert on any HTTP request from an external IP matching this ruleset, especially if directed at a known login page URI.",
              "Statistical: From Zeek conn.log, group by external source IP and calculate the number of unique destination hosts and ports attempted within a 5-minute window. A source IP exceeding the 99th percentile for connection diversity (e.g., connecting to >20 hosts on port 445 or >50 hosts on port 22) indicates scanning behavior. Calculate the entropy of requested URLs in http.log from a single source IP; a sudden spike in entropy can indicate automated scanning.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume of authentication attempts per minute against external-facing services. Train the model on at least 30 days of data to learn normal patterns. An alert is generated when the observed volume significantly deviates from the forecasted volume, which can indicate the start of a brute-force or password spraying attack."
            ]
          },
          {
            "description": "A built-in default account (e.g., Administrator, Guest, root) successfully authenticates to a specific host for the first time in recorded history.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Application/Appliance Authentication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Endpoint workstations, Virtualization Hosts (ESXi)",
            "action": [
              "Symbolic: Maintain a state table or lookup file of (hostname, username) pairs that have previously logged in successfully. Query new successful login events (Windows Event ID 4624) and alert if the (hostname, username) pair is not in the state table and the username is a known default account (e.g., Administrator, Guest, vpxuser, root). Prioritize if the login source IP is external.",
              "Statistical: For each host, create a baseline of all user accounts that have logged in over the past 180 days. Calculate the rarity of each new login by comparing it to this historical set. A successful login by a default account that has a historical login count of zero on a specific asset is a high-severity statistical anomaly. Score the anomaly higher if the login type is remote (Type 3 or 10).",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on login events, with features like (hostname, username, source IP geolocation, time of day). The goal is to group 'normal' login behaviors. Logins that are marked as noise or outliers by the algorithm, particularly those involving default accounts, should be flagged for investigation as they do not fit any established pattern of activity."
            ]
          },
          {
            "description": "Authentication logs show a high count of failed logins for a single default username originating from numerous distinct source IPs within a short time window.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory), Externally-facing services, VPN endpoints",
            "action": [
              "Symbolic: Create a detection rule that triggers when more than 10 distinct hosts record a failed login (Windows Event ID 4625) for the same default username (e.g., 'administrator', 'guest') from a single source IP address within a 15-minute window. This is a classic password spraying signature.",
              "Statistical: Aggregate all failed login events (Windows Event ID 4625) over a 30-minute sliding window. Group by username and count the number of distinct source workstations/IPs. If the count of distinct sources for a single default username exceeds 3 standard deviations above the moving average for that account, generate an alert. This detects a distributed or slow password spraying attack.",
              "Machine Learning: Model user login behavior using a Hidden Markov Model (HMM) where states represent 'normal login', 'failed login', and 'spraying attack'. Transitions are learned from historical data. A sequence of events like (failed login from IP1 -> failed login from IP2 -> failed login from IP3) for the same user account in a short period would have a high probability of transitioning to the 'spraying attack' state, triggering an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using default accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1078.001",
        "name": "Default Accounts",
        "evidence": [
          {
            "description": "A process executed by a default account establishes a network connection to a destination IP or domain matching a threat intelligence feed of known Command and Control (C2) infrastructure.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Servers, Network egress points",
            "action": [
              "Symbolic: Join process creation events (Windows Event ID 4688) with logon session information to identify processes running under a default account. Join the process's network connections (from Zeek conn.log, correlated by source IP and timestamp) with a threat intelligence feed of known C2 IP addresses. An exact match generates a high-fidelity alert.",
              "Statistical: For each process run by a default account, calculate the rarity of the destination IP address it connects to based on historical Zeek conn.log data. If a destination IP falls into the 1st percentile of connection frequency (i.e., is extremely rare) for the entire organization over the last 90 days, flag it for investigation. This can uncover new or unknown C2 infrastructure.",
              "Machine Learning: Develop a model to classify network beaconing. Extract features from Zeek conn.log for connections originating from default account processes: connection duration, bytes sent, bytes received, and inter-arrival time between connections to the same destination. Train a classifier (e.g., an SVM) to distinguish between normal traffic and C2 beaconing. A connection classified as 'beaconing' is a strong indicator of persistence."
            ]
          },
          {
            "description": "A default account creates or modifies a persistence mechanism (Scheduled Task, Service, or Registry Run Key) to execute a program.",
            "data_sources": [
              "Windows Event ID 4698",
              "Windows Event ID 4702",
              "Windows Event ID 7045",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Servers (especially Domain Controllers and critical application servers)",
            "action": [
              "Symbolic: Create an alert that triggers whenever a Windows Event ID 4698 (Scheduled Task Created), 7045 (Service Created), or 4657 (Registry Value Modified on a Run Key) is generated and the Subject/Username is a known built-in default account (e.g., Administrator, SYSTEM, Guest). This activity by a default account is inherently suspicious and should always be investigated.",
              "Statistical: Analyze the command line/executable path field for all new persistence mechanisms. Calculate the Shannon entropy of the command line string. A command line with an entropy score significantly higher than the baseline average for persistence entries (e.g., > 2 standard deviations) may indicate obfuscated or encoded commands. Also, flag any executable path pointing to a world-writable location (e.g., C:\\Users\\Public\\, C:\\PerfLogs\\).",
              "Machine Learning: Train a classification model to determine if a newly created scheduled task or service is malicious. Features should include: account that created it (is it a default account?), executable path location, presence of suspicious arguments (e.g., 'powershell -enc'), and comparison of the executable's hash to a known-good list. A 'malicious' classification triggers an alert."
            ]
          },
          {
            "description": "A non-interactive default service account spawns an interactive process (e.g., powershell.exe, cmd.exe) or makes an outbound network connection inconsistent with its established baseline.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application Servers, Database Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a rule to alert any time a process is created (Windows Event ID 4688) where the parent process is a non-interactive service (e.g., 'services.exe') and the new process is an interactive shell ('powershell.exe', 'cmd.exe', 'pwsh.exe'). This is a strong indicator of interactive use of a non-interactive account.",
              "Statistical: For each default service account, build a historical baseline of parent-child process relationships and outbound network connection destinations (IPs, domains, ports). Use a scoring system to flag deviations. For example, a new child process adds +1, a new destination port adds +1, a new destination ASN adds +2. A cumulative score exceeding a threshold (e.g., 3) in a 24-hour period indicates anomalous behavior for that account.",
              "Machine Learning: Use a graph-based anomaly detection approach. Model normal system activity as a graph where nodes are processes and accounts, and edges are actions (e.g., 'spawned', 'connected to'). Train the model on baseline activity for default accounts. A new, previously unseen edge, such as a default web service account node connecting to a 'powershell.exe' node, would be flagged as a high-scoring anomaly."
            ]
          },
          {
            "description": "A previously dormant or disabled default account becomes enabled and is then used to successfully log in, especially at an anomalous time.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4722",
              "Windows Event ID 4725"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Logs Archive",
            "action": [
              "Symbolic: Chain events to create a high-fidelity alert: Trigger when a default account is enabled (Windows Event ID 4722) and is immediately followed by a successful interactive or remote logon (Windows Event ID 4624 with Logon Type 2, 3, or 10) by that same account within 5 minutes.",
              "Statistical: For every default account, calculate the number of days since its last successful login. If an account logs in successfully and its 'days since last login' value is greater than the 95th percentile for all accounts (e.g., > 90 days), flag it as a 'dormant account activation'. Add risk if the login occurs outside of business hours (e.g., 10 PM - 6 AM local time).",
              "Machine Learning: Apply time-series anomaly detection to the login frequency of each default account. A model (e.g., Prophet, LSTM) trained on the daily login counts for each account can detect sudden spikes in activity. An alert is generated when the observed login count for a previously flat-lined (dormant) account significantly exceeds the model's forecast."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary escalated privileges using default accounts?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1078.001",
        "name": "Default Accounts",
        "evidence": [
          {
            "description": "A default account executes a process with command-line arguments matching signatures for credential theft tools like Mimikatz.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All servers and endpoints, especially Domain Controllers",
            "action": [
              "Symbolic: Scan the 'CommandLine' or 'ProcessCommandLine' field in Windows Event ID 4688 events for known credential dumping signatures (e.g., 'mimikatz', 'sekurlsa::logonpasswords', 'lsadump::sam', 'procdump -ma lsass.exe') where the process is executed by a default account. These matches are high-confidence indicators.",
              "Statistical: Calculate the average length and character entropy of command lines executed by default accounts. Alert when a new command's length or entropy exceeds 3 standard deviations from the established baseline for that specific account. This can detect unusually long or obfuscated/encoded commands often used in exploits.",
              "Machine Learning: Train a text classification model (e.g., using TF-IDF and a Naive Bayes classifier) on a labeled dataset of benign and malicious command lines. Feed all command lines executed by default accounts into the model. An alert is triggered if the model classifies a command as 'malicious' with a high confidence score."
            ]
          },
          {
            "description": "A default account adds another principal to a high-privilege local or domain group (e.g., Administrators, Domain Admins).",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, High-value servers",
            "action": [
              "Symbolic: Create a critical alert that triggers on any occurrence of Windows Event ID 4732, 4728, or 4756 where the 'Member Name' is added to a privileged group (e.g., 'Administrators', 'Domain Admins', 'Enterprise Admins') and the 'Subject/Account Name' that performed the action is a built-in default account. This action should be almost non-existent in a properly managed environment.",
              "Statistical: Maintain a baseline of which accounts add members to which groups. Alert on any group membership change that is a statistical outlier, for example, a default account that has never before added a user to any group suddenly adding a user to 'Domain Admins'. This 'first time' activity is a significant anomaly.",
              "Machine Learning: Use a graph-based model of your Active Directory. Nodes are users and groups, edges are 'member of' relationships. Any modification to the graph (an edge addition) can be scored for risk. A default account node creating an edge to a high-privilege group node for another user node would be a high-risk event, especially if that user node was recently created or is also anomalous."
            ]
          },
          {
            "description": "A default account with no history of administrative activity performs a privileged action, such as creating a new user account, for the first time.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Endpoint workstations",
            "action": [
              "Symbolic: Create a detection rule for 'first-time privileged action'. Maintain a state table of (account_name, privileged_event_id) pairs. When a privileged event (e.g., 4720, 7045) occurs, check if the pair (Subject Account Name, Event ID) exists. If not, and if the account is a default account, add the pair to the table and generate a high-priority alert.",
              "Statistical: For each default account, track the frequency of privileged actions over time. A sudden spike in the count of privileged events (e.g., user creations, service installations) from an account that historically has a rate of zero is a major statistical anomaly. Alert if the daily count of such actions for a default account exceeds a predefined low threshold (e.g., > 0).",
              "Machine Learning: Employ peer group analysis. Group default accounts by their role (e.g., built-in OS accounts, application service accounts). Model the typical behavior of each group. If a specific default account starts performing actions (like user creation) that are not characteristic of its peer group, flag it as an outlier. For example, if the 'vpxuser' account starts creating local users, it deviates from its peer group of other virtualization service accounts."
            ]
          },
          {
            "description": "A low-privilege user session is followed within a short time by process creation under a high-privilege default account context on the same host.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4648"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Jump Servers, Terminal Servers",
            "action": [
              "Symbolic: Create a correlation rule that looks for a sequence on a single host: a successful interactive login (Event ID 4624, Logon Type 2 or 10) by a non-admin user, followed within 2 minutes by a process creation (Event ID 4688) under a high-privilege default account context (e.g., 'SYSTEM', 'Administrator') that was not initiated by a legitimate parent process like 'services.exe' or 'winlogon.exe'.",
              "Statistical: On each host, baseline the typical time delta between a user's login and the processes they spawn. Also baseline the accounts under which processes are typically run. Alert if a process is created under a default account context with a Logon ID that maps back to a different, lower-privileged user's interactive session, and this association is a statistical rarity for that host or user.",
              "Machine Learning: Model user sessions as sequences of events (logon, process creation, network connection). Train a sequence-to-sequence autoencoder (a type of neural network) on benign user sessions. Feed new sessions into the trained model. If the model has a high reconstruction error for a given session, it means the sequence is anomalous. A sequence showing a low-privilege login followed by high-privilege process creation would produce a high reconstruction error and trigger an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using default accounts?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1078.001",
        "name": "Default Accounts",
        "evidence": [
          {
            "description": "A default account executes a command with arguments known to disable security services, clear audit logs, or modify firewall rules.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All servers and endpoints",
            "action": [
              "Symbolic: Using process creation logs (Windows Event ID 4688), search for command-line executions by default accounts that match a watchlist of defense evasion techniques. This includes commands like 'wevtutil.exe cl Security', 'netsh advfirewall set allprofiles state off', 'Set-MpPreference -DisableRealtimeMonitoring $true', or 'net stop windefend'. A direct match is a critical alert.",
              "Statistical: Calculate the frequency of specific sensitive commands (like 'wevtutil', 'auditpol', 'netsh') being run by default accounts. In a stable environment, this frequency should be zero or near-zero. Any execution of these commands by a default account is a statistical anomaly that warrants an alert. Track the count per day; any value > 0 is an alert.",
              "Machine Learning: Use natural language processing (NLP) techniques on command-line arguments. Train a model to understand the intent of a command. For example, the model could classify commands into categories like 'file-operation', 'network-config', or 'security-tampering'. If a command executed by a default account is classified as 'security-tampering', trigger an investigation."
            ]
          },
          {
            "description": "System audit policy is changed by a default account, as recorded by a specific Windows Event ID.",
            "data_sources": [
              "Windows Event ID 4719",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint devices, Servers",
            "action": [
              "Symbolic: Generate a high-priority alert for any instance of Windows Event ID 4719 (System audit policy was changed) where the Subject Account Name is a default account. This event provides direct evidence of audit tampering and the responsible account.",
              "Statistical: Establish a baseline configuration 'snapshot' for critical security settings (e.g., firewall rules, audit policies). Periodically poll these configurations and compare them to the baseline. If a deviation is detected and correlated logs show the change was made by a default account outside of a planned change window, it represents a statistically significant deviation from the secure baseline.",
              "Machine Learning: Model the sequence of configuration changes in an environment. A time-series model can predict the 'normal' state of security configurations. If a default account makes a change that causes the system's state to deviate significantly from the predicted normal state (e.g., suddenly disabling a firewall profile that has been enabled for years), the model flags this as an anomaly."
            ]
          },
          {
            "description": "A file access event shows a default account accessing, modifying, or deleting security log files or security tool configuration files.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log servers, All endpoints and servers where logs are stored locally",
            "action": [
              "Symbolic: Enable file system auditing (SACLs) on log directories (e.g., C:\\Windows\\System32\\winevt\\Logs) and security tool directories. Create a rule to alert on any file access event (Windows Event ID 4663) where the Account Name is a default account and the Object Name points to a sensitive log file (e.g., '.evtx') or configuration file, especially for write or delete access.",
              "Statistical: Profile the normal file access patterns for default accounts. Alert if a default account accesses a number of files in a sensitive directory that exceeds the 99th percentile of its normal activity, or if it accesses file types (e.g., '.evtx', '.zip') it has never accessed before. This detects bulk access or staging for exfiltration.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) model on benign file access patterns for default accounts. Features would include file path, process name, access type, and time of day. Any new file access event that falls outside the learned boundary of 'normal' behavior is classified as an anomaly, indicating suspicious file interaction."
            ]
          },
          {
            "description": "Network traffic from a host with an active default account session connects directly to an external IP, bypassing the mandated corporate web proxy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Proxy servers, Endpoint devices",
            "action": [
              "Symbolic: From an endpoint, identify the active logon session ID for a default account (via Event ID 4624). Correlate this with network connections from that host. Ingest proxy logs. Create a rule that alerts when Zeek conn.log shows a direct connection from the host to an external IP on port 80 or 443, but no corresponding log entry exists in the proxy logs for that host, destination, and time. This is a direct signature of proxy bypass.",
              "Statistical: For all endpoints, establish a baseline ratio of proxied vs. direct-to-internet traffic. An endpoint whose ratio dramatically shifts towards direct connections after a default account logs in is anomalous. Alert if the percentage of direct outbound connections from a host exceeds 3 standard deviations from its own historical baseline or its peer group's baseline.",
              "Machine Learning: Train a classifier to distinguish between proxied and non-proxied traffic based on network flow features from Zeek conn.log (e.g., destination port, packet/byte counts, connection duration). Apply this model to all traffic from hosts with active default account sessions. Any traffic classified as 'suspicious non-proxied' (e.g., looks like HTTP but is not in proxy logs) should be alerted on as potential policy bypass."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]