[
  {
    "information_requirement": "Is the adversary using file transfer protocols for command and control? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1071.002",
        "name": "File Transfer Protocols",
        "evidence": [
          {
            "description": "A successful network connection using FTP (TCP/21) or SMB (TCP/445) is established between an internal asset and an external IP address or domain present on a high-confidence C2 threat intelligence list.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway Firewalls, DNS Resolvers, Network Egress Points",
            "action": [
              "Symbolic: Continuously join network connection logs (Zeek conn.log) where the destination port is 21 or 445 with a high-confidence threat intelligence feed of known malicious C2 IPs. Alert on any matches.",
              "Statistical: Analyze DNS query logs (Zeek dns.log) for domains associated with FTP/SMB connections. Flag connections to domains with low prevalence scores (e.g., seen by fewer than 5 hosts in the enterprise) or those that are newly registered (e.g., domain age < 30 days).",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on features like IP reputation, domain age, ASN, and connection metadata to predict the likelihood that an FTP/SMB connection is malicious. Promote connections with a high probability score for investigation."
            ]
          },
          {
            "description": "Observed FTP commands (e.g., 'PUT' immediately followed by 'DELE') or SMB file/share access patterns (e.g., access to ADMIN$ or IPC$) match signatures of known C2 tools.",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek smb_files.log",
              "Zeek smb_mapping.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal File Servers, Domain Controllers, Endpoint Workstations",
            "action": [
              "Symbolic: Deploy and monitor SIEM rules that search for specific command sequences in Zeek ftp.log (e.g., `PUT [^\\s]+.tmp; DELE [^\\s]+.tmp`) or filenames matching regex patterns from malware analysis (e.g., `[a-f0-9]{32}.dat`) in Zeek smb_files.log.",
              "Statistical: For each user, calculate the frequency distribution of FTP commands or SMB actions (e.g., read, write, execute). Flag users whose command distribution deviates significantly from their own 30-day baseline or their peer group's baseline using a Chi-squared test.",
              "Machine Learning: Train a sequence-based model (e.g., a Long Short-Term Memory network) on legitimate FTP command sequences. Use the model to score new command sequences in real-time, flagging those with a high anomaly score as potentially malicious C2."
            ]
          },
          {
            "description": "The ratio of bytes sent vs. bytes received for an FTP/SMB session, or the total data volume transferred, exceeds a statistically determined threshold (e.g., 98th percentile) compared to the host's historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Core Network Switches, Endpoint Network Interfaces",
            "action": [
              "Symbolic: Create a rule to alert when `orig_bytes` is greater than `resp_bytes` by a factor of 10 for any single SMB or FTP connection to an external destination in Zeek conn.log, excluding known backup or file-sharing services.",
              "Statistical: For each host, establish a 30-day rolling baseline of daily data volume (sent and received) and send/receive ratios over FTP/SMB. Use Z-scores to identify days where the data volume or ratio for a host exceeds 3 standard deviations from its mean.",
              "Machine Learning: Implement a time series anomaly detection model (e.g., ARIMA) for each host's FTP/SMB traffic volume. The model will forecast expected traffic volume and flag any observed volume that falls outside the 99% prediction confidence interval."
            ]
          },
          {
            "description": "An internal host establishes FTP or SMB connections to the same external destination IP with a low standard deviation in the time interval between connections (jitter), indicative of automated C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points, Firewall and Proxy Servers",
            "action": [
              "Symbolic: Alert when a single source host connects to the same external destination IP on port 21 or 445 more than 50 times in one hour, excluding connections to known-good cloud services.",
              "Statistical: For each unique source-destination-port triplet, calculate the inter-arrival time (delta) between consecutive connections over a 24-hour window. Calculate the standard deviation of these deltas. A standard deviation below a small threshold (e.g., < 5 seconds) indicates highly periodic traffic. Prioritize alerts where the destination is low-prevalence.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection features including destination IP, port, connection duration, and inter-arrival time. Isolate and investigate small, dense clusters that represent beaconing activity not associated with legitimate services."
            ]
          },
          {
            "description": "A network connection over FTP/SMB ports is initiated by a process not typically associated with file transfers (e.g., powershell.exe, svchost.exe, rundll32.exe) or from a non-standard file path.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations and Servers), Domain Controllers",
            "action": [
              "Symbolic: Correlate network logs (Windows Event ID 5156) on ports 21/445 with process creation logs (Windows Event ID 4688). Alert if the initiating process name is on a watchlist (e.g., `powershell.exe`, `cscript.exe`, `mshta.exe`) or is running from a non-standard location (e.g., `%APPDATA%`, `%TEMP%`).",
              "Statistical: Build a baseline of legitimate parent-child process relationships and a list of processes that normally initiate FTP/SMB connections. Calculate the frequency of each process making such connections. Flag processes that are statistical outliers (e.g., a process that has never been seen making an FTP connection before).",
              "Machine Learning: Develop a classification model to score the maliciousness of a process-network event. Features could include process name, command line arguments, parent process, file path, and network connection details (destination IP, port, reputation). Flag events with a high maliciousness score."
            ]
          },
          {
            "description": "A file transferred over FTP or SMB has a calculated Shannon entropy value greater than 7.5 (indicating encryption/packing) or has a file extension associated with executables/scripts (.exe, .dll, .ps1) being sent to an external destination.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs providing data to Zeek sensors, File Servers",
            "action": [
              "Symbolic: From Zeek files.log, create a rule to alert on any file transferred via FTP or SMB to an external destination with a MIME type of `application/x-dosexec` or a filename extension of `.exe`, `.dll`, `.ps1`, or `.bat`.",
              "Statistical: For all files analyzed by Zeek, calculate the Shannon entropy. Establish a baseline entropy value for common file types (e.g., .txt, .pdf, .jpg). Alert when a file's entropy exceeds the 99th percentile for its stated file type, or has an absolute entropy value > 7.5.",
              "Machine Learning: Use a file-type identification model to detect mismatches between a file's extension and its actual content (e.g., a file named `report.txt` that has the magic bytes of a PE executable). Flag any mismatches for files transferred over FTP/SMB for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]