[
  {
    "information_requirement": "Has the adversary attempted to enumerate cloud accounts?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1087.004",
        "name": "Cloud Account",
        "evidence": [
          {
            "description": "A network connection from an internal host to a known cloud provider IAM API endpoint where the source IP's geolocation is from a country with no business presence, or the source IP is present on a current threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet egress points and proxy servers",
            "action": [
              "Symbolic Logic: Create a rule to continuously correlate source IP addresses from Zeek conn.log traffic destined for known cloud IAM API endpoints (e.g., iam.amazonaws.com, graph.microsoft.com, iam.googleapis.com) against an up-to-date threat intelligence feed of malicious IPs or known anonymizing services. Generate an alert for any match.",
              "Statistical Analysis: For all connections to cloud IAM APIs, geolocate the source IP. Maintain a statistical baseline of allowed source countries based on historical data. Alert when a connection originates from a country that falls below the 1st percentile of historical connection frequency, indicating a rare and unauthorized location.",
              "Machine Learning: Train a binary classification model (e.g., Random Forest) on Zeek conn.log features (source IP, destination IP, duration, service, country code, ASN) to predict malicious connections to IAM endpoints. Use labeled historical data and CTI feeds for training. Apply the model in real-time to score new connections and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A command line execution event (Windows Event ID 4688) containing a known cloud CLI binary (e.g., 'aws.exe', 'az.exe', 'gcloud.exe') and specific enumeration sub-commands (e.g., 'list-users', 'get-iam-policy', 'Get-MsolRoleMember').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, developer endpoints, and CI/CD pipeline servers",
            "action": [
              "Symbolic Logic: Create a detection rule that uses regular expressions to search Windows Event ID 4688 command-line data for the execution of cloud CLI tools (pwsh.exe, az.exe, aws.exe, gcloud.exe) paired with enumeration-specific arguments (Get-Msol*, 'az ad user list', 'aws iam list-users', 'gcloud projects get-iam-policy'). Alert on any match.",
              "Statistical Analysis: For each host, establish a baseline of normal command-line executions. Calculate the entropy of the command-line arguments for each executed process. Alert when a cloud CLI process is executed with command-line entropy that exceeds the 95th percentile for that host, suggesting unusually complex or obfuscated commands. Also, track the frequency of these commands per user and alert on first-time executions.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on command-line data, tokenizing arguments and process names. Identify clusters of normal administrative activity. Treat any cloud CLI execution that falls outside of these established clusters as an anomaly and flag for investigation, which can help find novel or rare enumeration techniques."
            ]
          },
          {
            "description": "A high-frequency burst of distinct HTTP GET or POST requests to cloud IAM API URI paths from a single source IP within a defined time window (e.g., >50 unique API calls in 5 minutes), where the volume significantly exceeds the established user or host baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring sensors at internet egress points",
            "action": [
              "Symbolic Logic: Define a rule that triggers when a single source IP makes more than 20 distinct API calls (identified from the Zeek http.log 'uri' field) to known cloud IAM endpoints within a 5-minute window. Alert on any host that trips this threshold.",
              "Statistical Analysis: For each source IP, establish a baseline of the hourly number and variety (unique count) of IAM API calls. Using a rolling 1-hour window, alert if the number of API calls exceeds 3 standard deviations above the mean for that entity, or if the count of unique API paths exceeds the 99th percentile.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume of IAM API calls per source IP. Train the model on historical Zeek http.log data to learn normal patterns of activity. Use the model to predict the expected call volume and alert when the actual volume significantly deviates from the prediction."
            ]
          },
          {
            "description": "A temporal correlation within a short window (<60 seconds) between a process creation event (Windows Event ID 4688) for a cloud CLI tool on a host and a subsequent network connection (Zeek conn.log) from that same host to a cloud IAM API, where the user account is not a member of a designated cloud administrator group.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Virtual Desktop Infrastructure (VDI), and domain controller authentication logs",
            "action": [
              "Symbolic Logic: Create a correlation rule that joins Windows Event ID 4688 and Zeek conn.log on the host IP and a timestamp delta of less than 60 seconds. The rule must match a cloud CLI process name with a destination IP/domain for a cloud IAM endpoint. Enrich the event with user group information and alert if the user is not in a predefined 'Cloud Admins' group.",
              "Statistical Analysis: Profile the population of users who execute cloud CLI commands. Create a list of 'non-standard' users (e.g., users from departments outside of IT/Engineering). Alert if such a user executes a cloud CLI command, and weight the alert higher if the command is statistically rare (<5th percentile) for the entire organization.",
              "Machine Learning: Develop a risk scoring model using features from the correlated events (user role, host type, time of day, command-line entropy, historical frequency of action). Train a supervised model (e.g., Gradient Boosting) on labeled past incidents to predict a risk score for each correlated event. Prioritize alerts based on this score."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]