[
  {
    "information_requirement": "Is the adversary attempting to discover email accounts or global address lists?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1087.003",
        "name": "Email Account",
        "evidence": [
          {
            "description": "A process creation event where the executable's file hash matches a known email account enumeration tool from a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Exchange Servers, Administrative Workstations",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688) and match the ProcessHash or OriginalFileName against a curated list of known email enumeration tools (e.g., MailSniper, SharpHound, ADFind).",
              "Statistical: For newly observed executables not on an allowlist, calculate the entropy of the process name and file path. Flag processes with high entropy names (e.g., > 3.5) that also exhibit parent-child relationships common to malicious script execution (e.g., wscript.exe or powershell.exe spawning a randomly named executable).",
              "Machine Learning: Train a binary classification model (e.g., Random Forest) using features from process creation events (parent process, user context, command-line length, entropy of name, file path location) to predict whether a new process is a malicious enumeration tool. Feed high-probability alerts to analysts for review."
            ]
          },
          {
            "description": "PowerShell or command-line execution containing strings and parameters specific to querying Global Address Lists (GAL) or user accounts.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Exchange Servers, Microsoft 365 Tenant, User Endpoints",
            "action": [
              "Symbolic: Using SIEM search capabilities, create a detection rule that uses regular expressions to find command lines (Windows Event ID 4688) or script block content (Windows Event ID 4104) containing 'Get-GlobalAddressList', 'Get-Recipient', 'Get-Mailbox', or LDAP filters like '(objectCategory=person)'.",
              "Statistical: For each user, establish a baseline of normal PowerShell cmdlet usage. Calculate the rarity of each cmdlet executed by a user. Flag any execution of a cmdlet (e.g., 'Get-GlobalAddressList') that is in the 99th percentile of rarity for that user's activity or for the entire organization.",
              "Machine Learning: Use an NLP topic modeling technique (e.g., Latent Dirichlet Allocation) on PowerShell script block logs (Windows Event ID 4104) to identify clusters of activity. Profile clusters corresponding to normal administrative tasks versus reconnaissance. Alert when a user's activity is classified into a reconnaissance-related topic cluster for the first time."
            ]
          },
          {
            "description": "An LDAP search request containing a filter known to be used for bulk enumeration of user or email account objects.",
            "data_sources": [
              "Zeek ldap.log",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network segments monitoring traffic to Domain Controllers",
            "action": [
              "Symbolic: Search Zeek LDAP logs (ldap.log) for search requests containing filters such as '(objectCategory=person)', '(objectClass=user)', '(&(objectCategory=person)(objectClass=user)(mail=*))', or filters with wildcards against 'proxyAddresses'.",
              "Statistical: For each source IP, profile the distribution of requested LDAP attributes and filter complexity. Calculate a baseline for the number of objects returned per query. Flag any query that requests an anomalously broad set of attributes or returns a number of objects exceeding 3 standard deviations from the source IP's baseline.",
              "Machine Learning: Apply a time-series anomaly detection model (e.g., ARIMA) to the volume of LDAP search requests originating from each host. Alert on spikes in request volume that deviate significantly from the forecasted model, especially when correlated with low-prevalence LDAP filters."
            ]
          },
          {
            "description": "A single source host or user account generating a statistically significant increase in the volume of MAPI, LDAP, or ActiveSync requests to directory or mail servers within a short time window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dce_rpc.log",
              "Zeek ldap.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (Exchange/M365), Domain Controllers, Network Egress/Ingress points",
            "action": [
              "Symbolic: Create a rule to alert when a single source IP generates more than 1,000 connection attempts to a Domain Controller on port 389/636 (LDAP) or an Exchange server on MAPI/EWS ports within a 5-minute window.",
              "Statistical: For each source-destination pair, establish a baseline of connection count and data volume per hour using a 30-day rolling window. Use the Inter-Quartile Range (IQR) method to detect outliers. Flag any source whose connection count to a mail/directory server exceeds the upper fence (Q3 + 1.5*IQR) for that hour.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection metadata from Zeek conn.log (source IP, destination IP, destination port, duration, bytes transferred). Identify clusters of 'normal' activity. Flag any connection that is classified as a noise point or belongs to a very small, sparse cluster, as this may indicate enumeration activity that differs from established communication patterns."
            ]
          },
          {
            "description": "A process not on an established allowlist of standard applications (e.g., Outlook, browsers) initiating network connections to mail or directory services.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Application Servers, Network traffic to/from critical directory/mail servers",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) with network connection events (Windows Event ID 5156 or Zeek conn.log). Alert when the 'Application' field in Event ID 5156 is not on a pre-defined allowlist of processes (e.g., outlook.exe, teams.exe, chrome.exe) and the 'DestPort' is a directory/mail service port (e.g., 389, 636, 135, 443).",
              "Statistical: For each process name, calculate the frequency of it connecting to directory/mail services across the enterprise. Flag any process whose connection frequency is in the bottom 1st percentile (i.e., it is extremely rare for this process to make such connections), especially if the process is running from a temporary or user-writable directory.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) model on features from legitimate processes that connect to mail/directory services. The model learns a boundary around 'normal' process behavior. Use this model to classify new process connection events; any event that falls outside the learned boundary is flagged as anomalous."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]