[
  {
    "information_requirement": "Is the adversary using removable media for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1092",
        "name": "Communication Through Removable Media",
        "evidence": [
          {
            "description": "A file is created or modified on a removable media device, and its filename or hash matches a known indicator of compromise (IOC) associated with C2 frameworks that utilize this technique.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, servers with USB ports, especially those in isolated or high-security network segments.",
            "action": [
              "Symbolic: Query for file creation events (Windows Event ID 4663 with Accesses containing 'WRITE_DATA' or Sysmon Event ID 11) where the file path indicates a removable drive. Join the event with a threat intelligence database to match the filename or file hash against a list of known malicious indicators associated with C2 via removable media (e.g., 'tasks.dat', 'results.bin'). Alert on any match.",
              "Statistical: For all files written to removable media, calculate the rarity of the filename within the organization over a 30-day baseline. Use a frequency analysis (count of occurrences) to identify filenames that are outliers (e.g., seen only once or twice across the enterprise). Flag filenames in the bottom 1st percentile of frequency for analyst review.",
              "Machine Learning: Develop a supervised classification model (e.g., a Random Forest) trained on file write events. Features should include filename string length, filename entropy, file extension, parent process name, and whether the filename is on an IOC list. Train the model on labeled data to predict the likelihood that a new file write event to removable media is part of a C2 channel."
            ]
          },
          {
            "description": "A file with a high-risk extension (.exe, .ps1, .lnk, .dll) or a hidden attribute is created on a removable drive by a process not typically associated with such activity (e.g., a browser or office application).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices with removable media access, administrative jump boxes, and developer workstations.",
            "action": [
              "Symbolic: Create a detection rule that triggers on file creation events (Windows Event ID 4663, Sysmon Event ID 11) on removable drives for files with specific high-risk extensions (e.g., '.exe', '.dll', '.ps1', '.vbs', '.lnk'). Further filter for events where the writing process is not 'explorer.exe' or another whitelisted utility. Alert on any qualifying event.",
              "Statistical: For each process in the environment (e.g., 'powershell.exe', 'winword.exe'), establish a baseline of file extensions it typically writes to removable media. Calculate the probability P(extension | process). Generate an alert when a process writes a file with an extension that is statistically unlikely for that process (e.g., probability is less than 0.01), indicating a deviation from normal behavior.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on file creation events on removable media. Features for clustering should include process name, file extension, and file attributes (e.g., hidden, system). Identify and investigate small, dense clusters that are separate from large, common clusters, as these may represent anomalous C2-related activity."
            ]
          },
          {
            "description": "A process reads a file from removable media and subsequently makes an outbound network connection, suggesting C2 task retrieval.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-connected workstations with USB access, network egress points (firewalls, proxies), DNS servers.",
            "action": [
              "Symbolic: Correlate events in a sequence within a 5-minute window: 1. A process reads a file from a removable drive (Windows Event ID 4663 with 'ReadData' access). 2. The same process (correlated by Process ID/GUID) initiates an outbound network connection (Sysmon Event ID 3 or Zeek conn.log). Alert if the destination IP or domain is present on a C2 threat intelligence feed.",
              "Statistical: For processes that read from removable media, baseline their typical network behavior (e.g., number of connections, data volume, destination ports). Calculate the 95th percentile for outbound data volume and connection frequency for each process. Trigger an alert if a process reads from a removable drive and then exhibits network behavior exceeding these statistical thresholds.",
              "Machine Learning: Implement a time-series analysis model on network connections originating from processes that interact with removable media. Look for beaconing behavior by analyzing the regularity of connection intervals using autocorrelation or a Fast Fourier Transform (FFT) to detect periodic signals characteristic of C2 heartbeats. Flag processes that exhibit strong periodicity after reading from a removable drive."
            ]
          },
          {
            "description": "A single process reads an anomalously high number of files or unique directories from local storage within a short time frame, followed by a write operation of a single, high-entropy or archive-formatted file to a removable drive.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, user workstations containing sensitive project data, developer workstations with source code access.",
            "action": [
              "Symbolic: Create a rule that triggers when a single Process ID generates more than 1000 file read events (Windows Event ID 4663) from user directories (e.g., 'C:\\Users\\*') within 10 minutes, and is immediately followed by a file creation event (Sysmon Event ID 11) on a removable drive for a file with a '.zip', '.rar', or '.7z' extension.",
              "Statistical: For each file written to a removable drive, calculate the Shannon entropy of the file content (if available from EDR/DLP tools). Establish a baseline entropy score for common file types. Alert when a file is written with an entropy score that exceeds the 99th percentile for its extension, suggesting encryption or compression indicative of staging for exfiltration.",
              "Machine Learning: Use an anomaly detection model (e.g., an autoencoder) on process behavior sequences. The features would be a time-series vector of actions per process: [count(file_reads_local), count(file_writes_removable), count(network_connections)]. An alert is generated when the model's reconstruction error for a process's activity sequence is high, indicating a pattern that deviates from learned normal behavior."
            ]
          },
          {
            "description": "Execution of an unsigned or unusual process directly from removable media, or a system process anomalously accessing removable media.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices, particularly those used by privileged users or in physically unsecured areas.",
            "action": [
              "Symbolic: Query for process creation events (Sysmon Event ID 1) where the ImagePath field points to a path on a removable drive. Alert on any such execution, with high priority if the process is unsigned or its hash is unknown to threat intelligence feeds.",
              "Statistical: Profile all parent-child process relationships where the child process executes from removable media. Establish a baseline of common relationships (e.g., 'explorer.exe' launching a document). Use frequency analysis to identify rare parent-child pairs (e.g., 'svchost.exe' launching a process from a USB drive). Alert on pairs that fall below a low frequency threshold (e.g., seen less than 5 times in 90 days).",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to determine if a process execution from removable media is malicious. Features should include: parent process name, if the executable is signed, the entropy of the executable's filename, and the prevalence of the executable's hash in the environment. The model will output a probability score, with scores above a defined threshold (e.g., 0.85) triggering an alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]