[
  {
    "information_requirement": "Is the adversary maintaining persistence by modifying local or domain groups?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098.007",
        "name": "Additional Local or Domain Groups",
        "evidence": [
          {
            "description": "A user account is added to a persistence-enabling group (e.g., Remote Desktop Users, Server Operators) where the modifying user's session originates from an IP address associated with a high-risk ASN or a known malicious source.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Internet Gateway/Firewall, VPN Concentrators",
            "action": [
              "Symbolic: Join Windows Event ID 4732/4728/4756 (Group Member Added) with Windows Event ID 4624 (Logon) on `SubjectUserName`. Correlate the logon's `IpAddress` with a threat intelligence feed of known malicious IPs. Alert on any match.",
              "Statistical: For each user, baseline the typical Autonomous System Numbers (ASNs) and countries they log in from using Zeek conn.log and Event ID 4624 data over 30 days. Calculate the frequency of each ASN/country. If a group modification event occurs from an ASN/country pair that is in the bottom 5th percentile of frequency for that user, flag it for review.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) on historical logon and group modification events. Features should include IP geolocation data (country, ASN), time of day, day of week, and target group sensitivity. The model will predict the likelihood of a group modification being malicious. Alert on high-probability events."
            ]
          },
          {
            "description": "A command-line process (`net.exe`, `net1.exe`) or PowerShell cmdlet (`Add-LocalGroupMember`, `Add-ADGroupMember`) modifies a group and is spawned by a non-administrative or suspicious parent process (e.g., an Office application, a web server worker process).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Member Servers (Web, Application)",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for `ProcessName` `net.exe`, `net1.exe`, or `powershell.exe`. If the `CommandLine` contains `localgroup /add`, `group /add`, `Add-LocalGroupMember`, or `Add-ADGroupMember`, check the `ParentProcessName`. Alert if the parent is `winword.exe`, `excel.exe`, `outlook.exe`, `w3wp.exe`, or `httpd.exe`.",
              "Statistical: Profile the parent-child process relationships for group modification commands across the environment. Calculate the entropy of the parent process name for each host. A sudden spike in entropy or the appearance of a low-frequency parent process (e.g., a parent that has never before spawned `net.exe`) for a group modification command should be flagged as anomalous.",
              "Machine Learning: Use a graph-based anomaly detection algorithm on process lineage data. Model normal process trees on endpoints. Identify group modification events that originate from a process tree structure that deviates significantly from the established baseline graph for that host or user, indicating a suspicious execution chain."
            ]
          },
          {
            "description": "A non-administrative account or a service account adds a member to a sensitive group, or such a change occurs at a statistically unusual time.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Tier 0 Assets, Change Management Systems",
            "action": [
              "Symbolic: Maintain an allowlist of accounts authorized to modify sensitive groups (e.g., 'Domain Admins', 'Remote Desktop Users'). Monitor Windows Event IDs 4732, 4728, 4756. Alert if the `SubjectUserName` performing the addition is not on the allowlist.",
              "Statistical: For each sensitive group, create a time series of modification events (count per hour). Calculate the mean and standard deviation of modifications for each hour of the day and day of the week. Alert if a modification occurs during a time slot where the count is more than 3 standard deviations above the mean.",
              "Machine Learning: Implement a peer group analysis model. Group users based on their roles and departments. For each group modification, compare the action to the behavior of the user's peers. If a user adds someone to a group that none of their peers have ever modified, flag the event as a behavioral anomaly."
            ]
          },
          {
            "description": "An account, within 24 hours of being added to a sensitive group, is used to create a new scheduled task, a new service, or modify a startup registry key.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4698",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices, Member Servers",
            "action": [
              "Symbolic: When a user is added to a sensitive group (Event IDs 4732, 4728), add their `TargetUserName` to a temporary watchlist for 24 hours. If that same user account is then observed as the `SubjectUserName` in Event ID 4698 (Scheduled Task Created) or Event ID 7045 (Service Installed), generate a high-priority alert for chained persistence behavior.",
              "Statistical: Calculate the average time delta between a user being added to a group and that same user creating a scheduled task or service. A very short time delta (e.g., in the 1st percentile, likely under a few minutes) suggests automated, scripted activity and should be investigated.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) trained on sequences of user activities (logon, group add, file write, process create, service create). Identify sequences of events that have a high probability of being malicious, such as the specific chain of 'Group Add -> Service Create' which may be rare in benign activity."
            ]
          },
          {
            "description": "A machine account (ending in '$') is added to a sensitive domain group and subsequently used for interactive logon (Logon Type 2 or 10) or to request Kerberos service tickets for non-standard services.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4756",
              "Windows Event ID 4624",
              "Windows Event ID 4769",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices, Key Distribution Center (KDC)",
            "action": [
              "Symbolic: Monitor Event IDs 4728/4756 for additions to sensitive domain groups where the `MemberName` ends in '$'. If such an event occurs, monitor for Event ID 4624 (Logon) from that same machine account with a `LogonType` of 2 (Interactive) or 10 (RemoteInteractive). Alert on any such logon.",
              "Statistical: For all machine accounts, baseline the set of Service Principal Names (SPNs) they typically request tickets for (from Event ID 4769 or Zeek kerberos.log). After a machine account is added to a new group, monitor for new SPN requests. If the account requests a ticket for a service that is statistically rare for machine accounts (e.g., `HOST/workstation.domain.com`), flag it as anomalous.",
              "Machine Learning: Train an unsupervised anomaly detection model (e.g., One-Class SVM) on the network logon behavior of machine accounts. Features should include source host, destination host, logon type, and time of day. If a machine account's logon behavior deviates significantly from the learned 'normal' profile after being added to a new group, classify it as an anomaly."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary elevated privileges by modifying local or domain groups?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098.007",
        "name": "Additional Local or Domain Groups",
        "evidence": [
          {
            "description": "A user is added to a high-privilege group (e.g., Administrators, Domain Admins) by an account with a name matching a known default, temporary, or suspicious pattern.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices",
            "action": [
              "Symbolic: Monitor Event IDs 4732, 4728, 4756 for additions to high-privilege groups. Compare the `SubjectUserName` against a watchlist of suspicious patterns (e.g., 'test', 'admin', 'backup', 'support_*', names with long random strings). Alert on any match.",
              "Statistical: Calculate the character-level entropy of all usernames that perform privileged group modifications. A username with significantly higher entropy than the organizational average (e.g., exceeding the 99th percentile) may be algorithmically generated by a malicious tool. Flag for review.",
              "Machine Learning: Use a pre-trained NLP model or a custom-trained classifier to score usernames on their likelihood of being 'human-generated' versus 'machine-generated' or 'suspicious'. Feed the `SubjectUserName` from privileged group modification events into this model and alert on usernames that receive a low 'human' score."
            ]
          },
          {
            "description": "A sequence of events occurs within seconds on a host: a suspicious process starts, it spawns `net.exe` or PowerShell to add a user to a privileged group, and a new high-integrity process is created by that user.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4732",
              "Windows Event ID 4728"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Member Servers",
            "action": [
              "Symbolic: Create a correlation rule that triggers if, on the same host within 5 seconds: 1) Event 4688 with a suspicious parent (e.g., `wscript.exe`), 2) Event 4688 for `net.exe localgroup Administrators /add`, and 3) Event 4688 for a new process created by the user just added to the group.",
              "Statistical: Measure the time delta between a process creation event (4688) and a subsequent group modification event (4732/4728) by the same process ID. A time delta in the sub-second range (e.g., below the 1st percentile of all such observed deltas) is highly indicative of an automated script.",
              "Machine Learning: Use a time-series anomaly detection model on the frequency of security events per host. A sudden, sharp spike in the density of critical events (process creation, group modification) within a few-second window, far exceeding the normal event rate, can be classified as an anomalous burst of activity characteristic of an exploit tool."
            ]
          },
          {
            "description": "An account not on an explicit allowlist adds a member to a high-privilege group (e.g., 'Administrators', 'Domain Admins'), or the modification occurs outside a pre-defined change management window.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Change Management Systems, Tier 0 Assets",
            "action": [
              "Symbolic: For additions to groups like 'Domain Admins' or 'Administrators' (Event IDs 4732, 4728, 4756), compare the `SubjectUserName` against a strict allowlist of authorized administrators. If the account is not on the list, generate a critical alert.",
              "Statistical: Establish a baseline of normal change windows (e.g., 9 AM - 5 PM, Mon-Fri) for privileged group modifications. For any modification outside this window, calculate a risk score based on how far it deviates (e.g., +1 for outside business hours, +2 for weekend). Alert on scores exceeding a defined threshold.",
              "Machine Learning: Train a Bayesian model to calculate the probability of a change being unauthorized. Inputs should include the administrator (`SubjectUserName`), the group being modified, and the time of day. If the model outputs a high probability of the change being unauthorized based on historical patterns, flag for immediate review."
            ]
          },
          {
            "description": "An account, within minutes of being added to a privileged group, executes commands to access the SAM database, dump credentials via LSASS, or interact with ntdsutil.exe.",
            "data_sources": [
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices, LSASS Process Memory",
            "action": [
              "Symbolic: When an account is added to a privileged group (4732/4728), add it to a temporary watchlist. If that account then initiates a process (4688) with command-line arguments like `reg save HKLM\\SAM`, `ntdsutil`, or is the source of an access request to the `lsass.exe` process, generate a critical alert.",
              "Statistical: Calculate the 'privilege-to-action' latency: the time between an account gaining privilege and using it for a sensitive action. A latency in the bottom 1st percentile (likely seconds to minutes) for actions like running `ntdsutil` indicates a pre-planned, automated attack chain.",
              "Machine Learning: Use a state-machine model to track user sessions. A session that transitions from 'standard user' to 'privileged user' (via group add) and immediately to 'credential access activity' (via process monitoring) matches a known attack path. This state transition sequence, being rare in benign sessions, can be classified as malicious."
            ]
          },
          {
            "description": "An account, immediately after being added to a domain-level privileged group, initiates network logons to an anomalously high number of distinct hosts or requests a Kerberos TGT using the krbtgt account hash.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4756",
              "Windows Event ID 4624",
              "Windows Event ID 4769",
              "Zeek conn.log",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Subnets, Key Distribution Center (KDC)",
            "action": [
              "Symbolic: After an account is added to 'Domain Admins' (4728/4756), monitor for Kerberos ticket requests (Event ID 4769 or Zeek kerberos.log) from that account where the Service Name is 'krbtgt'. This is a direct indicator of a Golden Ticket attack preparation and should be a critical alert.",
              "Statistical: In a 1-hour window after an account is added to a domain privileged group, count the number of distinct destination hosts for its network logons (Event ID 4624 Type 3). If this count exceeds the 99th percentile for all users in a 1-hour window, it indicates anomalous lateral movement (spraying).",
              "Machine Learning: Model the lateral movement paths of privileged users using a graph network. Nodes are hosts and edges are logons. If a newly privileged user creates a path that is topologically different from established privileged user paths (e.g., connecting to many disparate subnets), an anomaly detection algorithm on the graph can flag this behavior."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]