[
  {
    "information_requirement": "Is the adversary maintaining persistence through account manipulation? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098",
        "name": "Account Manipulation",
        "evidence": [
          {
            "description": "A successful account modification event (e.g., password reset, property change) originates from a source IP address present on a threat intelligence feed of known malicious IPs or anonymizing services.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4724",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Servers, Internet Gateway",
            "action": [
              "Symbolic: Correlate the 'Source Network Address' from Windows Event IDs 4738 and 4724 against a CTI feed of known malicious IPs (e.g., TOR exit nodes, known C2 servers). Alert on any match and use Zeek conn.log to investigate the full scope of network activity from the malicious source.",
              "Statistical: For each source IP associated with account modification events, calculate the IP's historical rarity for that specific target user. Use a percentile-based approach: if a source IP is in the 99th percentile of rarity for a user's modification events (i.e., it has almost never been seen before for that user), flag for review. Also, calculate the entropy of source countries for all modification events; a sudden spike in entropy indicates a diversification of source locations.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA, LSTM) on the volume of account modification events per hour. An alert is triggered if the observed volume significantly exceeds the forecasted volume with its confidence interval, indicating an anomalous burst of activity."
            ]
          },
          {
            "description": "An account's 'UserAccountControl' attribute is modified to include 'DONT_EXPIRE_PASSWD', or a Domain Policy is changed to 'Password Not Required' for an account, especially high-value, dormant, or service accounts.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4739"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Database",
            "action": [
              "Symbolic: Create a specific rule to detect when Windows Event ID 4738 shows a 'UserAccountControl' change that adds the 'DONT_EXPIRE_PASSWD' flag (0x10000). Alert immediately, especially if the target account is a member of a privileged group or is a designated service account.",
              "Statistical: Maintain a list of accounts that have the 'Password Never Expires' flag set. Calculate the rate of change for this list. An anomalous increase in the number of accounts added to this list within a short period (e.g., > 3 standard deviations above the weekly average) should trigger an investigation.",
              "Machine Learning: Use an unsupervised anomaly detection model (e.g., Isolation Forest) on the properties of account modification events (Event ID 4738). Features can include: subject account, target account, time of day, day of week, and specific attributes changed. The model will learn normal administrative behavior and flag modifications that are outliers, such as a non-helpdesk account setting a password to never expire."
            ]
          },
          {
            "description": "An account with no successful logon activity for a defined period (e.g., 90+ days) is associated with a successful logon, password reset, or other modification event.",
            "data_sources": [
              "Windows Event ID 4724",
              "Windows Event ID 4738",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Logs, HR System (for termination status)",
            "action": [
              "Symbolic: Maintain a watchlist of dormant accounts (last logon > 90 days), especially those that are also disabled. Trigger a high-priority alert if any account on this list generates a successful logon (Event ID 4624), password reset (4724), or account modification (4738).",
              "Statistical: For every successful logon (Event ID 4624), calculate the time delta since the user's previous logon. Flag any logon where the delta exceeds a high percentile threshold (e.g., 99th percentile for that user or user group), indicating an unusually long period of inactivity.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means) to group users based on their logon activity patterns (frequency, time of day, duration). Accounts that suddenly move from a 'dormant' or 'inactive' cluster to an 'active' cluster should be flagged as anomalous and investigated."
            ]
          },
          {
            "description": "A security-sensitive account modification (password reset, MFA change) occurs outside of standard business hours or is performed by an account not belonging to a designated administrative or helpdesk group.",
            "data_sources": [
              "Windows Event ID 4738",
              "Windows Event ID 4724",
              "Windows Event ID 4739"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Helpdesk Systems, Privileged Access Workstations (PAWs)",
            "action": [
              "Symbolic: Define a list of authorized administrative groups (e.g., 'Helpdesk', 'Domain Admins'). Alert on any account modification event (4738, 4724) where the 'Subject' account performing the action is not a member of these authorized groups.",
              "Statistical: For each administrative account, baseline its typical activity hours using logon/logoff and modification events. Alert if an admin account performs a modification event (4738, 4724) at a time that falls outside of its normal 95th percentile time window (e.g., at 3 AM for an admin who only works 9-5).",
              "Machine Learning: Train a classification model (e.g., Random Forest) to predict whether an account modification is legitimate or suspicious. Features should include: time of day, day of week, source IP geolocation, subject account group memberships, target account group memberships, and rarity of the subject-target interaction. Flag modifications classified as 'suspicious' with a high confidence score."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary escalated privileges through account manipulation? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098",
        "name": "Account Manipulation",
        "evidence": [
          {
            "description": "A user account is added to a pre-defined privileged group (e.g., Domain Admins), and the event is associated with a parent process known to be malicious (e.g., from an Office macro) or originates from a source IP on a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoints, Privileged Access Workstations",
            "action": [
              "Symbolic: For any privileged group addition (Event IDs 4728, 4732, 4756), trace the logon session ID to the parent process (Event ID 4688) and alert if the process is not 'lsass.exe' or another expected system process, especially if it's 'powershell.exe' or 'cmd.exe' spawned from an unusual parent like 'winword.exe'.",
              "Statistical: Calculate the frequency of different processes that trigger privileged group additions. Flag any addition initiated by a process that is statistically rare (e.g., in the bottom 5% of frequency), such as 'rundll32.exe' or a custom script name.",
              "Machine Learning: Use a graph-based analysis to model relationships between users, processes, and group memberships. An anomaly detection algorithm on the graph can identify newly formed, suspicious paths, such as 'user_A' -> runs -> 'unusual_process.exe' -> adds -> 'user_B' -> to -> 'Domain Admins'."
            ]
          },
          {
            "description": "A new account is created (Event 4720) and, within a short time window (e.g., < 5 minutes), is added to a privileged group (Event 4728/4732/4756), especially if the new account name matches suspicious patterns (e.g., ends in '$').",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, HR Systems (for name validation)",
            "action": [
              "Symbolic: Trigger an alert when an Event ID 4720 (account creation) is followed by an Event ID 4728/4732/4756 (privileged group add) for the same target account SID within a 5-minute window.",
              "Statistical: Analyze the character distribution and length of newly created usernames. Calculate the Levenshtein distance between new usernames and existing ones to detect typosquatting. Flag new accounts with high name entropy (e.g., random strings) or names that are statistical outliers in terms of length or character set, especially if they are added to privileged groups.",
              "Machine Learning: Train a sequence analysis model (e.g., a Hidden Markov Model) on the typical sequence of events following an account creation. The model would learn that the 'Create -> Add to Privileged Group' sequence is highly anomalous compared to the normal 'Create -> Add to standard groups -> Logon' sequence."
            ]
          },
          {
            "description": "An account not currently in a privileged group is added to a privileged group, and the action is performed by a subject account that is not a member of a designated administrative group (e.g., 'Domain Admins', 'Account Operators').",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4756"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: For every privileged group addition (4728, 4732, 4756), check the group membership of the 'Subject' account. If the 'Subject' is not a member of a pre-defined list of authorized administrator groups, trigger a high-severity alert.",
              "Statistical: Baseline the 'who adds whom to what' activity. For each privileged group, maintain a statistical profile of which administrative accounts typically add members. If an addition is performed by an admin who has never or rarely (e.g., below the 5th percentile of activity) modified that specific group, flag it for review.",
              "Machine Learning: Use peer group analysis (a form of clustering) to establish normal patterns of group management. The model groups administrators who perform similar functions. An alert is generated when an administrator performs a group modification that deviates significantly from the behavior of their peer group, such as a helpdesk admin adding a user to 'Enterprise Admins'."
            ]
          },
          {
            "description": "The 'nTSecurityDescriptor' attribute is modified on a critical AD object (e.g., AdminSDHolder, default GPOs, Domain object) to grant a non-administrative principal dangerous permissions like 'Full Control' or 'WriteDACL'.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4670"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (specifically the one holding the PDC Emulator FSMO role)",
            "action": [
              "Symbolic: Create a rule to monitor Event ID 5136 where the 'Object DN' is 'CN=AdminSDHolder,CN=System,DC=...' and the 'Attribute LDAP Display Name' is 'nTSecurityDescriptor'. Alert on any modification to this object.",
              "Statistical: Establish a baseline for the frequency of modifications (Event ID 5136) to critical AD objects. While these should be rare, any modification constitutes an event of interest. Track the standard deviation of modification counts over a rolling 30-day window; a sudden spike would indicate unusual and potentially malicious activity.",
              "Machine Learning: Apply Natural Language Processing (NLP) techniques to parse the Security Descriptor Definition Language (SDDL) strings within Event ID 5136. Train a model to classify the 'risk' of a permission change based on the principal (Who), the right (What), and the object (Where). A change granting 'GenericAll' (GA) rights to a standard user on a critical object would be classified as 'high-risk'."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]