[
  {
    "information_requirement": "Has the adversary gained initial access via replication through removable media?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1091",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process executes from a removable media volume, and the executable's file hash (SHA256) matches an entry in a threat intelligence feed of known malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices (workstations, laptops), Kiosks and shared-use terminals, Physical entry points to sensitive or air-gapped networks",
            "action": [
              "Symbolic: Upon process creation (Windows Event ID 4688 or Sysmon Event ID 1) where the process path indicates a removable drive, query the executable's file hash against a threat intelligence platform. Generate a critical alert upon a direct match.",
              "Statistical: For processes executing from removable media, analyze the prevalence of their file hashes across the enterprise over the last 90 days. A hash that has been seen on only one or a very small number of hosts (e.g., <0.1 percentile) is highly suspicious and should be flagged for investigation, even without a direct IOC match.",
              "Machine Learning: Develop a supervised classification model (e.g., Gradient Boosting) trained on features from process creation events (parent process, command line arguments, user context, file entropy) and file metadata. Use this model to score every process execution from removable media for its likelihood of being malicious, flagging those with a high probability score (e.g., >0.9)."
            ]
          },
          {
            "description": "A file named 'autorun.inf' or a shortcut file (.lnk) is created on a removable media volume, or a process is executed from a file with hidden or system attributes on such a volume.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices with enabled USB ports, Systems used for imaging or deploying software",
            "action": [
              "Symbolic: Create a rule to alert on any file creation event (Sysmon Event ID 11) on a removable drive with the filename 'autorun.inf'. For .lnk file creations, parse the file to extract the target path and command line arguments; alert if the target is an executable or script located on the same removable media.",
              "Statistical: Establish a baseline of common file names and extensions created on removable media per user role. Calculate the character-level entropy of filenames. Alert when a file is created with a name that is a statistical outlier (e.g., high entropy, resembling a random GUID) or has an unusual extension.",
              "Machine Learning: Use an unsupervised anomaly detection model (e.g., Isolation Forest) on features of file creation events on removable media (filename length, entropy, extension, file size, user, time of day). Flag file creation events that the model identifies as strong anomalies, which could indicate staging of unusually named malware or scripts."
            ]
          },
          {
            "description": "A process creation event, not initiated by explorer.exe, occurs from a removable drive volume within 60 seconds of the system logging the connection of that physical device.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 400",
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 410"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices, High-security area workstations, Server room physical access points",
            "action": [
              "Symbolic: Correlate a PnP device connection event (Kernel-PnP Event ID 400 or 410) with a subsequent process creation event (Sysmon Event ID 1) from the corresponding drive letter. If the time delta is less than 60 seconds and the parent process is not 'explorer.exe' or another authorized shell, generate an alert for potential Autorun activity.",
              "Statistical: For each user, baseline the distribution of time deltas between USB insertion and the first process execution from that device. Flag any execution that falls into an anomalous time window (e.g., < 5th percentile of the user's typical interaction time), suggesting automated execution rather than manual user interaction.",
              "Machine Learning: Implement a time-series anomaly detection model on the frequency of process executions from removable media per host. A sudden, sharp spike in executions immediately following a device insertion event, inconsistent with historical patterns for that host or user, should be flagged as a potential autorun-based infection."
            ]
          },
          {
            "description": "A process originating from removable media subsequently creates a network connection, modifies a registry key associated with persistence, or writes a file to a standard system directory (e.g., C:\\Windows\\System32).",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 11",
              "Sysmon Event ID 13",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for authentication logs), Network egress points (for C2 traffic), All endpoint devices",
            "action": [
              "Symbolic: For any process launched from removable media, track its process GUID (via Sysmon Event ID 1). Trigger an alert if this process GUID is associated with a subsequent network connection to a known-bad IP/domain (Sysmon Event ID 3 enriched by Zeek conn.log), a modification to a registry autorun key (Sysmon Event ID 13), or the creation of an executable file in %SystemRoot% (Sysmon Event ID 11).",
              "Statistical: For processes launched from removable media, calculate a risk score based on subsequent actions. Increment the score for rare actions, such as: initiating network traffic to a country never before contacted by the user (enrich Zeek conn.log with GeoIP), modifying an uncommon registry key, or spawning a rare child process (e.g., wscript.exe, powershell.exe). Alert if the cumulative score exceeds a statistically determined threshold (e.g., > 99th percentile of scores for benign removable media processes).",
              "Machine Learning: Use a graph-based analysis model. Represent the initial USB process execution as a source node and subsequent activities (file creations, registry mods, network connections) as child nodes. Train a Graph Neural Network (GNN) to classify these execution graphs as benign or malicious. Apply the model in real-time to flag suspicious subgraphs indicative of post-exploitation behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary replicating or moving laterally using removable media?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1091",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A file creation event occurs on a removable media volume on an internal host, and the written file's hash (SHA256) matches a known malicious indicator.",
            "data_sources": [
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal workstations, File servers, Jump boxes",
            "action": [
              "Symbolic: Upon a file creation event on a removable drive (Sysmon Event ID 11), hash the file in near-real-time. Correlate the hash against a threat intelligence database. Generate a high-severity alert if a match is found, indicating a compromised host is attempting to stage malware for lateral movement.",
              "Statistical: Monitor the rate at which hosts write executable files (.exe, .dll, .scr) to removable media. Establish a baseline for each host/user. Alert when a host's rate exceeds a predefined statistical threshold (e.g., 3 standard deviations above its mean, or > 95th percentile for the organization), suggesting automated replication behavior.",
              "Machine Learning: Train a classification model on features of files written to removable media (file size, entropy, PE header info, source process). Use the model to predict the probability that a file is malicious. Alert on files written to removable media that are classified as malicious with high confidence, even without a known-bad hash."
            ]
          },
          {
            "description": "A file is written to removable media with the name 'autorun.inf', or an executable file is written with a name and icon designed to mimic a legitimate document or folder.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal workstations and servers with USB access",
            "action": [
              "Symbolic: Create a detection rule that triggers when a process writes a file to a removable drive (Sysmon Event ID 11) and the source process's file hash is identical to the destination file's hash (self-replication). Additionally, alert on any process writing a file named 'autorun.inf' to a removable drive.",
              "Statistical: Analyze the filenames of executables written to removable media. Look for executables that use double extensions (e.g., 'report.pdf.exe') or contain right-to-left-override (RTLO) characters. Calculate the Levenshtein distance between the filename (without extension) and common document-related terms ('report', 'invoice', 'resume'). Flag files with low distance but an executable extension as suspicious.",
              "Machine Learning: Use clustering algorithms (e.g., DBSCAN) on the feature vectors of files written to removable drives (e.g., filename entropy, file entropy, PE import hashes). Identify clusters of anomalous files that may represent a single malware family replicating itself with slight variations in filenames or packing."
            ]
          },
          {
            "description": "The hash of a file written to a removable drive on Host_A at Time_1 matches the hash of a process executed from a removable drive on Host_B at Time_2, where Time_2 > Time_1.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal network segments containing multiple workstations or servers, Systems with high user mobility (e.g., shared operations centers)",
            "action": [
              "Symbolic: Maintain a state table of file hashes written to removable media (from Sysmon Event ID 11), including (Hash, SourceHost, Timestamp). For every process execution from removable media (Sysmon Event ID 1), query this table for the process's hash. If a match is found where ExecutingHost != SourceHost, generate a high-confidence alert for lateral movement via removable media.",
              "Statistical: Graph the movement of file hashes between hosts via removable media. Analyze the graph for nodes (hosts) with an unusually high out-degree (a spreader) or in-degree (a frequent victim). Use centrality metrics (e.g., PageRank) to identify influential spreaders in a widespread propagation scenario.",
              "Machine Learning: Develop a sequence analysis model (e.g., using an LSTM) that learns normal sequences of file write/execute events on removable media across the enterprise. Flag a 'write(Host_A) -> execute(Host_B)' sequence as anomalous if it deviates significantly from learned benign patterns (e.g., software updates by IT staff)."
            ]
          },
          {
            "description": "Within minutes of executing from removable media, a process or its children initiate network connections to multiple other internal IP addresses on common service ports (e.g., 445, 139, 3389) or generate multiple failed authentication events (Logon Type 3).",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, Authentication servers (Domain Controllers), Network sensor tap points",
            "action": [
              "Symbolic: For a process originating from a removable drive (Sysmon Event ID 1), correlate its ProcessGUID with subsequent network connections (Sysmon Event ID 3). Alert if this process connects to more than 10 unique internal hosts on port 445 (SMB) within 5 minutes.",
              "Statistical: For processes launched from removable media, baseline the number of distinct internal IPs and ports they connect to within 15 minutes of execution. Alert if a process exceeds the 98th percentile for either of these metrics, indicating potential network scanning or lateral movement attempts.",
              "Machine Learning: Use a time-series model to analyze the rate of failed network logon events (Windows Event ID 4624, Logon Type 3, Failure) per source host. If a process execution from removable media is temporally correlated with a significant, anomalous spike in failed logons originating from that host, flag it as a likely credential-based lateral movement attempt."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]