[
  {
    "information_requirement": "Has an adversary established a multi-stage command and control channel for persistent or interactive access? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1104",
        "name": "Multi-Stage Channels",
        "evidence": [
          {
            "description": "An initial outbound network connection is made to an IP address or domain identified by threat intelligence as a known malware redirector or first-stage command and control server.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways and proxies, DNS resolvers, User endpoints",
            "action": [
              "Symbolic Logic: Correlate all outbound network connections (Zeek conn.log) and DNS queries (Zeek dns.log) against a high-confidence, continuously updated CTI feed specifically identifying known redirectors, first-stage C2 servers, or infrastructure associated with malware droppers. An alert on a match represents a high-confidence indicator of the first step in a multi-stage channel.",
              "Statistical Analysis: For all outbound connections, calculate the historical rarity of the destination domain/IP for the source host. A connection to a domain/IP never before seen or seen with a frequency in the bottom 1st percentile of all historical destinations for that host, especially when combined with a known malicious TLD or ASN, increases the risk score.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled network traffic data (Zeek conn.log, dns.log). Features should include domain name length, entropy, presence of numbers, TLD, ASN information, and historical reputation scores. Use the model to predict the probability of a new connection being a first-stage C2 beacon. A high probability score triggers an alert."
            ]
          },
          {
            "description": "An initial C2 connection is followed by a network-level hand-off, such as an HTTP redirect (3xx status code) to a new server or a DNS query (e.g., TXT, CNAME) that resolves to a second-stage C2 address.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways and proxies, DNS resolvers",
            "action": [
              "Symbolic Logic: Define a rule to detect when an internal host makes a request that receives an HTTP 3xx redirect response, and the subsequent request to the new location is to a domain with a low reputation score, a recent registration date, or is a raw IP address. Separately, define a rule to detect when a DNS TXT query response contains a string that matches a regular expression for an IP address, domain, or base64-encoded payload.",
              "Statistical Analysis: For each host, establish a baseline of normal HTTP redirect behavior and DNS query types. Calculate the 99th percentile for the number of redirects followed in a single session and the frequency of TXT/non-A/AAAA record queries. An alert is triggered if a host exceeds these statistical thresholds, indicating anomalous redirection or data retrieval via DNS.",
              "Machine Learning: Use a sequence analysis model (e.g., LSTM, Hidden Markov Model) to learn normal sequences of network events (e.g., DNS query -> TCP connection -> HTTP GET -> HTTP 200 OK). An anomalous sequence, such as DNS query -> TCP connection -> HTTP GET -> HTTP 302 Redirect -> New DNS query -> New TCP connection to a different ASN, would be flagged by the model as a potential C2 hand-off."
            ]
          },
          {
            "description": "A single process exhibits a distinct change in its network communication profile (e.g., protocol, port, destination ASN, data volume, JA3/JA3S hash) after an initial connection, indicating a hand-off to a second-stage channel.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Domain Controllers, Critical application servers, Internet gateways and proxies",
            "action": [
              "Symbolic Logic: Create a stateful rule that triggers when a process (e.g., identified by `uid` in Zeek conn.log correlated with Windows Event ID 4688) that has established a connection to destination A, subsequently establishes a new connection to destination B, where B is on a watchlist of suspicious IPs/ASNs or has different protocol/port characteristics from the connection to A.",
              "Statistical Analysis: For each process making outbound connections, profile its communication characteristics (protocol, destination port, data volume per connection, JA3 hash). Use a statistical test (e.g., Mahalanobis distance) to detect significant deviations from a dynamically established baseline. A change in multiple parameters simultaneously that exceeds a 3-sigma deviation indicates a probable hand-off.",
              "Machine Learning: Apply time-series change point detection algorithms (e.g., CUSUM, Bayesian Online Change Point Detection) to streams of network metadata grouped by process. The stream can be a vector of features (port, bytes out, protocol). A detected change point in the time series for a single process's network behavior indicates a state change, potentially a C2 hand-off."
            ]
          },
          {
            "description": "An initial C2 connection results in a file download, immediately followed by a new and distinct C2 connection initiated by either the original process or the newly created process to a different external destination.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Internet gateways and proxies",
            "action": [
              "Symbolic Logic: Write a SIEM correlation rule that links the following events in sequence within a short time window (< 5 minutes): 1. An outbound connection from Process A (Windows Event ID 4688 + Zeek conn.log). 2. A file download with MIME type 'application/x-dosexec' or 'application/octet-stream' (Zeek files.log). 3. The creation of Process B (Windows Event ID 4688). 4. A new outbound connection from Process B to a different destination IP/ASN.",
              "Statistical Analysis: Analyze the temporal relationship between file downloads and new process network activity. Calculate the baseline time delta between a file being written to disk and the new process initiating network traffic. A download followed by a new process beaconing out in a time delta that falls into the lowest 5th percentile (i.e., very quickly, suggesting automation) is suspicious.",
              "Machine Learning: Train a graph-based model where nodes are processes, files, and network destinations, and edges represent actions (writes, creates, connects). Use a graph neural network (GNN) to classify subgraphs of activity. The pattern 'External IP -> Process A -> writes File X -> creates Process B -> connects to new External IP' would be classified as a high-risk anomaly indicative of a multi-stage payload."
            ]
          },
          {
            "description": "A single process makes a series of short-lived connections to multiple, geographically or logically disparate external destinations in sequence, indicating the probing of a C2 list to find a live second-stage channel.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Internet gateways and proxies",
            "action": [
              "Symbolic Logic: Create a rule that flags any single process (correlated via Windows Event ID 4688) that makes outbound connection attempts (Zeek conn.log) to more than 10 unique IP addresses in under 1 minute, where more than 50% of those connections fail or are short-lived (< 5 seconds).",
              "Statistical Analysis: For each process, calculate the Shannon entropy of the destination IP addresses it connects to within a 5-minute sliding window. Establish a baseline entropy score for common applications (e.g., web browsers, updaters). A process whose destination IP entropy score significantly exceeds the 99th percentile of the established baseline is indicative of beaconing to a list of C2 servers.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection data, with features like source process, destination ASN, destination country, and connection duration. A small, dense cluster of connections from a single process to many geographically and logically disparate destinations with short durations would be isolated by the algorithm as an outlier cluster, representing a likely C2 probing loop."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]