[
  {
    "information_requirement": "Is the adversary leveraging browser sessions for collection or lateral movement?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1185",
        "name": "Browser Session Hijacking",
        "evidence": [
          {
            "description": "A browser process initiates a network connection to a destination IP address or domain present on a threat intelligence feed for C2 or session hijacking malware.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise web proxy, DNS resolvers, and all user endpoints.",
            "action": [
              "Symbolic: Correlate network connection events (Windows Event ID 5156) with DNS queries (Zeek dns.log) to identify the process name making the request. Join the destination IP (from Zeek conn.log) or queried domain (from Zeek dns.log) against a high-confidence threat intelligence feed of known C2 servers. Generate a high-severity alert for any match originating from a browser process (e.g., chrome.exe, firefox.exe, msedge.exe).",
              "Statistical: For each browser process, calculate the Jaccard similarity score between the set of domains it contacted in the last hour and the set of domains contacted by the user's peer group over the last 30 days. Flag users whose browser activity shows a Jaccard score below the 5th percentile for their peer group, indicating a significant deviation in browsing destinations.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled network connection data (Zeek conn.log features: duration, service, orig_bytes, resp_bytes, history) to predict malicious vs. benign connections. Apply the model in real-time to network flows originating from browser processes and investigate connections classified as malicious with high confidence."
            ]
          },
          {
            "description": "A non-browser process accesses sensitive browser files (e.g., Cookies, Login Data), or a browser process is launched with command-line arguments indicative of debugging or remote control.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and servers with browser access, focusing on user profile directories.",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for browser executables launched with known suspicious command-line arguments such as '--remote-debugging-port', '--load-extension', or '--disable-web-security'. Create an alert for any exact match.",
              "Statistical: Enable file access auditing (Windows Event ID 4663) for browser data directories. For each sensitive file (e.g., 'Cookies', 'Login Data'), build a baseline of normally accessing processes. Calculate the rarity of each process accessing these files and alert when a process with a rarity score in the top 1st percentile (e.g., powershell.exe) accesses these files.",
              "Machine Learning: Use an unsupervised learning algorithm like an autoencoder on process creation events (Windows Event ID 4688). Featureize the command line arguments for browser processes using TF-IDF. The autoencoder will learn to reconstruct normal command lines and flag processes with a high reconstruction error, which represent anomalous command-line structures."
            ]
          },
          {
            "description": "A browser process spawns a non-standard child process (e.g., a command shell), or evidence of process injection into a browser process is observed.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints running user-facing web browsers, including workstations and terminal servers.",
            "action": [
              "Symbolic: From process creation logs (Windows Event ID 4688), create a specific rule to alert whenever a browser process (e.g., chrome.exe, firefox.exe) is the parent process of a command-line interpreter (cmd.exe, powershell.exe) or rundll32.exe. This is a high-fidelity indicator.",
              "Statistical: Build a baseline of all parent-child process relationships for each browser executable across the enterprise. Calculate the frequency of each unique child process. Alert when a browser spawns a child process that falls below a low frequency threshold (e.g., seen in less than 0.1% of instances), indicating a rare process creation event.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA) on the count of child processes spawned by browsers per user per hour. The model will learn the normal rhythm of process creation and flag significant deviations from this learned pattern, which may indicate adversarial interaction."
            ]
          },
          {
            "description": "A user's network traffic originating from a browser process deviates significantly from their historical baseline in terms of destinations, protocols, or data volume.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways, internal network segments (for intranet access), and user endpoints.",
            "action": [
              "Symbolic: Create a rule to detect when a browser process (identified by correlating Windows Event ID 5156 with Zeek conn.log) initiates a connection to an internal IP address on a non-standard web port, particularly management ports like 22 (SSH), 3389 (RDP), or 445 (SMB).",
              "Statistical: For each user, establish a baseline by calculating the Shannon entropy of destination domains visited per hour from Zeek http.log. A sudden, sharp increase in entropy indicates browsing to many new sites, while a sharp decrease could indicate tunneling. Alert when a user's entropy score deviates by more than 3 standard deviations from their personal baseline.",
              "Machine Learning: Use clustering algorithms (e.g., DBSCAN) on user web traffic features (e.g., total bytes transferred, ratio of internal-to-external connections, number of unique destination ports). Monitor for users who rapidly shift from one behavioral cluster to another (e.g., from 'Standard User' to 'Heavy Internal Resource Accessor'), which may indicate their session was hijacked for internal reconnaissance."
            ]
          },
          {
            "description": "A single web session identifier (e.g., session cookie) is observed being used simultaneously or in rapid succession from multiple, geographically disparate IP addresses or with different User-Agent strings.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic inspection points where internal and external web application traffic is visible, such as the internet gateway or reverse proxy servers.",
            "action": [
              "Symbolic: From Zeek http.log, extract session identifiers from HTTP 'Cookie' headers. Create a rule to flag any session ID associated with more than one distinct 'User-Agent' string within its lifetime.",
              "Statistical: For each unique session ID, log the timestamp and source IP of every request. For each new request, calculate the time and geographic distance from the previous request. If the implied travel speed between the two geolocations exceeds a plausible threshold (e.g., 1000 km/h), flag it as an 'impossible travel' event.",
              "Machine Learning: Train a sequence-based model (e.g., an LSTM) on sequences of user actions within a session (e.g., sequence of URLs visited, time between clicks). A hijacked session used for different purposes will likely produce a sequence of actions that the model flags as anomalous or having a low probability, indicating a behavioral mismatch."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]