[
  {
    "information_requirement": "Is an adversary leveraging a trusted third-party relationship for initial access to our network? (PIR)",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1199",
        "name": "Trusted Relationship",
        "evidence": [
          {
            "description": "A successful authentication or network connection from a trusted partner's account or IP space matches a known malicious indicator from threat intelligence or a partner breach notification.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Partner-facing web portals, Jump servers/bastion hosts, Cloud IAM roles delegated to partners",
            "action": [
              "Symbolic: Continuously correlate source IP addresses from Zeek conn.log and Windows Event ID 4624 logon events against a threat intelligence list of known malicious IPs, specifically including those from reported third-party breaches. Trigger a high-severity alert on any match.",
              "Statistical: For each trusted partner, profile the ASN and country of origin for their source IPs. Calculate the frequency distribution of logins from each country/ASN. Alert if a login originates from a country/ASN that falls below the 5th percentile of historical activity for that partner.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) classifier on historical tuples of (user, source_IP, ASN, hour_of_day, day_of_week) for each trusted partner. Use the trained model to score new login events in real-time. Flag logins classified as anomalies for review."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) associated with a trusted partner's session shows execution of common reconnaissance commands, discovery tools, or suspicious script arguments.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Jump servers, Managed servers, Domain controllers, Developer workstations accessed by partners",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for process creation events where the parent process is associated with a trusted partner's session. Use a ruleset with regular expressions to match command-line arguments against a list of known enumeration commands (e.g., `whoami`, `nltest /dclist:`, `net user`, `systeminfo`). Alert on any match.",
              "Statistical: For each trusted partner account, create a baseline of normally executed processes and command-line arguments. Calculate the Shannon entropy of the command-line arguments for each new process. Alert when the entropy of a command line significantly exceeds the user's historical baseline (e.g., > 90th percentile), which can indicate obfuscated or encoded commands.",
              "Machine Learning: Use an NLP model to generate embeddings for process command lines. Train a classification model (e.g., Logistic Regression) to distinguish between benign and malicious command-line patterns based on labeled historical data. Apply the model to new command lines from partner sessions to predict and flag suspicious activity."
            ]
          },
          {
            "description": "Logins from trusted partner accounts that deviate from established baselines of geographic location, time-of-day, frequency, or source network.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN gateways, External-facing authentication portals (e.g., ADFS), Cloud identity providers (e.g., Azure AD, Okta)",
            "action": [
              "Symbolic: Implement an 'impossible travel' rule. For a given partner account, if a new login (Windows Event ID 4624) occurs from a geographic location that is physically impossible to have traveled to since the last known login location and time, trigger a high-severity alert.",
              "Statistical: For each partner account, model the login hour-of-day and day-of-week as a probability distribution. Calculate the Z-score for each new login time against the historical distribution for that user. Alert on logins with a Z-score > 3, indicating a login at a statistically unusual time.",
              "Machine Learning: Use a time series forecasting model (e.g., ARIMA or LSTM) to predict login frequency and volume from partner IP ranges. An actual login volume that significantly deviates from the forecasted range (prediction interval) indicates a potential anomaly, such as a brute-force attack from a compromised partner network."
            ]
          },
          {
            "description": "A trusted partner account performing internal actions that are anomalous compared to their typical role-based activity, such as accessing unusual systems, transferring abnormal data volumes, or accessing new categories of data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal file shares, Database servers, Code repositories, Critical infrastructure management interfaces",
            "action": [
              "Symbolic: For each trusted partner, define a 'role profile' listing the specific internal servers (by IP or hostname) they are authorized to access. Monitor Zeek conn.log for connections originating from the partner's session IP to internal destinations. Alert if a connection is made to a server not in their pre-defined access list.",
              "Statistical: For each partner session, monitor the total outbound data volume (sum of `resp_bytes` in Zeek conn.log and `total_bytes` in files.log). Baseline the typical session data volume for each partner. Alert if a session's total data transfer exceeds the 99th percentile of their historical baseline.",
              "Machine Learning: Create a graph of user-to-asset interactions, where nodes are users and assets (servers, fileshares) and edges represent access. Use a community detection algorithm (e.g., Louvain Modularity) to identify clusters of normal activity. Flag a partner account as anomalous if it begins interacting with assets far outside its typical community cluster."
            ]
          },
          {
            "description": "A trusted partner account exhibiting a behavioral sequence of reconnaissance followed by attempted lateral movement.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All authenticated endpoints and servers, particularly jump boxes and domain controllers",
            "action": [
              "Symbolic: Create a stateful rule that triggers when, within a 10-minute window for a single partner user session, the following sequence occurs: (1) Execution of a reconnaissance command from Event ID 4688, followed by (2) a network logon (Event ID 4624, Logon Type 3) to a new target host, followed by (3) a connection to that same target host over a remote administration port in Zeek conn.log.",
              "Statistical: For each partner user, create a baseline of 'first-time' connections to internal hosts. Monitor for sessions where a user connects to a high number of 'first-time' hosts. Alert if the count of new hosts accessed in a single session exceeds a statistically-derived threshold (e.g., 3 standard deviations above the user's mean).",
              "Machine Learning: Model the sequence of actions (process execution, network connection, authentication) within a user session as a Markov chain. Calculate the transition probabilities between states (e.g., P(Logon | Reconnaissance)). Flag sessions that contain low-probability state transitions, which deviate from normal administrative workflows."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]