[
  {
    "information_requirement": "Has the adversary achieved execution through user interaction? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1204",
        "name": "User Execution",
        "evidence": [
          {
            "description": "A process spawned by a common user-facing application (e.g., OUTLOOK.EXE, chrome.exe) makes an outbound network connection to a destination IP or domain present on a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Email gateways, Web proxies, DNS resolvers",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log) on the endpoint. Join the destination IP or resolved domain (from Zeek dns.log) with a high-confidence threat intelligence feed of known malicious C2 servers or malware distribution points. Alert on any match.",
              "Statistical: For a given parent process (e.g., WINWORD.EXE), calculate the historical frequency of destination domains it communicates with. Alert when a connection is made to a domain that falls below the 1st percentile of frequency for that parent process across the enterprise, indicating a rare destination.",
              "Machine Learning: Train a decision tree or random forest classifier using features such as parent process name, destination IP geolocation, destination ASN, port number, and threat intel score. Use the trained model to classify new process-network events in real-time and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A command-line interpreter (e.g., powershell.exe, cmd.exe) is executed with arguments containing obfuscation (e.g., base64 encoding), execution policy bypasses, or web download commands.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Domain Controllers, Application servers",
            "action": [
              "Symbolic: Scan command-line arguments in process creation events (Windows Event ID 4688) for specific malicious strings and regular expressions (e.g., 'IEX(New-Object Net.WebClient).DownloadString', '-enc', '-w hidden', 'Bypass'). Alert on any matches.",
              "Statistical: Calculate the Shannon entropy score for all command-line arguments for interpreter processes (powershell.exe, cmd.exe). Establish a baseline entropy distribution. Alert when a new command's entropy exceeds the 99th percentile, suggesting a high degree of randomness typical of encoded or obfuscated commands.",
              "Machine Learning: Use a pre-trained Natural Language Processing (NLP) model, or train a custom one using a TF-IDF vectorizer, on a large corpus of known malicious and benign command lines. Classify new command lines in real-time to identify suspicious patterns that may not match simple regex signatures."
            ]
          },
          {
            "description": "A user-facing application (e.g., WINWORD.EXE, AcroRd32.exe) spawns a child process that is not part of its established baseline of normal behavior, particularly command-line interpreters or scripting engines.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Symbolic: Create and maintain an explicit allow-list of known-good parent-child process relationships for common applications (e.g., WINWORD.EXE -> splwow64.exe). Alert on any process creation event (Windows Event ID 4688) that violates this list, such as WINWORD.EXE -> powershell.exe.",
              "Statistical: For each parent process, build a baseline of its child processes and their execution frequency over a 30-day period. Alert when a parent process spawns a child process that is statistically rare (e.g., has occurred fewer than 5 times in the last 30 days across the enterprise) or has never been seen before.",
              "Machine Learning: Model parent-child process relationships as a graph. Apply unsupervised anomaly detection algorithms (e.g., Local Outlier Factor or Isolation Forest) to identify unusual or new edges (relationships) in the graph. These anomalies, representing rare process chains, should be flagged for investigation."
            ]
          },
          {
            "description": "Network traffic attributed to a user endpoint shows connections to destinations that are statistically anomalous based on geolocation, ASN, domain age, or JA3/JA4S hash.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Web proxies, DNS resolvers",
            "action": [
              "Symbolic: Match destination IPs from Zeek conn.log and domains from Zeek dns.log against a list of newly registered domains (e.g., registered in the last 30 days). Alert on connections to these domains originating from user subnets.",
              "Statistical: For each user endpoint, establish a baseline of destination countries and ASNs they typically connect to. Alert when a connection is made to a country or ASN that is in the bottom 5th percentile of the user's or organization's historical connection data. Similarly, alert on JA3/JA4S hashes from Zeek ssl.log that are rare for the organization.",
              "Machine Learning: Implement a time series forecasting model (e.g., ARIMA or Prophet) on the volume of outbound network connections per protocol for each user. Alert when the observed connection volume significantly deviates from the forecasted range, which could indicate unexpected data transfer initiated by a malicious payload."
            ]
          },
          {
            "description": "The execution of an archive utility (e.g., 7z.exe, winrar.exe) is followed within a short time window by the execution of a new process from a user's temporary or downloads directory.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Download directories on shared servers",
            "action": [
              "Symbolic: Create a rule that triggers when a process creation event for an archive utility (e.g., 7z.exe) is followed within 60 seconds by another process creation event where the executable path is in a high-risk directory (e.g., %APPDATA%, %TEMP%, C:\\Users\\*\\Downloads) and has a low-prevalence file name.",
              "Statistical: Analyze the time delta between an archive utility execution and subsequent process executions from temporary/download locations. Establish a baseline distribution of these time deltas. Flag sequences where the time delta is an outlier (e.g., less than the 10th percentile), suggesting automated or scripted behavior.",
              "Machine Learning: Develop a sequence analysis model (e.g., a Hidden Markov Model) trained on event logs to recognize malicious event chains. A trained model can identify the sequence of 'email client -> save attachment -> decompress archive -> execute from temp' as a high-risk pattern, even with variations in timing and specific processes."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]