[
  {
    "information_requirement": "Is the adversary maintaining persistence using port knocking?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1205.001",
        "name": "Port Knocking",
        "evidence": [
          {
            "description": "A sequence of three or more failed TCP connection attempts (e.g., RST, REJ) to distinct, closed ports from a single source IP, where that source IP is present on a high-confidence threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway Firewall, DMZ Network Segments",
            "action": [
              "Symbolic: Filter Zeek conn.log for failed connections (conn_state: 'REJ', 'RSTO', 'S0'). Group by source IP (id.orig_h). For each source IP, count the number of distinct destination ports (id.resp_p) within a 30-second window. Join the source IPs with a threat intelligence feed of known malicious actors. Alert if a source IP from the threat feed attempts to connect to 3 or more distinct ports within the time window.",
              "Statistical: For all source IPs exhibiting failed connection sequences, calculate the Shannon entropy of the destination port sequence. A high entropy score, indicating a more random or specific sequence unlike a simple scan, combined with a low total port count (e.g., < 50) and a source IP in the top 99th percentile of 'knocking' behavior should be flagged for review.",
              "Machine Learning: Train a time-series model (e.g., LSTM) on sequences of (port, timestamp, tcp_flag) from Zeek conn.log, labeled with known benign (e.g., internet scanners) and malicious (e.g., known port knocking) activity. Deploy the model to classify new incoming connection sequences in near real-time. A sequence classified as 'malicious port knock' with high confidence triggers an alert."
            ]
          },
          {
            "description": "The execution of a process with a filename, command-line argument, or file hash matching a known port knocking daemon (e.g., knockd, fwknopd) on a monitored endpoint.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Server Subnets, Domain Controllers, User Workstation VLANs",
            "action": [
              "Symbolic: Create a watchlist of known port knocking process names (e.g., 'knockd.exe', 'fwknopd'), configuration file names (e.g., 'knockd.conf'), and file hashes. Monitor Windows Event ID 4688 (Process Creation) events. Alert when the 'NewProcessName' or 'CommandLine' fields contain a match from the watchlist.",
              "Statistical: For all process creation events (Event ID 4688), calculate the historical rarity of each process path and command line on a per-host and organization-wide basis. A process execution that is in the 99.9th percentile for rarity and contains substrings like 'knock', 'port', or 'firewall' in its command line should be scored as highly suspicious.",
              "Machine Learning: Develop a one-class SVM (Support Vector Machine) model trained on legitimate process command-line arguments observed in the environment. Use this model to score new process creation events. Command lines that are classified as anomalies and contain features associated with network configuration (e.g., port numbers, protocol names) should be flagged as a potential port knocking daemon installation."
            ]
          },
          {
            "description": "A Windows Filtering Platform rule change (Event ID 5154 or 4946) or a new network connection listener is created on a host within 5 seconds of the final connection attempt in a suspected port knocking sequence targeting that same host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5154",
              "Windows Event ID 4946"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Firewall Management Interfaces, Critical Application Servers, Endpoint Devices",
            "action": [
              "Symbolic: Correlate a port knocking sequence alert (from behavioral analysis of Zeek conn.log) on a destination host with a subsequent Windows Event ID 5154 ('The Windows Filtering Platform has permitted a connection') or 4946 ('A change has been made to the Windows Firewall exception list') on the same host. The correlation window must be less than 5 seconds between the last knock and the host event.",
              "Statistical: Establish a baseline rate of firewall rule changes (Event IDs 4946, 5154) per host, per hour. After identifying a suspected port knocking sequence from Zeek conn.log, check for a subsequent firewall change event on the target host. If this event is a statistical outlier (e.g., occurs at 3 AM, or is a rare event type for that host, >3 standard deviations from the mean), elevate the risk score of the port knocking sequence.",
              "Machine Learning: Create a state-transition model where states are defined by network and host events. A 'suspected knock' state is entered when a knock sequence is detected in Zeek logs. The model transitions to a 'confirmed knock' state if a firewall rule change or new listening port event occurs on the target host within a short time threshold. Transitions to this 'confirmed' state from an external IP source should trigger a high-severity alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using port knocking?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1205.001",
        "name": "Port Knocking",
        "evidence": [
          {
            "description": "A sequence of failed connection attempts, consistent with port knocking, originates from an IP address associated with anonymization services (e.g., TOR exit nodes, commercial VPNs) to bypass IP-based blocking.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Egress Network Filters, Proxy Logs",
            "action": [
              "Symbolic: Identify port knocking sequences using behavioral rules (e.g., 3-10 failed connections to distinct ports in <30s). Join the source IP of these sequences with a CTI feed specifically listing anonymizer services (TOR, VPNs, proxies). Alert when a port knocking sequence originates from an IP on this list.",
              "Statistical: Profile the geographic and ISP diversity of all incoming connection attempts. Port knocking attempts originating from source IPs that fall into statistically anomalous ASN or country categories (e.g., a country with no business relationship) should have their risk score elevated. Calculate a rarity score for the source IP's ASN and country; a score in the 99th percentile is highly suspicious.",
              "Machine Learning: Train a classification model (e.g., Random Forest) to predict if a source IP is malicious, using features like the IP's presence on blocklists, ASN, country, and historical behavior. Apply this model to the source IPs of suspected port knocking sequences to prioritize investigation of those classified as high-risk."
            ]
          },
          {
            "description": "A successful TCP connection (conn_state 'SF') is established from a source IP to a destination port that has no history of accepting connections, and this event occurs within 10 seconds of a series of 3+ failed connection attempts from the same source IP to different ports on the same destination host.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Servers, Externally-facing Application Gateways, Network Taps",
            "action": [
              "Symbolic: For a given destination host, maintain a stateful list of historically successful listening ports from Zeek conn.log (conn_state 'SF'). Identify a new successful connection to a port not on this list. If this successful connection was preceded by >3 failed connections (conn_state 'REJ', 'S0') from the same source IP to the same host within the last 30 seconds, trigger an alert.",
              "Statistical: For each host, profile the set of listening ports over a 30-day baseline. For any new successful connection to a port outside this baseline (a 'virgin port'), calculate the probability of this event based on historical data. If a low-probability connection event is temporally correlated with a preceding cluster of failed connections from the same source, flag it as a high-confidence port knocking event.",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) on connection 4-tuples (src_ip, dst_ip, dst_port, proto). Train the model on baseline traffic. A successful connection that is flagged as an anomaly and is temporally linked to a preceding sequence of failed connection attempts from the same source should be classified as a successful port knock."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary establishing command and control using port knocking?",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1205.001",
        "name": "Port Knocking",
        "evidence": [
          {
            "description": "An internal host initiates a sequence of outbound connection attempts to distinct ports on a single external IP (reverse knock), which is immediately followed by a successful connection from that same external IP back to the internal host on a dynamically opened port.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the network, DNS Resolvers, Core Network Switches",
            "action": [
              "Symbolic: Filter Zeek conn.log for internal hosts (`id.orig_h` in private IP space) making >3 failed outbound connections to distinct ports on a single external IP (`id.resp_h`) within 10 seconds. Correlate this with a subsequent successful inbound connection from that same external IP to the internal host within 30 seconds. Join the external IP with a CTI feed of known C2 servers and alert on a match.",
              "Statistical: Identify internal hosts performing outbound 'knocking' patterns. For these hosts, analyze the destination IPs. Calculate the rarity of the destination IP, ASN, and country across the entire organization's outbound traffic. An outbound knock to a destination in the 99.9th percentile of rarity is highly suspicious of a C2 server rendezvous.",
              "Machine Learning: Train a classifier to identify C2 domains/IPs using features from Zeek dns.log and conn.log (e.g., domain entropy, query frequency, connection duration). When an outbound knocking pattern is detected, feed the destination IP/domain into the classifier. If it's classified as C2 with high confidence, alert on 'Reverse Port Knocking for C2 Callback'."
            ]
          },
          {
            "description": "A periodic pattern where an inbound knock sequence from an external IP is followed by a short-lived outbound connection (beacon) from the targeted internal host back to the same external IP. The time interval between these patterns is consistent (e.g., every 60 minutes +/- 5 seconds).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal Network Segments, Firewall Logs",
            "action": [
              "Symbolic: Define a chained event: 1) An inbound port knock sequence. 2) An outbound connection from the knock target to the knock source within 60 seconds. Define this chain as a 'knock-beacon' event. Search for these 'knock-beacon' events that repeat from the same source/destination pair with a regular time interval (e.g., between 55 and 65 minutes).",
              "Statistical: For all outbound connections, calculate the 'jitter' (standard deviation of the inter-arrival time) for connections between the same source/destination pair. Isolate connections that follow a port knock and have a jitter in the lowest 1st percentile (highly periodic). A combination of low jitter and low data volume is highly indicative of C2 beaconing.",
              "Machine Learning: Use time-series analysis (e.g., Fourier Transform or Autocorrelation) on connection events for each internal host to automatically detect strong periodic signals (beaconing). If a periodic signal is detected for a host's outbound traffic, check if each beacon in the series is preceded by an inbound port knock from the beacon destination. A match confirms periodic C2 activated by port knocking."
            ]
          },
          {
            "description": "A long-lived TCP connection with low, periodic data transfer (indicative of an interactive shell or keep-alive) is established on a non-standard port, immediately following a successful port knock sequence that opened said port.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Server Subnets, Developer Workstations, Network Security Monitoring Sensors",
            "action": [
              "Symbolic: Identify a successful port knock event (knock sequence followed by successful connection to a new port). For the resulting connection, check if its duration is > 5 minutes and if the `history` field in Zeek conn.log indicates bidirectional data transfer (e.g., contains 'd' and 'D'). Alert if these conditions are met, indicating a potential interactive shell.",
              "Statistical: For connections established after a port knock, calculate the ratio of connection duration to total bytes transferred. A very high ratio (long duration, low data) is anomalous and typical of interactive C2 sessions. Flag connections in the 95th percentile of this duration-to-bytes ratio for investigation.",
              "Machine Learning: Train a classification model (e.g., Gradient Boosting) to distinguish between 'interactive C2' and 'bulk transfer' traffic based on Zeek conn.log features (duration, orig_bytes, resp_bytes, history). Apply this model to all connections established immediately after a port knock. An alert is generated if the connection is classified as 'interactive C2'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]