[
  {
    "information_requirement": "Is the adversary causing negative impact via cloud service hijacking?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1496.004",
        "name": "Cloud Service Hijacking",
        "evidence": [
          {
            "description": "Observed network traffic to known malicious domains/IPs or containing known compromised API keys associated with cloud service hijacking.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), Internet gateway",
            "action": [
              "Symbolic: Join destination IPs from `Zeek conn.log` and domains from `Zeek dns.log` against a CTI feed of known cloud hijacking C2 servers or proxy nodes. Separately, search `Zeek http.log` for known compromised API keys in headers or request bodies using a watchlist and alert on any match.",
              "Statistical: For API keys observed in `Zeek http.log`, calculate the Shannon entropy of the key string. Flag keys with unusually low entropy, which may indicate weak or predictable keys often used by malicious tools. Establish a baseline entropy score for legitimate keys and alert on deviations below the 10th percentile.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from `Zeek http.log` and `conn.log` (e.g., request frequency, user-agent string, URI path structure, data volume) to distinguish between benign and malicious API usage. Use labeled data from past incidents and CTI to train the model to predict the probability of a given API session being part of a hijacking campaign."
            ]
          },
          {
            "description": "A sequence of API calls to a cloud service (e.g., SaaS email, LLM platform) that matches the known functional structure of a resource abuse tool.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud application gateways, API gateways, outbound web proxies",
            "action": [
              "Symbolic: Using `Zeek http.log`, create a stateful signature to detect a specific sequence of API calls, such as an authentication call to AWS SES followed by a high number of `SendEmail` calls from a single source IP within a short time window (e.g., >100 calls in 5 minutes).",
              "Statistical: For each source IP making API calls to a specific cloud service endpoint (e.g., `/v1/chat/completions`), calculate the rate of requests. Establish a baseline request rate per IP and alert when an IP exceeds the 99th percentile of its historical activity or the global activity for that endpoint.",
              "Machine Learning: Use a sequence analysis model like a Recurrent Neural Network (RNN) on the stream of API call URIs and methods from `Zeek http.log` for a given session. Train the model on legitimate API interaction sequences to detect anomalous sequences that deviate significantly from normal application workflows, indicative of tool-based abuse."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of API calls or outbound data transfer from an internal host to a cloud service, exceeding established baselines.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail gateways, network egress points, servers hosting cloud service SDKs",
            "action": [
              "Symbolic: In `Zeek smtp.log`, create a rule that alerts when a single source sends emails to an unusually high number of unique destination domains within one hour (e.g., > 50 unique domains), which is a common indicator of spam campaigns.",
              "Statistical: For each internal host, calculate a moving average and standard deviation of outbound data volume (bytes_out) to cloud service IP ranges using `Zeek conn.log`. Alert when the current volume exceeds the moving average by more than 3 standard deviations.",
              "Machine Learning: Apply a time-series forecasting model (e.g., ARIMA) to the volume of API requests per hour for critical services (e.g., AWS SES, OpenAI). The model, trained on historical data, predicts the expected volume. Generate an anomaly score based on the difference between the observed and predicted volume, and alert when the score surpasses a dynamic threshold."
            ]
          },
          {
            "description": "Cloud service credentials (API keys, user accounts) are used from a source IP address that is anomalous in terms of geolocation, ASN, or is inconsistent with the user's established access patterns.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory), VPN concentrators, Remote Desktop Gateways",
            "action": [
              "Symbolic: Correlate the source IP of a cloud API request from `Zeek http.log` with a CTI feed of known malicious or anonymous proxy/VPN exit nodes. Alert on any match.",
              "Statistical: For each user account, build a profile of typical source countries, ASNs, and login times based on `Zeek conn.log` and `Windows Event ID 4624`. Calculate the frequency of each attribute. A login from a country or ASN that accounts for <1% of the user's historical activity is flagged as anomalous.",
              "Machine Learning: Use an unsupervised learning model like Isolation Forest on a feature set including geolocation (latitude/longitude), time-of-day, and ASN for each login event. The model will learn the boundary of normal activity for each user and identify outliers that represent potentially compromised credential use."
            ]
          },
          {
            "description": "An internal host exhibits a statistically unusual increase in total network data transfer to cloud service provider IP ranges, potentially indicating unauthorized resource consumption.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data center network core, servers hosting sensitive data, cloud synchronization clients",
            "action": [
              "Symbolic: Monitor `Zeek conn.log` for connections to cloud service IP ranges that remain active for an unusually long duration (e.g., > 24 hours) with continuous data transfer. Alert on connections exceeding a predefined duration and data volume threshold (e.g., > 10GB).",
              "Statistical: Group hosts by role (e.g., developer, sales). For each group, calculate the 95th percentile for daily data transfer volume to cloud services using `Zeek conn.log`. Alert when any host exceeds its group's percentile, indicating it is an outlier relative to its peers.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means) to group internal hosts based on their network behavior profiles (features: avg. connection duration, total bytes_out, number of unique destination IPs in cloud ranges). Monitor for hosts that abruptly shift from one cluster to another (e.g., from 'low traffic' to 'high traffic'), indicating a significant change in behavior."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]