[
  {
    "information_requirement": "Has an adversary established persistence by implanting a web shell on a server? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.003",
        "name": "Web Shell",
        "evidence": [
          {
            "description": "An HTTP/S request is made to a URI or from a source IP address matching a known web shell C2 indicator.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewall/Proxy)",
            "action": [
              "Symbolic Logic: Inner join source IPs from Zeek conn.log and requested URIs from Zeek http.log against a high-confidence, continuously updated threat intelligence feed of known malicious IPs, C2 servers, and web shell URLs. Alert on any matches.",
              "Statistical Method: For traffic to destinations not on an allowlist, calculate the ratio of POST requests to GET requests for each source-destination IP pair. A ratio significantly higher than the baseline for web servers (e.g., > 75th percentile) can indicate C2 activity. Also, track the frequency of connections to low-reputation domains and alert when a web server initiates connections to domains seen less than 10 times across the enterprise in the last 30 days.",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on labeled threat intelligence data (features: IP reputation, domain age, ASN, country, URI structure) to score the likelihood of a given HTTP request being malicious. Alert on requests with a high probability score (>0.9)."
            ]
          },
          {
            "description": "An HTTP request contains URI parameters or POST body content indicative of command execution, or a file is created in a web directory with a filename commonly associated with web shells.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Web Servers",
            "action": [
              "Symbolic Logic: Use regular expression matching on Zeek http.log URI queries and POST request bodies for patterns indicative of web shell commands (e.g., 'cmd=', 'exec=', 'eval(', 'passthru(', 'base64_decode'). Concurrently, monitor Windows Event ID 4663 for file creation in web root directories where the filename matches a list of common web shell names (e.g., 'c99.php', 'r57.aspx', 'shell.jsp').",
              "Statistical Method: Calculate the Shannon entropy of URI parameter values and POST request bodies for each URI. A consistently high entropy value (e.g., > 95th percentile for the specific web application) can indicate obfuscated or encrypted commands. Alert on sustained high entropy requests to a single page from a single IP.",
              "Machine Learning: Train a Natural Language Processing (NLP) model on legitimate vs. malicious (web shell) code snippets. Apply this model to newly created files (from Event ID 4663) in web directories to classify them as benign or suspicious. A 'suspicious' classification triggers an alert."
            ]
          },
          {
            "description": "A web server process (e.g., w3wp.exe, httpd, nginx) spawns an anomalous child process, such as a command-line interpreter or network discovery tool.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application Servers",
            "action": [
              "Symbolic Logic: Monitor Windows Event ID 4688 for any web server process (e.g., w3wp.exe, httpd.exe) that spawns a child process not on a pre-defined allowlist. Specifically, alert on the creation of: cmd.exe, powershell.exe, pwsh.exe, bash, whoami.exe, ipconfig.exe, net.exe, nmap.exe.",
              "Statistical Method: For each parent web server process, establish a baseline of normal child process command-line argument length and entropy. Calculate the Z-score for the argument length and entropy of each new process creation event. Alert if both Z-scores exceed a threshold (e.g., > 3), indicating an unusually long and complex command.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features extracted from process creation events (Parent Process Name, Child Process Name, Command Line Arguments). Identify clusters of normal behavior and flag any new process creation event that falls outside of these established clusters as an anomaly."
            ]
          },
          {
            "description": "A web server initiates network connections that are anomalous in their destination, port, or data transfer characteristics.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Web Servers",
            "action": [
              "Symbolic Logic: Analyze Zeek conn.log for any connection initiated by a web server's IP to an internal, non-web-server IP address in a restricted subnet, or to any external IP on a port that is not 80, 443, or another explicitly allowed port. Correlate with Zeek dns.log to check for lookups to dynamic DNS or known C2 domains immediately prior to the connection.",
              "Statistical Method: For each web server, establish a baseline of outbound connection volume (bytes_out), duration, and frequency. Use the interquartile range (IQR) method to identify outliers. Alert if a new connection's bytes_out or duration exceeds Q3 + 1.5 * IQR, which could indicate data exfiltration or an interactive C2 channel.",
              "Machine Learning: Train a time series forecasting model (e.g., Prophet or LSTM) on the hourly volume of outbound data from each web server. Generate an alert when the observed data volume significantly exceeds the model's predicted forecast range, indicating a potential C2 heartbeat or data transfer."
            ]
          },
          {
            "description": "A file is created or modified in a web-accessible directory by the web server process itself, or the file's characteristics (e.g., timestamp, extension) are anomalous.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application Servers",
            "action": [
              "Symbolic Logic: Correlate file modification/creation events (Windows Event ID 4663) in web directories with process creation logs (Windows Event ID 4688). Alert if the Process ID responsible for the file write corresponds to a web server process (e.g., w3wp.exe), as this indicates a web application is writing executable files.",
              "Statistical Method: Analyze file creation timestamps (from Event ID 4663) in web directories. Establish a baseline of normal deployment times (e.g., Tuesday 2-4 AM). Calculate the temporal distance of each new file creation from the nearest deployment window. Flag files created far outside these windows (e.g., > 2 standard deviations from the mean deployment time) for review.",
              "Machine Learning: Use a One-Class SVM or Isolation Forest model trained on features of legitimate files in web directories (file extension, file size, entropy, user owner). Scan new files and flag any that the model classifies as an anomaly, which could indicate a masquerading web shell."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]