[
  {
    "information_requirement": "Is the adversary maintaining persistence using Image File Execution Options?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1546.012",
        "name": "Image File Execution Options Injection",
        "evidence": [
          {
            "description": "A 'Debugger' value within an IFEO registry key is modified to an executable path whose file hash matches a known malicious hash from threat intelligence feeds, or the path itself matches a known malicious pattern.",
            "data_sources": [
              "Windows Event ID 4657",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows System Registry Hives on Domain Controllers, Critical Application Servers, and User Workstations",
            "action": [
              "Symbolic: Monitor for Windows Event ID 4657 or Sysmon Event ID 13 where the 'TargetObject' or 'Object Name' contains '\\Image File Execution Options\\'. Extract the 'New Value' which is the path to the debugger executable. Calculate the file hash of this executable and compare it against a threat intelligence feed of known malicious file hashes. Alert on any match.",
              "Statistical: For all IFEO 'Debugger' value modifications, analyze the file path of the new executable. Calculate the entropy of the filename and the depth of the directory path. Flag modifications where the filename entropy exceeds the 95th percentile of historical values or the path points to a directory (e.g., %APPDATA%, %TEMP%) with a statistically anomalous frequency for debugger executables.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features extracted from IFEO registry modifications, including the process that made the change, target executable name, debugger executable path properties (length, special characters), and debugger executable signature status. Use the model to classify each new modification as 'benign' or 'malicious'."
            ]
          },
          {
            "description": "An IFEO 'Debugger' value for a legitimate Windows executable (e.g., notepad.exe, calc.exe) is modified to an executable path located in a non-standard or user-writable directory (e.g., C:\\Users\\*, C:\\ProgramData\\*, C:\\Windows\\Temp\\*).",
            "data_sources": [
              "Windows Event ID 4657",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows System Registry Hives on User Workstations and Terminal Servers",
            "action": [
              "Symbolic: Monitor Windows Event ID 4657 or Sysmon Event ID 13 for 'Debugger' value modifications under '\\Image File Execution Options\\'. Create a watchlist of common Windows executable names. If a modification targets an executable on the watchlist, check if the new debugger path falls within a user-writable or temporary directory (e.g., C:\\Users\\, C:\\Temp\\, C:\\ProgramData\\). Alert on any such instance.",
              "Statistical: Establish a baseline of common debugger paths for legitimate applications. For each new IFEO modification, calculate the Levenshtein distance between the new debugger path and the known-good paths for that application. A high distance score, exceeding the 99th percentile of historical modifications, indicates a suspicious path.",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on process creation events (Windows Event ID 4688) that occur shortly after an IFEO modification. Features should include the parent process name, child process name, command line arguments, and user context. The model should flag process chains that are anomalous following a registry change, indicating the IFEO was triggered."
            ]
          },
          {
            "description": "The GFlags tool (gflags.exe) is executed with command-line arguments containing '/i <ImageFileName>' and '/p /enable', indicating the setting of an IFEO debugger.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Command-line logs on User Workstations, Administrator Workstations, and Software Development Environments",
            "action": [
              "Symbolic: Monitor for process creation events (Windows Event ID 4688, Sysmon Event ID 1) where the process name is 'gflags.exe'. Create a high-priority alert if the command line contains both '/i' and '/p' arguments. Correlate with the parent process; execution by non-system/non-admin processes is highly suspicious.",
              "Statistical: Build a historical frequency distribution of 'gflags.exe' executions across the enterprise, segmented by user and parent process. Any execution by a user or parent process that falls outside the 99th percentile of normal activity (i.e., is extremely rare) should be flagged for review. Calculate the rarity of the command-line argument combination.",
              "Machine Learning: Develop a time-series model to forecast expected 'gflags.exe' usage within development and testing environments. An alert is generated when the observed execution count significantly deviates from the forecasted baseline, suggesting abnormal usage potentially related to malicious activity."
            ]
          },
          {
            "description": "A legitimate Windows process (e.g., notepad.exe) spawns a child process that is not its typical debugger (e.g., ntsd.exe) but instead is a command shell (cmd.exe, powershell.exe) or an executable from a suspicious location.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process creation logs on User Workstations and Application Servers; Network flow logs at Network Egress Points",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1). Alert when a parent process from a list of common applications (e.g., notepad.exe, mspaint.exe) spawns a child process such as 'cmd.exe', 'powershell.exe', 'wscript.exe', or any executable from a non-standard path.",
              "Statistical: Establish a baseline of normal parent-child process relationships using process creation logs. Calculate the conditional probability P(Child | Parent) for all process pairs. Alert on any new or rare pair where the probability is below a defined threshold (e.g., < 0.001%), indicating a significant deviation from the norm.",
              "Machine Learning: Use a graph-based anomaly detection model on process lineage data. Represent processes as nodes and parent-child relationships as edges. The model can identify anomalous subgraphs, such as a legitimate process spawning an unusual sequence of children, which could indicate the triggering of a malicious IFEO debugger."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary escalated privileges using Image File Execution Options?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1546.012",
        "name": "Image File Execution Options Injection",
        "evidence": [
          {
            "description": "The 'Debugger' value in the IFEO registry key for a high-integrity system process (e.g., services.exe, consent.exe) is modified to point to an executable whose file hash matches known privilege escalation tools or is located in a suspicious directory.",
            "data_sources": [
              "Windows Event ID 4657",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows System Registry Hives on Domain Controllers and Privileged Access Workstations (PAWs)",
            "action": [
              "Symbolic: Monitor Windows Event ID 4657 or Sysmon Event ID 13 for modifications to 'Debugger' values for a watchlist of high-integrity processes (e.g., services.exe, taskhostw.exe, consent.exe). Extract the debugger executable path, calculate its hash, and compare it against a threat intelligence feed of malicious hashes, specifically flagging those tagged with 'privilege escalation'. Alert on any match.",
              "Statistical: For IFEO modifications targeting high-integrity processes, analyze the properties of the new debugger executable. Flag any executable that is unsigned or has a signature from an untrusted publisher. Calculate the prevalence of the signer across the environment; a signer seen on fewer than 0.1% of executables is statistically rare and suspicious in this context.",
              "Machine Learning: Train a binary classifier to predict the likelihood of a privilege escalation attempt based on IFEO modifications. Features should include the target process name, the user context of the modifying process, and properties of the new debugger executable (path, signature, entropy). A high probability score from the model triggers an alert."
            ]
          },
          {
            "description": "The 'Debugger' value in the IFEO registry key for a known accessibility application (sethc.exe, utilman.exe, osk.exe, Magnify.exe, Narrator.exe) is modified to 'cmd.exe' or 'powershell.exe'.",
            "data_sources": [
              "Windows Event ID 4657",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows System Registry Hives on all Windows Workstations and Servers, especially Remote Desktop Gateway Servers",
            "action": [
              "Symbolic: Create a zero-tolerance rule to monitor Windows Event ID 4657 or Sysmon Event ID 13 for any modification to the 'Debugger' value within the IFEO keys for 'sethc.exe', 'utilman.exe', 'osk.exe', 'Magnify.exe', or 'Narrator.exe'. If the new value contains 'cmd.exe' or 'powershell.exe', generate an immediate critical alert.",
              "Statistical: Track the frequency of modifications to these specific accessibility keys; a non-zero count is a severe anomaly. Analyze the process making the change. If the parent process is not a trusted installer (e.g., 'TrustedInstaller.exe'), the event's risk score is maximum. Calculate the rarity of the modifying process name for this specific registry path.",
              "Machine Learning: Use a supervised learning model to classify the process responsible for modifying accessibility feature IFEO keys. Train the model with features like process name, parent process, command line, and user context to identify unauthorized processes making these changes, distinguishing them from legitimate system updates."
            ]
          },
          {
            "description": "A process creation event is observed where a child process of 'cmd.exe' or 'powershell.exe' is spawned by a parent process of 'winlogon.exe' or 'logonui.exe', and the child process is running with SYSTEM integrity level.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution logs on all Windows Logon Interfaces (physical and RDP), Domain Controllers, and Terminal Servers",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1). Alert when 'cmd.exe' or 'powershell.exe' is created running as NT AUTHORITY\\SYSTEM, and the parent process is 'utilman.exe', 'sethc.exe', 'winlogon.exe', or 'logonui.exe'. This is a direct indicator of a 'sticky keys' backdoor.",
              "Statistical: Establish a baseline of processes launched during logon sequences. Profile the typical child processes of 'winlogon.exe' and 'logonui.exe'. Any deviation, such as the appearance of 'cmd.exe' or 'powershell.exe', is a statistical anomaly with a near-zero probability in a secure environment and should be alerted on.",
              "Machine Learning: Apply time-series anomaly detection to network traffic originating from a host immediately after a suspected accessibility feature abuse event. Model features like data volume, protocol distribution from Zeek conn.log, and DNS query patterns from Zeek dns.log. A sudden spike in outbound command and control traffic would be flagged as a post-exploitation anomaly."
            ]
          },
          {
            "description": "The 'Debugger' value for a high-integrity process is set to an executable that is either unsigned, has an invalid digital signature, or is located in a directory such as C:\\Users\\* or C:\\Windows\\Temp.",
            "data_sources": [
              "Windows Event ID 4657",
              "Sysmon Event ID 13",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows System Registry Hives, file systems of critical servers and workstations, and code signing certificate stores",
            "action": [
              "Symbolic: Monitor registry modifications (Sysmon Event ID 13) to IFEO keys for high-integrity processes. For each new debugger path, check the file's digital signature status via Image Load events (Sysmon Event ID 7) or on-demand scanning. Alert if the executable is unsigned, has an invalid signature, or the path matches a pattern for user-writable directories.",
              "Statistical: Maintain a statistical baseline of the locations of debugger executables. Calculate the frequency of each directory path used for debuggers. A path with a frequency below a certain threshold (e.g., seen on < 1% of systems) when used for a high-integrity process debugger is anomalous and should be investigated.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) to group hosts based on their IFEO configurations. Features can include the set of executables with debuggers, the paths of those debuggers, and their signature status. Hosts that are identified as noise/outliers may have unique, and potentially malicious, IFEO configurations that warrant investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]