[
  {
    "information_requirement": "Is the adversary attempting to gain credential access via DHCP spoofing?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1557.003",
        "name": "DHCP Spoofing",
        "evidence": [
          {
            "description": "A DHCP Offer or ACK message assigns a client a DNS server, WINS server, or default gateway IP address that is present on a current, high-confidence threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek dhcp.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing client endpoints, Core network switch SPAN/TAP ports",
            "action": [
              "Create a watch list of malicious IP addresses from a high-confidence threat intelligence feed, updated hourly. Ingest Zeek dhcp.log data and create a rule that alerts whenever an IP from the 'assigned_ip', 'dns_server', or 'routers' fields in a DHCP ACK message matches an IP on the watch list.",
              "For all IPs assigned as DNS servers or gateways via DHCP, calculate the historical rarity of each IP being assigned. Aggregate assignments by subnet and server. Flag any IP that is statistically rare for a given subnet (e.g., seen less than 0.1% of the time over the last 90 days) or is offered by a server other than the designated one for that scope.",
              "Train a decision tree classifier on labeled DHCP transaction data. Use features such as the reputation of the assigned DNS/gateway IP, the historical frequency of the offering server's MAC address, the TLD of the DNS server's reverse lookup, and whether the transaction was part of a multi-offer race condition. Deploy the model to score new DHCP transactions in real-time and alert on those classified as malicious."
            ]
          },
          {
            "description": "A DHCP Offer or ACK message originates from an IP or MAC address not on the authoritative list of approved DHCP servers for a given network segment or VLAN.",
            "data_sources": [
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DHCP Server Infrastructure, Core network switch SPAN/TAP ports, VLAN interfaces on routers and switches",
            "action": [
              "Maintain a static allow list of authorized DHCP server MAC and IP addresses for each VLAN/subnet. Create a rule to analyze Zeek dhcp.log and alert on any DHCP Offer/ACK message where the 'server_mac' or 'server_ip' is not on the allow list for the client's network segment.",
              "Profile the volume of DHCP offers per server MAC address over time for each network segment. An unauthorized server will introduce a new MAC address with a sudden, non-zero count. Alert on any new, un-baselined 'server_mac' appearing in dhcp.log and generating offers.",
              "Use a clustering algorithm (e.g., DBSCAN) on DHCP server attributes (MAC vendor OUI, IP address, subnets served, lease times offered). A rogue server will likely form a new, small cluster or be flagged as a noise point, distinct from the established clusters of legitimate servers."
            ]
          },
          {
            "description": "A single DHCP transaction ID, associated with a single client MAC address, receives DHCP Offer messages from more than one unique server IP address within a 2-second window.",
            "data_sources": [
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint subnets, Core network switch SPAN/TAP ports",
            "action": [
              "Create a rule to trigger if a single 'trans_id' in Zeek dhcp.log is associated with DHCP Offer messages from more than one unique 'server_ip' within a 2-second window. The alert should contain both client and server details.",
              "Calculate the frequency distribution of the number of offers per transaction ID across the entire network. The vast majority of transactions should have exactly one offer. Set a percentile-based threshold (e.g., 99.9th percentile) and alert on any transaction ID exceeding this count, which indicates a DHCP race condition.",
              "Apply a time-series anomaly detection model to the count of unique servers per transaction ID. A sudden spike in the rate of transactions with more than one server is an anomaly that the model should flag, indicative of a new rogue server attempting to race the legitimate one."
            ]
          },
          {
            "description": "The authoritative DHCP server logs a sudden and anomalous spike in error events related to IP address pool exhaustion, such as Windows Event ID 1020 or 1063.",
            "data_sources": [
              "Windows Event ID 1020",
              "Windows Event ID 1063",
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative DHCP servers",
            "action": [
              "Create a high-severity alert rule that triggers immediately on the presence of Windows Event ID 1020 ('Scope is full') or 1063 ('DHCP Service is low on available addresses') from a production DHCP server.",
              "Establish a baseline of the rate of DHCP DISCOVER messages in Zeek dhcp.log per subnet. Alert if the rate for any subnet exceeds a dynamic threshold (e.g., 5 standard deviations above the 30-day moving average for that hour of the day/day of the week).",
              "Use a time-series forecasting model (e.g., ARIMA) to predict the expected number of available IP addresses in each DHCP scope throughout the day. Alert when the actual number of available addresses drops significantly below the forecasted value's confidence interval, indicating an anomalous exhaustion event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to collect data via DHCP spoofing?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1557.003",
        "name": "DHCP Spoofing",
        "evidence": [
          {
            "description": "A client makes a network connection to a known malicious IP address or resolves a malicious domain within 15 minutes of receiving a new DHCP lease.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek dhcp.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, Endpoint subnets",
            "action": [
              "For each client IP that receives a new DHCP lease, monitor its subsequent outbound connections (Zeek conn.log) and DNS queries (Zeek dns.log) for the next 15 minutes. Alert if any destination IP or resolved domain matches a threat intelligence feed.",
              "For each client, calculate the Jaccard similarity score between the set of domains it queried in the hour before a new lease and the hour after. A low similarity score (e.g., less than 0.2) combined with a high number of new domains indicates a significant change in behavior. Alert on such deviations.",
              "Train a classifier to identify C2 beaconing using features from Zeek logs (connection duration, data volume, periodicity, JA3/JA3S hashes). Apply this model to all network traffic originating from clients that have recently obtained a DHCP lease from a server flagged as suspicious by other detections."
            ]
          },
          {
            "description": "Authentication credentials, such as NTLM hashes or cleartext passwords, are observed in unencrypted network traffic (e.g., HTTP, FTP) destined for an unauthorized or suspicious server.",
            "data_sources": [
              "Zeek http.log",
              "Zeek smb_cmd.log",
              "Zeek ftp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, Application server segments, Authentication servers",
            "action": [
              "Create a rule to scan Zeek http.log for 'Authorization: Basic' headers, ftp.log for 'PASS' commands, and smb_cmd.log for NTLM authentication attempts directed at any IP not on the allow list of approved authentication servers. Alert on any match.",
              "Profile the typical protocols used for authentication traffic between client subnets and server resources. Alert if there is a statistically significant increase in the volume of unencrypted authentication protocols (HTTP, FTP) to servers that typically use encrypted protocols (HTTPS, SFTP).",
              "Use unsupervised learning to cluster network sessions based on features like protocol, port, packet size distribution, and presence of authentication-related keywords from protocol logs. A cluster representing cleartext authentication to an unusual or previously unseen server IP should be flagged as a high-risk anomaly."
            ]
          },
          {
            "description": "A client's outbound internet traffic is routed through an IP address that is not the authorized default gateway for its network segment.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, Network Egress Points, Router flow data sources",
            "action": [
              "Maintain a mapping of subnets to their authorized default gateway IP addresses. Analyze Zeek conn.log and alert on any connection from a client to an external destination where the traffic is not routed through the designated gateway for that client's subnet.",
              "For each subnet, baseline the distribution of gateway IPs used by clients. Alert if more than a small percentage (e.g., >1%) of clients in a subnet begin using a new, non-standard gateway IP within a short time frame (e.g., 1 hour).",
              "Model the network graph where nodes are clients/servers and edges are connections. Use a community detection algorithm to identify normal traffic patterns. A rogue gateway will appear as a new, anomalous 'bridge' node, redirecting traffic from an existing community to an external entity, altering the graph structure. Flag such structural changes."
            ]
          },
          {
            "description": "A client exhibits anomalous DNS resolution patterns after receiving a new DHCP lease, such as a high rate of NXDOMAIN responses or an unusually high query entropy.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Resolvers, Endpoint subnets, Network Egress Points",
            "action": [
              "Create a rule to alert if, after receiving a new DHCP lease, a client's DNS queries result in an NXDOMAIN rate exceeding a static threshold (e.g., >50% of queries in 5 minutes), which can indicate a malicious DNS server forcing fallback to interceptable name resolution protocols.",
              "For each client host, establish a baseline for DNS query patterns, including query volume, NXDOMAIN rate, and the Shannon entropy of queried second-level domains. Alert if any of these metrics deviates by more than 3 standard deviations from its baseline within an hour after a new lease is acquired.",
              "Employ an autoencoder trained on benign DNS traffic features (query length, entropy, TLD distribution, query type). Feed post-lease DNS traffic into the model and alert when the reconstruction error exceeds a learned threshold, indicating the traffic is anomalous and does not conform to the user's normal activity profile."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]