[
  {
    "information_requirement": "Is the adversary maintaining persistence through manipulation of hybrid identities?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.007",
        "name": "Hybrid Identity",
        "evidence": [
          {
            "description": "The file hash of a DLL loaded by the AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA (AzureADConnectAuthenticationAgentService.exe) service process matches a known malicious hash.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: On AD FS and PTA servers, monitor process creation (Windows Event ID 4688) and image load events (Sysmon Event ID 7). Extract file hashes of all DLLs loaded by 'Microsoft.IdentityServer.Servicehost.exe' and 'AzureADConnectAuthenticationAgentService.exe'. Match these hashes against a threat intelligence feed of known malicious authentication backdoors (e.g., MagicWeb).",
              "Statistical: For the AD FS and PTA service processes, establish a baseline of all normally loaded DLLs and their file paths. Calculate the frequency of each DLL being loaded across all monitored servers. Alert on the loading of a DLL that has never been seen before or has a frequency score in the bottom 1st percentile (i.e., is extremely rare).",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using features from loaded DLLs, such as entropy, presence of a valid signature, file path rarity, and import function names. Use the model to score each newly loaded DLL for maliciousness, alerting on scores above a predefined confidence threshold."
            ]
          },
          {
            "description": "The AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA (AzureADConnectAuthenticationAgentService.exe) service process loads a DLL that is either not digitally signed or originates from a non-standard directory (e.g., not C:\\Windows\\System32 or the program's installation directory).",
            "data_sources": [
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: Create a rule to alert whenever 'Microsoft.IdentityServer.Servicehost.exe' or 'AzureADConnectAuthenticationAgentService.exe' loads a DLL (Sysmon Event ID 7) where the 'Signed' field is 'false' or the 'SignatureStatus' is not 'Valid'.",
              "Statistical: Profile the file paths of all DLLs loaded by AD FS and PTA services. Calculate the Shannon entropy of the file path strings and their parent directory paths. Alert on any loaded DLL where the path entropy is in the top 98th percentile, suggesting an attempt to obfuscate its location in a deep or randomized directory structure.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on the features of loaded DLLs (path, signer, parent process). Identify clusters of normal behavior. Flag any loaded DLL that is classified as a noise point or outlier by the model, indicating it does not conform to established patterns of legitimate module loading."
            ]
          },
          {
            "description": "A write operation or permission change occurs on a critical AD FS/PTA configuration file (e.g., Microsoft.IdentityServer.Servicehost.exe.config), executable, or associated registry key by an unauthorized user or process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Sysmon Event ID 11",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: Configure and monitor SACLs (via Windows Event ID 4663, 4657) on critical files (e.g., %windir%\\ADFS\\Microsoft.IdentityServer.Servicehost.exe.config) and registry keys. Create an alert that triggers on any write access or modification event not originating from a whitelisted administrative account or the SYSTEM account.",
              "Statistical: Establish a baseline for the frequency of modifications to AD FS/PTA configuration files and registry keys, segmented by time of day and day of week. Alert if the number of modifications in a 1-hour window exceeds 3 standard deviations from the historical average, particularly outside of known maintenance windows.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) to predict the normal volume of configuration change events. Generate an alert when the observed volume of events significantly deviates from the forecasted volume, indicating a potential burst of unauthorized activity."
            ]
          },
          {
            "description": "A new scheduled task or service is created on an AD FS/PTA server with characteristics indicative of malicious persistence, such as a suspicious name, execution of code from a temporary directory, or high-privilege execution context.",
            "data_sources": [
              "Windows Event ID 4698",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: Monitor for the creation of new services (Windows Event ID 7045) or scheduled tasks (Windows Event ID 4698). Trigger an alert if the 'Service File Name' or 'Command' field contains paths pointing to temporary locations (e.g., C:\\Temp, C:\\Users\\*) or invokes suspicious tools like 'powershell.exe' with encoded commands.",
              "Statistical: Profile the names of all scheduled tasks and services on AD FS/PTA servers. Calculate the character-level entropy for each name. Alert on the creation of a new task or service whose name has an entropy score in the top 99th percentile, indicating a likely machine-generated or randomized name.",
              "Machine Learning: Train a classification model to distinguish between legitimate and malicious scheduled tasks/services. Use features such as the executable path, command-line arguments, user account context, and task name. Deploy the model to score all new tasks/services and alert on those classified as malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by modifying hybrid identity authentication?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.007",
        "name": "Hybrid Identity",
        "evidence": [
          {
            "description": "Command-line execution on an AD FS/PTA server includes strings associated with disabling security tools or clearing logs, such as 'wevtutil cl', 'auditpol /clear', or 'Set-EventLogLevel -Level 0'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: Create a detection rule that searches command-line logs (Windows Event ID 4688) for exact string matches or regular expressions of known defense evasion commands, such as 'wevtutil.exe cl', 'auditpol.exe', 'Clear-EventLog', or disabling firewall rules.",
              "Statistical: Establish a baseline of all command-line tools executed by administrative users on AD FS/PTA servers. Calculate the rarity of each command. Alert when a command with a rarity score in the bottom 5th percentile (i.e., very infrequent) is executed, especially if it relates to system configuration or logging.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to learn common sequences of administrator commands. Flag any command sequence that has a very low probability of occurring based on the learned model, as it may represent an adversary attempting novel or unusual evasion tactics."
            ]
          },
          {
            "description": "A successful AD FS token issuance event is observed for a user account that is configured to require MFA, but no preceding MFA success event is logged for that user's session within a defined time window.",
            "data_sources": [
              "AD FS Event ID 1200",
              "AD FS Event ID 501"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Security Information and Event Management (SIEM) Platform",
            "action": [
              "Symbolic: For each successful AD FS token issuance (Event ID 501), correlate by session ID or username and timestamp to look for a preceding MFA success event (e.g., Event ID 1200). If the user is in an MFA-required group and no MFA event is found within the last 5 minutes, trigger an alert.",
              "Statistical: For each user, calculate their historical ratio of successful logins to MFA challenges. Establish a personal baseline. Alert if a user has a successful login and their MFA challenge ratio for the past hour drops more than 50% below their 30-day baseline, indicating a possible bypass.",
              "Machine Learning: Use a state machine or sequence analysis model to learn the valid state transitions for an authentication flow (e.g., Start -> Credential Validation -> MFA Challenge -> MFA Success -> Token Issued). Alert on any observed authentication flow that violates the learned state transition rules, such as jumping directly from Credential Validation to Token Issued."
            ]
          },
          {
            "description": "Aggregate authentication metrics show a statistically significant anomaly, such as a sudden drop in the overall MFA success rate or an unusual spike in authentications from a geographically rare location.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Network Gateway (for Zeek), SIEM Platform",
            "action": [
              "Symbolic: Enrich successful login events (Windows Event ID 4624) with geolocation data from the source IP (Zeek conn.log). Create a rule to alert on any successful authentication from a country on a 'high-risk' or 'never-travel' list.",
              "Statistical: Calculate a 30-day rolling baseline of successful authentications per source country. Alert if the number of successful logins from any single country in a 1-hour period exceeds the 99th percentile of its historical baseline, indicating a potential password spray or bypass from an unusual location.",
              "Machine Learning: Apply time-series anomaly detection (e.g., using Seasonal Hybrid ESD) to the total volume of successful logins and the total volume of MFA challenges. Alert when an anomaly is detected in either series, or when the two series show a significant divergence from their historically correlated pattern."
            ]
          },
          {
            "description": "A process other than a whitelisted administrative or system process reads a critical AD FS/PTA configuration file, secret, or private key, especially outside of standard maintenance hours.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: Enable and monitor file access auditing (Windows Event ID 4663) on AD FS private key files and configuration files. Alert if the 'Process Name' field is not in a whitelist of approved processes (e.g., 'Microsoft.IdentityServer.Servicehost.exe', 'mmc.exe') and the access mask includes 'ReadData'.",
              "Statistical: Profile the user accounts and processes that normally read AD FS/PTA configuration files. Create a baseline of this activity. Alert if a user account or process that has never accessed these files before (or has a historical access frequency in the bottom 1st percentile) performs a read operation.",
              "Machine Learning: Use a one-class SVM (Support Vector Machine) trained on legitimate file access patterns (process name, username, time of day). Use the trained model to identify any file read access event that is a significant outlier from normal administrative or system behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary accessing credentials via manipulated hybrid identity processes?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.007",
        "name": "Hybrid Identity",
        "evidence": [
          {
            "description": "An AD FS or PTA server initiates an outbound network connection to a destination IP address or resolves a domain name that is present on a current threat intelligence feed for C2 servers or droppers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA), Network Egress Points",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) originating from AD FS/PTA server IPs. Match the destination IP or queried domain against a high-confidence threat intelligence feed. Generate a high-severity alert on any match.",
              "Statistical: For each AD FS/PTA server, create a baseline of all destination IPs and domains contacted over a 30-day period. Calculate the rarity of each destination. Alert on any new connection to a destination that has never been seen before and has a low reputation score from an external service.",
              "Machine Learning: Train a classification model to predict if a DNS query is a Domain Generation Algorithm (DGA) domain. Use features like query length, character entropy, and n-gram frequency. Apply this model to all DNS queries (Zeek dns.log) from AD FS/PTA servers and alert on any query classified as DGA."
            ]
          },
          {
            "description": "The AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA (AzureADConnectAuthenticationAgentService.exe) process spawns a child process, and the child process name or command line contains strings indicative of credential dumping (e.g., 'procdump', 'lsass.exe', 'sekurlsa::logonpasswords').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) where the parent process is 'Microsoft.IdentityServer.Servicehost.exe' or 'AzureADConnectAuthenticationAgentService.exe'. Create a regex-based rule to alert if the child process command line contains keywords like 'procdump', 'mimikatz', 'sekurlsa', or 'comsvcs.dll MiniDump'.",
              "Statistical: Establish a baseline of all child processes ever spawned by the AD FS and PTA services. This baseline should be empty or extremely small. Alert on *any* child process creation from these parent processes, as it is highly anomalous behavior.",
              "Machine Learning: Use a topic modeling algorithm (e.g., Latent Dirichlet Allocation) on a corpus of benign command-line arguments. For any new command line spawned by AD FS/PTA, if the model assigns it to a rare or non-existent topic, flag it as anomalous and potentially malicious."
            ]
          },
          {
            "description": "A process that is not the operating system kernel or a known debugging tool requests 'PROCESS_VM_READ' access to the memory space of the AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA (AzureADConnectAuthenticationAgentService.exe) process.",
            "data_sources": [
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Symbolic: Enable and monitor Sysmon Event ID 10 for process access events. Create a rule to alert when the 'TargetImage' is 'Microsoft.IdentityServer.Servicehost.exe' or 'AzureADConnectAuthenticationAgentService.exe' and the 'GrantedAccess' code includes '0x1010' (PROCESS_VM_READ and PROCESS_QUERY_INFORMATION), and the 'SourceImage' is not a whitelisted process.",
              "Statistical: Profile all processes that legitimately access the memory of the AD FS/PTA services. Alert when a process that has never been observed before (or is in the bottom 1st percentile of access frequency) performs a memory access operation, as this is highly irregular.",
              "Machine Learning: Train a one-class classification model (e.g., Isolation Forest) on features of legitimate process access events (SourceImage, TargetImage, time of day). Use the model to score all new access events and alert on any event flagged as an outlier, indicating it does not fit the pattern of normal system operation."
            ]
          },
          {
            "description": "A temporal correlation is observed between a burst of successful user authentications on an AD FS/PTA server and a subsequent outbound network connection from the same server involving a significant data payload.",
            "data_sources": [
              "Zeek conn.log",
              "AD FS Event ID 501"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA), Network Egress Points, SIEM Platform",
            "action": [
              "Symbolic: Create a correlation rule that triggers if an outbound connection from an AD FS/PTA server (from Zeek conn.log) with a payload size > 1MB occurs within 60 seconds of a successful AD FS token issuance event (AD FS Event ID 501) on the same server.",
              "Statistical: For each 5-minute window, calculate the volume of successful authentications and the volume of outbound data from AD FS/PTA servers. Calculate the Pearson correlation coefficient between these two time series. Alert if the correlation suddenly spikes into a highly positive value (e.g., > 0.8) after being historically low.",
              "Machine Learning: Use a Granger causality test to determine if the time series for successful authentications is a useful predictor of the time series for outbound data volume. If a causal relationship is detected where one was not previously present, this indicates a new, suspicious linkage between the events, warranting an investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]