[
  {
    "information_requirement": "Has the adversary accessed credentials stored in Group Policy Preferences?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1552.006",
        "name": "Group Policy Preferences",
        "evidence": [
          {
            "description": "A process is created with a command line, process name, or file hash matching a known GPP credential dumping tool (e.g., Get-GPPPassword, gpprefdecrypt.py).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, User Workstations",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688). Alert if `NewProcessName` or `CommandLine` contains known GPP tool strings (e.g., 'Get-GPPPassword', 'gpprefdecrypt.py', 'Gpp-Decrypt.ps1', 'gpp-dump') or if the process hash matches a known malicious hash.",
              "Statistical: For processes originating from interactive sessions that access the SYSVOL share, calculate the entropy of the process name. A high entropy score, compared to the 95th percentile of process name entropy for the host, may indicate a randomly named or packed malicious binary.",
              "Machine Learning: Use a trained classification model (e.g., Random Forest, Gradient Boosting) to predict if a process is malicious. Features for the model should include parent process, command-line arguments, user context, and file path. A process classified as malicious with high confidence that also accesses the network path `\\\\<DOMAIN>\\SYSVOL\\` should be escalated."
            ]
          },
          {
            "description": "A command-line execution is observed that uses a utility (e.g., `findstr`, `grep`, `Select-String`) to search for the string 'cpassword' within XML files located in the SYSVOL share.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SYSVOL share access logs from endpoints",
            "action": [
              "Symbolic: Using process creation logs (Windows Event ID 4688), search for command lines containing a regular expression pattern like `.*(findstr|grep|Select-String).*cpassword.*\\\\\\\\SYSVOL\\\\.*\\\\.xml`.",
              "Statistical: Establish a baseline of command-line argument frequency per user. Alert when a user executes a command where the combination of arguments (e.g., `findstr` + `cpassword` + `SYSVOL`) is rare for that user or their peer group, falling below the 5th percentile of historical command patterns.",
              "Machine Learning: Implement a time-series analysis on the frequency of `findstr` or `Select-String` commands that target the SYSVOL path. An anomaly detection model (e.g., ARIMA, LSTM) can flag sudden spikes in this specific activity, which may indicate a discovery script being run."
            ]
          },
          {
            "description": "A user or host accesses GPP XML files (e.g., Groups.xml, Services.xml) in the SYSVOL share, where this access pattern is a deviation from established baselines of normal activity.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network traffic to Domain Controllers",
            "action": [
              "Symbolic: Create a watchlist of non-administrative users and critical servers. Generate an alert if any user or host on this watchlist is observed accessing GPP-related XML files (e.g., `Groups.xml`, `Services.xml`, `ScheduledTasks.xml`) within the SYSVOL share, as recorded in Windows Event ID 4663/5145 or Zeek smb_files.log.",
              "Statistical: For each user, build a statistical baseline of normal file access activity on the SYSVOL share (frequency, files accessed, time of day). Alert when a user's access to GPP XML files exceeds 3 standard deviations from their own or their peer group's baseline mean access frequency.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means, DBSCAN) to group users based on their SMB access patterns to the SYSVOL share. An alert is generated when a user's activity causes them to shift from a 'low-interaction' cluster to a 'high-interaction' or 'GPP-focused' cluster, indicating a significant change in behavior."
            ]
          },
          {
            "description": "A user or host performs a broad enumeration of the SYSVOL directory, immediately followed by targeted read access to one or more GPP XML files within a short time window.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller event logs, Endpoint process and file access logs",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a single `Source Network Address` (from Event ID 5145) generates more than 100 directory listing events (`Accesses: ReadData (or ListDirectory)`) on the SYSVOL share, followed within 5 minutes by a read access event (`Accesses: ReadData`) for `Groups.xml` or `Services.xml` from the same source.",
              "Statistical: Calculate the rate of file access events per minute for each user on the SYSVOL share. A user whose access rate spikes into the 99th percentile of all user access rates and then immediately drops to a low rate of targeted reads on XML files should be flagged as suspicious.",
              "Machine Learning: Employ a sequence analysis model (e.g., a Hidden Markov Model) trained on benign administrative access patterns to SYSVOL. The model would identify sequences of events (directory enumeration -> file read) that deviate significantly from the learned 'normal' administrative workflow, flagging them as anomalous."
            ]
          },
          {
            "description": "Any access attempt (read, modify, or denied) is recorded against a purpose-built honeypot GPP XML file located in a SYSVOL policy directory.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "A specific Group Policy directory on the SYSVOL share of all Domain Controllers",
            "action": [
              "Symbolic: Deploy a canary file (e.g., `_honey_credentials.xml`) with a SACL to audit all access. Create a high-priority alert that triggers on any Windows Event ID 4663 where `Object Name` matches the full path to the canary file and the `SubjectUserName` is not on a pre-approved list of security tools or personnel.",
              "Statistical: While any single access is an alert, profile the source of access attempts over time. If multiple distinct internal IP addresses access the canary file within a 24-hour period, elevate the incident priority, as this may indicate a widespread, automated script rather than a single curious user, placing the event in the 100th percentile of expected activity (which is zero).",
              "Machine Learning: Use a one-class SVM (Support Vector Machine) model trained exclusively on 'no-access' data for the canary file. Any data point (i.e., any access event) will, by definition, be an outlier and be classified as an anomaly, providing an automated and robust alerting mechanism."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]