[
  {
    "information_requirement": "Has the adversary accessed private cryptographic keys or certificates? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1552.004",
        "name": "Private Keys",
        "evidence": [
          {
            "description": "A process, identified by its file hash, matches a known credential theft tool that targets private keys.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations, Domain Controllers, Application servers hosting cryptographic services",
            "action": [
              "Symbolic: Continuously monitor process creation events (Windows Event ID 4688). Compute or retrieve the SHA256 hash of the executable file for each new process and match it against a curated threat intelligence list of known malicious tool hashes (e.g., specific versions of Mimikatz, LaZagne, SharpDPAPI) that target private keys. An exact match generates a high-severity alert.",
              "Statistical: For processes not on the known-bad hash list, analyze parent-child process relationships. Calculate the baseline frequency of parent processes (e.g., explorer.exe, services.exe) spawning specific children. Flag any process execution where the parent-child relationship is statistically rare (e.g., winword.exe spawning powershell.exe), falling below a 5th percentile frequency threshold for that parent-child pair.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from process execution events, such as process name entropy, command-line length, parent process name, and file path. The model should be trained on labeled data of benign and malicious process executions. Use the model to classify new process events in real-time to identify suspicious activity that may not match known hashes but exhibits malicious characteristics."
            ]
          },
          {
            "description": "The command-line arguments of a common system utility (e.g., find, grep, PowerShell, certutil) contain patterns indicative of searching for, copying, or exporting private key files.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers, Code repositories, Developer workstations",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) and apply a set of regular expressions to the CommandLine field to detect patterns associated with key discovery and export. Examples: '(find|grep).*(.key|.pem|.pfx)', '(gci|Get-ChildItem).*-Include.*(.pem|.key)', 'certutil.*-exportPFX'. An alert is generated on any regex match.",
              "Statistical: For all command-line invocations, calculate the Shannon entropy of the command-line string. Establish a baseline entropy score for common processes (e.g., powershell.exe, cmd.exe). A command line with an unusually high entropy score (e.g., exceeding the 95th percentile for that process) may indicate obfuscated or complex commands and should be flagged for review.",
              "Machine Learning: Use a Natural Language Processing (NLP) model, such as a Bag-of-Words or TF-IDF vectorizer followed by a logistic regression classifier, trained on a large dataset of benign and malicious command lines. This model can learn to identify suspicious combinations of commands, arguments, and flags that go beyond simple regex matching, providing a score for the likelihood of malicious intent for each executed command."
            ]
          },
          {
            "description": "A non-standard process or a user context with no legitimate need accesses sensitive private key files or directories.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting user home directories, Public Key Infrastructure (PKI) servers, Web servers with SSL/TLS certificates, Developer workstations with SSH keys",
            "action": [
              "Symbolic: Enable and monitor System Access Control Lists (SACLs) to generate Windows Event ID 4663 for read access ('Accesses: ReadData') on critical key directories (e.g., 'C:\\Users\\*\\.ssh\\', 'C:\\ProgramData\\Microsoft\\Crypto\\RSA\\MachineKeys\\') and file types (*.key, *.pem, *.pfx). Maintain an allowlist of legitimate processes (e.g., httpd.exe, sshd.exe) and user accounts authorized to access these files. Alert on any access by a process or user not on the allowlist.",
              "Statistical: For each monitored key file/directory, establish a baseline of access frequency per user and process. Calculate the mean and standard deviation of access counts over a rolling 30-day window. An alert is triggered if a user or process accesses a key file at a frequency exceeding 3 standard deviations from its established mean, indicating potential mass collection.",
              "Machine Learning: Implement an unsupervised anomaly detection model, such as an Isolation Forest or One-Class SVM, on file access events (Event ID 4663). Features can include the process name, user account, time of day, and target file path. The model learns the pattern of 'normal' access and flags any access event that it identifies as a significant outlier, without requiring pre-defined rules or allowlists."
            ]
          },
          {
            "description": "A single user or process accesses an anomalously high number of distinct private key files across the environment within a short time frame.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise-wide file systems, Centralized certificate stores, Distributed developer workstations",
            "action": [
              "Symbolic: Create a rule that triggers if a single 'SubjectUserName' or 'ProcessName' from Windows Event ID 4663 events is observed accessing more than a hard-coded threshold (e.g., 10) of unique files with extensions .key, .pem, .pfx, or .ppk across one or more hosts within a 5-minute window.",
              "Statistical: For each user, calculate a moving average and standard deviation of the number of unique key files accessed per hour. Trigger an alert if the count in the current hour exceeds the 99th percentile of that user's historical distribution. This adapts the threshold to each user's normal behavior (e.g., a PKI admin will have a higher baseline than a sales user).",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) for each user/process that regularly accesses key files. The model predicts the expected number of file accesses for the next time interval. An alert is generated when the actual number of accesses significantly deviates from the model's prediction and its confidence interval, indicating a sudden change in behavior indicative of collection."
            ]
          },
          {
            "description": "A successful certificate-based authentication event exhibits multiple anomalous properties simultaneously, such as originating from a rare geographic location, a new device, or a source IP never before associated with the user's certificate.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek ssh.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory), VPN concentrators, SSH jump boxes/bastion hosts, Network perimeter gateways",
            "action": [
              "Symbolic: For every successful certificate-based login (e.g., Windows Event ID 4624 Logon Type 3; Zeek ssh.log where auth_success is true), check if the source IP address is on a deny-list of known malicious IPs or anonymizing proxies (e.g., TOR exit nodes). Generate an alert on any match.",
              "Statistical: For each user account, build a historical profile of successful authentication attributes including the set of source countries, source ISPs/ASNs, and source device hostnames. For each new login, assign a risk score. A login from a country never seen before for that user adds +3, a new ISP adds +2. A cumulative score exceeding a threshold (e.g., 4) triggers an investigation.",
              "Machine Learning: Develop an unsupervised clustering model (e.g., DBSCAN) on historical login data, using features like source IP geolocation (latitude/longitude), time of day, and client software string (from Zeek logs). This will group 'normal' login behaviors into clusters. A new login that does not fall into any existing cluster for that user is flagged as a novelty-based anomaly, representing a significant deviation from all past established patterns."
            ]
          },
          {
            "description": "A correlated sequence of events occurs on a host: 1) mass-reading of key files, 2) creation of an archive file, and 3) an anomalous outbound network connection.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints and servers (for process/file activity), Network egress points (for exfiltration traffic)",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when the following sequence is observed from the same hostname within a 10-minute window: 1) >5 file read events (Event ID 4663) for files matching '*.key' or '*.pem', followed by 2) a process creation event (Event ID 4688) for an archiving utility (e.g., tar, zip, 7z.exe), followed by 3) a network connection (Zeek conn.log) to an external IP on a non-standard port or to a newly observed domain.",
              "Statistical: Monitor the rate of file reads (Event ID 4663) for key files per host. If the rate exceeds the 98th percentile for that host, begin monitoring for archive creation (Event ID 4688). If an archive is created, analyze the size of the subsequent outbound connection (Zeek conn.log 'orig_bytes' field). If the outbound data volume is within +/- 20% of the newly created archive's size and occurs within 5 minutes, flag it as a high-confidence staging and exfiltration event.",
              "Machine Learning: Use a Hidden Markov Model (HMM) to detect the 'collect -> compress -> exfiltrate' attack chain. The model's states would be 'Normal Activity', 'Key Access', 'Archiving', and 'Exfiltration'. Transitions between these states are triggered by corresponding log events (Event 4663, Event 4688, Zeek conn.log). The model calculates the probability of observing a sequence of events given the trained attack pattern, and flags sequences that have a high probability of being malicious."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]