[
  {
    "information_requirement": "Is the adversary attempting to steal credentials from web browsers?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1555.003",
        "name": "Credentials from Web Browsers",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable's file hash matches a known credential theft tool signature, or a network connection is made from an endpoint to a destination IP or domain known to be associated with credential theft malware C2 infrastructure.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, servers with interactive logins, and network egress points.",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for process creation. For each new process, calculate the executable's file hash and join against a threat intelligence feed of known credential theft tool hashes (e.g., LaZagne, Mimikatz, WebBrowserPassView). Simultaneously, monitor Zeek conn.log for outbound connections and join destination IPs/domains against a C2 threat intelligence feed. Alert on any match.",
              "Statistical: Analyze Zeek conn.log data for connections to newly observed domains (NODs) or domains with a low prevalence score across the enterprise. Correlate these connections with preceding process creation events (Windows Event ID 4688) on the source host. A connection to a domain seen by less than the 1st percentile of endpoints, occurring within 5 minutes of an unusual process launch, should be flagged for review.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA) on the volume and frequency of outbound connections per host from Zeek conn.log. A significant deviation from the predicted traffic pattern, particularly a spike in connection count or data volume that exceeds the 99th percentile of forecast error and follows a process creation event (Windows Event ID 4688), indicates potential C2 communication and should generate an alert."
            ]
          },
          {
            "description": "A command line execution or PowerShell script block is recorded containing specific keywords, functions, or file paths associated with accessing and decrypting browser credentials.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers with PowerShell v5+ logging enabled.",
            "action": [
              "Symbolic: Create a SIEM rule to search Windows Event ID 4688 command lines and Event ID 4104 script blocks for regular expressions matching credential theft patterns. This includes file paths like 'AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data', PowerShell commands like 'Copy-Item' targeting these paths, and API calls like '[System.Security.Cryptography.ProtectedData]::Unprotect'.",
              "Statistical: Calculate the Shannon entropy score for all command line arguments (Event ID 4688) and PowerShell script blocks (Event ID 4104). Establish a baseline entropy score for common commands. An entropy score exceeding the 98th percentile, especially in commands spawned by non-interactive shells, indicates potential obfuscation and should be flagged.",
              "Machine Learning: Develop a classification model (e.g., Logistic Regression) trained on a labeled dataset of benign and malicious PowerShell script blocks (Event ID 4104). Features should include script block length, presence of specific keywords (e.g., 'Unprotect', 'logins.json'), character frequency distribution, and the entropy score. Use the model to classify new script blocks in real-time and alert on those classified as malicious with a high probability score."
            ]
          },
          {
            "description": "An unauthorized or unusual process (not the browser itself) reads browser credential database files (e.g., Chrome 'Login Data', Firefox 'logins.json').",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on all user workstations and servers, specifically within user profile directories containing browser data.",
            "action": [
              "Symbolic: First, configure System Access Control Lists (SACLs) on browser credential store files (e.g., '*\\Login Data', '*\\logins.json') to generate Windows Event ID 4663 for read access. Create a SIEM rule that alerts whenever a process name in an Event ID 4663 log for these files does not match a pre-defined whitelist of legitimate browsers (e.g., 'chrome.exe', 'firefox.exe', 'msedge.exe').",
              "Statistical: For all processes that access browser credential files (Event ID 4663), create a frequency table of the process names over a 30-day rolling window. Calculate the rarity of each process access event. An access event by a process that falls below the 5th percentile of frequency (i.e., is extremely rare, such as 'cscript.exe') should generate a medium-priority alert.",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on features extracted from Event ID 4663 and parent process data (from Event ID 4688). Features should include the process name, parent process name, and time of day. The model will learn normal access patterns and flag any combination of features that it identifies as a significant anomaly."
            ]
          },
          {
            "description": "A process makes a copy of a browser's credential or profile database to another location before reading it, indicating an attempt to bypass file-locking mechanisms.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Temporary file locations (e.g., C:\\Windows\\Temp, C:\\Users\\Public, %APPDATA%\\Temp) and user profile directories on all Windows endpoints.",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Event ID 4688) with a command line indicating a file copy (e.g., 'copy', 'xcopy', 'Copy-Item') has a source argument matching a browser credential file path (e.g., '*\\User Data\\*\\Login Data') and a destination in a staging directory. This is a high-confidence indicator.",
              "Statistical: Profile file creation activity in common staging directories (e.g., C:\\Windows\\Temp). Analyze the distribution of file extensions. A file creation event where the file extension is unusual for the directory (e.g., '.db', '.json', '.sqlite') and the file size is consistent with a browser credential store (typically < 5MB) should be flagged. This can be identified by flagging files with extensions falling outside the 95th percentile of normal activity for that directory.",
              "Machine Learning: Develop a sequence analysis model (e.g., a Hidden Markov Model) to detect the specific chain of events: 1) Process A executes a copy command on a browser credential file (Event ID 4688). 2) A new file is created in a staging area. 3) Process A (or a child) reads the new file (Event ID 4663). The model can learn the probabilities of this sequence occurring and alert when the full malicious chain is observed."
            ]
          },
          {
            "description": "A process reads a browser credential store file, and shortly thereafter, the same process or a child process initiates an outbound network connection to an unusual destination.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, firewalls, and host-level network traffic on all endpoints.",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when: (1) an Event ID 4663 is logged for read access to a browser credential file by a non-browser process, and (2) within 2 minutes, a Zeek conn.log entry shows the same source host initiating a connection to a destination IP/domain present on a threat intelligence feed of known malicious infrastructure.",
              "Statistical: For each event where a non-browser process reads a credential file (Event ID 4663), analyze the subsequent network connections from that host in Zeek conn.log. Calculate the prevalence of the destination domain across the enterprise over the last 30 days. If the destination domain has been visited by less than 0.5% of all endpoints (i.e., it is in the bottom 0.5 percentile of domain popularity), flag the connection as suspicious exfiltration.",
              "Machine Learning: Implement a time-series anomaly detection model on the bytes sent ('orig_bytes') per host from Zeek conn.log. When a credential access event (Event ID 4663) is detected, monitor this time-series for the specific host. If an anomalous spike in outbound data volume is detected that exceeds a dynamically calculated threshold (e.g., 3 standard deviations above the rolling average) within 5 minutes of the access event, generate a high-priority alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]