[
  {
    "information_requirement": "Are adversaries using bind mounts to hide processes or files from standard inspection tools? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.013",
        "name": "Bind Mounts",
        "evidence": [
          {
            "description": "Execution of the 'mount' command with command-line arguments '--bind', '-o bind', or '-B', recorded in process execution logs, particularly when targeting the /proc filesystem.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Linux auditd logs (type=SYSCALL, a0=mount)",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Linux servers (e.g., web, database), developer workstations with Windows Subsystem for Linux (WSL), container host nodes (e.g., Kubernetes, Docker).",
            "action": [
              "Symbolic Logic: Create a SIEM rule to generate a high-priority alert when a process creation event is logged for 'mount' and the command line contains '--bind', '-o bind', or '-B', assigning critical priority if the target directory is within '/proc'.",
              "Statistical Method: Establish a baseline of 'mount' command usage per host and user. Calculate the 99th percentile for the daily frequency of these commands. Alert when the daily count for any user or host exceeds this threshold, indicating anomalous mounting activity.",
              "Machine Learning: Train a logistic regression classifier on historical process execution data, using features like parent process name, user context, command-line arguments, and time of day. Use the model to classify new 'mount' events as benign or suspicious, flagging those with a high probability of being malicious for analyst review."
            ]
          },
          {
            "description": "A measurable discrepancy between the set of process IDs (PIDs) returned by filesystem-level enumeration (e.g., listing '/proc/[0-9]*') and the set of PIDs returned by kernel-level or syscall-based enumeration on the same host within a short time window.",
            "data_sources": [
              "EDR kernel-level process listings",
              "Custom audit script output"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-value Linux servers, bastion hosts, servers hosting sensitive data, and containerized environments.",
            "action": [
              "Symbolic Logic: Schedule a recurring query to compare the list of PIDs from an EDR's kernel-derived process list against a list of numeric directories in '/proc'. Generate a critical alert if any PID exists in the kernel-derived list but lacks a corresponding '/proc/[PID]' directory.",
              "Statistical Method: For each host, track the count of mismatched PIDs over time. Apply a simple statistical process control (SPC) C-chart to the mismatch count. An alert is triggered if the count exceeds the upper control limit (e.g., mean + 3 standard deviations), indicating a statistically significant anomaly.",
              "Machine Learning: Use an unsupervised learning model, such as an autoencoder, trained on vectors representing the state of the process table at regular intervals. A high reconstruction error for a given state vector indicates a deviation from normal process behavior, which could be caused by a hidden process and warrants investigation."
            ]
          },
          {
            "description": "A logged bind mount event on a host is followed within a 60-minute window by network traffic from that same host exhibiting C2-like characteristics, such as periodic connections with a low standard deviation in inter-arrival time (beaconing) or unusually high data entropy in outbound flows.",
            "data_sources": [
              "Linux auditd logs",
              "Windows Security Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., internet gateway), DNS resolvers, critical Linux servers, and developer workstations.",
            "action": [
              "Symbolic Logic: Create a correlation rule that triggers when a 'mount --bind' event is detected from a host's process or audit logs. For the next 60 minutes, join that host's IP with network connection logs (Zeek conn.log) and alert if it connects to any destination IP or domain present on a threat intelligence list of known C2 servers.",
              "Statistical Method: Following a bind mount event, analyze the subsequent 60 minutes of the host's connections from Zeek conn.log. Calculate the Shannon entropy of the destination port distribution and the standard deviation of connection inter-arrival times for repeating destination IPs. Alert if the entropy is unusually low (port focusing) or the standard deviation is below a threshold (e.g., < 2 seconds), indicating machine-generated beaconing.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., LSTM) on network flow data (bytes_out, connection duration, packets_out) for each host. If a bind mount event occurs, check the model's anomaly score for that host in the subsequent hour. A spike in the anomaly score post-mount event suggests the hidden process is initiating malicious network activity."
            ]
          },
          {
            "description": "A host, previously flagged for bind mount activity, initiates network connections to destination IPs or domains with no historical precedent for that host or its peer group, or to destinations known to be malicious.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic logs at the internet gateway, internal network segments, and from corporate DNS servers.",
            "action": [
              "Symbolic Logic: For any host IP placed on a 'hosts with suspected bind mount' watchlist, create a SIEM rule to join its outbound network activity (from Zeek conn.log, dns.log, ssl.log) against a threat intelligence feed of known C2 servers. Generate a critical alert on any match.",
              "Statistical Method: For hosts on the watchlist, analyze their DNS requests (Zeek dns.log). Calculate a rarity score for each requested domain based on its overall frequency in the last 30 days of logs across the enterprise. Alert on requests for domains in the 99.9th percentile of rarity (i.e., almost never seen before).",
              "Machine Learning: Develop a 'new destination' anomaly detector. For each host, maintain a profile of historically accessed destination IPs, subnets, and countries. Use a clustering algorithm (e.g., DBSCAN) on the feature space of destination IPs. If a new connection from a watchlisted host falls outside of its established clusters, flag it as a geo-spatial or network-topological anomaly."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]