[
  {
    "information_requirement": "Has the adversary archived collected data prior to exfiltration? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1560",
        "name": "Archive Collected Data",
        "evidence": [
          {
            "description": "Presence of a newly created archive file (.zip, .rar, .7z) whose file hash matches a known malicious indicator, or whose name matches a pattern used by known threat actors.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Staging servers, Publicly accessible web servers",
            "action": [
              "Symbolic: Continuously monitor file creation events (Sysmon Event ID 11) for files with extensions like .zip, .rar, .7z, .tar, .gz. Compare the file hash against a threat intelligence feed of known malicious file hashes. Alert on any match.",
              "Statistical: From process creation logs (Windows Event ID 4688), extract command-line arguments for known archiver processes. Calculate the entropy of the filename specified in the command. A high entropy score (e.g., > 4.0) for a newly created archive name can indicate randomized naming schemes used by malware to evade simple signature-based detection. Alert on filenames exceeding the 95th percentile of historical filename entropy for the environment.",
              "Machine Learning: Train a decision tree or random forest classifier on process creation events (Windows Event ID 4688) that lead to archive creation. Use features like parent process name, command-line length, presence of password flags, and target directory path (e.g., C:\\Users\\Public, %TEMP%). The model will learn to classify archival events as 'benign' or 'suspicious'. Alert on events classified as 'suspicious' with high confidence."
            ]
          },
          {
            "description": "Execution of a known archival utility (e.g., 7z.exe, rar.exe, tar.exe) where the parent process is not a typical user-driven shell (e.g., explorer.exe, cmd.exe) or known legitimate software.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application servers, User workstations",
            "action": [
              "Symbolic: Create a rule that triggers on process creation (Windows Event ID 4688) where the child process name is a known archiver (e.g., 7z.exe, rar.exe, winzip.exe, tar.exe) and the parent process name is on a watchlist of suspicious parents (e.g., wmiprvse.exe, powershell.exe, mshta.exe, svchost.exe, outlook.exe). Alert on any match.",
              "Statistical: For each host, build a statistical baseline of normal parent-child process relationships for archiver executions. Represent this as a frequency table or a probability distribution. Calculate the rarity of an observed parent-child pair (e.g., using a z-score or by identifying pairs in the bottom 5th percentile of frequency). Alert when a rare pairing is detected, such as services.exe spawning 7z.exe.",
              "Machine Learning: Use a graph-based anomaly detection algorithm on process lineage data. Model processes as nodes and parent-child relationships as edges. Identify anomalous subgraphs where a known archiver process is created within a chain of execution that is structurally different from established benign process trees in the environment. This can detect complex 'living-off-the-land' chains that culminate in data archival."
            ]
          },
          {
            "description": "Creation of an archive file (.zip, .rar, .7z) that is an outlier in terms of size or location when compared to historical baselines for the specific user or host.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, User home directories, Shared network drives, Temporary file system locations (e.g., C:\\Windows\\Temp, %APPDATA%\\Local\\Temp)",
            "action": [
              "Symbolic: Monitor file creation events (Sysmon Event ID 11, Windows Event ID 4663) for archive files being written to unusual or sensitive directories, such as C:\\Windows\\System32, C:\\ProgramData, or the root of a user's profile directory. Maintain a static list of 'highly suspicious' locations for archive creation. Alert on any write to these locations.",
              "Statistical: For each host and user, establish a baseline of typical archive file sizes using a rolling 30-day window. Using descriptive statistics, alert if a newly created archive file's size exceeds a dynamic threshold, such as 3 standard deviations above the mean size or the 99th percentile of historical sizes for that entity. This helps detect unusually large data compilations.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume (in bytes) and count of archive files created per host per hour. The model will learn the normal 'rhythm' of archival activity. Alert when the model flags a significant deviation from the predicted pattern, indicating a sudden burst of archival activity inconsistent with past behavior."
            ]
          },
          {
            "description": "A single process exhibiting a high rate of file read operations on diverse, sensitive files, immediately followed by the creation of a single, large archive file by the same process or a child process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive data repositories (e.g., SharePoint sites, finance department file shares), User workstations of executives or developers, Database servers",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a single Process ID is associated with >1000 file read events (Windows Event ID 4663) across multiple directories in under 5 minutes, AND that same Process ID (or a child process) subsequently creates a file (Windows Event ID 4688 + Sysmon Event ID 11) with a .zip, .rar, or .7z extension.",
              "Statistical: For each process, calculate the Shannon entropy of the directory paths it reads from within a 10-minute window. A high entropy score indicates the process is accessing files from many different, unrelated locations, which is characteristic of data gathering. Alert if a process's directory access entropy exceeds the 98th percentile for all processes on that host, especially if it is followed by an archive creation event.",
              "Machine Learning: Use a sequence-based anomaly detection model (e.g., a Hidden Markov Model or Recurrent Neural Network) to analyze sequences of file system events (read, write, create) per process. Train the model on benign activity sequences. The model can then identify and score the likelihood of a new sequence. Alert when a low-likelihood sequence matching the 'many reads -> one archive write' pattern is detected."
            ]
          },
          {
            "description": "A process, not on an established allowlist of legitimate software, loading a cryptographic library (e.g., crypt32.dll, bcrypt.dll) for the first time in the environment.",
            "data_sources": [
              "Sysmon Event ID 7",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints and servers, especially critical servers like Domain Controllers and Certificate Authorities",
            "action": [
              "Symbolic: Monitor for image load events (Sysmon Event ID 7) where the ImageLoaded is a known crypto DLL (e.g., crypt32.dll, ncrypt.dll, bcrypt.dll) and the process name is not on a pre-defined allowlist of legitimate applications (e.g., web browsers, VPN clients, system processes). Alert on any non-allowlisted process loading these libraries.",
              "Statistical: Maintain a baseline of (ProcessName, ImageLoaded) tuples for crypto libraries across the environment. Calculate the frequency of each tuple. Alert when a tuple is observed that is statistically rare (e.g., occurs less than 5 times in the last 90 days across the entire enterprise), indicating a novel or unusual combination of a process and a crypto library.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) or Isolation Forest model on features of benign image load events for crypto libraries. Features should include the process path, parent process name, command line, and user context. The model will create a boundary around 'normal' activity. Alert on any new event that falls outside this boundary, flagging it as a potential anomaly."
            ]
          },
          {
            "description": "A network connection from an internal host to an external destination, transferring a volume of data that closely matches the size of a large archive file created on that same host within the preceding 30 minutes.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (monitored by Zeek), Internal hosts (endpoints and servers), Firewall and proxy servers",
            "action": [
              "Symbolic: Create a correlation rule that joins host-based file creation events (Sysmon Event ID 11) with network flow logs (Zeek conn.log). Trigger an alert if a file with extension .zip, .rar, or .7z and size > 50MB is created, AND within 15 minutes, an outbound connection from the same source IP is observed where the total bytes sent (orig_bytes) is within +/- 10% of the created file's size.",
              "Statistical: For each host, model the baseline outbound data transfer volume using a moving average over a 7-day period. Monitor for file creation events for large archives (>20MB). If such an event occurs, monitor the host's outbound traffic for the next hour. Alert if the outbound traffic volume for any connection exceeds a dynamic threshold, such as 4 standard deviations above the host's established baseline.",
              "Machine Learning: Use a regression model to predict the expected outbound traffic volume from a host based on features like time of day, day of week, and user role. Feed the recent creation of a large archive file as an additional binary feature into the model. If the actual observed traffic significantly exceeds the model's prediction (a large residual error) when the archive feature is true, flag it as a highly suspicious exfiltration event."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]