[
  {
    "information_requirement": "Has the adversary attempted to evade defenses by disabling or modifying the system firewall? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.004",
        "name": "Disable or Modify System Firewall",
        "evidence": [
          {
            "description": "A process creation event is observed where the process's file hash matches a known malicious hash from a threat intelligence feed, and the malware family is known to manipulate firewall settings.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: For each process creation (Windows Event ID 4688), compare the executable's SHA256 hash against a threat intelligence feed of known malicious hashes. Generate a high-severity alert upon a match.",
              "Statistical: Analyze the parent process of any process matching a malicious hash. Calculate the rarity of the parent-child process relationship across the environment using historical data. A rare pairing, such as `winword.exe` spawning a process with a malicious hash, significantly increases the alert's priority.",
              "Machine Learning: Use a pre-trained classification model, such as a gradient-boosted classifier, that takes process metadata (hash, parent process, command line) as features to predict the likelihood of it being part of a firewall evasion attempt. A high probability score from the model triggers an automated host quarantine action."
            ]
          },
          {
            "description": "The command line of a newly created process contains specific strings or patterns associated with disabling or modifying the Windows Firewall using native utilities like `netsh.exe` or PowerShell cmdlets.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule that searches process command lines (Windows Event ID 4688) for regular expressions matching firewall modification commands, such as `netsh advfirewall set .* state off`, `Set-NetFirewallProfile -Enabled False`, or `New-NetFirewallRule -Action Allow`.",
              "Statistical: For each host, establish a baseline of normal administrative command usage. Monitor for statistically significant deviations in the frequency of firewall modification commands. Calculate the entropy of command-line arguments for `netsh.exe`; a sudden spike in entropy followed by a firewall modification command is anomalous.",
              "Machine Learning: Train a sequence-based model, such as a Long Short-Term Memory (LSTM) network, on historical command-line activity per user and host. Flag any sequence containing a firewall modification command that the model identifies as having a low probability for that context."
            ]
          },
          {
            "description": "A modification is detected in a specific Windows Registry key that controls firewall policy, or the Windows Defender Firewall service (`mpssvc`) is stopped or set to disabled.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 7040",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User Workstations, Critical Application Servers",
            "action": [
              "Symbolic: Alert on any modification event (Windows Event ID 4657) to registry keys under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\`. Also, alert on any event where the `mpssvc` service enters a 'Stopped' state (Event ID 7036) or its start type is changed to disabled (Event ID 7040), unless the event is correlated with an approved change request ticket.",
              "Statistical: Profile the frequency of registry modifications and service state changes per host. Use a Z-score to detect an anomalous spike in the number of `HKLM\\...\\FirewallPolicy` modifications on a host within a short time window (e.g., 1 hour). A score greater than 3.0 warrants investigation.",
              "Machine Learning: Use an anomaly detection model, such as an Isolation Forest, trained on host event data (registry changes, service changes, process creations). Feed vectors representing these events into the model to identify outliers. An event sequence scored as a significant outlier by the model, involving firewall registry keys or services, should be flagged as highly suspicious."
            ]
          },
          {
            "description": "A host-based firewall modification event, such as a command execution or registry change, is temporally correlated with a subsequent network connection from that same host on a port that is statistically uncommon for that host or its network segment.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657",
              "Windows Event ID 7036",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Internal Network Segments, Host-based firewalls",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a firewall modification event (e.g., `netsh` command in Event ID 4688) is observed on a host, and within the next 5 minutes, a new outbound connection (Zeek conn.log) is seen from that host's IP on a port listed on a watchlist of high-risk C2 ports (e.g., 4444, 6667, 8080).",
              "Statistical: For each host, create a baseline of common destination ports from Zeek conn.log. Following a detected firewall modification event on a host, monitor its subsequent outbound connections. If a connection is made to a destination port that falls outside the 99th percentile of common ports for that host, flag the sequence as suspicious.",
              "Machine Learning: Use a time-series cross-correlation model to analyze two event streams: host-based firewall modification events and network connection events. The model should identify instances where a firewall modification event is a statistically significant predictor of a subsequent anomalous network connection, raising an alert for the linked events."
            ]
          },
          {
            "description": "A host exhibits a sudden, sustained increase in the variety of listening ports or successful inbound connections from unique source IPs, deviating from its established network baseline and suggesting the firewall has been disabled.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, DMZ Network Segment, Server Farm Network Segment",
            "action": [
              "Symbolic: Monitor `Zeek notice.log` for `Scan::Port_Scan` notices. Correlate a port scan notice against a host with a subsequent, immediate increase in successful connections to that same host from multiple sources on the scanned ports.",
              "Statistical: For each host, compute a daily baseline of the number of unique listening ports and unique source IPs seen in `Zeek conn.log`. Use a moving average and standard deviation to detect a sudden, sustained increase (e.g., > 3 standard deviations above the 30-day moving average for more than an hour) in either metric.",
              "Machine Learning: Apply clustering algorithms, such as DBSCAN, to hosts based on their network traffic profiles (vectors of features like port entropy, connection count, protocol mix). A host that suddenly migrates from a 'stable server' cluster to an 'anomalous high-traffic' cluster or becomes a noise point should be investigated for a potential firewall state change."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]