[
  {
    "information_requirement": "Is the adversary moving laterally through the network using remote service session hijacking?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1563",
        "name": "Remote Service Session Hijacking",
        "evidence": [
          {
            "description": "A process creation event is observed for an executable file whose name or hash matches a known remote session hijacking tool (e.g., Mimikatz, sessionGopher).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations",
            "action": [
              "Symbolic: Create a detection rule in the SIEM to trigger an alert when a process creation event (Windows Event ID 4688) contains a 'ProcessName' or 'OriginalFileName' from a maintained watchlist of known session hijacking tools (e.g., 'mimikatz.exe', 'sessiongopher.exe', 'rdp-hijack.exe'). Correlate the process 'FileHash' against a threat intelligence feed of known malicious hashes.",
              "Statistical: For each host, calculate the baseline rarity of process names using historical Windows Event ID 4688 data. Periodically calculate the inverse document frequency (IDF) score for all executed process names across the enterprise. Flag any process execution where the process name has a very high IDF score (e.g., top 1% percentile), indicating it is extremely rare, and investigate for potential malicious tool usage.",
              "Machine Learning: Train a logistic regression classifier on labeled process execution data (Windows Event ID 4688), using features such as parent process name, command-line length, command-line entropy, and user context. Use the model to predict the probability that a new process execution is malicious. Flag executions with a high probability score for analyst review, especially those involving rare parent-child process relationships (e.g., 'lsass.exe' spawning 'cmd.exe')."
            ]
          },
          {
            "description": "A process creation event is observed for a Windows utility (e.g., 'tscon.exe', 'query.exe') with command-line arguments used to enumerate or connect to an existing user session.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Multi-user servers (e.g., Terminal Servers, Citrix hosts), Domain Controllers, Jump Boxes",
            "action": [
              "Symbolic: Create a SIEM rule to detect process creation events (Windows Event ID 4688) where the 'ProcessName' is 'tscon.exe' and the 'CommandLine' contains a numeric session ID followed by '/dest:console'. Chain this detection with a preceding execution of 'query.exe user', 'quser.exe', or 'qwinsta.exe' from the same host or user within a short time window (e.g., 5 minutes).",
              "Statistical: Analyze command-line arguments for 'tscon.exe' across the environment. Establish a baseline of normal usage (which should be near zero for non-administrators). Calculate the frequency of 'tscon.exe' execution per user and per host. Alert on any user or host whose execution count exceeds a statistical threshold, such as the 99th percentile, or any non-administrative user executing the command.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to learn common sequences of command-line executions for different user roles. Feed process creation events (Windows Event ID 4688) into the model in real-time. Flag command sequences that have a low probability under the user's established model, particularly sequences involving session enumeration ('query user') followed by session connection ('tscon.exe')."
            ]
          },
          {
            "description": "A state change event for an RDP session (e.g., reconnect, unlock) is associated with a source IP address that is different from the IP address that initiated, or last interacted with, that same session.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4778",
              "Windows Event ID 4779",
              "Windows Event ID 4800",
              "Windows Event ID 4801",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, External-facing RDP gateways, Authentication logs on Domain Controllers and Member Servers",
            "action": [
              "Symbolic: Using a SIEM, create a state table keyed by RDP 'SessionID' from Windows Event logs. For each new session (Event ID 4624, Logon Type 10), store the 'Source Network Address' and 'User'. Upon a reconnect event (Event ID 4779), compare the new 'Source Network Address' to the stored address for that SessionID. If they differ, generate an alert.",
              "Statistical: For each user, build a profile of typical 'Source Network Address' subnets and Autonomous System Numbers (ASNs) used for RDP connections, derived from Zeek conn.log and Windows Event ID 4624. For each RDP reconnect event (Event ID 4779), calculate the rarity of the source ASN for that specific user. Trigger an alert if the ASN is in the bottom 5% of historical frequency for that user, indicating a connection from an unusual network.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on historical RDP session data. Cluster sessions based on features like source IP, user, session duration, and time of day. When a new session reconnect (Event ID 4779) occurs, classify it into an existing cluster. If the event is marked as a noise point (i.e., does not fit any existing cluster of normal behavior), flag it as a potential hijack for investigation."
            ]
          },
          {
            "description": "Within a single, authenticated remote session, subsequent process or network activity deviates significantly from the established baseline for the authenticated user, such as executing rare commands or connecting to new external IP addresses.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Host-based process and network monitoring agents, Network TAPs at key egress/ingress points",
            "action": [
              "Symbolic: During an active RDP session (identified by Logon Type 10 in Event ID 4624), monitor for process creation events (Event ID 4688) associated with discovery ('whoami', 'net user', 'ipconfig'), credential access ('lsass.exe' memory access), or defense evasion ('sc.exe stop windefend'). Trigger an alert if any of these high-risk commands are executed by a user who is not a designated administrator.",
              "Statistical: For each user, create a baseline of command-line execution entropy and DNS query entropy during remote sessions. Calculate the Shannon entropy of the sequence of commands executed (from Event ID 4688) and DNS domains queried (from Zeek dns.log) within a sliding time window (e.g., 10 minutes). Alert if the entropy score for a given session window exceeds 3 standard deviations from the user's historical average, suggesting a sudden increase in command or query variety.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., LSTM Autoencoder) on network traffic volume (bytes_out) from Zeek conn.log for each user's remote sessions. Train the model on historical session data to learn normal traffic patterns. During an active session, if the model's reconstruction error for the current traffic volume exceeds a dynamically determined threshold, flag the session for anomalous data exfiltration or C2 activity."
            ]
          },
          {
            "description": "A single, long-duration SSH connection exhibits characteristics of multiplexing, such as an unusually high volume of encrypted traffic or a sudden change in traffic patterns, inconsistent with interactive use.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring traffic to and from Linux/Unix servers, SSH jump boxes, and critical infrastructure.",
            "action": [
              "Symbolic: From Zeek ssh.log, create a rule to alert on any successful SSH authentication ('auth_success' field is true) that uses a client or server software version known to be vulnerable to session hijacking exploits. Correlate this with a long session duration in the corresponding Zeek conn.log record.",
              "Statistical: For each source-destination pair, profile the distribution of SSH session durations and total bytes transferred using Zeek conn.log. Alert when a new SSH session's duration or data volume exceeds the 95th percentile of the historical distribution for that specific connection pair. This identifies sessions that are abnormally long or transfer unusually large amounts of data.",
              "Machine Learning: Use a time-series clustering algorithm on SSH session data from Zeek conn.log, using features like packet inter-arrival times, packet size distribution, and client/server byte ratios. This can separate interactive sessions from bulk transfer or tunneled sessions. If an established session suddenly changes its cluster membership (e.g., from 'interactive' to 'bulk transfer'), flag it as a potential hijack event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]