[
  {
    "information_requirement": "Has the adversary exfiltrated data using legitimate external web services? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567",
        "name": "Exfiltration Over Web Service",
        "evidence": [
          {
            "description": "An outbound connection is made to a web service domain, IP, or URL that is a known Indicator of Compromise (IOC) for data exfiltration or malware command and control.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway Firewalls, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Continuously correlate destination IPs from Zeek conn.log and FQDNs from Zeek http.log (host header) or ssl.log (SNI field) against a cyber threat intelligence feed. Generate a high-priority alert for any match.",
              "Statistical: For newly observed domains not present in CTI feeds, calculate the prevalence score (percentage of distinct internal hosts connecting to it) within a 24-hour window. Flag any domain exceeding a low prevalence threshold (e.g., 5%) for further analysis, as this may indicate a new, widespread threat.",
              "Machine Learning: Employ a pre-trained domain reputation model that classifies domains based on features like age, registrar, IP geolocation, and character patterns (DGA detection). Reduce the reputation score of domains associated with outbound traffic and flag any domain falling below a 'suspicious' threshold."
            ]
          },
          {
            "description": "Outbound HTTP/S traffic contains User-Agent strings, API keys, or URI patterns characteristic of command-line data transfer tools (e.g., curl, wget) or programmatic uploads to services like Pastebin, GitHub Gists, or cloud storage APIs.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (Workstations and Servers), Application Servers, DMZ Web Servers",
            "action": [
              "Symbolic: Apply regular expressions to Zeek http.log to detect User-Agent strings of non-browser tools (e.g., 'curl/*', 'Wget/*', 'python-requests/*') or URI patterns for API-based uploads (e.g., '/api/post', '/api/v3/gists'). Correlate network events with process creation logs (Windows Event ID 4688) to confirm initiation by a non-interactive or script-based process.",
              "Statistical: Calculate the rarity of each User-Agent string across the enterprise over a 30-day rolling window. Alert on User-Agents that appear on a very small number of hosts (e.g., fewer than 5), as this indicates non-standard software.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to distinguish between browser and non-browser User-Agents based on features like string length, token count, and keyword presence. Flag traffic from User-Agents classified as 'non-browser' originating from standard user workstations."
            ]
          },
          {
            "description": "An outbound web connection exhibits an anomalously large data transfer, defined by a high ratio of bytes sent to bytes received or an HTTP POST/PUT request size that exceeds a dynamically established baseline for the user, host, or destination.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Core Network Switches, Servers hosting sensitive data",
            "action": [
              "Symbolic: Create a rule to alert when a single connection's outbound bytes ('orig_bytes' in Zeek conn.log) is greater than 10 times the inbound bytes ('resp_bytes') AND the total outbound bytes exceeds a static threshold (e.g., 100 MB).",
              "Statistical: For each host, establish a baseline of the 95th percentile for the ratio of 'orig_bytes'/'resp_bytes' and for the 'request_body_len' in HTTP POSTs. Generate an alert when any new connection exceeds this established statistical threshold.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) to predict the expected total outbound data volume per host for a given time window (e.g., one hour). Flag any host whose actual data volume significantly exceeds the model's prediction and its confidence interval."
            ]
          },
          {
            "description": "An outbound web connection on TCP port 80 or 443 is initiated by a non-interactive, administrative, or unsigned process that does not typically generate user-driven web traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers, User Workstations, Critical System Servers",
            "action": [
              "Symbolic: Correlate network connections (Windows Event ID 5156) with process creation events (Windows Event ID 4688). Alert if a process not on an allowlist of approved web browsers and applications (e.g., svchost.exe, powershell.exe, cscript.exe) initiates an outbound connection on port 80/443.",
              "Statistical: For each process name, establish a baseline of normal network behavior (e.g., average outbound bytes/hour). Alert when a process's network activity deviates from its baseline by more than three standard deviations, indicating a potential change in function or compromise.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on process execution data, using features like process name, parent process name, and network connection count. Automatically group normal behaviors and flag any new process activity that is classified as a noise point (outlier) as anomalous."
            ]
          },
          {
            "description": "A host makes outbound web connections to an external service with non-human patterns, such as machine-like periodicity (beaconing), communication at unusual hours, or a sudden, sustained increase in connection frequency.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal network segments, VPN Concentrators, Remote Access Servers",
            "action": [
              "Symbolic: Scan Zeek conn.log for connections from a single source to a single destination that occur at highly regular time intervals (e.g., every 300 seconds +/- 5 seconds) for a sustained duration (e.g., over 1 hour), which indicates C2 beaconing.",
              "Statistical: For each source-destination pair, calculate the standard deviation of the time delta between consecutive connections. A very low standard deviation indicates periodicity. Also, profile the typical hours of activity for each host and alert on significant connection volume during historically inactive periods (e.g., 2-4 AM).",
              "Machine Learning: Apply a time-series anomaly detection model, such as a Long Short-Term Memory (LSTM) autoencoder, to the stream of connection events for each host. The model learns the normal rhythm of activity and flags sequences of events that have a high reconstruction error, indicating a deviation from learned normal behavior."
            ]
          },
          {
            "description": "An outbound HTTP POST request or file upload contains a data payload with a Shannon entropy value significantly higher than the baseline for typical content sent to that destination, suggesting the data is compressed, encrypted, or obfuscated.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Web Application Firewalls (WAFs), Servers permitted to upload files to external sites",
            "action": [
              "Symbolic: Create a rule that flags any file upload identified in Zeek files.log with a common archive extension (e.g., .zip, .rar, .7z) being sent to a non-corporate, uncategorized web service.",
              "Statistical: Calculate the Shannon entropy of data in HTTP POST request bodies (from http.log) and transferred files (from files.log). Establish a per-destination baseline for normal entropy. Alert when a transfer's entropy exceeds the 99th percentile for that specific destination, indicating anomalous content type.",
              "Machine Learning: Train a file type classifier using features like byte frequency distribution and entropy. For traffic to web services that should only handle text (e.g., paste sites), flag any transfer that the model classifies as 'archive' or 'encrypted blob', suggesting data is being staged or hidden."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]