[
  {
    "information_requirement": "Is the adversary exfiltrating data over a webhook?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567.004",
        "name": "Exfiltration Over Webhook",
        "evidence": [
          {
            "description": "An outbound HTTP POST request is observed where the destination host, URI, or IP address is present on a threat intelligence feed of known malicious webhook endpoints.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., proxies, firewalls), DNS resolvers",
            "action": [
              "Symbolic: Create a watch list of known malicious webhook domains, URLs, and IP addresses from threat intelligence feeds. Join Zeek http.log `host` and `uri` fields with Zeek conn.log `id.resp_h` field. Generate an alert for any exact match between an observed destination and the watch list.",
              "Statistical: For domains associated with legitimate webhook services (e.g., discord.com, hooks.slack.com), calculate the entropy of the URI path for all POST requests. A URI path with an abnormally high entropy score (e.g., > 95th percentile of the baseline distribution) may indicate a randomly generated, adversary-controlled endpoint rather than a human-readable, legitimate one.",
              "Machine Learning: Train a logistic regression classifier on features extracted from HTTP POST requests, including URI length, URI entropy, presence of keywords like 'api' or 'webhook', and destination domain reputation. Use a labeled dataset of known-good and known-bad webhook traffic to classify new requests as benign or malicious. Flag requests classified as malicious with a high probability score for investigation."
            ]
          },
          {
            "description": "A process creation event is logged for a command-line utility (e.g., curl.exe, powershell.exe) containing arguments that specify an HTTP POST method and an outbound URL, often including a file or piped data as the payload.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, servers (especially web and application servers), and development environments",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 Process Creation events for `curl.exe`, `wget.exe`, and `powershell.exe`. Use regular expressions to search command-line arguments for patterns indicative of webhook usage, such as `-X POST`, `--data`, `Invoke-RestMethod -Method Post`, and a URL containing substrings like 'discord.com/api/webhooks' or 'hooks.slack.com'. Alert on any matches.",
              "Statistical: For each host, establish a baseline of normal command-line arguments for `curl.exe` and `powershell.exe`. Calculate the frequency of different argument combinations. An execution involving a rare combination of arguments, such as `-Method Post` and `-InFile` together in a PowerShell command on a system where this has never been seen, should be flagged as an anomaly (e.g., a combination with a frequency below the 1st percentile).",
              "Machine Learning: Use a one-class Support Vector Machine (SVM) model trained on benign command-line invocations for common utilities on each host. Feed new process creation events (Windows Event ID 4688) into the model. The model will identify command lines that deviate significantly from the learned 'normal' behavior, flagging them as potential exfiltration attempts without relying on specific keywords or signatures."
            ]
          },
          {
            "description": "An outbound HTTP POST request to a webhook service domain contains a payload with a `Content-Type` header indicating data archival (e.g., `application/zip`) or a body containing high-entropy data suggestive of encoding or encryption.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, servers hosting sensitive data (e.g., databases, file shares), and systems used for data processing and analysis",
            "action": [
              "Symbolic: From Zeek http.log, filter for all POST requests. Create a watch list of suspicious `Content-Type` headers (e.g., `application/zip`, `application/x-rar-compressed`, `application/x-7z-compressed`, `application/octet-stream`). Alert on any request matching these content types that is also directed to a known webhook provider domain (e.g., `discord.com`, `slack.com`).",
              "Statistical: For all outbound HTTP POST requests, calculate the Shannon entropy of the first 1024 bytes of the request body if available via deep packet inspection. Establish a baseline entropy distribution. Flag requests with an entropy score exceeding a high threshold (e.g., > 3 standard deviations above the mean, or a value > 7.5 for 8-bit bytes), which is characteristic of compressed, encrypted, or Base64 encoded data.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume of data transferred via POST requests per `Content-Type` per hour. A sudden, anomalous spike in the volume of data associated with a `Content-Type` like `application/octet-stream` could indicate a large-scale exfiltration event. The model would learn the normal daily and weekly cycles and flag significant deviations."
            ]
          },
          {
            "description": "A specific internal host exhibits a statistically significant increase in the count, total data volume, or average size of outbound HTTP POST requests to external webhook or collaboration service domains compared to its established baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal host subnets, especially those of privileged users or servers with access to sensitive information",
            "action": [
              "Symbolic: Define a simple threshold rule: alert if any single host sends more than 100 POST requests or a total of 50 MB via POST requests to known webhook domains within a one-hour window. Set and periodically tune these thresholds based on an initial analysis of network traffic.",
              "Statistical: For each source IP, profile the daily volume (`orig_bytes` from Zeek conn.log) and count of outbound POST requests. Use the Interquartile Range (IQR) method to detect outliers. Flag any day where a host's POST request count exceeds $$ Q3 + 1.5 \\times IQR $$ of its 30-day rolling baseline.",
              "Machine Learning: Implement a time-series forecasting model (e.g., Prophet) for each host's outbound POST request volume. The model will predict the expected volume for the next hour. If the actual observed volume significantly exceeds the model's prediction interval, generate an anomaly alert, indicating a potential exfiltration event that breaks the established temporal pattern."
            ]
          },
          {
            "description": "A sequence of events is observed on a single host within a short time window: 1) process creation for an archiving utility (e.g., 7z.exe, tar.exe), followed by 2) an outbound HTTP POST request to a low-prevalence or newly seen external domain.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Staging servers, developer workstations, and any host with both sensitive data access and direct internet connectivity",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a Windows Event ID 4688 for a known archiving tool (`7z.exe`, `rar.exe`, `tar.exe`, `zip.exe`) is logged from a host, and within 5 minutes, the same host initiates an HTTP POST request (from Zeek http.log) to an external destination. Alert on this sequence.",
              "Statistical: Maintain a list of all domains resolved by internal hosts from Zeek dns.log. Calculate the prevalence (number of unique hosts querying the domain) for each domain over a 30-day period. Enhance the symbolic rule by increasing the risk score if the destination domain of the POST request is in the bottom 5th percentile of prevalence (a 'rare' domain for the organization).",
              "Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM), to detect the state transition from 'Data Staging' to 'Exfiltration'. Train the model on event sequences from hosts (e.g., process creations, network connections). An alert is generated when the model observes the high-probability transition from an archive process creation event to an outbound POST event, especially to a rare domain, as this sequence would be anomalous compared to benign activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]