[
  {
    "information_requirement": "Has the adversary acquired a Virtual Private Server (VPS) for operational use? (TA0042 - Resource Development)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.003",
        "name": "Virtual Private Server",
        "evidence": [
          {
            "description": "An outbound network connection is made from an internal host to an external destination (IP, domain) or involves an SSL/TLS certificate that is listed on a threat intelligence feed as known malicious infrastructure associated with VPS providers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Proxies)",
            "action": [
              "Symbolic Logic: Join network connection logs (Zeek conn.log), DNS queries (Zeek dns.log), and SSL/TLS certificate details (Zeek ssl.log, x509.log) against a high-confidence threat intelligence feed of known malicious VPS IPs, domains, and certificate hashes. Generate an alert for any match.",
              "Statistical Method: For all outbound connections, calculate the frequency of destination Autonomous System Numbers (ASNs) known to be associated with VPS providers. Establish a baseline of normal traffic to these ASNs. Alert on internal hosts whose connection count to these ASNs exceeds the 95th percentile of the established baseline.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled historical data, using features such as destination IP, port, ASN, domain reputation, and threat intelligence hits. Use the model to score new outbound connections in real-time, flagging those classified as high-probability C2 connections to VPS infrastructure."
            ]
          },
          {
            "description": "An outbound connection from an internal host exhibits a JA3/JA3S hash or service banner associated with a known Command and Control (C2) framework commonly hosted on VPS infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Symbolic Logic: Scan Zeek ssl.log for JA3/JA3S hashes and Zeek conn.log for service banners. Match these artifacts against a curated list of signatures for known C2 frameworks (e.g., Cobalt Strike, Sliver, Metasploit). Generate an alert on any direct match.",
              "Statistical Method: Calculate the rarity of each observed JA3/JA3S hash across the enterprise over a 30-day rolling window. Flag connections using a hash that appears in less than 0.1% of all TLS sessions, as this may indicate a unique or custom C2 client. Correlate with destination IPs in known VPS provider ranges to increase confidence.",
              "Machine Learning: Use an unsupervised learning algorithm (e.g., DBSCAN) on JA3/JA3S hashes and other TLS parameters (cipher suites, extensions). Identify clusters of anomalous TLS handshakes that do not conform to known benign application profiles (e.g., web browsers, OS update services) and investigate hosts contributing to these clusters."
            ]
          },
          {
            "description": "An internal host resolves or connects to a domain with characteristics indicative of malicious use, such as a registration date less than 30 days old, high Shannon entropy in the domain name, or association with a dynamic DNS provider.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "WHOIS Data",
              "Passive DNS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers",
            "action": [
              "Symbolic Logic: For each DNS query in Zeek dns.log, check if the domain is present on a blocklist of known malicious or dynamic DNS domains. Alert on any match that is subsequently connected to via Zeek conn.log.",
              "Statistical Method: Calculate the Shannon entropy for all requested subdomains. Establish a baseline entropy score for legitimate traffic. Flag domains with an entropy score exceeding the 99th percentile. Additionally, enrich domains with WHOIS data and flag any connections to domains registered within the last 30 days.",
              "Machine Learning: Develop a time-series forecast model (e.g., ARIMA) for the volume of DNS queries to newly observed domains. An alert is triggered if the query volume for a new, suspicious domain (e.g., high entropy, recently registered) suddenly spikes above the forecasted confidence interval, suggesting coordinated C2 activity."
            ]
          },
          {
            "description": "An internal host establishes a connection to an external IP in a known VPS provider range that exhibits a periodic 'heartbeat' pattern, has an anomalous data transfer size, or uses a non-standard port for a common protocol.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Symbolic Logic: For connections to IPs within known VPS provider ranges, create a rule to alert if the destination port is a known C2 port (e.g., 50050 for Cobalt Strike) or a common port used in a non-standard way (e.g., port 53 for non-DNS traffic).",
              "Statistical Method: For each source-destination IP pair, calculate the time delta between consecutive connections in Zeek conn.log. Analyze the standard deviation of these time deltas. A very low standard deviation (e.g., < 1 second) indicates a regular, machine-generated beacon. Additionally, use Z-scores to identify session byte counts that are statistical outliers.",
              "Machine Learning: Apply a sequence analysis model (e.g., LSTM) to connection logs, learning patterns of normal user and system behavior (e.g., session duration, bytes transferred, inter-arrival time). Use the trained model to identify sequences of network events that deviate significantly from learned normal patterns, flagging them as potential C2 beaconing."
            ]
          },
          {
            "description": "An outbound connection uses an SSL/TLS certificate that is self-signed, has a validity period shorter than 90 days, or is issued by a free certificate authority and is associated with a domain exhibiting other suspicious traits (e.g., newly registered).",
            "data_sources": [
              "Zeek x509.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Encrypted Traffic Inspection Points",
            "action": [
              "Symbolic Logic: From Zeek x509.log, create a rule to alert on any certificate where the 'issuer' and 'subject' fields are identical (indicating self-signed) and the connection does not originate from a known infrastructure management host.",
              "Statistical Method: Calculate the distribution of certificate validity periods across the network. Flag any certificates in the bottom 5th percentile (e.g., < 90 days). Correlate these findings with domains that were registered within the last 30 days or have high entropy scores to increase the fidelity of the alert.",
              "Machine Learning: Train a decision tree classifier to identify malicious certificates based on features like validity duration, public key algorithm, key length, issuer (e.g., free vs. paid CA), and whether it's self-signed. Use the model to score and flag newly observed certificates in real-time."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]