[
  {
    "information_requirement": "Does the adversary possess compromised email accounts that could be used to target the organization? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1586.002",
        "name": "Email Accounts",
        "evidence": [
          {
            "description": "An inbound email, observed in network traffic, contains a sender address, embedded link (domain/IP), or attachment hash that matches a high-confidence threat intelligence feed of known malicious or compromised indicators.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter email gateway (SMTP relay); Network security monitoring sensor tap points",
            "action": [
              "Symbolic Logic (IOC Matching): Continuously join sender addresses from smtp.log, requested domains from dns.log/http.log, and file hashes from files.log against curated threat intelligence feeds of known compromised accounts, malicious domains, and malware hashes. Generate a high-priority alert upon any match.",
              "Statistical Method (Reputation Scoring): Calculate a reputation score for each inbound sender's domain based on features like domain age (from WHOIS lookups), historical email volume, and presence on public blocklists. Flag sender domains with scores below a statistically determined threshold (e.g., 25th percentile of all observed domains) that are also sending emails with attachments.",
              "Machine Learning (Classification): Train a supervised machine learning model (e.g., Logistic Regression, Random Forest) on labeled historical email metadata (smtp.log, http.log). Use features like sender TLD, presence of numbers in the domain, number of links, and attachment file type to classify new inbound emails as 'malicious' or 'benign' in real-time."
            ]
          },
          {
            "description": "An inbound email contains one or more structural features indicative of phishing, such as links to dynamic DNS domains or URL shorteners, or includes high-risk attachment types (e.g., ISO, VHD, LNK) not typically used in legitimate business communications.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter email gateway; DNS resolvers; Web proxies",
            "action": [
              "Symbolic Logic (Pattern Matching): Apply regular expressions on dns.log and http.log 'host' fields to identify requests to known dynamic DNS providers (e.g., *.ddns.net) and URL shortener services (e.g., bit.ly). Scan files.log 'mime_type' and 'filename' fields for high-risk attachment types like 'application/x-iso9660-image' or files ending in .iso, .vhd, or .lnk.",
              "Statistical Method (URL Entropy Analysis): For each URL found in email traffic (http.log), calculate the Shannon entropy of the hostname and URL path. Establish a baseline entropy distribution for legitimate domains from the last 90 days. Flag URLs with entropy scores exceeding a high percentile (e.g., 95th percentile) as potentially algorithmically generated or obfuscated.",
              "Machine Learning (Time Series Anomaly Detection): For each high-risk attachment type (e.g., .iso, .zip), create a time series of its daily delivery volume from files.log. Apply a time series anomaly detection algorithm (e.g., SARIMA) to identify statistically significant spikes in the delivery of a particular file type, which could indicate the start of a widespread campaign."
            ]
          },
          {
            "description": "A statistically significant increase in email volume originating from a previously unseen or low-reputation sender IP/domain, targeting a specific group of internal recipients (e.g., Finance department).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security monitoring sensor tap points; Perimeter email gateway logs; Directory services (for group membership)",
            "action": [
              "Symbolic Logic (New Sender Rule): Maintain a state table of sender domains observed over the last 60 days. Create a rule that triggers an alert when a domain not in this table sends emails to more than a predefined number of internal recipients (e.g., >10) within a 1-hour window.",
              "Statistical Method (Volume Spike Detection): For each external sender IP, baseline the hourly email volume using a 30-day moving average and standard deviation from conn.log and smtp.log. Alert when the current hourly volume for a sender exceeds 3 standard deviations above its historical average.",
              "Machine Learning (Community Detection): Model sender-recipient relationships as a bipartite graph. Apply a community detection algorithm (e.g., Louvain Modularity) to identify clusters of internal recipients who are frequently targeted together. A new, external sender directing a high volume of email to a pre-identified community (e.g., the 'Finance' cluster) is a strong anomaly."
            ]
          },
          {
            "description": "A high rate of failed authentication attempts (Windows Event ID 4625) followed by a success (Windows Event ID 4624) for a user account present in public credential breach data, originating from a single external IP address.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing authentication servers (e.g., ADFS, Exchange OWA); VPN concentrators; Domain Controllers",
            "action": [
              "Symbolic Logic (Breached Credential Check): Correlate the 'TargetUserName' field from Windows Event IDs 4624 and 4625 against a maintained database of corporate email addresses found in public data breaches. Alert on any authentication attempt from an external source IP involving a known-breached account.",
              "Statistical Method (Failed/Success Ratio Analysis): For each external source IP ('IpAddress' field), calculate the ratio of failed logons (4625) to successful logons (4624) within a 5-minute window. A ratio exceeding 20:1 followed by a success for the same username is a strong indicator of a successful credential stuffing attack. Also, flag any source IP with a failure count in the 99th percentile.",
              "Machine Learning (User Login Behavior Modeling): For each user, create a baseline of normal login behavior using historical Windows Event ID 4624 data (features: login time of day, source IP geolocation/ASN, logon type). Use an unsupervised learning model (e.g., Isolation Forest) to score new logins. A login with a high anomaly score indicates a significant deviation from the user's established pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]