[
  {
    "information_requirement": "Is the adversary developing resources for attack, such as a botnet, by compromising internal or external systems?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.005",
        "name": "Botnet",
        "evidence": [
          {
            "description": "A successful outbound network connection or DNS query from an internal host to an external destination (IP address or domain) that is present on a high-confidence threat intelligence feed for known botnet C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points (Firewalls, Proxies), Internal DNS Resolvers",
            "action": [
              "Symbolic: Query network connection logs (Zeek conn.log, Windows Event ID 5156) and DNS logs (Zeek dns.log) where the destination IP or queried domain matches a list of known botnet C2 indicators from a threat intelligence feed. Generate a high-priority alert for any match.",
              "Statistical: For hosts communicating with destinations not on an allowlist, calculate a reputational score for the destination IP/domain using multiple threat intelligence sources. Alert if the average score for a given host's communications over a 1-hour window exceeds a predefined risk threshold (e.g., > 75/100).",
              "Machine Learning: Use a trained classification model (e.g., random forest) that takes connection features (destination port, protocol, destination ASN, domain age, IP reputation) as input to predict the probability of a connection being malicious. Alert on connections classified as 'botnet C2' with a high confidence score (> 0.90)."
            ]
          },
          {
            "description": "Outbound network traffic from an internal host that matches known botnet C2 patterns, including: a high ratio of NXDOMAIN responses, high-entropy domain names (DGA), use of non-standard ports for common protocols, or specific TLS client fingerprints (JA3/JA3S hashes).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points (Firewalls, Proxies), Internal DNS Resolvers",
            "action": [
              "Symbolic: Query TLS logs (Zeek ssl.log) for JA3 or JA3S hashes that match a known list of botnet malware family fingerprints. Generate a high-priority alert for any observed match.",
              "Statistical: For each internal host, calculate the Shannon entropy of queried subdomains in Zeek dns.log over a 5-minute window. Alert when a host's average entropy exceeds a statistically determined threshold (e.g., > 3.5) or is in the top 98th percentile of all hosts, indicating potential DGA activity.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., LSTM Autoencoder) on the ratio of NXDOMAIN responses to total DNS queries per host. An anomalous spike in this ratio, when compared to the model's prediction, indicates potential DGA activity. Alert on any detected anomaly."
            ]
          },
          {
            "description": "An internal host exhibiting rhythmic, periodic outbound connections (beaconing) to one or a few external destinations, or a high volume of outbound connections to numerous unique external destinations (scanning).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "General User Workstation Subnets, Server Subnets, Internet Egress Points",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) with subsequent outbound network connections (Windows Event ID 5156). Alert if a non-system, non-browser process establishes a persistent connection to an external IP on a non-standard port.",
              "Statistical: From Zeek conn.log, group by source host and destination IP over a 1-hour window. Calculate the standard deviation of the time delta between connections. A very low standard deviation (e.g., < 1.0 second for a 60-second beacon) indicates rhythmic beaconing. Alert on hosts with a beaconing score exceeding the 99th percentile.",
              "Machine Learning: Apply a clustering algorithm (e.g., DBSCAN) to connection data tuples (source IP, destination IP, destination port, bytes sent, time). Identify and alert on small, dense clusters of hosts exhibiting similar periodic beaconing behavior or large, sparse clusters indicating scanning activity."
            ]
          },
          {
            "description": "A sudden, anomalous increase in inbound network traffic volume and connection rate from a highly distributed set of external source IP addresses, targeting a specific internal host or service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-Facing Services (Web Servers, VPN Concentrators), DMZ Network Segments, Internet Ingress Points",
            "action": [
              "Symbolic: Monitor Zeek notice.log for specific DDoS-related notices such as 'Scan::Address_Scan' or 'Attack::DOS'. Trigger a high-priority alert upon generation of these notices for the targeted service.",
              "Statistical: For each public-facing service, establish a baseline of normal inbound connections per minute and the number of unique source IPs per minute. Alert if the current minute's values exceed 3 standard deviations above the 30-day rolling average for both metrics simultaneously.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) to predict the expected volume of inbound traffic for the next 5-minute interval based on historical data. If the actual observed traffic volume exceeds the model's predicted upper confidence interval by a significant margin (e.g., > 50%), classify the event as a volume anomaly and potential DDoS attack."
            ]
          },
          {
            "description": "A high volume of inbound emails, observed within a short time frame, that share similar content features (subject, attachment hash, URL structure) but originate from a large and geographically diverse set of source IP addresses.",
            "data_sources": [
              "Email Gateway Logs",
              "Zeek smtp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Gateway Servers, Internet Ingress Points, User Workstation Subnets",
            "action": [
              "Symbolic: From email gateway logs, alert when the number of inbound emails containing the same attachment hash or a URL with the same domain from more than 50 unique source IPs is observed within a 1-hour window.",
              "Statistical: Calculate the Shannon entropy of the source IP addresses for all inbound emails received in a 10-minute window. Establish a baseline for this entropy score. Generate an alert if the entropy score suddenly increases by more than 2 standard deviations from the baseline, indicating a distributed source campaign.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on vectors representing email features (n-grams from subject, URL domain). Identify large clusters of similar emails. If a cluster contains emails from a highly distributed set of source Autonomous Systems (ASNs), flag it as a potential botnet-driven phishing campaign."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]