[
  {
    "information_requirement": "Is the adversary developing resources (e.g., servers) for use in operations against us?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.004",
        "name": "Server",
        "evidence": [
          {
            "description": "An internal host establishes a network connection with an external IP address or resolves a domain that is present on a high-confidence threat intelligence feed of known adversary infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Proxies, DNS Resolvers)",
            "action": [
              "Symbolic: Create a watchlist of IP addresses and domains from high-confidence threat intelligence feeds (e.g., C2 servers, phishing sites). Join network flow logs (Zeek conn.log) and DNS query logs (Zeek dns.log) against this watchlist. Generate an alert for any successful connection or query matching an entry on the watchlist.",
              "Statistical: For each matched connection from the symbolic search, calculate the prevalence of the destination IP/domain across the enterprise over the last 30 days. Prioritize alerts where the destination is rare (e.g., contacted by fewer than 5 hosts or in the bottom 5th percentile of destination prevalence) to distinguish targeted attacks from widespread campaigns.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) on labeled historical data of malicious and benign connections. Use features such as connection duration, bytes sent/received, protocol, destination port, and threat intelligence match category (e.g., 'C2', 'phishing'). Use the model to score new threat intelligence matches in real-time, escalating those with a high probability of being malicious."
            ]
          },
          {
            "description": "An internal host initiates an SSL/TLS session with an external server where the server certificate, JA3/JA3S hash, or HTTP server header matches a known adversary C2 profile.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek ja3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Proxies with SSL/TLS Inspection)",
            "action": [
              "Symbolic: Maintain a library of C2 signatures, including common self-signed certificate subjects (e.g., empty or default Cobalt Strike values), known malicious JA3/JA3S hashes, and specific HTTP server headers (e.g., 'Server: nginx/1.10.3 (Ubuntu)'). Scan Zeek ssl.log, ja3.log, and http.log for exact matches to this signature library and alert on any match.",
              "Statistical: For all external SSL/TLS connections, calculate the Shannon entropy of the certificate's subject and issuer fields. Unusually low entropy values may indicate default or auto-generated certificates common in C2 frameworks. Flag connections where the subject entropy falls below a dynamically calculated threshold (e.g., 10th percentile of daily entropy scores) for further inspection.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN, K-Means) on features extracted from Zeek ssl.log, such as certificate validity period, public key length, signature algorithm, and JA3/JA3S hash. Identify small, distinct clusters that deviate from the large clusters of legitimate traffic (e.g., Google, Microsoft, CDNs). Manually investigate these outlier clusters as potential C2 infrastructure."
            ]
          },
          {
            "description": "An internal host initiates a connection to an external domain or IP address that has never been seen before in the environment and exhibits high-risk characteristics, such as being registered within the last 60 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Passive DNS and WHOIS lookup data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, and Threat Intelligence Platforms",
            "action": [
              "Symbolic: Maintain a state table or lookup file of all external domains and IPs contacted in the last 90 days. For every new DNS query or connection, check against this historical baseline. If the destination is not found, enrich it with WHOIS data. Generate a high-priority alert if the domain's 'creation_date' is less than 60 days from the current date.",
              "Statistical: For all first-seen domains, calculate a risk score based on statistical properties. Assign points for features like high character-to-digit ratio, high entropy (potential DGA), or a TLD uncommon for business use (.xyz, .top). Sum the points and flag domains exceeding a percentile-based threshold (e.g., 95th percentile of risk scores for all new domains observed that day).",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA) on the daily count of newly observed domains. A sudden, anomalous spike in the number of new domains contacted across the enterprise can indicate the activation of a widespread campaign using newly acquired infrastructure. Investigate the specific domains contributing to the spike."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of DNS queries for a single external domain from multiple internal hosts, where the domain resolves to a newly observed IP address.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers and Network Egress Points",
            "action": [
              "Symbolic: For each unique domain in Zeek dns.log, count the number of distinct source hosts querying it within a 5-minute window. If the count of hosts for a single domain exceeds a hard threshold (e.g., 50 hosts) and the domain was first seen within the last 24 hours, generate an alert. This is a simple 'beaconing' or 'rallying' check.",
              "Statistical: For each domain, calculate the number of unique client queries per hour. Establish a baseline using a 14-day moving average and standard deviation. An alert is generated when the current hour's query count for a domain exceeds a threshold, such as the mean plus 3 standard deviations (a 3-sigma event), indicating a statistically significant spike.",
              "Machine Learning: Apply a change point detection algorithm (e.g., a Bayesian online change point detection model) to the time series of query counts for each domain. This can identify abrupt shifts in the statistical properties of the time series that are more subtle than a simple spike, potentially indicating a change in C2 behavior or the start of a new campaign phase."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]