[
  {
    "information_requirement": "Is the adversary using network address translation traversal to evade defenses and access restricted network segments? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1599.001",
        "name": "Network Address Translation Traversal",
        "evidence": [
          {
            "description": "A network connection is established from an internal host to an external IP address and port combination that is present on a threat intelligence feed and categorized as a malicious STUN, TURN, or NAT traversal service.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Routers)",
            "action": [
              "Symbolic: Create a SIEM rule that queries Zeek conn.log data and alerts when a `id.resp_h` (destination IP) matches an IP address on a threat intelligence list categorized as 'NAT-Traversal', 'Proxy', or 'Malicious Infrastructure', especially when `id.resp_p` (destination port) is 3478 or 5349.",
              "Statistical: For each source host, calculate the ratio of connections to known malicious NAT traversal IPs versus total external connections over a 24-hour window. Establish a baseline ratio for different host roles (e.g., workstations, servers). Flag hosts whose ratio exceeds the 95th percentile for their peer group.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from Zeek conn.log such as destination IP, destination port, protocol, and connection duration, along with threat intelligence labels (malicious/benign). Use the model to predict the probability that a new connection is to a malicious NAT traversal service in real-time."
            ]
          },
          {
            "description": "The presence of STUN protocol messages, identified by the magic cookie 0x2112A442 in the UDP payload, is observed in network traffic originating from servers not authorized for WebRTC or VoIP services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek stun.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Network Segments (e.g., Server VLANs, User Subnets)",
            "action": [
              "Symbolic: Deploy a Zeek signature or SIEM rule that inspects UDP traffic payloads for the STUN magic cookie '0x2112A442'. Generate an alert if this pattern is found and the traffic originates from a host within a server subnet or other restricted zone.",
              "Statistical: Profile the usage of the STUN protocol (from `stun.log` or signature matches) across the enterprise. For each host, calculate the frequency and volume of STUN traffic over time. Use a moving average and standard deviation to identify hosts exhibiting a sudden spike in STUN activity.",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) on features extracted from `stun.log` and `conn.log`, such as source IP, port, transaction ID entropy, and request frequency. Train the model on a baseline of normal STUN traffic to identify outlier sessions that do not conform to legitimate patterns."
            ]
          },
          {
            "description": "An SSDP (UDP port 1900) M-SEARCH or NOTIFY message followed by a SOAP request to a gateway device from an internal host results in a new, externally-accessible port mapping that is not authorized by policy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Gateway Devices",
            "action": [
              "Symbolic: Create a SIEM rule that alerts on any traffic to UDP port 1900 (SSDP) originating from hosts in restricted subnets (e.g., database servers, domain controllers). Correlate this with subsequent inbound connections to the source host from an external IP.",
              "Statistical: Establish a baseline of hosts that legitimately use UPnP and maintain an allowlist. Calculate the daily count of new UPnP port mapping requests per host. Alert on any host not on the allowlist making a request, or any allowed host whose request count exceeds 3 standard deviations above its own historical average.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA) on the volume of UPnP/SSDP traffic for critical subnets. Use the model to predict expected traffic volumes and alert when observed traffic significantly exceeds the predicted confidence interval, indicating a potential widespread UPnP-based attack."
            ]
          },
          {
            "description": "A temporal correlation is observed between STUN/TURN protocol usage from an internal host and a subsequent, long-duration (>1 hour) UDP or TCP connection between the same internal host and a new, non-CDN external IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek stun.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when an internal host (`id.orig_h`) observed in `stun.log` subsequently establishes a connection in `conn.log` to an external host (`id.resp_h`) that is not a known STUN/TURN server. The rule should specifically look for connections with a duration exceeding 60 minutes.",
              "Statistical: For all connections following STUN activity, calculate the Z-score for connection duration and total bytes transferred based on historical data for that host and protocol. Flag connections where both metrics have a Z-score greater than 2, indicating an unusually long and high-volume session.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection features (duration, bytes_out, bytes_in, periodicity) for all traffic following STUN/TURN events. Identify clusters of 'normal' P2P traffic and flag outlier connections that do not belong to these clusters as anomalous."
            ]
          },
          {
            "description": "Network traffic from an internal host destined for an external IP address does not traverse the designated network egress point (e.g., corporate proxy or firewall), indicating a routing policy violation or a compromised routing device.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Internal Network Segments",
            "action": [
              "Symbolic: Define network policy rules in a SIEM, such as `(source_subnet = 'server_vlan' AND destination_ip_type = 'external' AND NOT next_hop_ip = 'firewall_ip')`. Generate a high-severity alert for any connection that violates this logic.",
              "Statistical: Periodically sample network flows and calculate the percentage of traffic from key subnets that egresses through the correct gateway. Establish a baseline percentage (e.g., 99.9%). Alert if this percentage drops below the 1st percentile of historical measurements.",
              "Machine Learning: Construct a graph representation of the network where nodes are subnets/hosts and edges are observed connections. Use a community detection algorithm to identify normal traffic patterns. A host that suddenly forms an edge to an external node, bypassing its usual community's egress path, can be flagged as a high-priority anomaly."
            ]
          },
          {
            "description": "A single internal source IP initiates outbound UDP connections to numerous distinct destination ports (>1024) on one or more external IPs within a short time frame (< 60 seconds), exhibiting high Shannon entropy in the destination port numbers.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Host Subnets",
            "action": [
              "Symbolic: Create a SIEM rule that triggers if a single source IP (`id.orig_h`) generates more than 50 unique outbound UDP connections to ports > 1024 within a 60-second window, indicating UDP hole punching behavior.",
              "Statistical: Over a 5-minute sliding window, calculate the Shannon entropy of the destination port numbers for all outbound UDP connections from each internal host. Alert when a host's port entropy exceeds the 98th percentile of its established baseline.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) on features representing normal outbound UDP traffic from a host, such as connection rate and destination port entropy. Use the trained model to classify new 1-minute windows of activity as either 'normal' or 'anomalous'."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]