[
  {
    "information_requirement": "Is an adversary actively gathering information about our external network infrastructure?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590",
        "name": "Gather Victim Network Information",
        "evidence": [
          {
            "description": "A single external source IP, present on a high-confidence threat intelligence feed (e.g., categorized as a scanner, malicious actor, or TOR exit node), communicates with any asset in the organization's network space.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls/gateways",
            "action": [
              "Symbolic: Perform an inner join between a watchlist of high-confidence malicious IP addresses and the source IP address field (`id.orig_h`) across all relevant Zeek logs (conn.log, dns.log, http.log). Generate a high-priority alert for any resulting match.",
              "Statistical: For IPs that match the watchlist, calculate the frequency and diversity (count of distinct values) of destination ports and hosts contacted over a 1-hour window. Flag any source IP exceeding the 95th percentile for connection attempts or destination host count compared to all other external traffic.",
              "Machine Learning: Develop a classification model (e.g., Logistic Regression) trained on labeled data (historical incidents, threat intel) using features like connection count, port diversity, packet size statistics, and threat intel category. Use the model to score new, watchlist-matched connection events for their likelihood of being malicious reconnaissance."
            ]
          },
          {
            "description": "Network traffic from a single external source contains one or more artifacts uniquely associated with network reconnaissance tools (e.g., Nmap, Masscan, Zgrab, Nuclei) within a 5-minute window, such as specific User-Agent strings or protocol handshakes.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers",
            "action": [
              "Symbolic: Apply a list of regular expressions to the `user_agent` field in Zeek http.log to detect tool-specific strings like 'Nmap Scripting Engine', 'masscan', 'zgrab', or 'nuclei'. Monitor Zeek's `notice.log` for native alerts like `Nmap::OS_Scan`.",
              "Statistical: For a given source IP, calculate the ratio of requests containing known scanner User-Agents to total requests within a 10-minute window. If this ratio is greater than 0.5, or if the count of such requests exceeds 3 standard deviations above the mean for all external sources, flag for review.",
              "Machine Learning: Use a time series anomaly detection model (e.g., ARIMA) on the aggregate count of signature matches per minute across all sources. An alert is triggered when a sudden, anomalous spike in signature matches is detected that deviates significantly from the forecasted normal range, indicating a possible coordinated scan."
            ]
          },
          {
            "description": "A single external source IP initiates connections to more than 20 distinct destination hosts on the same port (a horizontal scan) or more than 50 distinct destination ports on the same host (a vertical scan) within a 1-minute time frame.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek scan.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls/gateways",
            "action": [
              "Symbolic: Query Zeek conn.log to count distinct destination IPs (`id.resp_h`) per source IP (`id.orig_h`) and destination port (`id.resp_p`) in a 1-minute window. Alert if the count exceeds 20. Separately, count distinct destination ports per source IP and destination IP in a 1-minute window and alert if the count exceeds 50. Natively, review Zeek's `scan.log` for pre-identified scanning activity.",
              "Statistical: For each external source IP, calculate the Shannon entropy of the destination IP addresses it communicates with in a 5-minute window. An entropy score significantly higher than the baseline average for external sources (e.g., > 3.0) indicates a wide, non-targeted distribution characteristic of a horizontal scan. A similar calculation on destination ports for a single host can detect vertical scans.",
              "Machine Learning: Implement a clustering algorithm (e.g., DBSCAN) on connection data, using features such as source IP, destination IP, and destination port. Normal traffic will form dense clusters. Scanning activity from a single source to many destinations will be identified by the algorithm as noise or outlier points. Tag all outlier points as potential scanning activity for analyst review."
            ]
          },
          {
            "description": "An external source IP generates a ratio of HTTP 4xx (client error) to 2xx (success) status codes greater than 5:1 over a 10-minute period, with a total request volume exceeding 100 requests, indicating web content discovery.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers",
            "action": [
              "Symbolic: From Zeek http.log, filter for requests where the `uri` field matches a regex for sensitive files or paths (e.g., `/.git/`, `/.env`, `/wp-admin/`, `/.bak$`). Alert on any match from an external, non-authorized IP address.",
              "Statistical: For each external source IP in Zeek http.log, calculate the ratio of 4xx status codes to 2xx status codes over a 10-minute window. Flag any IP where this ratio exceeds 5:1 and the total request count is > 100. Also, calculate the 99th percentile for the number of 404 responses per source IP across a 24-hour period and alert on any IP exceeding this threshold in a given hour.",
              "Machine Learning: Train a time series forecasting model (e.g., Prophet) on the baseline volume of 4xx errors for the entire web server environment. Use the model to predict the expected error count for the next interval. An observed error count that significantly exceeds the model's prediction interval indicates an anomalous event, such as a large-scale forced browsing attack."
            ]
          },
          {
            "description": "An external source IP generates more than 100 DNS queries resulting in NXDOMAIN (non-existent domain) responses within a 5-minute window, or issues a DNS query of type AXFR/IXFR not originating from an authorized server.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative external DNS servers",
            "action": [
              "Symbolic: Monitor Zeek dns.log for any query where `qtype_name` is 'AXFR' or 'IXFR' originating from an IP not on an approved list of secondary DNS servers. Generate a high-severity alert for any such attempt.",
              "Statistical: For each source IP in Zeek dns.log, count the number of responses with `rcode_name` as 'NXDOMAIN' in a 5-minute window. Alert if the count exceeds a dynamic threshold set at the 99th percentile of the NXDOMAIN count for all external IPs over the last 24 hours.",
              "Machine Learning: Use an unsupervised learning model (e.g., Isolation Forest) to build a profile of normal DNS query patterns per source IP, based on features like query frequency, query type distribution, and NXDOMAIN rate. A new stream of activity is scored against this profile, and a high anomaly score indicates a deviation consistent with subdomain brute-forcing or service enumeration."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]