[
  {
    "information_requirement": "Is the adversary gathering information about our organization via CDNs?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.004",
        "name": "CDNs",
        "evidence": [
          {
            "description": "An external IP address, identified in threat intelligence feeds as malicious, connects to a CDN-hosted asset, or an HTTP request to a CDN-hosted asset contains a User-Agent string associated with a known reconnaissance tool (e.g., Nuclei, Nmap, Zgrab).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Web application firewalls (WAFs), CDN management consoles",
            "action": [
              "Symbolic: Correlate source IP addresses from Zeek conn.log and User-Agent strings from Zeek http.log against threat intelligence feeds of known malicious scanners, TOR exit nodes, and reconnaissance tools. Generate an alert for any direct match.",
              "Statistical: For IPs not on a blocklist, calculate the request rate to CDN assets. Compare the source IP's request rate to the 95th percentile of request rates for all external IPs over the same time period. Flag IPs with rates exceeding this threshold for further review.",
              "Machine Learning: Use a pre-trained classification model (e.g., a logistic regression or decision tree model) to score incoming HTTP requests based on features like source IP reputation, ASN, User-Agent string rarity, and request headers. A high probability score from the model indicates a likely reconnaissance attempt."
            ]
          },
          {
            "description": "An HTTP request from an external source IP targets a URL path on a CDN-hosted asset that matches a predefined list of sensitive files, directories, or diagnostic endpoints (e.g., /.git/config, /.env, /actuator/health), especially if the request results in an HTTP 404 status code.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web servers hosting CDN content, Application log aggregators",
            "action": [
              "Symbolic: Maintain a watchlist of sensitive URI paths (e.g., /.git/config, /.env, /actuator/health, /phpinfo.php). Create a detection rule that triggers an alert when an external IP requests a URI from this list in Zeek http.log.",
              "Statistical: For each external source IP, calculate the ratio of HTTP 404 responses to total requests (404 rate) within a 5-minute window. Flag IPs whose 404 rate exceeds a dynamic threshold, such as 3 standard deviations above the mean 404 rate for all external IPs, as this suggests directory/file enumeration.",
              "Machine Learning: Employ a sequence analysis model (e.g., using Long Short-Term Memory, LSTM) to analyze the sequence of URI paths requested by a single IP. Train the model on normal user browsing sequences. Flag sequences that deviate significantly from learned normal patterns, as this can indicate the structured, non-human probing of an automated scanner."
            ]
          },
          {
            "description": "A single external source IP generates a high volume of DNS queries for an organization's subdomains or makes HTTP requests to a large number of unique URL paths on CDN assets within a short time frame, exhibiting a high Shannon entropy value in the requested paths.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative and recursive DNS servers, Internet gateway",
            "action": [
              "Symbolic: Create a rule that alerts when a single source IP in Zeek dns.log queries for more than a predefined number (e.g., 50) of nonexistent (NXDOMAIN) subdomains within a 1-minute window.",
              "Statistical: For each source IP in Zeek http.log, calculate the Shannon entropy of the set of requested URI paths within a 10-minute window. Establish a baseline for normal entropy. Flag IPs with entropy scores exceeding the 98th percentile, as high entropy indicates non-sequential, likely automated, access patterns.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from web traffic, such as request count, ratio of unique paths, and average time between requests per source IP. Identify clusters of outlier IPs that do not conform to the large cluster of normal user behavior, indicating potential scanners."
            ]
          },
          {
            "description": "An external IP address establishes a direct TCP/TLS connection to a known origin server's IP, bypassing the CDN, where the TLS handshake presents a server certificate subject or serial number matching the one used on the public-facing CDN-hosted domain.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Origin web servers, Network perimeter firewalls, Network taps monitoring server-to-internet traffic",
            "action": [
              "Symbolic: Maintain a list of your origin server IP addresses and the serial numbers of their corresponding public TLS certificates. Create a rule that alerts when Zeek ssl.log shows a connection from an external IP directly to an origin server IP where the ssl.server_name does not match the IP and the certificate serial number matches a known public certificate. This indicates a direct IP connection using the public hostname.",
              "Statistical: Establish a baseline of normal, expected traffic to origin server IPs (e.g., from CDN nodes, management IPs). Monitor Zeek conn.log for connections to these IPs from sources outside the established baseline. Flag any source ASNs or countries that have a statistically insignificant amount of historical traffic to the origin servers.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA or Prophet) on the volume of non-CDN traffic to origin servers. An alert is generated when the observed traffic volume significantly exceeds the forecasted volume with its confidence interval, indicating an anomalous spike in direct-to-origin connections."
            ]
          },
          {
            "description": "A user workstation or non-administrator server generates DNS queries for CDN management portals or executes command-line tools (e.g., grep, findstr) to search for keywords like 'origin_server' or 'cdn_api_key' within local files or code repositories.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer workstations, CI/CD pipeline servers, Internal DNS servers, Version control systems",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for process creation of `grep`, `findstr`, `ack`, or `git` with command-line arguments containing keywords like 'origin_server', 'cdn_api_key', 'CNAME', or specific origin IP ranges. Alert if the process is initiated by a non-developer or outside of a CI/CD context.",
              "Statistical: For internal DNS queries in Zeek dns.log, calculate the rarity of each query-source host pair. Profile normal DNS behavior for different host roles (e.g., developer workstation, domain controller, web server). Flag queries from a host that are statistical outliers for its role, such as a finance department workstation querying a CDN provider's API endpoint, by identifying queries in the bottom 1st percentile of frequency for that host role.",
              "Machine Learning: Use a peer group analysis model to establish baselines of file access patterns (from Windows Event ID 4663) and process execution (from Windows Event ID 4688) for users within the same department or role. Flag a user as an outlier if their activity (e.g., accessing network configuration files, running network scanning tools) significantly deviates from the behavior of their peers."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]