[
  {
    "information_requirement": "Has the adversary forged authentication material (e.g., web cookies) to access web resources?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1606.001",
        "name": "Forge Web Cookies",
        "evidence": [
          {
            "description": "A successful web session authenticated via a session cookie originates from a source IP address listed on a high-confidence threat intelligence feed (e.g., known malicious proxy, TOR exit node, C2 server).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Web Proxies, Public-facing Web Applications",
            "action": [
              "Symbolic: Correlate the source IP (`id.orig_h`) from Zeek `conn.log` and `http.log` for all authenticated sessions against a list of known malicious IP addresses from a threat intelligence platform. Generate an alert for any exact match.",
              "Statistical: For IPs not on a blocklist, calculate the historical rarity of the source Autonomous System Number (ASN) for each user. Alert if a session originates from an ASN that accounts for less than 1% of the user's historical sessions.",
              "Machine Learning: Use a reputation scoring model for IP addresses that considers features like ASN, geolocation, and previous associations with malicious activity. Classify sessions as high-risk if the source IP's reputation score exceeds a dynamic threshold determined by the model."
            ]
          },
          {
            "description": "A user's authenticated web session exhibits 'impossible travel' characteristics, where the time elapsed between the user's current and previous geolocated session is insufficient for physical travel between the two locations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, VPN Concentrators, Public-facing Web Applications, Cloud Service Gateways",
            "action": [
              "Symbolic: For each new user session, retrieve the timestamp and geolocation of the previous session. If `(current_timestamp - previous_timestamp) < calculate_travel_time(previous_location, current_location)`, flag the session as impossible travel. Generate a high-severity alert.",
              "Statistical: Establish a baseline of typical geolocations (countries, cities) for each user. Calculate a risk score based on the rarity of the current session's geolocation compared to the user's historical distribution. Alert if the session's location is in the bottom 5th percentile of frequency for that user.",
              "Machine Learning: Train a user-specific time-series model on session geolocation sequences. Use the model to predict the probability of the next session's location. A session from a low-probability location indicates an anomaly and potential forged cookie use."
            ]
          },
          {
            "description": "An authenticated web session uses a User-Agent string that is anomalous for the specific user or for the organization as a whole, or exhibits a combination of multiple low-probability session characteristics (e.g., rare User-Agent, unusual time of day, rare geolocation).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Applications, Web Proxies, Internet Gateway",
            "action": [
              "Symbolic: Maintain a list of known-bad or suspicious User-Agent strings associated with penetration testing tools or malicious frameworks (e.g., `sqlmap`, `Metasploit`, `python-requests`). Alert on any session containing a User-Agent from this blocklist.",
              "Statistical: For each user, profile their top 5 most common User-Agent strings. Calculate the Shannon entropy of the User-Agent string for each new session. A high entropy score or a User-Agent not in the user's typical set indicates a potential anomaly. Alert if a user's session User-Agent has not been seen in the last 90 days for that user.",
              "Machine Learning: Develop a multi-variate anomaly detection model (e.g., Isolation Forest) using features such as time-of-day, day-of-week, source ASN, source country, and User-Agent rarity. The model will score each session, and scores exceeding a learned threshold will be flagged as a potential forged cookie session."
            ]
          },
          {
            "description": "A successful authenticated web session to a corporate application is observed from an external IP address, but there is no corresponding preceding interactive or remote logon event (e.g., Windows Logon Type 2, 3, or 10) from that user on any managed corporate endpoint.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Active Directory Domain Controllers), Endpoints, Public-facing Web Applications",
            "action": [
              "Symbolic: For each authenticated web session identified in `Zeek http.log`, query for a successful Windows logon event (Event ID 4624 with Logon Type 2, 3, or 10) for the same user within a preceding 30-minute window. If no corresponding logon event is found, generate an alert.",
              "Statistical: Analyze the time delta between a user's interactive logon on a corporate device and their subsequent web application access. Profile this distribution for each user. Alert if a web session occurs with a time delta that falls outside 2 standard deviations of the user's mean, or if no preceding logon is found at all.",
              "Machine Learning: Use a sequence analysis model to learn typical event chains for users (e.g., `Logon -> Outlook -> SharePoint`). A sequence starting with `SharePoint` access without a preceding `Logon` event would be flagged as a high-risk anomaly, indicative of a session initiated with a forged or stolen artifact."
            ]
          },
          {
            "description": "Following a successful authentication with a potentially forged cookie, the user session demonstrates anomalous post-access behavior, such as enumerating data at a high rate, accessing unusual administrative functions, or attempting large data exfiltration.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Applications, File Servers, Database Servers",
            "action": [
              "Symbolic: Create rules to detect access to sensitive or administrative URL paths (e.g., `/admin`, `/api/v1/users/export`, `/backup`) that are not part of the user's normal role-based access pattern. Alert immediately on a match.",
              "Statistical: For each user, establish a baseline for the number of HTTP requests per minute within an application session. Use a sliding window to monitor request frequency. Alert if the request rate exceeds the 99th percentile of the user's historical behavior. Additionally, calculate the Shannon entropy of the requested URL paths within a session; a sudden spike in entropy indicates directory enumeration.",
              "Machine Learning: Apply a time-series anomaly detection algorithm (e.g., LSTM) to the volume of data transferred (`resp_body_len` in `http.log` or `total_bytes` in `files.log`) per session. The model, trained on normal user behavior, can detect sudden spikes in data transfer indicative of data exfiltration following a compromised session."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]