[
  {
    "information_requirement": "Is the adversary performing discovery by enumerating system logs?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1654",
        "name": "Log Enumeration",
        "evidence": [
          {
            "description": "A process execution event (Windows Event ID 4688) where the process hash matches a known malicious log enumeration tool, correlated with a subsequent network connection (Zeek conn.log) to a destination IP or domain on a threat intelligence feed within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers; Network Egress Points",
            "action": [
              "Symbolic: Create a SIEM rule to alert on any process creation event (Windows Event ID 4688) where the 'ProcessHash' matches a value in a threat intelligence feed for log enumeration tools. Correlate this with any network connection from the same host (Zeek conn.log) where the destination IP ('id.resp_h') or resolved domain ('dns.log') matches a CTI feed of known C2 servers.",
              "Statistical: For each process that accesses log files, calculate the Jaccard similarity between the destination IPs it connects to and a set of known malicious IPs. Flag any process where the similarity score exceeds a predefined threshold (e.g., > 0.5), indicating significant overlap with known malicious infrastructure.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from process execution (parent process, user context) and subsequent network traffic (bytes out, destination port, JA3 hash). The model should classify the process-network sequence as 'benign' or 'malicious log exfiltration'. Flag any sequence classified as malicious with a high confidence score."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a native utility (wevtutil.exe, powershell.exe) containing command-line arguments indicative of log querying, exporting, or filtering, such as 'wevtutil qe', 'Get-WinEvent -FilterHashtable', or 'Select-String -Path '*.evtx'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers; Domain Controllers",
            "action": [
              "Symbolic: Deploy a SIEM rule using regular expressions to detect process creation events (Windows Event ID 4688) for 'wevtutil.exe' or 'powershell.exe' where the command line contains strings like 'qe', 'epl', 'Get-WinEvent', 'Get-EventLog', or '*.evtx'. Alert on any match not associated with a known administrative task.",
              "Statistical: For each user, establish a baseline of normal command-line argument patterns for 'powershell.exe' and 'wevtutil.exe'. Calculate the term frequency-inverse document frequency (TF-IDF) score for suspicious arguments ('qe', 'epl', etc.) within a user's session. Alert when the TF-IDF score for these terms for a specific user exceeds the 95th percentile of their historical activity.",
              "Machine Learning: Use a Natural Language Processing (NLP) model to classify the intent of PowerShell command lines. Fine-tune the model on a labeled dataset of benign administrative scripts vs. malicious discovery commands. Trigger an alert for any command line classified as 'Log Enumeration' with high probability."
            ]
          },
          {
            "description": "A single process (identified by 'ProcessID' in Windows Event ID 4663) accesses a statistically unusual number of unique log files ('*.evtx') within a short time frame (e.g., under 1 minute), deviating from its established baseline.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on Domain Controllers; File systems on critical servers hosting application logs",
            "action": [
              "Symbolic: With object access auditing enabled for 'C:\\Windows\\System32\\Winevt\\Logs\\', create a rule that triggers if a user account, other than 'SYSTEM' or known service accounts, generates more than 10 file access events (Windows Event ID 4663) for different '.evtx' files within 60 seconds.",
              "Statistical: For each process, establish a baseline of the number of unique log files accessed per hour. Monitor for deviations using a z-score calculation. Alert when a process's unique log access count exceeds 3 standard deviations from its own or its parent process's baseline. Additionally, calculate the Shannon entropy of the log filenames accessed by a process in a 5-minute window; a high entropy score suggests indiscriminate enumeration and should be flagged.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume of log file access events (Windows Event ID 4663) per host. The model will learn the normal rhythm of log access. Alert on any spike that the model flags as a significant anomaly."
            ]
          },
          {
            "description": "A temporal sequence of events where a process accesses system logs (Windows Event ID 4663) and is followed within 5 minutes by an outbound network connection (Zeek conn.log) from the same host, where the connection's data volume ('orig_bytes') is a statistical outlier.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers; Network Egress Points; DNS Servers",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a Windows Event ID 4663 (Object Access) for a '.evtx' file is followed within 5 minutes by a Zeek 'conn.log' event from the same source IP, where the destination port is not a standard web port (e.g., not 80, 443, 8080) and the connection is to an IP with no prior history in the last 30 days.",
              "Statistical: For each host, model the relationship between log access events and outbound data volume using linear regression. Flag any instance where a log access event is followed by an outbound connection whose data volume is in the top 5th percentile of the prediction error (residual), indicating an unexpectedly large data transfer.",
              "Machine Learning: Develop a Hidden Markov Model (HMM) where the states are 'Benign Activity', 'Log Access', and 'Data Exfiltration'. Use sequences of process events, file access, and network connections as observations. An alert is triggered if the model transitions to the 'Data Exfiltration' state with high probability immediately after being in the 'Log Access' state."
            ]
          },
          {
            "description": "The generation of Windows Event ID 1102, indicating the audit log was cleared, particularly when correlated with recent anomalous process execution or login activity on the same host within the previous hour.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers; Security-critical servers (e.g., PKI, RADIUS); Workstations of Privileged Users",
            "action": [
              "Symbolic: Create a critical severity alert that fires immediately upon detection of Windows Event ID 1102 ('The audit log was cleared'). This event should be considered an Indicator of Compromise and trigger an automated incident response playbook.",
              "Statistical: Analyze the temporal distribution of log clearing events (Event ID 1102) across the enterprise. An event occurring outside of established maintenance windows or on a host that has never had this event before should have its risk score elevated. Compare the time of the event to the user's typical activity hours; an event at 3 AM from a 9-to-5 user is highly anomalous.",
              "Machine Learning: Train a Bayesian network to calculate the probability of malicious intent given an Event ID 1102. The model should take as input preceding events within a 1-hour window, such as logins from rare geolocations (Event ID 4624) or execution of high-entropy command lines (Event ID 4688). A high posterior probability of maliciousness triggers a priority alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]