[
  {
    "information_requirement": "Is the adversary causing financial impact through theft?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1657",
        "name": "Financial Theft",
        "evidence": [
          {
            "description": "A network connection is established to or from an IP address, domain, or URL on a threat intelligence feed associated with ransomware operations, financial malware C2, or cryptocurrency mining pools.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, including internet gateways, DNS resolvers, and web proxies.",
            "action": [
              "Symbolic: Continuously correlate network logs (Zeek conn.log connections, dns.log queries, http.log requests) against high-confidence threat intelligence feeds identifying infrastructure used for ransomware, banking trojans, or cryptocurrency miners. Generate a high-priority alert for any match.",
              "Statistical: For all outbound TLS connections, calculate the JA3 hash. Identify statistically rare JA3 hashes not previously seen or seen in less than 1% of connections. Alert on connections using a rare JA3 hash to a destination IP or domain with a low reputation score or that falls into a financial category.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from Zeek conn.log (duration, protocol, byte counts, connection state) and dns.log (query length, entropy) to distinguish benign from malicious traffic. Use labeled data from past incidents and threat intelligence to predict the probability of a connection being part of a financial theft operation."
            ]
          },
          {
            "description": "A process is created with a name or command-line arguments matching known financial fraud tools, ransomware, or cryptomining software.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints and servers, particularly those used by Finance/Accounting personnel or hosting financial applications.",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 (Process Creation) for process names (e.g., xmrig.exe) or command-line arguments that match a watchlist of known cryptomining software or financial theft tools. Update this watchlist from threat intelligence feeds.",
              "Statistical: For each host, establish a baseline of normal process execution frequency and command-line argument entropy. Flag any process whose execution frequency exceeds 3 standard deviations from its norm or any powershell.exe/cmd.exe instance with a command-line entropy score in the 99th percentile, suggesting obfuscation.",
              "Machine Learning: Use an unsupervised learning algorithm like Isolation Forest on process features (parent process, command-line length, user context, token elevation) from Windows Event ID 4688 to identify anomalous process creation events that do not conform to normal host behavior. These outliers represent potential malware execution."
            ]
          },
          {
            "description": "An email is received exhibiting characteristics of a Business Email Compromise (BEC) attempt, such as a spoofed display name, a lookalike domain, or content with keywords requesting an urgent financial transaction.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email gateways, mail servers, and network sensors monitoring SMTP traffic.",
            "action": [
              "Symbolic: Analyze Zeek smtp.log headers to detect discrepancies between 'From' and 'Reply-To'/'Return-Path' fields. Use regular expressions to search for lookalike domains (e.g., 'acme-corp.com' vs 'acmecorp.co') and scan subjects for keywords like 'urgent payment', 'wire transfer', or 'updated invoice'.",
              "Statistical: Profile the organizational communication graph to establish sender-recipient frequency baselines. A purported executive emailing an accounts payable clerk for the first time with a financial request is a statistical anomaly. Flag any financially-themed email where the sender-recipient pair has a communication frequency in the bottom 5th percentile.",
              "Machine Learning: Use a Natural Language Processing (NLP) classification model to analyze email body text. Train the model on a labeled dataset of legitimate and BEC emails to classify incoming messages based on urgency, sentiment, and linguistic patterns indicative of social engineering."
            ]
          },
          {
            "description": "A sequence of events occurs where a high-risk account login is followed by activity related to financial systems, such as connections to banking websites or changes to payment applications.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory), VPN concentrators, SSO platforms, and network egress points.",
            "action": [
              "Symbolic: Create a rule that triggers when a successful login (Windows Event ID 4624) from a TOR exit node or known malicious IP is followed within 30 minutes by a network connection (Zeek conn.log) from the same internal host to a known financial services website.",
              "Statistical: For each user, create a multi-faceted baseline of login attributes (source country, ISP, time of day). Assign a risk score to each login based on deviations (e.g., new country=+3, unusual hour=+1). Correlate logins with a risk score in the 98th percentile with subsequent POST requests (Zeek http.log) to URIs containing 'transfer' or 'payment'.",
              "Machine Learning: Model the sequence of user actions using a Hidden Markov Model (HMM) or an LSTM autoencoder. Train the model on normal user workflows (e.g., login -> access email -> access internal wiki). Flag sequences that deviate from the learned normal patterns, such as a high-risk login immediately followed by access to a payment portal."
            ]
          },
          {
            "description": "A user or system process accesses a sensitive financial application, directory, or database outside of established normal behavior, followed by anomalous network activity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Financial databases (e.g., ERP systems), payment processing servers, and file servers containing sensitive accounting or payroll data.",
            "action": [
              "Symbolic: Create an alert that triggers on any access attempt (Windows Event ID 4663) to a critical financial file share from a user account or process not on an explicit allow list, especially if the access is for write or delete permissions.",
              "Statistical: For critical financial servers, baseline the number of unique users accessing them per hour and the time-of-day of access. Monitor for statistical outliers, such as a server being accessed at 3 AM when normal activity is between 9 AM and 5 PM, or by a number of users that exceeds 3 standard deviations from the hourly average.",
              "Machine Learning: Use peer group analysis (unsupervised clustering) to group users based on their data access patterns. When a user's activity (derived from Windows Event ID 4663) deviates significantly from their assigned peer group's behavior (e.g., a marketing user accessing the payroll database), flag it as a policy violation anomaly."
            ]
          },
          {
            "description": "An anomalous volume or composition of outbound data is transferred from a critical data repository, suggesting data exfiltration for extortion purposes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical data repositories, database servers, file servers, and network egress points.",
            "action": [
              "Symbolic: Monitor Zeek files.log for outbound transfers of file types not normally sent from sensitive servers (e.g., database backups like .bak, large archives like .zip or .7z). Alert if the file MIME type is 'application/zip' and the source is a production database server.",
              "Statistical: For key servers, establish a time-series baseline of outbound data volume (sum of `orig_bytes` in Zeek conn.log). Use the interquartile range (IQR) method to detect outliers; alert when the data volume in a 1-hour window exceeds the 75th percentile plus 1.5 times the IQR.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) on features of normal outbound connections from sensitive servers (e.g., destination IP, port, data volume, protocol, duration). This model creates a boundary around 'normal' activity. Any new connection that falls outside this boundary is classified as a potential exfiltration attempt."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]