[
  {
    "information_requirement": "Is the adversary attempting to inhibit or disable safety and protection functions by manipulating device operational modes? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0800",
        "name": "Activate Firmware Update Mode",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) is observed on an Engineering Workstation (EWS) for a known firmware update utility or scripting engine. The command-line arguments contain keywords associated with firmware updates or device mode changes (e.g., 'firmware', 'flash', 'maintenance', '/f'). This host event is temporally correlated (within 90 seconds) with one of two network phenomena observed in Zeek logs: 1) a large file transfer (e.g., >1MB as seen in conn.log or a file with a 'application/octet-stream' MIME type in files.log) from the EWS to a target ICS device, or 2) a complete and sustained cessation (>120 seconds) of the ICS device's expected periodic communications (e.g., status polls, heartbeats) that is not aligned with a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), and Jump Servers within the Process Control and Supervisory network segments (Purdue Level 2/3), and network TAPs monitoring traffic to and from these assets.",
            "action": [
              "Create a SIEM rule that triggers on Windows Event ID 4688 from hosts within the EWS/HMI NAI where the new process name is a known vendor utility or scripting engine (e.g., 'UnityPro.exe', 'Studio5000.exe', 'TiaPortal.exe', 'powershell.exe', 'putty.exe') AND the command line contains keywords like 'firmware', 'update', 'flash', 'reset', 'maintenance', 'mode'. Correlate this host event within 90 seconds with network logs. Escalate if Zeek logs show a connection from the source host to a critical ICS asset IP where either a) conn.log 'orig_bytes' > 1MB on a relevant port (e.g., 21, 69, 80, 502) or b) files.log shows a transfer with a firmware-related filename or MIME type.",
              "For each EWS, establish a 30-day rolling baseline of command-line arguments for common engineering tools and scripts. For each new execution, calculate the Jaccard similarity between its set of arguments and the set of all historical arguments for that process. Alert if the similarity score is below a threshold (e.g., < 0.2), indicating a novel command structure. Concurrently, for each critical ICS device, baseline the inter-arrival time of its periodic heartbeat messages. If the host-based command-line anomaly occurs, check if the inter-arrival time for the target device's heartbeats exceeds the 99.9th percentile of its baseline within the next 5 minutes.",
              "Train a supervised classification model (e.g., Random Forest) on labeled Windows Event ID 4688 data. Features should include: process name, parent process name, command-line entropy, count of special characters in command line, user context, and time-of-day. The model will classify each event as 'Benign', 'Authorized Maintenance', or 'Suspicious-Update'. Feed 'Suspicious-Update' classifications into a secondary LSTM (Long Short-Term Memory) autoencoder model that processes time-series data from Zeek logs (e.g., 1-minute aggregations of byte volume, packet count, and protocol mix to the target device). An alert is generated when the classifier flags a suspicious process and the LSTM's reconstruction error for the device's network behavior spikes, indicating a deviation from learned normal patterns."
            ]
          },
          {
            "description": "A specific, low-prevalence ICS protocol command intended to alter a device's operational state is observed in network traffic. Examples include a Modbus Write Multiple Registers (Function Code 16) command to a vendor-documented mode-control register address, a DNP3 Function Code 13 (Cold Restart), or an EtherNet/IP 'Set_Attribute_Single' service call targeting a device's state or mode object. The command's appearance is immediately followed by a statistically significant and sustained deviation from the device's established communication baseline, such as a complete halt in polling responses or heartbeat messages for over 120 seconds.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensor appliances (e.g., Zeek sensors) deployed on SPAN ports or network TAPs at the boundaries between Purdue Levels 1 (Basic Control), 2 (Area Supervisory Control), and 3 (Site Control), with a focus on traffic flows involving critical PLCs, RTUs, and protection relays.",
            "action": [
              "Deploy SIEM rules that monitor Zeek's ICS protocol logs for state-change commands targeting critical assets, such as `(log_source='zeek_modbus.log' AND function_code IN ['16', '17'])` or `(log_source='zeek_dnp3.log' AND function_code='13')`. Enrich these events by checking if the source IP is on an approved engineering station allowlist and if the event occurs within a pre-documented maintenance window. If either check fails, generate a high-priority alert.",
              "For each critical ICS device, establish a 30-day rolling baseline of its communication profile using Zeek's protocol logs. Track the distribution of read vs. write function codes (e.g., Modbus reads vs. writes) and the mean time between polling requests. Trigger an alert if, within 5 minutes of a potential state-change command, the ratio of write-to-read commands for that device exceeds its 99th percentile, or the time between expected polling responses exceeds its 99.5th percentile for a sustained period (e.g., > 120 seconds).",
              "Implement a multivariate time-series anomaly detection model, such as a Variational Autoencoder (VAE), for each critical device group. The model's feature vector should be derived from 1-minute aggregations of Zeek log data, including: connection count, total bytes, entropy of destination ports, distribution of Modbus function codes, count of DNP3 object groups, and rate of ENIP service calls. An alert is generated when the model's reconstruction error for a given time window exceeds a dynamic threshold (e.g., > 99.8th percentile of errors from a clean training dataset), indicating the device's communication pattern is highly anomalous and inconsistent with its learned 'normal' behavior."
            ]
          },
          {
            "description": "A critical ICS device (e.g., PLC, protection relay) becomes unresponsive to application-layer health or status queries, while still responding to lower-level network probes like ICMP echo requests. This condition persists for a duration that is inconsistent with a normal reboot cycle (e.g., > 10 minutes) and is not correlated with a scheduled maintenance window, suggesting the device is online but its primary functions are inhibited.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek icmp.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs monitoring traffic to and from critical controllers (PLCs, RTUs, IEDs) in Purdue Level 1 and 2, and the central network core where ICMP traffic might be observed.",
            "action": [
              "Create a SIEM rule that maintains a state table of critical ICS assets and their 'last_app_response' timestamp, updated by seeing traffic like a Modbus response. A separate rule updates a 'last_icmp_response' timestamp from Zeek icmp.log. A high-priority alert is triggered if `(now() - last_app_response > 10 minutes)` AND `(now() - last_icmp_response < 2 minutes)`, indicating the device is on the network but not performing its function.",
              "For each critical device, baseline the typical duration of its TCP sessions on control ports (e.g., 502 for Modbus) using Zeek conn.log. Alert if a TCP session to one of these ports remains in an ESTABLISHED state with zero application-layer data transfer (`orig_bytes` and `resp_bytes` are static) for a duration that exceeds the 98th percentile of all historical session durations for that device-port pair. This may indicate a hung process or a device stuck in a non-operational mode.",
              "Develop a time-series forecasting model (e.g., Prophet) for each device's expected application-layer response count, aggregated in 1-minute bins. The model learns the daily/weekly seasonality of the device's activity, including normal maintenance periods. An alert is generated if the actual observed response count is zero for several consecutive bins where the model's forecast (including its uncertainty interval) was significantly greater than zero. This anomaly is cross-validated with ICMP responsiveness to confirm the device is still online before escalating."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]