[
  {
    "information_requirement": "Is an adversary executing commands on critical ICS assets via a command-line interface?",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0807",
        "name": "Command-Line Interface",
        "evidence": [
          {
            "description": "Evidence of this indicator is observed when a parent process associated with a known ICS management shell (e.g., cmd.exe, powershell.exe, or vendor-specific CLIs like Rockwell's RSHelper.exe or Siemens' WinCCExplorer.exe) on a critical ICS asset spawns a child process (e.g., net.exe, ipconfig.exe, whoami.exe, certutil.exe, nmap.exe) that is either not on a pre-defined whitelist for that parent/host combination, has not been observed in the last 90 days, or represents a statistically rare occurrence (e.g., below the 0.01st percentile of all child processes for that parent over a 30-day period).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Process Control Servers (PCS), Data Gateways, Application Servers within the Process Control Network (PCN) and Manufacturing Zone (MZ).",
            "action": [
              "Create and maintain a strict whitelist of allowed parent-child process relationships for critical ICS assets, defined as a tuple of (hostname, parent_process_path, child_process_path). Implement a SIEM rule to generate a high-severity alert for any process creation event (Windows Event ID 4688) where the parent process is a known shell and the child process is not on the explicit whitelist for that parent-host pair.",
              "For each ICS host, create a 90-day rolling baseline of parent-child process relationships from Windows Event ID 4688 data. For each parent process, calculate the execution frequency of all its child processes. Generate a medium-severity alert when a child process is spawned that has not been observed in the 90-day baseline for that parent-host pair. Escalate to high-severity if the child process is also a known living-off-the-land binary (LOLBin) or is executed with reconnaissance parameters.",
              "For each critical host, model the hourly count of unique child processes spawned by each shell process (e.g., powershell.exe, cmd.exe) as a distinct time series. Apply a seasonal-hybrid anomaly detection algorithm (e.g., Seasonal-ARIMA or Prophet) to account for regular operational cycles like shift changes or automated batch jobs. Alert on any data point flagged as a statistical anomaly (e.g., a count exceeding 3 standard deviations from the forecast), suggesting an abnormal burst of diverse command executions indicative of enumeration or script execution."
            ]
          },
          {
            "description": "A successful remote interactive logon (e.g., RDP, SSH) to a critical ICS asset from an untrusted or unexpected network segment is followed within a short time window (e.g., 90 seconds) by command-line process creation under the same logon session. The activity is considered anomalous if the command has not been executed by that user from that source subnet in the last 90 days, or if the logon and execution occur outside of pre-defined operational hours or maintenance windows.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS DMZ/Perimeter, Remote Access Gateways, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Jump Servers, and Terminal Servers within the ICS network.",
            "action": [
              "Create a SIEM correlation rule that links a successful remote logon (Windows Event ID 4624 with Logon Type 10 for RDP, or Zeek ssh.log with auth_success='true') with a subsequent Windows Event ID 4688 from the same Logon ID or user context within a 90-second window. The rule triggers if the source IP in the logon event is from a non-RFC1918 address or a subnet not on the approved remote access list AND the command line contains reconnaissance commands (e.g., whoami, net user, systeminfo, ipconfig, tasklist, quser).",
              "For each user account, build a 90-day baseline profile of remote access behavior. For a new remote session, calculate a risk score starting at 0. Add points for deviations: login from a new ASN (+2); login from a country not seen in 90 days (+3); login outside of defined maintenance windows (e.g., 22:00-06:00 local time) (+2); Jaccard similarity of executed commands to the user's historical command set is less than 0.2 (+5). Alert on any session with a cumulative score exceeding a defined threshold (e.g., 6).",
              "For each user, create a feature vector for each remote session summarizing its behavior. Features should include: session duration, number of processes spawned, average command-line entropy, ratio of read-only vs. modification commands (e.g., 'dir' vs. 'del'), count of network-related commands ('ping', 'net', 'ipconfig'), and the median time between commands. Train an unsupervised anomaly detection model like Isolation Forest or a Variational Autoencoder (VAE) on the historical session vectors for all users. Score each new session in real-time and alert on sessions identified as outliers."
            ]
          },
          {
            "description": "A command-line execution on an ICS asset contains indicators of obfuscation, defense evasion, or discovery. This includes the use of suspicious string patterns (e.g., 'powershell -enc', 'Invoke-Expression'), command-line arguments exhibiting high Shannon entropy (e.g., > 4.5) indicative of encoding, or the use of legitimate engineering software command-line utilities with unusual parameters to interact with field devices.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows-based ICS assets, including HMIs, EWS, Historian Servers, Process Control Servers (PCS), and Data Gateways within the Process Control Network (PCN) and higher zones.",
            "action": [
              "Deploy a SIEM rule that uses regular expressions to scan the command-line field of Windows Event ID 4688 events. The rule should alert on the presence of known malicious patterns, such as PowerShell encoding flags ('-e', '-enc'), download cradles ('IEX(New-Object Net.WebClient).DownloadString'), file transfer utilities used with remote URLs ('bitsadmin /transfer', 'certutil -urlcache'), or attempts to manipulate system state ('reg save', 'wevtutil cl').",
              "Continuously analyze all command lines from Windows Event ID 4688. For each command, calculate the Shannon entropy of the arguments. Alert when a command's entropy exceeds a high, fixed threshold (e.g., 4.5) or deviates more than 3 standard deviations from the historical baseline for that specific executable. Additionally, calculate the ratio of non-alphanumeric characters to total characters in the arguments and alert if this ratio exceeds the 99th percentile for that process, as it may indicate obfuscation.",
              "Train a supervised text classification model (e.g., a Long Short-Term Memory (LSTM) network) on a labeled dataset of benign and malicious command lines sourced from ICS-specific honeypots and incident reports. Features should include character-level n-grams, command line length, entropy, and special character ratios. Deploy the model to classify incoming command lines in real-time and alert on any command classified as malicious with a confidence score greater than 0.9."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary collecting sensitive project files or configuration data from our ICS assets? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0807",
        "name": "Command-Line Interface",
        "evidence": [
          {
            "description": "Evidence of local data collection is present when a command-line interpreter (`cmd.exe`, `powershell.exe`) executes file system enumeration or data movement commands (`dir`, `copy`, `type`, `xcopy`, `robocopy`, `findstr`, `certutil`, `bitsadmin`) targeting directories known to contain critical ICS data or files with sensitive extensions (e.g., `.ACD`, `.L5K`, `.SCX`, `.HMI`, `.cfg`, `.bak`, `.sql`). This activity is confirmed as malicious when it meets several criteria simultaneously: the count of unique sensitive files accessed by a user or process within a 5-minute window exceeds the 99th percentile of their established baseline; the command is followed by the invocation of an archiving utility (`tar`, `zip`, `7z`); and the parent process is not on an approved whitelist (e.g., the command originates from a web server process or Microsoft Office application instead of `explorer.exe`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5145",
              "Zeek conn.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Data Historians, Asset Management Servers, Process Control Servers, File Shares hosting ICS project files (e.g., .ACD, .L5K, .SCX, .HMI), and Jump Servers providing access to the OT network.",
            "action": [
              "Create a correlation rule in the SIEM that triggers an alert when a Windows Event ID 4688, showing the launch of `cmd.exe` or `powershell.exe`, is observed with a command line containing file access keywords (`dir`, `copy`, `type`, `xcopy`, etc.) and a target path matching a list of sensitive ICS directories or file extensions (`.ACD`, `.L5K`, etc.). The alert's severity is escalated if this event is followed within 60 seconds by a Windows Event ID 5145 from the same host, showing access to a file on a designated sensitive file share, and the parent process in the initial Event 4688 is not `explorer.exe` or another whitelisted administrative tool.",
              "For each user and host combination in the NAI, ingest Windows Event ID 5145 and Zeek `smb_files.log` to establish a 30-day baseline of hourly activity. Profile two key metrics: 1) the count of unique sensitive ICS files accessed, and 2) the total volume of data read from sensitive file shares. Calculate a composite risk score for each user by converting their hourly metrics into z-scores against their individual baseline. An alert is generated when a user's composite score (e.g., the sum of the two z-scores) exceeds a set threshold (e.g., >4), indicating a statistically significant deviation in both access patterns and data volume.",
              "From Windows Event ID 4688 logs, extract feature vectors for each `cmd.exe` and `powershell.exe` execution, including command-line length, argument count, character entropy, and boolean flags for sensitive keywords and file extensions. Apply the DBSCAN clustering algorithm to this feature set. Analyze the output: small, dense clusters and points classified as noise represent anomalous command-line activity that deviates from established operational patterns and warrant investigation as potential low-and-slow collection. For time-series analysis, apply an Isolation Forest model to the per-hour frequency of file access commands (from Event ID 4688) and data transfer volume (from Zeek `smb_files.log`), using temporal features like hour-of-day and day-of-week. This model can detect sudden, bursty collection activities that might not trigger simple threshold-based alerts."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]