[
  {
    "information_requirement": "Is an adversary inhibiting our response function by blocking critical reporting messages? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0804",
        "name": "Block Reporting Message",
        "evidence": [
          {
            "description": "An unexpected process termination (Windows Event ID 4689) of a critical ICS application on a key asset (e.g., HMI, historian) is temporally correlated with a sustained drop in expected ICS protocol traffic volume (e.g., Modbus, DNP3) from that asset, as measured in network flow logs.",
            "data_sources": [
              "Windows Event ID 4689",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Historian Servers, OPC Servers within the Process Control Network (PCN) segments.",
            "action": [
              "Implement a correlation rule that triggers on Windows Event ID 4689 (A process has exited) for any process on a watchlist of critical ICS applications (e.g., opcserver.exe, rslinx.exe). Upon triggering, the rule must query for the parent process (Windows Event ID 4688) from the same host within the prior 30 seconds. Generate a high-priority alert if the parent process is an interactive shell or remote administration tool (e.g., cmd.exe, powershell.exe, psexec.exe) and the event is not associated with a scheduled maintenance window.",
              "For each host on a critical ICS asset list, establish a 14-day rolling baseline of network traffic volume (sum of orig_bytes + resp_bytes per minute) for its designated ICS protocol port (e.g., TCP 502 for Modbus) using Zeek conn.log. Following a process termination alert from the symbolic rule, query the traffic volume for the subsequent 5-minute interval. Generate a correlated alert if the average traffic volume drops below the 5th percentile of the historical baseline, indicating a statistically significant loss of reporting.",
              "Deploy a time-series forecasting model (e.g., ARIMA, Prophet) for each critical ICS host, trained on historical Zeek conn.log data (total bytes per minute on specific ICS ports). Continuously predict the expected traffic volume for the next interval. Generate an alert when the observed traffic volume falls below the model's lower prediction boundary (e.g., lower bound of a 95% confidence interval) for a sustained period (e.g., more than 3 consecutive minutes), and escalate the alert if temporally correlated with a critical process termination event (Windows Event ID 4689) on the same host."
            ]
          },
          {
            "description": "A host-based firewall rule is added or modified (Windows Event IDs 4947, 4950, 4956) on a critical ICS asset to block an essential ICS protocol port (e.g., TCP 502 for Modbus), followed by an immediate and sustained absence of traffic on that port from that host.",
            "data_sources": [
              "Windows Event ID 4947",
              "Windows Event ID 4950",
              "Windows Event ID 4956",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMIs, Historian Servers, Application Servers in the Process Control Network (PCN), and Industrial Demilitarized Zone (IDMZ) servers that bridge IT/OT networks.",
            "action": [
              "Create a detection rule that monitors for Windows Event IDs 4947 (Rule Added), 4950 (Setting Changed), or 4956 (Rule Modified) on a watchlist of critical ICS assets. The rule must parse the event data to identify the Rule Action, Direction, and Port. Generate a high-priority alert if a 'Block' rule is applied to a monitored ICS protocol port, and cross-reference the event timestamp with a change management database to suppress alerts for authorized activities.",
              "Upon an alert from the firewall modification rule, automatically query Zeek conn.log data for the affected host and port. Compare the average traffic volume (sum of orig_bytes + resp_bytes per minute) in the 10 minutes following the event to a 14-day rolling baseline. Escalate the alert if the post-event average traffic volume drops by more than three standard deviations from the baseline mean or falls below the 5th percentile, confirming a statistically significant traffic disruption.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) to score new firewall changes (Windows Event IDs 4947/4950/4956) as benign or malicious. Engineer features from event data and enrichment, such as: is_ics_port (boolean), is_critical_asset (boolean), time_of_day_bucket (e.g., business_hours, off_hours), user_is_service_account (boolean), and is_in_change_window (boolean). Deploy the model to score new events in real-time and generate an alert for any change classified as 'malicious' with a confidence score exceeding 0.85."
            ]
          },
          {
            "description": "An anomalous surge in network traffic directed at a critical ICS endpoint (e.g., HMI, Historian) results in a denial-of-service condition, identified by a high volume of failed connections and a corresponding drop in legitimate ICS protocol communications from expected sources.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of HMIs, Historians, and Control Servers; network segments/VLANs dedicated to process control.",
            "action": [
              "From Zeek conn.log, create a rule that alerts when the ratio of failed connections (conn_state of 'S0', 'REJ', 'RSTR') to total connection attempts for a critical ICS endpoint exceeds 80% over a 5-minute window. A secondary condition must confirm that the volume of established, legitimate traffic (e.g., service = 'modbus' or 'dnp3') from known SCADA sources to the same endpoint has dropped by more than 90% compared to the previous 1-hour average.",
              "For each critical ICS endpoint, establish a 30-day baseline for: a) total inbound connections per minute, and b) the Shannon entropy of source IP addresses connecting to its ICS ports. Trigger an alert if, within a 1-minute window, the connection count exceeds the baseline mean by 5 standard deviations AND the source IP entropy score drops below the 10th percentile (indicating a flood from few sources). Correlate this with a simultaneous drop in the average 'duration' of established connections for legitimate traffic.",
              "Implement an unsupervised anomaly detection model, such as an Isolation Forest or Autoencoder, on a stream of feature vectors derived from Zeek conn.log data, aggregated per minute for each critical ICS endpoint. Features must include: connection_count, failed_connection_ratio, source_ip_entropy, destination_port_entropy, avg_orig_bytes, and protocol_mix_entropy. An alert is triggered if the anomaly score for a new 1-minute vector surpasses the 99th percentile of scores from the training data, indicating a significant deviation from normal network behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]