[
  {
    "information_requirement": "Is an adversary inhibiting response functions by blocking serial COM ports in the ICS environment?",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0805",
        "name": "Block Serial COM",
        "evidence": [
          {
            "description": "An established TCP connection to a known serial-to-Ethernet converter port shows a duration significantly above the statistical norm (e.g., > 99th percentile) and data transfer significantly below the norm (e.g., < 1st percentile), consistent with a held-open, inactive session.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter of the Process Control Network (PCN), Industrial Demilitarized Zone (IDMZ) gateways, and Level 2/3 SCADA/DCS network segments hosting serial-to-Ethernet converters.",
            "action": [
              "Maintain an asset inventory of serial-to-Ethernet converters and their designated TCP ports. Create a rule to alert when a Zeek conn.log event shows a successful connection (conn_state = 'SF') to an inventoried converter port where the connection duration exceeds a static threshold (e.g., 1200 seconds) and the sum of transferred bytes (orig_bytes + resp_bytes) is below a static threshold (e.g., 50 bytes).",
              "For each inventoried converter port, profile historical Zeek conn.log data to establish baselines for connection duration and total bytes transferred. Create a rule to alert when a new connection's duration exceeds the 99th percentile of its baseline AND its total bytes are below the 1st percentile of its baseline. A high z-score for duration combined with a low z-score for bytes for the same connection can serve as a supplementary trigger.",
              "Train a time-series anomaly detection model (e.g., Isolation Forest, LSTM Autoencoder) on features from historical Zeek conn.log data for converter ports, including duration, orig_bytes, and resp_bytes. Feed live connection data to the model and generate an alert when a connection receives an anomaly score that surpasses a tuned threshold, indicating a significant deviation from learned normal behavior."
            ]
          },
          {
            "description": "A TCP connection is established with a serial-to-Ethernet converter from a source IP address that is not on the explicit allowlist of authorized systems (e.g., engineering workstations, HMIs) for that device.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT DMZ network boundary, Process Control Network (PCN) segments, supervisory control systems, engineering workstations, Human Machine Interfaces (HMIs), and network segments directly hosting serial-to-Ethernet converters.",
            "action": [
              "Maintain a strict allowlist of authorized source IP addresses for each serial-to-Ethernet converter. Create a rule to alert on any successful connection (Zeek conn.log, conn_state = 'SF') to a converter where the source IP (id.orig_h) is not on the allowlist. On alert, pivot to host logs (Windows Event ID 4688) using the source IP and timestamp to identify the process (e.g., telnet.exe, nc.exe) that initiated the connection.",
              "For each converter, establish a 90-day baseline of unique connecting source IPs (id.orig_h from Zeek conn.log). Calculate the Shannon entropy of source IPs connecting per hour. Alert on a sudden, sharp decrease in entropy, indicating a single host dominating connections, or a spike in the count of new, never-before-seen source IPs connecting to a converter (e.g., count exceeds the 99th percentile of new IPs per hour).",
              "Train a supervised classification model (e.g., Random Forest) using historical Zeek conn.log data labeled as 'authorized' or 'unauthorized' based on the source IP allowlist. Use features such as source/destination IP, destination port, protocol, and time of day. Deploy the model to classify new connections in real-time and alert on high-confidence (>0.9) predictions of 'unauthorized' activity."
            ]
          },
          {
            "description": "A sudden and sustained increase in communication failure alarms from systems (e.g., HMIs, SCADA servers) that legitimately communicate with a device via a serial-to-Ethernet converter, concurrent with an active, long-lived TCP session to that same converter.",
            "data_sources": [
              "Windows Event Log (Application)",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SCADA master servers, Historian databases, Human Machine Interface (HMI) terminals, and engineering workstations.",
            "action": [
              "Create a rule that correlates application-level alarms (e.g., 'Device Unresponsive' in Windows Application Event Logs) with active, long-duration TCP sessions to the corresponding serial-to-Ethernet converter identified in Zeek conn.log. An alert is triggered if a failure alarm occurs while a suspect connection is active.",
              "Analyze the time-series of communication failure alarm counts for each critical device by parsing relevant application logs. Alert when the alarm frequency for a device exceeds a statistically significant threshold (e.g., 3 standard deviations above the mean, or >99th percentile of alarms per minute) for a sustained period (e.g., > 5 minutes).",
              "Develop a Bayesian network or other causal inference model to assess the probability that a specific network connection is the root cause of a spike in device communication alarms. The model would use features from network connections (source IP, duration, bytes) and alarm logs to score the likelihood that a given connection is causing the service disruption, helping to prioritize alerts."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]