[
  {
    "information_requirement": "Has an unauthorized entity accessed or queried process state data from key ICS components? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0801",
        "name": "Monitor Process State",
        "evidence": [
          {
            "description": "A network connection from an unapproved source IP or user account makes an ICS protocol read request (e.g., Modbus Function Code 0x03/0x04, DNP3 Function Code 0x01/0x02) to a critical asset like a Data Historian or PLC. Alternatively, an approved source initiates a volume of read requests or transfers a data volume that exceeds its statistically established high-water mark (e.g., 99th percentile) over a 24-hour period.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log",
              "Windows Event ID 4624",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data Historian servers (Level 3), Process Control Network (PCN) gateways (Level 3/2), PLC subnets (Level 1/2), HMI/EWS subnets (Level 2.5/2), DMZ between IT and OT networks.",
            "action": [
              "Maintain an allow-list of (Source IP, User Account, Destination Asset IP) tuples authorized for ICS read operations. Create a rule to monitor Zeek ICS protocol logs (modbus.log, dnp3.log, opc.log) for read function codes. Alert if a request's tuple is not in the allow-list. Enrich alerts by correlating the source IP with Windows logon events (Event ID 4624) on the destination asset within a 5-minute window.",
              "For each authorized source (IP/user), establish a 30-day rolling baseline of daily ICS read counts and total bytes transferred using Zeek logs. Calculate the 99th percentile for both metrics for each source. Alert if either the daily read count or daily byte volume for an approved source exceeds its 99th percentile threshold.",
              "Using an Isolation Forest model, detect anomalous ICS read requests. Engineer features from Zeek logs for each request, including source/destination IP, port, ICS function code, data transfer size, and time-based features. Train the model on known-good traffic and apply it to live traffic to generate an anomaly score. Alert on requests with a high anomaly score, which indicate a rare combination of feature values."
            ]
          },
          {
            "description": "An ICS host, such as an HMI or EWS, initiates connections to an anomalously high number of unique ICS devices or ports within a short time frame, indicating network reconnaissance or sweeping behavior. This includes connections to devices outside its documented operational zone.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) (Level 2), Human-Machine Interface (HMI) systems (Level 2), Level 2/3 network boundary devices, PLC/RTU subnets (Level 1/2), ICS application servers (Level 2.5).",
            "action": [
              "Maintain a network communication map defining allowed (Source Host, Destination ICS Device, Port) connections. Create a rule to monitor Zeek conn.log for connections on ICS ports (e.g., 502, 20000, 4840). Alert if a connection violates the map. Correlate alerts with process creation events (Windows Event ID 4688) on the source host to identify the responsible process.",
              "For each ICS source host, use Zeek conn.log to calculate a 30-day baseline of the count of unique destination IPs it connects to on ICS ports over a 15-minute rolling window. Calculate the 99th percentile for this count for each host. Alert when any host's count of unique destinations in a 15-minute window exceeds its established 99th percentile.",
              "Using a DBSCAN clustering model, identify hosts with anomalous communication patterns. For each host, create a feature vector from a 1-hour window, including sets of destination ports/subnets and the entropy of destination IPs. Run DBSCAN on all hosts; hosts marked as 'noise' points (not belonging to a cluster) represent anomalous behavior and should trigger an alert."
            ]
          },
          {
            "description": "A successful remote interactive logon (e.g., RDP) to a critical ICS host like an HMI or EWS exhibits multiple anomalous characteristics (e.g., unusual geolocation, off-hours timing, first-time access for that user/host pair). This logon is immediately followed by a burst of ICS read requests from that host to multiple field devices (PLCs, RTUs).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek opc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs) (Level 2), Engineering Workstations (EWS) (Level 2), ICS Application Servers (Level 2.5), Jump Servers (Level 3/2.5), Active Directory Domain Controllers (Level 3).",
            "action": [
              "Define a 'high-risk logon' on critical ICS hosts (HMIs, EWS) using Windows Event ID 4624 (Logon Type 10) based on criteria like non-standard geolocation, off-hours timing, or first-time user/host pair access. Upon detecting a high-risk logon, monitor Zeek ICS logs for read requests from that host. Alert if more than three unique PLCs/RTUs are queried within the 10 minutes following the logon.",
              "For each critical ICS host, establish a 30-day baseline for the count of unique destination devices queried with ICS read requests within the 10-minute window following a remote logon (Event ID 4624, Type 10). Calculate the 95th percentile for this count. Alert if the number of unique devices queried post-logon exceeds this 95th percentile threshold.",
              "Using a Random Forest classifier, classify logon sessions as benign or malicious-precursor. Create a feature vector for each session including logon time, geolocation, and post-logon activity (e.g., unique destinations queried in 5 mins, total read requests). Train the model on labeled historical data. Alert when the model classifies a live session with a high probability of being a malicious precursor, using feature importance to explain the rationale."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]