[
  {
    "information_requirement": "Is an adversary collecting data from our ICS information repositories? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0811",
        "name": "Data from Information Repositories",
        "evidence": [
          {
            "description": "A single user account or host accesses a number of unique files from a sensitive ICS repository that significantly exceeds its established baseline within a 15-minute window, or accesses any file containing predefined sensitive ICS keywords.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Sysmon Event ID 11",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS File Servers, Engineering Workstations (EWS), Document Management Systems (DMS), Project File Shares, Configuration Management Databases (CMDBs), and SharePoint/Confluence sites hosting ICS documentation.",
            "action": [
              "Create a SIEM rule to monitor Windows Event ID 5145 and Zeek smb_files.log. Trigger an alert when 'Accesses' in Event 5145 includes 'ReadData' or 'action' in smb_files.log is 'file_read', AND the 'RelativeTargetName' or 'filename' contains a case-insensitive keyword from a predefined list ('SCADA', 'P&ID', 'RTU', 'PLC', 'HMI', 'Historian', 'Network_Diagram'). Suppress the alert if the 'TargetUserName' or 'user' is a member of a predefined Active Directory allowlist group for ICS documentation access.",
              "For each unique user-host pair, establish a 30-day rolling baseline of file access activity from NAIs. Calculate the 99th percentile for the count of unique files accessed ('RelativeTargetName'/'filename') within a 15-minute rolling window. Generate an alert if the current count for a user-host pair exceeds this baseline. Separately, calculate the Shannon entropy of file extensions accessed by a user in a 1-hour window and alert on sudden spikes compared to the user's historical norm.",
              "Deploy an Isolation Forest model to detect anomalous file access from NAIs. Ingest Windows Event ID 5145, Sysmon Event ID 11, and Zeek smb_files.log. Engineer features for each access event including: user, source host, target server, file path depth, file extension, time of day, day of week, and binary flags for keyword matches and non-business hours. Generate an alert when the model's anomaly score for a user's activity in a 1-hour window exceeds the 99.5th percentile of all scores."
            ]
          },
          {
            "description": "An outbound network connection from an ICS information repository host to a non-ICS network destination transfers a volume of data that exceeds established per-session or per-hour baselines, or connects to a known malicious or unauthorized external service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Historian Servers, Control System Databases (SQL, Oracle), OPC DA/HDA servers, ICS File Servers, and Engineering Workstations acting as data aggregation points.",
            "action": [
              "From Zeek conn.log, filter for connections originating from NAI IP addresses to destinations outside the defined ICS and corporate network address spaces. Correlate the destination IP ('id.resp_h') with a high-confidence threat intelligence feed of known malicious IPs and generate a critical alert on any match. For other external connections, correlate the destination with Zeek dns.log and ssl.log to match the resolved domain/SNI against a list of unauthorized services (e.g., public cloud storage, webmail, paste sites), and alert if data was transferred ('orig_bytes' > 1KB).",
              "Using Zeek conn.log, establish a 30-day baseline for each NAI host ('id.orig_h'). Calculate the 99th percentile of total outbound bytes ('orig_bytes') per hour to any non-ICS destination and the 99th percentile of outbound bytes for a single session. Generate an alert if a host's total outbound traffic in a 1-hour window exceeds its hourly baseline or a hard threshold of 500MB. Generate a separate alert if any single session's outbound traffic exceeds its single-session baseline or a hard threshold of 100MB.",
              "Implement a time-series anomaly detection model (e.g., Prophet) for network egress volume. For each NAI host, create a time-series dataset of total outbound bytes per 15-minute interval, aggregated from Zeek conn.log. Train the model on at least 90 days of historical data to learn normal egress patterns. Generate an alert when the observed volume exceeds the upper bound of the model's prediction for two or more consecutive intervals."
            ]
          },
          {
            "description": "A successful logon (Windows Event ID 4624) to a critical ICS repository host occurs under one of two conditions: the authenticating account lacks the required group membership for that asset, or the logon event exhibits a combination of multiple anomalous characteristics compared to the user's historical baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Historian Servers, Human-Machine Interface (HMI) consoles, Domain Controllers, and Jump Servers within the ICS network.",
            "action": [
              "Monitor Windows Event ID 4624 on all NAI hosts. Generate a high-priority alert if a successful logon occurs where the 'TargetUserName' is NOT a member of an authorized AD group for that specific host role (e.g., 'Historian_Admins'). Generate a medium-priority alert for any successful logon with 'LogonType' 10 (RemoteInteractive) from an account not on an explicit allowlist for remote access to ICS assets.",
              "For each user account, establish a 90-day baseline from Windows Event ID 4624 and Zeek conn.log data, profiling: a) common login hours, b) common source geolocations, and c) previously used source 'WorkstationName' values. For each new logon, apply a risk score: +3 for login outside normal hours, +5 for a new country, +2 for a new source workstation. Generate an alert if a single logon event accumulates a score of 5 or more.",
              "Train a Random Forest classifier to distinguish between legitimate and suspicious logons using historical, labeled Windows Event ID 4624 data. Engineer features for each event: LogonType, IsAdmin, IsServiceAccount, TimeOfDay, DayOfWeek, IsNewSourceGeoIP (vs. 90-day history), IsNewSourceWorkstation (vs. 90-day history), and IsRemoteLogon (LogonType 3 or 10). Generate an alert when the model classifies a logon as 'suspicious' with a confidence score greater than 0.90."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]