[
  {
    "information_requirement": "Is an adversary attempting to exploit our public-facing ICS applications for initial access? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0819",
        "name": "Exploit Public-Facing Application",
        "evidence": [
          {
            "description": "One or more of the following network traffic patterns are observed against a public-facing ICS application: 1) A statistically significant increase (e.g., 3 standard deviations above the 30-day moving average) in inbound connection attempts or data volume to an ICS application port (e.g., 80/TCP, 443/TCP, 502/TCP, 20000/TCP, 4840/TCP) within a 15-minute window. 2) Inbound connections from a source IP/ASN on a threat intelligence blacklist or from a geographic region not seen in the last 90 days. 3) A brute-force pattern of multiple failed authentication attempts (>5 attempts in 60 seconds) followed by a success from the same source IP. 4) An inbound connection uses an uncommon or diagnostic function code for an ICS protocol (e.g., Modbus function code 43, DNP3 function code 129 'COLD_RESTART') not part of normal operations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek notice.log",
              "Zeek weird.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ segment (Purdue Level 3.5) hosting public-facing ICS applications (e.g., Historians, Web HMIs, Remote Access Gateways, OPC UA Servers, SCADA Servers, ICS API Gateways)",
            "action": [
              "Search Zeek http.log for URI, request_body, and user_agent fields matching known web exploit signatures (e.g., SQLi, command injection) via regular expressions. Cross-reference source IPs (id.orig_h) from Zeek conn.log against threat intelligence feeds. Inspect ICS protocol-specific logs (e.g., Zeek modbus.log) for requests with function codes associated with reconnaissance or unauthorized modification (e.g., Modbus FC43, FC16) that are not on an approved list for the source-destination pair. Correlate Windows Event ID 4625 (failed logins) with a subsequent Windows Event ID 4624 (successful login) from the same SourceNetworkAddress within a 5-minute window.",
              "For each public-facing ICS application port, establish a 30-day moving average and standard deviation for inbound connection counts per source IP. Alert if any source IP's connection count exceeds the mean by 3 standard deviations in a 15-minute window. Calculate Shannon entropy of Zeek http.log URI strings per source IP; alert on values 2+ standard deviations above the norm. Analyze the inter-arrival time of connections from a single source IP in Zeek conn.log. A low variance and low mean inter-arrival time (e.g., < 1 second) suggests automated scanning; alert if this pattern persists for more than 60 seconds.",
              "Employ a time-series anomaly detection model (e.g., Prophet, ARIMA) on the count of inbound connections and bytes transferred per port, binned in 5-minute intervals. Flag any period where the observed value significantly deviates from the model's forecast confidence interval. Train a binary classifier (e.g., Isolation Forest) on historical Zeek conn.log data to detect anomalous connections based on features like orig_bytes, resp_bytes, duration, orig_pkts, and conn_state, flagging connections with a high anomaly score."
            ]
          },
          {
            "description": "An unauthorized or anomalous child process is spawned by a public-facing ICS application process on a DMZ server, defined by: 1) The child process is an interactive shell (powershell.exe, cmd.exe, sh, bash), data transfer utility (bitsadmin.exe, certutil.exe), or reconnaissance tool (whoami.exe, ipconfig.exe, net.exe, nmap.exe, plink.exe). 2) The parent-child process relationship is not on a pre-defined operational whitelist for the ICS application. 3) The process creation occurs within 300 seconds of a suspicious inbound network connection (e.g., from a TOR node or exhibiting exploit patterns) to the server from an external IP address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing ICS application servers (e.g., Windows-based HMI servers, data historians, engineering workstations in DMZ) located in the Purdue Level 3.5 DMZ.",
            "action": [
              "Maintain a strict whitelist of allowed parent-child process relationships for each ICS application. Alert immediately if Windows Event ID 4688 or Sysmon Event ID 1 records a non-whitelisted child process (e.g., powershell.exe) spawned by an ICS application. Check the CommandLine for suspicious arguments (e.g., 'base64', 'download', 'invoke-expression', '-nop', '-enc', or arguments for network scanners like '-p 502'). Prioritize alerts correlated with a suspicious inbound Zeek conn.log entry within a 5-minute window.",
              "For each process creation event (Windows Event ID 4688), calculate the historical frequency of the (ParentProcessName, NewProcessName, SubjectUserName) tuple. Alert if a tuple's frequency is in the bottom 1st percentile, indicating a user or service account is performing an unprecedented action. Calculate the Shannon entropy of CommandLine values in rolling 1-hour windows and alert if the score deviates by more than 2 standard deviations from the historical mean.",
              "Train a behavioral anomaly detection model (e.g., Isolation Forest) on vectorized Windows Event ID 4688 data. Features should include ParentProcessName, NewProcessName, command-line argument count, command-line character length, and a one-hot encoded SubjectUserName. Flag process creations scored as highly anomalous, especially when the SubjectUserName is a service account and the event is temporally correlated with a network anomaly."
            ]
          },
          {
            "description": "An outbound network connection from a public-facing ICS application server in the DMZ is made to internal ICS network segments, characterized by: 1) A connection from a Purdue Level 3.5 server to a destination IP within internal Purdue Level 3 (Site Control), 2 (Area Control), 1 (Basic Control), or 0 (Process) that is not on a strict, pre-defined firewall rule or communication whitelist. 2) The connection uses a protocol for lateral movement (e.g., SMB 445/TCP, RDP 3389/TCP) or an ICS protocol (e.g., Modbus 502/TCP, S7COMM 102/TCP) not required for the application's legitimate function. 3) The destination is a critical ICS asset like a PLC, RTU, or Engineering Workstation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network boundary between the IT/DMZ (Purdue Level 3.5) and the OT/ICS network (Purdue Levels 0-3), specifically monitoring traffic egressing the DMZ.",
            "action": [
              "Implement and audit a strict whitelist of allowed outbound connections (Source IP, Destination IP, Destination Port, Protocol) from DMZ servers to the internal ICS network. Generate a high-priority alert for any connection observed in Zeek conn.log or Windows Event ID 5156 that violates this whitelist. Using Zeek's ICS protocol parsers (e.g., modbus.log), create rules to alert on any outbound connection from a DMZ server to an internal ICS asset that uses write commands or stop/start commands not on a defined operational whitelist.",
              "For each DMZ server, establish a 30-day baseline set of unique destination IPs, ports, and protocols contacted within the ICS network. Use the Jaccard index to compare the set of connections in a rolling 1-hour window against this baseline; alert if the similarity score drops below a threshold (e.g., 0.7). Establish a 90-day baseline for connection duration (from Zeek conn.log `duration` field) for all approved outbound paths and alert if a new connection's duration exceeds the 99th percentile.",
              "Develop a communication graph where nodes are hosts and edges represent connections. Use a community detection algorithm (e.g., Louvain Modularity) on a baseline of normal traffic to establish 'communication communities'. Monitor for anomalous shifts, such as a DMZ server node forming new, persistent edges to nodes in a 'PLC' or 'Engineering Workstation' community it does not normally interact with. Flag these as potential lateral movement."
            ]
          },
          {
            "description": "Anomalous file creation or modification occurs on a public-facing ICS application server, indicating a potential web shell or tool implant: 1) Creation of files with extensions common for web shells or pivot tools (.aspx, .jsp, .php, .sh, .ps1, .exe, .dll) in web-accessible directories. 2) A newly created file's content has high Shannon entropy (> 7.0), suggesting it is packed or encrypted. 3) A file is created on the server within 5 minutes of an HTTP POST request from an external source to that server.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Webroot directories, temporary file directories, and application configuration folders on public-facing ICS application servers in the DMZ (Purdue Level 3.5).",
            "action": [
              "Use file integrity monitoring or YARA rules to scan files created in web-accessible directories for web shell signatures. Correlate a file creation event (Sysmon Event ID 11) where TargetFilename is in a web directory with a preceding Zeek http.log entry (within 120 seconds) showing an HTTP POST from an external IP to the same host. The alert priority is critical if the file extension is scriptable (.aspx, .php) and the http.log entry contains a file upload mime-type.",
              "For files created by the web server process in web-accessible directories, establish a baseline of file sizes. Generate an alert if a newly created file with a scriptable extension (.aspx, .jsp, .php) has a size that falls below the 5th percentile of all files in that directory. If using Zeek files.log, calculate the Shannon entropy for all newly observed file contents; alert if a file's entropy score exceeds the 98th percentile for its observed mime_type.",
              "Train a classification model (e.g., Gradient Boosting) on file creation events to predict maliciousness. Use features derived from Sysmon Event ID 11 and Zeek files.log: file path depth, file extension, creating process name, entropy of filename, and a boolean flag indicating if the creation was preceded by an external HTTP POST. Flag files classified as malicious with a high probability score."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]