[
  {
    "information_requirement": "Has a critical ICS device been restarted or shut down outside of a scheduled maintenance window? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0816",
        "name": "Device Restart-Shutdown",
        "evidence": [
          {
            "description": "A user-initiated (Windows Event ID 1074) or unexpected system (Windows Event ID 6008) shutdown or restart event on a critical Windows-based ICS asset (e.g., HMI, EWS). The event is considered anomalous if it occurs outside a scheduled maintenance window, is initiated by a non-whitelisted process, or is not documented in change management records.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6006",
              "Windows Event ID 6008",
              "Windows Event ID 4624",
              "Windows Event ID 4634",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations, SCADA Servers, and Data Historians within the Process Control Network (PCN) and OT DMZ.",
            "action": [
              "Alert on any occurrence of Windows Event ID 6008 (unexpected shutdown) on assets tagged as 'Critical ICS'. For Event ID 1074 (user-initiated) or 6006 (clean shutdown), alert if the event occurs outside a pre-defined maintenance schedule AND the initiating process is not on an approved application whitelist (e.g., 'TiWorker.exe', 'wuauclt.exe'). Correlate any such alert with logon events (Event ID 4624) and network connection logs (Zeek conn.log) to verify the legitimacy of the source user and host.",
              "For each critical ICS asset, establish a 90-day baseline of the hourly count for shutdown-related events (1074, 6006) during non-maintenance periods. Alert if the count in any given hour exceeds the 99th percentile of this baseline. Additionally, baseline the frequency of 'ShutdownReason' codes from Event ID 1074; alert if a code is observed that has not appeared in the baseline period, as this indicates a statistically rare shutdown cause.",
              "Train a supervised classification model (e.g., Random Forest, XGBoost) using historical logs from critical ICS assets, labeled as 'benign' (e.g., during maintenance) or 'malicious' (verified past incidents). Engineer features including EventID, time of day, day of week, a binary 'is_maintenance_window' flag, the initiating process name, and user context from preceding logon events (4624). Ensure the training dataset is balanced using techniques like SMOTE to prevent bias. Deploy the model to classify new shutdown events in real-time, alerting on 'malicious' classifications with a confidence score > 0.9."
            ]
          },
          {
            "description": "Observation of specific ICS protocol function codes or commands explicitly designed to restart a device (e.g., DNP3 'Cold Restart', Modbus function 8 sub-function 1 'Restart Communications Option', EtherNet/IP 'Reset') targeting a critical PLC, RTU, or IED, especially when originating from an unauthorized source or occurring outside a maintenance window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Zeek opcua.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps or SPAN ports monitoring traffic between Purdue Levels 0 (Process), 1 (Basic Control), and 2 (Supervisory Control), particularly at network aggregation points for PLCs, RTUs, and IEDs.",
            "action": [
              "Alert immediately upon observing specific restart commands in parsed ICS protocol logs (e.g., Zeek dnp3.log where function_name is 'COLD_RESTART', modbus.log where function_code is 8 and sub_function is 1, enip.log where command is 'Reset'). For any alert, enrich with asset inventory data to confirm device criticality and cross-reference the source IP ('id.orig_h') against a whitelist of authorized engineering workstations. Escalate any command from an unauthorized source.",
              "For each critical device IP, establish a 30-day baseline of the daily count of restart-related function codes originating from authorized sources. Alert if the daily count of these commands targeting a device exceeds the 99th percentile of its baseline, or if any such command is observed outside a maintenance window from any source. Separately, calculate the Shannon entropy of source IP addresses communicating with each critical device over a rolling 1-hour window. Alert if entropy drops below the 5th percentile of its baseline, indicating an unusual reduction in command source diversity.",
              "Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on a baseline of normal ICS protocol traffic (e.g., 30+ days of Zeek logs from non-maintenance periods). Use features such as: protocol, function_code, source IP, destination IP, and the time delta since the last command to the same destination. Score new commands in real-time and alert on any command or sequence receiving a high anomaly score, as this indicates a significant deviation from learned normal behavior."
            ]
          },
          {
            "description": "A sustained cessation of expected periodic communications (e.g., keep-alives, status polls) from a critical controller, where the communication gap exceeds a statistically determined threshold for that specific device and is not associated with a planned maintenance activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Zeek opcua.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core switches in the Process Control Network (PCN) and aggregation switches at Purdue Levels 1 and 2, where network traffic from PLCs, RTUs, and IEDs is concentrated and can be monitored.",
            "action": [
              "For each critical controller defined in an asset inventory, create a stateful rule that tracks the timestamp of its last received communication. Define a static timeout threshold based on its known polling cycle (e.g., 3 times the polling interval). If the time since the last seen packet exceeds this threshold outside of a scheduled maintenance window, generate a 'Potential Device Offline' alert. Correlate this alert with Zeek conn.log to check for recent TCP resets (RST flag) sent to the device.",
              "For each critical controller, calculate the distribution of inter-packet arrival times from its specific protocol logs (e.g., modbus.log) over a 30-day rolling baseline. Alert if the time since the last observed packet from the device exceeds the 99.9th percentile of its baseline inter-arrival time, indicating a statistically significant communication gap.",
              "For each critical controller, train and deploy a time-series forecasting model (e.g., ARIMA, Prophet) on its packet count per minute to learn its normal communication rhythm. In real-time, compare the observed packet count to the model's prediction. If the observed count falls below the model's 99% confidence interval for three or more consecutive minutes, generate an 'Anomalous Communication Drop' alert, as this indicates a statistically improbable cessation of traffic suggesting a device shutdown or fault."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has an adversary's action resulted in a disruption of critical industrial processes, leading to a measurable loss of productivity or revenue?",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0816",
        "name": "Device Restart-Shutdown",
        "evidence": [
          {
            "description": "A critical ICS device (e.g., PLC, RTU) experiences a network-based service disruption over a 1-minute window, evidenced by: 1) A sustained increase in average round-trip time (RTT) of over 50% compared to its 7-day baseline in Zeek conn.log. 2) A connection failure rate where the count of connections with 'S0', 'S1', or 'REJ' states in Zeek conn.log exceeds 3 standard deviations above the baseline. 3) A high volume of ingress traffic (>10,000 packets/sec) from a single source IP, especially if traffic consists of a high percentage of ICMP messages or TCP SYN packets without a corresponding established connection. This network anomaly is correlated with a 'communication loss' alarm on an associated HMI or a gap in data reporting from the device to the process historian.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek tcp.log",
              "Zeek udp.log",
              "Zeek icmp.log",
              "HMI Alarm Logs",
              "Historian Process Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Control and Supervisory Networks (Purdue Model Levels 1, 2, 3) to monitor traffic to/from critical controllers, servers, and HMIs; Network boundaries and gateways between IT and OT networks to detect cross-domain flood attempts.",
            "action": [
              "Implement a SIEM rule to alert when a single source IP (`id.orig_h` in Zeek conn.log) generates more than 1,000 connection attempts to a critical ICS device IP within 1 minute where the `conn_state` is 'S0' (SYN sent, no reply). Additionally, create a rule to alert if the packet count in Zeek icmp.log from a single source to a single critical destination exceeds 500 packets per second, or if the count of UDP packets with a payload size less than 64 bytes exceeds 1,000 packets per second.",
              "For each critical ICS device IP, establish a 30-day baseline from Zeek conn.log for average RTT, connection rate (connections/minute), and the ratio of failed connections ('S0','S1','REJ') to successful ones ('SF'). Alert if any metric exceeds 3 standard deviations from its baseline in a 5-minute rolling window. Concurrently, calculate the Shannon entropy of source IPs connecting to critical devices over 1-minute windows; alert if the entropy drops by more than 50% from its rolling 24-hour average, indicating a less random, more concentrated source of traffic.",
              "Deploy a time-series anomaly detection model, such as an LSTM autoencoder, trained on historical network flow metrics from Zeek conn.log for each critical ICS device. Use features like `orig_bytes`, `resp_bytes`, `orig_pkts`, `resp_pkts`, and counts of connection states per minute. The model will learn the normal 'heartbeat' of the device's network traffic. Generate an alert when the reconstruction error for live traffic exceeds a dynamically set threshold (e.g., the 99th percentile of reconstruction errors from a validation dataset), indicating a significant deviation from the learned normal pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has an adversary successfully executed an action that has resulted in, or is intended to cause, physical damage to operational technology property? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0816",
        "name": "Device Restart-Shutdown",
        "evidence": [
          {
            "description": "An unscheduled shutdown or restart of a critical ICS asset (e.g., a PLC controlling a turbine, an HMI for a safety system) is observed. The event is indicated by Windows Event ID 1074 (user-initiated shutdown/restart) or Event ID 6008 (unexpected shutdown). The initiating process is anomalous (e.g., powershell.exe, psexec.exe, wmic.exe), or the initiating user account is not on an approved list of administrators for that asset. The event lacks correlation with any pre-approved change management ticket or scheduled maintenance activity.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6008",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Windows Event ID 4672",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Process Historians, SCADA Servers, Engineering Workstations, Domain Controllers within the ICS environment, Network boundary sensors for ICS segments.",
            "action": [
              "Maintain a watchlist of critical ICS hostnames and a list of authorized administrator accounts. Implement a SIEM rule to generate a high-severity alert if (EventID is 1074 on a host in the watchlist) AND (the associated User is NOT in the admin list OR the Initiating Process Name is in a suspicious process list ['powershell.exe', 'cmd.exe', 'psexec.svc', 'wmic.exe']). Create a second rule to alert if an EventID 6008 occurs on a watchlist host and is not preceded by an authorized EventID 1074 within the previous 5 minutes.",
              "For each critical ICS asset, establish a 30-day rolling baseline for the frequency of EventID 1074 (Shutdown) and 6008 (Unexpected Shutdown), excluding scheduled maintenance windows. Generate an alert if the 24-hour count for either event exceeds the 99th percentile of its baseline. Separately, baseline the hourly unique source IPs connecting via RDP (from zeek_rdp.log) to critical assets and alert if a shutdown event is preceded within 60 minutes by an hourly unique IP count exceeding the 95th percentile of its baseline.",
              "Train a binary classification model (e.g., Random Forest) to predict if a Windows Event ID 1074 is 'malicious' (1) or 'benign' (0). Use features such as: time_of_day, day_of_week, is_admin_user (boolean), logon_type (from preceding EventID 4624), process_name, is_external_ip (from preceding zeek_conn.log), and process_command_line arguments (e.g., presence of '-f' force flag). An alert is triggered for any event classified as 'malicious' with a high confidence score. Use a clustering algorithm (e.g., DBSCAN) on pre-shutdown activity features (source_ip, user_account, processes_created) to identify novel clusters of activity that do not match known 'benign administrative' patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]