[
  {
    "information_requirement": "Has an adversary caused a loss of availability in a critical ICS component? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0826",
        "name": "Loss of Availability",
        "evidence": [
          {
            "description": "A critical ICS host (e.g., HMI, Engineering Workstation, Historian) shows a complete cessation of all TCP/UDP network communication in network flow logs for a duration exceeding a statistically derived baseline or a hard threshold (e.g., 60 seconds). This network silence correlates within a 5-minute window with either an unexpected termination of a critical ICS process (e.g., HMI runtime, OPC server) or an unscheduled system shutdown/restart event on the same host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Windows Event ID 7036",
              "Windows Event ID 4608",
              "Windows Event ID 4609",
              "Windows Event ID 1074",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations, Operator Stations, Historian Servers, Data Gateways, and Domain Controllers located on the Process Control Network (PCN) or ICS Demilitarized Zone (DMZ).",
            "action": [
              "Correlate network silence alerts with host events occurring within a 5-minute window. Search for Windows Event ID 1000 (Application Error), 1002 (Application Hang), 7036 (Service Stopped), 4689 (Process Exited), 4608 (System Shutdown), 4609 (Shutdown Initiated), or 1074 (Shutdown/Restart) on the silent host. Prioritize alerts where the process or service name in the event matches a predefined list of critical ICS applications (e.g., 'HMI_Runtime.exe', 'Historian_Service.exe').",
              "For each critical ICS host, establish a rolling 7-day baseline for the average and standard deviation of inbound and outbound communication intervals (time between Zeek conn.log entries). Alert if a host fails to log any network communication for a period exceeding the greater of 3 standard deviations above its rolling average communication interval or a fixed threshold of 60 seconds.",
              "Develop and train a time-series anomaly detection model (e.g., LSTM autoencoder) on the frequency of Zeek conn.log entries for each critical ICS host, aggregated per minute. Retrain the model weekly with new baseline data. Alert when the model detects a significant anomaly in communication frequency (e.g., a sustained period of zero communication) with an anomaly score exceeding 0.7."
            ]
          },
          {
            "description": "An anomalous and sustained surge of file modification events (write, rename, delete) on critical ICS data directories (e.g., 'C:\\SCADA\\Projects', 'C:\\HistorianDB'). This is defined as a rate exceeding a statistical baseline (e.g., >100 events/minute for 5 mins) on a Historian or Engineering Workstation. This activity is highly suspect when initiated by an unrecognized process (per Windows Event ID 4688) and results in mass file extension changes (e.g., to '.encrypted', '.locked') or mass deletions.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 4656",
              "Windows Event ID 4659"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Historian Servers, Engineering Workstations, File Servers hosting ICS project files and configurations, and Backup Servers storing critical ICS data, all located within the Process Control Network (PCN) or ICS Demilitarized Zone (DMZ).",
            "action": [
              "Correlate high rates of file modification events (4663, 4656) with process creation events (4688) to identify the initiating NewProcessName and CommandLine. Search for known ransomware process names or suspicious command-line arguments (e.g., 'vssadmin.exe delete shadows', 'cipher.exe /w'). Additionally, create a watchlist of known ransomware file extensions (e.g., '.locked', '.enc', '.crypt') and alert if they appear in the ObjectName field of Event ID 4663.",
              "For each critical ICS host, establish a 7-day rolling baseline for the rate of Windows Event ID 4663 events (Object Access) per process, per minute, on critical ICS directories. Alert if any process's event rate exceeds the 99th percentile of its historical rate for 3 consecutive minutes. Additionally, calculate the Shannon entropy of file extensions modified by a process within a 5-minute sliding window; alert on a sudden drop in entropy (e.g., below 0.5) indicating a uniform renaming pattern.",
              "Implement a clustering algorithm (e.g., DBSCAN) on Windows Event ID 4663 events, using features such as initiating ProcessName, target file path directory, and event timestamp within 5-minute windows. Train the model on historical benign file activity. Alert when a new cluster emerges that significantly deviates from learned benign clusters, indicating mass file manipulation."
            ]
          },
          {
            "description": "An abrupt and sustained increase in network traffic volume (e.g., >100 MB/min) or connection rate (e.g., >50 new connections/min) targeting critical ICS field devices (PLCs, RTUs) on specific ICS protocol ports (e.g., Modbus TCP 502, EtherNet/IP 44818, DNP3 20000). This traffic originates from a source IP not on the established network allow-list for the Process Control Network and is sustained for a period exceeding a baseline (e.g., 30 seconds).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek profinet.log",
              "Zeek ethernetip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The Process Control Network (PCN) segments, specifically network traffic directed at PLCs, RTUs, IEDs, and other field devices. This includes monitoring at network boundaries (e.g., Firewalls between PCN zones) and within specific control segments (e.g., Level 1 control networks).",
            "action": [
              "For all traffic in conn.log to critical ICS devices on ICS ports (e.g., 502, 44818, 20000), check if the originating IP (id.orig_h) is on a predefined network allow-list. Alert on any connection from a non-allow-listed IP. Correlate these alerts with Zeek notice.log entries like 'DDoS::Syn_Flood' or 'Scan::Address_Scan' from the same source IP within a 1-minute window.",
              "For each critical ICS field device (PLC, RTU), establish a rolling 7-day baseline for inbound connection rate (new connections/min) and total bytes transferred (bytes/min) from Zeek conn.log, specific to ICS protocol ports. Alert if any of these metrics from a single source IP exceeds the 99th percentile of its historical distribution, or 4 standard deviations above a 30-minute moving average, sustained for at least 30 seconds.",
              "Deploy a real-time unsupervised anomaly detection model (e.g., Isolation Forest) on network flow features extracted from Zeek conn.log (e.g., source/destination IP, port, protocol, byte count, packet count, duration) for traffic to critical ICS devices. Train the model on historical benign traffic patterns. Alert when the model identifies network flows as anomalous with a high anomaly score (e.g., >0.7), indicating a significant deviation from normal communication behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]