[
  {
    "information_requirement": "Is an adversary attempting to modify controller logic via a program download? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0843",
        "name": "Program Download",
        "evidence": [
          {
            "description": "An ICS program download or write operation (e.g., S7Comm 'Download Block', 'Write Var') is observed in network traffic, where the connection originates from an IP address not on a managed allow-list of authorized Engineering Workstations (EWS) or the activity occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek s7.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network choke points such as firewall and switch SPAN ports monitoring traffic between the IT/OT DMZ and the Process Control Network (PCN), Engineering Workstation subnet, and network taps at key aggregation points in the PCN.",
            "action": [
              "Implement a query that searches Zeek s7.log for events where the 'function' is 'Download Block' or 'Write Var'. For each match, join with Zeek conn.log on the connection UID to get the source IP ('id.orig_h'). Generate a high-severity alert if 'id.orig_h' is not present in a predefined set of authorized EWS IP addresses. Generate a medium-severity alert if the event's timestamp falls outside of a known maintenance schedule.",
              "For each unique PLC ('id.resp_h'), establish a baseline of hourly program download event counts over the last 90 days, distinguishing between activity inside and outside of maintenance windows. Calculate the mean ($$ \\mu $$) and standard deviation ($$ \\sigma $$) for non-maintenance window activity. Generate an alert if the current hourly download count for a PLC outside a maintenance window exceeds a threshold of $$ \\mu + 3\\sigma $$.",
              "Train an Isolation Forest model using features from Zeek s7.log and conn.log for each program download event. Use features such as source IP, destination IP, S7 function, day of week, hour of day, connection duration ('duration'), and total bytes transferred ('orig_bytes', 'resp_bytes'). A high anomaly score for a program download event indicates a significant deviation from normal engineering activity and should trigger an alert for analyst review."
            ]
          },
          {
            "description": "A successful remote logon (Windows Event ID 4624 with Logon Type 3 or 10) or a new process creation (Windows Event ID 4688) on an Engineering Workstation is immediately followed by a new network connection to a PLC on an ICS protocol port (e.g., TCP/102 for S7) within a 60-second window. The user account or process name initiating the activity is not on an allow-list for approved engineering operations.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Active Directory domain controllers, centralized SIEM/log aggregation platform, and network sensors monitoring traffic between the EWS subnet and the PCN.",
            "action": [
              "Create a SIEM correlation rule that triggers when a Zeek conn.log entry shows a connection from an EWS to a PLC on an ICS port (e.g., 'id.resp_p' is 102). The rule should then query for a logon event (4624) or process creation event (4688) on the source host ('id.orig_h') within the preceding 60 seconds. Alert if the 'TargetUserName' from event 4624 or the 'ProcessName' from event 4688 is not on a pre-defined allow-list of authorized engineering users and applications for that specific EWS.",
              "For each EWS, create a historical baseline of (User, ProcessName, Destination_PLC_IP) tuples observed over a 30-day period and calculate their frequency of occurrence. Alert if a new, never-before-seen tuple is observed initiating a connection to a PLC. Additionally, alert if a historically rare tuple (e.g., in the bottom 5th percentile of frequency) is observed, as this may indicate the infrequent use of a malicious or unauthorized tool.",
              "Train a Random Forest classifier on Windows Event ID 4688 data from EWS to distinguish legitimate engineering software (e.g., TIA Portal, Studio 5000) from unauthorized processes. Use features such as 'ParentProcessName', 'CommandLine' arguments, the Shannon entropy of the 'CommandLine' string, 'User', and 'ProcessName'. Alert when a process that initiates a PLC connection is classified as 'malicious' with a confidence score greater than 0.90."
            ]
          },
          {
            "description": "A sequence of S7Comm commands is observed where a PLC's operating mode is changed to a non-run state (e.g., 'STOP') via a 'CPU Control' function, followed by a 'Download Block' or 'Write Var' command within a 5-minute window. This sequence originates from an unauthorized source IP or occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Zeek s7.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments monitored by network sensors, specifically traffic to and from critical PLCs, and a centralized log analysis platform capable of stateful sequence detection.",
            "action": [
              "Implement a stateful correlation rule that triggers upon observing an S7 'Stop CPU' command ('function: CPU_control', 'param_function: STOP'). The rule should cache the (source_ip, plc_ip) tuple and a timestamp. If a 'Download Block' or 'Write Var' command is seen from the same source to the same destination within 5 minutes, check if the source_ip is on the authorized EWS allow-list and if the event occurs within a scheduled maintenance window. If either condition is false, generate a high-severity alert.",
              "For each PLC model, analyze historical maintenance logs to calculate the distribution of the time delta ($$ \\Delta t $$) between 'Stop CPU' and subsequent 'Download Block' commands. Calculate the 5th and 95th percentiles of these deltas. Generate an alert if a newly observed sequence has a $$ \\Delta t $$ that falls outside this established range, as this indicates an abnormally fast (potentially automated script) or slow (potentially manual adversary) operation that deviates from standard procedure.",
              "Develop a Hidden Markov Model (HMM) for each major PLC model, trained on sequences of S7 commands from Zeek s7.log during known-good maintenance periods. The HMM states represent operational phases (e.g., 'Running', 'Stopping', 'Programming', 'Starting'). Generate an alert when a live sequence of commands, such as Stop -> Download, has a low probability score under the trained model, indicating a sequence of state transitions that is not characteristic of normal operations."
            ]
          },
          {
            "description": "An online program modification, such as an S7Comm 'Insert Block' function, is observed without a preceding 'Stop CPU' command. This activity either originates from an IP address not on the authorized EWS allow-list or targets a logic block that is rarely modified during routine operations.",
            "data_sources": [
              "Zeek s7.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensor taps monitoring traffic between the Engineering Zone and the Process Control Zone, particularly traffic destined for Safety Instrumented Systems (SIS) or critical process controllers.",
            "action": [
              "Create a rule to alert on S7 function codes corresponding to online edits (e.g., 'Insert Block') where the source IP in 'id.orig_h' is not on the EWS allow-list. Escalate the alert severity if the event occurs outside a defined maintenance window or targets a controller associated with a critical process.",
              "For each PLC, establish a frequency distribution of modified block numbers observed over the last 180 days. Alert when an online edit targets a block number that falls in the bottom 5th percentile of modification frequency, indicating an unusual change to a stable part of the controller logic.",
              "Apply a clustering algorithm like DBSCAN to historical S7 online edit events. Use features such as source IP, destination PLC IP, S7 function, block number, and hour of the day. Treat any new event that is classified as a noise point (i.e., does not belong to an established cluster of normal activity) as a high-confidence anomaly and generate an alert for immediate investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]