[
  {
    "information_requirement": "Is an adversary attempting to discover the communication patterns and device roles within the ICS network? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0840",
        "name": "Network Connection Enumeration",
        "evidence": [
          {
            "description": "Execution of a network enumeration utility (e.g., netstat.exe, arp.exe, ipconfig.exe) on a critical ICS asset where the execution context is anomalous. Anomalies include: execution by a non-service or non-administrative account, initiation by an interactive process (e.g., powershell.exe, cmd.exe), or occurrence outside a predefined maintenance window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices of critical ICS assets (Engineering Workstations, HMIs, Historian Servers, Data Gateways, Operator Workstations)",
            "action": [
              "Create a detection rule to alert when a process creation event (Sysmon Event ID 1 or Windows Event ID 4688) is observed on an asset within the NAI and meets the following criteria: (ProcessName IN ['netstat.exe', 'arp.exe', 'nbtstat.exe', 'ipconfig.exe', 'route.exe']) AND (ParentProcessName IN ['cmd.exe', 'powershell.exe', 'explorer.exe']) AND (UserName is not a system or pre-approved administrative account). For PowerShell (Event ID 4104), alert if the script block contains 'Get-NetTCPConnection' or 'Get-NetNeighbor' and the script is not part of an allow-listed administrative tool.",
              "For each host in the NAI, establish a 30-day historical baseline of the hourly execution count for each monitored utility ('netstat.exe', etc.). Calculate the z-score for the current hourly count against this baseline for each utility. An alert is triggered if the z-score exceeds a threshold, for example, $$ z > 3 $$, indicating a statistically significant increase in execution frequency that deviates from normal operational behavior.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) using historical process creation data (Sysmon Event ID 1). Engineer features including: ProcessName (one-hot encoded), ParentProcessName (one-hot encoded), UserName (frequency encoded), command-line argument length and entropy, hour of day, and day of week. Flag any new process execution that the model scores as a significant outlier for analyst investigation."
            ]
          },
          {
            "description": "An ICS host, such as an Engineering Workstation or HMI, initiates connections to an anomalously high number of unique internal destination IP addresses or TCP/UDP ports within a 5-minute window, deviating more than 3 standard deviations from its established 30-day behavioral baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Firewall Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS network segments (Process Control Network - PCN), Network choke points between IT and OT networks (DMZ, Purdue Model Zone 3.5), SCADA/DCS networks",
            "action": [
              "From Zeek conn.log, create a rule to alert when a single source IP ('id.orig_h') from the NAI connects to more than 20 unique destination IPs ('id.resp_h') on the internal network within a 5-minute window, especially where the ratio of connection states 'S0' (connection attempt, no reply), 'REJ' (connection rejected), or 'RSTOS0' (originator sent a SYN, responder sent a RST) is abnormally high (e.g., > 80%).",
              "For each source host ('id.orig_h') in the NAI, create a 30-day baseline of the following metrics calculated in 5-minute windows: a) count of unique destination IPs, b) count of unique destination ports, and c) the Shannon entropy of destination IPs, given by $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. Trigger an alert if any current metric exceeds the 99th percentile of its historical baseline, indicating behavior consistent with network scanning.",
              "For each high-value asset, model the hourly count of unique destination IP addresses as a time series. Use a SARIMA (Seasonal AutoRegressive Integrated Moving Average) algorithm to account for daily and weekly seasonality in communication patterns. Generate an alert if the observed count significantly exceeds the forecasted upper confidence bound (e.g., 99% confidence interval), indicating an anomalous spike in network enumeration activity not explained by normal operational cycles."
            ]
          },
          {
            "description": "A network connection is initiated using an ICS-specific protocol (e.g., Modbus, DNP3, S7) where the source IP address is not on a pre-approved, version-controlled allow-list of authorized devices for that specific protocol and network segment.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Firewall Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) subnets containing PLCs, RTUs, and other field controllers, ICS DMZ, Control Server segment",
            "action": [
              "Maintain a version-controlled allow-list of authorized [Source_IP, Destination_IP, Destination_Port, Protocol] communication tuples for the PCN. Query Zeek conn.log or firewall logs for any connection where ('id.orig_h' is NOT in the allow-list AND 'id.resp_p' is in the set of common ICS ports [502, 102, 20000, 44818, 4840, 2404]) OR the Zeek 'service' field is an ICS protocol. Any resulting match is a high-fidelity alert for unauthorized communication.",
              "For traffic originating from IP addresses not on the PCN allow-list, count the number of unique destination IPs each source connects to on ICS-specific ports within a 1-hour window. Trigger an alert if a non-allow-listed IP attempts to connect to more than one unique destination host on an ICS port, indicating a targeted scan for control systems rather than a simple network misconfiguration.",
              "For each source host communicating within the NAI, create feature vectors from Zeek logs over a 1-hour window. Features should include: connection count, ratio of ICS to non-ICS ports, count of unique destination hosts, ratio of rejected connections ('conn_state' = 'REJ'), and average connection duration. Use a clustering algorithm like DBSCAN to group hosts into behavioral profiles. Flag any host that is classified as an outlier (cluster label -1) as a potential unauthorized device performing enumeration."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]