[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via removable media? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0847",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process is created on an ICS endpoint from a removable media volume, and the process's hash is not on a pre-approved allowlist for that specific asset type, or the process exhibits other suspicious characteristics such as an unexpected parent process or command line.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Operator Consoles, Data Gateways, SCADA Servers, Portable technician laptops, any Windows-based ICS endpoint with USB/removable media access.",
            "action": [
              "Create a SIEM rule to detect a process creation event (Windows Event ID 4688 or Sysmon Event ID 1) where the process image path matches the regex '^[D-Z]:\\\\.*'. For each match, query an asset-specific software allowlist by the process's SHA256 hash. Trigger a high-severity alert if the hash is not found. Escalate priority if the parent process is not 'explorer.exe' or a known legitimate initiator for that asset.",
              "For each ICS asset, maintain a 90-day rolling baseline of command line argument entropy scores for all processes launched from removable media. Upon a new execution, calculate the Shannon entropy of the full command line string. Trigger an alert if the resulting entropy score exceeds the 95th percentile for that specific asset, indicating a high probability of obfuscation or packed commands.",
              "Deploy a pre-trained Random Forest or Gradient Boosting classifier that scores process executions from removable media in real-time. The model should be trained on features from Sysmon Event ID 1 including: ProcessName string entropy, CommandLine length, CommandLine string entropy, ParentProcessName, and binary signature status (IsSigned, SignatureStatus). An event receiving a 'malicious' probability score greater than 0.90 should trigger an immediate investigation."
            ]
          },
          {
            "description": "Within 5 minutes of a process execution from removable media, the same host initiates a network connection to a known malicious destination, a non-standard external address for that asset, or exhibits anomalous TLS or DNS characteristics.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The IT/OT network boundary, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, Perimeter firewalls, Network Intrusion Detection Systems (NIDS) at the IT/OT boundary, ICS network switches and routers where Zeek sensors are deployed.",
            "action": [
              "Create a stateful correlation rule that triggers when a host that generated a removable media execution alert also generates a network connection event (Zeek conn.log) within a 5-minute window. Generate a critical alert if the destination IP or requested domain (from a correlated Zeek dns.log record) is present in a threat intelligence feed. Also alert if a correlated Zeek ssl.log record shows a JA3/JA3S hash on a known-bad watchlist or has a 'validation_status' of 'self-signed certificate' for an external connection.",
              "For each ICS asset, establish a 30-day rolling baseline of network behavior including the set of unique destination ports and the average data volume ('orig_bytes' + 'resp_bytes') per connection. Following a removable media process execution, monitor the asset's network traffic for one hour. Alert if a connection uses a destination port never before seen from that asset, or if the total bytes transferred in a single connection exceeds the 99th percentile of the asset's baseline.",
              "Utilize a trained Isolation Forest model on 60-second time-series aggregations of network traffic from critical ICS assets. Features should include: count of new connections, count of unique destination ports, total bytes transferred, and ratio of outbound to inbound bytes. If a removable media execution is detected, score the subsequent 10 minutes of that host's network data. An anomaly score exceeding a tuned threshold (e.g., -0.2) indicates a significant behavioral deviation requiring investigation."
            ]
          },
          {
            "description": "A new persistence mechanism, such as a new service, scheduled task, or autorun registry key, is created on an ICS asset within 10 minutes of a process execution that originated from removable media.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Windows Event ID 7045",
              "Windows Event ID 4698",
              "Sysmon Event ID 12",
              "Sysmon Event ID 13",
              "Sysmon Event ID 14"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers, SCADA Servers, any Windows-based ICS endpoint with USB/removable media access.",
            "action": [
              "Create a correlation rule linking a process execution from removable media (Sysmon Event ID 1) on a host with a subsequent persistence creation event (Windows Event ID 7045/4698 or Sysmon Event ID 12/13/14) on the same host within 10 minutes. Alert if the 'ImagePath' of the new service/task or the value written to the registry autorun key points to a file in a temporary or user-writable directory, such as 'C:\\ProgramData\\' or 'AppData\\Local\\Temp'.",
              "Maintain a historical baseline of all known-good service names, scheduled task command lines, and autorun registry key-value pairs for each class of ICS asset (e.g., EWS, HMI). When a new persistence entry is created following a removable media event, check if the entry's primary identifier (name, path, value) exists in the baseline for that asset class. If it is a zero-day occurrence, flag it for immediate analyst review.",
              "Train a one-class SVM (Support Vector Machine) model using features from known-benign persistence entries (e.g., name/path string entropy, path depth, creating user account type, binary signature status). In real-time, when a new persistence entry is created following a removable media event, use the model to classify it. If the model classifies the entry as an 'outlier' or 'anomaly', it signifies a deviation from the established benign baseline and should be alerted as a high-confidence suspicious event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]