[
  {
    "information_requirement": "Is an adversary capturing screen data from Human-Machine Interfaces (HMIs) or Engineering Workstations (EWS)? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0852",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "Detection of a process creation event on a designated ICS asset (HMI, EWS) where the new process is a known screen capture utility, a scripting engine is used with screen capture APIs, or the process is not on the established software whitelist for that asset.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations, and Jump Servers within the ICS/OT network.",
            "action": [
              "Create a detection rule that queries for process creation events (Windows Event ID 4688) on HMI/EWS assets. Alert if: (a) the process name is 'psr.exe' or 'SnippingTool.exe'; (b) the parent process is 'powershell.exe' and associated script block logs (Windows Event ID 4104) contain 'CopyFromScreen' or 'BitBlt'; (c) the process name is not on the pre-approved application whitelist for the specific host; or (d) a new service is installed (Windows Event ID 4697) with an executable not on the service whitelist.",
              "For each HMI/EWS host, aggregate process creation events (Windows Event ID 4688) by process name over a 1-hour window. Using a 30-day historical baseline, calculate the mean and standard deviation of execution counts for each process. Alert if the current hourly count for any process exceeds 3 standard deviations from its historical mean. Separately, calculate the rarity of each process across the entire fleet of HMIs/EWS; flag any process execution that is present on less than 5% of assets for review.",
              "Deploy a pre-trained classification model, such as a Random Forest, that ingests process creation events. Engineer features including: process name, parent process name, command-line argument entropy and length, user context, and process path. The model, trained on labeled benign activity from the specific ICS environment, classifies each new process. Alert on any event classified as 'malicious' or 'suspicious' with a confidence score greater than 0.90."
            ]
          },
          {
            "description": "A file creation event for an image file extension (.png, .jpg, .bmp, .gif) is observed on an HMI or EWS, where the creating process is not on a pre-approved application whitelist or the file is written to a temporary or non-standard directory.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Local file systems of HMIs and EWS, focusing on temporary directories (%TEMP%, C:\\Windows\\Temp), user profiles, and staging directories used for data transfer.",
            "action": [
              "Enable and query file system audit logs (Windows Event ID 4663/4656). Create a detection rule that alerts when a file with an image extension (.png, .jpg, .bmp, .gif) is created and either: (a) the process name that created the file is not on the approved list of image-generating applications, such as HMI reporting tools, or (b) the file path is within a non-standard directory such as '%TEMP%', '%APPDATA%', or 'C:\\Windows\\Temp'.",
              "For each HMI/EWS, establish a baseline of image file creation volume per hour, using a 30-day lookback period. Alert if the number of image files created in any given hour exceeds the 99th percentile of the historical distribution for that host. Additionally, calculate the Shannon entropy of all newly created filenames; alert if a filename's entropy score is above a threshold, such as 4.0, indicating high randomness.",
              "Implement a time-series anomaly detection model, such as an LSTM Autoencoder, trained on vectors representing file creation events from each HMI/EWS. The vector should include features like time of day, day of week, creating process name, and file path. The model learns the normal rhythm of file creation activity. Alert when a new file creation event results in a reconstruction error that exceeds a dynamically calculated threshold, such as 3 standard deviations above the historical error distribution."
            ]
          },
          {
            "description": "An outbound network connection from an HMI or EWS that either targets a destination IP or domain not on the network whitelist or involves a data payload size (`orig_bytes`) that is statistically anomalous for that asset.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, OT/IT Network Boundary, Purdue Model Level 2/3 systems, ICS DMZ, and Internet Gateway.",
            "action": [
              "Create a detection rule that queries network logs (Zeek conn.log, dns.log) for traffic from HMI/EWS source IPs. Alert immediately if: (a) a connection is made to a destination IP or a resolved domain (from dns.log) not on the explicit network whitelist for that asset class; (b) the destination port is not on the approved port list for that destination; or (c) an HTTP POST request (from http.log) to a non-whitelisted endpoint has a request body length greater than 1MB.",
              "For each HMI/EWS, profile outbound connections (Zeek conn.log) over a 30-day period to establish a baseline for the `orig_bytes` field, segmented by destination port. Create a rule to alert if any new connection's `orig_bytes` value exceeds the 99.9th percentile for its peer group, such as all connections from HMIs to port 443. Also, monitor the total outbound data volume per host in 10-minute intervals and alert if the total volume exceeds 4 standard deviations above the host's historical average.",
              "Apply a density-based clustering algorithm, such as DBSCAN, to a dataset of network connection logs (Zeek conn.log) from HMI/EWS assets. Use features including source and destination IP, destination port, protocol, `orig_bytes`, and `duration`. The algorithm will identify clusters of normal traffic. Schedule a periodic job to run this analysis and automatically flag any connections that are labeled as 'noise' or fall into clusters with fewer than 5 members for analyst investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]