[
  {
    "information_requirement": "Is an adversary leveraging a transient cyber asset for initial access into the ICS environment?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0864",
        "name": "Transient Cyber Asset",
        "evidence": [
          {
            "description": "A network connection is initiated by a MAC address (source_mac from Zeek conn.log) or IP address (id.orig_h from Zeek conn.log) that has not been observed communicating within a specific ICS network segment (e.g., Level 2 Process Control Network) in the last 30 days and is not documented in the authoritative ICS asset inventory (CMDB) or an approved segment-specific device whitelist. This connection targets a critical ICS host (e.g., PLC, HMI, Historian) within that segment.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network ingress/egress points for ICS zones (e.g., Level 2 Process Control Network, Level 3.5 Manufacturing Zone), especially within maintenance and engineering VLANs, IT/OT DMZ gateways, core ICS network switches, and physical ports where transient devices (e.g., engineering laptops, diagnostic tools) connect. Also, Jump Servers and Bastion Hosts within the IT/OT DMZ.",
            "action": [
              "For each unique source MAC (from Zeek conn.log or dhcp.log) or source IP (id.orig_h from Zeek conn.log) observed within any ICS network segment, query if the address has been seen in the past 30 days. If the address is new, perform a lookup against the authoritative ICS asset inventory (CMDB) and any segment-specific device whitelists. If the address is not found in any of these authoritative sources, generate a high-priority alert containing the timestamp (ts), source IP (id.orig_h), source MAC (source_mac), destination IP (id.resp_h), destination port (id.resp_p), protocol (proto), and the identified ICS segment.",
              "For each ICS network segment, calculate a daily count of unique source MAC and IP addresses from Zeek conn.log that were not observed in the previous 7-day window. Establish a 60-day historical baseline for this 'new device count' metric. Generate a medium-priority alert if the current daily count for any segment exceeds the 99th percentile of its historical baseline, indicating an unusual surge in novel device appearances. The alert should include the segment, the count, and the threshold.",
              "Train an unsupervised clustering algorithm (e.g., Isolation Forest) on historical Zeek conn.log data from each ICS segment. Use features such as: id.orig_h (hashed), source_mac (hashed), id.resp_h (hashed), id.resp_p, proto, duration, orig_bytes, resp_bytes, and conn_state. Deploy the trained model to process new connection logs in near real-time. Generate a medium-priority alert for any connection that is flagged as an outlier (e.g., receives an anomaly score greater than 0.6), indicating a connection that deviates significantly from established patterns of benign activity."
            ]
          },
          {
            "description": "A network connection is initiated by a known transient cyber asset (identified by id.orig_h or source_mac from Zeek conn.log, matching the ICS asset inventory) where its communication pattern statistically deviates from its established 60-day historical behavioral baseline. Deviations include: connecting to destination IPs or ports not present in its top 99% of historical activity; using protocols not observed in its historical activity; exhibiting data volume (orig_bytes + resp_bytes) that exceeds 3 standard deviations from its average hourly volume; or connecting to external networks outside of documented maintenance windows or to known malicious domains/IPs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network ingress/egress points for ICS zones, especially at the boundaries of Level 2/3.5 networks, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historians, Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), and network gateways connecting the Process Control Network (PCN) to corporate IT or external networks. Also, the transient asset's point of connection to the ICS network and any associated management/maintenance VLANs.",
            "action": [
              "For each known transient asset, maintain an up-to-date watchlist of authorized destination IPs, ports, and protocols for ICS assets it is permitted to communicate with. Alert immediately on any connection where the id.resp_h/id.resp_p/proto combination is not explicitly whitelisted for that transient asset. Additionally, ingest a threat intelligence feed of malicious IPs and domains. Alert on any connection from a transient asset where id.resp_h in Zeek conn.log matches a malicious IP or the 'query' field in Zeek dns.log matches a malicious domain.",
              "For each known transient asset, establish a 60-day rolling baseline of its communication patterns from Zeek conn.log. This baseline must include: the set of destination IPs (id.resp_h) and ports (id.resp_p) that constitute 99% of its connections, and the mean and standard deviation of hourly data volume (orig_bytes + resp_bytes). Calculate the Z-score for observed hourly data volume. Generate a medium-priority alert if: a) a connection is made to an IP/port pair outside the 99th percentile baseline, or b) the hourly data volume Z-score is greater than 3.",
              "Train a Prophet time-series model for each known transient asset to forecast its expected hourly data volume (orig_bytes + resp_bytes) and count of unique destination IPs (id.resp_h) from Zeek conn.log. Generate a medium-priority alert when the observed hourly values fall outside the model's uncertainty interval (yhat_upper) for at least 3 consecutive hours. Additionally, train a supervised classifier (e.g., Random Forest) using historical Zeek conn.log data, with features such as proto, id.resp_p, duration, orig_bytes, resp_bytes, and entropy of destination ports over a 1-hour window. The model should classify connections as 'normal' or 'anomalous'. Alert on connections classified as 'anomalous' with a confidence score above 0.75."
            ]
          },
          {
            "description": "An executable file or script (identified by filename from Zeek files.log, smb_files.log, or http.log, with extensions such as .exe, .dll, .bat, .ps1, .vbs, .py) is transferred from a transient cyber asset to an ICS host. Subsequently, within 5 minutes of the file transfer, a process creation event (Windows Event ID 4688) occurs on that ICS host where the New Process Name matches the transferred filename.",
            "data_sources": [
              "Zeek files.log",
              "Zeek smb_files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historians, file servers, and other Windows-based servers within the Process Control Network (PCN), especially endpoints configured to accept file transfers from transient devices. Also, network segments where transient assets connect and hosts within those segments, and IT/OT DMZ file transfer zones.",
            "action": [
              "Correlate Zeek file transfer logs (files.log, smb_files.log, http.log) with Windows Event ID 4688 logs. Identify events where a file with an executable extension (.exe, .dll, .bat, .ps1) is transferred from a known transient asset IP (id.orig_h) to an ICS host IP (id.resp_h). If, within 5 minutes, a corresponding Event ID 4688 occurs on the destination host where the 'New Process Name' field matches the transferred filename, generate a high-priority alert. The alert must include source/destination IPs, filename, file hash (if available), and the process command line.",
              "For all file transfers from transient assets to ICS hosts (from Zeek files.log), calculate the Shannon entropy of the filename. Establish a 90-day historical baseline of filename entropy for legitimate ICS software and scripts observed in the environment. Generate a medium-priority alert for any file transfer where the filename entropy exceeds the 99th percentile of this baseline, as high entropy can indicate obfuscation. Also, baseline the file size for common legitimate executables and alert if a transferred file with a matching name deviates by more than 10%.",
              "Train a supervised classification model (e.g., Gradient Boosting Machine) on historical data of file transfers (Zeek files.log) and subsequent process creations (Windows Event ID 4688), labeled as 'benign' or 'malicious'. Features should include: file_type, transfer_protocol, file_size, filename_entropy, file_hash_reputation (from a TI feed), ParentProcessName (from Event ID 4688), and the time difference between transfer and execution. Deploy the model to classify new file transfer-execution pairs and generate a high-priority alert for any pair classified as 'malicious' with a confidence score exceeding 0.85."
            ]
          },
          {
            "description": "Execution of a process (Windows Event ID 4688) on an ICS host, initiated by a user session where the LogonId (Windows Event ID 4624) or source IP (Zeek rdp.log) is associated with a known transient cyber asset. The executed process is a common administrative or engineering tool (e.g., net.exe, powershell.exe, wmic.exe), but the command-line arguments (Command Line field from Windows Event ID 4688) are anomalous, have not been observed in the last 60 days, or contain suspicious keywords.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4689",
              "Zeek rdp.log",
              "Zeek dnp3.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Domain Controllers, Bastion Hosts, and other Windows-based servers within the ICS environment, particularly endpoints where transient assets establish direct or indirect interactive sessions. Also, network segments where DNP3/Modbus communications are monitored to detect effects of malicious commands.",
            "action": [
              "Identify interactive sessions from transient assets by correlating LogonId from Windows Event ID 4688 with Event ID 4624 (where Source Network Address is a transient asset IP) or by tracking id.orig_h in Zeek rdp.log. For processes created in these sessions, monitor the Command Line field in Event ID 4688 for suspicious keywords (e.g., 'mimikatz', 'Set-ItemProperty', 'whoami /all', 'net group', 'Invoke-WebRequest'). Generate a high-priority alert if such keywords are detected. Additionally, monitor Zeek dnp3.log and modbus.log for write commands (e.g., DNP3 function codes 'WRITE', 'DIRECT_OPERATE') originating from transient asset IPs outside of scheduled maintenance windows.",
              "For each ICS host and administrative tool (e.g., powershell.exe), establish a 90-day rolling baseline of legitimate command-line arguments from Windows Event ID 4688. When a new command is executed from a transient asset session, calculate its Jaccard similarity against the baselined set. Generate a medium-priority alert if the highest similarity score is below 0.5, indicating a novel command. Also, calculate the Shannon entropy of the command-line string and alert if it exceeds the 98th percentile of the historical baseline for that tool, indicating potential obfuscation.",
              "Train a Natural Language Processing (NLP) model using TF-IDF vectorization and a Logistic Regression classifier on historical Windows Event ID 4688 Command Line arguments, labeled as 'benign' or 'malicious'. Deploy the model to analyze new command lines executed from transient asset sessions. Generate a high-priority alert for any command classified as 'malicious' with a confidence score exceeding 0.8. Furthermore, train a Recurrent Neural Network (RNN) on sequences of process creation events (Event ID 4688) to learn normal operational workflows. Alert on any sequence of process executions from a transient asset session that has a low probability under the trained model, indicating a deviation from normal procedures."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]