[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS environment via spearphishing attachments? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0865",
        "name": "Spearphishing Attachment",
        "evidence": [
          {
            "description": "An email is received by a high-value ICS target (e.g., a member of the 'ICS_Engineers' or 'OT_Operators' AD group) from an external source. The email, identified in Zeek smtp.log, contains an attachment identified by correlating the 'fuid' to Zeek files.log. The evidence is strengthened if: 1) The attachment has a high-risk file type (e.g., .exe, .vbs, .docm, .xlsm, .iso, .zip, or ICS-specific project files like .ACD, .PCV, .S7P). 2) The attachment filename or email subject contains ICS-specific keywords (e.g., 'PLC Update', 'SCADA Alert', 'HMI Configuration', 'firmware', 'Rockwell', 'Siemens', 'Project OT-Upgrade'). 3) The sender's domain is not on an organizational allowlist or fails DMARC/SPF/DKIM checks.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Zeek x509.log",
              "Active Directory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway, OT Network Mail Relay (if present), Corporate-to-OT DMZ, Engineering Workstations (local email client logs), Control System Network (for internal email traffic if applicable)",
            "action": [
              "Create and maintain watchlists for: a) high-risk ICS personnel email addresses, b) high-risk file extensions including archives (.zip, .rar, .iso) and ICS project files (.ACD, .PCV, .S7P, .ap16), and c) ICS-specific keywords ('PLC', 'HMI', 'firmware', 'SCADA', vendor names, project codes). Construct a query to join Zeek smtp.log and files.log on the 'fuid' field. Generate a high-priority alert if an email to a watchlisted recipient from an external source contains an attachment whose hash matches a known-bad value from threat intelligence, or if the attachment's 'filename' or 'mime_type' is on the high-risk list AND the 'subject' or 'filename' contains a watchlisted keyword.",
              "For all external emails with attachments sent to high-risk ICS personnel, establish a 90-day rolling baseline of sender-recipient communication frequency. Alert if a high-risk attachment is received from a sender domain that is new or falls below the 1st percentile of observed frequency for that recipient group. Concurrently, calculate the Shannon entropy of both the attachment filename (from files.log) and the email subject (from smtp.log). Alert when an attachment's filename or subject entropy exceeds the 99th percentile of its respective baseline, suggesting randomization or obfuscation.",
              "Implement a supervised classification model (e.g., Gradient Boosting, Random Forest) trained on historical email metadata to produce a phishing probability score for each incoming email. Features should include: sender domain age/reputation (via enrichment), DMARC/SPF/DKIM results, presence and density of ICS keywords, attachment MIME type, attachment filename entropy, historical communication frequency between sender-recipient pair, and NLP-derived features from the subject/body indicating urgency or unusual requests. Generate a critical alert when the model classifies an email to a high-risk user as 'phishing' with a confidence score > 0.90."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]