[
  {
    "information_requirement": "Is an adversary exploiting remote services to gain initial access into the ICS environment?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0866",
        "name": "Exploitation of Remote Services",
        "evidence": [
          {
            "description": "An inbound network connection from an untrusted IT network segment to a critical OT asset's service port (e.g., SMB/445, RDP/3389, VNC/5900, Modbus/502, DNP3/20000) that either: 1) violates a pre-defined IT/OT communication whitelist, 2) targets a known vulnerable service (e.g., SMBv1), 3) exhibits a protocol anomaly detected by a sensor (e.g., a non-standard SMB negotiation sequence), or 4) contains a payload whose Shannon entropy exceeds the 95th percentile for that specific protocol and communication channel.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek smb.log",
              "Zeek rdp.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Industrial Demilitarized Zone (IDMZ) network segments, firewalls at the IT/OT boundary, remote access gateways for OT, historian servers with external interfaces, and network switches/routers connecting IT and OT zones.",
            "action": [
              "Create a SIEM rule to alert on any Zeek conn.log entry where the source IP address ('id.orig_h') is within a designated IT range and the destination IP address ('id.resp_h') is within a designated OT range. The rule must trigger if the destination port ('id.resp_p') is a known remote service port (e.g., 445, 3389, 5900, 502, 20000) AND the tuple {id.orig_h, id.resp_h, id.resp_p} is not on a pre-defined IT/OT communication whitelist. Correlate alerts with Zeek notice.log for specific exploit signatures (e.g., 'SMB_NT_Trans_Pipe_Access_SMBv1_Exploit_Attempt', 'Scan::Port_Scan', 'DNP3_Parse_Error') that occur within 5 minutes for the same source/destination pair.",
              "For each approved IT-to-OT communication channel (defined by source IP, destination IP, and destination port), use Zeek conn.log to establish a 30-day rolling baseline for connection count, total bytes transferred, and payload entropy. Calculate payload entropy on the first 1024 bytes of the application layer payload. Generate an alert when a new connection's payload entropy exceeds the 95th percentile for that specific channel, or when the connection count or byte volume for a 1-hour window exceeds 3 standard deviations from its historical mean for that same hour of the day and day of the week.",
              "Deploy a time-series anomaly detection model (e.g., Isolation Forest or ARIMA) to monitor aggregated IT-to-OT network flow statistics. Per 5-minute interval, extract features including total connection volume, unique source/destination pairs, protocol distribution, and the average payload entropy. Train the model on at least 30 days of historical data to learn normal patterns. An alert should be triggered when the model flags any time interval as anomalous, indicating a statistically significant deviation from learned communication patterns that could represent a coordinated scan or widespread exploit attempt."
            ]
          },
          {
            "description": "A critical OT asset's service (e.g., on an HMI, SCADA server) registers an application crash (Windows Event ID 1000) or an unexpected service termination (Windows Event ID 7031, 7034) within 60 seconds of receiving and accepting an inbound network connection (Windows Event ID 5156) from an IT network segment, where the connection's destination port matches the affected service's listening port.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 7034",
              "Windows Event ID 7031",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA servers, Historian servers, and critical Windows-based control system assets in the Process Control Network (PCN) or Supervisory Control Network (SCN).",
            "action": [
              "Create a correlation rule that joins network data (Zeek conn.log or Windows Event ID 5156) with host application log data. Trigger an alert when a Windows Event ID 1000 (Application Error), 7034 (Service Terminated Unexpectedly), or 7031 (Service Terminated) is logged on a designated critical OT asset, AND a network connection log exists showing a connection from an IT IP address to that OT asset's IP within the preceding 60 seconds, AND the destination port of the connection corresponds to the service that crashed (e.g., by matching port to service via configuration data).",
              "For each critical service on key OT assets, establish a 30-day baseline of the hourly frequency of crash-related events (Event IDs 1000, 7034, 7031) grouped by service name or process name. Create an alert that triggers when the count of these events for any single service in a 1-hour window exceeds its 99th percentile or is more than 3 standard deviations above its historical average. Escalate the alert's priority if the spike is temporally correlated with an increase in network connections from IT segments to that host.",
              "Train a binary classification model (e.g., Logistic Regression or Random Forest) to predict if a service crash is exploit-induced. For each crash event, engineer features from both host and network logs: from Windows Event ID 1000, use 'FaultingModuleName' and 'ExceptionCode'; from the corresponding Zeek conn.log entry, use 'duration', 'orig_bytes', 'resp_bytes', and source IP geolocation/ASN data. Train the model on labeled historical data of known legitimate and suspicious crashes to classify new events in real-time."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary exploiting remote services to move laterally within the ICS environment?",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0866",
        "name": "Exploitation of Remote Services",
        "evidence": [
          {
            "description": "An OT host initiates outbound connections on common remote service ports (e.g., SMB/445, RDP/3389, VNC/5900) or ICS protocols (e.g., Modbus/502, DNP3/20000) to a number of unique destination OT hosts that exceeds a hard threshold (e.g., >10 hosts in 5 minutes) or is a statistically significant outlier compared to its own historical baseline (e.g., >99th percentile of unique hosts contacted in a 10-minute window).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek rdp.log",
              "Zeek dce_rpc.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Supervisory Control Network (SCN), Process Control Network (PCN), individual device networks (e.g., for PLCs, RTUs, IEDs), internal OT firewalls, and network switches/routers within the OT environment.",
            "action": [
              "Analyze Zeek conn.log for intra-OT traffic where both source and destination IPs are in OT subnets. For each source host ('id.orig_h'), count the number of unique destination hosts ('id.resp_h') it connects to on remote service or ICS ports (e.g., 445, 3389, 5900, 502, 20000) within a 5-minute sliding window. Trigger an alert if this count exceeds 10. Additionally, create a high-priority alert if any connection is made to a designated 'honey-host' asset within the OT network.",
              "For each individual OT host, establish a 30-day rolling baseline of the 99th percentile for the number of unique destination IPs it contacts per 10-minute interval on remote service and ICS ports. Create an alert that triggers when a host's current count of unique destinations within a 10-minute window exceeds this established 99th percentile baseline. This method identifies hosts exhibiting fan-out behavior that is anomalous for that specific asset.",
              "Model the intra-OT host communication graph using Zeek conn.log, where nodes are hosts and directed edges are connections. Using a graph analytics platform, periodically calculate the PageRank score for each node. Alert on any node (host) whose rank increases by more than 2 standard deviations from its moving average, indicating it has suddenly become a hub of activity. Alternatively, apply a community detection algorithm (e.g., Louvain Modularity) to identify hosts that begin communicating with previously separate network clusters, suggesting lateral spread across security zones."
            ]
          },
          {
            "description": "A critical OT application process (e.g., Historian.exe, HMI_Runtime.exe) on an OT asset spawns an anomalous child process (e.g., cmd.exe, powershell.exe, an unsigned executable) that is not on its established legitimate child process whitelist. This event is considered higher confidence if it occurs within 120 seconds of the parent process receiving an inbound network connection from another OT asset.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA servers, Historian servers, and other critical Windows-based control system assets within the Process Control Network (PCN) or Supervisory Control Network (SCN).",
            "action": [
              "Create a correlation rule that joins intra-OT network data (Zeek conn.log) with host process data (Sysmon Event ID 1). Trigger an alert when a process creation event occurs on an OT asset where the parent process name (e.g., 'HMI_Runtime.exe') is on a critical OT application list and the created child process name (e.g., 'cmd.exe', 'powershell.exe', 'net.exe') is not on a pre-defined whitelist for that specific parent. Escalate the alert if the event occurs within 120 seconds of a network connection from another OT host to the parent process.",
              "For each unique parent-child process relationship observed in Sysmon Event ID 1 data, establish a baseline for the entropy and length of the command-line arguments. Generate an alert when a new process creation event exhibits command-line entropy or length that is a statistical outlier (e.g., >3 standard deviations from the mean for that specific parent-child pair). Specifically search for high entropy indicative of obfuscated or encoded commands (e.g., Base64 encoded PowerShell).",
              "Train a sequence model, such as an LSTM-based autoencoder, on streams of process creation events (Sysmon Event ID 1) from critical OT assets. The model learns the normal sequences of process execution chains (e.g., Parent A -> Child B -> Child C). The model should flag any observed process sequence with a high reconstruction error or low probability score, indicating a deviation from learned normal behavior, such as an HMI runtime suddenly spawning PowerShell, which in turn makes a network connection."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]