[
  {
    "information_requirement": "Has the adversary stolen operational information from the ICS environment, such as design documents, schedules, or process data, to inform future operations or for direct mission outcomes? (Context: In the Bowman Dam incident, adversaries probed systems for operational data [1] [2])",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0882",
        "name": "Theft of Operational Information",
        "evidence": [
          {
            "description": "An aggregate of connections over one hour, originating from a critical ICS asset like an Engineering Workstation or Data Historian, transfers an anomalously large volume of data (exceeding the 99th percentile of the historic hourly baseline) to an external or unusual internal destination. This activity is often correlated with connections to newly registered domains, domains with high Shannon entropy (greater than 3.5), or the use of non-standard protocols for exfiltration such as DNS or ICMP.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log",
              "Zeek tunnel.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "OT-to-IT network gateways, ICS firewalls, Engineering Workstations, Data Historians, DMZ segments, internal network segments hosting critical ICS servers, Internet egress points, SCADA network segments.",
            "action": [
              "Create a watchlist of critical ICS asset IP addresses. Query Zeek conn.log for connections where the source IP (`id.orig_h`) is on the watchlist and the destination (`id.resp_h`) matches a known malicious indicator from a threat intelligence feed. Separately, query Zeek dns.log for requests from the watchlist to domains with a Shannon entropy score greater than 3.5 or registered within the last 30 days. Alert on any tunnel activity from the watchlist in Zeek tunnel.log.",
              "For each critical ICS asset, establish a 30-day rolling baseline of total hourly outbound bytes (`orig_bytes`) from Zeek conn.log. Calculate the 99th percentile of this hourly data volume. Generate an alert when an asset's outbound data transfer in any given hour exceeds this 99th percentile threshold. Additionally, baseline the hourly count of unique destination ports per asset and alert if the count exceeds 3 standard deviations from the historical mean.",
              "Train a time-series anomaly detection model (e.g., Isolation Forest, STL) on historical network traffic from Zeek conn.log for critical ICS assets. Use features such as hourly `orig_bytes`, `resp_bytes`, connection `duration`, count of unique destination IPs, and protocol distribution. An alert is generated when the model assigns a high anomaly score to a time window, indicating a significant deviation from normal network patterns consistent with bulk data transfer."
            ]
          },
          {
            "description": "The execution of an archiving or compression utility (e.g., 7z.exe, tar, powershell Compress-Archive) on a critical ICS asset, where the command line targets multiple sensitive operational files (e.g., .L5K, .ACD, .ap16) or project directories. The event is considered anomalous if initiated by a user who has never used the utility on that asset or if it occurs outside of a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations, ICS Application Servers, File servers hosting project data, SCADA/HMI servers, Historian servers, PLC programming stations.",
            "action": [
              "Query Windows Event ID 4688 and PowerShell Event ID 4104 on critical ICS assets. Alert on any process creation or script block execution that matches a watchlist of archiving utilities (e.g., 7z.exe, rar.exe, tar, Compress-Archive) AND where the command line or script content contains sensitive ICS file extensions or keywords (e.g., .L5K, .ACD, .ap16, project, recipe, design).",
              "From Windows Event ID 4688 logs, establish a baseline of process execution for each user-host pair. Generate an alert if an archiving utility is executed by a user on a host for the first time ('first-seen' analysis). Additionally, for known user-host-process combinations involving archivers, alert if the daily execution count exceeds 3 standard deviations above the historical mean.",
              "Develop a behavioral anomaly detection model (e.g., One-Class SVM) using historical Windows Event ID 4688 data from critical ICS assets. Engineer features including parent process, user context, time of day, and tokenized command line arguments. Train the model to learn normal process execution patterns. Alert when a new archiving process execution is flagged with a high anomaly score, indicating a deviation from learned legitimate behavior."
            ]
          },
          {
            "description": "A single user account or process accesses an unusually high number (e.g., >50) of distinct, sensitive operational files (e.g., .L5K, .ACD) within a 10-minute window. This behavior is highly anomalous if it involves a diverse set of file types (Shannon entropy of file extensions > 3.0) and deviates more than 3 standard deviations from the user's or asset's established file access baseline.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers containing operational design documents, PLC/HMI project repositories, Engineering Workstations, Historian file shares, SCADA client machines, central configuration management servers.",
            "action": [
              "Continuously query Windows Event ID 4663 on NAIs for read access attempts (`AccessList` contains `%%4416` or `ReadData`). Alert if the `ObjectName` matches a watchlist of sensitive ICS file paths or extensions (e.g., *\\\\projects\\\\*.L5K, *\\\\configs\\\\*.ACD) and the `SubjectUserName` is not on an approved list of authorized engineering accounts.",
              "For each user, aggregate file access events (Windows Event ID 4663) into 10-minute windows. Establish a baseline for the count of unique files accessed and the Shannon entropy of the file extensions. Generate an alert if a user's activity in any window exceeds 3 standard deviations above their historical mean for either metric, indicating an unusual volume or variety of file access.",
              "Implement a User and Entity Behavior Analytics (UEBA) model using Windows Event IDs 4656 and 4663. Profile normal file access patterns for each user by engineering features like file access rate, directory traversal sequences, and access type distribution. Train a sequence model (e.g., HMM or LSTM) to learn normal access sequences. Alert when a user's sequence of file accesses has a low probability under the model, indicating a significant behavioral deviation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]