[
  {
    "information_requirement": "Has an adversary captured wireless ICS communications for subsequent use (e.g., replay attacks)? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Observation of one or more of the following replay attack signatures associated with wireless ICS commands: (1) A command's execution timestamp, as logged by the server or PLC, falls outside of documented operational hours or scheduled maintenance windows. (2) A command attempts to change a process variable to its current state without an intervening opposite command (e.g., a 'valve open' command is issued when historian data confirms the valve is already open). (3) A valid command is immediately followed by a cascade of unexpected system-level alerts (e.g., PLC fault codes, HMI critical alarms) within a 60-second window. (4) Two or more commands with identical application-layer payloads (e.g., same Modbus function code, register, and value) are observed with different network-layer timestamps or sequence numbers within a 5-minute timeframe.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Syslog from field devices (PLCs, RTUs)",
              "ICS Historian Database Logs (e.g., OSIsoft PI)",
              "HMI Application Event Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting wireless gateways to the ICS network, Wireless Access Points/Gateways, Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Data Historian servers, and PLC/RTU network interfaces.",
            "action": [
              "Define a SIEM correlation rule that triggers when a Modbus write command (Zeek modbus.log) or DNP3 write operation (Zeek dnp3.log) from a wireless gateway IP is detected AND one of the following is true: (1) The timestamp is outside a predefined 'operational hours' list; (2) The command's target value matches the last recorded state in the historian database for that tag; OR (3) No corresponding HMI process creation (Sysmon Event ID 1) or user login (Windows Event ID 4624) from an authorized operator is found within a 2-minute window before the command.",
              "For each critical PLC/RTU, profile the typical sequence of command pairs (e.g., 'start pump' is usually followed by 'confirm flow rate' within 5 seconds). Use historical Zeek logs to calculate the transition probabilities between every command state, forming a Markov chain. Generate a statistical alert if a command sequence with a historically low transition probability (e.g., <1%) is observed, indicating an illogical or out-of-order operation consistent with a replay.",
              "Train a Long Short-Term Memory (LSTM) autoencoder on sequences of legitimate ICS command vectors derived from 6 months of Zeek dnp3.log and modbus.log data. Each vector in a sequence must include: a one-hot encoded function code, normalized numerical parameters, and the time delta from the previous command. In production, feed rolling 5-minute windows of command sequences into the model. An anomaly is flagged if the model's reconstruction error for a given sequence exceeds a dynamic threshold set at the 99th percentile of reconstruction errors from a clean validation dataset."
            ]
          },
          {
            "description": "Detection of unauthorized wireless device identifiers (e.g., MAC addresses, WirelessHART Network IDs) actively transmitting on defined ICS operational frequencies (e.g., 900 MHz, 2.4 GHz) that are not registered in the ICS asset inventory. Alternatively, an authorized ICS wireless device identifier is detected with physical layer characteristics (e.g., Received Signal Strength Indicator (RSSI), signal-to-noise ratio) that are statistically inconsistent with its known, fixed physical location, suggesting device impersonation or spoofing.",
            "data_sources": [
              "Zeek wifi.log",
              "Wireless IDS/IPS Logs",
              "Spectrum Analyzer Logs",
              "RF Sensor Logs",
              "ICS Asset Inventory Database",
              "Network Access Control (NAC) Logs",
              "Kismet logs (.pcaplog, .netxml)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical airspace and critical infrastructure corridors surrounding ICS facilities, specifically near wireless field devices, sensors, actuators, and wireless access points/gateways. Includes uncontrolled public areas with line-of-sight to field assets (e.g., parking lots, adjacent properties).",
            "action": [
              "Implement a SIEM rule that continuously cross-references the source MAC address from Zeek wifi.log or Wireless IDS logs against a managed asset inventory of authorized wireless devices. Generate a critical alert for any transmission on an operational ICS frequency or SSID from a MAC address that is not on the authorized allow-list.",
              "For each static, authorized wireless device MAC address, establish a 14-day rolling baseline of its RSSI mean and standard deviation from Zeek wifi.log. In real-time, calculate the Z-score for the device's RSSI in 1-minute intervals. Generate an alert if the absolute Z-score $$ |Z| > 3.5 $$ for more than 60 consecutive seconds, indicating the signal strength is significantly different from its normal baseline and suggesting it may be a spoofed device transmitting from a different location.",
              "Employ a K-Means clustering algorithm on historical wireless data to profile device behavior. Features per device should include: mean RSSI, standard deviation of RSSI, number of unique SSIDs associated, entropy of channels used, and distribution of 802.11 frame types (management, control, data). This creates clusters representing normal device profiles (e.g., 'fixed sensor zone A', 'mobile operator tablet'). In real-time, alert if an authorized device's current feature vector causes it to shift to a different, unexpected cluster."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to discover our wireless ICS protocols and frequencies? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Persistent (e.g., > 30 seconds) and unauthorized radio frequency (RF) signals are detected within or adjacent to known ICS operational bands (e.g., 900 MHz, 2.4 GHz, 700 MHz). The signal exhibits reconnaissance characteristics such as: rapid frequency hopping across multiple channels (>5 channel changes per minute), broad-spectrum sweeps (>100 MHz span within 5 seconds), or sudden power level changes (>10 dBm) not attributable to known devices.",
            "data_sources": [
              "Spectrum Analyzer Logs",
              "Wireless IDS Logs",
              "RF Sensor Grid Logs",
              "Drone Detection System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical perimeter, airspace, rooftops, and high-ground locations with line-of-sight to ICS facilities, focusing on control rooms, substations, remote terminal units (RTUs), and field device arrays.",
            "action": [
              "Define a rule in a spectrum analysis tool or SIEM to trigger on any RF signal that meets the following criteria: (1) frequency is within a protected ICS band (e.g., 902-928 MHz), (2) the signal signature (e.g., modulation, bandwidth) does not match a pre-defined list of authorized transmitters, AND (3) the signal exhibits rapid channel hopping (>5 channels/min) or a power fluctuation > 10 dBm. The rule should only alert if the signal persists for more than 30 seconds to reduce noise.",
              "Continuously calculate the Shannon entropy of the distribution of detected frequencies from Spectrum Analyzer logs within protected ICS bands over rolling 1-minute windows. Establish a 30-day rolling 99th percentile baseline for this entropy value. Generate an alert if the current entropy value exceeds this baseline for three consecutive intervals, indicating a statistically significant increase in frequency unpredictability consistent with a scanning tool.",
              "Train a Random Forest classifier on labeled RF signal snapshots from a spectrum analyzer. Features for each snapshot must include: center frequency, bandwidth, average power, signal-to-noise ratio, and signal entropy. Use labels such as 'WiFi', 'Bluetooth', 'WirelessHART', 'Noise', and 'Unknown_Scanner'. Deploy the model to classify real-time RF signals. Generate a high-priority alert if a signal within an ICS band is classified as 'Unknown_Scanner' with a confidence score greater than 0.90."
            ]
          },
          {
            "description": "A surge of network scanning or probing activity from a single, previously unseen source IP or wireless device ID targeting an ICS wireless gateway. This is characterized by a high rate of failed connection attempts (e.g., TCP resets or timeouts), authentication failures, or malformed/unsupported ICS protocol requests (e.g., invalid Modbus function codes) within a short time window (e.g., under 5 minutes).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dnp3.log",
              "Zeek modbus.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Windows Event ID 5156",
              "Wireless Gateway Authentication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of ICS wireless gateways, associated authentication servers (RADIUS/TACACS+), and Domain Controllers handling ICS-related authentication.",
            "action": [
              "Create a SIEM rule that triggers if a single source IP, not present in the asset inventory, generates more than 20 connection attempts to an ICS gateway in under 1 minute where the Zeek conn.log state is 'S0', 'REJ', or 'RSTOS0'. Escalate the alert priority if this activity is followed by a successful authentication (Windows Event ID 4624) from the same IP within the next 10 minutes.",
              "For each source IP on the wireless segment, calculate a composite risk score $$ S = w_1 Z_{rej} + w_2 Z_{auth} + w_3 Z_{proto} $$ where $$ Z $$ is the Z-score for rejected connections (from Zeek conn.log), failed authentications (Event ID 4625), and protocol notices (from Zeek notice.log) respectively, and $$ w $$ are configurable weights. Baselines for each metric are calculated over a 14-day rolling window. Alert if $$ S $$ exceeds a dynamically set threshold, indicating multi-faceted anomalous activity from a single source.",
              "Deploy an Isolation Forest model for anomaly detection on 5-minute aggregations of traffic per source IP from the wireless network segment. The feature vector for each source IP must include: count of distinct destination ports, ratio of TCP SYN packets to established connections, entropy of destination ports, count of protocol-specific notice log entries, and average packet size. After training on 30 days of benign data, alert when any source IP receives an anomaly score in the top 1% of scores, indicating its behavior is highly distinct from normal network activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]