[
  {
    "information_requirement": "Is an adversary discovering detailed information about our remote ICS systems and their peripherals? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0888",
        "name": "Remote System Information Discovery",
        "evidence": [
          {
            "description": "Evidence includes: (1) A source IP address, not present on a pre-defined whitelist of authorized OT management systems, initiates ICS discovery protocol requests (e.g., Modbus function code 43, DNP3 Object Group 10, EtherNet/IP ListIdentity) to more than 5 unique ICS device IPs within a 60-second window. (2) An authorized source IP exceeds its own 95th percentile historical baseline for both the total count of discovery requests and the number of unique destination devices contacted within any 5-minute interval.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "OT network segments (e.g., Process Control Network VLANs, Safety Instrumented System networks), network traffic aggregation points (e.g., span ports on core switches), Industrial Demilitarized Zone (IDMZ) gateways, and subnets containing SCADA servers, Engineering Workstations, or Data Historians.",
            "action": [
              "Symbolic Logic (Whitelist Violation and Sweep Detection): Filter Zeek logs for ICS discovery functions (e.g., Modbus 'Read Device Identification', DNP3 object_group=10, ENIP 'ListIdentity'). For each event, check if the source IP (id.orig_h) is on the authorized OT management host whitelist. If not, generate a high-priority alert. For any single unauthorized source IP, count unique destination IPs (id.resp_h) in a 60-second window. If the count exceeds 5, escalate the alert to critical for a discovery sweep and initiate investigation of the source IP.",
              "Statistical Method (Authorized Host Anomaly Detection): For each authorized host IP, establish a 30-day baseline calculating the 95th percentile for (a) total discovery requests and (b) unique destination IPs contacted in 5-minute windows, segmented by time-of-day. In real-time, monitor these metrics for each host. Generate a medium-priority alert if a host exceeds both its 95th percentile thresholds in the same 5-minute window. Investigate by correlating with user logins (Windows Event ID 4624) on the anomalous host.",
              "Machine Learning (Time-Series Anomaly Detection): For each authorized source IP, create a time-series dataset by aggregating the count of ICS discovery requests into 1-minute intervals. Train a time-series anomaly detection model (e.g., Isolation Forest, LSTM Autoencoder) for each host on 30+ days of data to learn normal activity patterns. In real-time, feed new 1-minute data points to the corresponding model to generate an anomaly score. Generate a medium-priority alert if a host's anomaly score exceeds a pre-determined threshold for two consecutive minutes, indicating a sustained deviation from normal behavior."
            ]
          },
          {
            "description": "A process created on an OT host (e.g., EWS, HMI), identified by its file hash as not being on an approved software whitelist, initiates network connections to more than 3 unique ICS device IPs on common ICS ports (e.g., 502, 20000, 44818) within 30 seconds of its launch. The evidence is corroborated by observing ICS discovery protocol traffic (e.g., Modbus, DNP3) in subsequent network logs from the host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek modbus.log",
              "Zeek dnp3.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interface (HMI) Workstations, SCADA Servers, Data Historians, and Jump Servers/Bastion Hosts within the Industrial Demilitarized Zone (IDMZ) or OT network segments.",
            "action": [
              "Symbolic Logic (Un-whitelisted Process Scan): Monitor Windows Event ID 4688 on critical OT hosts. For each new process, check its file hash against an approved software whitelist. If the process is not whitelisted, query Zeek conn.log for connections from the host IP within 30 seconds of process creation to ICS ports (e.g., 502, 20000, 44818). If the process connects to >3 unique ICS device IPs, generate a high-priority alert enriched with process details, user context (from Event ID 4624), and targeted devices.",
              "Statistical Method (Anomalous Process Network Behavior): For each whitelisted process, establish a baseline of its normal network behavior in the first 60 seconds post-launch, calculating the 99th percentile for unique ICS destination IPs contacted. For any new process (whitelisted or not), monitor its network activity for 60 seconds. Generate a medium alert if a whitelisted process exceeds its specific 99th percentile baseline or if an un-whitelisted process contacts more than a generic threshold of 3 unique ICS IPs.",
              "Machine Learning (Supervised Process Classification): Create a labeled dataset from historical process creation events (Event ID 4688), labeling each as 'benign-discovery' or 'malicious-discovery'. Engineer features for each event, including parent process name, command line entropy, and network metrics from Zeek logs (e.g., unique destination IPs, unique ports, bytes sent) within the first 60 seconds. Train a supervised classification model (e.g., Random Forest) on this data. In real-time, classify new processes and generate a high-priority alert if a process is classified as 'malicious-discovery' with high confidence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]