[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via an internet-exposed device?",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0883",
        "name": "Internet Accessible Device",
        "evidence": [
          {
            "description": "Inbound network connections from external, non-allowlisted IP addresses are observed targeting ICS-specific ports (e.g., 102/S7, 502/Modbus, 44818/EtherNet/IP) or remote access ports (e.g., 3389/RDP, 5900/VNC) on assets within the OT network. These connections are indicative of scanning, characterized by rejected states ('REJ'), incomplete handshakes ('S0'), or very short-lived successful connections ('SF') with minimal data transfer (<100 bytes).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security monitoring sensors at the IT/OT boundary (Purdue Level 3.5/DMZ), internet gateway firewalls, and network taps within the supervisory control network (Purdue Level 2).",
            "action": [
              "Create a rule that triggers on Zeek conn.log events where `id.orig_h` is not in an RFC1918 range and not on an approved remote access IP allowlist, `id.resp_h` is within a defined OT network range, and `id.resp_p` is in a watchlist of ICS or remote access ports (102, 502, 9600, 20000, 44818, 3389, 5900). Alert if `conn_state` is 'S0' or 'REJ'. For connections with `conn_state` of 'SF', alert if `duration` < 5 and (`orig_bytes` + `resp_bytes`) < 100. Enrich `id.orig_h` against a threat intelligence feed of known scanning IPs.",
              "For each destination port (`id.resp_p`) on OT assets, establish a 14-day rolling baseline of the hourly count of unique external source IPs (`id.orig_h`). Calculate the 99th percentile of this hourly count and alert if the current count exceeds this threshold. Separately, for each external source IP, calculate the Shannon entropy of the destination ports it connects to in a 1-hour window; alert on high entropy scores indicative of a port scan.",
              "Implement a time-series anomaly detection model (e.g., an LSTM autoencoder) on the aggregated hourly volume of inbound connection attempts to the OT network from external IPs, faceted by `conn_state`. Train the model on at least 90 days of historical Zeek conn.log data. An alert is generated when the model's reconstruction error for the current time window significantly exceeds the learned threshold, indicating a deviation from normal traffic patterns consistent with a coordinated scan."
            ]
          },
          {
            "description": "A high frequency of failed remote access logins (Windows Event ID 4625 with Logon Type 3 for network or 10 for RemoteInteractive) is observed against an internet-facing OT asset (e.g., HMI, EWS, Jump Server). The activity originates from a single external IP address, with a rate exceeding a defined threshold, such as 5 or more failures in 60 seconds.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint security logs on internet-facing Windows-based assets in the process control or supervisory networks (Purdue Levels 2-3), authentication logs from Domain Controllers in the IT/OT DMZ (Purdue Level 3.5), and network security monitoring sensors at the network perimeter.",
            "action": [
              "Create a rule that aggregates Windows Event ID 4625 events by `Source Network Address` over a 60-second sliding window. Trigger an alert if the count for a single non-RFC1918 `Source Network Address` exceeds 5. Enrich the alert by correlating the source IP and timestamp with Zeek conn.log to confirm the external path and with Zeek rdp.log (for cookie/client name) or ssh.log (for client version) for protocol-specific details. Cross-reference the source IP against a real-time threat intelligence blocklist.",
              "For each internet-facing OT asset, establish a 14-day baseline of the hourly rate of failed logins (Event ID 4625, Logon Types 3/10) from external IPs. Alert when the current rate from a single source IP exceeds the 99th percentile of the baseline. To distinguish attack types, calculate the Shannon entropy of the `Target Account Name` field for failures from a single source IP over a 5-minute window; a low entropy score suggests a brute-force attack on a single account, while a high entropy score suggests a password spraying attack across multiple accounts.",
              "Train a supervised classification model, such as Random Forest or Gradient Boosting, to classify login attempts as benign or malicious. Use labeled historical data and engineer features from Windows Event ID 4625 (Logon Type, Status Code, Sub Status Code), Zeek conn.log (source IP geolocation, ASN, time of day), and Zeek rdp.log (RDP cookie, client name). Deploy the model to score each new failed login event from an external source and generate a high-priority alert for events classified as malicious with a confidence score greater than 0.9."
            ]
          },
          {
            "description": "A successful remote login (Windows Event ID 4624 with Logon Type 10 or 3) to an OT asset is observed, originating from an external IP address that deviates from the established behavioral profile for the user account. Anomalous characteristics include a source geolocation or ASN never before seen for that user, a login time outside of normal working hours, or a source IP not on a pre-approved allowlist.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek ssh.log",
              "Approved Remote Access IP Whitelist",
              "Active Directory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint security logs on internet-facing Windows-based OT assets, authentication logs from central servers (Domain Controllers, RADIUS) in the IT/OT DMZ, and an Identity and Access Management (IAM) system or asset database containing whitelists of approved remote access IPs and user roles.",
            "action": [
              "Create a high-priority alert for any successful login (Windows Event ID 4624, Logon Type 10 or 3) where the `Source Network Address` is external (not RFC1918) and is NOT present in a pre-approved IP allowlist specific to the `Target Account Name`. If no per-user allowlist exists, alert on any external login not from a corporate VPN range or known third-party IP range.",
              "For each user account with remote access privileges, build a historical profile from the last 90 days of successful logins (Event ID 4624), capturing: 1) Source countries and ASNs, 2) Typical login hours and days of the week, 3) Previously used source IP subnets. For each new login, calculate a risk score by adding points for deviations (e.g., new country=+3, unusual hour=+1, new subnet=+1). Alert if the cumulative score exceeds a statistically defined threshold, such as a score in the 98th percentile of all historical login scores for that user.",
              "Implement an unsupervised User and Entity Behavior Analytics (UEBA) model, such as an Isolation Forest or a one-class SVM, for each user or user group. Feed the model with features from successful logins, including: time since last login, geographical distance from previous login location, source ASN, source IP reputation, RDP client name (from Zeek rdp.log), and day-of-week/hour-of-day. The model learns a boundary of normal behavior and flags any new login event that falls outside this boundary as a high-risk anomaly."
            ]
          },
          {
            "description": "Following a successful but anomalous login to an OT asset, subsequent network activity originating from that asset is observed that is inconsistent with its operational baseline. This includes: 1) Outbound connections to external destinations on non-standard ports, 2) DNS requests for domains with low reputation or short TTLs, or 3) Unusually large data transfers to external hosts.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security monitoring sensors (Zeek) at the ICS perimeter and IT/OT DMZ, endpoint detection and response (EDR) logs on the source OT asset (capturing process creation and network filtering events), and DNS server logs.",
            "action": [
              "Upon an alert for an anomalous successful login, initiate a triggered search. Alert if, within 60 minutes of the login, a process on the compromised host (identified via Windows Event ID 4688) initiates an outbound network connection (identified via Zeek conn.log) to an external IP or domain found on a C2 threat intelligence list. Correlate using the host IP and timestamp.",
              "For the session following an anomalous login, monitor all outbound connections from the source OT asset's IP (`id.orig_h` in Zeek conn.log). For each new connection, compare the destination country/ASN, destination port (`id.resp_p`), and total bytes transferred (`orig_bytes` + `resp_bytes`) against the asset's 30-day historical baseline. Alert if any attribute is a statistical outlier, such as a destination port never before used by this asset, or a data transfer size exceeding the 99th percentile of all outbound connections from this asset.",
              "Develop a sequence analysis model, such as a Hidden Markov Model or Recurrent Neural Network, trained on typical post-login event sequences from OT assets (e.g., process creations from Event ID 4688, followed by DNS lookups from Zeek dns.log, and network connections from Zeek conn.log). After an anomalous login, feed the subsequent event sequence into the model. Alert if the model assigns a low probability to the observed sequence, indicating a significant deviation from normal operator behavior, such as a command-line interpreter spawning an outbound connection to a newly observed domain."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]