[
  {
    "information_requirement": "Is an adversary attempting to discover running processes on our managed mobile devices? (PIR). Note: On Android 7+ and modern iOS, this typically requires elevated privileges obtained via rooting/jailbreaking or physical access via developer tools, as direct access to the process list is restricted [1].",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1424",
        "name": "Process Discovery",
        "evidence": [
          {
            "description": "A mobile device exfiltrates a process list over the network. This is observed as an outbound HTTP/S POST request with an anomalous Content-Type (e.g., 'application/octet-stream'), a high-entropy body (Shannon entropy > 4.5) suggesting encryption, or a moderate-entropy body (entropy between 3.5 and 4.5) with a character set consistent with Base64 encoding. Alternatively, it is observed as a DNS query where a subdomain label has a length exceeding the 99th percentile of observed lengths for the environment, suggesting DNS tunneling.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, network egress points, DNS servers, VPN concentrators, web proxies, Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Deploy a SIEM rule that triggers when a connection from a mobile device IP range (Zeek conn.log) to a destination IP, domain, or JA3/JA3S hash on a C2 threat intelligence list is observed, and the corresponding flow includes an HTTP POST request (Zeek http.log).",
              "Implement a scheduled query that, for all outbound HTTP POST requests from the mobile VLAN, calculates the Shannon entropy of the POST body (from Zeek files.log or full packet capture) and the URI length. For all DNS queries (Zeek dns.log), calculate the length and character set entropy of the query name. Establish 30-day rolling baselines for these metrics per user and per device. Generate an alert when a value exceeds the 99.5th percentile of its respective baseline, especially if the destination is a newly observed domain (NOD).",
              "Develop and deploy a Random Forest classifier to identify C2 exfiltration. Use features from Zeek logs including: request body entropy, URI length, query name length, query name entropy, connection duration, bytes sent, destination port, domain age, destination ASN rarity, and TLS cipher suite popularity. Augment this with a separate LSTM autoencoder trained on a time-series of bytes sent per device per hour to detect anomalous spikes in outbound traffic volume that may represent the exfiltration event."
            ]
          },
          {
            "description": "On a host computer with a physically connected mobile device (via USB), the Android Debug Bridge process (adb.exe) spawns a child process for process enumeration (e.g., 'tasklist.exe', 'ps.exe', or 'powershell.exe' with 'Get-Process'). This is identified by a Windows Event ID 4688 where ParentProcessName is 'adb.exe', NewProcessName is a known enumeration utility, and the CommandLine field contains relevant arguments. The event is of higher severity when observed on non-developer workstations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Logging (Event ID 4104)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee workstations, developer machines, privileged user workstations, Jump servers, Virtual Desktop Infrastructure (VDI) instances.",
            "action": [
              "Configure a real-time SIEM alert for any Windows Event ID 4688 where ParentProcessName ends with 'adb.exe' and NewProcessName is one of 'tasklist.exe', 'ps.exe', 'wmic.exe', or 'powershell.exe'. For PowerShell events, inspect the command line arguments from the event or associated PowerShell logs (Event ID 4104) for 'Get-Process', 'gps', or 'ps'.",
              "Establish a baseline of parent-child process relationships for all hosts where 'adb.exe' is present, segmented by user role (e.g., Developer, IT, Sales). Calculate an environmental prevalence score for each parent-child-role tuple (e.g., ('adb.exe', 'tasklist.exe', 'Sales')). Trigger an alert when a tuple with a prevalence score below a defined threshold (e.g., <1%) is observed, or if any such pair is observed for a user role where it has never been seen before.",
              "Apply an Isolation Forest model to Windows Event ID 4688 data to identify anomalous process lineage. Features for the model should include ParentProcessName, NewProcessName, user context (via Active Directory group membership), host security group, and command line argument length and entropy. The model will flag events such as 'adb.exe' spawning 'tasklist.exe' on a finance team member's machine as a high-scoring outlier requiring immediate investigation."
            ]
          },
          {
            "description": "A mobile device's state changes to 'rooted' or 'jailbroken' as reported by a Mobile Device Management (MDM) platform. This is corroborated by network activity, where the device establishes connections to domains, IPs, or URLs associated with mobile device rooting (Android) or jailbreaking (iOS) toolkits. Network evidence includes DNS queries for known malicious domains, direct-to-IP connections on non-standard ports (e.g., ports other than 80, 443), or specific URI patterns in HTTP requests.",
            "data_sources": [
              "Mobile Device Management (MDM) logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platforms, corporate network egress points, guest Wi-Fi networks, DNS resolvers, Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Configure a high-severity, real-time alert for any device status change to 'rooted' or 'jailbroken' within the MDM platform. Separately, integrate a threat intelligence feed of domains, IPs, and JA3/JA3S hashes associated with mobile compromise tools and create a SIEM rule to match DNS queries (dns.log), HTTP host headers (http.log), TLS SNI fields (ssl.log), and destination IPs (conn.log) from the mobile device IP range against this feed.",
              "Develop a composite risk score for each mobile device. Increment the score based on statistical anomalies: 1) DNS queries to Newly Observed Domains (NODs) exceeding the 95th percentile for the device's peer group; 2) connections to non-standard ports exceeding the 98th percentile; 3) connections using self-signed or anomalous TLS certificates (e.g., rare issuer) compared to a 30-day baseline. An aggregate score crossing a defined threshold generates an alert for investigation.",
              "Build a domain reputation model using a gradient boosting classifier (e.g., XGBoost) to score domains in real time. Features include domain age, DNS query-to-answer ratio, TTL value, presence on threat feeds, TLS certificate issuer, and lexical features of the domain name (e.g., length, entropy). Use this model's output as a feature in a time-series anomaly detection model (e.g., SARIMA) to flag any device whose average destination reputation score drops significantly. Automatically correlate alerts from this model with 'rooted' or 'jailbroken' status alerts from the MDM platform to confirm device compromise."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]