[
  {
    "information_requirement": "Is an adversary enumerating local or adjacent networks from a managed mobile device? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1421",
        "name": "System Network Connections Discovery",
        "evidence": [
          {
            "description": "An application on a managed mobile device makes network discovery API calls (e.g., Android `WifiInfo.getScanResults()`, `BluetoothAdapter.startDiscovery()`) where the behavior is anomalous. Anomalous behavior is defined as a combination of: 1) The frequency of calls exceeds the application's established baseline, 2) The call originates from a background process, and 3) The application's category (e.g., 'Game') does not align with a functional need for network scanning.",
            "data_sources": [
              "Mobile EDR API Logs",
              "Android Logcat",
              "UEM Application State Logs",
              "MDM Application Inventory",
              "MDM Permission Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": [
              "MDM/UEM Platform",
              "Mobile EDR/MTD Platform",
              "SIEM/Data Lake",
              "Managed Mobile Endpoints"
            ],
            "action": [
              "Create a detection rule to alert when an application making network discovery API calls has a package name, signing certificate hash, or developer ID that matches an entry on a mobile threat intelligence feed.",
              "For each application, calculate a 30-day rolling baseline of hourly discovery API call counts. Generate a medium-severity alert if the count in any hour exceeds the 98th percentile for that app. Escalate to high-severity if an application not categorized as 'Networking', 'Navigation', or 'System Tools' makes any discovery call, or if any discovery call originates from an app running in the background for over 5 minutes.",
              "Apply a pre-trained Local Outlier Factor (LOF) model to score API call events. Use features such as hour of day, application category, time since install, number of permissions, the specific API call, and a background process flag. Flag events with anomaly scores in the top 1% for investigation as potential evasive discovery activity."
            ]
          },
          {
            "description": "A mobile device executes a network discovery API call and, within a 5-minute window, initiates an outbound network connection to a destination exhibiting high-risk characteristics. These characteristics include: being a known malicious C2 indicator, a newly registered domain (NRD), using a non-standard port, or being a direct-to-IP connection.",
            "data_sources": [
              "Mobile EDR API Logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek notice.log",
              "Threat Intelligence Feeds",
              "Passive DNS Data",
              "WHOIS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": [
              "Network Gateway (Wireless Access Points, Firewalls)",
              "DNS Servers",
              "SIEM/Data Lake",
              "Threat Intelligence Platform"
            ],
            "action": [
              "Correlate mobile EDR API logs with Zeek conn.log and dns.log on the device's IP address within a 5-minute window. Trigger a high-severity alert if a network discovery call is followed by a connection to an IP/domain on a C2 threat intelligence list. Escalate to critical if WHOIS data shows the domain was registered within 30 days or if the connection is direct-to-IP.",
              "After a discovery API call, monitor the device's network traffic for 10 minutes. Alert if: a) the Shannon entropy of requested subdomains in Zeek dns.log exceeds 4.2 (potential DGA); b) a connection is made to a domain seen by fewer than 5 other devices in 30 days (long-tail analysis); or c) the ratio of failed connections (`conn_state` 'REJ' or 'RSTO') to one destination exceeds 90% (potential C2 beaconing).",
              "After a discovery event, classify all subsequent outbound connections within 10 minutes using a one-class Support Vector Machine (SVM) model. Use connection features like destination port, protocol, bytes transferred, duration, and JA3/JA3S hash from Zeek ssl.log. Flag connections classified as outliers for investigation as potential anomalous C2 communications."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]