[
  {
    "information_requirement": "Is an adversary attempting to discover the physical location of our managed mobile devices through anomalous administrative access? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "A successful administrative authentication to an EMM/MDM console (e.g., Windows Event ID 4624 Logon Type 3 or 10) exhibits a combination of anomalous characteristics when compared against a 90-day user-specific baseline. These anomalies include: the source IP address is on a threat intelligence feed; the source IP's geolocation (country/ASN) is novel for the user; the login time is outside the user's typical activity window (e.g., beyond the 5th-95th percentile); the TLS client or server fingerprint (JA3/JA3S hash from Zeek ssl.log) is rare for the user or globally; and the HTTP user-agent string (from Zeek http.log or EMM/MDM logs) is associated with non-standard tools or is new for the user.",
            "data_sources": [
              "Windows Event ID 4624",
              "EMM/MDM application logs",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM web application servers, Authentication servers (e.g., Domain Controllers), Network egress points and web proxies, Administrative workstations and VDI environments, Cloud Identity Provider (IdP) consoles and logs",
            "action": [
              "Implement a real-time SIEM rule that generates a critical alert upon a successful administrative login to an EMM/MDM server (e.g., Windows Event ID 4624, Logon Type 3/10) where the source IP from Zeek conn.log matches an active entry in a threat intelligence feed or the HTTP user-agent from Zeek http.log matches a known malicious signature.",
              "For each EMM/MDM administrator, build and maintain a 90-day rolling baseline from authentication logs and Zeek data. The profile must include: 1) a set of known source countries/ASNs, 2) a distribution of login hours, 3) a set of known user-agent strings, and 4) a set of known JA3/JA3S hashes. Assign a risk point for each deviation from the baseline (e.g., new country=+1, login outside 95th percentile=+1, new user-agent=+1). Generate a high-risk alert if the cumulative score for a single login event exceeds a threshold (e.g., score >= 2).",
              "Train and deploy an unsupervised anomaly detection model (e.g., Isolation Forest or Local Outlier Factor) on historical EMM/MDM administrative login data. Engineer features from Zeek and authentication logs, including source ASN, source country (one-hot encoded), time of day and day of week (cyclical encoding), user-agent string (hashed), and JA3/JA3S hash. Score each new successful login in real-time and flag logins with an anomaly score in the top 1% (99th percentile) for immediate investigation as a likely compromised account."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary actively collecting location data from our managed mobile devices via remote management services? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "An anomalous pattern of device location queries from a single administrative account is observed in EMM/MDM application logs, often immediately following a suspicious login. This is evidenced by: 1) the source of the queries originates from an IP address or session previously flagged as anomalous by other detections; 2) the rate of location API calls from the account exceeds the 99th percentile for all admin users over a rolling 1-hour window; 3) the count of unique devices being queried by the account exceeds its own 95th percentile baseline; 4) the time delta between consecutive location queries exhibits abnormally low Shannon entropy (e.g., $$ H(X) < 2.0 $$), indicating scripted or automated activity; and 5) location queries disproportionately focus on devices belonging to high-value personnel groups (e.g., 'Executives', 'R&D').",
            "data_sources": [
              "EMM/MDM application logs",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM web application servers, Network egress points and web proxies, Cloud service access points (for iCloud/Google Find My), DNS resolvers and forwarders",
            "action": [
              "Create a SIEM correlation rule that triggers a critical alert when an alert for an anomalous administrative login (from the Discovery PIR, potentially via Zeek notice.log or SIEM alerts) is followed within 10 minutes by more than 5 location API calls (e.g., to URI path `/api/v*/devices/locate`) from the same user account or session. This directly links suspicious access to suspicious collection activity.",
              "For each EMM/MDM admin user, calculate 30-day rolling baselines from application and network logs. Generate a high-priority alert if a user's activity in a 1-hour window meets any of these statistical criteria: a) the raw count of location API calls exceeds a high static threshold (e.g., >50); b) the call count exceeds the 99th percentile for all admin users; c) the number of unique devices located exceeds the user's own 98th percentile; d) the Shannon entropy of time intervals between requests drops below a baseline-derived threshold (e.g., < 2.0) for sessions with over 10 requests; e) over 75% of located devices belong to a predefined 'high-value' group.",
              "Implement a multivariate time-series anomaly detection model (e.g., an LSTM-based autoencoder) on minute-by-minute aggregations of platform-wide EMM/MDM activity. Track key metrics as separate time series: 1) total count of location API calls, 2) number of unique users making calls, 3) number of unique devices being located, and 4) average request rate per user. Generate an alert when the system's overall state deviates significantly from the model's forecast (e.g., reconstruction error exceeds a 99.5% confidence threshold), indicating a potential coordinated or widespread collection effort."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]