[
  {
    "information_requirement": "Is an adversary attempting to discover the location of our subscribers by impersonating SS7 nodes? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "An SS7 Mobile Application Part (MAP) location query, such as Send Routing Information for SM (SRI-SM, OpCode 45) or Provide Subscriber Information (PSI, OpCode 70), is received by the Home Location Register (HLR) from an external Global Title (GT) that is not on the approved roaming partner whitelist.",
            "data_sources": [
              "SGW_map_transactions.log",
              "HLR_query_logs",
              "roaming_partner_gt_whitelist.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (Signaling Gateways), subscriber databases (HLR/HSS), and network security monitoring platforms.",
            "action": [
              "Create a SIEM rule to join Signaling Gateway (SGW) transaction logs with the roaming partner Global Title (GT) whitelist. Trigger a high-priority alert if a transaction's MAP OpCode is for a location query (e.g., 45, 70) and its source GT is not found in the whitelist.",
              "For each source Global Title (GT), calculate the ratio of location queries to all other message types over a 24-hour window. Establish a baseline using a 30-day rolling window of legitimate roaming partner traffic. Flag any GT whose location query ratio exceeds the 99th percentile of the established baseline for further investigation.",
              "Train a classification model (e.g., Random Forest) on labeled SS7 transaction data, using features such as source GT, message type, time of day, country of origin, and query frequency. Deploy the model to score new transactions and alert on any event classified as 'suspicious' with a confidence score above 0.90, prioritizing those from non-whitelisted GTs."
            ]
          },
          {
            "description": "A single external source Global Title (GT) issues location queries for more than 500 unique subscriber identifiers (MSISDNs) within a one-hour time window, indicating a large-scale scanning attempt.",
            "data_sources": [
              "SGW_map_transactions.log",
              "HLR_query_logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (Signaling Gateways) and subscriber databases (HLR/HSS).",
            "action": [
              "Implement a SIEM rule to trigger a high-severity alert if the count of unique MSISDNs queried by a single source Global Title (GT) exceeds 500 within any 1-hour sliding window, based on HLR query logs.",
              "For each source GT, calculate the hourly count of unique MSISDNs queried. Compute a Z-score for this count against the GT's own 30-day rolling average and standard deviation using the formula $$ Z = (x - \\mu) / \\sigma $$. Generate an alert for any Z-score greater than 3.0, indicating a statistically significant deviation from normal behavior.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to a feature set including (source GT, count of unique MSISDNs queried per hour, ratio of location queries to other message types). Investigate any source GTs classified as noise points (outliers), as they represent anomalous scanning behavior that does not conform to typical roaming partner profiles."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary successfully collecting subscriber location data via SS7 network exploitation? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "Three or more SS7 MAP location queries for a single subscriber identifier (MSISDN) originate from the same non-whitelisted, external Global Title (GT) within a 15-minute period, suggesting targeted tracking of an individual.",
            "data_sources": [
              "HLR_query_logs",
              "SGW_map_transactions.log",
              "VLR_event_logs",
              "roaming_partner_gt_whitelist.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Subscriber location databases (HLR/HSS, VLR) and the signaling gateways (SGW) that route queries to them.",
            "action": [
              "Create a stateful SIEM rule that groups HLR query log events by MSISDN and source Global Title (GT). Generate a 'Potential Subscriber Tracking' alert if the count of location queries from a single non-whitelisted source GT for a single MSISDN is greater than or equal to 3 within a sliding 15-minute window.",
              "Calculate, for each MSISDN, the Shannon entropy of the source GTs making location queries over a 24-hour period using the formula $$ H(X) = -\\sum p(x_i) \\log_2 p(x_i) $$. An entropy score approaching 0 indicates that a single source GT is dominating queries. Flag MSISDNs in the bottom 5th percentile of entropy scores for review of potential targeting.",
              "Input sequences of SS7 events (query type, source GT, timestamp) for each MSISDN into a pre-trained Recurrent Neural Network (RNN) or Long Short-Term Memory (LSTM) model. Investigate any MSISDN for which the model flags a sequence as an 'anomalous tracking pattern', such as repeated location queries with no subsequent legitimate subscriber activity like calls or SMS."
            ]
          },
          {
            "description": "A successful SS7 MAP acknowledgment message, such as a Send Routing Information for SM Acknowledgment (SRI-SM ACK), containing subscriber location data (e.g., serving MSC/VLR address, cell ID) is sent from the network to a destination Global Title (GT) not present on the roaming partner whitelist.",
            "data_sources": [
              "HLR_query_logs",
              "SGW_map_transactions.log",
              "roaming_partner_gt_whitelist.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the core network's signaling plane, specifically the Signaling Gateways (SGWs) responsible for forwarding responses to external networks.",
            "action": [
              "Create a SIEM correlation rule that links inbound location queries (e.g., SRI-SM) with their corresponding outbound responses (e.g., SRI-SM ACK) using a transaction ID. If an outbound response indicates success and its destination Global Title (GT) is not in the roaming partner whitelist, generate a 'Confirmed Location Data Exfiltration' critical alert.",
              "Calculate, for each non-whitelisted external GT, the success rate of its location queries (successful responses / total queries) per hour. Alert if the success rate for a given GT exceeds 90% and also surpasses the 95th percentile of the typical success rate observed for legitimate roaming partners over a 30-day baseline.",
              "Model the SS7 network as a graph where nodes are Global Titles (GTs) and MSISDNs, and edges represent successful queries. Use a graph-based anomaly detection algorithm to identify non-whitelisted GT nodes that become 'high-centrality collectors'. Flag any such node that establishes an anomalously high number of successful collection links to distinct MSISDN nodes for immediate investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]