[
  {
    "information_requirement": "Is an adversary using standard application protocols for command and control on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1437",
        "name": "Application Layer Protocol",
        "evidence": [
          {
            "description": "A mobile device exhibits C2 beaconing behavior, characterized by a connection to a single destination with (1) highly periodic connection intervals (coefficient of variation < 0.2), (2) uniform and small payload sizes (standard deviation < 100 bytes), and (3) low diversity in the requested URI paths (e.g., < 3 unique paths per hour).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi infrastructure, VPN concentrators, Mobile Device Management (MDM) platforms",
            "action": [
              "Continuously match destination IPs, domains, and URIs from Zeek conn.log and http.log against a threat intelligence feed of known C2 indicators. Generate an alert on any match from a mobile device.",
              "For each mobile source IP, group connections by destination over a 1-hour window. Calculate the coefficient of variation for inter-arrival times and the standard deviation for originator/responder payload sizes from Zeek conn.log. Generate an alert if the time coefficient of variation is below 0.2 and the payload standard deviation is below 100 bytes, indicating non-human, automated communication.",
              "Apply a DBSCAN clustering algorithm to mobile device traffic, using features from Zeek logs such as destination port, protocol, inter-arrival time variance, payload size statistics, and URI diversity. Identify and investigate small, dense clusters classified as outliers, as these represent anomalous, machine-like beaconing distinct from large, diffuse clusters of normal user activity."
            ]
          },
          {
            "description": "DNS traffic from a mobile device indicates its use as a C2 channel, identified by one or more of the following: (1) an abnormally high query volume to a single parent domain, (2) query subdomains with high Shannon entropy (> 4.5), (3) a high ratio of TXT/CNAME queries relative to A/AAAA queries, or (4) large DNS response payloads in TXT records (> 512 bytes).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, DNS forwarders, Network egress points, Corporate Wi-Fi infrastructure",
            "action": [
              "Scan the 'query' field in Zeek dns.log in real-time for domains matching regular expressions or explicit entries from a threat intelligence feed of known DGAs and DNS tunneling C2 domains. Generate a high-severity alert for any match originating from a mobile device IP address.",
              "For each mobile source IP over a 1-hour window, calculate: (a) the Shannon entropy of the subdomain in the 'query' field, and (b) the ratio of TXT queries to A queries for each parent domain. Establish baselines for these metrics. Generate an alert if a device's query entropy exceeds the 99th percentile (or an absolute value of 4.5) and the TXT-to-A query ratio exceeds a 3-sigma deviation from the norm.",
              "Train a Random Forest classifier using a labeled dataset of benign and malicious (DGA/tunneling) DNS queries. Engineer features from Zeek dns.log including: query length, subdomain entropy, ratio of numeric to alphabetic characters, query type, and TXT record response size. Deploy the model to classify live DNS queries from mobile devices, flagging those classified as 'malicious' for review."
            ]
          },
          {
            "description": "An outbound HTTP/S connection from a mobile device presents a client signature (User-Agent, JA3/S, or JA4+ hash) that is either (1) listed on a threat intelligence feed of malicious indicators or (2) statistically rare, with a prevalence of less than 0.1% across the mobile device fleet over the last 30 days.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek ja4.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Application Firewalls (WAFs), Reverse proxies, Internet gateways, MDM/UEM platforms for device context",
            "action": [
              "Continuously scan Zeek http.log ('user_agent'), ssl.log ('ja3', 'ja3s'), and ja4.log ('ja4_hash') against a threat intelligence list of signatures associated with known mobile malware and C2 frameworks. Generate an immediate alert upon any exact match from a mobile device's IP address.",
              "For all mobile devices, compute a frequency distribution of all User-Agent strings, JA3 hashes, and JA4+ hashes observed over a rolling 30-day window. Calculate the prevalence of each signature. Generate an alert for any connection from a mobile device using a signature with a prevalence below 0.1%, flagging it as a rare client requiring investigation.",
              "Deploy an Isolation Forest anomaly detection model trained on benign mobile client traffic signatures. Engineer features from Zeek logs including User-Agent string length and token count, and categorical features from JA3 and JA4+ hashes (e.g., TLS version, cipher suites). Score new connections in real-time and flag those with high anomaly scores, representing significant deviations from the baseline of legitimate mobile application clients."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]