[
  {
    "information_requirement": "Has an adversary gained initial access to the corporate network via a compromised mobile device?",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1461",
        "name": "Lockscreen Bypass",
        "evidence": [
          {
            "description": "A sequence of at least five failed authentication events (Windows Event ID 4625 for 'An account failed to log on') from a single source 'IpAddress', followed within five minutes by a successful authentication event (Windows Event ID 4624 for 'An account was successfully logged on') from the same 'IpAddress' and for the same 'TargetUserName'. The event is correlated with MDM/UEM or VPN logs to confirm the source 'IpAddress' was assigned to a mobile device at the time of the event.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "MDM/UEM logs",
              "VPN logs",
              "IdP logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Active Directory Domain Controllers), VPN Concentrators, Cloud Identity Providers (e.g., Azure AD, Okta), Internet Gateway, MDM/UEM solution logs.",
            "action": [
              "Deploy a correlation rule that triggers when, for a single source 'IpAddress' and 'TargetUserName', the count of Windows Event ID 4625 exceeds 4 within a 10-minute window, and is immediately followed by a Windows Event ID 4624 from the same 'IpAddress' and for the same 'TargetUserName' within 5 minutes of the last failure. The rule must then enrich the event by querying MDM/VPN logs to confirm the 'IpAddress' was assigned to a mobile device at the event time. Generate a medium-severity alert if all conditions are met.",
              "For each alert from the symbolic rule, enrich the source 'IpAddress' using Zeek conn.log data to get geolocation and ASN. Profile the 'TargetUserName' over the last 90 days to establish baselines for: (a) login hour-of-day, (b) source country, (c) source ASN. Calculate if the new login's hour is outside the user's 5th-95th percentile range. Identify if the source country or ASN is new for the user in that period. If the login time is anomalous AND either the country or ASN is new, escalate the alert severity to 'High'.",
              "Feed successful login events that triggered the symbolic alert into a user-centric anomaly detection model (e.g., Isolation Forest or One-Class SVM). The feature set for the model should include: hour of day, day of week, source ASN, source country, and a categorical feature for device OS (from MDM). If the model classifies the event with an anomaly score in the top 1% for that specific user's historical login patterns, classify the event as 'Highly Suspicious' and initiate an automated response, such as requiring MFA re-authentication or session termination."
            ]
          },
          {
            "description": "A source IP address, confirmed to belong to a mobile device via MDM/VPN log correlation, exhibits anomalous network behavior in Zeek logs. This includes one or more of the following: (1) Connections (conn.log) to internal servers or ports not typically associated with the user's role or mobile applications; (2) DNS queries (dns.log) for domains with a calculated Shannon entropy score greater than 4.0 (indicative of DGA) or exhibiting unusually low TTL values (< 60s); (3) Unusually large data transfers (orig_bytes or resp_bytes in conn.log) to external destinations; (4) Use of self-signed or expired TLS certificates (ssl.log).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log",
              "MDM/UEM logs",
              "VPN logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (especially those housing sensitive data like developer environments or financial systems), Corporate Wi-Fi access points, VPN termination points, DNS resolvers, Egress points to the internet.",
            "action": [
              "Create a SIEM rule that joins VPN/MDM logs with Zeek logs. The rule should alert if an IP address assigned to a mobile device connects to an internal IP on a 'Restricted Assets' watchlist OR communicates using a TLS certificate where 'validation_status' in Zeek ssl.log is 'self_signed' or 'unable_to_get_local_issuer'. The alert should be suppressed only if the user associated with the device is in a pre-authorized access group for that specific asset.",
              "For each mobile device IP, establish a 30-day rolling baseline of network activity. Generate an alert if: (a) The Shannon entropy of requested DNS domains in a 5-minute window (from Zeek dns.log) exceeds 3 standard deviations above the device's mean entropy. (b) The total bytes sent ('orig_bytes' in Zeek conn.log) in a single connection to an external IP exceeds the 99th percentile of the device's historical outbound connection sizes. (c) The HTTP 'User-Agent' string (from Zeek http.log) is not present in a set of the 20 most common user agents for that device over the last 30 days.",
              "Implement a graph neural network (GNN) to model normal device-to-server communication patterns. Nodes represent devices and internal servers, and edges represent connections. Feed Zeek conn.log data into the model in near real-time. Anomaly scores are generated for each new connection (edge); connections with a score indicating they are highly improbable based on the learned graph structure trigger an alert. Concurrently, use a Seasonal-ARIMA (SARIMA) time-series model to forecast the expected outbound data volume per device for each hour. An alert is triggered if the actual volume exceeds the model's 99% prediction interval."
            ]
          },
          {
            "description": "An MDM/UEM platform generates a high-severity compliance alert for a managed mobile device, such as 'isRooted=true', 'isJailbroken=true', 'osIntegrityCheck=Failed', or 'Disallowed Application Installed'. Within a 60-minute window following this alert, authentication logs (Windows Event ID 4624, IdP logs) record a successful login to a corporate resource from the IP address most recently associated with that non-compliant device (via VPN/MDM session logs).",
            "data_sources": [
              "MDM/UEM logs",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "VPN logs",
              "IdP logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM Management Servers, Authentication Servers, VPN Concentrators, Cloud Identity Providers.",
            "action": [
              "Implement a stateful correlation rule that triggers on any MDM/UEM log indicating a critical compliance failure (e.g., jailbreak, rooting, integrity failure). Upon trigger, the rule should cache the device ID and its last known IP address. It will then monitor all authentication logs for the next 60 minutes. If a successful login (e.g., Windows Event ID 4624, successful IdP event) from that cached IP occurs, immediately generate a 'Critical' severity incident and assign it for investigation.",
              "For each type of MDM compliance alert, calculate the 95th percentile of the time-to-remediation (duration from alert generation to compliant state restoration) across the fleet. Create a scheduled query that runs hourly to identify devices that have been in a non-compliant state longer than this statistical threshold. For any such device, check Zeek conn.log to see if its associated IP has transmitted more than 1MB of data in the past hour. Flag any device meeting both criteria for automated network quarantine.",
              "Develop an XGBoost classification model to predict the likelihood that a compliance alert is part of a malicious event. Train the model on historical MDM alerts, using features like: alert type (one-hot encoded), user's department, device OS version, time of day, and a labeled outcome (e.g., part of a past true-positive incident). In production, score each new critical compliance alert. If the model outputs a risk score > 0.9, and a successful authentication from the device's IP is observed within one hour, automatically escalate the event to a Tier-3 analyst with all correlated data."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]