[
  {
    "information_requirement": "Is an adversary capturing sensitive information from user screens on corporate mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1513",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "A mobile application, which is not on the corporate software allowlist, is observed in MDM logs being granted screen recording permissions, possesses the 'android.permission.INTERNET' permission, and subsequently initiates an outbound network connection where the total 'orig_bytes' exceeds 10MB to a single destination IP within a 24-hour period.",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM permission grant logs",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/EMM servers, managed mobile device endpoints, network data collection points (e.g., Zeek sensors at internet gateway), and internal DNS servers.",
            "action": [
              "Create a SIEM correlation rule that alerts when an MDM/EMM log event indicates a screen capture permission grant to an application whose package name is not in the approved software allowlist, and the application's manifest, also logged by the MDM, includes the 'android.permission.INTERNET' permission.",
              "For any device associated with the symbolic alert, analyze its network traffic in Zeek conn.log. Establish a 30-day baseline of daily outbound data volume ('orig_bytes') for the device and calculate the 98th percentile. Alert if the outbound volume in the 24 hours following the permission grant exceeds this percentile. Concurrently, analyze Zeek dns.log and calculate the Shannon entropy of the requested subdomains for any single parent domain using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. An entropy score that deviates by more than 3 standard deviations from the device's historical DNS entropy baseline indicates potential C2 communication.",
              "For network flows generated by the alerted application, apply a pre-trained Isolation Forest model to detect anomalies. The model should be trained on features from Zeek conn.log including 'duration', 'orig_bytes', 'resp_bytes', 'proto', periodicity of connections (time delta between flows), and a one-hot encoded feature for destination port. A flow that is classified as an outlier with a high anomaly score, occurring within one hour of the screen recording permission grant, must be escalated for immediate forensic investigation."
            ]
          },
          {
            "description": "An application whose package name is not on a pre-approved allowlist is granted Android Accessibility Service privileges, as recorded by MDM compliance logs. Within 6 hours of this event, the device's total outbound data volume ('orig_bytes' in Zeek conn.log) exceeds its 30-day historical baseline by more than three standard deviations.",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM security policy compliance logs",
              "Android logcat",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/EMM servers, central log aggregator (SIEM/Data Lake), and managed mobile device endpoints.",
            "action": [
              "Using the MDM/EMM platform, create and enforce a security policy containing an explicit allowlist of application package names approved for Accessibility Service privileges. Configure a real-time, high-severity alert to trigger for any compliance violation event where an unlisted application is granted these services on a managed device.",
              "For a device that triggers the symbolic alert, query Zeek conn.log to profile its network behavior. Calculate the mean and standard deviation of total outbound data volume ('orig_bytes') per hour based on a 30-day history. Flag the device if the outbound volume in any hour within the 24 hours following the alert exceeds the mean by more than three standard deviations. Concurrently, calculate the data exfiltration ratio ($$ R = \\frac{\\text{orig\\_bytes}}{\\text{resp\\_bytes}} $$) for all connections; a ratio greater than 10 for connections involving more than 1MB of data should be considered highly suspicious.",
              "Implement a time-series forecasting model (e.g., SARIMA or Prophet) for each managed device's hourly outbound data volume, using historical Zeek conn.log data. A measured data volume that exceeds the model's forecasted 99% upper confidence interval is flagged as a temporal network anomaly. In the SIEM, correlate this network anomaly with an MDM compliance alert for a newly enabled, non-allowlisted accessibility service on the same device within a 1-hour window to generate a high-confidence incident."
            ]
          },
          {
            "description": "The execution of 'screencap' or 'screenrecord' processes is detected by a mobile EDR agent, or an inbound network connection to TCP port 5555 (the default for remote adb) from an unauthorized source IP is observed in firewall or Zeek logs.",
            "data_sources": [
              "Mobile EDR logs",
              "Android logcat",
              "Zeek conn.log",
              "Zeek notice.log",
              "Firewall logs",
              "MDM/EMM developer mode/USB debugging logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device endpoints with EDR/logging agents, network infrastructure (firewalls, IDS/IPS), and specific network segments designated for developer access.",
            "action": [
              "Deploy a firewall rule to block and log all inbound traffic to TCP port 5555 at the network perimeter, with an exception allowlist for authorized developer IP address ranges. Additionally, configure mobile EDR agents to create a high-severity alert upon any process execution event where the process name is 'screencap' or 'screenrecord'.",
              "For authorized adb connections on TCP/5555, query Zeek conn.log to establish a 30-day baseline of session metrics per developer source IP. Generate an alert if a new session's total data volume ('orig_bytes' + 'resp_bytes') exceeds the 95th percentile of the baseline, or if the session 'duration' exceeds the baseline mean by more than two standard deviations. Separately, calculate the variance of the inter-arrival time between consecutive connections from the same source IP over a 24-hour period; a variance approaching zero indicates potentially automated, non-interactive beaconing.",
              "Train and deploy a supervised classification model (e.g., Gradient Boosting or Random Forest) to classify adb sessions as 'benign' or 'malicious'. Use features from Zeek conn.log including 'duration', 'orig_bytes', 'resp_bytes', 'history', 'conn_state', and the source IP's presence on the developer allowlist. A session classified as 'malicious' with a confidence score above 0.9, especially if originating from an unauthorized IP, must automatically trigger a SOAR playbook to isolate the mobile device via MDM and create a ticket for the security operations team."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]