[
  {
    "information_requirement": "Is an adversary using non-standard or suspicious asymmetric cryptography for command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521.002",
        "name": "Asymmetric Cryptography",
        "evidence": [
          {
            "description": "A TLS session originating from a mobile device's IP address exhibits anomalous certificate properties. This is evidenced by one or more of the following in Zeek ssl.log: 1) the 'validation_status' field is 'self-signed'; 2) the certificate's 'issuer' or 'subject' field matches a known malicious entity from a threat intelligence feed; or 3) the certificate's validity period, calculated as the difference between 'not_valid_after' and 'not_valid_before' timestamps, is a statistical outlier (e.g., in the bottom 5th percentile) compared to a historical baseline of mobile device TLS sessions.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek ja3.log",
              "Zeek ja3s.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, VPN concentrators, MDM (Mobile Device Management) proxy servers, Cloud Access Security Brokers (CASB), Cellular network gateways (for corporate-liable devices backhauling traffic)",
            "action": [
              "Query Zeek ssl.log for records where the 'issuer' or 'subject' fields match a threat intelligence list of malicious certificate authorities and subjects. Correlate any matches with Zeek conn.log using the 'uid' to verify the source IP ('id.orig_h') is within a designated mobile device IP range and create a high-severity alert.",
              "Continuously monitor Zeek ssl.log for sessions from mobile IP ranges. For each session, calculate the certificate's validity duration in days. Compare this duration to a 30-day rolling baseline distribution of all mobile certificate durations. Generate an alert if a session's certificate has a 'validation_status' of 'self-signed' OR its duration falls below the 5th percentile of the baseline. Enrich the alert with connection metadata (e.g., 'duration', 'orig_bytes', 'resp_bytes' from conn.log) to aid prioritization.",
              "Train a Random Forest classification model to assign a risk score to each TLS session from a mobile device. Engineer features from Zeek logs including: certificate validity duration, public key length, TLS version ('version' from ssl.log), selected cipher suite, the JA3 hash ('ja3' from ja3.log), and JA3S hash ('ja3s' from ja3s.log), plus connection properties ('duration', 'orig_bytes', 'resp_bytes' from conn.log). Use the model's output probability score to triage suspicious sessions, flagging those with the highest scores for immediate analyst review."
            ]
          },
          {
            "description": "A sequence of encrypted network connections from a single mobile device to a single external destination IP and port exhibits highly regular, periodic 'heartbeat' behavior characteristic of automated C2 communication. This is evidenced by: 1) connections being made to a destination IP ('id.resp_h') that is present on a C2 threat intelligence list; or 2) a flow of connections displaying statistically low variance in both the time between connections and the volume of data transferred per connection.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, MDM (Mobile Device Management) proxy servers, Corporate Wi-Fi gateways, Cellular network gateways (for corporate-liable devices backhauling traffic)",
            "action": [
              "Implement a real-time monitoring rule on Zeek conn.log data to alert whenever a connection is initiated from a corporate mobile IP range ('id.orig_h') to a destination IP ('id.resp_h') that matches an entry in a threat intelligence feed of known C2 servers. This should be a high-priority alert.",
              "Aggregate Zeek conn.log records over 1-hour windows, grouping by the 4-tuple: source IP, destination IP, destination port, and protocol. For each group with over 10 connections, calculate the coefficient of variation (Standard Deviation / Mean) for two metrics: 1) the inter-arrival time between connection start times ('ts'), and 2) the total bytes transferred per connection ('orig_bytes' + 'resp_bytes'). Alert on any group where both coefficients fall below the 1st percentile of their respective historical distributions, indicating abnormally uniform, machine-generated traffic patterns.",
              "For each unique client-server flow (source IP, destination IP, destination port), model the traffic patterns using a time-series anomaly detection model, such as an LSTM autoencoder. Create a multivariate time series using features from Zeek conn.log like inter-arrival time, connection duration, and total bytes per connection. Train the model on a baseline of known benign traffic. A high reconstruction error on live traffic indicates a significant deviation from normalcy, flagging the flow as a potential C2 beacon for investigation."
            ]
          },
          {
            "description": "Data is covertly tunneled for command and control purposes by being encoded within protocol fields not intended for bulk data transfer, such as DNS query names or HTTP User-Agent strings. This method could be used to establish C2 or exfiltrate small amounts of data, like cryptographic keys. Evidence includes: 1) strings that match known malicious patterns or IOCs; or 2) strings that exhibit statistically high Shannon entropy, indicating a random-like character distribution inconsistent with legitimate values.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Forward web proxies, Reverse proxies, Cloud Access Security Brokers (CASB)",
            "action": [
              "Continuously scan Zeek dns.log for queries where the 'query' field matches a threat intelligence list of malicious domains or a regular expression for known DGA patterns. Simultaneously, scan Zeek http.log for requests where the 'user_agent' string matches a blocklist of malicious or non-standard agents. Generate an alert for any match.",
              "For each DNS query in Zeek dns.log, calculate the Shannon entropy of the 'query' field (excluding the TLD). For each request in Zeek http.log, calculate the entropy of the 'user_agent' string. Compare each calculated entropy value against a 30-day rolling baseline for its respective field type. Flag any value exceeding the 99th percentile for analyst review. As a secondary validation, perform a Chi-squared goodness-of-fit test on the character frequency of the flagged string against a baseline of benign strings; a low p-value (e.g., < 0.01) confirms an anomalous distribution.",
              "Utilize a density-based clustering algorithm like DBSCAN to identify anomalous DNS and HTTP requests from mobile devices. Engineer a feature set from Zeek logs, including: query length, subdomain count, and query entropy from dns.log; and User-Agent length and entropy from http.log. Apply the DBSCAN algorithm to this combined feature space. Points that are classified as noise (i.e., do not belong to any cluster) are considered outliers and should be investigated as potential C2 activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]