[
  {
    "information_requirement": "Is an adversary using symmetric cryptography for command and control (C2) communications originating from managed mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521.001",
        "name": "Symmetric Cryptography",
        "evidence": [
          {
            "description": "Evidence of a mobile application C2 beacon is present when network traffic from a single mobile device to a single external destination exhibits a combination of periodic connections (inter-arrival time standard deviation < 5 seconds over a 1-hour window), high-entropy payloads (Shannon entropy > $$ 7.5 $$), and the use of a non-standard, high-numbered destination port ($$ > 1024 $$) that does not match the application's known profile.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek software.log",
              "Zeek http.log",
              "Mobile Device Management (MDM) network flow logs",
              "Mobile EDR network connection logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices, Corporate Wi-Fi network sensors, VPN concentrators, Internet Gateway / Egress Firewall, Cloud Access Security Broker (CASB), Mobile Device Management (MDM) Server",
            "action": [
              "Using a SIEM, continuously join mobile device network logs (`Zeek conn.log`, `MDM network flow logs`) with a threat intelligence feed of known C2 servers. Generate a critical alert for any connection where the destination IP or domain is a positive match.",
              "For each mobile device's source IP, perform the following analysis over a 1-hour sliding window: 1. Group outbound connections by destination IP and port. 2. For each group, calculate the standard deviation of the inter-arrival times. 3. For the same flows, if payload data is available (`Zeek files.log`), calculate the Shannon entropy. 4. Assign a risk score based on the following: +3 if inter-arrival standard deviation is less than 5 seconds, +3 if payload entropy is greater than $$ 7.5 $$, +2 if the destination port is greater than 1024 and not on an established allow-list of common application ports. Alert on any flow with a cumulative score exceeding 4. Dynamically baseline thresholds using the 5th percentile for inter-arrival time standard deviation and the 95th percentile for payload entropy across all mobile devices. Maintain a baseline of common high-numbered ports used by legitimate applications to reduce false positives.",
              "Implement a two-stage machine learning detection. Stage 1: Deploy a per-device time-series anomaly detection model (e.g., ARIMA, LSTM) to monitor the volume of high-entropy ($$ > 7.0 $$) outbound traffic over 5-minute intervals. Stage 2: When the time-series model flags an anomaly, trigger a classification model (e.g., Random Forest) trained on a labeled dataset of C2 vs. benign traffic. Features for the classifier should include: inter-arrival time statistics (mean, std dev), payload entropy, connection duration, bytes sent/received, destination port, categorical features for destination ASN, and the JA3/JA3S hash if available from `Zeek ssl.log`. A high-confidence classification of C2 from this model generates a high-priority incident."
            ]
          },
          {
            "description": "Evidence of C2 tunneling is present when a network connection from a mobile device uses a standard service port but does not conform to the expected application-layer protocol. For example, a TCP connection on port 443 is recorded in `Zeek conn.log` but has no corresponding TLS handshake in `Zeek ssl.log` for the same connection UID, or a UDP connection on port 53 in `conn.log` has no matching query in `dns.log`.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internal DNS resolvers, Cloud Access Security Broker (CASB) logs, Core network switches",
            "action": [
              "In a SIEM, create a rule that performs a left join from `Zeek conn.log` to `Zeek ssl.log` on the connection UID for traffic where `dest_port` is 443. Alert when the `ssl.log` entry is null. Perform a similar join from `conn.log` to `dns.log` for traffic on `dest_port` 53. Enrich alerts with threat intelligence on the destination IP and ASN; increase severity for matches or for ASNs associated with residential ISPs or hosting providers not typically used for enterprise mobile services.",
              "For each mobile device, establish a baseline for protocol adherence. Calculate a daily 'Protocol Mismatch Ratio' as $$ R = (\\text{Mismatched Connections}) / (\\text{Total Connections on Port}) $$ for key ports like 443 and 53. Monitor this ratio by alerting when a device's daily ratio exceeds 3 Median Absolute Deviations (MAD) from its own 30-day rolling median, or exceeds the 99th percentile for the entire population of mobile devices.",
              "Develop an unsupervised anomaly detection model (e.g., Isolation Forest) to score each network connection from mobile devices. Train the model on a dataset of known-good, protocol-adherent traffic. Features should include: `conn.log` duration, `orig_bytes`, `resp_bytes`, `proto`, the `service` field, the `conn_state` field, character distribution of the `history` field, and a one-hot encoded vector for the destination port. Connections receiving a high anomaly score are flagged for analyst review as potential non-standard protocol usage indicative of C2."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]