[
  {
    "information_requirement": "Is an adversary transferring malicious tools or files onto our managed mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1544",
        "name": "Ingress Tool Transfer",
        "evidence": [
          {
            "description": "A file transfer to a mobile device is identified where the file's attributes (e.g., MIME type, filename), the source's reputation (e.g., domain age, threat intelligence category), and the network protocol characteristics (e.g., self-signed certificate) collectively indicate a high probability of being an unauthorized tool.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points capturing traffic from corporate-managed mobile devices, including VPN concentrators, corporate Wi-Fi access point controllers, and Mobile Device Management (MDM) or Unified Endpoint Management (UEM) platform traffic logs.",
            "action": [
              "For each file transfer identified in `files.log` or `http.log` targeting a mobile device IP range, cross-reference the source IP (`id.orig_h`) and destination hostname (`host` from http.log or `server_name` from ssl.log) against threat intelligence feeds for known malicious droppers or C2 servers. Generate a critical alert upon a match.",
              "For each file in `files.log` from an external source to a mobile device, calculate a composite risk score. The formula is: $$ Score = (w_1 \\cdot I_{entropy}) + (w_2 \\cdot I_{age}) + (w_3 \\cdot I_{mime}) + (w_4 \\cdot I_{cert}) $$. Factors include: $$ I_{entropy} = 1 $$ if filename Shannon entropy > 95th percentile of historical transfers; $$ I_{age} = 1 $$ if source domain age < 90 days (via WHOIS enrichment); $$ I_{mime} = 1 $$ if MIME type is 'application/vnd.android.package-archive', 'application/x-mach-binary', or 'application/octet-stream'; and $$ I_{cert} = 1 $$ if `x509.log` shows a self-signed or invalid certificate for the associated `uid`. Assign weights ($$w$$) based on risk tolerance. Flag any transfer with a score exceeding a defined threshold (e.g., 2.0) for manual investigation.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) using a baseline of legitimate network connections from `conn.log`, `ssl.log`, and `dns.log`. Key features should include: JA3/JA3S hash, TLS version, selected cipher suite, connection duration, `orig_bytes`, `resp_bytes`, DNS query type, and the ratio of `resp_bytes` to `orig_bytes`. Apply the trained model to all new connections associated with file transfers (`files.log` `conn_uids`). Flag connections with high anomaly scores for analyst review, enriching the alert with the specific features that contributed most to the score."
            ]
          },
          {
            "description": "A network session involving a mobile device exhibits a data transfer volume (response bytes) that is a statistical outlier compared to the device's own historical baseline and that of its defined peer group, where the destination is not an approved, high-volume service (e.g., app stores, cloud storage).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points capturing traffic from corporate-managed mobile devices, including VPN concentrators, corporate Wi-Fi access point controllers, and Mobile Device Management (MDM) or Unified Endpoint Management (UEM) platform traffic logs.",
            "action": [
              "Define an allow-list of domains/IPs for approved large file transfer services (e.g., Google Play, Apple App Store, corporate cloud services). Monitor `conn.log` for all sessions involving mobile device IPs where `resp_bytes` exceeds a static threshold (e.g., 100MB). If the destination IP address (from `conn.log`) or resolved domain name (from `dns.log`) is not on the allow-list, generate a medium-severity alert.",
              "For each mobile device, establish a rolling 30-day baseline of total daily download volume by summing `resp_bytes` from `conn.log`. Calculate the mean ($$ \\mu $$) and standard deviation ($$ \\sigma $$) for this baseline. For each new day's total download volume ($$ x $$), calculate the Z-score: $$ Z = (x - \\mu) / \\sigma $$. Generate a high-severity alert if $$ |Z| > 3 $$, indicating a significant deviation from normal behavior.",
              "Implement a time series forecasting model (e.g., SARIMA, Prophet) for each mobile device's hourly data download volume, trained on at least 90 days of `conn.log` `resp_bytes` data. The model should account for weekly and daily seasonality. In near real-time, compare the actual download volume for each hour against the model's forecast. If the observed volume exceeds the upper bound of the 99% prediction interval, trigger an anomaly alert. The alert must include the observed volume, the predicted volume, the prediction interval, and the top 5 destination domains/IPs from that hour for immediate context."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]