[
  {
    "information_requirement": "Is an adversary using scheduled tasks for persistence on mobile devices? (PIR)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task-Job",
        "evidence": [
          {
            "description": "A single mobile device generates repetitive, uniform network connections to the same destination. This pattern is defined by a time-series analysis showing statistically significant periodicity, an inter-arrival time standard deviation (jitter) below 5 seconds, and a Gini coefficient for both connection duration and total bytes transferred below a threshold of $$ 0.2 $$, indicating automated, non-interactive C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek intel.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Network egress points, Cloud Access Security Brokers (CASB), Mobile Device Management (MDM) platforms.",
            "action": [
              "For all outbound connections from mobile IP ranges in `Zeek conn.log`, correlate destination IPs with domains from `Zeek dns.log` and the `server_name` field from `Zeek ssl.log`. Compare destination IPs, domains, and JA3/JA3S hashes against threat intelligence feeds of known C2 infrastructure. Generate an alert for any match reported in `Zeek intel.log`.",
              "For each mobile source IP, group outbound connections by destination IP over a 24-hour window. For each group, calculate the standard deviation of inter-arrival times (jitter). Separately, calculate the Gini coefficient for connection duration and total bytes transferred. Flag devices where jitter is in the bottom 5th percentile (or < 5 seconds) and the Gini coefficients are both below 0.2, indicating highly uniform, automated traffic.",
              "For connection patterns flagged by the statistical analysis, create a time series of connection start times. Apply a Fast Fourier Transform (FFT) to this series to identify dominant frequencies, which reveal the period of the scheduled task (e.g., a strong peak at 1/3600 Hz indicates a 1-hour interval). A strong periodic signal to a low-reputation destination is a high-fidelity alert for a scheduled beacon."
            ]
          },
          {
            "description": "A mobile device's network traffic profile is a statistical outlier when compared to its defined peer group (e.g., devices with the same OS and business role). The anomalous profile is characterized by a high ratio (> 95th percentile) of traffic on non-standard ports or evidence of DNS tunneling, such as a DNS query size exceeding 2 standard deviations from the peer group mean.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Network egress points, Internal DNS resolvers.",
            "action": [
              "Maintain an allowlist of approved business application ports (>1024). Create a rule to flag any connection from a mobile device IP in `Zeek conn.log` to a destination port not on this list. Additionally, monitor `Zeek weird.log` for notices like `dns_unmatched_reply` or `data_after_close` originating from mobile IP ranges and generate an alert.",
              "Define peer groups for mobile devices using MDM data (e.g., OS, department, owner). For each device, calculate a feature set including the ratio of traffic on non-standard ports and the average size of DNS TXT/NULL record queries. Flag any device where these metrics exceed the 98th percentile or 2 standard deviations from its peer group's baseline.",
              "For each mobile device, construct a feature vector using normalized values for: protocol distribution (TCP/UDP/ICMP), port entropy, average connection duration, total bytes transferred, DNS query characteristics (query length entropy, A/AAAA vs TXT/NULL ratio), and JA3 hash distribution. Apply a density-based clustering algorithm like DBSCAN to identify outliers. Devices classified as noise points represent anomalous network behavior and are primary candidates for investigation for covert C2 channels established by a scheduled task."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using a scheduled task to execute malicious code on mobile devices? (PIR)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task-Job",
        "evidence": [
          {
            "description": "A mobile device periodically downloads files with MIME types for mobile executables (e.g., 'application/vnd.android.package-archive', 'application/octet-stream'). These downloads originate from a domain with a low reputation score (e.g., newly registered, not in Tranco Top 1M), and the download events exhibit statistically significant periodicity, such as a repeating pattern every 24 hours.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek intel.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, Web Proxies.",
            "action": [
              "In `Zeek files.log`, calculate the MD5/SHA1 hash for every downloaded file and compare against malware hash databases. In `Zeek http.log`, check the `host`, `uri`, and `user_agent` fields against threat intelligence feeds. In `x509.log`, check the certificate issuer against a list of non-standard CAs. Alert on any match found in `Zeek intel.log`.",
              "Filter `Zeek files.log` for mobile-specific MIME types (e.g., `application/vnd.android.package-archive`). For each source device, apply an autocorrelation function (ACF) to the time series of these download events; a significant spike at a non-zero lag indicates periodicity. Separately, analyze the `User-Agent` string from `http.log`; flag agents with low prevalence (<1%) across the enterprise or those matching known malicious patterns.",
              "Train a gradient boosting classifier (e.g., XGBoost) to produce a 'malicious download' score. Use features including: domain age and reputation of the host (`http.log`), filename entropy (`files.log`), User-Agent string prevalence, file MIME type (`files.log`), presence of `seen.indicator` in `intel.log`, and the certificate validity period from `x509.log` (short-lived certs are suspicious). A high score, especially when correlated with periodic behavior from the statistical analysis, constitutes a high-confidence alert."
            ]
          },
          {
            "description": "A mobile device makes DNS queries at regular intervals for a domain that is algorithmically generated. This is characterized by a low standard deviation (< 10 seconds) of inter-query time for a specific domain that also has high lexical entropy, is not on an allowlist, and was registered within the last 30 days.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek intel.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Network egress points, DNS firewalls.",
            "action": [
              "Continuously check all domains in `Zeek dns.log` from mobile device subnets against threat intelligence feeds (C2, DGA) and a list of Newly Registered Domains (NRDs). Create a rule to detect when a mobile device's DNS query is resolved by a non-corporate DNS server. Alert on any match.",
              "For each queried domain not on an enterprise allowlist, calculate its lexical features: Shannon entropy, length, and n-gram score (by comparing its 2-gram profile to a baseline from the Tranco Top 1M list). For domains in the 99th percentile of a composite anomaly score based on these features, group by source device and domain, and calculate the standard deviation of inter-query arrival times. A low standard deviation (<10s) indicates periodic polling.",
              "Feed all non-allowlisted domains queried by mobile devices into a pre-trained DGA detection model (e.g., an LSTM-based classifier). For domains that receive a high DGA probability score (e.g., >0.90), correlate the query timestamps. For domains identified, correlate with outbound connections in `Zeek conn.log` to confirm the C2 channel is active. A periodic pattern of DNS queries for a high-probability DGA domain, followed by a connection, is a high-fidelity indicator of a scheduled callback for C2."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]