[
  {
    "information_requirement": "Is the adversary concealing captured multimedia files on mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.003",
        "name": "Conceal Multimedia Files",
        "evidence": [
          {
            "description": "The creation of a '.nomedia' file on an Android device by a process not on an established allowlist of system or media applications. The likelihood of maliciousness increases if the file is created in a directory path with a high Shannon entropy score (e.g., > 3.5), suggesting a randomly generated or obfuscated name, and the creating application was recently installed or is sideloaded.",
            "data_sources": [
              "Mobile EDR File System Auditing Logs",
              "Mobile MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of corporate-managed Android devices, specifically user-writable directories such as /storage/emulated/0/DCIM/, /storage/emulated/0/Pictures/, /storage/emulated/0/Download/, and application-specific data folders.",
            "action": [
              "Using Mobile EDR logs, create a rule to detect file creation events where 'file.name' is '.nomedia'. For each detection, extract the 'process.name' or 'process.id'. Cross-reference this process with an allowlist of known-good media and system applications (e.g., com.google.android.apps.photos, com.android.gallery3d, system_server) derived from MDM inventory. An event triggered by a process not on the allowlist generates a medium-severity alert.",
              "For each '.nomedia' creation alert, calculate the Shannon entropy of the 'file.directory' path string. Maintain a baseline distribution of directory path entropy scores across all managed Android devices. If a new event's entropy score exceeds the 98th percentile of this baseline distribution, or a hard threshold of 3.5, escalate the alert to high-severity. This indicates the file was likely placed in an obfuscated directory.",
              "Develop and deploy a Random Forest or Gradient Boosting classifier to score the risk of '.nomedia' creation events. Extract features from Mobile EDR and MDM logs, including: 'directory_path_entropy' (float), 'application_age_on_device_days' (integer), 'application_permission_count' (integer), 'is_sideloaded' (boolean from MDM), 'is_in_google_play_store' (boolean from MDM), and 'is_in_standard_media_path' (boolean, e.g., DCIM, Pictures). An event with a predicted probability of maliciousness > 0.90 should trigger a critical alert and automated device isolation pending investigation."
            ]
          },
          {
            "description": "A mobile device initiates an outbound network connection transferring a significant volume of data composed of multimedia MIME types (e.g., 'image/jpeg', 'video/mp4', 'image/png') to a destination domain not previously contacted by the device or to an IP address with a low reputation score. This activity suggests exfiltration of concealed files, especially if it follows a recent '.nomedia' creation event on the same device.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring traffic from mobile device subnets, including corporate Wi-Fi gateways, VPN concentrators, and Cloud Access Security Brokers (CASB).",
            "action": [
              "Continuously monitor Zeek logs. Correlate 'dns.log' and 'http.log' records from mobile subnets against a threat intelligence feed of known malicious domains. If a 'source_ip' communicates with a malicious domain, use the 'conn.uid' from that session to pivot to 'files.log'. Generate a critical alert if 'files.log' shows an associated file transfer where the 'mime_type' is a multimedia type (e.g., 'image/jpeg', 'video/mp4').",
              "For each mobile device IP ('id.orig_h'), establish a 30-day rolling baseline of unique destination domains ('dns.log' query field or 'http.log' host field) and typical outbound data volume ('conn.log' 'orig_bytes'). Generate a high-severity alert if a device sends more than 10MB of data in a single session where the MIME type is multimedia ('files.log') to a destination domain not seen in its 30-day baseline. The data volume threshold should exceed the 95th percentile of the device's typical outbound session size.",
              "Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) on the aggregated volume of outbound multimedia bytes (from 'files.log', filtered by 'mime_type') per device, per hour. If the observed volume is a significant outlier (e.g., > 3 standard deviations above the forecast mean), trigger an alert. Enrich this alert by applying a clustering algorithm (e.g., DBSCAN) to the connection features of the outlier traffic ('conn.log': 'duration', 'orig_pkts', 'resp_pkts', 'proto'). Connections that fall into a new or sparsely populated cluster indicate a behavioral anomaly, increasing confidence in malicious exfiltration."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]