[
  {
    "information_requirement": "Is an adversary attempting to remove their tools from a compromised mobile device to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.001",
        "name": "Uninstall Malicious Application",
        "evidence": [
          {
            "description": "A previously stable beaconing connection from a mobile device, identified by low variance in connection timing and size, abruptly ceases. This cessation is not correlated with a logged device power-off or network disconnect event in Mobile Device Management (MDM) logs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile Device Management (MDM) Device Status Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM/log aggregator, corporate Wi-Fi access points, VPN concentrators, and DNS resolvers servicing mobile devices.",
            "action": [
              "Create a SIEM rule to join Zeek conn.log data with a threat intelligence feed of known C2 servers. Alert when a mobile device's IP (`id.orig_h`) communicates with a destination IP (`id.resp_h`) on the C2 list, or when a DNS query in Zeek dns.log for a C2 domain is observed.",
              "For each source-destination IP pair in Zeek conn.log, calculate the coefficient of variation (CV) for connection interval and `orig_bytes` over a 24-hour window to identify beacons (e.g., CV < 0.2). For identified beacons, calculate the mean and standard deviation of the inter-arrival time. Alert if the time since the last beacon exceeds the mean plus 3 standard deviations, and no corresponding device-offline event exists in MDM logs for the same timeframe.",
              "Deploy a time series anomaly detection model (e.g., Prophet, LSTM) trained on historical `orig_bytes` and connection frequency from Zeek conn.log for each device's beaconing activity. The model should establish a forecast with a prediction interval. Generate a 'Beacon Cessation' alert if observed activity drops to zero and remains there, falling outside the 99.9% prediction interval for a sustained period, such as three times the expected beacon interval."
            ]
          },
          {
            "description": "An `ApplicationUninstalled` event appears in MDM logs for a device, but there is no corresponding, approved change ticket in the IT Service Management (ITSM) system for that device and application within a preceding 24-hour window.",
            "data_sources": [
              "MDM Platform Audit Logs",
              "IT Service Management (ITSM) System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud or on-premise servers hosting the MDM and ITSM platforms, and the centralized SIEM where their logs are aggregated.",
            "action": [
              "Create a SIEM rule that, upon detecting an `event_type='ApplicationUninstalled'` in MDM logs, executes an automated lookup via API or database query against the ITSM system. If the lookup returns no approved change request for the specific `device_id` and `application_name` within the last 24 hours, generate an 'Unauthorized Uninstall' alert.",
              "For each device, track the daily count of 'Unauthorized Uninstall' alerts. Calculate a 30-day rolling baseline (mean, standard deviation) for this count. Generate a 'Suspicious Uninstall Activity' alert if a device's daily count exceeds its baseline by 3 standard deviations (Z-score > 3).",
              "Train a supervised classification model (e.g., Random Forest) on historical uninstall events, labeled 'authorized' or 'unauthorized' via ITSM correlation. Features should include: application category, application install source (e.g., App Store, Sideloaded), time since installation, and time of day. Apply the model to new 'Unauthorized Uninstall' events and escalate to 'High-Confidence Malicious Uninstall' if the model's prediction probability for 'unauthorized' is > 0.95."
            ]
          },
          {
            "description": "Network traffic from a mobile device matches a known Indicator of Compromise (IOC) for a mobile rooting toolkit, and this event is followed within a 60-minute window by the cessation of a known C2 beacon from the same device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, corporate DNS resolvers, and the Threat Intelligence Platform (TIP) integrated with the SIEM.",
            "action": [
              "Create a SIEM correlation rule that looks for a sequence of events. The rule should trigger if an alert for a mobile device matching a rooting toolkit IOC (from an integrated threat feed) is followed within 60 minutes by a 'Beacon Cessation' alert for the same device `device_id` or `id.orig_h`.",
              "For all devices that trigger a rooting toolkit IOC alert, analyze the distribution of time delays until the next security alert of any type for that same device. If a 'Beacon Cessation' alert occurs and the time delay falls into the bottom 1st percentile of all observed inter-alert delays for that device class (e.g., iOS, Android), escalate the event to 'Critical', as this indicates a statistically rapid and suspicious sequence.",
              "Implement a sequence analysis model, such as a Hidden Markov Model (HMM), to analyze streams of security alerts per device. Define a 'Malicious Uninstall' state transition as `(Rooting_IOC_Alert -> Beacon_Cessation_Alert)`. Train the HMM on historical alert data. If a new sequence of alerts for a device results in a transition to this state with a probability exceeding a predetermined threshold (e.g., 0.90), generate a 'High-Confidence Malicious Uninstall Chain' alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]