[
  {
    "information_requirement": "Is an adversary maintaining command and control over a compromised mobile device via dynamic resolution? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637",
        "name": "Dynamic Resolution",
        "evidence": [
          {
            "description": "A DNS query from a mobile device is for a domain that exhibits characteristics of algorithmic generation, such as a Shannon entropy score exceeding the 98th percentile of a 30-day baseline and a character-level n-gram frequency that deviates significantly (e.g., >3 standard deviations) from the norm for legitimate domains.",
            "data_sources": [
              "Zeek dns.log",
              "Mobile Device Management (MDM) DNS logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and Mobile Device Management (MDM) platform logs.",
            "action": [
              "Continuously match the 'query' field in Zeek dns.log against a threat intelligence feed of known DGA domains. A direct match must trigger a high-priority alert for immediate investigation.",
              "From DHCP or VPN logs, identify IP ranges assigned to mobile devices. For each unique domain in Zeek dns.log queried by these IPs, calculate its Shannon entropy and the ratio of numerical to alphabetic characters. Compare these values against a 30-day rolling baseline for all domains. Flag any domain where both metrics exceed their respective 98th percentile thresholds.",
              "Train a random forest classifier using a labeled dataset (e.g., public DGA lists vs. a high-confidence allow list like the Tranco Top 1M) on features such as domain length, Shannon entropy, n-gram frequency, and vowel-to-consonant ratio. Apply the model to all DNS queries from mobile device IP ranges. Queries classified as 'DGA' with a model confidence score > 0.90 must be escalated for analyst review."
            ]
          },
          {
            "description": "A mobile device establishes a network connection to a domain that is both recently registered (e.g., within the last 30 days) and unpopular (e.g., not in a top 1 million domain list), and the connection pattern to that domain exhibits low data volume and highly periodic timing, characteristic of C2 beaconing.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "External WHOIS Data",
              "External Domain Prevalence Lists"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and external WHOIS services.",
            "action": [
              "For each domain in Zeek dns.log queried by a mobile device, enrich it with its resolved IP address. Query a threat intelligence platform API to check if the domain or IP is on a blocklist of known C2 infrastructure. An exact match must generate a critical-priority alert.",
              "For each unique domain from mobile IP ranges in Zeek dns.log, enrich it with its WHOIS registration date and Tranco rank. Calculate a risk score: $$ risk = (10 * is\\_new) + (5 * is\\_unpopular) $$, where $$ is\\_new=1 $$ if registered < 30 days ago and $$ is\\_unpopular=1 $$ if not in the top 1M. For source IPs in Zeek conn.log connecting to domains with $$ risk > 10 $$, analyze the connection patterns over 24 hours. Flag source IPs that exhibit both low total bytes transferred (e.g., < 20th percentile of all connections) and highly regular connection timing (e.g., standard deviation of inter-arrival times < 10th percentile of all source IPs).",
              "For traffic to high-risk domains identified by the statistical method, create a time series of connection events for each source IP. Apply an Autocorrelation Function (ACF) to the time series. A distinct, repeating peak in the ACF plot at a non-zero lag indicates periodic beaconing. Classify the connection as 'beaconing' and trigger an alert, including the detected interval (the lag)."
            ]
          },
          {
            "description": "A single domain name queried by a mobile device rapidly resolves to a large and diverse set of IP addresses (e.g., >10 unique IPs across >3 distinct ASNs in 60 minutes) with a low DNS Time-To-Live (TTL) value (e.g., <300 seconds), indicative of fast-flux DNS.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "External IP to ASN Database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and DNS resolution infrastructure.",
            "action": [
              "Create and maintain a rule to flag any DNS query from a mobile device IP range where the query string matches a watchlist of known dynamic DNS provider patterns (e.g., `*.ddns.net`, `*.no-ip.com`, `*.duckdns.org`). Generate a medium-priority alert for analyst review.",
              "In Zeek dns.log, group by domain name over a rolling 1-hour window. For each domain, count the unique resolved IP addresses (`id.resp_h`) and unique ASNs (enriched). Calculate the 99th percentile for both counts across all domains queried by mobile devices. Generate a high-priority alert for domains that simultaneously exceed both thresholds and have an average DNS TTL value below 300 seconds.",
              "For each mobile device IP, extract all outbound connection metadata from Zeek conn.log over a 15-minute window. Apply a density-based clustering algorithm (DBSCAN) using features like destination IP, destination port, and destination ASN. A single, large cluster identified by the algorithm containing connections to a high number of distinct IPs and ASNs indicates potential fast-flux activity. Trigger an alert for the source IP and the identified cluster of destination endpoints."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]