[
  {
    "information_requirement": "Is an adversary exfiltrating data from our mobile devices over unencrypted, non-C2 protocols? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1639.001",
        "name": "Exfiltration Over Unencrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "A series of DNS queries from a single mobile device IP to a single parent domain where the queries exhibit characteristics of DNS tunneling. These characteristics include: the query's subdomain is abnormally long (e.g., exceeds 100 characters), has high Shannon entropy (e.g., a score greater than 4.5), uses atypical record types such as TXT, CNAME, or NULL, and occurs at a sustained high frequency (e.g., more than 50 queries per minute to the same parent domain).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows DNS Server Analytic logs",
              "MDM/UEM Network Flow Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolver logs, VPN concentrators, corporate Wi-Fi access point logs, Mobile Device Management (MDM) platforms, Cloud Access Security Broker (CASB) logs.",
            "action": [
              "ACTION: Create a SIEM rule that generates a high-severity alert if a DNS query from a mobile device IP address range: (1) has a qtype_name of 'NULL' or 'TXT' and is not directed to an authorized service (e.g., for SPF/DKIM), OR (2) the query's parent domain matches a threat intelligence list of known DNS tunneling C2 domains.",
              "ACTION: 1. For each mobile device source IP, create a 30-day rolling baseline of DNS query behavior, including the 99th percentile of query length and the mean query rate per second-level domain. 2. In real-time, calculate the Shannon entropy and length of each DNS query's subdomain. 3. Generate a medium-severity alert if a query's length exceeds the 99th percentile for that device OR its entropy score is greater than 4.5. 4. Concurrently, if the query rate from a device to a single second-level domain exceeds 3 standard deviations above the baseline over a 1-minute window, generate another medium-severity alert. 5. Escalate to a high-severity incident if a single device triggers both a high-entropy/length alert and a high-frequency alert for the same domain within a 5-minute window.",
              "ACTION: 1. Train a Random Forest classifier model to score each DNS query with a probability of being malicious (0.0 to 1.0). 2. Engineer features for the model including: query length, subdomain Shannon entropy, ratio of numeric to alphabetic characters, query type (one-hot encoded), historical rarity of the parent domain across the enterprise, and the entropy of query types from the source IP over the last hour. 3. Deploy the model to score live DNS queries. Any query with a predicted probability greater than 0.9 should be flagged for analyst investigation. 4. As a supplementary control, deploy a SARIMA time-series model to forecast the expected volume of DNS TXT record queries per device. An observed volume that significantly exceeds the forecast's confidence interval indicates an anomaly worth investigating."
            ]
          },
          {
            "description": "One or more outbound HTTP POST or PUT requests from a mobile device to a single host, characterized by: an anomalously large request body size (e.g., a single request > 5MB or cumulative transfer > 20MB in 5 minutes), high Shannon entropy of the request body (e.g., > 4.2), a non-standard User-Agent for a mobile app (e.g., 'curl/7.68.0', 'python-requests/2.25.1'), a generic 'Content-Type' header (e.g., 'application/octet-stream') directed to a non-API endpoint, or a destination host that is a low-reputation or newly registered domain (e.g., registered < 30 days ago).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek files.log",
              "MDM/UEM Network Flow Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, API Gateways, web proxy logs, MDM/UEM logs with network activity, and Cloud Access Security Broker (CASB) logs.",
            "action": [
              "ACTION: Create a SIEM rule to generate a high-severity alert for any HTTP POST or PUT request from a mobile device IP where: (1) the destination 'host' or IP matches a threat intelligence feed of known malicious C2 or exfiltration nodes, (2) the domain registration age is less than 30 days, OR (3) the 'user_agent' field contains substrings indicative of command-line tools (e.g., 'curl', 'wget', 'python-requests') which are highly anomalous for typical mobile application traffic.",
              "ACTION: 1. For each mobile device (source IP), establish a 30-day rolling baseline for outbound HTTP traffic, including the 99th percentile of POST/PUT request body sizes ('post_body_len' in Zeek http.log) and the mean POST-to-GET request ratio per destination. 2. Generate a medium-severity alert if a single POST/PUT request's size exceeds the device's 99th percentile or a hard threshold of 5MB. 3. If an alert is generated, automatically calculate the Shannon entropy of the request body (using Zeek files.log or packet capture). An entropy score > 4.2 should escalate the alert. 4. Additionally, alert if the POST-to-GET ratio for a given destination domain exceeds 3 standard deviations from the device's baseline.",
              "ACTION: 1. Deploy an Isolation Forest model to identify anomalous HTTP requests from mobile devices. 2. Engineer features for each request including: 'post_body_len', destination IP rarity, request body Shannon entropy, rarity of the 'user_agent' string, rarity of the 'Content-Type' header, and the POST-to-GET request ratio for the destination. 3. Requests flagged as outliers by the model require immediate analyst review. 4. Complement this with an LSTM autoencoder model monitoring the time-series of total outbound data volume per user. A high reconstruction error from the LSTM model indicates a sudden deviation from the user's normal data transfer patterns."
            ]
          },
          {
            "description": "An outbound FTP connection (destination port 21/TCP) initiated from an IP address associated with a corporate mobile device. The presence of any FTP traffic from a mobile device is highly suspicious. The suspicion is critically elevated if the session involves file upload commands ('STOR', 'APPE'), transfers a large volume of data (e.g., > 10MB), or the device does not have an approved FTP client application installed per MDM/UEM policy.",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek conn.log",
              "MDM/UEM Network Flow Logs",
              "MDM/UEM Application Inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, network firewalls, VPN concentrators, corporate Wi-Fi access points, and DMZ network segments.",
            "action": [
              "ACTION: Implement a zero-tolerance SIEM rule to generate a critical alert for any entry in Zeek conn.log where 'id.orig_h' is in the mobile device IP range and 'id.resp_p' is 21. If Zeek ftp.log is available, escalate the alert if the 'command' field is 'STOR' or 'APPE'. Correlate the source device with MDM application inventory to verify if an authorized FTP client is installed; if not, treat as confirmed malicious activity.",
              "ACTION: Upon a symbolic FTP alert, immediately analyze the session's data volume ('orig_bytes' + 'resp_bytes' from Zeek conn.log). Escalate the alert's priority to the highest level if: (1) the total volume exceeds a hard threshold of 10MB, OR (2) the volume exceeds the 99.9th percentile of all network sessions for that device over the last 30 days. The first-ever recorded use of FTP from a device also serves as a definitive escalating factor.",
              "ACTION: 1. Use K-Means clustering to perform behavioral peer group analysis on mobile devices. 2. For each device, create a daily feature vector including: a binary flag for FTP usage (1 if used, 0 if not), count of distinct protocols used, entropy of destination ports, average daily outbound bytes, and total number of network sessions. 3. A device that falls into a small cluster (a micro-cluster) or a cluster whose centroid is defined by FTP usage should be flagged as a high-confidence anomaly requiring immediate investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]