[
  {
    "information_requirement": "Is the adversary collecting and exfiltrating sensitive data from corporate mobile devices via SMS message access? (TA0035 - Collection)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1636.004",
        "name": "SMS Messages",
        "evidence": [
          {
            "description": "A corporate mobile device, with an application possessing `android.permission.READ_SMS` confirmed via MDM logs, establishes a network connection and transfers data to an external destination that is either on a threat intelligence list, has a low reputation score, or is anomalous compared to the device's or organization's baseline of outbound traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Mobile Device Management (MDM) logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network egress points, VPN concentrators, and the Mobile Device Management (MDM) platform.",
            "action": [
              "Query Zeek dns.log for DNS requests from the mobile device DHCP range to domains on a known-malicious C2 threat intelligence feed. For any match, pivot to Zeek conn.log using the source IP and timestamp to verify a connection was established and inspect the `orig_bytes` and `resp_bytes` fields to confirm data transfer.",
              "For each mobile device IP, establish a 30-day rolling baseline of outbound data volume (`orig_bytes` in conn.log), destination countries, and destination ASNs. Alert when a device's hourly outbound data volume exceeds the 95th percentile of its own baseline AND the destination country/ASN is rare (<5% frequency) for that device.",
              "Implement a time-series anomaly detection model (e.g., LSTM Autoencoder) for each device's outbound network traffic volume. Use features like bytes sent, packet count, connection duration, destination port, and protocol from Zeek conn.log. Augment with categorical features like the destination domain's TLD from dns.log and the JA3/JA3S hash from ssl.log. An alert is generated when the reconstruction error of the model surpasses a dynamically calculated threshold, indicating a deviation from learned normal behavior."
            ]
          },
          {
            "description": "On a Windows host, a process associated with mobile device synchronization (e.g., 'Your Phone', 'iTunes') spawns a child process that performs file manipulation or network communication inconsistent with normal syncing operations. This is evidence of the workstation being used as a staging point for data collected from the mobile device.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee workstations with mobile device syncing software installed and the centralized log aggregator/SIEM.",
            "action": [
              "Create a detection rule to search for process creation events (Windows Event ID 4688) where a parent process name matches known mobile sync tools (e.g., 'PhoneExperienceHost.exe', 'iTunesHelper.exe') and the child process is a utility capable of network connections or encoding (e.g., 'powershell.exe', 'certutil.exe', 'bitsadmin.exe', 'curl.exe'). Trigger on specific command-line arguments such as '-encode', '-f', 'transfer', or URI/IP address patterns.",
              "For each parent process associated with mobile sync tools, profile the frequency of its child processes and command-line arguments over a 30-day period. Calculate a rarity score for each parent-child-argument combination. Generate an alert for any execution with a score in the top 99th percentile, indicating a statistically rare and potentially malicious process chain.",
              "Train a supervised classification model (e.g., Gradient Boosting) using labeled data from Windows Event ID 4688 and 4104. Extract features such as: parent/child process names, command-line length, command-line entropy, presence of IP addresses or encoded strings in arguments, and n-grams from PowerShell script blocks. The model will classify each process execution chain originating from a sync tool as 'benign sync activity' or 'potential data staging,' providing a risk score for prioritization."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.1",
    "date_created": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]