[
  {
    "information_requirement": "Has an adversary exfiltrated data from a corporate mobile device by using a non-standard or alternative network protocol? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1639",
        "name": "Exfiltration Over Alternative Protocol",
        "evidence": [
          {
            "description": "A mobile device initiates an outbound connection using a protocol (e.g., FTP, IRC, SMB) not present in its 30-day baseline, or the total outbound data ('orig_bytes') in a single connection surpasses the 99th percentile for that protocol across the entire mobile device fleet.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, guest networks, VPN concentrators, cloud proxies, and Mobile Device Management (MDM) platform logs.",
            "action": [
              "From Zeek conn.log, inspect connections from the mobile device IP address space. Alert if the destination IP or port is found on a threat intelligence feed of known command-and-control (C2) servers or services associated with data exfiltration.",
              "For each mobile device, profile the set of protocols used over a 30-day rolling window from Zeek conn.log. Alert if a device uses a protocol not in its historical baseline. Concurrently, compute the 99th percentile of outbound bytes ('orig_bytes') per protocol across all mobile devices. Alert if any single connection from a mobile device exceeds this statistical threshold for its given protocol.",
              "From Zeek conn.log, generate a feature set for each connection including protocol, destination port, duration, 'orig_bytes', and 'resp_bytes'. Apply a trained Isolation Forest model to all mobile device traffic to detect anomalous connections. Investigate any connection flagged as an outlier by the model, correlating with user and device context."
            ]
          },
          {
            "description": "A mobile device's DNS traffic shows signs of data tunneling, evidenced by a query rate exceeding 3 standard deviations from its baseline, a query name Shannon entropy score above 4.5, an unusually high ratio of TXT or NULL requests, or queries to domains with a prevalence below the 1st percentile across the mobile fleet.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, network egress points, Cloud Access Security Broker (CASB) logs, and Mobile Device Management (MDM) platform logs.",
            "action": [
              "Continuously scan the 'query' field in Zeek dns.log for requests originating from mobile devices. Generate a high-priority alert if a query matches a domain on a blocklist of known malicious or dynamic DNS providers frequently used for tunneling.",
              "For each mobile device, establish a 30-day rolling baseline from Zeek dns.log for: daily query volume, average query name length, and average Shannon entropy of the query name. Alert if any daily metric deviates by more than 3 standard deviations from the device's baseline. Additionally, calculate the ratio of TXT/NULL requests to total requests per device and flag any device where this ratio exceeds the 95th percentile for the mobile fleet.",
              "Train a Random Forest classifier using features extracted from Zeek dns.log (e.g., query length, subdomain count, Shannon entropy, presence of hexadecimal characters, n-gram frequency) on a labeled dataset of benign and malicious DNS tunneling traffic. Apply the model in real-time to mobile device DNS traffic, flagging any query with a 'malicious' probability score greater than 0.85 for immediate analyst review."
            ]
          },
          {
            "description": "A mobile device transmits an HTTP/S POST request with a data payload size ('orig_bytes') exceeding the 99th percentile for the mobile fleet, or exhibits periodic 'heartbeat' connections to a non-corporate or newly registered domain (NRD) characterized by a low standard deviation of inter-arrival times.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, internet gateways, VPN concentrators with SSL/TLS inspection capabilities, mobile application security gateways, and Cloud Access Security Broker (CASB) platforms.",
            "action": [
              "Join Zeek http.log ('host' field) and ssl.log ('server_name' field) with Zeek conn.log on the connection UID. Correlate the destination host or server name against threat intelligence feeds for known malicious domains and newly registered domains (NRDs). Trigger a high-severity alert for any POST request to a matched domain where the connection's 'orig_bytes' exceeds 500KB.",
              "From Zeek conn.log for traffic on TCP ports 80 and 443, calculate the 99th percentile of outbound bytes ('orig_bytes') across all mobile devices. Alert on any single connection from a mobile device that exceeds this threshold. Separately, for each unique mobile device-to-destination pair, calculate the standard deviation of time deltas between connections. Flag pairs with a low standard deviation (< 2.0 seconds) and a high frequency (>10 connections per hour) as potential C2 beaconing.",
              "Extract JA3/JA3S hashes from Zeek ssl.log and User-Agent strings from Zeek http.log to create client fingerprints. Use a K-Means clustering algorithm to group fingerprints from known-good, sanctioned applications. Flag any traffic associated with a client fingerprint that falls into a small or new cluster (i.e., an outlier), especially when correlated with large POST requests or connections to low-prevalence domains."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]