[
  {
    "information_requirement": "Has an adversary achieved persistence by modifying a client software binary on a mobile device? (PIR)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1645",
        "name": "Compromise Client Software Binary",
        "evidence": [
          {
            "description": "A managed mobile device fails a remote integrity check, evidenced by a log from an attestation service containing a definitive failure verdict. For Google Play Integrity, this is a response where the `deviceIntegrity` verdict does not include `MEETS_DEVICE_INTEGRITY` or `MEETS_STRONG_INTEGRITY` [1]. For a comparable service like Samsung Knox Attestation, a failed result cryptographically confirms that the device's bootloader or system partition has been modified from the factory state.",
            "data_sources": [
              "Mobile Device Management (MDM) logs",
              "Google Play Integrity API logs",
              "Samsung Knox Attestation logs",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet, Mobile Device Management (MDM) Platform, cloud-based attestation service endpoints (e.g., Google Cloud Platform, Samsung Knox services), and network egress points.",
            "action": [
              "Create a real-time SIEM rule that generates a high-severity alert upon ingesting any attestation log where the Google Play Integrity `deviceIntegrity` verdict is not `MEETS_DEVICE_INTEGRITY` or `MEETS_STRONG_INTEGRITY`, or a comparable failure status is received from another attestation provider.",
              "Execute a scheduled query every 4 hours to calculate the attestation failure rate, defined as (failed checks / total checks), segmented by device model, OS version, and geographic region. Generate a medium-severity alert if the failure rate for any segment exceeds the 99th percentile of its 30-day historical baseline, indicating a potential targeted or model-specific issue.",
              "Upon a high-severity attestation failure alert, trigger a SOAR playbook to immediately query all network connection logs (Zeek conn.log, ssl.log) from the failed device for the preceding 72 hours. Use a pre-trained gradient boosting classifier to score each destination FQDN/IP based on features including domain entropy, SSL certificate issuer rarity, JA3/JA3S hash prevalence, and threat intelligence reputation. Escalate the incident to critical if the device communicated with any destination having a model score greater than 0.9."
            ]
          },
          {
            "description": "A mobile device exhibits anomalous network behavior, observed in network sensor logs. Specific, measurable artifacts include: 1) Outbound connections from the device to an IP address (`id.resp_h` in Zeek conn.log) or domain (`server_name` in Zeek ssl.log) present on a threat intelligence list of known C2 servers. 2) DNS queries (`query` in Zeek dns.log) for domains with a Shannon entropy score greater than 4.5, indicative of Domain Generation Algorithms (DGA). 3) A sustained data transfer ratio where outbound bytes (`orig_bytes`) significantly exceed inbound bytes (`resp_bytes`) by more than 10:1 in Zeek conn.log for connections over 60 seconds.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN terminators, and Cloud Access Security Brokers (CASB).",
            "action": [
              "Implement a SIEM detection rule to continuously match the `id.resp_h` field from Zeek conn.log and the `server_name` field from Zeek ssl.log against a high-fidelity threat intelligence feed of known C2 infrastructure. Generate a high-severity alert on any match.",
              "For each DNS request in Zeek dns.log, calculate the Shannon entropy of the queried domain. Generate a medium-severity alert for any device that issues a query with an entropy score exceeding the 98th percentile of the mobile device fleet's 30-day baseline. Also, monitor `orig_bytes` and `resp_bytes` in Zeek conn.log to alert on connections where the outbound-to-inbound ratio is greater than 10:1 and `duration` is over 60 seconds.",
              "For each unique mobile device, train an isolation forest model on a feature set derived from its typical network behavior over a 30-day period. Features must include daily outbound data volume, count of unique destination IPs, distribution of destination ports, and average connection duration from Zeek conn.log. Score daily activity against the model; an anomaly score indicating an outlier should generate a medium-severity alert for analyst review."
            ]
          },
          {
            "description": "A statistically significant increase in the crash rate for a legitimate, high-privilege system application (e.g., `com.android.settings`) or a managed corporate application on a device, suggesting instability caused by unauthorized modification of its binary. Evidence is found in MDM or crash reporting logs where a device's reported crash count for a monitored application exceeds its historical norm, or the fleet-wide crash count for an application version exceeds forecasted trends.",
            "data_sources": [
              "Mobile Device Management (MDM) logs",
              "Mobile Application Management (MAM) logs",
              "Application crash reporting logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized MDM/MAM platform and cloud-based application performance monitoring (APM) or crash reporting services.",
            "action": [
              "Configure a high-severity alert in the MDM or application monitoring platform to trigger immediately if any crash is reported for a critical, allow-listed system application (e.g., `com.android.settings`, `com.android.phone`) on any managed device, as these should exhibit extreme stability.",
              "On a daily basis, query crash logs to calculate the crash rate (crashes per 1000 sessions) for each managed corporate application, segmented by app version and device model. Generate a medium-severity alert if an individual device's crash rate for a specific app exceeds the 99.5th percentile of the fleet's 30-day historical baseline for that same app and version.",
              "Implement a time series anomaly detection model (e.g., ARIMA) to forecast the expected daily crash count for critical applications across the entire device fleet. Generate a medium-severity alert when the actual observed crash count significantly exceeds the model's forecasted upper confidence interval, which could signify a widespread issue from a compromised binary distributed via an update."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]