[
  {
    "information_requirement": "Is the adversary attempting to disrupt mobile device operations by destroying data? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1662",
        "name": "Data Destruction",
        "evidence": [
          {
            "description": "A mobile device executes a high volume of file deletion (`rm`) or application uninstallation (`pm uninstall`) commands within a short time window, especially when initiated by a non-standard user process or outside of typical administrative activity.",
            "data_sources": [
              "MDM/EDR agent logs detailing command-line arguments",
              "Android Logcat process execution events",
              "iOS Endpoint Security Framework process events"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (corporate-owned or BYOD), Mobile Device Management (MDM) servers, and SIEM systems where logs are aggregated.",
            "action": [
              "Create a detection rule to alert on the exact string match for `pm uninstall` or `rm -rf` in command-line logs, particularly when the parent process is a shell spawned by a non-interactive application or a user with recently escalated privileges.",
              "For each managed mobile device, query command-line logs over the last 30 days to establish a baseline count of `pm uninstall` and `rm` commands per hour. Trigger an alert if the count in any given hour exceeds the 99th percentile of the device's individual baseline or a global baseline for similar devices.",
              "Develop and deploy a one-class SVM or Isolation Forest model trained on features from mobile device command execution logs. Features should include: command name entropy, command argument length, frequency of deletion-related commands (`rm`, `pm uninstall`), and the time of day. The model should classify sequences of command-line activity as anomalous, flagging bursts of destructive commands that deviate from the user's established behavioral profile."
            ]
          },
          {
            "description": "A mobile device exhibits a sudden cessation of all network activity, or a burst of unusual network traffic (e.g., to a new or rare domain), immediately following a high-volume file deletion or application uninstallation event on the host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring mobile device traffic (e.g., corporate Wi-Fi, VPN gateway), DNS resolvers, and network sensor grids.",
            "action": [
              "Upon receiving a host-based alert for potential data destruction (T1662), automatically query Zeek conn.log and dns.log for any network connections from the affected device's IP address within a 5-minute window of the alert. Alert if the destination IP or domain matches a threat intelligence feed of known C2 servers.",
              "For each mobile device, calculate a moving average of DNS query Shannon entropy over 1-hour windows using Zeek dns.log. Trigger an alert if the entropy for a device exceeds 3 standard deviations above its 30-day baseline, as a sudden spike can indicate DGA activity used for C2 before or after an attack.",
              "Implement a time-series anomaly detection model (e.g., ARIMA or Prophet) on the total bytes sent/received per device, aggregated into 5-minute intervals from Zeek conn.log. Train the model to predict the expected network 'heartbeat' for each device. Generate an alert when a device's actual traffic volume drops to near-zero and stays there, significantly deviating from the predicted forecast, especially if this follows a host-based alert for destructive commands. This pattern suggests the device was wiped and taken offline."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.1",
    "date_created": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]