[
  {
    "information_requirement": "Is an adversary using virtualization or application cloning on managed mobile devices to evade defenses or conceal malicious activity? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1670",
        "name": "Virtualization Solution",
        "evidence": [
          {
            "description": "An installed application's package name, recorded in MDM inventory logs, matches an entry on a watchlist of known virtualization frameworks and is not on the corporate allowlist.",
            "data_sources": [
              "MDM Application Inventory Log",
              "Android Logcat",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile device fleet, Mobile Device Management (MDM) servers, SIEM, Threat Intelligence Platform (TIP)",
            "action": [
              "Continuously compare the 'package_name' field from MDM application inventory logs against a curated watchlist of package names associated with Android virtualization tools, sourced from threat intelligence. Trigger a high-severity alert for any match on a device where the application is not present on the corporate allowlist.",
              "For each application package name in MDM inventory logs not on the corporate allowlist, calculate its prevalence across the mobile device fleet. Flag applications installed on fewer than a threshold number of devices (e.g., <1% of the fleet or <5 devices) as rare. Generate a medium-severity alert for rare applications to investigate their purpose and legitimacy.",
              "Develop and deploy a supervised classification model (e.g., Random Forest) to predict if an unlisted application is a virtualization tool. Use features extracted from application manifests, such as the number and type of permissions requested (e.g., 'SYSTEM_ALERT_WINDOW', 'GET_TASKS'), the Shannon entropy of the package name, and the presence of keywords like 'virtual' or 'clone' in app metadata. Generate a medium-severity alert for any application with a prediction probability exceeding a defined threshold (e.g., >0.85)."
            ]
          },
          {
            "description": "Network traffic metrics (e.g., data volume, connection count, DNS query entropy) from a mobile device's IP address are statistically anomalous compared to the established baseline for the application reported by MDM to be in the foreground, indicating potential process hijacking.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "MDM Application Usage Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi and VPN gateways, Enterprise DNS resolvers, MDM servers, SIEM",
            "action": [
              "Correlate Zeek conn.log records with a threat intelligence feed of known command-and-control (C2) IP addresses and domains. If a mobile device IP communicates with a known C2 indicator, query MDM application usage logs for the corresponding timestamp. If the reported foreground application is a trusted business or personal app, generate a high-severity alert for suspected malicious background activity.",
              "For each unique device-application pair, establish a multi-metric baseline from Zeek logs (conn.log, dns.log) by calculating the mean and standard deviation of bytes transferred, connection counts, and DNS query entropy using the formula $$ H(X) = -\\sum_{i=1}^{n} p(x_i) \\log_2 p(x_i) $$ per 15-minute interval. Generate a medium-severity alert when the active foreground application's associated network activity has two or more metrics that exceed 3 standard deviations from their historical baseline.",
              "Train a time-series anomaly detection model, such as an LSTM autoencoder, on feature vectors aggregated from Zeek logs for each mobile device. Features should include total bytes transferred, count of unique destination IPs, and average connection duration per 5-minute window. A high reconstruction error indicates anomalous network behavior. Correlate the timestamp of the anomaly with MDM application usage data; if a trusted application was in the foreground, escalate with a medium-severity alert for analyst review."
            ]
          },
          {
            "description": "A network connection from a managed mobile device, recorded in Zeek logs, contains an IP address, domain, or TLS fingerprint (JA3/JA3S hash) that matches an indicator on a threat intelligence feed for malware known to use virtualization.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, Web proxies, DNS resolvers, Threat Intelligence Platform (TIP), SIEM",
            "action": [
              "Implement a real-time detection rule that matches all outbound mobile device traffic from Zeek logs (conn.log, dns.log, ssl.log) against a high-fidelity threat intelligence feed of IOCs (domains, IPs, JA3/JA3S hashes) specifically attributed to malware leveraging virtualization. Any match generates an immediate high-severity alert.",
              "From Zeek dns.log, calculate the fleet-wide request frequency for all domains queried by mobile devices over the last 30 days. For any DNS query to a domain in the bottom 1st percentile (rare domain), perform an automated enrichment lookup against an external reputation service. If a mobile device connects to a rare domain with a malicious or suspicious reputation, generate a medium-severity alert.",
              "Apply a pre-trained Domain Generation Algorithm (DGA) detection model to score all domains requested by mobile devices in Zeek dns.log. The model should analyze features like domain name entropy, n-gram frequencies, and name length. A domain receiving a high DGA probability score (e.g., >0.90), especially if it is newly observed, triggers a medium-severity alert for potential C2 communication."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]