[
    {
        "information_requirement": "Has the adversary attempted to collect credentials by dumping /etc/passwd or /etc/shadow?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1003.008",
                "name": "/etc/passwd and /etc/shadow",
                "evidence": [
                    {
                        "description": "Network connections from a Linux host involving IP addresses, domains, or file hashes known to be associated with credential dumping tool distribution or exfiltration C2 infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate network logs against high-confidence cyber threat intelligence (CTI) feeds. Inner join Zeek conn.log source/destination IPs and Zeek dns.log queried domains with lists of known malicious indicators. Check file hashes from Zeek files.log against malware hash repositories for known credential theft tools. Alert on any confirmed matches."
                    },
                    {
                        "description": "Execution of specific commands or command-line patterns known to be used for accessing, combining, or processing /etc/passwd and /etc/shadow files on a host.",
                        "data_sources": [
                            "AuditD logs"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Configure AuditD to log all process execution (execve syscall) events with full command line arguments. Monitor logs for exact command strings (e.g., 'cat /etc/shadow', 'unshadow /etc/passwd /etc/shadow') or regular expression patterns indicating file access or processing (e.g., '.*(cat|head|tail|less|more|grep).*(\\/etc\\/passwd|\\/etc\\/shadow).*'). Flag all matching command executions and correlate them with subsequent suspicious network or file creation events."
                    },
                    {
                        "description": "Outbound network data containing content patterns that explicitly match the structure of /etc/passwd or /etc/shadow files, indicating direct exfiltration of file contents.",
                        "data_sources": [
                            "Zeek files.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Deploy content inspection rules (e.g., via Zeek scripts or IDS signatures) on outbound network traffic from Linux servers. Scan traffic for regular expression patterns highly specific to these files, such as `\\broot:[x*]:0:0:` for /etc/passwd or hash formats like `\\$[156]\\$[a-zA-Z0-9./]+\\$[a-zA-Z0-9./]+` for /etc/shadow. Alert on high-confidence matches and capture associated session data for investigation."
                    },
                    {
                        "description": "Anomalous access to /etc/passwd or /etc/shadow files by unexpected processes, non-root users, or with unusual frequency, deviating from an established baseline of normal system activity.",
                        "data_sources": [
                            "AuditD logs"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal access patterns (processes, users, frequency) for /etc/passwd and /etc/shadow on production systems. Configure AuditD to log all read/open syscalls on these files. Alert immediately on any access by non-root users or by processes not on an approved allowlist (e.g., common system processes like sshd, login, crond). Use time series analysis or descriptive statistics (e.g., IQR on access counts per hour per host) to detect and alert on abnormal frequencies of access from any source."
                    },
                    {
                        "description": "Outbound network traffic from a Linux host that is anomalous in terms of size, entropy, or destination, occurring shortly after a suspicious access to /etc/passwd or /etc/shadow was logged on the same host.",
                        "data_sources": [
                            "AuditD logs",
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlated analytic that triggers when a suspicious access to /etc/passwd or /etc/shadow (from the 'Anomalous File Access' detection) is logged by AuditD. Within a short time window (e.g., 5 minutes), search for any outbound network connections (Zeek conn.log) or file transfers (Zeek files.log) from the source host's IP address. Analyze these network events for anomalous characteristics: connections to a low-reputation or newly-seen IP, file sizes consistent with password files (typically small, <1MB), or high data entropy. Use correlation analysis to definitively link the host-based file access to the suspicious network exfiltration attempt."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
