[
    {
        "information_requirement": "Is the adversary using rootkits to evade defenses?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1014",
                "name": "Rootkit",
                "evidence": [
                    {
                        "description": "Network connections from internal hosts to external IP addresses or domains known to be Command and Control (C2) infrastructure for specific rootkits.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate destination IP addresses and resolved domain names from Zeek conn.log and Zeek dns.log against a continuously updated Cyber Threat Intelligence (CTI) feed of known rootkit C2 infrastructure. Alert on any confirmed matches. Use descriptive statistics to track the frequency of alerts per CTI source or identified rootkit family to assess campaign scope."
                    },
                    {
                        "description": "Installation of unsigned drivers, drivers signed with non-standard or revoked certificates, or drivers/services with names, descriptions, or paths commonly associated with known rootkit families.",
                        "data_sources": [
                            "Windows Event Log (System)",
                            "Windows Event ID 7045"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows System Event Log (specifically CodeIntegrity events like 3033, 3063, 3077 for unsigned/improperly signed drivers) for driver loading events. Monitor Windows Event ID 7045 for newly installed services. Analyze driver/service names, descriptions, and executable paths against a maintained list of patterns known to be used by rootkits (e.g., randomly generated names, names mimicking legitimate system files but in incorrect locations, common generic rootkit filenames). Calculate the frequency of unsigned driver loads or suspicious service installations and investigate deviations from baseline."
                    },
                    {
                        "description": "Processes created with command-line arguments or exhibiting characteristics indicative of rootkit installers or droppers, such as silent installation flags or attempts to directly load kernel modules.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4688 (Process Creation) logs for command lines containing suspicious arguments frequently used by malware installers (e.g., `/silent`, `/install`, `/load`, specific parameters for tools like `sc.exe` or `PnPUtil.exe` used to install drivers/services without user interaction, or direct invocation of kernel module loading utilities). Correlate processes launching these commands with prior downloads or executions from untrusted sources. Use regular expressions to search for known malicious command patterns and track the frequency of such patterns. Employ correlation analysis to link these process events with subsequent anomalous system behaviors."
                    },
                    {
                        "description": "Anomalous system behavior such as unexpected new services running with high privileges, processes lacking parent processes (orphaned), or processes exhibiting persistent network communications to unusual external destinations that cannot be attributed to legitimate applications.",
                        "data_sources": [
                            "Windows Event ID 7045",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for newly installed services (Windows Event ID 7045) with high privileges (e.g., LocalSystem) and unusual executable paths or empty descriptions. Identify processes (Windows Event ID 4688) created without a parent process or with a non-standard parent (e.g., a critical system process appearing to spawn from an Office application). Correlate these host-based indicators with unexplained persistent network traffic (Zeek conn.log) to external destinations, particularly if low-volume and regularly timed (beaconing). Use time series analysis on Zeek conn.log data (e.g., connection counts, data volume per host) to spot anomalous communication patterns. A combination of suspicious host behaviors and unattributed network traffic warrants deeper rootkit investigation."
                    },
                    {
                        "description": "Execution of tools or commands known to modify critical boot components (Master Boot Record - MBR, Volume Boot Record - VBR, bootloader) or direct raw disk access attempts from unexpected user-mode processes.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) for the execution of utilities that can write to MBR/VBR or perform raw disk access (e.g., `dd`, `bootsect.exe` if not part of legitimate OS repair activity, `fdisk`, or custom tools whose names might be captured by process auditing). Flag executions of such tools, especially if originating from user-mode processes, temporary directories, or suspicious parent processes. Analyze command-line arguments for target disk identifiers (e.g., `\\\\.\\PhysicalDrive0`). Establish a baseline of legitimate low-level disk access and alert on deviations. Correlate such events with other suspicious activities like unauthorized downloads or user-initiated executions from phishing emails."
                    },
                    {
                        "description": "Unexplained crashes or instability in system applications or the OS itself, or unexpected termination or modification of security software, potentially due to poorly implemented API hooking or kernel modifications by a rootkit.",
                        "data_sources": [
                            "Windows Event Log (System)",
                            "Windows Event Log (Application)"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor System and Application event logs for an unusual increase in application crashes (e.g., Windows Event ID 1000, 1001), service termination errors (e.g., Windows Event ID 7031, 7034 for unexpected service stops), or BugChecks (system crashes). Correlate an uptick in such events, especially concerning security tools (AV, EDR), critical OS processes, or frequently used applications, with other potential indicators of compromise. Use time series analysis on error/crash event counts to detect anomalous spikes. Descriptive statistics on failing module names or faulting application paths can highlight frequently crashing components that might be targeted or destabilized by rootkit activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
