[
    {
        "information_requirement": "Has the adversary moved laterally within the network using VNC?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1021.005",
                "name": "VNC",
                "evidence": [
                    {
                        "description": "VNC connections involving internal IP addresses known to be associated with prior suspicious activity or compromised hosts, or use of VNC client/server executables with known malicious file hashes.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate source and destination IP addresses in VNC connections (identified via Zeek conn.log monitoring ports 5900-5906 and 5800-5806) against an internal, curated list of IP addresses/hostnames previously flagged for suspicious behavior or confirmed compromise. Additionally, monitor Windows Event ID 4688 for VNC-related process creation (e.g., vncviewer.exe, winvnc.exe, x11vnc, TightVNC, RealVNC variants, screensharingd) and compare the file hashes of these executables against a threat intelligence feed of known malicious VNC tool variants or unauthorized VNC software. Alert on any confirmed matches."
                    },
                    {
                        "description": "Use of VNC client or server processes with non-standard names, executed from unusual file paths (e.g., temporary directories, user profiles), or launched with suspicious command-line arguments indicative of covert VNC tools or malicious configurations.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) for VNC-related processes. Establish a baseline of legitimate VNC client/server process names (e.g., vncviewer.exe, winvnc.exe, vino-server, screensharingd) and their standard installation/execution paths. Alert on VNC processes with names deviating significantly from this baseline (e.g., misspelled, generic like 'svchost.exe' but exhibiting VNC network behavior), execution from atypical locations (e.g., %TEMP%, %APPDATA%, Downloads folder unless part of a standard portable tool policy), or launched with command-line arguments often associated with malicious use (e.g., arguments to run hidden, listen on non-standard ports, connect to specific external relays, or use hardcoded/weak credentials). Maintain and update a list of such suspicious patterns and process characteristics through regular threat hunting and review of VNC tool documentation."
                    },
                    {
                        "description": "Anomalous VNC connections between internal hosts, characterized by deviations from established baselines such as connections involving unusual user accounts (e.g., service accounts, default/test credentials), occurring at atypical times or with unusual frequency, targeting non-standard systems for VNC, or involving critical assets without explicit authorization.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624",
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for network traffic on standard VNC ports (5900-5906, 5800-5806) between internal hosts. Correlate with Windows Event ID 4624 (successful logon) and 4625 (failed logon) if VNC instances are configured to use system authentication. Establish baselines for legitimate VNC usage: typical source/destination host pairings, user accounts involved in initiating/receiving VNC, time-of-day/day-of-week patterns, and systems/segments whitelisted for VNC access. Employ statistical methods (e.g., frequency analysis of host pairs, Inter-Quartile Range (IQR) for connection counts, entropy measures for user-host pairings over time) to detect significant deviations. Investigate VNC sessions initiated by or targeting service accounts, default/test accounts, administrative accounts on non-administrative workstations, or connections involving critical servers/segments not explicitly whitelisted for VNC access. Use time series analysis to detect unusual spikes in VNC activity."
                    },
                    {
                        "description": "A high volume of failed VNC connection or authentication attempts from an internal source host to one or more destination hosts, potentially followed by a successful VNC connection, indicating VNC-specific brute-force or credential spraying attempts.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4625",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for patterns indicative of VNC brute-force: numerous short-lived TCP connections or TCP resets on VNC ports (5900-590X, 5800-580X) from a single source IP to one or multiple destination IPs within a condensed timeframe. If VNC uses system authentication, correlate these network attempts with bursts of Windows Event ID 4625 (Account Failed to Log On) on target hosts, originating from the suspected source IP. Implement threshold-based alerts (e.g., >10 failed VNC handshakes or >20 Event ID 4625 from one source to one destination within 5 minutes). Flag any subsequent successful VNC connection (identified by a longer, established TCP session in Zeek conn.log, or a corresponding Windows Event ID 4624) from a source IP that previously exhibited high failure rates. Use box-plots on failed attempt counts per source to identify outliers."
                    },
                    {
                        "description": "Execution of suspicious commands, access to sensitive files or credentials, or initiation of further network propagation activities (e.g., RDP, SMB connections to other hosts) on a target system during or immediately following an established VNC session.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify active VNC sessions by monitoring Zeek conn.log for established connections on VNC ports, noting source IP, destination IP, and session duration. Correlate the timeframe of these VNC sessions with host-based activity on the destination system. Monitor Windows Event ID 4688 (Process Creation) on the VNC-accessed host for processes executed during or shortly after the VNC session, looking for execution of reconnaissance commands (e.g., `whoami`, `ipconfig`, `net user`, `nltest`), credential dumping tools (e.g., Mimikatz-related processes), or scripting interpreters (PowerShell.exe, cmd.exe, cscript.exe) running unusual or encoded scripts. Analyze Zeek conn.log and dns.log for new outbound connections or DNS queries from the VNC-accessed host that indicate lateral movement attempts (e.g., to other internal systems on RDP port 3389, SMB port 445) or command and control communication. Use correlation analysis, potentially with linear regression if predicting risk scores, to link VNC session identifiers (e.g., source/dest IP pair and timeframe) with these subsequent suspicious activities."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
