[
    {
        "information_requirement": "Is the adversary relocating malware to evade defenses?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1070.010",
                "name": "Relocate Malware",
                "evidence": [
                    {
                        "description": "A known malicious executable, identified by its file hash, is created or executed from any location on disk.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor file creation (Windows Event ID 4663) and process execution (Windows Event ID 4688) events, extracting the file hash for each executable. Compare these hashes against a high-confidence, continuously updated threat intelligence feed of known malware file hashes. An alert on any match is a high-fidelity indicator of malicious code, and its file path reveals its relocation point."
                    },
                    {
                        "description": "An executable is created or executed using a file name pattern known to be associated with specific malware families or packers, such as random character strings or double extensions.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor file creation (Windows Event ID 4663) and process creation (Windows Event ID 4688) events for executables with suspicious naming conventions. Use regular expressions to detect patterns like long random alphanumeric strings (e.g., `[a-zA-Z0-9]{16,}\\.exe`), common system file names with typos (e.g., `svch0st.exe`), or files with double extensions (e.g., `document.pdf.exe`). Correlate these patterns with creation in non-standard directories (e.g., %APPDATA%, %TEMP%) and investigate."
                    },
                    {
                        "description": "A process executes using a legitimate system file name (e.g., svchost.exe, lsass.exe) but from a non-standard file path where it does not normally reside.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain an authoritative baseline of legitimate system executables and their correct file paths (e.g., `C:\\Windows\\System32`). Monitor all process creation events (Windows Event ID 4688). For any process name that matches a name in the baseline, compare its actual image path against the authoritative path. Alert on any discrepancies. Use frequency analysis to identify rare or previously unseen execution paths for common process names, as this indicates masquerading or relocation."
                    },
                    {
                        "description": "A sequence of file system and process events shows a file being created, moved or copied to a new directory (especially a hidden or unusual one), executed, and then the original or new file being deleted.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4660",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate file system and process events on a per-host basis within a short time window (e.g., 1-5 minutes). Hunt for the specific sequence: 1) File creation (Event ID 4663) in a common staging area (e.g., Downloads, Temp), 2) A second file creation with similar properties (size, name) in a different directory, 3) Process execution (Event ID 4688) from the new location, and 4) File deletion (Event ID 4660) of either the original or relocated file. Use correlation analysis to link these events by file name, process ID, and user session to detect this evasion behavior."
                    },
                    {
                        "description": "A process executes from a directory commonly excluded from security scans (e.g., C:\\Windows\\Temp, user AppData folders) and subsequently establishes external network communication.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a list of high-risk, evasion-prone directories. Monitor process creation events (Windows Event ID 4688) originating from these paths. For any such process, correlate its host IP and execution timestamp with network connection logs (Zeek conn.log). Use time series analysis to baseline normal network activity originating from processes in these paths (if any) and alert on new or anomalous connections, especially to low-reputation or newly seen external destinations. Use correlation analysis to explicitly link a specific suspicious process to its network traffic."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
