[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by clearing persistence artifacts?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1070.009",
                "name": "Clear Persistence",
                "evidence": [
                    {
                        "description": "Deletion of a file, registry key, or user account whose name or path matches a known-malicious indicator of persistence.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4657",
                            "Windows Event ID 4726"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously compare arguments of deletion events (file paths from Event ID 4663 for object access with delete permissions, registry keys from 4657 for modification/deletion, and account names from 4726 for deletion) against a CTI feed of known malicious persistence artifacts (e.g., specific file names used by malware, registry values like 'WindowsUpdater', user accounts like 'backupadmin'). Alert on any exact match for the deletion of a known-bad indicator."
                    },
                    {
                        "description": "Execution of legitimate system utilities (e.g., `schtasks.exe`, `sc.exe`, `reg.exe`) with command-line parameters specifically used to delete common forms of persistence.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for specific command-line patterns indicative of persistence removal. Use regular expressions to detect: `schtasks.exe` with `/delete`, `sc.exe` with `delete`, and `reg.exe` with `delete` targeting common persistence registry hives (e.g., `HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run`, `HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run`). Correlate these command executions with the user context and parent process; flag if executed by a suspicious or non-interactive process, or if multiple such commands occur in rapid succession."
                    },
                    {
                        "description": "A rapid succession of deletion or modification events across multiple distinct persistence locations (e.g., Scheduled Tasks, Services, Registry Run Keys, Startup Folders) originating from a single process or user session.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4701",
                            "Windows Event ID 4657",
                            "Windows Event ID 4726"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate deletion-related events (file deletion 4663, task modification/deletion 4701/4700, registry key/value deletion 4657, user deletion 4726) by originating process ID and user session within a short time window (e.g., 5 minutes). Calculate the entropy or count of unique persistence mechanism types being targeted (e.g., file system, registry, task scheduler, user accounts). Alert when a single process or session initiates deletions across 2 or more distinct persistence types, which strongly indicates tool-agnostic, coordinated cleanup behavior."
                    },
                    {
                        "description": "Deletion or disabling of a persistence mechanism (e.g., user account, scheduled task, service) that was created recently and associated with preceding anomalous activity.",
                        "data_sources": [
                            "Windows Event ID 4720",
                            "Windows Event ID 4726",
                            "Windows Event ID 4698",
                            "Windows Event ID 4701",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a stateful correlation of persistence artifact lifecycles. Upon creation of a persistence artifact (e.g., user account 4720, task 4698), monitor its associated activity (logons, process executions, network connections via Zeek conn.log). If the artifact is linked to suspicious behavior (e.g., connections to known C2 servers, lateral movement), create a high-priority alert if it is subsequently deleted (account 4726, task deletion 4701) or disabled. Use linear correlation analysis to link creation, activity, and deletion events over the artifact's lifespan."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
