[
    {
        "information_requirement": "Is the adversary using mail protocols for command and control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command-And-Control",
        "indicators": [
            {
                "technique_id": "T1071.003",
                "name": "Mail Protocols",
                "evidence": [
                    {
                        "description": "Mail protocol connections to or from external IP addresses or domains known to be associated with malicious C2 infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek smtp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously cross-reference destination/source IPs and server domain names observed in Zeek conn.log (on mail ports 25, 110, 143, 465, 587, 993, 995) and Zeek smtp.log against a high-confidence cyber threat intelligence (CTI) feed of known C2 servers. Alert on any confirmed matches and investigate the associated host and session."
                    },
                    {
                        "description": "Use of specific, non-standard email headers, subject line formats, or message body structures known to be used by malware for C2 communications.",
                        "data_sources": [
                            "Zeek smtp.log",
                            "Zeek pop3.log",
                            "Zeek imap.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan email metadata fields in Zeek logs (e.g., smtp.log 'subject', 'from', and 'helo' fields) for patterns matching known C2 tool signatures, such as specific base64 encoded strings, GUID-like formats, or fixed keywords. Use regular expression matching against a maintained library of signatures derived from malware analysis reports. Investigate emails matching these specific C2 patterns."
                    },
                    {
                        "description": "Mail protocol connections occurring at regular, machine-like intervals or consistently outside of typical user activity hours, suggesting automated C2 beaconing.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek smtp.log",
                            "Zeek pop3.log",
                            "Zeek imap.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze the timestamps of mail protocol connections for specific source-destination pairs. Use time series analysis to calculate the delta between connection events and identify traffic with a low standard deviation in inter-arrival times, which is characteristic of automated beaconing. Separately, profile normal activity hours for mail servers and flag connections occurring consistently outside established business hours using percentile analysis on connection timestamps."
                    },
                    {
                        "description": "Anomalous data transfer volumes or directionality in mail protocol sessions, such as an internal host sending unusually large amounts of data over SMTP.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For mail protocol traffic identified in Zeek conn.log, establish a baseline for typical session byte counts ('orig_bytes', 'resp_bytes') per host or for the organization. Use descriptive statistics and percentile analysis (e.g., flag sessions > 95th percentile of data volume) to identify significant outliers. Analyze the ratio of bytes sent to bytes received; a very high ratio for client traffic may indicate C2-based data exfiltration. Use box-plots to visualize distributions and identify outliers."
                    },
                    {
                        "description": "Mail protocol traffic originating from a non-standard process on a host, or connections to an external mail server not authorized or normally used by the organization.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network connections on mail protocol ports (from Zeek conn.log) with process creation events (Windows Event ID 4688) on the source host. Alert when a process other than an approved mail client (e.g., Outlook.exe) or known system service initiates mail traffic. Separately, maintain an allowlist of approved organizational mail servers and trusted external providers. Use Zeek logs to detect and alert on connections to any mail servers not on this list."
                    },
                    {
                        "description": "Presence of high-entropy data within email fields or parts that should be human-readable, suggesting the use of encryption or encoding to conceal C2 communications.",
                        "data_sources": [
                            "Zeek smtp.log",
                            "Zeek pop3.log",
                            "Zeek imap.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Calculate the Shannon entropy of data within specific email fields, such as the subject line, headers, or message body parts (if captured by Zeek). Establish a baseline for normal entropy in these fields. Flag emails where the entropy significantly exceeds the baseline (e.g., > 3 standard deviations from the mean), as this indicates non-textual data possibly representing encrypted or encoded C2 instructions or exfiltrated data. Pay special attention to high entropy in fields that are typically low-entropy, like the SMTP 'helo' or 'mailfrom' fields."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
