[
    {
        "information_requirement": "Is the adversary attempting to discover email accounts or global address lists?",
        "tactic_id": "TA0007",
        "tactic_name": "Discovery",
        "indicators": [
            {
                "technique_id": "T1087.003",
                "name": "Email Account",
                "evidence": [
                    {
                        "description": "Execution of processes with file hashes known to be associated with email account or Active Directory discovery tools.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) and calculate the hash of the executable file for each new process. Correlate these hashes against a high-confidence threat intelligence feed of known malicious binaries, specifically those identified as account discovery tools (e.g., ADFind, SharpHound variants, custom enumeration scripts). Alert on any hash match and initiate an incident response."
                    },
                    {
                        "description": "Execution of specific PowerShell or command-line utilities with parameters known to be used for querying global address lists or email accounts.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation logs (Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104). Use regular expressions to search for command lines or script content containing specific cmdlets like 'Get-GlobalAddressList', 'Get-Recipient', 'Get-Mailbox', or command-line tools like 'dsquery * -filter '(objectCategory=person)''. Flag detections, especially when executed by non-administrative users or from non-standard administrative hosts."
                    },
                    {
                        "description": "Anomalous LDAP queries using filter patterns commonly associated with broad enumeration of user or email accounts.",
                        "data_sources": [
                            "Zeek ldap.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek ldap.log for LDAP search requests. Flag queries with filters known to be used for broad user enumeration, such as '(objectCategory=person)', '(objectClass=user)', '(&(objectCategory=person)(objectClass=user)(mail=*))', or those using wildcard searches on attributes like 'mail' or 'proxyAddresses'. Correlate these queries with the source host to identify enumeration activity and compare against baselines of normal directory queries."
                    },
                    {
                        "description": "A single host or user account generating an unusually high volume of MAPI, LDAP, or ActiveSync requests to mail or directory servers in a short time frame, inconsistent with normal client behavior.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dce_rpc.log",
                            "Zeek ldap.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek logs (conn.log, dce_rpc.log, ldap.log) and mail server logs to establish a baseline of query volume and frequency per user and host. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect hosts or users generating a query volume greater than 3 standard deviations from their normal baseline or peer group average. Use time series analysis to detect sudden spikes in query activity from a single source, which is indicative of an attempt to dump an entire address book."
                    },
                    {
                        "description": "A non-standard process or script (e.g., not Outlook, a web browser, or an approved admin tool) establishing network connections to mail or directory services, especially from a standard user endpoint.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log). Create and maintain a baseline of legitimate processes that communicate with mail/directory servers (e.g., Outlook.exe, Teams.exe, powershell.exe from admin hosts). Alert when a process not on this baseline (e.g., a custom binary, cscript.exe, python.exe) initiates connections to ports like 389/636 (LDAP), MAPI, or Exchange Web Services (EWS) ports, particularly from a standard user workstation. Use correlation analysis to link the parent process and user context to the anomalous network activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
