[
    {
        "information_requirement": "Is the adversary establishing persistence by adding cloud credentials?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1098.001",
                "name": "Additional Cloud Credentials",
                "evidence": [
                    {
                        "description": "Cloud credential modification API calls originating from IP addresses known to be malicious, anonymous proxies, or TOR exit nodes.",
                        "data_sources": [
                            "AWS CloudTrail logs",
                            "Azure Activity Logs",
                            "Google Cloud Audit Logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Ingest cloud provider audit logs (e.g., AWS CloudTrail, Azure Activity Logs) and filter for events related to credential creation or modification (e.g., AWS `CreateAccessKey`, `CreateLoginProfile`; Azure `UpdateApplication`, `addSecret`). Correlate the source IP address for these events against a continuously updated CTI feed of known malicious IPs, anonymous proxies, or TOR exit nodes. Cross-reference with Zeek conn.log to verify external source IPs. Alert on any confirmed matches."
                    },
                    {
                        "description": "Anomalous execution of cloud management tools or scripts on an endpoint to add new credentials to a cloud identity, especially from hosts or users not associated with cloud administration.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "AWS CloudTrail logs",
                            "Azure Activity Logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation of cloud CLI tools (`aws.exe`, `az.exe`, `gcloud.exe`) or common scripting engines (`powershell.exe`). Correlate these host events with Zeek conn.log traffic to cloud provider API endpoints and specific credential modification events in cloud audit logs. Flag sequences where a non-admin user or a server not designated for cloud management executes these tools to add credentials. This pattern links the 'how' (host tool) with the 'what' (cloud action)."
                    },
                    {
                        "description": "An existing user or service principal adds new credentials to an identity in a manner that deviates from its established behavioral baseline.",
                        "data_sources": [
                            "AWS CloudTrail logs",
                            "Azure Activity Logs",
                            "Google Cloud Audit Logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile the normal behavior of users and service principals regarding credential management using historical cloud audit logs to establish a baseline for who typically adds credentials, to what types of identities, and from which source IPs. Use time series analysis to detect unusual spikes in credential creation activity. Flag events where a user who has never managed credentials before suddenly adds a new key, or where credentials are added at an unusual time of day using percentile analysis."
                    },
                    {
                        "description": "A newly created cloud credential (e.g., access key, service principal secret) is used to authenticate for the first time from an anomalous geographic location or exhibits an 'impossible travel' scenario relative to the creation event.",
                        "data_sources": [
                            "AWS CloudTrail logs",
                            "Azure SignIn Logs",
                            "Google Cloud Audit Logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate credential creation events (e.g., `CreateAccessKey`) in cloud audit logs with subsequent authentication events (e.g., in Azure SignIn Logs or other CloudTrail events) using that new credential. For the first use, geolocate the source IP. Use descriptive statistics on historical login locations to identify rare or new source countries for the associated identity. Calculate and flag 'impossible travel' scenarios by comparing the time and location of the credential creation event with the time and location of its first use."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary escalating privileges by adding cloud credentials with elevated permissions?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1098.001",
                "name": "Additional Cloud Credentials",
                "evidence": [
                    {
                        "description": "Cloud credential modification events that match the signature of a known IAM privilege escalation vulnerability.",
                        "data_sources": [
                            "AWS CloudTrail logs",
                            "Azure Activity Logs",
                            "Google Cloud Audit Logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan cloud audit logs for sequences of API calls that match documented IAM privilege escalation exploits (e.g., exploiting a misconfigured `iam:PassRole` with `ec2:RunInstances` to add credentials to the new instance profile, or Azure AD application consent abuse patterns). Maintain and apply a library of these specific, signature-based detection rules looking for known-bad atomic patterns of exploitation."
                    },
                    {
                        "description": "A user or service principal with limited permissions adds new credentials to a different, higher-privileged identity (e.g., a 'user' role adding a secret to a 'Global Administrator' service principal).",
                        "data_sources": [
                            "AWS CloudTrail logs",
                            "Azure Activity Logs",
                            "Google Cloud Audit Logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter cloud audit logs for all credential addition events. For each event, retrieve and compare the permissions/roles of the actor (the principal performing the action) with the permissions/roles of the target (the principal whose credentials are being modified). This requires a regularly updated inventory of IAM roles and permissions. Alert on any instance where the actor's permission level is lower than the target's, indicating a 'privilege climb' or abuse of a specific write permission."
                    },
                    {
                        "description": "Following the addition of a new credential to a privileged identity, that identity immediately begins performing sensitive actions or accessing data inconsistent with its historical baseline.",
                        "data_sources": [
                            "AWS CloudTrail logs",
                            "Azure Activity Logs",
                            "Google Cloud Audit Logs",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal API activity for highly privileged roles. When a new credential is added to one of these roles, monitor its subsequent activity with high scrutiny. Use correlation analysis to link the credential addition event with subsequent high-impact actions like modifying other IAM policies, disabling logging, or accessing sensitive data stores. Correlate with host logs (Windows Event ID 4688) to see if these actions originate from a newly compromised host. Flag any burst of high-impact activity immediately following a credential modification event as potential post-escalation behavior."
                    },
                    {
                        "description": "A temporary or federated user session is used to add new, permanent credentials to a cloud-native identity, potentially creating a persistent backdoor with elevated privileges.",
                        "data_sources": [
                            "AWS CloudTrail logs",
                            "Azure Activity Logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor cloud audit logs for credential addition events where the actor is a temporary or federated session (e.g., `userIdentity.type` is `AssumedRole` or `FederatedUser` in CloudTrail). Scrutinize these events, as they may indicate an adversary is abusing temporary access to create permanent credentials. Correlate with Zeek conn.log to trace the source of the federated session. Flag any credential additions to permanent IAM users/roles made by temporary sessions, especially if the new credentials grant more permissions than the temporary session's policy allowed."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
