[
    {
        "information_requirement": "Is the adversary using dead drop resolvers for command and control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1102.001",
                "name": "Dead Drop Resolver",
                "evidence": [
                    {
                        "description": "Connections to specific dead drop resolver URIs on legitimate web services or to C2 server IP addresses/domains immediately following a connection to a known dead drop platform.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain and monitor against a list of known dead drop URIs on legitimate platforms (e.g., specific Pastebin pages, GitHub gists) derived from threat intelligence. Match this list against requested URIs in Zeek http.log. Additionally, inner join destination IPs/domains from Zeek conn.log and Zeek dns.log with a high-confidence CTI feed of known malicious C2 servers. Correlate C2 connection events with preceding connections to legitimate web services from the same internal host within a short time frame (e.g., < 2 minutes) to identify the full TTP chain."
                    },
                    {
                        "description": "Use of hardcoded, non-standard, or suspicious User-Agent strings in connections to legitimate web services commonly used as dead drop platforms.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log for HTTP requests to common content hosting and social media platforms (e.g., GitHub, Pastebin, Twitter). Compare the User-Agent string against a list of known-good User-Agents for common browsers and legitimate applications. Flag connections using rare, hardcoded, or suspicious User-Agents (e.g., default library UAs like 'curl/7.68.0', custom strings identified in malware analysis, or very old browser strings). Calculate the frequency distribution of User-Agents per destination service to identify statistical outliers."
                    },
                    {
                        "description": "Anomalous traffic volume or frequency from an internal host to a legitimate web service (e.g., social media, code repository, paste sites) that deviates significantly from individual or organizational baselines.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish dynamic baselines for each internal host's (or user profile's) connection frequency and data volume to common external web services using historical Zeek conn.log and http.log data. Use time series analysis (e.g., ARIMA, Holt-Winters) to model normal behavior and detect statistically significant deviations or spikes in traffic that are inconsistent with normal user activity. Investigate hosts exhibiting unusually regular, small 'heartbeat' connections or anomalous data transfer volumes."
                    },
                    {
                        "description": "Network connections to legitimate web services originating from non-browser processes, unsigned binaries, or executables running from unusual file paths.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network connections to legitimate web services (from Zeek conn.log) with process creation events (Windows Event ID 4688) on the source host. Filter for connections initiated by processes that are not standard web browsers or known legitimate applications. Prioritize alerts for processes that are unsigned, have low prevalence across the enterprise (identified via frequency analysis), or are executing from atypical locations like user temp directories or AppData subfolders. Use correlation analysis to link the process execution with the suspicious network beacon."
                    },
                    {
                        "description": "Connections to legitimate web services featuring unusual data characteristics, such as high-entropy URI parameters, small, fixed-size data transfers, or requests to raw content URLs.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log for requests to legitimate services. Calculate the Shannon entropy of URI paths and query parameters to detect randomized or encoded data, which may be used to retrieve specific C2 information. Identify sessions with unusually small, fixed-size request/response bodies (from Zeek conn.log 'orig_bytes'/'resp_bytes'), which may indicate a simple C2 instruction retrieval. Monitor for direct requests to raw content URLs (e.g., 'raw.githubusercontent.com', 'pastebin.com/raw/...') or specific API endpoints not typically used in interactive browsing. Use descriptive statistics to baseline these features and flag outliers."
                    },
                    {
                        "description": "A distinct sequence of network connections where an internal host first connects to a legitimate web service and then, within a short time window, initiates a connection to a new, low-reputation external IP address or domain.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Using Zeek conn.log, create a stateful analysis to track connection sequences per internal host. Define a 'resolver' set of legitimate service domains/IPs and a 'suspect' set of destinations (e.g., uncategorized, newly seen domains from Zeek dns.log, or IPs with poor reputation). Trigger an alert when a host connects to a 'resolver' and is followed within a short window (e.g., 1-5 minutes) by a connection to a 'suspect' destination. Use time series and correlation analysis to identify recurring instances of this two-step pattern across the network, which strengthens the hypothesis of a dead drop C2 mechanism."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
