[
    {
        "information_requirement": "Is the adversary collecting sensitive data via screen capture?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1113",
                "name": "Screen Capture",
                "evidence": [
                    {
                        "description": "Execution of processes matching known file hashes or names of malicious/unauthorized screen capture tools, or network transmission of files with names/MIME types specifically associated with such tools' output.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 4688",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 1 (Sysmon) for process creation events and their corresponding file hashes (e.g., SHA256, MD5), or Windows Event ID 4688 for process names if Sysmon is unavailable. Correlate these hashes and names against a curated and frequently updated threat intelligence feed of known malicious screen capture tools, unauthorized commercial utilities, or custom malware with screen capture capabilities. Simultaneously, monitor Zeek files.log for network transfer of files whose names (e.g., `cap_[timestamp].dat`, `screenshot.raw`) or MIME types are default outputs for specific malicious screen capture tools. Alert on any high-confidence matches from these selector lists and initiate incident response."
                    },
                    {
                        "description": "Execution of built-in screen capture utilities (e.g., psr.exe, snippingtool.exe, PowerShell Get-Screenshot) using command-line parameters indicative of automation, stealth, or output to non-standard locations.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 1 (Sysmon) and Windows Event ID 4688 for command-line arguments used with built-in screen capture utilities (e.g., `psr.exe`, `snippingtool.exe`, PowerShell's `Get-Screenshot` cmdlet). Specifically look for parameters that suggest automated, non-interactive, or hidden capture (e.g., `psr.exe /start /output <filepath> /sc 1 /gui 0 /stopevent <eventname>`, `snippingtool.exe /clip /silent`, PowerShell commands with `-Path` arguments directing output to temporary, hidden, or network locations). Maintain a list of suspicious command-line patterns. Use regular expression matching to detect these patterns and alert on their occurrence, especially if combined with unusual parent processes."
                    },
                    {
                        "description": "Processes, particularly those not commonly associated with image manipulation, writing image files (e.g., .png, .jpg, .bmp) using command-line parameters common for screen capture output or scripting.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor command lines from Windows Event ID 1 (Sysmon) and 4688 for patterns indicative of processes programmatically saving image files. This includes common output flags (e.g., `-o output.png`, `/save:image.jpg`, `> screenshot.bmp`, arguments to scripting language functions like Python's PIL/Pillow `Image.save()`, PowerShell `Out-File`) used by various utilities or custom scripts. Correlate these command-line patterns with the process name and its typical function; processes not usually involved in image creation (e.g., generic script hosts, command shells, custom compiled binaries) using these patterns are highly suspicious. Use regular expressions and a maintained list of common image file extensions and output parameters. Apply frequency analysis to detect rare command patterns."
                    },
                    {
                        "description": "A non-standard user process or a process typically running without a GUI (e.g., a service, a script run by a system account, a remote shell) executes screen capture utilities or is associated with a burst of image file creation.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 1 (Sysmon) and 4688 for executions of screen capture utilities (built-in or third-party, identified by name or command-line patterns). Analyze the parent process (ParentProcessName, ParentProcessId) and user context (User field). Flag executions initiated by processes not typically associated with interactive user screen activity (e.g., `services.exe`, `svchost.exe` spawned children running as SYSTEM, `wmic.exe`, `at.exe`/`schtasks.exe`, `powershell.exe` without interactive flags, processes spawned by remote shells like `sshd.exe` or `winrshost.exe`). Use descriptive statistics (mean, median, standard deviation) on the frequency of screen capture events per user/process type to identify significant outliers. If file creation logs are available (e.g., Sysmon Event ID 11) and can be correlated by ProcessGUID or PID, investigate bursts of image files created by such anomalous processes."
                    },
                    {
                        "description": "Anomalous network exfiltration of common image file types (e.g., PNG, JPG, BMP), especially in large volumes or to untrusted destinations, closely following the execution of known screen capture utilities, suspicious processes, or unusual command-line activity indicative of screen capture.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 1 (Sysmon) or 4688 for execution of known/suspicious screen capture tools or command lines indicative of screen capture. Correlate these process start times (from event logs) with Zeek conn.log data for new outbound connections from the source host and Zeek files.log for transfers of files with MIME types like `image/png`, `image/jpeg`, `image/bmp`. Apply correlation analysis (e.g., join by source IP and timestamp within a 1-5 minute window) to link suspicious host activity with subsequent network file exfiltration. Use time series analysis on Zeek files.log data (count and total volume of image files per host per hour/day) to detect unusual spikes. Perform lookups on destination IPs in Zeek conn.log against threat intelligence feeds and internal baselines of expected traffic for rarity or maliciousness. Use box-plots on image file sizes or quantities per connection to identify outliers."
                    },
                    {
                        "description": "Frequent or periodic screen capture activity from a specific endpoint, particularly outside of normal user working hours, or captures initiated when sensitive applications (e.g., password managers, financial software) are active.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline for legitimate screen capture activity on endpoints using Windows Event ID 1 (Sysmon) or 4688 by monitoring executions of known screen capture tools or suspicious command lines. Track frequency and timing per user and host. Monitor for deviations such as: a statistically significant increase in the frequency of captures from a single host, captures occurring periodically (e.g., every X minutes, suggesting an automated tool). Use time series analysis (e.g., Holt-Winters, ARIMA) to detect unusual patterns or periodicity in capture frequency. Apply Inter-Quartile Range (IQR) or percentile methods to flag hosts with exceptionally high screen capture rates. If foreground window logging (e.g., from Sysmon Event ID 1 or EDR) is available, correlate capture events with sensitive application usage (based on process name or window title) to prioritize alerts for captures potentially targeting critical information."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
