[
    {
        "information_requirement": "Is the adversary maintaining persistence by creating local accounts?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1136.001",
                "name": "Local Account",
                "evidence": [
                    {
                        "description": "A local account is created on a host that recently communicated with a known malicious IP address or domain.",
                        "data_sources": [
                            "Windows Event ID 4720",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join Zeek conn.log records with a high-confidence threat intelligence feed of malicious IP addresses. For any host with a matching connection, correlate by hostname and timestamp to determine if a local account creation event (Windows Event ID 4720) occurred within a specified window (e.g., 24 hours) of the malicious communication. Such a correlation provides strong evidence that the account creation is part of a malicious intrusion."
                    },
                    {
                        "description": "Execution of command-line tools to create a local user and immediately add it to a privileged group in a single command or script.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) logs for command-line arguments containing keywords for account creation (e.g., 'net user', '/add', 'useradd') and group modification (e.g., 'net localgroup', 'administrators'). Use regular expressions to detect single commands or scripts that both create a user and add them to a privileged group like 'Administrators' or 'Remote Desktop Users'. Use frequency analysis to flag parent processes that rarely execute such commands."
                    },
                    {
                        "description": "A new local account creation event is immediately followed by an event adding that same account to a privileged local group.",
                        "data_sources": [
                            "Windows Event ID 4720",
                            "Windows Event ID 4732"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Windows Event ID 4720 (A user account was created) with Windows Event ID 4732 (A member was added to a security-enabled local group) on the same host. Trigger a high-priority alert when the 'New Account Name' in event 4720 matches the 'Member Name' in event 4732 within a very short timeframe (e.g., less than 1 minute). Prioritize alerts for additions to highly privileged groups such as 'Administrators', 'Remote Desktop Users', or 'Distributed COM Users'."
                    },
                    {
                        "description": "A newly created local account is used for the first time with a remote logon type or to execute suspicious discovery commands.",
                        "data_sources": [
                            "Windows Event ID 4720",
                            "Windows Event ID 4624",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "After detecting a new local account creation (Event ID 4720), monitor for the first corresponding logon event (Event ID 4624) for that account. Raise an alert if the first logon is a remote type (Logon Type 3 - Network, or Logon Type 10 - RemoteInteractive). Correlate the logon session with subsequent process creation events (Event ID 4688) to detect immediate execution of discovery commands (e.g., 'whoami', 'netstat', 'ipconfig'). Use descriptive statistics to baseline normal new-user logon behavior and flag these behavioral deviations."
                    },
                    {
                        "description": "A host exhibits anomalous network behavior (e.g., new C2-like traffic, data staging) immediately following the creation of a new local account.",
                        "data_sources": [
                            "Windows Event ID 4720",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate the timestamp of a local account creation event (Windows Event ID 4720) with the host's network activity profile from Zeek conn.log. Use time series analysis to detect anomalous spikes in data volume, connections to new or rare external IP addresses, or periodic 'beaconing' traffic that begins shortly after the account creation event. A change-point detection algorithm or regression analysis can identify statistically significant shifts in the host's network behavior baseline post-account creation."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
