[
    {
        "information_requirement": "Is the adversary using IDE tunneling for command and control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1219.001",
                "name": "IDE Tunneling",
                "evidence": [
                    {
                        "description": "Outbound network connections from IDE processes or tunneling tools to domains or IP addresses known to be associated with malicious C2 infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process execution events (Windows Event ID 4688) for known IDEs or their tunneling tools (e.g., code.exe, code-tunnel.exe, jetbrains_client.exe) with outbound network connections from the same host (Zeek conn.log). Extract destination domains from DNS queries (Zeek dns.log) and destination IPs from connection logs made by these processes. Inner join these destination IOCs against a high-confidence threat intelligence feed of known C2 servers (updated daily). Alert on any matches."
                    },
                    {
                        "description": "Execution of IDE tunneling command-line tools using specific argument patterns or network traffic with TLS fingerprints (JA3/JA3S) characteristic of IDE tunneling services.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek ssl.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On hosts, monitor process creation events (Windows Event ID 4688) for known IDE tunneling CLIs (e.g., 'code tunnel', 'gh cs tunnel') and use regular expression matching to detect suspicious argument patterns (e.g., non-standard service URIs, unusual tunnel names). On the network, monitor Zeek ssl.log for JA3/JA3S hashes and SNI values known to be associated with specific IDE remote services (e.g., VS Code, GitHub Codespaces, JetBrains Gateway). Maintain and correlate against a list of known-good fingerprints and destinations for authorized development teams and flag connections with unknown or suspicious signatures."
                    },
                    {
                        "description": "Installation or execution of IDE software or tunneling components on systems outside of an established baseline of known developer workstations, such as critical servers or administrative terminals.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4697"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish and maintain a baseline of hosts and user accounts authorized to use IDE software. Monitor process creation (Windows Event ID 4688) and service installation (Windows Event ID 4697) for IDE-related executables or services. Generate alerts for any such activity occurring on systems or by users not in the authorized baseline (e.g., Domain Controllers, finance department workstations, production servers). Use frequency analysis on process execution per host group to identify outliers, and correlate with asset inventory data to improve alert fidelity."
                    },
                    {
                        "description": "An outbound network connection originating from an IDE process or on a port associated with IDE tunneling that is long-lived, transfers unusually high data volumes, or exhibits periodic timing, inconsistent with normal interactive developer activity.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify traffic from IDE processes by correlating network logs (Zeek conn.log) with host process data (Windows Event ID 4688). For this traffic, establish a baseline of normal developer session characteristics (e.g., duration, data volume, time of day). Use time series analysis and descriptive statistics (e.g., Inter-Quartile Range and box-plots for session duration and bytes transferred) to detect significant outliers. Flag connections that are exceptionally long-lived (e.g., >24 hours), transfer anomalously large amounts of data, or exhibit periodic 'heartbeat' patterns indicative of C2. Use entropy measures on inter-packet arrival times to help distinguish automated C2 from interactive human traffic."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
