[
    {
        "information_requirement": "Is the adversary using trusted utilities like mshta.exe for defense evasion?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1218.005",
                "name": "Mshta",
                "evidence": [
                    {
                        "description": "mshta.exe making network connections to domains or IP addresses known to be malicious, or executing an HTA file with a known malicious hash.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network connections made by mshta.exe (identified via Zeek conn.log, or by correlating Windows Event ID 4688 with network events) against a high-confidence threat intelligence feed of malicious domains and IPs updated within the last hour. For .hta files executed by mshta.exe (identified via command line in Windows Event ID 4688), if possible calculate the file hash and compare it against a threat intelligence feed of known malicious file hashes. Alert on any matches."
                    },
                    {
                        "description": "Execution of mshta.exe with command-line patterns known to be associated with malicious in-line scripts or specific adversary tools.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for mshta.exe process creations. Use regular expression matching on the command line to detect known malicious patterns, such as 'mshta.exe javascript:...', 'mshta.exe vbscript:Execute(...)', 'mshta.exe about:<HTML>...', or specific command structures used by offensive security frameworks. Maintain and update a list of these patterns based on CTI reporting."
                    },
                    {
                        "description": "Execution of mshta.exe spawned by an unusual parent process, such as a Microsoft Office application, email client, or scripting engine.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for mshta.exe process creations and inspect the parent process name. Establish a baseline of common, legitimate parent processes (e.g., explorer.exe, cmd.exe). Flag and investigate instances where mshta.exe is spawned by unusual parents, particularly winword.exe, excel.exe, powerpnt.exe, outlook.exe, wscript.exe, or cscript.exe. Use frequency analysis to identify rare or first-seen parent-child process relationships across the environment."
                    },
                    {
                        "description": "Execution of mshta.exe with highly obfuscated or unusually long command-line arguments, suggesting an attempt to hide malicious code.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For every mshta.exe execution captured in Windows Event ID 4688, analyze the full command-line string. Calculate the length and character entropy of the command line. Establish a baseline for these metrics based on legitimate usage in the environment. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores to flag executions with unusually high entropy or length, which are strong indicators of embedded, obfuscated scripts. Investigate outliers identified through box-plots of command-line length and entropy."
                    },
                    {
                        "description": "Network connections initiated by mshta.exe that deviate from established baselines, such as connecting to non-standard ports, low-reputation domains, or using anomalous user-agent strings.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network traffic with mshta.exe execution. For HTTP/S traffic (Zeek http.log), analyze user-agent strings; flag any that are blank, unusual, or do not match the standard Microsoft HTML Application host user-agent. For all connections (Zeek conn.log), analyze the destination port and IP/domain reputation. Use descriptive statistics to identify connections to rare ports or domains not previously visited by the organization. Use time series analysis to detect potential beaconing behavior (connections at regular intervals) subsequent to mshta.exe execution."
                    },
                    {
                        "description": "mshta.exe executing content from a suspicious file path or location, such as a temporary internet folder, AppData, or a user's Downloads directory.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for mshta.exe process creations and analyze the command line for file paths of executed .hta files. Establish a baseline of legitimate locations for .hta files, if any exist in the environment. Flag executions from atypical or high-risk directories, including %APPDATA%, %LOCALAPPDATA%\\Temp, user Downloads folders, or unpacked archive locations. Use correlation analysis to link execution from these paths with recent file creation events, such as an email attachment being saved to disk."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
