[
    {
        "information_requirement": "Is the adversary attempting to disrupt network availability?",
        "tactic_id": "TA0040",
        "tactic_name": "Impact",
        "indicators": [
            {
                "technique_id": "T1498",
                "name": "Network Denial of Service",
                "evidence": [
                    {
                        "description": "Network traffic originating from IP addresses known to be part of active botnets, stresser/booter services, or other infrastructure used for DoS attacks.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously ingest and update threat intelligence feeds specializing in known DoS/DDoS botnet command and control (C2) nodes, compromised servers used for attacks, and commercial stresser/booter service IPs. Inner join source IPs from inbound Zeek conn.log records against this list of malicious indicators. Alert on any matches, as this traffic is highly likely to be malicious, even at low volumes, and can be a precursor to a larger attack."
                    },
                    {
                        "description": "Network traffic patterns matching signatures of known application-layer DoS tools (e.g., Slowloris, R.U.D.Y., Hulk) such as incomplete HTTP requests, very slow data rates, or specific malicious HTTP headers/User-Agents.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log for patterns associated with slow-rate application DoS attacks. Look for clients sending headers but never completing the request, or sending POST requests with a large Content-Length but transmitting the body at an extremely slow rate (e.g., < 1 byte/sec). Monitor for specific User-Agent strings or other HTTP headers used by known DoS tools (e.g., LOIC, HOIC, Hulk). For Zeek conn.log, use correlation analysis to identify TCP connections that are established but remain in a half-open or idle state for an unusually long time without significant data transfer, exhausting server connection tables."
                    },
                    {
                        "description": "Network traffic patterns indicative of reflection/amplification attacks, such as large responses from internal servers following small external requests on specific UDP ports (e.g., DNS, NTP, SNMP).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek ntp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek logs (conn.log, dns.log, ntp.log) for sessions originating from external IPs to internal services that can be used for amplification (e.g., open DNS resolvers on port 53, NTP on 123). Calculate the ratio of bytes sent to bytes received for sessions on these ports from the perspective of the internal server. Use descriptive statistics (mean, median, 95th percentile) on these amplification ratios to establish a baseline. Flag sessions or source IPs with abnormally high amplification factors, which indicate they are likely being used in a reflection/amplification DDoS attack."
                    },
                    {
                        "description": "Anomalous surge in traffic volume (packets/sec or bytes/sec) or connection rate targeting a specific service, host, or network segment, significantly deviating from established baselines.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dstats.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dstats.log and aggregated Zeek conn.log data to establish historical baselines for traffic volume (bytes/sec, packets/sec) and connection rates for critical services and network choke points during different time periods (e.g., hour-of-day, day-of-week). Use time series analysis with anomaly detection (e.g., Z-score, IQR, Holt-Winters) to alert when traffic exceeds N standard deviations from the mean or a dynamic percentile-based threshold (e.g., 99th percentile) for a sustained period."
                    },
                    {
                        "description": "Statistically significant deviation in traffic composition or topology, such as a sudden shift in protocol distribution, abnormal TCP flag combinations, or a sharp change in source IP entropy indicating a distributed, coordinated attack.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously analyze Zeek conn.log to baseline the normal protocol mix (TCP/UDP/ICMP percentages) and TCP flag distribution (e.g., SYN/ACK ratio) for incoming traffic. Alert on sudden, drastic shifts. In parallel, calculate the entropy of the source IP address space and the number of distinct source IPs for incoming traffic to critical services in rolling time windows (e.g., 1 minute). A sudden drop in source IP entropy or a massive increase in distinct source IPs, especially when correlated with a volumetric surge, strongly indicates a DDoS attack. Use box-plots on distinct source counts per minute to identify outlier events."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
