[
    {
        "information_requirement": "Is the adversary establishing persistence by hijacking accessibility features?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1546.008",
                "name": "Accessibility Features",
                "evidence": [
                    {
                        "description": "Replacement of an accessibility feature binary with a file matching a known malicious hash, or modification of an IFEO debugger key to a known malicious value.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor file creation/modification events in C:\\Windows\\System32\\ or C:\\Windows\\SysWOW64\\. Calculate the hash of any newly written accessibility binaries (sethc.exe, utilman.exe, etc.) and compare against a CTI feed of known malicious file hashes. Also, monitor Windows Event ID 4657 for modifications to IFEO 'Debugger' values for these binaries and compare the new value against a list of known malicious tools or scripts. Alert on any match."
                    },
                    {
                        "description": "A pattern of file system permission or ownership changes on a standard accessibility feature binary, immediately followed by a write or rename operation on that file.",
                        "data_sources": [
                            "Windows Event ID 4670",
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for the common attack pattern of taking ownership and modifying permissions of accessibility binaries. Correlate a permission change event (Windows Event ID 4670) on sethc.exe, utilman.exe, etc., with a subsequent write attempt (Windows Event ID 4663) or file rename targeting the same binary by the same user/process within a short time window (e.g., < 2 minutes). Use correlation analysis to link these events by process and user context, as this sequence is a strong indicator of tampering."
                    },
                    {
                        "description": "An unusual process (e.g., spawned from an Office document, web browser, or remote administration tool) modifying accessibility feature binaries or their associated Image File Execution Options (IFEO) registry keys.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate file write attempts (Windows Event ID 4663) on accessibility binaries or registry modifications (Windows Event ID 4657) to IFEO keys with the parent process that initiated the change (via Windows Event ID 4688). Establish a baseline of normal processes that modify these assets (e.g., trustedinstaller.exe, msiexec.exe). Flag modifications made by anomalous processes like powershell.exe, wscript.exe, winword.exe, or any process not on the established baseline. Use frequency analysis on parent processes that perform these modifications to identify rare or first-time modifiers."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary escalating privileges by executing a hijacked accessibility feature?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1546.008",
                "name": "Accessibility Features",
                "evidence": [
                    {
                        "description": "Execution of specific, high-confidence malicious commands (e.g., related to known malware C2, credential dumping, or data staging) by a process spawned from an accessibility feature binary.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) where the parent process is an accessibility binary (sethc.exe, utilman.exe, etc.). Inspect the 'CommandLine' field of the child process (e.g., cmd.exe, powershell.exe) for strings matching a list of known malicious commands, such as those used by specific malware families (e.g., 'mimikatz', '--encodedcommand', 'whoami /all'). Maintain and update this list of malicious command-line selectors."
                    },
                    {
                        "description": "Execution of a common command sequence for creating a new privileged user immediately after an accessibility feature spawns a command shell.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4720",
                            "Windows Event ID 4732"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and monitor for a specific sequence of events within a short time window (e.g., < 2 minutes): 1. An accessibility feature spawns a shell (Windows Event ID 4688, Parent: sethc.exe, Child: cmd.exe). 2. A new user account is created (Windows Event ID 4720, corresponds to 'net user ... /add'). 3. The new user is added to a privileged group like 'Administrators' (Windows Event ID 4732, corresponds to 'net localgroup Administrators ... /add'). Use correlation analysis to link these events by Logon ID and time to detect this common attack pattern."
                    },
                    {
                        "description": "Execution of any command shell or scripting interpreter (e.g., cmd.exe, powershell.exe) as a direct child process of an accessibility feature binary, especially at the logon screen.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for any instance where the 'ParentProcessName' is a known accessibility feature binary (sethc.exe, utilman.exe, osk.exe, magnify.exe, narrator.exe, DisplaySwitch.exe, atbroker.exe) and the 'NewProcessName' is a shell or script interpreter. This parent-child relationship is almost always malicious and indicates the TTP is being actively used. Use descriptive statistics to baseline normal system parent-child relationships and flag these rare, high-fidelity occurrences for immediate investigation."
                    },
                    {
                        "description": "An accessibility feature binary spawning a child process that initiates an outbound network connection, especially to a rare or uncategorized destination.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688) where an accessibility feature is the parent with subsequent network connection events (Windows Event ID 5156) generated by the child process's Process ID. Cross-reference the destination IP from Event ID 5156 or Zeek conn.log data with threat intelligence and geolocation data. Use frequency analysis on destination IPs and ports to identify connections to rare or never-before-seen endpoints from the environment, indicating potential reverse shell activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
