[
    {
        "information_requirement": "Has the adversary accessed cloud instance metadata for credentials?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1552.005",
                "name": "Cloud Instance Metadata API",
                "evidence": [
                    {
                        "description": "External requests to a public-facing cloud application from known malicious IP addresses that immediately precede internal connections from the application server to the Instance Metadata API.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join source IP addresses from external-facing network connections (Zeek conn.log) with a high-confidence cyber threat intelligence (CTI) feed of malicious IPs. For any matches, correlate the timestamp and destination host with internal network connections (Zeek conn.log) originating from that same host with a destination of 169.254.169.254. Alert on correlations occurring within a short time window (e.g., less than 5 seconds)."
                    },
                    {
                        "description": "Execution of common network utility tools (e.g., curl, wget) with command-line arguments specifically targeting sensitive credential paths within the Instance Metadata API.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) logs on all cloud instances. Create a high-fidelity detection rule using regular expressions to flag command lines that contain both a network utility (e.g., 'curl', 'wget', 'Invoke-WebRequest') and arguments targeting the metadata IP and specific sensitive paths (e.g., '169.254.169.254/latest/meta-data/iam/security-credentials/')."
                    },
                    {
                        "description": "An unauthorized or unexpected process on a cloud instance making a network connection to the Instance Metadata API.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of legitimate processes and user accounts that are authorized to access the metadata API on various instance types. Monitor for connections to 169.254.169.254 (via Zeek conn.log) and correlate them with the initiating process (via Windows Event ID 4688). Use frequency analysis and baselining to flag connections from rare or non-whitelisted processes (e.g., 'powershell.exe', 'cmd.exe', a user-dropped binary) or under an unexpected user context."
                    },
                    {
                        "description": "Evidence of a Server-Side Request Forgery (SSRF) vulnerability being exploited on a public-facing application to make requests to the internal Instance Metadata API.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for any network connections originating from a public-facing application server's process or IP to the destination IP 169.254.169.254. Correlate the timing of these internal connections with suspicious incoming requests to the public application (e.g., requests with URLs or IP addresses in parameters, identified in Zeek http.log). Use correlation analysis to link suspicious external request characteristics to the internal API calls, indicating a potential SSRF attack."
                    },
                    {
                        "description": "Anomalous interaction with the Instance Metadata API, such as recursive path enumeration, accessing an unusually high number of unique paths, or using unexpected HTTP methods.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Zeek http.log for requests to 169.254.169.254. For each source instance, profile the typical volume, HTTP methods, and URI paths accessed. Use statistical analysis to detect anomalies. Calculate the entropy of URI paths requested by a single instance in a time window; a sudden increase could indicate enumeration. Flag instances making requests to an abnormally high number of distinct paths or using unexpected HTTP methods (e.g., POST, PUT) compared to an established baseline."
                    },
                    {
                        "description": "Outbound network connections from a cloud instance to external cloud provider APIs immediately following access to the Instance Metadata API, suggesting the use of freshly acquired temporary credentials.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Zeek conn.log entries showing internal connections from an instance to 169.254.169.254 with subsequent outbound connections from the same instance to known cloud provider API endpoints (e.g., identified via Zeek dns.log queries for domains like '*.amazonaws.com', '*.core.windows.net', '*.googleapis.com'). Use time series analysis to identify anomalous bursts or unexpected patterns of outbound cloud API traffic occurring within minutes after metadata API access, especially from processes or instances not expected to perform such actions."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
