[
    {
        "information_requirement": "Is the adversary executing code using COM?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1559.001",
                "name": "Component Object Model",
                "evidence": [
                    {
                        "description": "Execution involving known malicious COM Class IDs (CLSIDs), ProgIDs, or COM server file hashes.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan Windows Event ID 4688 command-line arguments for the presence of known malicious COM CLSIDs or ProgIDs using a maintained threat intelligence list. Correlate process creation events with a list of known malicious COM server file hashes (e.g., DLLs, EXEs) to detect their execution. Alert on any matches for immediate investigation."
                    },
                    {
                        "description": "Execution of script interpreters or LOLBAS as child processes of common COM host processes (e.g., svchost.exe, dllhost.exe, explorer.exe).",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for specific parent-child process relationships. Create rules to flag instances where common COM host processes (e.g., svchost.exe, dllhost.exe, explorer.exe, Microsoft Office applications) spawn child processes like powershell.exe, cmd.exe, cscript.exe, wscript.exe, or rundll32.exe. Use frequency analysis and descriptive statistics to filter out benign, common occurrences and focus on rare or first-seen parent-child process patterns within the environment."
                    },
                    {
                        "description": "A common COM host process (e.g., dllhost.exe, svchost.exe) initiating outbound network connections, especially to external IP addresses or on non-standard ports.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation logs (Windows Event ID 4688) on hosts with network connection logs (Zeek conn.log) by source IP and timestamp. Identify all network connections initiated by common COM server processes like dllhost.exe, svchost.exe, and wmiprvse.exe. Establish a baseline of normal network destinations and ports for these processes. Use correlation analysis and frequency distributions to flag any connections to external IP addresses, non-standard ports, or internal destinations that are unusual for that specific host or process. Investigate outliers."
                    },
                    {
                        "description": "Anomalous lateral movement activity using Distributed COM (DCOM), identified by unusual source-destination pairings, accounts, or high-volume activity.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for traffic on TCP port 135 (RPC Endpoint Mapper) followed by connections on high ephemeral ports between internal systems. Establish a baseline of normal DCOM traffic patterns (i.e., which hosts communicate, using which accounts, at what frequency). Use correlation analysis to link network connections to successful network logons (Windows Event ID 4624, Logon Type 3) on the destination server. Flag new or rare source-destination DCOM connections, connections made by non-administrative accounts, or a sudden spike in DCOM activity from a single host. Use time series analysis to detect volume anomalies indicative of DCOM-based lateral movement."
                    },
                    {
                        "description": "Suspicious command-line activity indicating COM hijacking, such as registry modifications followed by the launch of a legitimate, hijackable application.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for command-line activity involving tools like reg.exe or regsvr32.exe modifying COM-related registry hives (e.g., HKCU\\Software\\Classes, HKCR\\CLSID). Correlate this modification activity with the subsequent launch of a legitimate application (e.g., explorer.exe, mmc.exe) that is known to be a common target for COM hijacking. Analyze the child processes or network connections (via Zeek conn.log) of that legitimate application for anomalous behavior. Use correlation analysis to link the registry modification event and the subsequent process launch occurring within a short time window (e.g., under 5 minutes)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
