[
    {
        "information_requirement": "Is the adversary maintaining persistence using a malicious password filter DLL?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1556.002",
                "name": "Password Filter DLL",
                "evidence": [
                    {
                        "description": "A known malicious password filter DLL file hash is detected in a system directory or its name is added to the LSA Notification Packages registry key.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor for file creation events (Event ID 4663, requires SACL on system directories) and registry modifications (Event ID 4657). Compare the hash of any new DLL and any DLL name added to the 'Notification Packages' key against a high-confidence threat intelligence feed of known malicious password filter DLLs. Alert on any match."
                    },
                    {
                        "description": "A DLL added to the LSA Notification Packages registry key is unsigned, has low prevalence across the enterprise, or is located in a non-standard directory.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 for any DLL added to the 'Notification Packages' key. For each added DLL, automatically enrich its properties: check its digital signature, its on-disk location, and its prevalence across other servers using a software inventory. Use descriptive statistics to establish baselines for file paths and signatures. Alert on DLLs that are unsigned, signed by an untrusted publisher, located in an atypical directory (e.g., not System32), or have a very low frequency of occurrence across the environment (e.g., percentile analysis)."
                    },
                    {
                        "description": "A new or unauthorized DLL is loaded by the lsass.exe process.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "(or Sysmon Event ID 7)"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for DLLs loaded by 'lsass.exe' (e.g., using Sysmon Event ID 7 or other EDR data). Maintain a strict allow list of legitimate DLLs known to be loaded by lsass.exe on a given server build. Alert on any DLL load event that does not appear on the allow list. Use set-based analysis to compare observed DLLs against the baseline and identify any anomalies."
                    },
                    {
                        "description": "A process modifies the LSA Notification Packages registry key, which is followed by a password change event, and then subsequent anomalous network or file activity from the lsass.exe process.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4723",
                            "Windows Event ID 4724",
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlated detection rule that sequences events in a short time window (e.g., 5 minutes): 1. A write to 'HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\Notification Packages' (Event ID 4657). 2. A subsequent password change or reset event on the same host (Event ID 4723/4724). 3. Followed by 'lsass.exe' making an outbound network connection (Event ID 5156, Zeek conn.log) or writing to a file in an unusual location. Use time series correlation to link the installation, trigger, and credential exfiltration/storage behavior."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary using a malicious password filter DLL to evade detection?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1556.002",
                "name": "Password Filter DLL",
                "evidence": [
                    {
                        "description": "A DLL added to the LSA Notification Packages key is identified by a file name that mimics a legitimate system DLL (e.g., 'scvhost.dll', 'mssense.dll', 'mssecsvc.dll').",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 (registry modification) and 4663 (file creation). Compare the names of newly registered or created DLLs against a list of legitimate system DLL names using fuzzy matching algorithms like Levenshtein distance to detect typosquatting. Alert on DLLs with names that are suspiciously similar to legitimate Microsoft DLLs but are not authentic (e.g., fail signature validation)."
                    },
                    {
                        "description": "A DLL loaded by lsass.exe exhibits high entropy or has its file timestamps modified to match legitimate system files (timestomping).",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Upon detection of a new DLL being written to a system directory (Event ID 4663) that is then loaded by lsass.exe, trigger an automated action to analyze the file. Calculate the file's entropy and flag DLLs with unusually high values (e.g., >7.5/8.0) indicative of packing. Compare the file's 'Created' and 'Modified' timestamps against other files in the same directory. Use descriptive statistics on timestamps to identify outliers where a new file's timestamp has been manipulated to match older, legitimate files."
                    },
                    {
                        "description": "The LSA Notification Packages registry key is modified by a process not associated with standard system administration, such as a scripting engine or a document process.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 for modifications to the LSA key and correlate with the parent process information from Windows Event ID 4688. Maintain a baseline of legitimate processes that modify this key (e.g., 'svchost.exe', 'lsass.exe', 'reg.exe' initiated by an admin). Alert on any modification performed by an anomalous process (e.g., 'powershell.exe', 'mshta.exe', 'rundll32.exe', 'wscript.exe', 'WINWORD.EXE'). Use frequency analysis on parent process names to identify rare modification sources."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary attempting to collect credentials using a malicious password filter DLL?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1556.002",
                "name": "Password Filter DLL",
                "evidence": [
                    {
                        "description": "The lsass.exe process makes an outbound network connection to a known malicious IP address or domain.",
                        "data_sources": [
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for any outbound network connection from 'lsass.exe' using Windows Event ID 5156 and Zeek conn.log. Enrich the destination IP/domain with CTI data. Inner join the destination IPs from these events with a threat intelligence feed of known malicious C2 servers, drop zones, or anonymizing services (updated daily). Alert immediately on any match, as this is a high-fidelity indicator of exfiltration."
                    },
                    {
                        "description": "The lsass.exe process writes data to a file with a common log extension (e.g., .log, .txt, .dat) or to a file in a temporary or world-writable directory.",
                        "data_sources": [
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable detailed file access auditing (SACL) on key directories (e.g., C:\\Windows\\Temp, C:\\ProgramData, user profile temp folders) on Domain Controllers. Monitor Windows Event ID 4663 for file write events where the 'ProcessName' is 'lsass.exe'. While 'lsass.exe' can legitimately write to some system files, writes to generic text files, log files, or files in temporary locations are highly suspicious. Use regular expressions to pattern match target file paths and extensions indicative of credential dumping."
                    },
                    {
                        "description": "The lsass.exe process spawns a child process, particularly a network utility or scripting engine.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for any child process creation events (Event ID 4688) where the 'ParentProcessName' is 'lsass.exe'. The LSASS process should not spawn child processes under normal circumstances. Alert on any such event. Pay special attention to spawned processes like 'powershell.exe', 'cmd.exe', 'rundll32.exe', or common network utilities, as this is a strong indicator of an adversary using the injected DLL to execute commands for exfiltration."
                    },
                    {
                        "description": "An anomalous spike in network traffic or file write operations originating from the lsass.exe process on a Domain Controller, especially following a wave of password change events.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4663",
                            "Windows Event ID 4723",
                            "Windows Event ID 4724"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a strict baseline for network traffic volume and file I/O operations for the 'lsass.exe' process on Domain Controllers (this should be near zero for network activity). Monitor for any deviations from this baseline using time series analysis. Correlate any detected spike in 'lsass.exe' activity (from Zeek conn.log or Windows Event ID 4663) with preceding password change/reset events (Windows Event ID 4723/4724). A strong temporal correlation between password changes and subsequent 'lsass.exe' exfiltration/write activity is a high-confidence indicator of an active password filter DLL harvesting credentials."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
