[
    {
        "information_requirement": "Is the adversary moving laterally through RDP session hijacking?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1563.002",
                "name": "RDP Hijacking",
                "evidence": [
                    {
                        "description": "Execution of highly specific command-line strings or arguments identical to those used by known malicious scripts or frameworks for RDP session hijacking.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) and scan the 'CommandLine' or 'ProcessCommandLine' field for exact string matches against a curated list of selectors from threat intelligence. This includes specific argument patterns used by Metasploit, PowerShell Empire, or other public hacking tool modules designed to automate RDP hijacking. Alert on any exact match for immediate investigation, as this is a high-confidence indicator of a specific tool being used."
                    },
                    {
                        "description": "Execution of `tscon.exe` with a numeric session ID, often preceded by session enumeration commands such as `query session` or `quser`.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlation rule that monitors process creation events (Windows Event ID 4688) on a single host within a short time window (e.g., under 2 minutes). Flag sequences where a process for `query.exe` (with the 'session' argument) or `quser.exe` is followed by an execution of `tscon.exe` that includes a numeric session ID in its command line. Use correlation analysis to link these sequential events by host and timestamp. Use descriptive statistics to find hosts where this pattern occurs, as this chained execution is a strong pattern of this TTP and is highly irregular for normal administrative activity."
                    },
                    {
                        "description": "An active and authenticated RDP session disconnects unexpectedly, immediately followed by another user account connecting to the same pre-existing session ID.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4779"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for RDP session disconnect events (Windows Event ID 4779). Correlate the `TargetLogonId` from the disconnect event with a subsequent RDP logon event (Windows Event ID 4624, Logon Type 10) that specifies the same `TargetLogonId` but is initiated by a different user account or from a different source network address. This indicates one user was disconnected and another immediately took over their active session. Use correlation analysis based on the `TargetLogonId` field across these two event IDs occurring within a few seconds of each other."
                    },
                    {
                        "description": "An established RDP session suddenly initiates anomalous command execution or network connections without a corresponding interactive logon event from the source of the new activity.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of typical processes and network connections for user RDP sessions. Monitor for anomalous process creation (Windows Event ID 4688) or network connections (Zeek conn.log) originating from a process within an established RDP session (identified by Logon ID). If anomalous activity is detected (e.g., use of `powershell.exe`, connections to known C2 IPs, or further lateral movement attempts), verify if a recent RDP logon event (Windows Event ID 4624, Logon Type 10) from the initiating account occurred. The absence of a preceding logon event suggests a session takeover. Use time series analysis on network data volume per session to spot sudden, unexplained spikes in activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
