[
    {
        "information_requirement": "Is the adversary exfiltrating data using web services?",
        "tactic_id": "TA0010",
        "tactic_name": "Exfiltration",
        "indicators": [
            {
                "technique_id": "T1567",
                "name": "Exfiltration Over Web Service",
                "evidence": [
                    {
                        "description": "Outbound connections to web services whose destination domains, IPs, or specific URLs are known indicators of compromise (IOCs) associated with data exfiltration.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate destination Fully Qualified Domain Names (from Zeek http.log host header or Zeek ssl.log Server Name Indication field) and destination IP addresses (from Zeek conn.log) against a high-confidence, continuously updated cyber threat intelligence (CTI) feed of known malicious domains, IPs, or specific URLs used for C2 or data exfiltration. Generate a high-priority alert for any matches and investigate the source host immediately."
                    },
                    {
                        "description": "Outbound web traffic containing User-Agent strings, API keys, or specific URL/header patterns characteristic of common data transfer tools or exfiltration scripts targeting services like Pastebin, GitHub Gists, or cloud storage APIs.",
                        "data_sources": [
                            "Zeek http.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan Zeek http.log records for User-Agent strings matching common command-line utilities (e.g., curl, wget, python-requests, PowerShell) that are unusual for standard user browsing activity. Maintain and apply regular expressions to detect specific URL patterns or authentication headers associated with programmatic uploads to public file-sharing or code-hosting sites. Correlate these network events using IP address and timestamp with process creation logs (Windows Event ID 4688) to confirm if non-interactive or suspicious processes are initiating these transfers."
                    },
                    {
                        "description": "Anomalously large outbound data transfers to web services, identified by high outbound-to-inbound byte ratios or unusually large HTTP POST/PUT requests, when compared to established baselines.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For outbound web connections (ports 80/443), analyze Zeek conn.log to calculate the ratio of outbound-to-inbound bytes ('orig_bytes' / 'resp_bytes'). Concurrently, analyze Zeek http.log to monitor the size of PUT/POST request bodies ('request_body_len'). Establish baselines for these metrics per user, host, and destination service. Use statistical outlier detection (e.g., Inter-Quartile Range & box-plots, or flagging values exceeding 3 standard deviations from the mean) to identify sessions with significant data volume anomalies suggesting exfiltration."
                    },
                    {
                        "description": "Outbound web connections originating from unusual or non-interactive processes not typically associated with generating web traffic on a given host.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate outbound web connections from Zeek conn.log with process creation events (Windows Event ID 4688) on the source host by IP address and timestamp. Establish a baseline of normal processes that generate web traffic (e.g., chrome.exe, firefox.exe). Alert on connections initiated by processes that do not typically make web requests (e.g., system utilities, administrative tools like PowerShell without user interaction, or unsigned executables running from temporary directories)."
                    },
                    {
                        "description": "Outbound web connections to external services at unusual times or with anomalous frequency, deviating from established user or host baselines.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of typical connection frequency and timing patterns for outbound web service traffic per user and/or host using historical Zeek conn.log data. Employ time series analysis or statistical process control methods to identify significant deviations from these baselines, such as a sudden increase in connection volume, connections occurring consistently outside of normal working hours, or connections with a machine-like, periodic frequency (beaconing). Use linear regression to detect anomalous trends in connection counts over time."
                    },
                    {
                        "description": "Outbound web traffic (e.g., HTTP POST bodies, file uploads) containing data with high entropy or non-standard encoding, suggesting the exfiltration of staged data that has been compressed, encrypted, or encoded.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For file uploads identified in Zeek files.log or large request bodies in Zeek http.log, calculate the Shannon entropy of the data. Establish a baseline for typical entropy levels for traffic to common web services (e.g., text-based services will have lower entropy than legitimate binary file uploads). Flag sessions with unusually high entropy values, which may indicate encrypted or compressed data archives (e.g., .zip, .rar, .7z) being exfiltrated. Correlate high-entropy transfers with other suspicious behaviors for the source host."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
