[
    {
        "information_requirement": "Is the adversary using email hiding rules to evade detection or facilitate other malicious activities?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1564.008",
                "name": "Email Hiding Rules",
                "evidence": [
                    {
                        "description": "PowerShell script block logs showing email rule creation or modification using specific known malicious keywords, sender addresses, or subject lines identified in threat intelligence.",
                        "data_sources": [
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Search Windows Event ID 4104 (PowerShell Script Block Logging) for execution of `New-InboxRule` or `Set-InboxRule` cmdlets. Extract rule parameters (e.g., `-SubjectContainsWords`, `-BodyContainsWords`, `-From`, `-RecipientAddressContainsWords`) and compare their values against a curated, regularly updated list of highly specific, known malicious keywords, email addresses, domains, or subject line patterns derived from active threat intelligence feeds or past incident reports. Alert on direct matches indicating a known malicious rule pattern."
                    },
                    {
                        "description": "Execution of PowerShell cmdlets (`New-InboxRule`, `Set-InboxRule`) to create or modify email inbox rules, particularly by non-administrative users or outside of typical change windows.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) for parent processes like `powershell.exe` with command-line arguments containing `New-InboxRule` or `Set-InboxRule`. Concurrently, monitor Windows Event ID 4104 (PowerShell Script Block Logging) for the full script blocks. Correlate these events with user account information; flag executions by non-administrative users, service accounts not designated for this, or at unusual times (e.g., outside business hours, weekends). Use descriptive statistics (e.g., frequency counts, median time) to establish baseline rule creation activity per user/host and identify significant deviations or spikes using percentile analysis."
                    },
                    {
                        "description": "Creation or modification of organization-wide email transport rules (e.g., via Exchange Management Shell cmdlets `New-TransportRule` or `Set-TransportRule`) with conditions potentially hiding or diverting security-related emails.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Servers (e.g.",
                            "Exchange Servers)"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On Microsoft Exchange servers, monitor Windows Event ID 4688 and 4104 for execution of Exchange Management Shell cmdlets such as `New-TransportRule`, `Set-TransportRule`, `Enable-TransportRule`. Analyze the rule parameters for conditions targeting generic sensitive keywords (e.g., 'security', 'alert', 'incident', 'phishing', 'suspicious', 'password') or specific sender/recipients (e.g., IT security team). Investigate rules with actions like 'DeleteMessage', 'StopRuleProcessing', or 'RedirectMessage' to external or unexpected internal mailboxes. Correlate rule creations/modifications with administrative logon events and change management records to identify unauthorized or suspicious transport rule changes."
                    },
                    {
                        "description": "Email rules created or modified via PowerShell to filter messages based on generic suspicious keywords (e.g., 'malware,' 'phishing,' 'warning,' 'invoice') and perform hiding actions like moving to obscure folders or deleting.",
                        "data_sources": [
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Search Windows Event ID 4104 (PowerShell Script Block Logging) for `New-InboxRule` or `Set-InboxRule` commands. Analyze rule parameters such as `-SubjectContainsWords`, `-BodyContainsWords`, `-Keywords`, or `-SenderAddressContainsWords` for a predefined list of generic suspicious terms frequently used in malicious campaigns or to evade detection. Check for associated actions like `-DeleteMessage $true` or `-MoveToFolder` targeting non-standard or less visible folders (e.g., 'RSS Feeds', 'Junk Email', 'Notes', 'Conversation History', or custom-named obscure folders). Use frequency analysis of targeted keywords and destination folders across all rule creations to identify common malicious patterns. Investigate rules with high behavioral risk scores based on keyword count and action severity."
                    },
                    {
                        "description": "Anomalous network activity or data staging behavior observed from a user's host shortly after the creation or modification of an email hiding rule, potentially indicating facilitated C2 or exfiltration.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 5156",
                            "Windows Event ID 4104",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate the timestamp of email rule creation/modification events (identified from Windows Event ID 4104 or 4688 for PowerShell rule cmdlets) with subsequent network connections (from Zeek conn.log or Windows Event ID 5156 for network connection events) originating from the affected user's host. Specifically look for connections to new or low-reputation external IP addresses/domains, use of unusual protocols or ports, or significant outbound data transfers that deviate from the user's baseline network behavior. Use time series analysis on network traffic volume (bytes out, connection counts) from the host in the hours following a rule change to detect statistically significant deviations from established patterns."
                    },
                    {
                        "description": "Modification of local email client configuration files or rule storage locations by unexpected processes or occurring outside of normal email client operations.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "If file system auditing is enabled, monitor Windows Event ID 4663 (Object Access Attempt with write/delete permissions) for operations targeting known email client rule files (e.g., Outlook's .rwz files for some configurations, or specific registry keys related to rules) or general mailbox data files (e.g., .pst, .ost if rules are embedded). Correlate these file access events (4663) with the initiating process (identified via Process ID in 4663, cross-referenced with Windows Event ID 4688 Process Creation details). Establish a baseline of legitimate processes (e.g., `outlook.exe`, legitimate backup software) that modify these files/locations and alert on modifications by any other processes (e.g., `cmd.exe`, `cscript.exe`, `wscript.exe`, `powershell.exe` outside of known admin scripts, or unrecognized executables). Use entropy measures on the names of processes modifying these files over time to spot anomalies."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
