[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by creating hidden user accounts?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1564.002",
                "name": "Hidden Users",
                "evidence": [
                    {
                        "description": "Creation of a user account with a name matching known malicious patterns or threat intelligence indicators.",
                        "data_sources": [
                            "Windows Event ID 4720"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4720 (A user account was created) across all endpoints and servers. Compare the 'Target User Name' field against a maintained list of suspicious or known-bad usernames derived from threat intelligence, malware analysis, or common penetration testing tools (e.g., 'support_388945a', 'sysadmin$', default Metasploit usernames). Use simple string matching or regular expressions for this comparison and alert on any matches."
                    },
                    {
                        "description": "Direct modification of the Windows Registry 'SpecialAccounts\\UserList' key to hide a user account from the login screen and user enumeration tools.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor for registry write access (Windows Event ID 4657: A registry value was modified) targeting `HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList`. Alert on any process that creates a new subkey under this path or sets a DWORD value to `0`. Correlate with the creating process information from Event ID 4688 to analyze its legitimacy, parent process, and command line. Use frequency analysis to identify processes that rarely perform this action as potential outliers."
                    },
                    {
                        "description": "Execution of specific commands on macOS/Linux systems to hide a user, or the creation of new accounts with low-numbered UserIDs (<500).",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation logs with command-line auditing (forwarded to a central SIEM, represented here by Windows Event ID 4688). Create patterns to detect commands like `dscl . -create /Users/[username] IsHidden 1` or `chflags hidden /Users/[username]` on macOS, or `gsettings set org.gnome.login-screen 'disable-user-list=true'` on Linux. Separately, monitor for the creation of new user accounts with UserIDs less than 500 (or 1000 on some Linux distros), as these are typically reserved for system accounts and often hidden by default from UI."
                    },
                    {
                        "description": "A sequence of events where a new user account is created and, within a short time window, is subsequently hidden via registry modification or command-line execution.",
                        "data_sources": [
                            "Windows Event ID 4720",
                            "Windows Event ID 4657",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Implement a correlation rule that triggers when a user creation event (Windows Event ID 4720) for a specific username on a host is followed by a hiding action for the same username on the same host within a short timeframe (e.g., under 5 minutes). Hiding actions include registry modifications to `SpecialAccounts\\UserList` (Event ID 4657) or command-line executions (Event ID 4688) containing hiding syntax. Use time series analysis or stateful correlation logic to detect this specific sequence of events, which is a strong indicator of malicious intent."
                    },
                    {
                        "description": "Discrepancy identified between user accounts generating authentication or activity logs and the official list of known, non-hidden users on a system.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4672",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Periodically generate a list of all user accounts on critical systems via administrative tools and compare this against the `SpecialAccounts\\UserList` registry key to identify explicitly hidden accounts. Cross-reference this list of hidden users against recent authentication logs (Windows Event ID 4624, especially Logon Types 2, 3, 10) and privileged operations logs (Windows Event ID 4672). Alert on any activity from an account that is confirmed to be hidden. Use correlation analysis to link hidden user activity to suspicious network connections (Zeek conn.log) or other anomalous behaviors."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
