[
    {
        "information_requirement": "Is the adversary developing or obtaining capabilities to support their operation?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1588",
                "name": "Obtain Capabilities",
                "evidence": [
                    {
                        "description": "Network connections to or from internal systems involving IPs, domains, or file hashes known to be associated with malware distribution, tool repositories, or criminal marketplaces.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek file.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join network connection logs (Zeek conn.log) and file transfer logs (Zeek file.log) with high-confidence threat intelligence feeds identifying malicious IPs/domains (e.g., malware distribution sites, known C2) and file hashes of known malicious tools or malware. Alert on any matches and investigate the internal source/destination for staging activity."
                    },
                    {
                        "description": "Execution of processes or observation of files with names, command-line arguments, or internal characteristics matching known adversarial tools or malware-as-a-service families.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek file.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process names and command-line arguments matching signatures of known adversarial tools (e.g., Cobalt Strike, Metasploit) or staging techniques (e.g., 'certutil -urlcache -split -f'). Use frequency analysis to identify rare process executions. For files transferred over the network (Zeek file.log), use YARA rules or file analysis to detect specific patterns, compiler artifacts, or watermarks associated with known malware families or toolkits."
                    },
                    {
                        "description": "Use of SSL/TLS or code-signing certificates with patterns indicating malicious acquisition, such as being newly issued, self-signed with suspicious attributes, or associated with known malicious certificate issuers.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek x509.log",
                            "Windows Event ID 4690"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek ssl.log and x509.log for SSL/TLS certificates. Analyze certificate attributes for suspicious patterns: very recent 'validity.not_before' dates, issuers known to be abused, subjects mimicking legitimate services (e.g., 'Microsaft'), or attributes matching default configurations of C2 frameworks. Use time series analysis to detect unusual spikes in the observation of new or self-signed certificates. Cross-reference certificate serial numbers and thumbprints against CTI feeds."
                    },
                    {
                        "description": "A sequence of events indicating the staging of a new capability, such as a file download from a low-reputation domain followed by process execution from a non-standard directory and subsequent network beaconing.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek file.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate multiple data sources to detect a behavioral chain of events. For example: 1) A download of an executable file (Zeek file.log) from an external IP with low reputation (Zeek conn.log). 2) The executable is written to a temporary or user-writable directory (e.g., AppData, Temp, Downloads). 3) A new process is created from that location (Windows Event ID 4688). 4) The new process initiates outbound network connections with a regular interval indicative of beaconing (Zeek conn.log). Use correlation analysis on hostname, user, and timestamps within a short window (e.g., 5-10 minutes) to link these disparate events into a single high-confidence alert."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
