[
    {
        "information_requirement": "Is the adversary developing resources using serverless functions?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1583.007",
                "name": "Serverless",
                "evidence": [
                    {
                        "description": "Internal systems communicating with serverless endpoint domains/IPs explicitly listed in high-confidence threat intelligence feeds as malicious C2, exfiltration points, or adversary-controlled infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log and dns.log for connections or DNS queries to domains or subdomains associated with serverless platforms (e.g., *.cloudflareworkers.com, *.lambda-url.*.on.aws, script.google.com/*). Inner join destination FQDNs and IPs against a frequently updated, high-confidence threat intelligence feed identifying known malicious serverless infrastructure. Alert on any matches and investigate associated internal systems. Use correlation analysis to link DNS queries to subsequent network connections."
                    },
                    {
                        "description": "Execution of cloud CLI commands or scripts known to be used for deploying malicious serverless functions, or connections to serverless URLs matching specific patterns associated with known adversary campaigns.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek http.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On endpoints and servers, monitor Windows Event ID 4688 for execution of cloud CLI tools (e.g., `aws.exe`, `gcloud.cmd`, `wrangler.exe`, `az.cmd`) with command-line arguments or script names (e.g., specific function names, runtime configurations, trigger settings like HTTP endpoints for anonymous access) matching known malicious serverless deployment TTPs. Maintain a library of these patterns. Analyze Zeek http.log and dns.log for outbound connections to serverless function URLs (e.g., `*.lambda-url.*.on.aws`, `*.workers.dev`, `script.google.com/macros/s/.../exec`) that match regular expressions derived from threat intelligence on specific adversary campaigns or toolkits using serverless infrastructure."
                    },
                    {
                        "description": "Anomalous or unauthorized access from internal systems to serverless platform management interfaces (consoles or APIs), especially if followed by the creation/modification of serverless functions and subsequent connections to these new function URLs.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Windows Event ID 4688",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log and conn.log for internal systems accessing serverless provider management domains/IPs (e.g., console.aws.amazon.com, dash.cloudflare.com). Correlate with Windows Event ID 4624 to identify user accounts performing these actions, flagging unauthorized or unusual account usage based on roles or historical activity. Look for subsequent execution of cloud CLI tools (Windows Event ID 4688) performing deployment actions (e.g., 'deploy', 'publish', 'create-function'). If cloud provider audit logs are ingested, directly monitor for function creation/modification events from unexpected sources. Use time series analysis to detect connections to newly active serverless function URLs shortly after inferred deployment activity originating from the same internal source."
                    },
                    {
                        "description": "Consistent, low-volume, periodic outbound connections (beaconing) from one or more internal systems to specific serverless endpoints, especially if these endpoints are newly observed or uncommon across the organization.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log and dns.log for outbound connections to domains characteristic of serverless platforms (e.g., *.workers.dev, *.lambda-url.*.on.aws, script.google.com). For each internal host, identify destination serverless endpoints and analyze connection patterns for periodicity (e.g., connections every X minutes/hours with similar byte counts) using time series analysis (e.g., autocorrelation, Fourier transforms to find dominant frequencies) and descriptive statistics (e.g., median byte count, standard deviation of intervals). Calculate entropy of destination serverless endpoints per internal host and connection intervals; low destination entropy with highly regular timing is suspicious. Prioritize alerts for newly registered or rarely seen serverless domains acting as C2 infrastructure."
                    },
                    {
                        "description": "Unusual data transfer volumes or non-standard communication patterns in traffic between internal systems and serverless endpoints, deviating from baselines of legitimate cloud service usage.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish baselines for typical data volume, session duration, and request/response sizes for legitimate internal traffic to known serverless platforms using historical Zeek conn.log and http.log data. Monitor for significant deviations (e.g., >3 standard deviations or outside 95th percentile) from these baselines using statistical methods like IQR or Z-scores. For connections to serverless endpoints, analyze payload sizes and frequency; unusually large or frequent small data chunks might indicate exfiltration or C2. Use linear regression to detect abnormal trends in data volume sent to serverless endpoints over time. Investigate traffic with unusually high entropy in HTTP request parameters if interacting with serverless APIs, or conversely, very low entropy in data transfers that might represent encoded C2 communications."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
