[
    {
        "information_requirement": "Is the adversary developing resources related to digital certificates for operations?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1587.003",
                "name": "Digital Certificates",
                "evidence": [
                    {
                        "description": "Network communication involves digital certificates (by hash/serial) or issuers known to be malicious from threat intelligence feeds.",
                        "data_sources": [
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously ingest Zeek ssl.log data. For each observed certificate, compare its SHA1 hash, serial number, and issuer's common name/hash against high-confidence threat intelligence feeds (e.g., blocklists of known malicious C2 certificates or compromised/malicious CAs). Generate a high-priority alert for any exact match."
                    },
                    {
                        "description": "Use of digital certificates with common adversarial patterns, such as typosquatted domains in subject names, certificates from free CAs on newly observed domains, or self-signed certificates on external services.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Parse subject common names (CN) and subject alternative names (SAN) from Zeek ssl.log. Use regular expressions and Levenshtein distance algorithms to detect potential typosquatting of internal or high-value external domains. Systematically flag all self-signed certificates (`issuer` == `subject`) for investigation. Correlate certificates issued by free CAs (e.g., Let's Encrypt) with domain reputation or first-seen timestamps from passive DNS (Zeek dns.log); flag their use on domains observed for the first time or with low reputation."
                    },
                    {
                        "description": "Observed digital certificates exhibit statistical anomalies in their attributes (e.g., high-entropy subject fields, unusual validity periods) compared to a baseline of legitimate certificates seen on the network.",
                        "data_sources": [
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a statistical baseline of certificate properties from historical Zeek ssl.log data. For each new certificate, calculate metrics such as: Shannon entropy of the subject common name (to detect DGA-like names), and validity period duration. Use statistical methods like the Inter-Quartile Range (IQR) to create box-plots of these metrics and identify outliers that deviate significantly from the established norm (e.g., validity period of <10 days, unusually high entropy in subject fields). Flag these anomalous certificates for review."
                    },
                    {
                        "description": "A single non-standard certificate (e.g., self-signed, statistically anomalous) is reused across multiple, disparate external IP addresses or domains communicating with the network.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify non-standard certificates (self-signed, short validity, or those flagged by other behavioral analytics). For each unique certificate SHA1 hash, create a list of all server IP addresses and SNI domain names that have presented it over time, using correlated Zeek conn.log and ssl.log data. Use frequency analysis to count the number of unique IPs/domains associated with each certificate. Flag certificates seen across a threshold of disparate systems (e.g., >3 IPs in different /24 subnets) as likely part of an adversary's shared C2 infrastructure."
                    },
                    {
                        "description": "Connections are established using a digital certificate from a newly registered domain, especially when the certificate itself is also newly issued.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From Zeek ssl.log, extract the certificate's 'not_valid_before' date and the SNI domain name. Correlate the domain with passive DNS data (from Zeek dns.log or other feeds) to determine the domain's 'first seen' date. Use time series analysis or a simple scoring model where risk increases as the time delta between the domain's first-seen date and the certificate's issue date decreases. Prioritize alerts for connections to domains that were first observed and issued a certificate within the last 30 days."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
