[
    {
        "information_requirement": "Is the adversary developing resources, such as Virtual Private Servers, for use in operations?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1583.003",
                "name": "Virtual Private Server",
                "evidence": [
                    {
                        "description": "Outbound connections to IP addresses, domains, or SSL/TLS certificates known to be part of adversary-controlled VPS infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek ssl.log",
                            "Zeek x509.log",
                            "Threat Intelligence Feed"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join network connection logs (Zeek conn.log), DNS queries (Zeek dns.log), and SSL/TLS certificate details (Zeek ssl.log, Zeek x509.log) against high-confidence, frequently updated (e.g., hourly) cyber threat intelligence (CTI) feeds that specifically identify malicious VPS provider IPs, adversary-registered domains, and known malicious certificate hashes or fingerprints. Alert on any match and investigate the internal source of the connection."
                    },
                    {
                        "description": "Outbound connections exhibiting network artifacts associated with known C2 frameworks or malicious tools commonly hosted on VPS infrastructure, such as specific service banners or SSL/TLS fingerprints (JA3/JA3S).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for specific service banners returned on non-standard ports that are indicative of known C2 frameworks (e.g., Cobalt Strike, Metasploit, Sliver). Analyze Zeek ssl.log to extract JA3 (client) and JA3S (server) hashes from outbound connections. Correlate these hashes against a maintained list of fingerprints associated with known malicious tools. Use regular expression matching for banners and a lookup table for JA3/JA3S hashes to identify patterns of malicious tool usage."
                    },
                    {
                        "description": "Outbound connections to domains with suspicious characteristics, such as very recent registration dates, low reputation, high entropy, or association with dynamic DNS services often used for VPS C2.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dns.log to extract all queried domains. Enrich this data with WHOIS information (to get registration date), passive DNS history, and domain reputation scores. Use descriptive statistics to find outlier domains based on age (e.g., registered < 30 days ago) that are receiving connections from internal hosts. Use time series analysis to detect a sudden spike in connections to a newly registered domain. Flag connections to domains with high entropy in their naming structure or those hosted on dynamic DNS providers commonly abused by adversaries."
                    },
                    {
                        "description": "Outbound network traffic exhibiting C2-like communication patterns, such as regular 'heartbeat' intervals, unusual data transfer volumes, or connections over non-standard ports to IP ranges associated with VPS hosting providers.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for all outbound connections. For each destination IP, analyze the timing between connections from the same source to detect periodic beaconing using time series analysis or autocorrelation. Profile typical data volume per session and use Inter-Quartile Range (IQR) or Z-scores to identify outliers (e.g., very small, consistent packet sizes for beacons, or unusually large transfers for exfiltration). Correlate destination IPs with known VPS hosting provider IP ranges and flag connections on non-standard ports to these ranges using frequency analysis."
                    },
                    {
                        "description": "Outbound connections to services using anomalous SSL/TLS certificates, such as those that are self-signed, have a short validity period, or use free certificate authorities in conjunction with other suspicious domain characteristics.",
                        "data_sources": [
                            "Zeek x509.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek x509.log to profile all observed SSL/TLS certificates for outbound connections. Identify certificates that are self-signed, have unusually short validity periods (e.g., < 90 days), or are issued by free Certificate Authorities (e.g., Let's Encrypt, ZeroSSL). Use correlation analysis to increase fidelity by flagging certificates that possess these attributes AND are associated with domains that are newly registered or have a low reputation score. Calculate the entropy of certificate subjects or issuers across the network; a low entropy may indicate a single adversary campaign using a custom or single-sourced CA."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
