[
    {
        "information_requirement": "Is the adversary leveraging externally acquired Virtual Private Servers (VPS) for operations directed against the network?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1584.003",
                "name": "Virtual Private Server",
                "evidence": [
                    {
                        "description": "Outbound network connections from internal systems to IPs, domains, or SSL/TLS certificates known to be associated with adversary C2 infrastructure hosted on VPS providers.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate Zeek logs (conn.log for destination IPs, dns.log for queried domains, ssl.log for server certificate details like issuer/subject and JA3 hash) against high-confidence threat intelligence feeds. Specifically filter for indicators tagged as 'C2', 'VPS', or associated with specific actor-controlled infrastructure. Alert on any matches originating from internal hosts and investigate the associated process and user."
                    },
                    {
                        "description": "Network traffic matching signatures of known C2 frameworks (e.g., specific URI structures, User-Agents, JA3/JA3S hashes) directed towards IP addresses within known VPS provider ranges.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan Zeek http.log traffic destined for IP addresses within VPS provider ranges for known malicious User-Agents, URI patterns, and POST request structures associated with popular C2 frameworks. Analyze Zeek ssl.log for TLS connections to VPS providers using JA3 or JA3S hashes that match known C2 tooling. Maintain and regularly update these C2 signatures and hashes."
                    },
                    {
                        "description": "Execution of cloud or infrastructure management tools (e.g., aws-cli, az, gcloud, kubectl, terraform) on non-administrative endpoints to interact with non-corporate VPS/cloud environments.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation of known cloud/infrastructure CLI tools. Establish a baseline of authorized users and systems for these tools and flag executions on unauthorized systems (e.g., standard user workstations). Analyze command-line arguments for target endpoints and use correlation analysis to link the process execution with corresponding outbound network traffic in Zeek conn.log to non-corporate IP ranges belonging to VPS/cloud providers."
                    },
                    {
                        "description": "Anomalous DNS query patterns for domains hosted on VPS infrastructure, such as queries for newly registered domains (NRDs), dynamic DNS (DDNS) domains, or domains with unusually low query counts across the enterprise.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dns.log data, correlating resolved IPs with known VPS provider IP ranges. Identify internal clients querying for domains registered within the last 30-60 days (NRDs) or belonging to known DDNS providers. Calculate the entropy and frequency of queried domains per client; an increase in queries to rare or new domains hosted on VPSs is suspicious. Use linear regression to model expected DNS query behavior per host and detect anomalous deviations."
                    },
                    {
                        "description": "Outbound connections to IP addresses in VPS provider ranges exhibiting C2-like characteristics, such as regular beaconing, long-lived sessions with low data transfer, or unusual data transfer volumes.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Zeek conn.log for all outbound connections to known VPS provider IP ranges. For each internal source host, analyze the connection patterns to these destinations. Use time series analysis to detect periodic, fixed-interval connections (beaconing). Profile session durations and bytes transferred; flag connections that are unusually long with minimal traffic (heartbeats) or involve large data spikes inconsistent with user activity (exfiltration). Use descriptive statistics (mean, median, standard deviation) to baseline traffic to these ranges and use Inter-Quartile Range (IQR) or Z-scores to find significant outliers."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
