[
    {
        "information_requirement": "Has newly developed or uniquely modified malware been executed on the network?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution, relating to T1587.001",
        "indicators": [
            {
                "technique_id": "T1587.001",
                "name": "Malware",
                "evidence": [
                    {
                        "description": "Execution of an executable file with no known reputation, a recent compilation timestamp, or signed by an untrusted publisher.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for new process creations, especially from temporary or user-writable locations. Extract the file hash (SHA256) of the executable and query threat intelligence platforms (e.g., VirusTotal) via API. Flag any executable hash that has zero positive detections or was first seen within the last 48 hours. Separately, check the digital signature status of all executed processes and alert on processes that are unsigned or signed by a publisher not on an approved allow list. Use descriptive statistics to find rare publishers in the environment."
                    },
                    {
                        "description": "Execution of a process with high file entropy that is subsequently followed by the creation of a new persistence mechanism (e.g., scheduled task, new service).",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For newly observed executables identified via Windows Event ID 4688, calculate the file's entropy; flag files with entropy values above a set threshold (e.g., >7.2), which often indicates packing or encryption. Correlate the execution of a high-entropy/unknown executable with subsequent follow-on actions within a short time window (e.g., 5-10 minutes) that create persistence, such as process creations for `schtasks.exe`, `sc.exe`, or `reg.exe` modifying Run keys. This sequence pattern is a strong indicator of a malicious dropper or installer."
                    },
                    {
                        "description": "An unknown or unsigned process initiating suspicious network connections, followed by host-based reconnaissance and attempts to access sensitive data or credentials.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Use correlation analysis to link host and network events. Identify a new process starting (Windows Event ID 4688) that is not digitally signed or is signed by a rare/untrusted publisher. Track the subsequent network activity initiated by this process's host using Zeek conn.log. Flag behavioral sequences where the host: 1) beacons to an external IP with a low-reputation or newly-registered domain, 2) executes reconnaissance commands (`whoami`, `ipconfig`, `net user`, `systeminfo`), and 3) attempts to access sensitive file shares or credential stores (e.g., LSASS memory). Link these discrete events using a common host identifier and a defined time window (e.g., 30 minutes) to create a single high-fidelity alert."
                    },
                    {
                        "description": "A process establishing command and control (C2) communications using non-standard protocols, unusual ports, or by tunneling C2 traffic over common protocols like DNS.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for connections on non-standard port/protocol combinations (e.g., non-HTTP traffic over port 80/443, any persistent traffic over high ephemeral ports). Monitor Zeek dns.log for behavioral indicators of DNS tunneling, such as unusually long DNS queries or high volumes of TXT/AAAA record requests to a single domain. Use statistical analysis (e.g., time series analysis, IQR on query length and request frequency) to detect outliers against a baseline of normal DNS traffic. Correlate the internal source host of such traffic with the execution of any unknown or suspicious processes on that host."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
