[
    {
        "information_requirement": "Is the adversary developing resources for operations, specifically DNS infrastructure?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1583.002",
                "name": "DNS Server",
                "evidence": [
                    {
                        "description": "Internal hosts resolving domains or using DNS servers that are present on threat intelligence feeds specifically tracking adversary-developed infrastructure.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate all queried domains and the IP addresses of responding DNS servers from Zeek dns.log against high-confidence, continuously updated threat intelligence feeds that specifically identify newly registered malicious domains, known adversary-controlled DNS server IPs, or domains associated with DNS infrastructure compromise campaigns. An inner join between log data and the threat feed should trigger an immediate alert for investigation."
                    },
                    {
                        "description": "Internal hosts querying for domains that exhibit patterns of typographical manipulation (typosquatting, bitsquatting, homoglyphs) of legitimate corporate or partner domains.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a monitored list of high-value internal, brand, and partner domains. Ingest all queried domains from Zeek dns.log. Use string similarity algorithms (e.g., Levenshtein distance, Damerau-Levenshtein distance) and homoglyph mapping tools to detect typographical variations between queried domains and the monitored list. Score potential matches and investigate high-probability typosquatted domains, correlating with domain age and reputation data to confirm malicious intent."
                    },
                    {
                        "description": "An internal host is the first in the organization to query a very recently registered domain (e.g., registered < 30 days ago) that also has suspicious DNS record characteristics.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze all unique domains from Zeek dns.log, using time series analysis to identify the exact time a domain is first seen across the enterprise. Enrich newly seen domains with external data (e.g., WHOIS for registration date, passive DNS for record details). Create a risk score for domains based on a combination of factors: age (e.g., < 30 days), low DNS record TTL (< 300 seconds), lack of standard records (MX, SPF, DMARC), and hosting on non-standard cloud providers or residential IP space. Use linear regression to model risk and alert on internal hosts that are 'patient zero' for querying high-risk, newly developed domains."
                    },
                    {
                        "description": "Multiple, distinct, and very recently registered domains are being queried by internal hosts and resolve to the same IP address or a small, contiguous IP range, indicating shared adversary infrastructure.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From Zeek dns.log, extract all (queried domain, resolved IP) pairs. Enrich the domains with registration date information. Filter this dataset to include only domains registered within the last 60 days. Group these young domains by their resolved IP address. Use frequency analysis to identify IP addresses that host an unusually high number of unrelated, newly registered domains (e.g., > 3 domains). Use correlation analysis to investigate the internal hosts querying domains that are part of these clusters, as this pattern strongly suggests an adversary has developed multiple domains on a single piece of infrastructure for an upcoming campaign."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
