[
    {
        "information_requirement": "Is the adversary conducting reconnaissance against the organization using passive DNS?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1596.001",
                "name": "DNS-Passive DNS",
                "evidence": [
                    {
                        "description": "DNS queries originating from IP addresses known for malicious reconnaissance activity or querying for subdomains/hostnames associated with known adversary infrastructure staging related to the organization.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate source IP addresses of DNS queries in Zeek dns.log against a continuously updated, high-confidence cyber threat intelligence (CTI) feed of IPs known for reconnaissance, malicious scanning, or hosting C2 infrastructure. Additionally, monitor queries for subdomains that match patterns used by adversaries for C2 or phishing related to the organization's domain, if such patterns are known from CTI. Alert on matches from high-reputation CTI sources or repeated queries for suspicious patterns and investigate associated activity."
                    },
                    {
                        "description": "DNS queries exhibiting patterns characteristic of specific reconnaissance tools or techniques, such as enumeration of common service discovery records (e.g., _gc._tcp, _ldap._tcp, _kerberos._tcp), or attempts to trigger DNS Rebinding vulnerabilities through specific query sequences.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dns.log for queries matching known patterns used by reconnaissance tools (e.g., DNSenum, Fierce, Sublist3r specific query structures or user-agents if available in DNS extensions). Monitor for systematic enumeration of service (SRV) records for common enterprise services like `_gc._tcp`, `_ldap._tcp`, `_kerberos._tcp`, `_sip._tls`, etc., especially from external sources. Also, identify patterns indicative of DNS Rebinding attempts, such as multiple rapid A record queries for the same FQDN from an external source, where the FQDN has a very short TTL and resolves to different IP addresses, particularly if one is internal. Maintain and update a list of such tool signatures and query patterns. Use correlation analysis for sequences of suspicious queries."
                    },
                    {
                        "description": "Direct attempts from external sources to perform DNS zone transfers (AXFR/IXFR) or query for 'ANY' record type against the organization's authoritative name servers.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Specifically filter Zeek dns.log for DNS queries with qtype AXFR, IXFR, or ANY originating from external IP addresses and targeting the organization's authoritative name servers. Such queries are highly indicative of reconnaissance attempts to dump all DNS records. Alert immediately on any confirmed zone transfer attempts (AXFR/IXFR) from unauthorized external sources. Track the frequency of ANY queries from external sources using descriptive statistics and flag sources making repeated or excessive ANY query attempts, as this can also be used for reconnaissance."
                    },
                    {
                        "description": "Anomalous pattern of DNS queries from a single external source targeting a large number of distinct, potentially non-existent or obscure organizational subdomains, indicating broad scanning or enumeration attempts.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log for external source IPs generating a high ratio of queries to unique subdomains of the organization's domains, particularly if a significant percentage of these queries result in NXDOMAIN responses. Establish baselines for typical query diversity and NXDOMAIN rates per source IP. Use entropy measures on the queried FQDNs (specifically the subdomain part) per source IP over a defined time window (e.g., 5 minutes, 1 hour). A high entropy value, combined with a high volume of queries or a high NXDOMAIN rate from a single source, strongly indicates scanning or brute-force enumeration. Correlate these findings with queries for rarely accessed subdomains identified through long-term frequency analysis of successful queries."
                    },
                    {
                        "description": "Sudden unexplained surge in overall DNS query volume for the organization's domains, or specifically for sensitive record types (MX, TXT, SPF, DMARC, DKIM), from multiple disparate external sources not attributable to legitimate campaigns.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish dynamic baselines for overall DNS query volume and query rates for specific critical record types (A, AAAA, MX, TXT, SRV, SPF, DMARC, DKIM, CNAME) targeting organizational domains, segmented by internal vs. external sources. Use time series analysis (e.g., ARIMA, Holt-Winters, or simpler moving average comparisons with standard deviations) to detect statistically significant increases in query volume from external sources. Such surges, especially if correlated across multiple geographically diverse external sources or focused on sensitive record types that map infrastructure or security policies, should be investigated. Employ descriptive statistics on the distribution of querying IPs during such surges to differentiate legitimate high-traffic events (e.g., marketing campaigns) from potentially coordinated reconnaissance."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
