[
  {
    "information_requirement": "Has an adversary successfully elevated privileges on a mobile device by exploiting a software vulnerability? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1404",
        "name": "Exploitation for Privilege Escalation",
        "evidence": [
          {
            "description": "An MDM/UEM platform log event explicitly records a change in a device's integrity status. This is observed as a field like `isJailbroken` or `isRooted` changing from `false` to `true`, or a `complianceStatus` field transitioning to `non-compliant` with an associated reason code indicating `Rooting Detected` or `Device Integrity Compromise` [1].",
            "data_sources": [
              "MDM/UEM compliance logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM management servers, cloud management console, managed mobile devices (corporate and BYOD), enterprise network gateways, VPN concentrators, and DNS resolvers.",
            "action": [
              "Create a real-time SIEM correlation rule to generate a critical alert immediately upon ingestion of an MDM/UEM log where a device's `isJailbroken` or `isRooted` field value changes to `true` or the `complianceStatus` is `non-compliant` with a reason matching a device integrity failure.",
              "Upon alert, query the device's network logs (Zeek conn.log) for the 24 hours preceding the event. For each connection, calculate the rarity of the destination port and destination ASN compared to the device's 30-day baseline. Flag any connection where the destination port's frequency is below the 5th percentile for that device and the ASN is new for that device. A cumulative score exceeding a predefined threshold indicates suspicious precursor activity.",
              "Enrich the flagged network connections with JA3/JA3S hashes from Zeek ssl.log. Feed features including connection duration, bytes sent/received, protocol, destination port rarity score, and the JA3/JA3S hash into a pre-trained Isolation Forest anomaly detection model. Flag connections receiving a high anomaly score that occur within 60 minutes of the root/jailbreak detection event as a likely exploit delivery or C2 channel."
            ]
          },
          {
            "description": "A log from an MDM/UEM or Mobile Threat Protection (MTP) platform records the installation or execution of a mobile application whose attributes match a known malicious indicator. The match is identified by comparing the application's SHA256 file hash, package name (e.g., `com.exploit.pwn`), or code-signing certificate serial number against a curated threat intelligence feed.",
            "data_sources": [
              "MDM/UEM application inventory logs",
              "Mobile Threat Protection (MTP) agent logs",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices with MTP agents, MDM/UEM management console, integrated threat intelligence platforms, network egress points, and corporate Wi-Fi infrastructure.",
            "action": [
              "Implement a continuous SIEM rule that cross-references all application installation events from MDM/MTP logs against a threat intelligence database of malicious mobile application hashes, package names, and signing certificates. Trigger a high-severity alert on any match.",
              "For any device with a malicious app alert, analyze its DNS query history (Zeek dns.log) from the 24 hours prior to installation. Calculate the Shannon entropy of the queried FQDNs. Flag domains where the entropy score exceeds the 95th percentile for the device's peer group (e.g., all iOS devices in the marketing department) as potential DGA for C2. Additionally, calculate the ratio of NXDOMAIN responses to total queries for the device; a ratio exceeding 3 standard deviations from the device's 30-day moving average baseline indicates potential C2 beaconing failure.",
              "Analyze network sessions (Zeek http.log, ssl.log) associated with application downloads preceding the malicious app installation. Use a supervised classification model, such as a Random Forest, trained to identify malicious downloads. Features should include: User-Agent string, JA3/JA3S hash, the ratio of uppercase to lowercase characters in the URL path, SSL certificate validity period, and destination IP reputation score. A session classified as 'malicious' is the likely exploit delivery vector."
            ]
          },
          {
            "description": "A Mobile Threat Protection (MTP) agent log records a sequence of anomalous system-level events or API calls originating from a single, non-system application. This is observed as a process attempting to read or write to protected memory regions, making an unusually high frequency of privileged API calls, or spawning unexpected child processes like `su` or `sh`.",
            "data_sources": [
              "Mobile Threat Protection (MTP) process event logs",
              "Mobile Threat Protection (MTP) API call logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (corporate and BYOD) with MTP agents installed, Enterprise network gateways, DNS resolvers.",
            "action": [
              "Create a SIEM rule to generate a high-severity alert on any MTP log event where a non-system, user-installed application process is observed spawning a shell process (e.g., `su`, `sh`) or modifying critical system files outside of its designated container.",
              "For each process on a device, establish a baseline of normal API call frequency (e.g., calls per minute) and the types of calls made. Monitor for deviations where a process's API call rate exceeds the 99th percentile of its own historical baseline, or when it begins using API calls never before seen for that application. A significant deviation triggers an alert for analyst review.",
              "Utilize a sequence-based anomaly detection model, such as an LSTM autoencoder, trained on legitimate sequences of API calls for common, benign applications. Feed real-time API call sequences from MTP logs into the model. A high reconstruction error for a given sequence indicates it is anomalous and may represent a multi-stage exploit chain. Correlate this anomaly with suspicious network beaconing from the same device in Zeek conn.log."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]