[
  {
    "information_requirement": "Is an adversary using a compromised mobile device to move laterally within our internal network by exploiting remote services? (PIR)",
    "tactic_id": "TA0033",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1428",
        "name": "Exploitation of Remote Services",
        "evidence": [
          {
            "description": "A successful remote logon (Windows Event ID 4624 with Logon Type 3 or 10) occurs from a mobile device's IP address within 60 minutes after the same IP address performed network scanning. Scanning is defined as connecting to a number of unique internal hosts or ports that exceeds the 98th percentile of the established baseline for mobile devices within a 5-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Windows Event ID 4624",
              "VPN Access Logs",
              "DHCP Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Internal Wi-Fi Access Points, Core network switches, Domain Controllers, and high-value internal servers.",
            "action": [
              "Define a list of mobile device IP ranges by correlating VPN and internal Wi-Fi DHCP logs. Create a SIEM rule that triggers when Zeek's notice.log generates a Scan::Port_Scan or Scan::Address_Scan from an IP in this range. The rule's logic must then query for a successful Windows Event ID 4624 (Logon Type 3 or 10) from the same source IP to one of the scanned destinations within the subsequent 60 minutes. A match on both conditions generates a high-priority alert.",
              "Using Zeek conn.log, continuously calculate a 5-minute rolling count of unique destination IPs (id.resp_h) and unique destination ports (id.resp_p) for each source IP (id.orig_h) within the mobile device IP range. Establish a dynamic baseline distribution for these counts. Generate an alert when a device's count for either metric exceeds the 98th percentile of its historical baseline or the global baseline for all mobile devices. Further enrich the alert by calculating the Shannon entropy of the destination port set; a high entropy score combined with low orig_bytes per connection strongly indicates a port scan.",
              "For each mobile device IP, create 5-minute session windows and train an isolation forest model for unsupervised anomaly detection. Engineer features from Zeek conn.log including: count of unique id.resp_h, count of unique id.resp_p, Shannon entropy of id.resp_p, ratio of connection states (e.g., S1, SF vs. REJ, RSTO), total orig_bytes, and a binary flag for connections to known high-value assets. An anomaly score exceeding a predefined threshold indicates behavior deviating from its normal activity profile, such as scanning."
            ]
          },
          {
            "description": "A critical network-facing service process (e.g., svchost.exe hosting TermService, w3wp.exe for IIS, smbd for Samba) crashes (Windows Event ID 1000, Application Error) or terminates unexpectedly (Windows Event ID 7034, Service Control Manager). This event is temporally correlated, occurring within 60 seconds of an inbound network connection from a mobile device IP address, as recorded in Zeek conn.log.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 7034",
              "Windows Event ID 7031",
              "Zeek conn.log",
              "Zeek http.log",
              "VPN Access Logs",
              "DHCP Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application servers, database servers, and workstations hosting remote services (e.g., RDP, SMB, HTTP) accessible from the internal network.",
            "action": [
              "Create a SIEM alert that triggers on Windows Event ID 1000 (Application Error) or 7034 (Service Control Manager) where the Faulting application name or service name matches a predefined list of critical remote services (e.g., svchost.exe, w3wp.exe, lsass.exe, smbd, sqlservr.exe). The rule's response action must automatically query Zeek conn.log for connections to the affected host in the 60 seconds preceding the event. If a source IP from the mobile device range is found, escalate to a high-priority alert.",
              "For each critical service on each monitored server, establish a baseline crash frequency over a 30-day period using Windows Event IDs 1000 and 7034. Model this rare event data using a Poisson distribution. Trigger an alert if the observed number of crashes in a given hour is a statistically significant outlier (e.g., p-value < 0.01). Correlate this alert with Zeek conn.log data to check for a corresponding spike in connection attempts from the mobile IP range to the affected service port just before the crash.",
              "Train a supervised classifier (e.g., Random Forest) on historical crash events, labeled as 'benign' or 'exploit-induced' by analysts. Extract features from the network connection immediately preceding the crash from Zeek logs (conn.log, http.log, smb_files.log). Features should include: source IP reputation, protocol, total bytes, payload entropy, HTTP method, URI length, User-Agent string, and presence of known exploit patterns in the URI or SMB filename. Classify new crashes in real-time; a classification of 'exploit-induced' linked to a mobile-sourced connection generates a high-priority alert."
            ]
          },
          {
            "description": "A network-facing service process (e.g., w3wp.exe, httpd.exe, svchost.exe, sqlservr.exe), running in a non-interactive session, spawns a suspicious child process (e.g., cmd.exe, powershell.exe, rundll32.exe, whoami.exe, net.exe). This process creation event (Windows Event ID 4688) occurs within 5 seconds of an inbound network connection from a mobile device's IP address recorded in Zeek conn.log.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "VPN Access Logs",
              "DHCP Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web servers, application servers, and other systems running remotely accessible services.",
            "action": [
              "Implement a SIEM correlation rule that triggers on Windows Event ID 4688 where the ParentProcessName is a known network service (e.g., w3wp.exe, sqlservr.exe, nginx.exe) and the NewProcessName is a command-line interpreter or living-off-the-land binary (e.g., cmd.exe, powershell.exe, whoami.exe, net.exe, certutil.exe). The rule must then confirm an inbound network connection from a mobile device IP to the host in Zeek conn.log within the preceding 5 seconds to generate a critical alert.",
              "From at least 30 days of Windows Event ID 4688 logs, build a baseline of all observed parent-child process relationships, calculating the frequency of each pair. Generate an alert for any pair involving a network service parent that is rare or has never been seen before (e.g., frequency < 0.01%). Further risk-score the alert by analyzing the CommandLine field: calculate its character-level entropy, length, and ratio of non-alphanumeric characters. Escalate the alert if any of these metrics exceeds 3 standard deviations from the established baseline for that specific child process.",
              "Use a pre-trained NLP transformer model (e.g., a fine-tuned BERT) to classify command-line arguments from process creation events spawned by network services. The model should be trained on a large, labeled dataset of benign and malicious command lines. When a network service spawns a process immediately following a connection from a mobile device, pass the full CommandLine string to the model. A 'malicious' classification with a confidence score greater than 0.90 triggers a critical alert for immediate incident response."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]