[
  {
    "information_requirement": "Has an adversary compromised a user's corporate account access by performing a SIM swap? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful user authentication to a corporate service (e.g., VPN, O365, Cloud Console) is recorded within 4 hours of a Mobile Device Management (MDM) log that indicates a potential SIM swap event for the same user. A SIM swap event is defined as a log entry showing a change in the device's International Mobile Subscriber Identity (IMSI) or Integrated Circuit Card Identifier (ICCID), a 'SIM Not Present' status, or a sudden device unenrollment. The subsequent authentication event must also exhibit at least two anomalous characteristics from a user's established 90-day baseline, such as: 1) Source IP address from a country or ASN never before seen for that user. 2) A login timestamp that is more than 3 standard deviations from the user's mean login hour. 3) A user-agent string with a Jaccard similarity score below 0.5 when compared to the user's set of historical user-agents.",
            "data_sources": [
              "Windows Event ID 4624 (Logon Type 3, 8, 10)",
              "Zeek conn.log",
              "MDM logs (specifically entries for IMSI/ICCID change, SIM status, or device compliance status)",
              "Azure AD SignInLogs",
              "VPN authentication logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Domain Controllers, ADFS), Cloud Identity Provider Platforms (Azure AD, Okta), VPN Concentrators, MDM Servers, Internet Gateways",
            "action": "1. (Symbolic Logic) Create a SIEM correlation rule that joins MDM logs with authentication logs (Windows Event ID 4624, Azure AD SignInLogs) on the user_id field. The rule triggers a high-severity alert if an MDM log contains keywords like 'IMSI changed', 'ICCID changed', 'SIM not detected', or 'device unenrolled' for a user, AND within the subsequent 4 hours, a successful authentication for the same user_id is recorded from an IP address geolocated to a country outside the organization's normal operating regions or is present on a threat intelligence feed of known anonymizing services (e.g., Tor, commercial VPNs). Enrich the alert with the specific MDM log entry and the anomalous authentication details. 2. (Statistical Analysis) For each user, ingest authentication logs (Azure AD, VPN) and Zeek conn.log data into a user behavior profile updated nightly. This profile must contain: a set of historical source countries, a set of historical source ASNs, a set of historical user-agent strings, and the mean and standard deviation of login hour-of-day (calculated on a 90-day rolling window). For each new successful login, calculate a risk score: +3 for a new source country, +2 for a new source ASN, +1 for a login hour > 2 standard deviations from the mean. A cumulative score > 4 within a 24-hour period generates a medium-severity alert. If this statistical alert coincides with an MDM SIM-related event for the user within a 4-hour window, escalate the alert to critical severity. 3. (Machine Learning) For each user, develop a user-specific anomaly detection model using an Isolation Forest. The feature vector for each login event should include: hour_of_day_sin, hour_of_day_cos (sine/cosine transforms of the login hour), day_of_week, is_new_country (binary), is_new_asn (binary), and a TF-IDF vector representation of the user_agent string. Train the model on the user's last 90 days of login data. Score each new login in real-time. If the model returns an anomaly score in the top 1% for that user, cross-correlate this event with MDM logs. An ML-detected anomaly that occurs within 4 hours of a SIM-related event (IMSI/ICCID change, etc.) for that user constitutes a high-confidence alert for a potential account takeover, triggering an automated SOAR playbook for credential rotation and session termination."
          }
        ]
      },
      {
        "technique_id": "T1566",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user clicks a URL in an email that failed DMARC/SPF/DKIM checks or originated from a newly registered domain (<30 days old). The click is followed within 5 minutes by an HTTP POST request from the user's IP to the same domain, observed in Zeek http.log. The POST request body contains data in fields with names matching a predefined list of PII identifiers (e.g., 'ssn', 'dob', 'securityPin', 'motherMaidenName', 'mmn', 'accountNumber'), and the total size of the posted data exceeds a baseline threshold (e.g., > 1KB), indicating potential PII harvesting.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Email gateway logs (including header analysis for DMARC/SPF/DKIM results)",
              "Web proxy logs",
              "WHOIS data feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate email gateway, Enterprise DNS resolvers, Web proxies/Internet gateways, Endpoint devices",
            "action": "1. (Symbolic Logic) Create a SIEM rule that correlates email gateway logs with web proxy or Zeek logs. The rule triggers when: (a) an email gateway log shows a user clicked a link in an email where the sender's domain failed DMARC, SPF, or DKIM validation, AND (b) within 5 minutes, a Zeek http.log entry shows an HTTP POST from the user's source IP to the domain from the clicked link, AND (c) the post_body (if available via deep packet inspection) matches a regular expression for PII such as a Social Security Number (e.g., $$ \\d{3}-\\d{2}-\\d{4} $$). 2. (Statistical Analysis) Ingest Zeek dns.log data. For all queries to domains not on an organizational allow-list, calculate the Shannon entropy of the full query name. Flag domains with an entropy score in the top 5th percentile of all queries over a 24-hour period (potential DGA). Additionally, calculate the Levenshtein distance between the queried second-level domain and a list of high-value corporate and mobile carrier domains (e.g., 'verizon', 't-mobile', 'myworkplace'). Flag domains with a distance less than 3 (potential typosquatting). If a user's device queries a flagged domain and then makes an HTTP POST request to it, increase a risk score for that user. 3. (Machine Learning) Train a supervised classification model (e.g., XGBoost) on a labeled dataset of phishing and benign URLs. Engineer features for each URL, including: length of hostname, number of subdomains, presence of keywords like 'login' or 'verify', domain age (from WHOIS), TLS/SSL certificate details (issuer, age), and character-level n-gram frequencies of the path and query parameters. Deploy the model via an API that can be queried by the SIEM. For every clicked URL from an external email, query the model. If the model returns a phishing probability > 0.90, cross-reference with Zeek http.log. If an HTTP POST from that user to the malicious URL is observed within 5 minutes, generate a critical alert and trigger a playbook to investigate for PII loss."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]