[
  {
    "information_requirement": "Is an adversary leveraging legitimate external web services for one-way command and control against corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1481.003",
        "name": "One-Way Communication",
        "evidence": [
          {
            "description": "A corporate mobile device exhibits C2-like network beaconing behavior: connections to a single web service domain show extremely low timing jitter (standard deviation of inter-arrival time < 5s), consistently small outbound data payloads (95th percentile of orig_bytes < 1KB), and a high outbound-to-inbound byte ratio (>10:1). This pattern of automated, non-interactive communication is distinct from normal user browsing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators handling mobile device traffic, forward proxy servers, and network egress points (Internet gateways) where mobile device traffic is logged.",
            "action": "1. (Symbolic Logic) Using a SIEM, join Zeek dns.log (for the 'query' field) with ssl.log (for the 'server_name' field) on the 'uid' field. Generate an alert if the queried domain or SNI server_name from a mobile device's IP address matches a threat intelligence feed of known one-way C2 endpoints hosted on legitimate services (e.g., specific GitHub repositories, Pastebin user accounts, Telegram channels). 2. (Statistical Method) For each source mobile IP, aggregate Zeek conn.log data in 1-hour windows, grouping by destination server name (from ssl.log) and destination port. Calculate the standard deviation of inter-arrival time, the 95th percentile of outbound bytes ('orig_bytes'), and the ratio of total outbound to inbound bytes ('SUM(orig_bytes) / SUM(resp_bytes)'). Generate an alert if the standard deviation is < 5 seconds, the outbound byte percentile is < 1024, the byte ratio is > 10, the number of distinct destination ports is 1, and the total connection count is > 10. 3. (Machine Learning) Deploy a per-device time-series anomaly detection model (e.g., Isolation Forest or LSTM autoencoder) on features aggregated into 5-minute intervals from Zeek conn.log. Engineer features such as: connection count, total 'orig_bytes', total 'resp_bytes', 'orig_bytes'/'resp_bytes' ratio, standard deviation of inter-arrival times, entropy of destination IPs, and entropy of destination ports. An alert is triggered when the model's anomaly score for a time window exceeds a dynamically calculated threshold (e.g., 3 standard deviations above the mean error), indicating a significant deviation from the device's established communication baseline."
          },
          {
            "description": "A mobile device sends an HTTP/S request to a legitimate web service (e.g., a code repository or paste site) with characteristics of C2 data retrieval: the URI path has high Shannon entropy (> 3.5) or contains raw content keywords (e.g., '/raw/', '/blob/'), the HTTP method is unusual for the site (e.g., POST to a raw content URL), the Referer header is absent, and the server's response Content-Type (e.g., 'text/plain') is inconsistent with the site's typical interactive content (e.g., 'text/html').",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, and forward proxy servers that perform TLS inspection, providing visibility into HTTP headers and content for mobile device traffic.",
            "action": "1. (Symbolic Logic) In a SIEM with TLS-inspected Zeek http.log data, create a rule to flag requests from the mobile IP range to domains on a high-risk watchlist (e.g., 'pastebin.com', 'raw.githubusercontent.com', 'gist.github.com') where the URI path contains '/raw/', '/blob/', or matches a regex for long base64 encoded strings (e.g., '/[A-Za-z0-9+\\/]{20,}=*/'), and the HTTP method is GET. 2. (Statistical Method) For each mobile user/device, establish a baseline of normal activity per destination domain. Calculate the Shannon entropy of the 'uri' field and flag requests in the 99th percentile. Concurrently, track the frequency of User-Agent strings and HTTP methods. Generate a high-risk alert if a high-entropy URI request is accompanied by a rare User-Agent (<1% frequency), an unusual HTTP method for that user-destination pair (e.g., a POST where 99% of previous requests were GETs), and a missing Referer header. 3. (Machine Learning) Implement a supervised classification model (e.g., Gradient Boosting or Random Forest) to score each HTTP/S request from mobile devices. Train the model on labeled data using features from Zeek http.log and ssl.log including: URI length, URI Shannon entropy, number of query parameters, presence of raw content keywords in URI, User-Agent string entropy, JA3/JA3S hash, 'resp_mime_types' (one-hot encoded), HTTP method (one-hot encoded), and a binary feature for the presence/absence of a Referer header. The model's probability score (0.0-1.0) for 'malicious C2' is used to prioritize alerts for analyst review."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]