[
  {
    "information_requirement": "Is an adversary transferring malicious tools or files onto our managed mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1544",
        "name": "Ingress Tool Transfer",
        "evidence": [
          {
            "description": "A file download to a mobile device exhibits multiple risk factors simultaneously: a high-risk MIME type (e.g., 'application/vnd.android.package-archive', 'application/octet-stream'), a source domain with low reputation (e.g., registered less than 90 days ago), and a filename with high entropy, while the source domain is absent from an established allow-list of trusted providers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points capturing traffic from corporate-managed mobile devices, including VPN concentrators, corporate Wi-Fi access point controllers, and Mobile Threat Defense (MTD) platform traffic logs.",
            "action": [
              "For each HTTP request from a mobile device IP, join Zeek `http.log` and `dns.log` records on the `uid` field. Compare the destination `host` (from `http.log`) and the resolved IP address (`id.resp_h` from `conn.log`) against a threat intelligence feed of known C2 or file dropper domains/IPs. Generate a high-severity alert for any match.",
              "From `files.log`, filter for transfers to mobile device IP ranges. For each file, calculate filename Shannon entropy using the formula $$ H(X) = -\\sum_{i=1}^{n} p(x_i) \\log_2 p(x_i) $$. Create a composite risk score by adding weights for risk factors: filename entropy > 95th percentile (+1), source domain age < 90 days (via WHOIS enrichment) (+1), source domain not on allow-list (+1), and MIME type in `files.log` is 'application/vnd.android.package-archive' or 'application/octet-stream' (+2). Flag transfers with a score of 3 or more for review.",
              "Train an Isolation Forest anomaly detection model on a feature set from known-good file downloads, using `ssl.log` and `conn.log`. Features must include JA3/JA3S hash, TLS version, selected cipher suite, connection duration, and `resp_bytes`. Apply the model to new file transfers identified in `files.log`. If the model flags the event as an anomaly, create an alert enriched with the anomalous features for investigation."
            ]
          },
          {
            "description": "A single network connection to a mobile device transfers a statistically anomalous volume of data, where the total response bytes (`resp_bytes`) significantly exceed the device's historical baseline or that of its peer group, and the destination domain is not an approved service for large transfers like app stores or cloud backup.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points capturing traffic from corporate-managed mobile devices, including VPN concentrators, corporate Wi-Fi access point controllers, and Mobile Threat Defense (MTD) platform traffic logs.",
            "action": [
              "For each connection in `conn.log` from a mobile device IP, trigger an alert if `resp_bytes` exceeds a hard threshold (e.g., 100MB). If the destination IP, resolved via `dns.log`, is not on a pre-defined allow-list of approved large file transfer services (e.g., App Store, Google Play, corporate cloud storage), escalate the alert to high-severity.",
              "Group mobile devices by role or department. For each group, calculate the 30-day mean ($$ \\mu $$) and standard deviation ($$ \\sigma $$) of daily download volume per device by summing `resp_bytes` from `conn.log`. For each device, calculate a daily Z-score where $$ Z = (x - \\mu) / \\sigma $$. Flag any device where $$ |Z| > 3 $$ as a statistical outlier for investigation.",
              "For each individual mobile device, train a time series forecasting model (e.g., SARIMA) on its past 90 days of hourly download volume (`resp_bytes` from `conn.log`). In real-time, generate an anomaly alert if the observed download volume in any given hour exceeds the upper bound of the model's 99% confidence interval. Enrich the alert with the top 5 destination domains from `dns.log` that were active during that anomalous hour."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]