[
  {
    "information_requirement": "Is an adversary attempting to evade our mobile security controls by disabling or modifying security tools? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629.003",
        "name": "Disable or Modify Tools",
        "evidence": [
          {
            "description": "A log entry from an MDM/UEM platform explicitly recording that the device administrator privilege for an application on the mandatory security tools list has been revoked, or that an application not on the approved administrator list has been granted this privilege.",
            "data_sources": [
              "MDM.DeviceAdministrator.ChangeEvents",
              "UEM.Compliance.StateChanges"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM management console, SIEM platform aggregating MDM/UEM logs, managed Android and iOS devices",
            "action": [
              "Create a symbolic logic rule in the SIEM to generate a high-severity alert by querying MDM/UEM logs where (event_type = 'device_admin_revoked' AND app_name IN [required_security_tools_list]) OR (event_type = 'device_admin_granted' AND app_name NOT IN [approved_admin_apps_list]).",
              "For each device, calculate the hourly count of device administrator change events. Establish a 30-day rolling baseline (mean and standard deviation) for this count per device. Generate a medium-severity alert when a device's hourly count exceeds its baseline mean by more than three standard deviations, indicating an abnormal frequency of administrative modifications.",
              "Deploy a pre-trained classification model (e.g., Random Forest) that ingests device administrator change events in real-time. Use features such as application name, application developer, installation source (e.g., App Store, Sideloaded), time of day, and device compliance history. Events classified as 'malicious' with a confidence score greater than 0.9 should trigger a critical alert and an automated device quarantine action via MDM API integration."
            ]
          },
          {
            "description": "An explicit event log from an MTD management console indicating an agent's status is 'disabled', 'tampered', or 'stopped', OR a complete cessation of agent health telemetry from a device for a time period that exceeds a statistically defined baseline.",
            "data_sources": [
              "MTD.Agent.StatusEvents",
              "MTD.Agent.HeartbeatLogs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MTD management console, SIEM platform, corporate network egress points (for Zeek analysis), managed mobile device fleet",
            "action": [
              "Create a SIEM rule to generate a high-severity alert when an MTD log contains a field-value pair such as `agent_status: 'disabled'`, `agent_status: 'stopped'`, or `agent_status: 'tampered'`. Correlate this alert with Zeek conn.log data to confirm a simultaneous lack of traffic from the device's IP to known MTD C2 server IP addresses.",
              "For each device, ingest MTD agent heartbeat logs and calculate the mean and standard deviation of the time delta between heartbeats over a 14-day baseline. Trigger a medium-severity alert if a device fails to check in for a duration exceeding the `mean + (3 * standard_deviation)`. Additionally, monitor Zeek conn.log for connections to MTD C2 servers and alert if the volume of connections from a device drops by more than 90% compared to its 7-day rolling average.",
              "Implement a time-series anomaly detection model (e.g., LSTM) on the aggregate volume of MTD heartbeat data ingested by the SIEM, segmented by device OS. The model learns the normal cyclical patterns of agent telemetry. Generate a high-severity alert when a sudden, statistically significant drop in telemetry volume is detected that deviates from the model's forecast and is not correlated with a known service outage."
            ]
          },
          {
            "description": "A device compliance report from an MDM/UEM or MTD platform for an Android device where the SELinux enforcement status is reported as 'permissive' or 'disabled', which violates the corporate security baseline requiring an 'enforcing' state.",
            "data_sources": [
              "MDM.DeviceCompliance.Reports",
              "MTD.SecurityPosture.Scans"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM and MTD management consoles, SIEM platform, managed Android device fleet",
            "action": [
              "Configure a critical-severity SIEM alert to trigger immediately if any MDM or MTD compliance log for an Android device contains the field-value pair `selinux_status: 'permissive'` or `selinux_status: 'disabled'`. This alert should automatically trigger a device quarantine workflow via MDM/UEM API integration.",
              "On a per-device basis, create a daily string concatenating key security posture settings (e.g., 'enforcing|rooted:false|sideload:false'). Calculate the daily Shannon entropy of this configuration string over a 30-day window. Generate a medium-severity alert if the entropy for a given day spikes above the 98th percentile for that device, indicating an unusual number of simultaneous configuration changes.",
              "Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on a feature set from all managed devices. Features must include one-hot encoded `selinux_status`, `root_status`, `is_sideloading_enabled`, and numeric features like `days_since_last_os_patch` and `count_of_installed_apps`. The model identifies devices that are statistical outliers from the secure fleet baseline. Flag devices with a high anomaly score for Tier 2 analyst investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]